[
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofSan Marino** is a developed free-market economy focused on\nindustries such as tourism, banking, and the manufacture of ceramics,\nclothing, fabrics, furniture, paints, spirits, tiles, and wine. Taken\ntogether, the manufacturing and financial sector make up more than half of the\nnational GDP. The primary sector contribution to the GDP of the country is\nmarginal, with the main agricultural products being wine and cheeses. In\naddition, San Marino sells collectible postage stamps to philatelists.",
    "openai_summarised_points": [
      "• The economy of San Marino is characterized as a developed free-market economy with a focus on several key industries including tourism, banking, and manufacturing.",
      "• The manufacturing sector in San Marino produces a variety of goods such as ceramics, clothing, fabrics, furniture, paints, spirits, tiles, and wine.",
      "• Combined, the manufacturing and financial sectors account for more than half of San Marino’s national Gross Domestic Product (GDP).",
      "• The primary sector, which includes agriculture, contributes only marginally to the overall GDP of San Marino.",
      "• The main agricultural products of San Marino are wine and cheeses, reflecting the limited but specialized nature of its primary sector.",
      "• Additionally, San Marino generates revenue by selling collectible postage stamps to philatelists, indicating a niche market within its economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:47.308034",
      "openai_model": "gpt-4.1-mini",
      "content_length": 512,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "San Marino's per-capita GDP stands at almost $53,000 in 2023, placing the\ncountry 17th in the world. Overall, the per capita level of output and\nstandard of living is comparable to the richest regions of Italy. Most of the\nfood, water, and other raw resources are imported from Italy, including also\nthe totality of electricity and natural gas. Taxes, especially on labor and\ncapital income, are generally much lower than in Italy, therefore, there are\nextremely strict requirements to obtain citizenship.\n\nFollowing the global recession of 2007–2008, San Marino's economy contracted\nconsiderably, especially in the finance and banking sector. As a result, GDP\ndecreased by 40% between 2008 and 2019, and unemployment, which was\npractically nonexistent until 2007, arose to around 5–8 % in the years\nfollowing the great recession. During the same period, banks' deposits\nplummeted, going from almost 14 billion euros in 2008 to 5.2 billion. An\nimportant liquidity crisis followed suit, also made worse by the absence of a\nlender of last resort, as San Marino is not part of the European Union. As a\nconsequence of these events, several banks have been bailed-out by the\ngovernment, including Cassa di Risparmio, the main bank of the country. Still,\nthe banking system remains weak, with balance sheets that are impaired by Non-\nPerforming Loans, which amount to 114% of the country's GDP.\n\nThe country is shifting away from an economic model typical of tax havens,\nreliant on banks and tax secrecy. Major steps in this direction were taken in\n2010 with the abolition of anonymous companies and in 2017 with the abolition\nof banking secrecy. Currently, San Marino actively cooperates with\ninternational organizations, especially the Council of Europe and the European\nUnion, for what regards fighting against money laundering and terrorism\nfinancing. As a result, San Marino was removed from the Italian blacklist of\ntax havens in 2014, and from that of Ecofin in 2017.",
    "openai_summarised_points": [
      "• In 2023, San Marino's per-capita GDP is nearly $53,000, ranking the country 17th globally in terms of per capita income.",
      "• The standard of living and per capita output in San Marino are comparable to the wealthiest regions of Italy.",
      "• The country imports most of its food, water, and raw materials from Italy, including 100% of its electricity and natural gas supplies.",
      "• Taxation on labor and capital income in San Marino is significantly lower than in Italy, which is accompanied by very stringent citizenship acquisition requirements.",
      "• The global recession of 2007–2008 caused a substantial contraction in San Marino’s economy, particularly affecting the finance and banking sectors.",
      "• Between 2008 and 2019, San Marino’s GDP declined by 40%, reflecting the prolonged economic downturn.",
      "• Unemployment, which was nearly nonexistent before 2007, rose to approximately 5–8% in the years following the global recession.",
      "• Bank deposits in San Marino fell sharply from nearly 14 billion euros in 2008 to 5.2 billion euros in subsequent years.",
      "• The country experienced a severe liquidity crisis exacerbated by the lack of a lender of last resort, as San Marino is not a member of the European Union.",
      "• The government intervened with bailouts for several banks, including Cassa di Risparmio, the country’s principal banking institution.",
      "• Despite government support, the banking sector remains fragile, with Non-Performing Loans (NPLs) totaling 114% of San Marino’s GDP, indicating significant financial distress.",
      "• San Marino is transitioning away from an economic model characteristic of tax havens, which previously relied heavily on banking secrecy and tax advantages.",
      "• Key reforms include the abolition of anonymous companies in 2010 and the elimination of banking secrecy in 2017.",
      "• The country actively collaborates with international bodies such as the Council of Europe and the European Union to combat money laundering and terrorism financing.",
      "• Due to these reforms and cooperation efforts, San Marino was removed from the Italian blacklist of tax havens in 2014.",
      "• Subsequently, San Marino was also removed from the Ecofin blacklist of tax havens in 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:52.941982",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1968,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Public finances",
    "text": "In the years preceding the great recession, San Marino's public finances were\nin very good shape, with a central government budget surplus and no national\ndebt. During the global downturn, the government adopted measures to dampen\nthe shock on the real economy and to bail out financial institutions, which\ncame at a high price for the soundness of public finances. The official\nestimates place government debt at 32% of GDP in 2020, however, the actual\nvalue is equal to 86% according to the International Monetary Fund, which\ntakes a broader view in considering government's liabilities.\n\nWhile San Marino does not issue public debt securities that are traded on\nfinancial markets, its creditworthiness is monitored by the rating agency\nFitch. The current rating of BB+ is the result of several downgrades that\noccurred during and after the great recession: from AA to A in 2009 and to BBB\nin 2016.",
    "openai_summarised_points": [
      "• Prior to the global financial crisis known as the great recession, San Marino maintained very strong public finances characterized by a central government budget surplus and the absence of any national debt.",
      "• In response to the economic downturn caused by the global recession, the San Marino government implemented various measures aimed at mitigating the impact on the real economy and providing financial support to banking institutions, which significantly compromised the robustness of public finances.",
      "• Official government estimates reported San Marino's public debt at 32% of GDP in the year 2020; however, the International Monetary Fund (IMF), employing a more comprehensive assessment of government liabilities, estimated the actual debt level to be substantially higher at 86% of GDP.",
      "• San Marino does not issue publicly traded debt securities on financial markets, distinguishing its public finance structure from many other nations.",
      "• The creditworthiness of San Marino is evaluated by the international rating agency Fitch Ratings, which has progressively downgraded the country's credit rating over time.",
      "• Fitch Ratings assigned San Marino a current credit rating of BB+, reflecting a series of downgrades that began during the great recession, including a drop from AA to A in 2009 and a further downgrade to BBB in 2016."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:48.790166",
      "openai_model": "gpt-4.1-mini",
      "content_length": 900,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Economic relations with Italy and the EU",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( December 2023)__(Learn how and when to remove this message)_\n---|---\n\nIn the years following the Italian unification of 1861, several treaties were\nsigned between San Marino and the newborn Kingdom of Italy. The first such\ntreaty addressing economic issues was signed in 1865 for the introduction of\nthe Sammarinese lira, which was equivalent to the Italian lira and fully\nrecognized as a legal tender in both countries. Probably the most important\nagreement is the convention of friendship and good neighborhood that was\nsigned in 1939, during fascism. This treaty establishes a customs union with\nItaly and sets out some limitations on the carrying out of certain economic\nactivities, like tobacco cultivation, gambling, and radio broadcasting.\n\nWhile San Marino is not part of the European Union, it had a customs union\nwith it since 1991, and there is an open border between the two areas. San\nMarino also uses the Euro as its currency since 2000, when an agreement was\nsigned with Italy, on behalf of the EU. A new monetary convention was signed\nin 2012 directly with the EU, covering a wider range of financial and monetary\nissues. San Marino is also allowed to mint Sammarinese Euro coins, which are\nprinted by the Italian mint in Rome but feature a different national design\nthan Italian Euro coins. Since they are minted in a very limited amount, they\nare rare and highly appreciated by coin collectors.\n\nThe main commercial partner of San Marino is Italy, with which around 88% of\nexports and 78% of imports take place (2017). Other important partners are the\nother countries of the EU, especially France and Germany.",
    "openai_summarised_points": [
      "• Following the Italian unification of 1861, San Marino and the Kingdom of Italy signed several treaties addressing economic relations between the two states.",
      "• In 1865, the first treaty concerning economic issues was signed, introducing the Sammarinese lira, which was equivalent in value to the Italian lira and recognized as legal tender in both San Marino and Italy.",
      "• The most significant agreement in their economic relationship is the 1939 convention of friendship and good neighborhood, signed during the fascist period in Italy.",
      "• The 1939 treaty established a customs union between San Marino and Italy and imposed certain restrictions on specific economic activities within San Marino, including tobacco cultivation, gambling, and radio broadcasting.",
      "• Although San Marino is not a member of the European Union, it has maintained a customs union with the EU since 1991, facilitating an open border between San Marino and EU territories.",
      "• Since 2000, San Marino has used the Euro as its official currency, following an agreement signed with Italy acting on behalf of the European Union.",
      "• In 2012, San Marino signed a new monetary convention directly with the EU, expanding the scope of financial and monetary cooperation beyond the previous agreements.",
      "• Under these agreements, San Marino is authorized to mint its own Euro coins, which are produced by the Italian mint in Rome but feature unique national designs distinct from Italian Euro coins.",
      "• Sammarinese Euro coins are minted in limited quantities, making them rare and highly valued by numismatists and coin collectors worldwide.",
      "• Italy remains San Marino’s principal commercial partner, accounting for approximately 88% of San Marino’s exports and 78% of its imports as of 2017.",
      "• Other significant trading partners for San Marino include other European Union countries, particularly France and Germany."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:53.968719",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1799,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in San\nMarino is Retail Trade with 756 companies followed by Wholesale Trade and\nServices with 753 and 752 companies respectively.",
    "openai_summarised_points": [
      "• In 2022, the sector with the highest number of companies registered in San Marino was Retail Trade, comprising 756 companies.",
      "• The Wholesale Trade sector was the second largest in terms of company registrations in San Marino in 2022, with a total of 753 companies.",
      "• The Services sector ranked third in the number of registered companies in San Marino in 2022, with 752 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:45.362858",
      "openai_model": "gpt-4.1-mini",
      "content_length": 198,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Coins and stamps",
    "text": "One of the sources of income from tourism comes from the sale of historic\ncoins and stamps. In 1894, San Marino issued the first commemorative stamps\nand since then that has been part of a large livelihood in the republic. All\n10 of the Post Offices of San Marino sell these stamps and collectible coins,\nincluding \"Legal Gold Tender Coins\".\n\nTraditional economic activities in San Marino were food crops, sheep farming,\nand stone quarrying. Today farming activities focus on grain, vines, and\norchards, as well as animal husbandry (cattle and swine).",
    "openai_summarised_points": [
      "• One significant source of income from tourism in San Marino derives from the sale of historic coins and stamps.",
      "• San Marino issued its first commemorative stamps in 1894, marking the beginning of a substantial and ongoing economic activity centered on philately and numismatics within the republic.",
      "• All 10 Post Offices in San Marino participate in the sale of these commemorative stamps and collectible coins, which include \"Legal Gold Tender Coins,\" contributing to the local economy.",
      "• Historically, San Marino’s traditional economic activities comprised food crop cultivation, sheep farming, and stone quarrying.",
      "• In contemporary times, agricultural practices in San Marino have shifted focus toward the production of grain, cultivation of vines and orchards, and animal husbandry involving cattle and swine."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:46.387748",
      "openai_model": "gpt-4.1-mini",
      "content_length": 551,
      "bullet_points_count": 5
    }
  }
]