[
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofSan Marino** is a developed free-market economy focused on\nindustries such as tourism, banking, and the manufacture of ceramics,\nclothing, fabrics, furniture, paints, spirits, tiles, and wine. Taken\ntogether, the manufacturing and financial sector make up more than half of the\nnational GDP. The primary sector contribution to the GDP of the country is\nmarginal, with the main agricultural products being wine and cheeses. In\naddition, San Marino sells collectible postage stamps to philatelists.",
    "openai_summarised_points": [
      "• The economy of San Marino is characterized as a developed free-market economy with a focus on several key industries including tourism, banking, and manufacturing.",
      "• The manufacturing sector in San Marino produces a variety of goods such as ceramics, clothing, fabrics, furniture, paints, spirits, tiles, and wine.",
      "• Combined, the manufacturing and financial sectors account for more than half of San Marino’s national Gross Domestic Product (GDP).",
      "• The primary sector, which includes agriculture, contributes only marginally to the overall GDP of San Marino.",
      "• The main agricultural products of San Marino are wine and cheeses, reflecting the limited but specialized nature of its primary sector.",
      "• Additionally, San Marino generates revenue by selling collectible postage stamps to philatelists, indicating a niche market within its economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:47.308034",
      "openai_model": "gpt-4.1-mini",
      "content_length": 512,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "The economy of San Marino is classified as a developed free-market system, distinguished by its reliance on a diverse range of industries that collectively sustain its economic vitality. Among these, tourism, banking, and manufacturing stand out as the principal sectors driving economic activity. Tourism plays a significant role due to San Marino’s historical heritage, picturesque landscapes, and status as one of the world’s smallest republics, attracting visitors who contribute substantially to local revenue. The banking sector complements this by providing financial services that cater not only to domestic needs but also to international clients, thereby reinforcing the country’s position as a modest financial hub. Manufacturing, meanwhile, encompasses a broad spectrum of products, reflecting the adaptability and resourcefulness of the country’s industrial base. The manufacturing industry in San Marino is notably diverse, producing an array of goods that range from traditional artisanal items to more industrial products. Ceramics form an important part of this sector, with local artisans creating both functional and decorative pieces that often draw on the region’s cultural heritage. The textile industry contributes through the production of clothing and fabrics, which may include both locally designed garments and materials used for export. Furniture manufacturing also holds a place in the economy, emphasizing craftsmanship and quality in the production of household and office furnishings. Additionally, the production of paints and spirits indicates a level of chemical and beverage manufacturing, respectively, while the creation of tiles serves both domestic construction needs and export markets. Wine production is particularly noteworthy, as it ties into the agricultural traditions of the region and supports both local consumption and tourism-related sales. Collectively, these manufacturing activities demonstrate the sector’s capacity to generate employment and contribute significantly to San Marino’s economic output. When considering the overall economic composition, the manufacturing and financial sectors together account for more than half of San Marino’s national Gross Domestic Product (GDP). This substantial contribution underscores the importance of these industries in sustaining the country’s economic stability and growth. The financial sector, bolstered by banking and related services, provides essential infrastructure for both personal and corporate financial management, while manufacturing’s diverse product base ensures a steady flow of goods for domestic use and international trade. The synergy between these sectors helps to mitigate economic volatility and supports the republic’s relatively high standard of living. In contrast to the prominence of manufacturing and finance, the primary sector, which encompasses agriculture, contributes only marginally to San Marino’s overall GDP. This limited role is largely due to the country’s small geographic size and mountainous terrain, which restrict the extent of arable land and large-scale farming operations. Despite these constraints, agriculture remains a specialized and culturally significant activity within the republic. The main agricultural outputs are wine and cheeses, products that align with traditional Mediterranean farming practices and local culinary preferences. Viticulture benefits from the favorable climate and soil conditions found in certain parts of San Marino, allowing for the cultivation of grape varieties suited to producing distinctive wines. Cheese production, often artisanal in nature, complements this by utilizing local dairy resources to create products that are both consumed domestically and appreciated by visitors. Beyond these conventional economic activities, San Marino also generates revenue through the sale of collectible postage stamps, a niche market that appeals to philatelists worldwide. The issuance of stamps with unique designs, commemorative themes, and limited editions has become a notable source of income, leveraging the global interest in stamp collecting. This practice not only provides a supplementary financial stream but also serves to promote San Marino’s cultural identity and historical narratives on an international stage. The philatelic market thus represents an innovative facet of the country’s economy, illustrating how small states can capitalize on specialized opportunities to enhance their fiscal resources. Overall, San Marino’s economy is characterized by a well-developed free-market system that balances traditional industries with modern financial services. The manufacturing sector’s production of ceramics, clothing, fabrics, furniture, paints, spirits, tiles, and wine forms a substantial part of the economic landscape, while the financial sector’s banking services contribute significantly to national wealth. Although agriculture plays a minor role in terms of GDP, its focus on wine and cheese production reflects the country’s cultural heritage and agricultural specialization. The sale of collectible postage stamps further diversifies the economy, highlighting San Marino’s ability to exploit unique avenues for revenue generation. Together, these elements compose a multifaceted economic structure that supports the republic’s prosperity and resilience.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:21.428593",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 5361,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "San Marino's per-capita GDP stands at almost $53,000 in 2023, placing the\ncountry 17th in the world. Overall, the per capita level of output and\nstandard of living is comparable to the richest regions of Italy. Most of the\nfood, water, and other raw resources are imported from Italy, including also\nthe totality of electricity and natural gas. Taxes, especially on labor and\ncapital income, are generally much lower than in Italy, therefore, there are\nextremely strict requirements to obtain citizenship.\n\nFollowing the global recession of 2007–2008, San Marino's economy contracted\nconsiderably, especially in the finance and banking sector. As a result, GDP\ndecreased by 40% between 2008 and 2019, and unemployment, which was\npractically nonexistent until 2007, arose to around 5–8 % in the years\nfollowing the great recession. During the same period, banks' deposits\nplummeted, going from almost 14 billion euros in 2008 to 5.2 billion. An\nimportant liquidity crisis followed suit, also made worse by the absence of a\nlender of last resort, as San Marino is not part of the European Union. As a\nconsequence of these events, several banks have been bailed-out by the\ngovernment, including Cassa di Risparmio, the main bank of the country. Still,\nthe banking system remains weak, with balance sheets that are impaired by Non-\nPerforming Loans, which amount to 114% of the country's GDP.\n\nThe country is shifting away from an economic model typical of tax havens,\nreliant on banks and tax secrecy. Major steps in this direction were taken in\n2010 with the abolition of anonymous companies and in 2017 with the abolition\nof banking secrecy. Currently, San Marino actively cooperates with\ninternational organizations, especially the Council of Europe and the European\nUnion, for what regards fighting against money laundering and terrorism\nfinancing. As a result, San Marino was removed from the Italian blacklist of\ntax havens in 2014, and from that of Ecofin in 2017.",
    "openai_summarised_points": [
      "• In 2023, San Marino's per-capita GDP is nearly $53,000, ranking the country 17th globally in terms of per capita income.",
      "• The standard of living and per capita output in San Marino are comparable to the wealthiest regions of Italy.",
      "• The country imports most of its food, water, and raw materials from Italy, including 100% of its electricity and natural gas supplies.",
      "• Taxation on labor and capital income in San Marino is significantly lower than in Italy, which is accompanied by very stringent citizenship acquisition requirements.",
      "• The global recession of 2007–2008 caused a substantial contraction in San Marino’s economy, particularly affecting the finance and banking sectors.",
      "• Between 2008 and 2019, San Marino’s GDP declined by 40%, reflecting the prolonged economic downturn.",
      "• Unemployment, which was nearly nonexistent before 2007, rose to approximately 5–8% in the years following the global recession.",
      "• Bank deposits in San Marino fell sharply from nearly 14 billion euros in 2008 to 5.2 billion euros in subsequent years.",
      "• The country experienced a severe liquidity crisis exacerbated by the lack of a lender of last resort, as San Marino is not a member of the European Union.",
      "• The government intervened with bailouts for several banks, including Cassa di Risparmio, the country’s principal banking institution.",
      "• Despite government support, the banking sector remains fragile, with Non-Performing Loans (NPLs) totaling 114% of San Marino’s GDP, indicating significant financial distress.",
      "• San Marino is transitioning away from an economic model characteristic of tax havens, which previously relied heavily on banking secrecy and tax advantages.",
      "• Key reforms include the abolition of anonymous companies in 2010 and the elimination of banking secrecy in 2017.",
      "• The country actively collaborates with international bodies such as the Council of Europe and the European Union to combat money laundering and terrorism financing.",
      "• Due to these reforms and cooperation efforts, San Marino was removed from the Italian blacklist of tax havens in 2014.",
      "• Subsequently, San Marino was also removed from the Ecofin blacklist of tax havens in 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:52.941982",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1968,
      "bullet_points_count": 16
    },
    "generated_detailed_content": "In 2023, San Marino's per-capita gross domestic product (GDP) reached nearly $53,000, positioning the country as the 17th highest globally in terms of per capita income. This elevated ranking reflects the microstate’s relatively high economic output per resident, despite its small size and limited natural resources. The standard of living and per capita output in San Marino closely mirror those found in the wealthiest regions of Italy, underscoring the country’s integration with and economic similarities to its larger neighbor. Such parity is evident in the quality of infrastructure, health care, education, and general consumer access to goods and services, all of which contribute to a lifestyle comparable to affluent Italian provinces. San Marino’s economy is heavily dependent on imports, particularly from Italy, which supplies the majority of the country’s food, water, and raw materials. This reliance extends to energy needs as well, with Italy providing 100% of San Marino’s electricity and natural gas supplies. The absence of domestic production in these essential sectors necessitates a robust and stable trade relationship with Italy, ensuring the continuous flow of vital resources. This dependency shapes much of San Marino’s economic policy and infrastructure planning, as the country must maintain favorable terms and logistical arrangements with its neighbor to sustain its population and industries. Taxation policies in San Marino differ markedly from those in Italy, with the country imposing significantly lower taxes on both labor and capital income. This fiscal approach serves as an incentive for investment and business development within the microstate, fostering an environment attractive to entrepreneurs and capital holders. However, this tax advantage is balanced by stringent requirements for acquiring San Marino citizenship, reflecting the government’s cautious approach to demographic and social integration. The strict citizenship criteria help preserve the country’s unique identity and social fabric while managing the potential influx of individuals seeking to benefit from its favorable tax regime. The global recession of 2007–2008 had a profound impact on San Marino’s economy, triggering a substantial contraction that particularly affected the finance and banking sectors. As a country with a significant financial services industry, San Marino was vulnerable to the widespread credit crunch and loss of investor confidence that characterized the global downturn. The ensuing economic shock disrupted banking operations, reduced capital inflows, and led to a sharp decline in economic activity across multiple sectors. This period marked the beginning of a prolonged economic challenge that tested the resilience of San Marino’s financial institutions and broader economy. Between 2008 and 2019, San Marino’s GDP experienced a dramatic decline of approximately 40%, reflecting the extended nature of the economic downturn. This contraction was one of the most severe in the country’s recent history and underscored the difficulties faced in recovering from the global financial crisis. The sustained reduction in economic output affected employment, public finances, and investment, creating a challenging environment for policymakers and businesses alike. The scale of the GDP decline highlighted the need for structural reforms and economic diversification to mitigate future vulnerabilities. Unemployment, which had been nearly nonexistent prior to 2007, rose sharply in the aftermath of the global recession, reaching levels estimated between 5% and 8% in subsequent years. This increase represented a significant shift in the labor market dynamics of San Marino, where traditionally low unemployment rates had been a hallmark of economic stability. The rise in joblessness was largely attributable to the contraction of the finance and banking sectors, as well as reduced demand in other industries reliant on domestic and cross-border consumption. The growing unemployment rate posed social and economic challenges, prompting government initiatives aimed at job creation and workforce retraining. Bank deposits in San Marino saw a precipitous decline following the onset of the financial crisis, falling from nearly 14 billion euros in 2008 to approximately 5.2 billion euros in the years that followed. This sharp reduction in deposits reflected a loss of confidence among depositors, capital flight, and the broader contraction of the financial sector. The diminished deposit base constrained the lending capacity of banks and exacerbated liquidity issues, further complicating efforts to stabilize the banking system. The decline in deposits also signaled the erosion of San Marino’s position as a financial center, necessitating urgent policy responses to restore trust and financial stability. The country faced a severe liquidity crisis during this period, a situation made more acute by the absence of a lender of last resort. Unlike members of the European Union, San Marino does not have access to the European Central Bank or other supranational financial safety nets, leaving its banking system vulnerable to liquidity shocks. This lack of external support mechanisms meant that the government had to intervene directly to prevent systemic collapse, often under challenging fiscal constraints. The liquidity crisis underscored the risks associated with San Marino’s small, open economy and its reliance on a limited number of financial institutions. In response to the banking sector’s distress, the government of San Marino undertook a series of interventions, including bailouts for several banks. Among these was Cassa di Risparmio, the country’s principal banking institution, which required substantial government support to maintain solvency and operational continuity. These bailouts aimed to stabilize the financial system, protect depositors, and prevent a broader economic meltdown. However, the interventions also placed significant strain on public finances and highlighted the systemic importance of the banking sector to San Marino’s overall economic health. Despite government efforts to shore up the banking industry, the sector remained fragile, with Non-Performing Loans (NPLs) reaching an alarming total of 114% of San Marino’s GDP. This extraordinarily high ratio indicated severe financial distress within the banking system, as a large proportion of loans extended by banks were not being repaid on time or were in default. The prevalence of NPLs undermined banks’ profitability and capital adequacy, limiting their ability to extend new credit and support economic growth. Addressing the NPL burden became a central focus of financial sector reform and regulatory oversight in the ensuing years. San Marino embarked on a transition away from an economic model traditionally characteristic of tax havens, which had relied heavily on banking secrecy and tax advantages to attract capital. This shift was motivated by increasing international pressure and the recognition that such a model was unsustainable in the evolving global financial landscape. The country sought to enhance transparency, comply with international standards, and diversify its economic base to ensure long-term stability and legitimacy. This transformation involved comprehensive reforms aimed at dismantling the structures that had previously facilitated secrecy and tax avoidance. Key reforms implemented during this transition included the abolition of anonymous companies in 2010, a measure designed to increase corporate transparency and accountability. This policy change eliminated the ability to establish companies without disclosing beneficial ownership, thereby reducing opportunities for illicit financial activities. Further progress was made with the elimination of banking secrecy in 2017, which opened the financial sector to greater scrutiny and cooperation with foreign authorities. These reforms aligned San Marino’s regulatory framework with international norms and enhanced its reputation as a responsible financial jurisdiction. San Marino actively collaborated with international organizations such as the Council of Europe and the European Union to combat money laundering and the financing of terrorism. This cooperation involved adopting and enforcing rigorous anti-money laundering (AML) and counter-terrorism financing (CTF) measures, including enhanced due diligence, reporting requirements, and information sharing. By aligning its policies with those of major international bodies, San Marino demonstrated its commitment to transparency and the rule of law, thereby improving its standing in the global community. These efforts were instrumental in addressing concerns about the country’s financial sector and fostering cross-border trust. As a result of these reforms and cooperative initiatives, San Marino was removed from the Italian blacklist of tax havens in 2014. This removal signified recognition by Italy that San Marino had made substantial progress in meeting international standards on taxation and financial transparency. The delisting helped to restore confidence among investors and trading partners, facilitating improved economic relations. Subsequently, San Marino was also removed from the Ecofin blacklist of tax havens in 2017, further affirming its successful transition away from the tax haven model and its integration into the broader European financial regulatory framework. These developments marked important milestones in San Marino’s economic evolution and international standing.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:32.170640",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 16,
      "generated_content_length": 9605,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Public finances",
    "text": "In the years preceding the great recession, San Marino's public finances were\nin very good shape, with a central government budget surplus and no national\ndebt. During the global downturn, the government adopted measures to dampen\nthe shock on the real economy and to bail out financial institutions, which\ncame at a high price for the soundness of public finances. The official\nestimates place government debt at 32% of GDP in 2020, however, the actual\nvalue is equal to 86% according to the International Monetary Fund, which\ntakes a broader view in considering government's liabilities.\n\nWhile San Marino does not issue public debt securities that are traded on\nfinancial markets, its creditworthiness is monitored by the rating agency\nFitch. The current rating of BB+ is the result of several downgrades that\noccurred during and after the great recession: from AA to A in 2009 and to BBB\nin 2016.",
    "openai_summarised_points": [
      "• Prior to the global financial crisis known as the great recession, San Marino maintained very strong public finances characterized by a central government budget surplus and the absence of any national debt.",
      "• In response to the economic downturn caused by the global recession, the San Marino government implemented various measures aimed at mitigating the impact on the real economy and providing financial support to banking institutions, which significantly compromised the robustness of public finances.",
      "• Official government estimates reported San Marino's public debt at 32% of GDP in the year 2020; however, the International Monetary Fund (IMF), employing a more comprehensive assessment of government liabilities, estimated the actual debt level to be substantially higher at 86% of GDP.",
      "• San Marino does not issue publicly traded debt securities on financial markets, distinguishing its public finance structure from many other nations.",
      "• The creditworthiness of San Marino is evaluated by the international rating agency Fitch Ratings, which has progressively downgraded the country's credit rating over time.",
      "• Fitch Ratings assigned San Marino a current credit rating of BB+, reflecting a series of downgrades that began during the great recession, including a drop from AA to A in 2009 and a further downgrade to BBB in 2016."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:48.790166",
      "openai_model": "gpt-4.1-mini",
      "content_length": 900,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "Prior to the onset of the global financial crisis commonly referred to as the Great Recession, San Marino’s public finances were characterized by remarkable strength and stability. The central government consistently maintained a budget surplus, reflecting prudent fiscal management and a balanced approach to revenue and expenditure. This fiscal discipline was complemented by the complete absence of any national debt, allowing the country to operate without the burden of interest payments or external borrowing costs. Such a financial position was indicative of San Marino’s cautious economic policies and its ability to generate sufficient revenue streams, primarily through taxation and other government income sources, to cover all public spending needs. This fiscal health provided the government with a strong buffer against economic shocks and positioned San Marino as a model of sound public finance management in the pre-crisis period. However, the advent of the Great Recession in the late 2000s introduced significant challenges that undermined this previously robust fiscal framework. The global economic downturn precipitated a contraction in economic activity, which in turn affected San Marino’s real economy through reduced trade, investment, and financial sector performance. In response, the government implemented a series of countercyclical measures designed to mitigate the recession’s adverse effects. These interventions included fiscal stimulus packages aimed at supporting domestic demand and targeted financial assistance to the banking sector, which faced liquidity pressures and increased risk exposure during the crisis. While these measures were necessary to stabilize the economy and preserve financial system integrity, they came at a considerable fiscal cost. The government’s budget surplus quickly dissipated, and public finances weakened as expenditures increased and revenues declined. This shift marked a departure from the previously strong fiscal position and introduced new vulnerabilities into San Marino’s public finance structure. By 2020, official government estimates indicated that San Marino’s public debt had risen to approximately 32% of gross domestic product (GDP). This figure, while representing a significant increase from the pre-crisis zero-debt status, suggested a manageable level of indebtedness within conventional fiscal parameters. However, assessments by the International Monetary Fund (IMF) painted a more concerning picture. Employing a more comprehensive methodology that accounted for contingent liabilities, off-balance-sheet obligations, and other forms of government commitments not captured in the official statistics, the IMF estimated that San Marino’s actual public debt level was substantially higher, reaching around 86% of GDP. This discrepancy highlighted the complexities inherent in measuring public debt accurately, especially in small economies with intricate financial arrangements and guarantees extended to the banking sector. The IMF’s broader assessment underscored the increased fiscal risks facing San Marino and the potential challenges in maintaining sustainable public finances in the context of economic recovery efforts and ongoing financial sector vulnerabilities. Distinct from many other sovereign states, San Marino does not issue publicly traded debt securities on international or domestic financial markets. This absence of marketable government bonds reflects the country’s unique approach to public finance management and its relatively small size and economic scale. Instead, the government relies on internal financing mechanisms, including domestic banking sector support and other forms of non-market borrowing, to meet its funding requirements. The lack of publicly traded debt instruments limits the government’s exposure to market volatility and investor sentiment but also constrains its ability to access diverse sources of capital and benchmark borrowing costs. This structural characteristic shapes the overall dynamics of San Marino’s public debt management and influences the country’s interactions with international financial institutions and credit rating agencies. San Marino’s creditworthiness is subject to evaluation by Fitch Ratings, one of the major international credit rating agencies. Fitch’s assessments provide an independent appraisal of the country’s ability to meet its financial obligations and serve as a key reference point for investors, policymakers, and international partners. Over time, Fitch has progressively downgraded San Marino’s credit rating, reflecting evolving perceptions of the country’s fiscal and economic challenges. The initial downgrade occurred during the Great Recession when Fitch lowered the rating from a high investment-grade level of AA to A in 2009. This downgrade acknowledged the deteriorating fiscal position and increased economic risks associated with the global crisis and San Marino’s policy responses. Subsequent assessments continued to reflect concerns about fiscal sustainability, economic growth prospects, and financial sector vulnerabilities. By 2016, Fitch further downgraded San Marino’s credit rating to BBB, signaling a continued erosion of credit quality and heightened risk factors. This rating remained within the investment-grade category but indicated that the country faced moderate credit risk and required careful fiscal management to avoid further deterioration. More recently, Fitch assigned San Marino a credit rating of BB+, which falls into the non-investment grade or speculative category. This latest rating reflects the cumulative effect of fiscal pressures, elevated debt levels, and structural economic challenges that have persisted since the Great Recession. The BB+ rating suggests that while San Marino is not currently at immediate risk of default, it faces significant vulnerabilities that could affect its borrowing costs and access to financial markets. Fitch’s rating trajectory underscores the ongoing need for prudent fiscal policies, structural reforms, and economic diversification to restore and maintain the country’s creditworthiness over the medium to long term.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:20.292817",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 6185,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Economic relations with Italy and the EU",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( December 2023)__(Learn how and when to remove this message)_\n---|---\n\nIn the years following the Italian unification of 1861, several treaties were\nsigned between San Marino and the newborn Kingdom of Italy. The first such\ntreaty addressing economic issues was signed in 1865 for the introduction of\nthe Sammarinese lira, which was equivalent to the Italian lira and fully\nrecognized as a legal tender in both countries. Probably the most important\nagreement is the convention of friendship and good neighborhood that was\nsigned in 1939, during fascism. This treaty establishes a customs union with\nItaly and sets out some limitations on the carrying out of certain economic\nactivities, like tobacco cultivation, gambling, and radio broadcasting.\n\nWhile San Marino is not part of the European Union, it had a customs union\nwith it since 1991, and there is an open border between the two areas. San\nMarino also uses the Euro as its currency since 2000, when an agreement was\nsigned with Italy, on behalf of the EU. A new monetary convention was signed\nin 2012 directly with the EU, covering a wider range of financial and monetary\nissues. San Marino is also allowed to mint Sammarinese Euro coins, which are\nprinted by the Italian mint in Rome but feature a different national design\nthan Italian Euro coins. Since they are minted in a very limited amount, they\nare rare and highly appreciated by coin collectors.\n\nThe main commercial partner of San Marino is Italy, with which around 88% of\nexports and 78% of imports take place (2017). Other important partners are the\nother countries of the EU, especially France and Germany.",
    "openai_summarised_points": [
      "• Following the Italian unification of 1861, San Marino and the Kingdom of Italy signed several treaties addressing economic relations between the two states.",
      "• In 1865, the first treaty concerning economic issues was signed, introducing the Sammarinese lira, which was equivalent in value to the Italian lira and recognized as legal tender in both San Marino and Italy.",
      "• The most significant agreement in their economic relationship is the 1939 convention of friendship and good neighborhood, signed during the fascist period in Italy.",
      "• The 1939 treaty established a customs union between San Marino and Italy and imposed certain restrictions on specific economic activities within San Marino, including tobacco cultivation, gambling, and radio broadcasting.",
      "• Although San Marino is not a member of the European Union, it has maintained a customs union with the EU since 1991, facilitating an open border between San Marino and EU territories.",
      "• Since 2000, San Marino has used the Euro as its official currency, following an agreement signed with Italy acting on behalf of the European Union.",
      "• In 2012, San Marino signed a new monetary convention directly with the EU, expanding the scope of financial and monetary cooperation beyond the previous agreements.",
      "• Under these agreements, San Marino is authorized to mint its own Euro coins, which are produced by the Italian mint in Rome but feature unique national designs distinct from Italian Euro coins.",
      "• Sammarinese Euro coins are minted in limited quantities, making them rare and highly valued by numismatists and coin collectors worldwide.",
      "• Italy remains San Marino’s principal commercial partner, accounting for approximately 88% of San Marino’s exports and 78% of its imports as of 2017.",
      "• Other significant trading partners for San Marino include other European Union countries, particularly France and Germany."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:53.968719",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1799,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "Following the Italian unification in 1861, San Marino and the newly established Kingdom of Italy embarked on a series of diplomatic negotiations that culminated in several treaties addressing the economic relations between the two states. These early agreements laid the foundation for a close and interdependent economic partnership, reflecting San Marino’s unique position as a microstate entirely surrounded by Italian territory. The first major treaty concerning economic matters was signed in 1865, marking a significant milestone in the monetary integration of the two countries. This treaty introduced the Sammarinese lira, a currency equivalent in value to the Italian lira, which was officially recognized as legal tender in both San Marino and Italy. The adoption of the Sammarinese lira facilitated trade and financial transactions between the two states by eliminating currency exchange barriers and fostering economic stability within the region. The most consequential agreement in the economic relationship between San Marino and Italy was the 1939 convention of friendship and good neighborhood, signed during the fascist regime in Italy. This treaty represented a formalization of the close ties between the two countries and underscored Italy’s influence over San Marino’s economic policies during that period. One of the key provisions of the 1939 treaty was the establishment of a customs union between San Marino and Italy, which effectively integrated San Marino’s customs territory with that of Italy. This customs union allowed for the free movement of goods across the border without customs duties or restrictions, thereby enhancing trade flows and economic cooperation. However, the treaty also imposed certain restrictions on specific economic activities within San Marino, including the cultivation of tobacco, the operation of gambling establishments, and the broadcasting of radio signals. These limitations reflected Italy’s desire to regulate and control sectors of economic activity that were considered sensitive or strategically important. Despite San Marino’s status as an independent republic, it has never been a member of the European Union. Nevertheless, since 1991, San Marino has maintained a customs union with the EU, which has further facilitated economic integration with European markets. This customs union has been instrumental in enabling an open border between San Marino and EU territories, allowing for the unhindered flow of goods and services. The arrangement has contributed to San Marino’s economic development by providing access to the vast EU single market while allowing the microstate to retain its sovereignty and regulatory autonomy in other areas. The customs union with the EU also necessitated the alignment of certain regulatory standards and customs procedures, ensuring compatibility with EU policies and facilitating smoother trade relations. In terms of monetary policy, San Marino has utilized the Euro as its official currency since the year 2000. This transition was made possible by an agreement signed with Italy, which acted on behalf of the European Union to formalize the currency arrangement. The adoption of the Euro replaced the Sammarinese lira and integrated San Marino’s monetary system with that of the Eurozone, thereby eliminating currency exchange risks and reducing transaction costs for businesses and consumers. This monetary alignment has been crucial for San Marino’s economy, given its close economic ties with Italy and the broader European market. The use of the Euro also enhanced San Marino’s financial stability and facilitated cross-border investment and tourism. In 2012, San Marino further deepened its financial and monetary cooperation with the European Union by signing a new monetary convention directly with the EU. This agreement expanded the scope of collaboration beyond the previous arrangements, encompassing a broader range of financial and monetary issues. The 2012 convention provided a legal framework for the issuance of Euro coins by San Marino and established mechanisms for regulatory oversight and compliance with EU standards. This development reflected San Marino’s commitment to maintaining a transparent and cooperative relationship with the EU, despite its non-member status. The convention also underscored the importance of San Marino’s integration into the European financial system and its adherence to international monetary norms. Under the terms of these agreements, San Marino is authorized to mint its own Euro coins, which are produced by the Italian mint located in Rome. These coins feature unique national designs that distinguish them from Italian Euro coins, showcasing San Marino’s cultural heritage and national identity. The production of Sammarinese Euro coins is strictly regulated and limited in quantity, ensuring their exclusivity and rarity. As a result, these coins have become highly prized by numismatists and coin collectors worldwide, who value them for their distinctive designs and limited availability. The issuance of national Euro coins allows San Marino to maintain a visible presence within the Eurozone despite its small size and political independence. Italy continues to be San Marino’s principal commercial partner, reflecting the enduring economic interdependence between the two countries. As of 2017, approximately 88% of San Marino’s exports were destined for Italy, while 78% of its imports originated from Italian markets. This dominant trade relationship highlights Italy’s central role in San Marino’s economy, providing essential goods, services, and markets for Sammarinese products. The geographic proximity and shared cultural ties further reinforce this economic bond. In addition to Italy, other European Union countries also represent significant trading partners for San Marino, with France and Germany being particularly important. These countries contribute to the diversification of San Marino’s trade portfolio, offering access to broader European markets and opportunities for economic growth beyond its immediate neighborhood. The trade relationships with France, Germany, and other EU member states complement San Marino’s economic strategy by fostering international cooperation and integration within the European economic space.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:24.801455",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 6323,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in San\nMarino is Retail Trade with 756 companies followed by Wholesale Trade and\nServices with 753 and 752 companies respectively.",
    "openai_summarised_points": [
      "• In 2022, the sector with the highest number of companies registered in San Marino was Retail Trade, comprising 756 companies.",
      "• The Wholesale Trade sector was the second largest in terms of company registrations in San Marino in 2022, with a total of 753 companies.",
      "• The Services sector ranked third in the number of registered companies in San Marino in 2022, with 752 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:45.362858",
      "openai_model": "gpt-4.1-mini",
      "content_length": 198,
      "bullet_points_count": 3
    },
    "generated_detailed_content": "In 2022, the retail trade sector emerged as the most prominent industry in terms of company registrations within San Marino, accounting for a total of 756 registered enterprises. This sector's dominance reflects the microstate's economic orientation toward consumer goods and local commerce, which caters both to residents and the steady influx of tourists attracted by San Marino’s unique cultural and historical offerings. The prevalence of retail businesses underscores the importance of small and medium-sized enterprises in the country’s economy, as many of these companies operate in specialized niches ranging from fashion and electronics to food and beverage outlets. The substantial number of retail companies also highlights the sector’s role as a key employer and contributor to the domestic market’s vibrancy. Closely following the retail trade sector, the wholesale trade segment held the position of the second largest industry by company registrations in San Marino in 2022, with 753 companies officially recorded. Wholesale trade serves as a critical intermediary function within the national economy, facilitating the distribution of goods from producers and importers to retailers and other commercial entities. The near parity in the number of wholesale and retail companies illustrates the integrated nature of San Marino’s trade infrastructure, where a robust network of wholesalers supports the retail sector’s diverse offerings. This sector’s vitality is also indicative of San Marino’s strategic role as a commercial hub in the region, leveraging its advantageous geographic location and favorable regulatory environment to attract businesses engaged in the large-scale movement of goods. The services sector ranked third in the number of registered companies in San Marino in 2022, with 752 enterprises contributing to the country’s economic landscape. This sector encompasses a broad range of activities, including professional services, financial services, tourism-related services, and various personal and business support functions. The substantial presence of service-oriented companies reflects San Marino’s transition towards a more diversified economy, where intangible assets such as expertise, consultancy, and hospitality play an increasingly significant role. The services sector’s size and diversity demonstrate its capacity to complement the trade sectors by providing essential support that enhances overall economic efficiency and competitiveness. Moreover, the growth of service companies aligns with global trends emphasizing knowledge-based industries and the importance of service delivery in modern economies. Together, these three sectors—retail trade, wholesale trade, and services—constituted the backbone of San Marino’s corporate landscape in 2022, collectively representing a significant portion of the country’s registered businesses. The close numerical proximity of companies in each sector, with retail trade leading at 756 companies, wholesale trade following closely with 753, and services at 752, highlights a balanced economic structure that supports both goods distribution and service provision. This equilibrium suggests a well-rounded economic environment where commerce and services coexist, fostering resilience and adaptability in the face of evolving market conditions. The data from 2022 thus provides a snapshot of San Marino’s economic composition, illustrating the interplay between traditional trade activities and the expanding service economy that together drive the microstate’s development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:15.278082",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 3,
      "generated_content_length": 3568,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Coins and stamps",
    "text": "One of the sources of income from tourism comes from the sale of historic\ncoins and stamps. In 1894, San Marino issued the first commemorative stamps\nand since then that has been part of a large livelihood in the republic. All\n10 of the Post Offices of San Marino sell these stamps and collectible coins,\nincluding \"Legal Gold Tender Coins\".\n\nTraditional economic activities in San Marino were food crops, sheep farming,\nand stone quarrying. Today farming activities focus on grain, vines, and\norchards, as well as animal husbandry (cattle and swine).",
    "openai_summarised_points": [
      "• One significant source of income from tourism in San Marino derives from the sale of historic coins and stamps.",
      "• San Marino issued its first commemorative stamps in 1894, marking the beginning of a substantial and ongoing economic activity centered on philately and numismatics within the republic.",
      "• All 10 Post Offices in San Marino participate in the sale of these commemorative stamps and collectible coins, which include \"Legal Gold Tender Coins,\" contributing to the local economy.",
      "• Historically, San Marino’s traditional economic activities comprised food crop cultivation, sheep farming, and stone quarrying.",
      "• In contemporary times, agricultural practices in San Marino have shifted focus toward the production of grain, cultivation of vines and orchards, and animal husbandry involving cattle and swine."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:54:46.387748",
      "openai_model": "gpt-4.1-mini",
      "content_length": 551,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "A notable segment of San Marino’s tourism revenue stems from the sale of historic coins and postage stamps, which have become highly sought-after collectibles among philatelists and numismatists worldwide. This niche market has evolved into a significant economic activity, capitalizing on the republic’s rich heritage and the global appeal of its limited-issue commemorative items. The tradition of producing collectible stamps began in 1894 when San Marino issued its first commemorative postage stamps, marking the inception of a continuous and lucrative enterprise centered on philately. These early issues not only commemorated important events and figures but also established San Marino’s reputation as a distinctive issuer of stamps, which collectors value for their rarity and historical significance. San Marino’s commitment to this economic sector is evident in the active participation of all ten of its Post Offices, which serve as official points of sale for commemorative stamps and collectible coins. Among the numismatic offerings are the “Legal Gold Tender Coins,” which hold both intrinsic metal value and collector appeal due to their limited mintage and official status as legal tender within the republic. The availability of these coins and stamps through multiple post offices ensures accessibility for tourists and collectors, fostering a steady flow of revenue that supports the local economy. The strategic promotion of these collectibles has allowed San Marino to maintain a unique economic niche that complements its tourism industry, drawing enthusiasts who contribute to the republic’s financial stability through their purchases. Historically, the economic foundation of San Marino was rooted in traditional activities such as food crop cultivation, sheep farming, and stone quarrying. These sectors formed the backbone of the republic’s subsistence economy for centuries, reflecting the rural and mountainous character of the territory. Agriculture focused on hardy crops suited to the terrain, while sheep farming provided wool and meat, supporting local artisanal industries and domestic needs. Stone quarrying, leveraging the abundant natural resources of the Apennine region, supplied building materials that were essential for both local construction and trade. These activities collectively sustained the population and shaped the socio-economic landscape of San Marino prior to the development of its modern economy. In more recent times, San Marino’s agricultural practices have undergone a notable transformation, adapting to changing economic conditions and market demands. The emphasis has shifted towards the production of grain, which serves as a staple food resource, alongside the cultivation of vines and orchards that contribute to the republic’s agricultural diversity. Viticulture and fruit growing have gained importance, reflecting both traditional Mediterranean agricultural influences and the pursuit of higher-value crops. Additionally, animal husbandry now includes the rearing of cattle and swine, expanding beyond the historical focus on sheep farming. This diversification in agricultural production not only supports local consumption but also enhances the rural economy by supplying products that can be marketed domestically and potentially exported. The evolution of these practices illustrates San Marino’s adaptation to contemporary economic realities while maintaining a connection to its agrarian roots.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:08:23.983374",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 3472,
      "generation_type": "detailed_expansion"
    }
  }
]