[
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofTogo** has struggled greatly. The International Monetary Fund\n(IMF) ranks it as the tenth poorest country in the world, with development\nundercut by political instability, lowered commodity prices, and external\ndebts. While industry and services play a role, the economy is dependent on\nsubsistence agriculture, with industrialization and regional banking suffering\nmajor setbacks.\n\nIn January 2017, the IMF signed an Extended Credit Facility arrangement,\nconsisting of a three-year $238 million loan package. Progress depends on\nfollow through on privatization, increased transparency in government\nfinancial operations, progress toward legislative elections, and continued\nsupport from foreign donors.",
    "openai_summarised_points": [
      "• The economy of Togo has faced significant challenges and is considered one of the poorest globally.",
      "• According to the International Monetary Fund (IMF), Togo ranks as the tenth poorest country in the world.",
      "• Key factors undermining Togo’s economic development include political instability, declining commodity prices, and burdensome external debts.",
      "• Although the industrial and service sectors contribute to the economy, Togo remains heavily reliant on subsistence agriculture.",
      "• Industrialization efforts and the regional banking sector have experienced major setbacks, limiting economic diversification and growth.",
      "• In January 2017, the IMF established an Extended Credit Facility arrangement with Togo, providing a three-year loan package totaling $238 million.",
      "• The success of this IMF program is contingent upon Togo’s commitment to privatization initiatives, enhancing transparency in government financial operations, advancing legislative elections, and maintaining ongoing support from foreign donors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:20:46.984314",
      "openai_model": "gpt-4.1-mini",
      "content_length": 719,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "The majority of the Togolese population depends on subsistence agriculture.\nIts agricultural products includes coffee, cocoa, cotton, yams, cassava\n(tapioca), corn, beans, rice, pearl millet, sorghum and livestock such as\nfish. Food and cash crop production employs the majority of the labor force\nand contributes about 42% to the gross domestic product (GDP). Coffee and\ncocoa are traditionally the major cash crops for export, but cotton\ncultivation increased rapidly in the 1990s, with 173,000 metric tons produced\nin 1999.\n\nAfter a disastrous harvest in 2001 (113,000 metric tons), cash crops\nproduction rebounded to 168,000 metric tons in 2002. Despite insufficient\nrainfall in some areas, the Togolese Government has achieved its goal of self-\nsufficiency in food crops — maize, cassava, yams, sorghum, pearl millet, and\ngroundnut. Small and medium-sized farms produce most of the food crop; the\naverage farm size is one to three hectares.\n\nTogo produced in 2018:\n\n* 1 million tons of cassava;\n* 886 thousand tons of maize;\n* 858 thousand tons of yam;\n* 277 thousand tons of sorghum;\n* 207 thousand tons of beans;\n* 156 thousand tons of palm oil;\n* 143 thousand tons of vegetable;\n* 145 thousand tons of rice;\n* 127 thousand tons of cotton;\n* 43 thousand tons of peanut;\n* 41 thousand tons of cocoa;\n* 26 thousand tons of millet;\n* 26 thousand tons of banana;\n* 21 thousand tons of coffee;\n\nIn addition to smaller productions of other agricultural products.\n\nChoco Togo is the country's first bean-to-bar chocolate manufacturer.",
    "openai_summarised_points": [
      "• The majority of the Togolese population relies on subsistence agriculture as their primary means of livelihood.",
      "• Key agricultural products in Togo include coffee, cocoa, cotton, yams, cassava (tapioca), corn, beans, rice, pearl millet, sorghum, and livestock such as fish.",
      "• Food and cash crop production employs the majority of Togo’s labor force and contributes approximately 42% to the country’s gross domestic product (GDP).",
      "• Traditionally, coffee and cocoa have been the major cash crops for export in Togo.",
      "• Cotton cultivation experienced rapid growth during the 1990s, reaching a production volume of 173,000 metric tons in 1999.",
      "• In 2001, Togo suffered a disastrous cash crop harvest, producing only 113,000 metric tons.",
      "• Cash crop production rebounded significantly in 2002, increasing to 168,000 metric tons.",
      "• Despite experiencing insufficient rainfall in some areas, the Togolese Government successfully achieved self-sufficiency in food crops, including maize, cassava, yams, sorghum, pearl millet, and groundnut.",
      "• Most food crops are produced by small and medium-sized farms, with the average farm size ranging from one to three hectares.",
      "• In 2018, Togo’s agricultural production included:",
      "• 1 million tons of cassava",
      "• 886 thousand tons of maize",
      "• 858 thousand tons of yam",
      "• 277 thousand tons of sorghum",
      "• 207 thousand tons of beans",
      "• 156 thousand tons of palm oil",
      "• 143 thousand tons of vegetables",
      "• 145 thousand tons of rice",
      "• 127 thousand tons of cotton",
      "• 43 thousand tons of peanuts",
      "• 41 thousand tons of cocoa",
      "• 26 thousand tons of millet",
      "• 26 thousand tons of bananas",
      "• 21 thousand tons of coffee",
      "• In addition to the above, Togo produces smaller quantities of various other agricultural products.",
      "• Choco Togo is recognized as the country’s first bean-to-bar chocolate manufacturer, marking a significant development in the local agricultural processing industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:20:53.538604",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1534,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mining",
    "text": "In the industrial sector, phosphates are Togo's most important commodity, and\nthe country has an estimated 60 million metric tons of phosphate reserves.\nFrom a high point of 2.7 million tons in 1997, production dropped to\napproximately 1.1 million tons in 2002. The fall in production is partly the\nresult of the depletion of easily accessible deposits and the lack of funds\nfor new investment. The formerly state-run company Société Nouvelle des\nPhosphates du Togo (New Phosphate Company of Togo) appears to have benefited\nfrom private management, which took over in 2001. Togo also has substantial\nlimestone and marble deposits.\n\nEncouraged by the commodity boom of the mid-1970s, which resulted in a\nfourfold increase in phosphate prices and sharply increased government\nrevenues, Togo embarked on an overly ambitious program of large investments in\ninfrastructure while pursuing industrialization and development of state\nenterprises in manufacturing, textiles, and beverages. However, following\ndeclines in world prices for commodities, its economy became burdened with\nfiscal imbalances, heavy borrowing, and unprofitable state enterprises.",
    "openai_summarised_points": [
      "• Phosphates constitute the most important commodity in Togo's industrial sector, with the country possessing an estimated 60 million metric tons of phosphate reserves.",
      "• Phosphate production in Togo peaked at 2.7 million tons in 1997 but declined significantly to approximately 1.1 million tons by 2002.",
      "• The reduction in phosphate production is attributed to the depletion of easily accessible phosphate deposits and insufficient funding for new investments in the sector.",
      "• The Société Nouvelle des Phosphates du Togo (New Phosphate Company of Togo), formerly a state-run enterprise, transitioned to private management in 2001, which appears to have benefited the company’s operations.",
      "• In addition to phosphates, Togo has substantial deposits of limestone and marble, contributing to its mineral resource base.",
      "• During the mid-1970s commodity boom, characterized by a fourfold increase in phosphate prices, Togo experienced sharply increased government revenues.",
      "• This economic upturn encouraged Togo to pursue an ambitious program of large-scale investments in infrastructure, alongside efforts to industrialize and develop state enterprises in manufacturing, textiles, and beverages.",
      "• However, subsequent declines in world commodity prices led to economic challenges, including fiscal imbalances, heavy borrowing, and the proliferation of unprofitable state enterprises, which burdened Togo’s economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:20:47.802582",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1146,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Other",
    "text": "While Togo itself produces no crude oil, it is the namesake of an illegal\nmarket for stolen oil off the Niger Delta, called the Togo Triangle.",
    "openai_summarised_points": [
      "• Togo does not produce any crude oil domestically.",
      "• The term \"Togo Triangle\" refers to an illegal market for stolen oil originating from the Niger Delta.",
      "• The \"Togo Triangle\" is named after Togo, despite the country not being a crude oil producer."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:20:47.291037",
      "openai_model": "gpt-4.1-mini",
      "content_length": 142,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "IMF relationship",
    "text": "Togo turned to the IMF for assistance in 1979, while simultaneously\nimplementing a stringent adjustment effort with the help of a series of IMF\nstandby programs, World Bank loans, and Paris Club debt rescheduling. Under\nthese programs, the Togolese Government introduced a series of austerity\nmeasures and major restructuring goals for the state enterprise and rural\ndevelopment sectors. These reforms were aimed at eliminating most state\nmonopolies, simplifying taxes and customs duties, curtailing public\nemployment, and privatizing major state enterprises. Togo made good progress\nunder the international financial institutions' programs in the late 1980s,\nbut movement on reforms ended with the onset of political instability in 1990.\nWith a new, elected government in place, Togo negotiated new 3-year programs\nwith the World Bank and IMF in 1994.\n\nTogo returned to the Paris Club in 1995 and received Naples terms, the club's\nmost concessionary rates. With the economic downturn associated with Togo's\npolitical problems, scheduled external debt service obligations for 1994 were\ngreater than 100% of projected government revenues (excluding bilateral and\nmultilateral assistance). By 2001, Togo was embarked on an IMF Staff Monitored\nProgram designed to restore macroeconomic stability and financial discipline\nbut without any new IMF resources pending new legislative elections. New IMF,\nWorld Bank and Africa Development Bank (ADB) lending must await the\nwillingness of Togo's traditional donors – the European Union, principally,\nbut the US also – to resume aid flows. So far, Togo's problematic legislative\nand presidential elections and the government's continued unwillingness to\ntransition from an Eyadéma-led autocracy to democracy have deterred these\ndonors from providing Togo with more aid. As of the fall 2002, Togo was $15\nmillion in arrears to the World Bank and owed $3 million to the ADB.\n\nTogo is one of 16 members of the Economic Community of West African States\n(ECOWAS). The ECOWAS development fund is based in Lomé. Togo also is a member\nof the West African Economic and Monetary Union (UEMOA), which groups seven\nWest African countries using the CFA franc. The West African Development Bank\n(BOAD), which is associated with UEMOA, is based in Lomé. Togo long served as\na regional banking center, but that position has been eroded by the political\ninstability and economic downturn of the early 1990s. Historically, France has\nbeen Togo's principal trading partner, although other European Union countries\nare important to Togo's economy. Total United States trade with Togo amounts\nto about $16 million annually.",
    "openai_summarised_points": [
      "• Togo sought assistance from the International Monetary Fund (IMF) in 1979, concurrently initiating a stringent economic adjustment program supported by a series of IMF standby arrangements, World Bank loans, and Paris Club debt rescheduling agreements.",
      "• The Togolese Government implemented austerity measures and major restructuring initiatives targeting state enterprises and rural development sectors under these international financial programs.",
      "• Key reforms included the elimination of most state monopolies, simplification of tax and customs duty structures, reduction of public sector employment, and privatization of major state-owned enterprises.",
      "• During the late 1980s, Togo achieved significant progress in implementing reforms under the guidance of international financial institutions; however, reform momentum halted with the onset of political instability in 1990.",
      "• Following the establishment of a new elected government, Togo negotiated new three-year economic programs with both the World Bank and the IMF in 1994.",
      "• In 1995, Togo returned to the Paris Club and secured Naples terms, which represent the most concessionary debt rescheduling rates offered by the club.",
      "• Due to economic decline linked to political difficulties, Togo’s scheduled external debt service obligations in 1994 exceeded 100% of projected government revenues, excluding bilateral and multilateral assistance.",
      "• By 2001, Togo was engaged in an IMF Staff Monitored Program aimed at restoring macroeconomic stability and financial discipline; however, this program did not include new IMF funding pending the outcome of legislative elections.",
      "• Resumption of new lending from the IMF, World Bank, and African Development Bank (ADB) depended on the willingness of Togo’s traditional donors, primarily the European Union and the United States, to reinstate aid flows.",
      "• Donor reluctance to provide additional aid was influenced by Togo’s problematic legislative and presidential elections and the government’s persistent resistance to transitioning from an Eyadéma-led autocracy to a democratic system.",
      "• As of fall 2002, Togo was in arrears of $15 million to the World Bank and owed $3 million to the African Development Bank.",
      "• Togo is a member of the Economic Community of West African States (ECOWAS), which comprises 16 countries; the ECOWAS development fund is headquartered in Lomé, Togo’s capital.",
      "• Togo also belongs to the West African Economic and Monetary Union (UEMOA), a group of seven West African countries that use the CFA franc as their common currency.",
      "• The West African Development Bank (BOAD), affiliated with UEMOA, is based in Lomé, reinforcing Togo’s regional financial significance.",
      "• Historically, Togo served as a regional banking center; however, its position was weakened by political instability and economic decline during the early 1990s.",
      "• France has traditionally been Togo’s principal trading partner, although other European Union countries also play significant roles in Togo’s economy.",
      "• Annual trade between the United States and Togo amounts to approximately $16 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:21:00.301225",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2641,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Open Market",
    "text": "Trade is extremely important to Togo's economy; the combined value of exports\nand imports equals 105 percent of GDP. The average applied tariff rate is 11.4\npercent. Non-tariff barriers impede some trade. Government openness to foreign\ninvestment is above average. Capital transactions are subject to some controls\nor government approval. The evolving banking system continues to expand but\nlacks liquidity.",
    "openai_summarised_points": [
      "• Trade plays a critical role in Togo's economy, with the combined value of exports and imports amounting to 105 percent of the country's Gross Domestic Product (GDP).",
      "• The average applied tariff rate in Togo is 11.4 percent, indicating moderate taxation on imported goods.",
      "• Despite tariff regulations, non-tariff barriers exist and impede certain aspects of trade, affecting the free flow of goods and services.",
      "• The Togolese government demonstrates an above-average openness to foreign investment, facilitating international capital inflows.",
      "• Capital transactions in Togo are subject to some degree of government controls or require official approval, reflecting regulatory oversight in financial operations.",
      "• Togo's banking system is evolving and continues to expand in scope and services; however, it faces challenges related to insufficient liquidity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:20:45.559419",
      "openai_model": "gpt-4.1-mini",
      "content_length": 407,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in bil. US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n**1980** | 2.6  | 934  | 2.0  | −2.3%  | 12.3%  | n/a\n**1981** | 2.8  | 955  | 1.7  | −3.4%  | 19.7%  | n/a\n**1982** | 2.8  | 942  | 1.4  | −3.7%  | 11.1%  | n/a\n**1983** | 2.8  | 898  | 1.3  | −5.2%  | 9.4%  | n/a\n**1984** | 3.1  | 953  | 1.2  | 5.9%  | −3.5%  | n/a\n**1985** | 3.3  | 988  | 1.3  | 3.7%  | −1.8%  | n/a\n**1986** | 3.5  | 1,009  | 1.8  | 3.3%  | 4.1%  | n/a\n**1987** | 3.5  | 978  | 2.1  | −2.5%  | 0.1%  | n/a\n**1988** | 4.0  | 1,082  | 2.3  | 10.1%  | -0.2%  | n/a\n**1989** | 4.3  | 1,137  | 2.3  | 4.1%  | -1.0%  | n/a\n**1990** | 4.7  | 1,213  | 2.8  | 5.9%  | 1.1%  | n/a\n**1991** | 4.8  | 1,210  | 2.7  | −0.6%  | 0.2%  | n/a\n**1992** | 4.8  | 1,164  | 2.9  | −3.2%  | 1.6%  | n/a\n**1993** | 4.1  | 1,004  | 2.2  | −16.3%  | -0.1%  | n/a\n**1994** | 4.8  | 1,165  | 1.7  | 13.9%  | 35.3%  | n/a\n**1995** | 5.8  | 1,361  | 2.2  | 19.7%  | 15.8%  | n/a\n**1996** | 5.7  | 1,282  | 2.4  | −3.9%  | 4.6%  | n/a\n**1997** | 6.0  | 1,311  | 2.5  | 3.8%  | 5.3%  | n/a\n**1998** | 6.0  | 1,258  | 2.4  | −2.3%  | 1.0%  | n/a\n**1999** | 6.2  | 1,271  | 2.4  | 2.5%  | −0.1%  | n/a\n**2000** | 6.3  | 1,251  | 2.0  | −1.0%  | 1.6%  | n/a\n**2001** | 6.5  | 1,256  | 2.0  | 0.8%  | 5.1%  | n/a\n**2002** | 6.8  | 1,290  | 2.3  | 3.8%  | 2.7%  | n/a\n**2003** | 7.4  | 1,368  | 2.9  | 6.7%  | −0.9%  | n/a\n**2004** | 7.5  | 1,354  | 3.0  | −1.0%  | 0.7%  | n/a\n**2005** | 7.4  | 1,298  | 3.1  | −4.7%  | 5.3%  | 63.1%\n**2006** | 7.8  | 1,335  | 3.2  | 2.7%  | 1.1%  | 67.7%\n**2007** | 8.2  | 1,349  | 3.8  | 1.2%  | 0.4%  | 70.5%\n**2008** | 8.6  | 1,390  | 4.6  | 4.0%  | 7.7%  | 67.3%\n**2009** | 9.2  | 1,434  | 4.7  | 5.5%  | 4.1%  | 57.6%\n**2010** | 9.8  | 1,496  | 4.8  | 5.9%  | 0.2%  | 33.5%\n**2011** | 10.6  | 1,573  | 5.4  | 5.8%  | 3.6%  | 33.8%\n**2012** | 11.5  | 1,660  | 5.4  | 6.3%  | 2.6%  | 34.3%\n**2013** | 12.4  | 1,741  | 6.0  | 5.8%  | 1.8%  | 41.1%\n**2014** | 13.3  | 1,825  | 6.4  | 5.6%  | 0.2%  | 44.9%\n**2015** | 14.2  | 1,894  | 5.8  | 5.5%  | 1.8%  | 52.4%\n**2016** | 15.1  | 1,972  | 6.1  | 5.7%  | 0.9%  | 59.9%\n**2017** | 16.0  | 2,037  | 6.4  | 4.0%  | −0.2%  | 57.1%\n**2018** | 17.1  | 2,122  | 7.0  | 4.8%  | 0.9%  | 58.0%\n**2019** | 18.7  | 2,274  | 7.0  | 4.9%  | 0.7%  | 54.9%\n**2020** | 20.4  | 2,417  | 7.4  | 2.0%  | 1.8%  | 62.2%\n**2021** | 22.9  | 2,644  | 8.3  | 6.0%  | 4.5%  | 64.9%\n**2022** | 25.9  | 2,926  | 8.1  | 5.8%  | 7.6%  | 67.4%\n**2023** | 28.3  | 3,125  | 9.1  | 5.6%  | 5.3%  | 68.0%\n**2024** | 30.6  | 3,290  | 9.8  | 5.3%  | 2.7%  | 69.7%",
    "openai_summarised_points": [
      "• In 1980, Togo's GDP measured at 2.6 billion US$ PPP with a GDP per capita of 934 US$ PPP, nominal GDP of 2.0 billion US$, a real GDP growth rate of −2.3%, inflation at 12.3%, and government debt data was not available (n/a).",
      "• The year 1981 saw a GDP of 2.8 billion US$ PPP, GDP per capita of 955 US$ PPP, nominal GDP of 1.7 billion US$, a real GDP decline of −3.4%, inflation at 19.7%, and government debt remained n/a.",
      "• In 1982, GDP remained at 2.8 billion US$ PPP, GDP per capita slightly decreased to 942 US$ PPP, nominal GDP was 1.4 billion US$, real GDP growth was −3.7%, inflation dropped to 11.1%, with government debt still n/a.",
      "• For 1983, GDP stayed at 2.8 billion US$ PPP, GDP per capita declined to 898 US$ PPP, nominal GDP was 1.3 billion US$, real GDP growth fell sharply by −5.2%, inflation was 9.4%, and government debt data was n/a.",
      "• In 1984, GDP increased to 3.1 billion US$ PPP, GDP per capita rose to 953 US$ PPP, nominal GDP was 1.2 billion US$, real GDP growth rebounded to 5.9%, inflation turned negative at −3.5%, and government debt remained n/a.",
      "• The 1985 economic indicators showed GDP at 3.3 billion US$ PPP, GDP per capita at 988 US$ PPP, nominal GDP of 1.3 billion US$, real GDP growth at 3.7%, inflation at −1.8%, with government debt data still unavailable.",
      "• In 1986, GDP was 3.5 billion US$ PPP, GDP per capita reached 1,009 US$ PPP, nominal GDP was 1.8 billion US$, real GDP growth was 3.3%, inflation increased to 4.1%, and government debt was not reported.",
      "• For 1987, GDP remained 3.5 billion US$ PPP, GDP per capita slightly decreased to 978 US$ PPP, nominal GDP rose to 2.1 billion US$, real GDP growth declined by −2.5%, inflation was 0.1%, and government debt data was n/a.",
      "• In 1988, GDP increased to 4.0 billion US$ PPP, GDP per capita rose to 1,082 US$ PPP, nominal GDP was 2.3 billion US$, real GDP growth surged to 10.1%, inflation was −0.2%, and government debt was not available.",
      "• The 1989 figures showed GDP at 4.3 billion US$ PPP, GDP per capita at 1,137 US$ PPP, nominal GDP steady at 2.3 billion US$, real GDP growth at 4.1%, inflation at −1.0%, with no government debt data.",
      "• In 1990, GDP reached 4.7 billion US$ PPP, GDP per capita was 1,213 US$ PPP, nominal GDP increased to 2.8 billion US$, real GDP growth was 5.9%, inflation at 1.1%, and government debt data remained unavailable.",
      "• The year 1991 recorded GDP at 4.8 billion US$ PPP, GDP per capita at 1,210 US$ PPP, nominal GDP at 2.7 billion US$, real GDP growth slightly negative at −0.6%, inflation at 0.2%, and government debt was n/a.",
      "• In 1992, GDP remained at 4.8 billion US$ PPP, GDP per capita decreased to 1,164 US$ PPP, nominal GDP was 2.9 billion US$, real GDP growth declined by −3.2%, inflation rose to 1.6%, with no government debt data.",
      "• For 1993, GDP dropped to 4.1 billion US$ PPP, GDP per capita fell to 1,004 US$ PPP, nominal GDP was 2.2 billion US$, real GDP growth plummeted to −16.3%, inflation was −0.1%, and government debt data was unavailable.",
      "• In 1994, GDP rebounded to 4.8 billion US$ PPP, GDP per capita rose to 1,165 US$ PPP, nominal GDP declined to 1.7 billion US$, real GDP growth surged to 13.9%, inflation sharply increased to 35.3%, with government debt data n/a.",
      "• The 1995 economic data showed GDP at 5.8 billion US$ PPP, GDP per capita at 1,361 US$ PPP, nominal GDP at 2.2 billion US$, real GDP growth at 19.7%, inflation at 15.8%, and government debt was not reported.",
      "• In 1996, GDP slightly decreased to 5.7 billion US$ PPP, GDP per capita was 1,282 US$ PPP, nominal GDP rose to 2.4 billion US$, real GDP growth was −3.9%, inflation dropped to 4.6%, with government debt data unavailable.",
      "• For 1997, GDP increased to 6.0 billion US$ PPP, GDP per capita was 1,311 US$ PPP, nominal GDP at 2.5 billion US$, real GDP growth was 3.8%, inflation at 5.3%, and government debt data was n/a.",
      "• In 1998, GDP remained at 6.0 billion US$ PPP, GDP per capita decreased to 1,258 US$ PPP, nominal GDP was 2.4 billion US$, real GDP growth declined by −2.3%, inflation was 1.0%, with no government debt data.",
      "• The year 1999 showed GDP at 6.2 billion US$ PPP, GDP per capita at 1,271 US$ PPP, nominal GDP steady at 2.4 billion US$, real GDP growth was 2.5%, inflation at −0.1%, and government debt was not available.",
      "• In 2000, GDP was 6.3 billion US$ PPP, GDP per capita slightly decreased to 1,251 US$ PPP, nominal GDP dropped to 2.0 billion US$, real GDP growth was −1.0%, inflation rose to 1.6%, with government debt data n/a.",
      "• For 2001, GDP increased to 6.5 billion US$ PPP, GDP per capita was 1,256 US$ PPP, nominal GDP remained at 2.0 billion US$, real GDP growth was 0.8%, inflation at 5.1%, and government debt data was not reported.",
      "• In 2002, GDP rose to 6.8 billion US$ PPP, GDP per capita increased to 1,290 US$ PPP, nominal GDP was 2.3 billion US$, real GDP growth was 3.8%, inflation at 2.7%, with government debt data unavailable.",
      "• The 2003 economic indicators showed GDP at 7.4 billion US$ PPP, GDP per capita at 1,368 US$ PPP, nominal GDP at 2.9 billion US$, real GDP growth was 6.7%, inflation was −0.9%, and government debt data was n/a.",
      "• In 2004, GDP was 7.5 billion US$ PPP, GDP per capita slightly decreased to 1,354 US$ PPP, nominal GDP increased to 3.0 billion US$, real GDP growth was −1.0%, inflation at 0.7%, with government debt data not available.",
      "• The year 2005 recorded GDP at 7.4 billion US$ PPP, GDP per capita at 1,298 US$ PPP, nominal GDP at 3.1 billion US$, real GDP growth declined by −4.7%, inflation rose to 5.3%, and government debt was 63.1% of GDP.",
      "• In 2006, GDP increased to 7.8 billion US$ PPP, GDP per capita rose to 1,335 US$ PPP, nominal GDP was 3.2 billion US$, real GDP growth was 2.7%, inflation at 1.1%, and government debt rose to 67.7% of GDP.",
      "• For 2007, GDP reached 8.2 billion US$ PPP, GDP per capita was 1,349 US$ PPP, nominal GDP increased to 3.8 billion US$, real GDP growth was 1.2%, inflation was 0.4%, and government debt was 70.5% of GDP.",
      "• In 2008, GDP rose to 8.6 billion US$ PPP, GDP per capita increased to 1,390 US$ PPP, nominal GDP was 4.6 billion US$, real GDP growth was 4.0%, inflation increased to 7.7%, and government debt declined to 67.3% of GDP.",
      "• The 2009 data showed GDP at 9.2 billion US$ PPP, GDP per capita at 1,434 US$ PPP, nominal GDP at 4.7 billion US$, real GDP growth was 5.5%, inflation at 4.1%, and government debt decreased to 57.6% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:21:33.997582",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2773,
      "bullet_points_count": 30
    }
  }
]