[
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Andorra** is a developed and free market economy driven by\nfinance, retail, and tourism. The country's gross domestic product (GDP) was\nUS$6.00 billion in 2024. Attractive for shoppers from France and Spain as a\nfree port, Andorra also has developed active summer and winter tourist\nresorts. With some 270 hotels and 400 restaurants, as well as many shops, the\ntourist trade employs a growing portion of the domestic labour force. An\nestimated 10 million tourists visit annually.\n\nThere is a fairly active trade in consumer goods, including imported\nmanufactured items, which, because they are duty-free, are less expensive in\nAndorra than in neighboring countries. Andorra's duty-free status also has had\na significant effect on the controversy concerning its relationship with the\nEuropean Union (EU). Its negotiations on duty-free status and relationship\nwith the EU began in 1987, soon after Spain joined. An agreement that went\ninto effect in July 1991 sets duty-free quotas and places limits on certain\nitems – mainly milk products, tobacco products and alcoholic beverages.\nAndorra is permitted to maintain price differences from other EU countries,\nand visitors enjoy limited duty-free allowances.\n\nThe results of Andorra's elections thus far indicate that many support the\ngovernment's reform initiatives and believe the country must, to some degree,\nintegrate into the European Union in order to continue to enjoy its\nprosperity. Although arable land comprises less than 2% of the country,\nagriculture was the mainstay of the Andorran economy until the upsurge in\ntourism. Sheep raising has been the principal agricultural activity, but\ntobacco growing is lucrative. Most of Andorra's food is imported.\n\nIn addition to handicrafts, manufacturing includes cigars, cigarettes and\nfurniture for domestic and export markets. A hydroelectric plant at Les\nEscaldes, with a capacity of 26.5 megawatts, provides 40% of Andorra's\nelectricity; Spain provides the rest.",
    "openai_summarised_points": [
      "• The economy of Andorra is characterized as a developed, free market economy primarily driven by the sectors of finance, retail, and tourism.",
      "• In 2024, Andorra's gross domestic product (GDP) was approximately US$6.00 billion.",
      "• The country is an attractive destination for shoppers from France and Spain, functioning as a free port that facilitates duty-free shopping.",
      "• Andorra has developed extensive summer and winter tourist resorts, supporting its tourism industry.",
      "• The country hosts around 270 hotels and 400 restaurants, along with numerous shops, indicating a robust tourist infrastructure.",
      "• Tourism employs a growing segment of the domestic labor force, with an estimated 10 million tourists visiting annually.",
      "• There is an active trade in consumer goods, including imported manufactured items, which are less expensive due to duty-free status, making them more affordable than in neighboring countries.",
      "• Andorra's duty-free status has significantly influenced its relationship with the European Union (EU), sparking controversy and negotiations.",
      "• Negotiations regarding duty-free status and the broader relationship with the EU began in 1987, shortly after Spain joined the EU.",
      "• An agreement effective from July 1991 established duty-free quotas and imposed limits on certain items, notably milk products, tobacco, and alcoholic beverages.",
      "• Under this agreement, Andorra is allowed to maintain price differences from other EU countries, and visitors are granted limited duty-free allowances.",
      "• Electoral results in Andorra suggest that many citizens support government reform initiatives and believe that some degree of EU integration is necessary to sustain economic prosperity.",
      "• Arable land accounts for less than 2% of Andorra's territory; historically, agriculture was the mainstay of the economy until tourism surged.",
      "• Sheep raising has been the principal agricultural activity, while tobacco cultivation is considered lucrative.",
      "• Most of Andorra's food supplies are imported, reflecting limited domestic agricultural production.",
      "• The country’s manufacturing sector includes the production of cigars, cigarettes, and furniture, serving both domestic consumption and export markets.",
      "• A hydroelectric plant located at Les Escaldes, with a capacity of 26.5 megawatts, supplies approximately 40% of Andorra's electricity needs; the remaining electricity is supplied by Spain."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:23.134575",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1985,
      "bullet_points_count": 17
    },
    "generated_detailed_content": "The economy of Andorra is classified as a developed, free market economy with its primary drivers rooted in the finance, retail, and tourism sectors. These industries have progressively shaped the economic landscape of the country, fostering growth and diversification beyond its traditionally agrarian roots. As of 2024, Andorra's gross domestic product (GDP) was estimated to be approximately US$6.00 billion, reflecting a relatively high per capita income and a stable economic environment supported by its strategic positioning and policy framework. Andorra's geographic location between France and Spain has played a significant role in its economic development, particularly through its status as a free port. This designation allows the country to operate as a duty-free shopping haven, attracting a substantial number of shoppers from its neighboring countries. The absence of import duties on many consumer goods makes Andorra an appealing destination for tourists and cross-border shoppers seeking lower prices on a variety of products, ranging from luxury items to everyday necessities. This duty-free status has not only boosted retail sales but has also contributed to the growth of the service sector, reinforcing Andorra's reputation as a commercial hub in the Pyrenees. Tourism forms a cornerstone of Andorra's economy, with the country investing heavily in the development of both summer and winter resorts. These resorts capitalize on the region's mountainous terrain and natural beauty, offering activities such as skiing, hiking, and mountain biking, which attract visitors year-round. The tourism infrastructure is well-developed, featuring approximately 270 hotels and 400 restaurants, alongside numerous retail establishments. This extensive network of accommodations and services supports the influx of tourists and contributes significantly to employment within the country. Tourism-related jobs have become a growing segment of the domestic labor force, with annual visitor numbers reaching an estimated 10 million. This influx of tourists not only sustains the hospitality sector but also stimulates ancillary industries, including transportation, entertainment, and local crafts. The trade environment in Andorra benefits from its duty-free status, which extends to a wide range of consumer goods, including imported manufactured items. These goods are generally less expensive than in neighboring France and Spain due to the absence of customs duties, making them more accessible to both residents and visitors. This price advantage has encouraged a vibrant market for consumer products, ranging from electronics and clothing to tobacco and alcohol. The affordability of these goods has reinforced Andorra's position as a shopping destination and has contributed to the overall economic vitality of the retail sector. However, Andorra's duty-free status has also been a source of complexity in its relationship with the European Union (EU). Since Spain's accession to the EU in 1986, Andorra has engaged in ongoing negotiations to reconcile its unique economic arrangements with the broader regulatory framework of the EU. These discussions, which began in 1987, have focused on establishing agreements that balance Andorra's economic interests with EU trade policies and customs regulations. A significant milestone in this process was the agreement that came into effect in July 1991, which introduced duty-free quotas and imposed limits on specific items, particularly milk products, tobacco, and alcoholic beverages. This accord aimed to regulate the flow of goods between Andorra and EU member states while preserving certain economic privileges for the microstate. Under the terms of the 1991 agreement, Andorra was permitted to maintain price differentials relative to other EU countries, allowing it to continue offering competitive pricing on various products. Additionally, visitors to Andorra were granted limited duty-free allowances, enabling them to bring back goods without incurring customs duties up to specified thresholds. These provisions sought to strike a balance between facilitating trade and preventing market distortions, reflecting the nuanced economic relationship between Andorra and the EU. The ongoing dialogue and adjustments to this framework underscore the importance of Andorra's duty-free status in shaping its external economic relations. Political developments within Andorra have also reflected the population’s attitudes toward economic reform and integration. Electoral outcomes suggest that a significant portion of the citizenry supports government initiatives aimed at reforming the economic and political structures of the country. Many Andorrans recognize that some degree of integration with the European Union is necessary to sustain and enhance economic prosperity, particularly in light of the challenges posed by globalization and regional economic dynamics. This sentiment has influenced policy discussions and negotiations, highlighting the interplay between domestic political will and international economic considerations. Agriculture historically formed the backbone of Andorra's economy, although its significance has diminished markedly in recent decades. The country's terrain limits arable land to less than 2% of its total territory, constraining the scope of agricultural activities. Within this limited agricultural sector, sheep raising has traditionally been the principal activity, providing wool, meat, and dairy products for local consumption. Tobacco cultivation has also been considered a lucrative enterprise, contributing to the rural economy and complementing other agricultural pursuits. Despite these activities, the majority of Andorra's food supplies are imported due to the limited capacity for domestic production, reflecting the country's reliance on external sources for sustenance. The manufacturing sector in Andorra remains relatively small but specialized, focusing on the production of goods such as cigars, cigarettes, and furniture. These products serve both the domestic market and export demands, contributing modestly to the country's industrial output. The manufacturing activities are often linked to traditional crafts and local expertise, maintaining cultural heritage while supporting economic diversification. This sector complements the dominant service-based economy by providing employment opportunities and generating additional revenue streams. Energy production in Andorra includes a hydroelectric plant located at Les Escaldes, which has a capacity of 26.5 megawatts. This facility supplies approximately 40% of the country's electricity needs, harnessing the region's hydrological resources to generate renewable energy. The remaining 60% of electricity consumption is met through imports from Spain, reflecting Andorra's interconnectedness with its neighbors in terms of energy infrastructure. The combination of domestic renewable energy production and imported electricity ensures a stable and reliable power supply for the country's residential, commercial, and industrial sectors. This energy arrangement underscores the balance between self-sufficiency and regional cooperation that characterizes many aspects of Andorra's economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T13:49:40.999257",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 17,
      "generated_content_length": 7272,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Tourism is the mainstay of Andorra's economy, accounting for roughly 80% of\nGDP. An estimated 9 million tourists visit annually, attracted by Andorra's\nduty-free status and by its summer and winter resorts. Andorra's comparative\nadvantage has recently eroded as the economies of neighboring France and Spain\nhave been opened up, providing broader availability of goods and lower\ntariffs. The banking sector, with its \"tax haven\" status, also contributes\nsubstantially to the economy. Agricultural production is limited by a scarcity\nof arable land, and most food has to be imported. The principal livestock\nactivity is sheep raising. Manufacturing consists mainly of cigarettes, cigars\nand furniture. Andorra is a member of the EU Customs Union and is treated as\nan EU member for trade in manufactured goods (no tariffs).",
    "openai_summarised_points": [
      "• Tourism is the primary sector of Andorra's economy, accounting for approximately 80% of the country's Gross Domestic Product (GDP).",
      "• Annually, an estimated 9 million tourists visit Andorra, attracted by its duty-free status and its summer and winter resort facilities.",
      "• The country's comparative economic advantage has diminished recently due to the opening of neighboring France and Spain's economies, which has increased the availability of goods and reduced tariffs.",
      "• The banking sector in Andorra is significant to the economy, benefiting from the country's \"tax haven\" status, which attracts financial activities and services.",
      "• Agricultural production in Andorra is limited primarily due to a scarcity of arable land, necessitating the importation of most food supplies.",
      "• The main livestock activity in Andorra is sheep raising.",
      "• Manufacturing industries in Andorra mainly produce cigarettes, cigars, and furniture.",
      "• Andorra is a member of the European Union (EU) Customs Union and is treated as an EU member for trade purposes concerning manufactured goods, allowing it to trade without tariffs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:27.427039",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 821,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Tourism has long been the cornerstone of Andorra's economy, constituting approximately 80% of the country's Gross Domestic Product (GDP). This overwhelming reliance on tourism stems from the principality’s unique geographic and economic attributes, which have positioned it as a favored destination for millions of visitors annually. Each year, an estimated 9 million tourists travel to Andorra, drawn by its distinctive duty-free status that offers a wide array of goods at competitive prices. This fiscal advantage is complemented by the country's well-developed resort facilities that cater to both summer and winter activities. In the winter months, Andorra's mountainous terrain and reliable snowfall create ideal conditions for skiing and snowboarding, attracting winter sports enthusiasts from across Europe and beyond. During the summer, the same alpine environment provides opportunities for hiking, mountain biking, and nature tourism, ensuring a steady influx of visitors throughout the year. Historically, Andorra’s economic model capitalized on its position as a tax haven and a duty-free zone, which allowed it to flourish as a shopping destination. However, in recent years, the country’s comparative economic advantage has diminished somewhat. This shift is largely due to the economic liberalization and integration of its neighboring countries, France and Spain. Both countries have progressively opened their markets, increasing the availability of goods and reducing tariffs, which has eroded the price differential that once made Andorra’s duty-free shopping particularly attractive. As a result, while tourism remains a vital sector, the principality has faced challenges in maintaining its previous level of competitive advantage in retail and related services. Alongside tourism, the banking sector plays a significant role in Andorra's economy. The country’s reputation as a \"tax haven\" has attracted a variety of financial activities and services, contributing substantially to economic output. Andorra’s banking institutions have historically benefited from favorable tax policies, banking secrecy, and regulatory frameworks that appeal to international clients seeking asset protection and tax optimization. This has made the financial sector a key pillar of the economy, providing employment and generating revenue through banking services, asset management, and related financial operations. However, in recent years, Andorra has taken steps to align its financial regulations with international standards, including increased transparency and cooperation with global tax authorities, which has gradually transformed the nature of its banking industry. Agricultural production in Andorra remains limited, primarily due to the scarcity of arable land within the principality’s mountainous terrain. The rugged topography and limited flat areas suitable for farming restrict the scale and diversity of agricultural activities. Consequently, Andorra imports the majority of its food supplies to meet domestic demand. Despite these limitations, agriculture continues to hold cultural and economic significance, particularly in rural areas where traditional practices persist. The main livestock activity in the country is sheep raising, which has historically been an integral part of Andorran rural life. Sheep farming supports the production of wool and meat, and it contributes to the maintenance of the landscape and biodiversity through grazing. This pastoral tradition also underpins local culinary customs and artisanal products, linking agriculture to tourism and cultural heritage. Manufacturing industries in Andorra are relatively modest in scale but contribute to the diversification of the economy beyond tourism and finance. The principal manufacturing outputs include cigarettes, cigars, and furniture. The production of tobacco products reflects both local demand and export opportunities, leveraging Andorra’s tax advantages to compete in regional markets. Furniture manufacturing, while limited, caters to domestic needs and niche markets, often emphasizing craftsmanship and quality. These industries provide employment opportunities and help to sustain economic activity in sectors less dependent on external factors such as tourism fluctuations or international finance. In terms of trade policy, Andorra is a member of the European Union (EU) Customs Union, which plays a crucial role in facilitating its economic interactions with neighboring countries and the broader European market. Although Andorra is not an EU member state, it is treated as such for trade purposes concerning manufactured goods. This arrangement allows Andorra to trade manufactured products with EU countries without the imposition of tariffs, simplifying cross-border commerce and enhancing the principality’s integration into the European economic area. The customs union membership supports Andorra’s export activities and provides consumers and businesses with access to a wide range of goods at competitive prices. It also necessitates compliance with certain EU regulations and standards, which helps maintain the quality and safety of products circulating within this trade framework. This special status reflects Andorra’s strategic approach to balancing its sovereignty with the economic benefits of closer ties to the European Union.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T13:49:29.911653",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 5365,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Statistics",
    "text": "Sotheby's Andorra office\n\n**GDP:** purchasing power parity - US$3.327 billion (2015)\n_country comparison to the world:_ 190\n\n**GDP - real growth rate:** 8.95% (2015 est.)\n_country comparison to the world:_ 132\n\n**GDP - per capita:** purchasing power parity - US$49,900 (2015)\n_country comparison to the world:_ 29\n\n**GDP - composition by sector:** (2015 est.)\n_agriculture:_ 11.9%\n_industry:_ 33.6%\n_services:_ 54.5%\n\n**Population below poverty line:** N/A\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ N/A\n_highest 10%:_ N/A\n\n**Inflation rate (consumer prices):** -0.9% (2015 est.)\n_country comparison to the world:_ 225\n\n**Labor force:** 42,230 (2007)\n_country comparison to the world:_ 185\n\n**Labor force - by occupation:** agriculture 0.3%, industry 20.8%, services\n79% (2007)\n\n**Unemployment rate:** 3.7%\n_country comparison to the world:_ 183\n\n**Budget:**\n_revenues:_ US$1.872 billion\n_expenditures:_ US$2.06 billion (2016)\n\n**Industries:** tourism (particularly skiing), banking, timber, furniture\n\n**Industrial production growth rate:** -3.9% (2020 est.)\n_country comparison to the world:_ 184\n\n**Electricity - production:** N/A\n\n**Electricity - production by source:**\n_fossil fuel:_ 0%\n_hydro:_ 40%\n_nuclear:_ 0%\n_other:_ 60% imported from Spain\n\n**Electricity - consumption:** N/A\n\n**Electricity - exports:** N/A\n\n**Electricity - imports:** N/A ; note - imports electricity from Spain and\nFrance; Andorra generates a small amount of hydropower\n\n**Agriculture - products:** small quantities of rye, wheat, barley, oats,\nvegetables, tobacco, sheep, cattle\n\n**Exports:** US$1.842 billion f.o.b. (2020 est.)\n_country comparison to the world:_ 163\n\n**Exports - commodities:** integrated circuits, dental fitting supplies, cars,\ngold, essential oils (2021)\n\n**Exports - partners:** Spain 40%, France 19%, United States 11%, Mauritania\n5% (2019)\n\n**Imports:** US$1.727 billion (2020 est.)\n_country comparison to the world:_ 178\n\n**Imports - commodities:** cars, refined petroleum, perfumes, shaving\nproducts, liquors (2019)\n\n**Imports - partners:** Spain 71%, France 17% (2019)\n\n**Debt - external:** $0 (2016)\n\n**Economic aid - recipient:** none\n\n**Currency:** Euros have replaced the French franc and the Spanish peseta.\n\n**Exchange rates:** euros per US dollar - 0.845 (2021), 0.6827 (2008), 0.7306\n(2007), 0.7964 (2006), 0.8041 (2005), 0.8054 (2004), 0.886 (2003), 1.0626\n(2002), 1.1175 (2001), 0.9867 (January 2000), 0.9386 (1999)\n\n**Fiscal year:** calendar year",
    "openai_summarised_points": [
      "• The Gross Domestic Product (GDP) of Andorra based on purchasing power parity was US$3.327 billion in 2015, ranking 190th in the world.",
      "• The estimated real GDP growth rate for 2015 was 8.95%, placing Andorra at 132nd globally.",
      "• The GDP per capita, adjusted for purchasing power parity, was US$49,900 in 2015, making it the 29th highest in the world.",
      "• The sectoral composition of GDP in 2015 was: agriculture at 11.9%, industry at 33.6%, and services at 54.5%.",
      "• Data on the population below the poverty line is not available (N/A).",
      "• Household income or consumption data by percentage share for the lowest and highest 10% is not available (N/A).",
      "• The inflation rate for consumer prices in 2015 was -0.9%, ranking 225th worldwide.",
      "• The labor force numbered 42,230 in 2007, ranking 185th globally.",
      "• Employment by occupation in 2007 was approximately 0.3% in agriculture, 20.8% in industry, and 79% in services.",
      "• The unemployment rate was 3.7%, placing Andorra at 183rd in the world.",
      "• The government’s budget revenues were US$1.872 billion, while expenditures were US$2.06 billion in 2016.",
      "• Major industries include tourism (notably skiing), banking, timber, and furniture manufacturing.",
      "• The industrial production growth rate was -3.9% in 2020, ranking 184th worldwide.",
      "• Electricity production data is not available; however, electricity is generated primarily through hydro sources (40%) and other sources (60%) imported from Spain, with no fossil fuel or nuclear contribution.",
      "• Andorra imports all its electricity, mainly from Spain and France, and generates a small amount of hydropower domestically.",
      "• Agricultural products include small quantities of rye, wheat, barley, oats, vegetables, tobacco, sheep, and cattle.",
      "• The value of exports was US$1.842 billion in 2020, ranking 163rd globally.",
      "• Export commodities include integrated circuits, dental fitting supplies, cars, gold, and essential oils (2021).",
      "• Major export partners are Spain (40%), France (19%), the United States (11%), and Mauritania (5%) as of 2019.",
      "• Imports totaled US$1.727 billion in 2020, ranking 178th worldwide.",
      "• Import commodities include cars, refined petroleum, perfumes, shaving products, and liquors (2019).",
      "• Main import partners are Spain (71%) and France (17%) as of 2019.",
      "• External debt was zero dollars in 2016.",
      "• Andorra does not receive any economic aid.",
      "• The official currency is the Euro, which has replaced the French franc and Spanish peseta.",
      "• Exchange rates fluctuated over the years, with the Euro per US dollar being 0.845 in 2021, 0.6827 in 2008, 0.7306 in 2007, and other values from 2002 to 2006.",
      "• The fiscal year follows the calendar year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:35.709058",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2496,
      "bullet_points_count": 27
    },
    "generated_detailed_content": "In 2015, Andorra's Gross Domestic Product (GDP) measured on a purchasing power parity (PPP) basis was estimated at US$3.327 billion, positioning the country 190th in the global rankings. This figure reflects the total economic output adjusted for relative price levels, providing a more accurate comparison of living standards and economic productivity with other nations. The real GDP growth rate for that year was notably robust, estimated at 8.95%, which elevated Andorra to 132nd place worldwide in terms of economic expansion. Such growth indicated a significant increase in economic activity relative to previous years, underscoring the dynamism of the Andorran economy during this period. When considering GDP per capita adjusted for purchasing power parity, Andorra ranked much higher, with a figure of US$49,900 in 2015, making it the 29th highest in the world. This high per capita income level reflects the country’s relatively small population combined with a prosperous economy. The sectoral composition of Andorra’s GDP in 2015 revealed a diversified economic structure. Agriculture accounted for 11.9% of the GDP, indicating a modest but still relevant contribution from primary sector activities such as farming and livestock. Industry represented a more substantial share at 33.6%, encompassing manufacturing, construction, and other industrial activities. The largest sector was services, which made up 54.5% of the GDP, highlighting the country’s reliance on service-oriented industries such as tourism, banking, and retail. Despite these detailed economic indicators, data concerning the percentage of the population living below the poverty line was not available, leaving a gap in understanding the distribution of wealth and economic hardship within the country. Similarly, information on household income or consumption shares for the lowest and highest 10% of the population was not accessible, limiting insights into income inequality or economic disparity. Consumer price inflation in Andorra during 2015 was recorded at -0.9%, indicating a slight deflationary trend. This negative inflation rate ranked the country 225th worldwide, suggesting that prices for goods and services were marginally declining rather than increasing. Such deflation can reflect subdued demand or other economic factors influencing price stability. The labor force in Andorra numbered 42,230 individuals in 2007, placing the country 185th globally in terms of labor pool size. Employment distribution by occupation during the same year showed that agriculture employed only about 0.3% of the workforce, underscoring the limited role of farming as a source of employment. Industry accounted for approximately 20.8% of employment, while the services sector dominated with 79% of the workforce engaged in various service-related occupations. The unemployment rate was relatively low at 3.7%, ranking Andorra 183rd worldwide, which suggests a generally healthy labor market with limited joblessness. Fiscal data from 2016 indicated that the government’s budget revenues amounted to US$1.872 billion, while expenditures were higher at US$2.06 billion, resulting in a budget deficit. This fiscal imbalance reflected the government’s spending priorities and revenue collection during that year. Andorra’s major industries included tourism, with skiing being a particularly significant attraction due to the country’s mountainous terrain and winter sports infrastructure. Banking also played a crucial role in the economy, benefiting from Andorra’s status as a financial center. Additionally, timber and furniture manufacturing constituted important industrial activities, contributing to both domestic consumption and export earnings. The industrial production growth rate experienced a decline of -3.9% in 2020, ranking Andorra 184th worldwide. This contraction in industrial output likely reflected the broader economic disruptions caused by global events during that year. Regarding energy, specific data on electricity production were not available; however, it was known that electricity generation relied primarily on hydroelectric sources, which accounted for 40% of domestic production. The remaining 60% of electricity supply was imported from Spain, with no contribution from fossil fuel or nuclear power sources. Andorra’s electricity imports primarily came from Spain and France, supplemented by a small amount of hydropower generated within the country itself. Agricultural production in Andorra consisted of small quantities of various crops and livestock. Cultivated products included rye, wheat, barley, oats, vegetables, and tobacco, while animal husbandry focused on sheep and cattle. These agricultural activities, though limited in scale, contributed to local food supply and rural livelihoods. In terms of trade, the value of exports reached US$1.842 billion in 2020, ranking Andorra 163rd globally. Export commodities were diverse and included integrated circuits, dental fitting supplies, cars, gold, and essential oils as of 2021. The country’s major export partners in 2019 were Spain, which accounted for 40% of exports, followed by France at 19%, the United States at 11%, and Mauritania at 5%. Imports totaled US$1.727 billion in 2020, placing Andorra 178th worldwide in terms of import volume. The main import commodities in 2019 included cars, refined petroleum, perfumes, shaving products, and liquors, reflecting both consumer demand and industrial needs. Spain was the dominant import partner, supplying 71% of imports, with France providing 17%. Notably, Andorra had no external debt reported in 2016, indicating a debt-free status in terms of international borrowing. Furthermore, the country did not receive any form of economic aid, underscoring its economic self-sufficiency. The official currency of Andorra is the Euro, which replaced the French franc and Spanish peseta following the adoption of the Euro in the Eurozone. Exchange rates between the Euro and the US dollar fluctuated over the years, with the Euro valued at 0.845 per US dollar in 2021. Historical exchange rates included 0.6827 in 2008 and 0.7306 in 2007, with other varying values recorded from 2002 to 2006. These fluctuations reflected broader trends in international currency markets and influenced the country’s trade and financial transactions. The fiscal year in Andorra follows the calendar year, aligning government accounting and budgeting processes with the standard January to December timeframe.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T13:49:51.301261",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 27,
      "generated_content_length": 6512,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in Andorra\nis Services with 2,515 companies followed by Retail Trade and Wholesale Trade\nwith 1,157 and 1,144 companies respectively.",
    "openai_summarised_points": [
      "• In 2022, the sector with the highest number of registered companies in Andorra was Services, accounting for 2,515 companies.",
      "• The Retail Trade sector had the second-highest number of registered companies, totaling 1,157.",
      "• The Wholesale Trade sector ranked third in terms of registered companies, with a total of 1,144."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:37.562483",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 201,
      "bullet_points_count": 3
    },
    "generated_detailed_content": "In 2022, the Services sector emerged as the dominant area of economic activity in Andorra in terms of the number of registered companies. This sector encompassed a wide range of activities including professional services, hospitality, financial services, information technology, and personal services, reflecting the country's growing emphasis on a diversified service-based economy. With a total of 2,515 companies registered under this category, the Services sector represented the largest segment of the corporate landscape. This prominence can be attributed to Andorra’s strategic focus on tourism, banking, and other service-oriented industries, which have historically driven economic growth and employment in the principality. Following the Services sector, the Retail Trade sector held the position of the second-largest in terms of company registrations. In 2022, there were 1,157 companies registered within this sector, underscoring the importance of consumer-oriented businesses in Andorra’s economy. The retail landscape in Andorra is characterized by a variety of enterprises ranging from small, family-owned shops to larger retail chains, catering both to local residents and the significant influx of tourists attracted by the country’s duty-free shopping benefits. The robust presence of retail companies reflects the sector’s critical role in supporting domestic consumption and enhancing the overall economic vitality of the region. The Wholesale Trade sector ranked third in the number of registered companies, with a total of 1,144 firms recorded in 2022. This sector plays a crucial intermediary role in the supply chain, facilitating the distribution of goods between manufacturers and retailers or other businesses. The substantial number of wholesale trade companies indicates a well-developed network of commercial activities that support both the retail sector and other industries within Andorra. Wholesale trade companies often specialize in various product categories, including foodstuffs, consumer goods, electronics, and construction materials, thereby contributing to the efficient functioning of the principality’s market economy. Together, these three sectors—Services, Retail Trade, and Wholesale Trade—constitute the backbone of Andorra’s corporate environment, reflecting the country’s economic structure and priorities. The predominance of the Services sector aligns with global trends toward service-oriented economies, while the significant presence of retail and wholesale trade companies highlights the importance of commerce and distribution in sustaining economic activity. The registration figures from 2022 provide a snapshot of Andorra’s dynamic business landscape, illustrating how different sectors interconnect to support the principality’s economic development and resilience.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T13:49:28.886993",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 3,
      "generated_content_length": 2829,
      "generation_type": "detailed_expansion"
    }
  }
]