[
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| The **factual accuracy** of parts of this article (those related to table)\n**may be compromised due to out-of-date information**. Please help update this\narticle to reflect recent events or newly available information. _( November\n2010)_  \n---|---  \n  \nThe **economy ofLiechtenstein** is based on industry, with a small but\nsignificant agricultural sector, and services (especially general services,\nincluding tourism and information technology). The country participates in a\ncustoms union with Switzerland and uses the Swiss franc as its national\ncurrency. It imports more than 85% of its energy requirements. Liechtenstein\nhas been a member of the European Free Trade Association (EFTA) since 1991\n(previously its interests had been represented by Switzerland). It also has\nbeen a member of the European Economic Area (EEA) since May 1995 and\nparticipates in the Schengen Agreement for passport-free intra-European\ntravel."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Liechtenstein's historical customs union with Austria was dissolved in 1919. A\ncustoms treaty was signed in 1923 and since its entering into force in 1924,\nLiechtenstein and Switzerland have been in a customs union with each other and\nas such the borders between the two countries are open. The German village\nBüsingen am Hochrhein and the Italian village Campione d'Italia also form part\nof this customs union (the latter albeit in a _de facto_ manner), which is\noften referred to as the _Swiss customs area_.\n\nLiechtenstein utilizes the Swiss franc as its national currency. Swiss border\npolice and customs officers secure its frontier with Austria. Currently there\nare 21 Swiss border guards stationed in Liechtenstein and 20 Austrian border\nguards securing its border (as of 2011).\n\nLiechtenstein is a member of EFTA, and joined the European Economic Area (EEA)\nin 1995 in order to benefit from the EU internal market. The capitalist\neconomy and tax system make Liechtenstein a safe, trustworthy and success-\noriented place for private and business purposes, especially with its highly\nmodern, internationally laid-out infrastructure and close connections to\nSwitzerland.\n\nIn the last half century, Liechtenstein has developed from a mainly\nagricultural state to one of the most highly industrialized countries in the\nworld."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Foreign trade",
    "text": "An office of the Hilti Corporation in Hong Kong pictured in March 2010, an\nexample of Liechtenstein's export economy\n\nBesides its efficient industry, there also is a strong services sector. Four\nout of ten employees work in the services sector, a relatively high proportion\nof whom are foreigners, including those who commute across the border from\nneighboring Switzerland, Austria and Germany. Industrial exports more than\ndoubled in 20 years from $1.21 billion (SFr. 2.2 billion) in 1988 to $2.9\nbillion (SFr. 4.6 billion) in 2008. Some 15.7% of Liechtenstein goods are\nexported to Switzerland, 62.6% to the EU and 21.1% to the rest of the\nworld.[_citation needed_]\n\nThe United States has been the most important export market for Liechtenstein\nin recent times, totaling $561 million (SFr. 876 million); Germany is second,\nwith $479 million (SFr. 748 million) worth of imports, and Switzerland third,\nwith $375 million (SFr. 587 million).\n\nAbout 32% of the country's revenues are invested in research and development,\none of the driving forces of the success of Liechtenstein's economy. Total R&D\nspending in 2000 rose by 20.7% to approximately $140 million (213 million\nfrancs)."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Banking and finance",
    "text": "National Bank of Liechtenstein\n\nThe Principality of Liechtenstein also is known as an important financial\ncentre, primarily because it specializes in financial services for foreign\nentities. The country's low tax rate, loose incorporation and corporate\ngovernance rules, and traditions of strict bank secrecy have contributed\nsignificantly to the ability of financial intermediaries in Liechtenstein to\nattract funds from outside the country's borders. The same factors made the\ncountry attractive and vulnerable to money launderers, although late 2009\nlegislation has strengthened regulatory oversight of illicit funds transfers.\n\nLiechtenstein has chartered 17 banks, three non-bank financial companies, and\n71 public investment companies, as well as insurance and reinsurance\ncompanies. Its 270 licensed fiduciary companies and 81 lawyers serve as\nnominees for, or manage, more than 73,000 entities (primarily corporations,\ninstitutions, or trusts), partly for non-Liechtenstein residents. About one-\nthird of these entities hold the controlling interest in other entities,\nchartered in countries other than Liechtenstein. The Principality's laws\npermit the corporations it charters to issue bearer shares. Until recently,\nthe Principality's banking laws permitted banks to issue numbered accounts,\nbut new regulations require strict know-your-customer practices for all new\naccounts."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Taxation",
    "text": "Silver coin: 5 kronen of Liechtenstein, 1904, the front of the coin is a\nportrait of Johann II\n\nLiechtenstein's standard rate of VAT (Mehrwertsteuer) is identical to\nSwitzerland's for it must mirror the latter's continually and is currently\n7.7%. The reduced rate is 2.5%. A special rate of 3.7% is in use in the hotel\nindustry.\n\nIn July 2015, Liechtenstein and Switzerland signed a new agreement on double\ntaxation, which took effect in December 2016, superseding the previous one\nfrom 1995. Some differences on the withholding tax arose, but Switzerland did\nnot agree to introduce this practice to residents of Liechtenstein working in\nSwitzerland.\n\nIn November 2016, the parliament of the principality decided with a large\nmajority to introduce an agreement of automatic information exchange with 27\nnew treaty partners, including Switzerland. Data collection will start in\n2018, and effectual exchange of account information is planned for 2019."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Statistics",
    "text": "* **GDP (PPP):** $4.826 billion (2009)\n* **GDP – real growth rate:** 3.8% (2008)\n* **GDP (PPP) – per capita:** purchasing power parity – $141,100 (2008)\n* **Inflation rate (consumer prices):** 0.7% (2011)\n* **Labor force:** 35,440 of whom about 10,440 are natives 7,550 are foreigners; 17,450 commute from Austria, Switzerland, and Germany to work each day (2008)\n* **Labor force – by occupation:** agriculture: 8%; industry: 41%; services: 51% (31 December 2008)\n* **Unemployment rate:** 1.9% (December 2020)\n* **Currency:** Swiss franc (CHF)\n* **Exchange rates:** Swiss francs per US dollar – 1.3467 (2003), 1.5586 (2002), 1.6876 (2001), 1.6888 (2000), 1.5022 (1999)\n* **Fiscal year:** calendar year"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "State budget",
    "text": "* **revenues:** $420.8 million\n* **expenditures:** $420.1 million, including capital expenditures of $NA (2000 est.)"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Industries",
    "text": "The principal industries are electronics, metal manufacturing, textiles,\nceramics, pharmaceuticals, food products, precision instruments, and tourism.\n\n* **Industrial production growth rate:** N/A"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Electricity",
    "text": "* **production by source**[_citation needed_]\n* _fossil fuel:_ 3,330 MWh (3.12%)\n* _hydro:_ 76,166 MWh (94.2%)[_citation needed_]\n* _nuclear:_ none (0%)\n* _solar/wind:_ 1,361 MWh (2.68%)[_citation needed_]\n* **Electricity – production:** 80,105 MWh (2010)\n* **Electricity – consumption:** about 350,645 MWh (2010)\n* **Electricity – exports:** none\n* **Electricity – imports:** about 270,540 MWh (2010)"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Agriculture",
    "text": "* **Products**\n* wheat, barley, corn, potatoes; livestock, dairy products"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.5",
    "section_name": "Exports",
    "text": "* **Commodities:** small specialty machinery, dental products, stamps, hardware, pottery\n* **Partners:** EU 62.6%, Others 21.1% (Germany, the US, the UK, France, Italy, Austria, Taiwan and Japan), Switzerland 15.7% as of (2008)"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.6",
    "section_name": "Imports",
    "text": "* **Commodities:** agricultural products, raw materials, machinery, metal goods, textiles, foodstuffs, motor vehicles\n* **Partners:** member states of the European Union, Switzerland, Germany and the US."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.7",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nLiechtenstein is Services with 7,666 companies followed by Finance, Insurance,\nand Real Estate and Unknown industry with 5,240 and 3,104 companies\nrespectively."
  }
]