[
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Nepal** is a developing category and is largely dependent on\nagriculture and remittances. Until the mid-20th century Nepal was an isolated\npre-industrial society, which entered the modern era in 1951 without schools,\nhospitals, roads, telecommunications, electric power, industry, or civil\nservice. The country has, however, made progress toward sustainable economic\ngrowth since the 1950s. The country was opened to economic liberalization,\nleading to economic growth and improvement in living standards when compared\nto the past. The biggest challenges faced by the country in achieving higher\neconomic development are the frequent changes in political leadership, as well\nas corruption.\n\nNepal has used a series of five-year plans in an attempt to make progress in\neconomic development. It completed its ninth economic development plan in\n2002; its currency has been made convertible, and 17 state enterprises have\nbeen privatised. Foreign aid to Nepal accounts for more than half of the\ndevelopment budget. Government priorities over the years have been result in\nthe development of transportation and communication facilities, agriculture,\nand industry. Since 1975, improved government administration and rural\ndevelopment efforts have been emphasised. The economy is heavily dependent on\nimports of basic materials and on foreign markets for its forest and\nagricultural products. Nepal possesses immense potential for sustainable\nenergy resources that can be harnessed for energy security, economic growth,\nand environmental sustainability.\n\nAgriculture remains Nepal's principal economic activity, employing about 65%\nof the population and providing 31.7% of GDP. Only about 20% of the total area\nis cultivable; another 40.7% is forested (i.e., covered by shrubs, pastureland\nand forest); most of the rest is mountainous. Fruits and vegetables (apples,\npears, tomatoes, various salad greens, peach, nectarine, potatoes), as well as\nrice and wheat are the main food crops. The lowland Terai region produces an\nagricultural surplus, part of which supplies the food-deficient hill areas.\n\nGDP is heavily dependent on remittances (9.1%) of foreign workers.\nSubsequently, economic development in social services and infrastructure in\nNepal has not made dramatic progress. A countrywide primary education system\nis under development, and Tribhuvan University has several campuses under it .\nAlthough eradication efforts continue, malaria had been controlled in the\nfertile but previously uninhabitable Terai region in the south. Kathmandu is\nlinked to India and nearby hill regions by road and an expanding highway\nnetwork. The capital was almost out of fuel and supplies, due to a crippling\ngeneral strike in southern Nepal on 17 February 2008.\n\nMajor towns are connected to the capital by telephone and domestic air\nservices. The export-oriented carpet and garment industries like pasmina have\ngrown rapidly in recent years. Together, they account for approximately 70% of\nthe country's merchandise exports. The Cost of Living Index in Nepal is\ncomparatively lower than many countries but not the least. The quality of life\nhas declined to a much less desirous value in recent years. In the 2021 Global\nHunger Index, Nepal ranks 76th out of the 116 countries with sufficient data\nto calculate 2021 GHI scores. With a score of 19.1, Nepal has a level of\nhunger that is moderate. Nepal has the worst road infrastructure in Asia.\nWorld Economics estimates Nepal's 2024 GDP at $243 billion in PPP terms\n(Purchasing Power Parity) and an initial estimate of $255 billion for 2025.\nThis figure is 65% higher than the official estimate published by the World\nBank.",
    "openai_summarised_points": [
      "• The economy of Nepal is classified as developing and is predominantly reliant on agriculture and remittances from foreign workers.",
      "• Until 1951, Nepal was an isolated pre-industrial society lacking schools, hospitals, roads, telecommunications, electric power, industry, and civil service, entering the modern era with minimal infrastructure.",
      "• Since the 1950s, Nepal has made progress toward sustainable economic growth, aided by economic liberalization that improved living standards compared to the past.",
      "• Major obstacles to higher economic development in Nepal include frequent changes in political leadership and pervasive corruption.",
      "• Nepal has implemented a series of five-year plans for economic development, completing its ninth plan in 2002.",
      "• The Nepalese currency has been made convertible, and 17 state enterprises have undergone privatization.",
      "• Foreign aid constitutes more than half of Nepal’s development budget, highlighting the country’s dependence on external financial assistance.",
      "• Government priorities historically focused on developing transportation and communication infrastructure, agriculture, and industry, with increased emphasis on improved government administration and rural development since 1975.",
      "• Nepal’s economy is heavily reliant on imports of basic materials and foreign markets for its forest and agricultural products.",
      "• The country possesses significant potential for sustainable energy resources, which could enhance energy security, economic growth, and environmental sustainability.",
      "• Agriculture remains the principal economic activity, employing approximately 65% of the population and contributing 31.7% to the GDP.",
      "• Only about 20% of Nepal’s total land area is cultivable, while 40.7% is forested, including shrubs, pastureland, and forest; the remainder is predominantly mountainous terrain.",
      "• Main food crops include fruits and vegetables such as apples, pears, tomatoes, salad greens, peaches, nectarines, and potatoes, alongside staple grains like rice and wheat.",
      "• The lowland Terai region produces an agricultural surplus that partially supplies the food-deficient hill areas.",
      "• Remittances from foreign workers contribute 9.1% to Nepal’s GDP, underscoring their economic significance.",
      "• Despite some progress, economic development in social services and infrastructure has not advanced dramatically.",
      "• Nepal is developing a countrywide primary education system, with Tribhuvan University operating multiple campuses.",
      "• Malaria, once prevalent in the fertile but previously uninhabitable Terai region, has been controlled through ongoing eradication efforts.",
      "• Kathmandu is connected to India and nearby hill regions by road and an expanding highway network, although infrastructure challenges persist.",
      "• On 17 February 2008, Kathmandu faced severe fuel and supply shortages due to a crippling general strike in southern Nepal.",
      "• Major towns in Nepal are linked to the capital by telephone and domestic air services, facilitating communication and transport.",
      "• Export-oriented industries such as carpet manufacturing and garment production, including pashmina products, have grown rapidly and together account for about 70% of Nepal’s merchandise exports.",
      "• Nepal’s Cost of Living Index is comparatively lower than many countries, though it is not the lowest globally.",
      "• The quality of life in Nepal has declined significantly in recent years.",
      "• In the 2021 Global Hunger Index, Nepal ranked 76th out of 116 countries with sufficient data, scoring 19.1, indicating a moderate level of hunger.",
      "• Nepal has the poorest road infrastructure in Asia, presenting a major challenge for economic development and connectivity.",
      "• World Economics estimated Nepal’s GDP in 2024 at $243 billion in Purchasing Power Parity (PPP) terms, with an initial estimate of $255 billion for 2025.",
      "• These GDP figures are approximately 65% higher than the official estimates published by the World Bank, indicating discrepancies in economic measurement."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:02:29.212564",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3676,
      "bullet_points_count": 28
    },
    "generated_detailed_content": "The economy of Nepal is classified as developing and remains predominantly reliant on agriculture and remittances from foreign workers. Agriculture serves as the principal economic activity, employing approximately 65% of the population and contributing 31.7% to the nation's gross domestic product (GDP). This sector is characterized by a diverse range of crops, including staple grains such as rice and wheat, alongside fruits and vegetables like apples, pears, tomatoes, salad greens, peaches, nectarines, and potatoes. The lowland Terai region, with its fertile plains, produces an agricultural surplus that partially supplies the food-deficient hill areas, thereby playing a critical role in the country’s internal food distribution. Despite this agricultural base, Nepal’s economy is heavily dependent on imports of basic materials and foreign markets for its forest and agricultural products, underscoring its integration into global trade networks. Until 1951, Nepal existed as an isolated pre-industrial society, lacking fundamental infrastructure such as schools, hospitals, roads, telecommunications, electric power, industry, and a formal civil service. Entering the modern era with minimal infrastructure, the country faced significant developmental challenges. The absence of these essential services and facilities reflected Nepal’s historical isolation and limited engagement with the outside world. Since the 1950s, however, Nepal has made steady progress toward sustainable economic growth, aided in part by economic liberalization policies that sought to open the economy and improve living standards compared to the past. These reforms facilitated gradual improvements in various sectors, including education, healthcare, transportation, and industry, although the pace of development has been uneven and constrained by structural limitations. A series of five-year plans for economic development have been implemented in Nepal, with the ninth plan completed in 2002. These plans have provided a framework for prioritizing investment and policy initiatives aimed at fostering growth and reducing poverty. Historically, government priorities have focused on developing transportation and communication infrastructure, agriculture, and industry. Since 1975, there has been an increased emphasis on improving government administration and promoting rural development, recognizing the importance of governance and rural livelihoods in the broader development agenda. Despite these efforts, major obstacles to higher economic development have persisted, including frequent changes in political leadership and pervasive corruption, which have undermined policy continuity and the effective implementation of development programs. Economic reforms have included the convertibility of the Nepalese currency and the privatization of 17 state enterprises, reflecting a shift toward market-oriented policies. These measures aimed to enhance economic efficiency, attract investment, and stimulate private sector growth. Nonetheless, foreign aid has continued to play a critical role in Nepal’s development, constituting more than half of the country’s development budget. This heavy reliance on external financial assistance highlights Nepal’s limited domestic resource base and the ongoing challenges it faces in achieving self-sustaining economic growth. Nepal possesses significant potential for sustainable energy resources, which could substantially enhance energy security, economic growth, and environmental sustainability. The country’s abundant water resources, in particular, offer opportunities for hydropower development, which remains largely untapped. Expanding the energy sector could reduce dependence on imported fuels, support industrialization, and improve living standards. However, infrastructural and institutional constraints have slowed progress in harnessing these resources effectively. Agricultural land accounts for only about 20% of Nepal’s total land area, while approximately 40.7% is forested, including shrubs, pastureland, and forested regions. The remainder of the country consists predominantly of mountainous terrain, which poses challenges for large-scale agriculture and infrastructure development. The varied topography influences settlement patterns, economic activities, and transportation networks, contributing to regional disparities in development. Efforts to improve social services and infrastructure have yielded some progress but have not advanced dramatically. Education has been a particular focus, with the development of a countrywide primary education system and the expansion of higher education institutions such as Tribhuvan University, which operates multiple campuses across the country. Public health initiatives have also achieved successes, notably in the control of malaria, which was once prevalent in the fertile but previously uninhabitable Terai region. Ongoing eradication efforts have significantly reduced the incidence of this disease, improving public health outcomes and enabling greater settlement and agricultural activity in the region. Transportation infrastructure remains a critical area of development, with Kathmandu connected to India and nearby hill regions by road and an expanding highway network. Despite these connections, Nepal continues to face significant infrastructure challenges, particularly in road quality and coverage. The country has the poorest road infrastructure in Asia, which presents a major obstacle to economic development and connectivity. In February 2008, Kathmandu experienced severe fuel and supply shortages due to a crippling general strike in southern Nepal, illustrating the vulnerability of supply chains and the impact of political unrest on economic stability. Major towns are linked to the capital by telephone and domestic air services, facilitating communication and transport, although these networks require further expansion and modernization to meet growing demands. The export sector has seen the rapid growth of industries oriented toward foreign markets, particularly carpet manufacturing and garment production, including pashmina products. These industries have become significant contributors to Nepal’s merchandise exports, accounting for about 70% of the total. The expansion of these export-oriented industries has provided employment opportunities and foreign exchange earnings, supporting economic diversification beyond agriculture and remittances. Nepal’s Cost of Living Index is comparatively lower than that of many countries, though it is not the lowest globally. Despite this relative affordability, the quality of life in Nepal has declined significantly in recent years, reflecting persistent challenges such as poverty, inadequate infrastructure, and limited access to social services. The 2021 Global Hunger Index ranked Nepal 76th out of 116 countries with sufficient data, scoring 19.1, which indicates a moderate level of hunger. This ranking underscores ongoing food security concerns and the need for continued efforts to improve nutrition and reduce poverty. Economic measurements reveal discrepancies in Nepal’s reported GDP figures. World Economics estimated Nepal’s GDP in 2024 at $243 billion in Purchasing Power Parity (PPP) terms, with an initial estimate of $255 billion for 2025. These figures are approximately 65% higher than the official estimates published by the World Bank, suggesting differences in methodologies and data sources used for economic assessment. Such disparities highlight the complexities involved in accurately measuring economic performance in developing countries with substantial informal sectors and data limitations.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:24.994526",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 28,
      "generated_content_length": 7713,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Foreign investments and taxation",
    "text": "Huge numbers of Small Foreign Investments come to Nepal via the Non Resident\nNepali, who are investing in many sectors. Nepal has a huge potential for\nhydroelectricity. Accordingly, a large number of foreign companies are willing\nto invest in Nepal, but political instability has stopped the process. Nepal\nhas entered into agreements for avoidance of double taxation (all in credit\nmethod) with 10 countries (PSRD) since 2000. Similarly, it has Investment\nprotection agreements with 5 countries (PSRD) since 1983. In 2014, Nepal\nrestricted the Foreign aid by setting a minimum limit for foreign grants, soft\nand commercial loans from its development partners.",
    "openai_summarised_points": [
      "• A significant volume of small foreign investments in Nepal originates from Non-Resident Nepalis, who actively invest across various sectors within the country.",
      "• Nepal possesses substantial potential for hydroelectric power generation, attracting interest from numerous foreign companies eager to invest in this sector.",
      "• Despite the interest from foreign investors, political instability in Nepal has hindered the progress and realization of many foreign investment projects.",
      "• Since the year 2000, Nepal has entered into agreements for the avoidance of double taxation with 10 countries, all of which utilize the credit method, as reported by the Public Service Reform Division (PSRD).",
      "• Additionally, Nepal has established investment protection agreements with 5 countries since 1983, also documented by the PSRD, to safeguard foreign investments.",
      "• In 2014, Nepal implemented restrictions on foreign aid by setting minimum thresholds for foreign grants, soft loans, and commercial loans received from its development partners, aiming to regulate the inflow of external financial assistance."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:02:32.796120",
      "openai_model": "gpt-4.1-mini",
      "content_length": 660,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "A significant portion of foreign investments in Nepal originates from Non-Resident Nepalis (NRNs), who play an active role in channeling capital into diverse sectors within the country. These investors, often residing abroad but maintaining strong ties to their homeland, contribute to various industries including real estate, manufacturing, tourism, and the service sector. Their investments not only provide much-needed financial resources but also facilitate technology transfer and entrepreneurial expertise, thereby fostering economic growth and development. The involvement of NRNs is particularly notable because it represents a steady stream of relatively small-scale investments that cumulatively have a substantial impact on Nepal’s economy, complementing larger foreign direct investment (FDI) inflows. Nepal’s abundant natural resources, especially its vast hydroelectric potential, have attracted considerable interest from foreign companies seeking investment opportunities. The country is endowed with numerous rivers and steep gradients, providing an estimated theoretical hydroelectric potential of approximately 83,000 megawatts, of which only a fraction has been harnessed to date. This immense potential has positioned Nepal as an attractive destination for energy sector investments, with many international firms expressing eagerness to develop hydroelectric projects ranging from small-scale plants to large multipurpose dams. The development of hydroelectric power is viewed as a critical driver for Nepal’s economic progress, given the country’s chronic energy shortages and the potential for electricity exports to neighboring countries such as India and China. Foreign investors are particularly interested in public-private partnership models and build-own-operate-transfer (BOOT) schemes that allow for long-term engagement in the sector. Despite the promising opportunities, Nepal’s political instability has posed significant challenges to the realization of many foreign investment projects. The country has experienced frequent changes in government, prolonged periods of political uncertainty, and occasional civil unrest, all of which have contributed to an unpredictable investment climate. These factors have often delayed project approvals, disrupted infrastructure development, and increased the perceived risk for foreign investors. Consequently, several planned hydroelectric and other industrial ventures have faced setbacks or cancellations, limiting the full exploitation of Nepal’s investment potential. The lack of consistent policy implementation and regulatory clarity has further exacerbated investor concerns, underscoring the need for political stability and institutional reforms to create a more conducive environment for foreign capital inflows. In an effort to facilitate international investment and avoid fiscal impediments, Nepal has entered into agreements for the avoidance of double taxation with ten countries since the year 2000. These treaties are designed to prevent the same income from being taxed by both Nepal and the foreign investor’s home country, thereby encouraging cross-border economic activity. All of these agreements employ the credit method, which allows taxpayers to offset taxes paid abroad against their domestic tax liability, reducing the overall tax burden. The Public Service Reform Division (PSRD) of Nepal’s government has documented these treaties, highlighting their role in promoting transparency and fairness in the taxation of foreign investments. By mitigating the risk of double taxation, these agreements enhance Nepal’s attractiveness as an investment destination and align its tax policies with international standards. In addition to double taxation treaties, Nepal has also established investment protection agreements with five countries since 1983, as reported by the PSRD. These agreements aim to safeguard foreign investors by providing legal guarantees against expropriation, ensuring fair and equitable treatment, and facilitating dispute resolution mechanisms. Such protections are crucial in reassuring investors that their assets and investments will be secure from arbitrary government actions or political interference. The investment protection agreements serve to build investor confidence by creating a more predictable and stable legal framework, which is particularly important in a developing economy like Nepal’s where institutional structures are still evolving. These accords often include provisions for compensation in the event of nationalization or other adverse government measures, thereby reducing the perceived risk associated with investing in Nepal. In 2014, Nepal introduced regulatory measures to control the inflow of foreign aid by setting minimum thresholds for foreign grants, soft loans, and commercial loans received from its development partners. This policy aimed to enhance the management and coordination of external financial assistance, ensuring that aid flows align with national development priorities and fiscal sustainability. By imposing minimum thresholds, the government sought to filter out smaller, fragmented aid contributions that could complicate budget planning and project implementation. These restrictions also intended to encourage more substantial and strategic partnerships with development agencies, promoting efficiency and reducing dependency on external funding. The regulation of foreign aid through such thresholds reflects Nepal’s broader efforts to strengthen its public financial management and assert greater sovereignty over its development agenda amid a complex international aid environment.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:21.736367",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 5669,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Imports and exports",
    "text": "Nepal's merchandise trade balance has improved somewhat since 2000 with the\ngrowth of the carpet and garment industries. In the fiscal year 2000–2001,\nexports posted a greater increase (14%) than imports (4.5%), helping bring the\ntrade deficit down by 4% from the previous year to $749 million. Recently, the\nEuropean Union has become the largest buyer of ready-made garments; fruits and\nvegetables (mostly apples, pears, tomatoes, various salads, peach, nectarine,\npotatoes, rice) from Nepal. Exports to the EU accounted for 46.13 percent of\nthe country's garment exports.\n\nThe annual monsoon rain strongly influences economic growth. From 1996 to\n1999, real GDP growth averaged less than 4%. The growth rate recovered in\n1999, rising to 6% before slipping slightly in 2001 to 5.5%.\n\nStrong export performance, including earnings from tourism, and external aid\nhave helped improve the overall balance of payments and increase international\nreserves. Nepal receives substantial amounts of external assistance from the\nUnited Kingdom, the United States, Japan, Germany, and the Nordic countries.\n\nSeveral multilateral organisations such as the World Bank, the Asian\nDevelopment Bank, and the UN Development Programme also provide assistance. In\nJune 1998, Nepal submitted its memorandum on a foreign trade regime to the\nWorld Trade Organization and in May 2000 began direct negotiations on its\naccession.",
    "openai_summarised_points": [
      "• Since 2000, Nepal's merchandise trade balance has shown improvement, primarily due to the growth of the carpet and garment industries.",
      "• In the fiscal year 2000–2001, Nepal's exports increased by 14%, outpacing the 4.5% growth in imports, which contributed to a 4% reduction in the trade deficit from the previous year, lowering it to $749 million.",
      "• The European Union has recently become the largest purchaser of Nepalese ready-made garments, as well as fruits and vegetables including apples, pears, tomatoes, various salads, peaches, nectarines, potatoes, and rice.",
      "• Exports to the European Union constituted 46.13% of Nepal’s total garment exports during this period.",
      "• Nepal’s economic growth is strongly influenced by the annual monsoon rains, which affect agricultural productivity and overall economic performance.",
      "• Between 1996 and 1999, Nepal’s real GDP growth averaged below 4%, but the growth rate recovered to 6% in 1999 before slightly declining to 5.5% in 2001.",
      "• Strong export performance, bolstered by earnings from tourism and external aid, has contributed to improvements in Nepal’s overall balance of payments and an increase in international reserves.",
      "• Nepal receives substantial external assistance from countries including the United Kingdom, the United States, Japan, Germany, and the Nordic countries.",
      "• Multilateral organizations such as the World Bank, the Asian Development Bank, and the United Nations Development Programme also provide significant financial and technical assistance to Nepal.",
      "• In June 1998, Nepal submitted its memorandum on a foreign trade regime to the World Trade Organization (WTO) and commenced direct negotiations for WTO accession in May 2000."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:02:40.373361",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1403,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "Since the turn of the millennium, Nepal's merchandise trade balance demonstrated notable improvement, a trend largely attributed to the expansion of key export sectors such as the carpet and garment industries. These industries, which had been developing steadily in the preceding decades, gained increased international market access and demand, thereby enhancing Nepal’s export earnings. The growth in these sectors not only contributed to higher export volumes but also helped diversify the country’s export base beyond traditional agricultural products. This diversification was crucial in stabilizing the trade balance and reducing the persistent trade deficits that had characterized Nepal’s economy in earlier years. In the fiscal year 2000–2001, Nepal experienced a significant increase in exports, which rose by 14%, a rate that substantially outpaced the 4.5% growth observed in imports during the same period. This differential growth between exports and imports played a pivotal role in narrowing the trade deficit by approximately 4% compared to the previous year, bringing it down to $749 million. The reduction in the trade deficit was particularly important for Nepal’s economic stability, as it alleviated some pressure on foreign exchange reserves and improved the country’s external financial position. The export growth was driven by both traditional products and emerging sectors, reflecting a broader structural shift in Nepal’s trade dynamics. During this period, the European Union emerged as the largest purchaser of Nepalese ready-made garments, underscoring the importance of the EU market for Nepal’s textile exports. In addition to garments, the EU also became a significant importer of Nepalese fruits and vegetables, including apples, pears, tomatoes, various types of salad greens, peaches, nectarines, potatoes, and rice. This diversification of export commodities to the EU not only expanded Nepal’s trade portfolio but also helped integrate Nepalese agricultural products into global supply chains. The preferential trade arrangements and tariff concessions offered by the EU under various trade agreements facilitated this growth, enabling Nepalese producers to compete more effectively in European markets. Exports to the European Union accounted for 46.13% of Nepal’s total garment exports during this period, highlighting the EU’s dominant role as a trading partner in this sector. This substantial share reflected both the competitive advantage of Nepalese garment producers in meeting EU demand and the strategic importance of the EU market for sustaining the growth of Nepal’s textile industry. The reliance on the EU market also underscored the need for Nepal to maintain compliance with international quality standards and trade regulations to preserve market access. This dependency, however, made Nepal vulnerable to fluctuations in EU demand and changes in trade policies, emphasizing the importance of continued diversification of export destinations. Nepal’s economic growth remained strongly influenced by the annual monsoon rains, which played a critical role in determining agricultural productivity and, by extension, the overall economic performance of the country. Since agriculture accounted for a significant portion of Nepal’s GDP and employed a large segment of the population, the variability of monsoon rainfall directly impacted crop yields, food security, and rural incomes. Favorable monsoon seasons typically led to increased agricultural output, higher rural consumption, and greater demand for goods and services, thereby stimulating broader economic activity. Conversely, poor monsoon performance often resulted in reduced agricultural productivity, increased vulnerability to food shortages, and slower economic growth. Between 1996 and 1999, Nepal’s real GDP growth averaged below 4%, reflecting a period of economic challenges marked by political instability, structural constraints, and external shocks. However, the growth rate recovered to 6% in 1999, signaling a rebound driven by improved agricultural output, expanding service sectors, and stronger export performance. This recovery demonstrated the economy’s resilience and the positive effects of policy reforms aimed at liberalizing trade and investment. Despite this improvement, the growth rate slightly declined to 5.5% in 2001, influenced by a combination of domestic and international factors, including fluctuating commodity prices, political uncertainties, and external economic conditions. The strong export performance during this period, supported by earnings from tourism and external aid, contributed significantly to improvements in Nepal’s overall balance of payments and an increase in international reserves. Tourism, as a major source of foreign exchange, benefited from Nepal’s rich cultural heritage and natural attractions, attracting a growing number of international visitors. External aid, both financial and technical, provided crucial support for development projects, infrastructure improvements, and social programs, thereby enhancing economic stability and growth prospects. The combined effect of these factors helped Nepal manage external vulnerabilities, reduce dependence on short-term borrowing, and build a more sustainable economic foundation. Nepal received substantial external assistance from a variety of bilateral partners, including the United Kingdom, the United States, Japan, Germany, and the Nordic countries. These countries contributed aid in the form of grants, concessional loans, technical expertise, and capacity-building initiatives aimed at promoting economic development, poverty reduction, and institutional strengthening. The support from these bilateral donors was often coordinated to align with Nepal’s national development priorities and to complement efforts by multilateral institutions. This external assistance played a vital role in addressing infrastructure deficits, enhancing human capital, and fostering economic diversification. In addition to bilateral aid, multilateral organizations such as the World Bank, the Asian Development Bank (ADB), and the United Nations Development Programme (UNDP) provided significant financial and technical assistance to Nepal. These institutions supported a wide range of projects spanning infrastructure development, education, health, governance reforms, and environmental sustainability. Their involvement also facilitated policy dialogue, knowledge transfer, and capacity development, helping Nepal implement structural reforms and improve governance frameworks. The multilateral assistance was instrumental in mobilizing resources, attracting investment, and promoting inclusive growth across various sectors of the economy. In a strategic move to integrate more fully into the global trading system, Nepal submitted its memorandum on a foreign trade regime to the World Trade Organization (WTO) in June 1998. This memorandum outlined Nepal’s trade policies, tariff structures, and regulatory frameworks, providing transparency and signaling its commitment to adhere to international trade norms. Following this submission, Nepal commenced direct negotiations for WTO accession in May 2000, engaging with existing WTO members to address concerns and align its trade policies with WTO requirements. This accession process was a critical step in Nepal’s efforts to liberalize its trade regime, enhance market access, and attract foreign investment, thereby supporting long-term economic growth and development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:38.215528",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 7548,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Resources",
    "text": "Tourists trekking in Annapurna region in western Nepal. Tourism plays a vital\nrole in Nepal's economy.\n\nProgress has been made in exploiting Nepal's natural resources, tourism, and\nhydroelectricity. With eight of the world's 10 highest mountain peaks,\nincluding Mount Everest at 8,848.86 m. In the early 1990s, one large public\nsector project and a number of private projects were planned; some have been\ncompleted. The most significant private sector financed hydroelectric projects\ncurrently in operation are the Khimti Khola (60 MW) and the Bhote Koshi\nProject (36 MW). The project is still undergoing and has dependency on China,\nIndia and Japan to take the further steps.\n\nUpper Tamakoshi hydropower, biggest hydropower in Nepal. Kulekhani dam also\nknown as \"Indra sarobar\"or \"Kulekhani Reservoir\" combinely producing 106 MW,\nin Makwanpur, Nepal Middle Marsyangdi Hydropower Station, producing 70 MW.\nNepal has significant potential to generate hydropower, which it plans to\nexport across South Asia.\n\nNepal has 83,000 MW of theoretical and 42,133 MW of technically/financially\nviable hydroelectric potential, however the total installed capacity, at\npresent, is 2500 MW and increasing.\n\nThe environmental impact of Nepal's hydroelectric Own calendar (Bikram Sambat)\nNew year in mid- April projects has been limited by the fact that most are\n\"run-of-the-river\" with only one storage project undertaken to date. The\nlargest hydroelectric plant under consideration is the West Seti Dam (750 MW)\nstorage project dedicated to exports to be built by the private sector.\nNegotiations with India for a power purchase agreement have been underway for\nseveral years, but agreement on pricing and financing remains a problem.\nCurrently demand for electricity is increasing at 8-10% a year whereas Nepal's\noption to have agreement with India will make this fulfilment against demand.\nAs of June 2022 surplus electricity up to 364 MWp by Nepal is exported to\nIndia.\n\nPopulation pressure on natural resources is increasing. Over-population is\nalready straining the \"carrying capacity\" of the middle hill areas,\nparticularly the Kathmandu Valley, resulting in the depletion of forest cover\nfor crops, fuel, and fodder and contributing to erosion and flooding. Although\nsteep mountain terrain makes exploitation difficult, mineral surveys have\nfound small deposits of limestone, magnesite, zinc, copper, iron, mica, lead,\nand cobalt. Coal mining is also done with 11522 tones produced in 2018 alone.\n\nThe development of hydroelectric power projects also cause some tension with\nlocal indigenous groups, recently[_when?_] empowered by Nepal's ratification\nof ILO Convention 169.",
    "openai_summarised_points": [
      "• Tourism plays a vital role in Nepal's economy, exemplified by activities such as trekking in the Annapurna region in western Nepal.",
      "• Progress has been made in exploiting Nepal's natural resources, tourism sector, and hydroelectricity generation, leveraging the presence of eight of the world's ten highest mountain peaks, including Mount Everest at 8,848.86 meters.",
      "• In the early 1990s, Nepal planned one large public sector hydroelectric project alongside several private projects, some of which have been completed.",
      "• The most significant private sector-financed hydroelectric projects currently operational are the Khimti Khola Hydroelectric Project with a capacity of 60 MW and the Bhote Koshi Project with 36 MW capacity.",
      "• The hydroelectric sector development is ongoing and dependent on cooperation and support from China, India, and Japan for further progress.",
      "• The Upper Tamakoshi Hydropower Plant is the largest hydropower facility in Nepal.",
      "• The Kulekhani Dam, also known as \"Indra Sarobar\" or \"Kulekhani Reservoir,\" combined with other facilities, produces a total of 106 MW and is located in Makwanpur district.",
      "• The Middle Marsyangdi Hydropower Station produces 70 MW of electricity.",
      "• Nepal possesses significant hydropower potential and plans to export electricity across South Asia.",
      "• The country has an estimated 83,000 MW of theoretical hydroelectric potential and 42,133 MW of technically and financially viable potential.",
      "• Despite this potential, Nepal’s total installed hydroelectric capacity currently stands at approximately 2,500 MW and is gradually increasing.",
      "• The environmental impact of Nepal’s hydroelectric projects has been limited due to the predominance of \"run-of-the-river\" projects, with only one storage project undertaken to date.",
      "• The largest hydroelectric plant under consideration is the West Seti Dam, a 750 MW storage project intended primarily for export, to be developed by the private sector.",
      "• Negotiations with India regarding a power purchase agreement for the West Seti Dam have been ongoing for several years, with pricing and financing issues yet to be resolved.",
      "• Electricity demand in Nepal is increasing at an annual rate of 8-10%, and agreements with India are expected to help meet this growing demand.",
      "• As of June 2022, Nepal exports surplus electricity of up to 364 MWp to India.",
      "• Population pressure is increasing on Nepal’s natural resources, particularly in the middle hill areas such as the Kathmandu Valley, where overpopulation is straining the \"carrying capacity.\"",
      "• This population pressure has led to depletion of forest cover used for crops, fuel, and fodder, contributing to soil erosion and increased flooding.",
      "• Although Nepal’s steep mountainous terrain complicates resource exploitation, mineral surveys have identified small deposits of limestone, magnesite, zinc, copper, iron, mica, lead, and cobalt.",
      "• Coal mining is active in Nepal, with a production volume of 11,522 tonnes recorded in 2018.",
      "• The development of hydroelectric power projects has caused tensions with local indigenous groups, who have been recently empowered by Nepal’s ratification of the International Labour Organization (ILO) Convention 169."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:02:54.221231",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2667,
      "bullet_points_count": 21
    },
    "generated_detailed_content": "Tourism has long served as a cornerstone of Nepal's economy, with activities such as trekking in the Annapurna region of western Nepal exemplifying its significance. The Annapurna circuit, renowned for its diverse landscapes and cultural richness, attracts thousands of domestic and international visitors annually, contributing substantially to local livelihoods and national revenue. This region's trekking routes traverse a variety of ecological zones, from subtropical forests to alpine meadows, providing not only recreational opportunities but also employment in hospitality, guiding, and transportation sectors. The influx of tourists has spurred the development of infrastructure and services, further embedding tourism as a vital economic pillar. In tandem with tourism, Nepal has made considerable progress in harnessing its abundant natural resources, particularly in the sectors of tourism and hydroelectricity generation. The country's unique geographical position, hosting eight of the world's ten highest mountain peaks—including Mount Everest, which stands at 8,848.86 meters—has provided a distinctive advantage in attracting climbers and adventurers worldwide. This topographical wealth has also facilitated the exploitation of hydropower potential, given the numerous fast-flowing rivers descending from the Himalayas. Over recent decades, Nepal has sought to capitalize on these assets to stimulate economic growth and reduce energy deficits. During the early 1990s, Nepal embarked on a strategic plan to develop its hydroelectric capacity by initiating one large public sector project alongside multiple private sector ventures. This mixed approach aimed to leverage both government resources and private investment to accelerate infrastructure development. Several of these private projects reached completion, marking a shift toward greater private sector participation in energy generation. This period laid the foundation for subsequent expansion in hydropower capacity and diversification of energy sources. Among the most significant private sector-financed hydroelectric projects currently operational are the Khimti Khola Hydroelectric Project and the Bhote Koshi Project. The Khimti Khola project boasts a capacity of 60 megawatts (MW), while the Bhote Koshi facility generates 36 MW. These projects exemplify successful private investment in Nepal’s energy sector, contributing to the national grid and alleviating power shortages. Their operation has demonstrated the viability of private-public partnerships in addressing Nepal’s growing electricity demand and has encouraged further private sector involvement. The development of Nepal’s hydroelectric sector remains an ongoing process, heavily reliant on cooperation and support from neighboring countries such as China, India, and Japan. These nations have provided technical expertise, financial assistance, and infrastructural support critical for advancing hydropower projects. Regional collaboration has been essential, given Nepal’s landlocked status and the transboundary nature of many river systems. Joint efforts aim to optimize resource utilization, enhance grid connectivity, and facilitate electricity trade within South Asia. The Upper Tamakoshi Hydropower Plant stands as the largest hydropower facility in Nepal, symbolizing a milestone in the country’s energy infrastructure. With a substantial installed capacity, this plant plays a pivotal role in meeting domestic electricity demand and reducing reliance on imported energy. Its completion marked a significant achievement in harnessing Nepal’s hydroelectric potential, showcasing the capability to undertake large-scale projects within the country. Another notable facility is the Kulekhani Dam, also known as \"Indra Sarobar\" or the \"Kulekhani Reservoir,\" located in Makwanpur district. This dam, combined with associated hydropower stations, produces a total of 106 MW of electricity. The reservoir’s multipurpose design supports power generation, irrigation, and flood control, highlighting the integrated approach to resource management. Kulekhani’s contribution to the national grid underscores the importance of storage-type hydropower projects in Nepal’s energy mix. The Middle Marsyangdi Hydropower Station further complements Nepal’s energy portfolio by producing 70 MW of electricity. Situated on the Marsyangdi River, this run-of-the-river project exemplifies the utilization of Nepal’s riverine resources to generate clean energy. Its operation has helped stabilize electricity supply and foster regional development by providing reliable power to surrounding communities. Nepal possesses significant hydropower potential, positioning itself as a prospective electricity exporter within South Asia. The country’s mountainous terrain and abundant water resources offer an estimated 83,000 MW of theoretical hydroelectric potential. Of this, approximately 42,133 MW is considered technically and financially viable, indicating substantial scope for future development. These figures reflect the untapped capacity that, if harnessed effectively, could transform Nepal into a key energy supplier in the region. Despite this vast potential, Nepal’s total installed hydroelectric capacity currently stands at approximately 2,500 MW, with gradual increases over time. This disparity between potential and actual capacity underscores the challenges faced in project implementation, including financial constraints, infrastructural limitations, and regulatory hurdles. Nonetheless, ongoing efforts aim to bridge this gap through policy reforms, investment incentives, and international partnerships. The environmental impact of Nepal’s hydroelectric projects has been relatively limited, primarily due to the predominance of run-of-the-river schemes. These projects typically have smaller ecological footprints compared to large storage dams, as they do not require extensive reservoir flooding. To date, Nepal has undertaken only one major storage project, minimizing habitat disruption and preserving riverine ecosystems. This approach aligns with sustainable development principles and addresses concerns related to biodiversity conservation and community displacement. Among the largest hydroelectric plants under consideration is the West Seti Dam, a 750 MW storage project intended primarily for electricity export. This ambitious initiative is planned for development by the private sector and represents a significant step toward scaling up Nepal’s energy production capabilities. The project’s focus on export markets reflects Nepal’s strategic objective to leverage its hydropower resources for regional economic integration and revenue generation. Negotiations with India regarding a power purchase agreement (PPA) for the West Seti Dam have been ongoing for several years. These discussions have centered on pricing structures and financing arrangements, which remain unresolved. The protracted nature of these negotiations highlights the complexities inherent in cross-border energy trade, including tariff disputes, investment risks, and regulatory coordination. Successful resolution of these issues is critical for advancing the project and realizing its economic benefits. Electricity demand in Nepal is increasing at an annual rate of 8 to 10 percent, driven by population growth, urbanization, and industrialization. To meet this rising demand, Nepal has entered into agreements with India, facilitating electricity imports and exports that help balance supply and demand fluctuations. These bilateral arrangements contribute to regional energy security and provide Nepal with access to supplementary power during peak consumption periods. As of June 2022, Nepal exports surplus electricity of up to 364 megawatt peak (MWp) to India, reflecting its growing capacity to generate excess power beyond domestic needs. This export capability not only generates foreign exchange earnings but also strengthens Nepal’s position as a regional energy player. The ability to supply surplus electricity underscores the progress made in expanding hydropower infrastructure and operational efficiency. Population pressure has increasingly strained Nepal’s natural resources, particularly in the middle hill areas such as the Kathmandu Valley. Overpopulation in these regions has exceeded the \"carrying capacity,\" leading to environmental degradation and resource depletion. The intensified demand for land, water, and forest products has challenged sustainable management practices and heightened vulnerability to natural hazards. This demographic pressure has resulted in the depletion of forest cover, which traditionally provided essential resources such as crops, fuelwood, and fodder. The loss of vegetative cover has exacerbated soil erosion, reducing land fertility and agricultural productivity. Additionally, diminished forest buffers have contributed to increased flooding and landslide risks, posing threats to human settlements and infrastructure. Nepal’s steep mountainous terrain presents inherent challenges to resource exploitation, complicating access and increasing operational costs. Nonetheless, mineral surveys have identified small deposits of various minerals, including limestone, magnesite, zinc, copper, iron, mica, lead, and cobalt. These mineral resources offer potential for economic diversification and industrial development, although their extraction remains limited by geographic and infrastructural constraints. Coal mining in Nepal remains active, with a recorded production volume of 11,522 tonnes in 2018. This modest output contributes to the country’s energy mix, primarily for local consumption in industries and households. The coal sector, while not a dominant energy source, provides an alternative to imported fuels and supports regional economic activities. The development of hydroelectric power projects has occasionally led to tensions with local indigenous groups. These communities have become increasingly empowered following Nepal’s ratification of the International Labour Organization (ILO) Convention 169, which recognizes the rights of indigenous and tribal peoples. This legal framework has strengthened indigenous participation in decision-making processes related to natural resource management and development projects. Consequently, hydroelectric initiatives have had to navigate complex social dynamics, balancing infrastructure expansion with respect for indigenous rights and cultural heritage.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:50.696196",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 21,
      "generated_content_length": 10521,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Macro-economic trend",
    "text": "This is a chart of trend of gross domestic product of Nepal at market prices\nestimated by the International Monetary Fund and EconStats with figures in\nmillions of Nepali Rupees.[_citation needed_]\n\nYear | Gross domestic product\n---|---\n1960 | 3,870\n1965 | 5,602\n1970 | 8,768\n1975 | 16,571\n1980 | 23,350\n1985 | 46,586\n1990 | 103,415\n1995 | 219,174\n2000 | 379,488\n\nThe following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP (in billion US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in billion US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n**1980** | 7.68  | 491  | 2.26  | −2.3%  | 9.8%  | n/a\n**1985** | 12.59  | 718  | 3.21  | 6.1%  | 4.1%  | n/a\n**1990** | 18.37  | 936  | 4.44  | 4.6%  | 8.9%  | n/a\n**1995** | 26.70  | 1197  | 5.38  | 3.5%  | 7.7%  | n/a\n**2000** | 36.70  | 1494  | 6.54  | 6.1%  | 3.4%  | 50.8%\n**2005** | 49.01  | 1865  | 9.33  | 3.5%  | 4.5%  | 45.1%\n**2006** | 52.23  | 1969  | 10.32  | 3.4%  | 8.0%  | 42.9%\n**2007** | 55.47  | 2076  | 11.78  | 3.4%  | 6.2%  | 37.9%\n**2008** | 59.99  | 2232  | 14.31  | 6.1%  | 6.7%  | 36.8%\n**2009** | 63.10  | 2335  | 14.66  | 4.5%  | 12.6%  | 39.5%\n**2010** | 66.94  | 2465  | 18.25  | 4.8%  | 9.6%  | 35.4%\n**2011** | 70.66  | 2591  | 21.69  | 3.4%  | 9.6%  | 32.4%\n**2012** | 75.34  | 2756  | 21.70  | 4.7%  | 8.3%  | 34.5%\n**2013** | 79.32  | 2897  | 22.16  | 3.5%  | 9.9%  | 31.9%\n**2014** | 85.55  | 3115  | 22.72  | 6.0%  | 9.0%  | 27.6%\n**2015** | 89.78  | 3252  | 24.36  | 4.0%  | 7.2%  | 25.7%\n**2016** | 91.02  | 3267  | 24.52  | 0.4%  | 9.9%  | 25.0%\n**2017** | 100.97  | 3583  | 28.97  | 9.0%  | 4.5%  | 25.0%\n**2018** | 111.09  | 3897  | 33.11  | 7.6%  | 4.1%  | 31.1%\n**2019** | 121.06  | 4199  | 34.19  | 6.7%  | 4.6%  | 34.0%\n**2020** | 122.69  | 4180  | 33.43  | −2.4%  | 6.2%  | 43.3%\n**2021** | 134.00  | 4461  | 36.93  | 4.8%  | 3.6%  | 43.3%\n**2022** | 151.64  | 4964  | 41.18  | 5.6%  | 6.3%  | 42.7%\n**2023** | 160.16  | 5153  | 40.91  | 2.0%  | 7.8%  | 47.1%\n**2024** | 169.12  | 5348  | 43.67  | 3.1%  | 5.6%  | 49.7%",
    "openai_summarised_points": [
      "• The gross domestic product (GDP) of Nepal at market prices, estimated by the International Monetary Fund and EconStats, increased from 3,870 million Nepali Rupees in 1960 to 379,488 million Nepali Rupees in 2000, showing substantial economic growth over four decades.",
      "• In 1960, Nepal's GDP was 3,870 million Nepali Rupees, rising to 5,602 million in 1965, 8,768 million in 1970, 16,571 million in 1975, 23,350 million in 1980, 46,586 million in 1985, 103,415 million in 1990, 219,174 million in 1995, and reaching 379,488 million in 2000.",
      "• From 1980 to 2024, Nepal's GDP in billion US dollars (PPP) grew from 7.68 in 1980 to an estimated 169.12 in 2024, reflecting significant economic expansion over this period.",
      "• GDP per capita in Nepal increased from US$491 (PPP) in 1980 to an estimated US$5,348 (PPP) in 2024, indicating improved average income levels.",
      "• Nepal's nominal GDP in billion US dollars rose from US$2.26 in 1980 to an estimated US$43.67 in 2024, demonstrating growth in the economy's market value at current prices.",
      "• Real GDP growth rates fluctuated over the years, with a negative growth of −2.3% in 1980, peaking at 9.0% in 2017, and experiencing a decline of −2.4% in 2020, likely due to global or national economic disruptions, before recovering to an estimated 3.1% in 2024.",
      "• Inflation rates in Nepal showed variability, starting at 9.8% in 1980, decreasing to a low of 3.4% in 2000, peaking at 12.6% in 2009, and stabilizing around 5.6% in 2024.",
      "• Government debt as a percentage of GDP was not available (n/a) before 2000, then recorded at 50.8% in 2000, decreased to a low of 25.0% in 2016 and 2017, and rose again to an estimated 49.7% in 2024, indicating fluctuations in public debt relative to economic output.",
      "• Key years of economic indicators include:",
      "• 1980: GDP (PPP) 7.68 billion US$, GDP per capita 491 US$, nominal GDP 2.26 billion US$, real GDP growth −2.3%, inflation 9.8%, government debt n/a.",
      "• 1990: GDP (PPP) 18.37 billion US$, GDP per capita 936 US$, nominal GDP 4.44 billion US$, real GDP growth 4.6%, inflation 8.9%, government debt n/a.",
      "• 2000: GDP (PPP) 36.70 billion US$, GDP per capita 1,494 US$, nominal GDP 6.54 billion US$, real GDP growth 6.1%, inflation 3.4%, government debt 50.8%.",
      "• 2010: GDP (PPP) 66.94 billion US$, GDP per capita 2,465 US$, nominal GDP 18.25 billion US$, real GDP growth 4.8%, inflation 9.6%, government debt 35.4%.",
      "• 2020: GDP (PPP) 122.69 billion US$, GDP per capita 4,180 US$, nominal GDP 33.43 billion US$, real GDP growth −2.4%, inflation 6.2%, government debt 43.3%.",
      "• 2024 (estimated): GDP (PPP) 169.12 billion US$, GDP per capita 5,348 US$, nominal GDP 43.67 billion US$, real GDP growth 3.1%, inflation 5.6%, government debt 49.7%.",
      "• The data reflects Nepal's transition from a low-income to a lower-middle-income economy with steady growth in GDP and GDP per capita, alongside fluctuations in inflation and government debt levels over more than four decades."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:03:11.911539",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2105,
      "bullet_points_count": 16
    },
    "generated_detailed_content": "The gross domestic product (GDP) of Nepal at market prices exhibited substantial growth over the latter half of the twentieth century, as documented by estimates from the International Monetary Fund and EconStats. In 1960, Nepal's GDP stood at 3,870 million Nepali Rupees, reflecting the nascent stage of the country's economic development. Over the subsequent four decades, this figure expanded dramatically, reaching 379,488 million Nepali Rupees by the year 2000. This growth trajectory underscores the considerable economic transformation Nepal underwent during this period, moving from a predominantly agrarian economy toward more diversified economic activities and increased market integration. A more detailed examination of Nepal’s GDP at market prices reveals a steady and accelerating increase throughout the decades. Beginning at 3,870 million Nepali Rupees in 1960, the GDP rose to 5,602 million by 1965, marking an early phase of economic expansion. By 1970, the GDP had climbed further to 8,768 million, and this upward trend continued into the mid-1970s with a GDP of 16,571 million in 1975. The growth momentum persisted into the 1980s, with GDP reaching 23,350 million in 1980 and nearly doubling to 46,586 million by 1985. The 1990s witnessed even more rapid expansion, with GDP figures increasing to 103,415 million in 1990 and more than doubling again to 219,174 million by 1995. By the turn of the millennium in 2000, Nepal’s GDP had surged to 379,488 million Nepali Rupees, reflecting the cumulative effects of economic reforms, infrastructure development, and increasing integration with regional and global markets. When measured in terms of purchasing power parity (PPP) and expressed in billion US dollars, Nepal’s GDP also demonstrated significant growth from 1980 through 2024. In 1980, the GDP (PPP) was recorded at 7.68 billion US dollars, a modest figure indicative of the country’s limited industrial base and low income levels at that time. Over the next four decades, Nepal’s economy expanded substantially, with the GDP (PPP) increasing to an estimated 169.12 billion US dollars by 2024. This remarkable growth reflects improvements in productivity, diversification of economic activities, and enhanced economic policies that supported sustained development. The increase in GDP (PPP) also highlights Nepal’s gradual integration into the global economy, benefiting from increased trade, remittances, and foreign investment. GDP per capita, a key indicator of average income and living standards, similarly exhibited a marked upward trend over the same period. In 1980, Nepal’s GDP per capita stood at US$491 (PPP), underscoring the low-income status of the majority of its population. By 2024, this figure was projected to reach US$5,348 (PPP), indicating a more than tenfold increase in average income levels. This rise in GDP per capita reflects improvements in education, health, and infrastructure, as well as the expansion of economic opportunities across various sectors. The increase also suggests progress in poverty reduction and human development, although disparities and challenges remain in ensuring equitable growth across all regions and demographic groups. In nominal terms, Nepal’s GDP in billion US dollars also showed consistent growth from 1980 to 2024. Starting at US$2.26 billion in 1980, the nominal GDP rose to an estimated US$43.67 billion by 2024. This increase in nominal GDP reflects not only real economic growth but also the effects of inflation and currency valuation changes over time. The growth in nominal GDP signifies an expanding economy with increased production and consumption, greater government revenues, and enhanced capacity for public and private investment. However, nominal GDP figures must be interpreted alongside inflation and other macroeconomic variables to assess the real economic progress accurately. Real GDP growth rates in Nepal have fluctuated over the years, reflecting the country’s vulnerability to both internal and external shocks as well as the uneven pace of economic reforms and development. In 1980, Nepal experienced a contraction with a real GDP growth rate of −2.3%, indicative of economic difficulties that may have stemmed from adverse weather conditions, political instability, or external economic pressures. Growth rates improved over the following decades, with notable peaks such as the 9.0% growth recorded in 2017, which represented a period of robust economic expansion driven by increased investment, infrastructure development, and improved governance. However, the economy faced setbacks as well, including a decline of −2.4% in 2020, likely attributable to the global COVID-19 pandemic and its associated disruptions to trade, tourism, and remittance inflows. By 2024, real GDP growth was estimated to recover to 3.1%, reflecting gradual normalization and ongoing efforts to stimulate economic activity. Inflation rates in Nepal have exhibited considerable variability over the past several decades, influenced by domestic economic conditions, supply shocks, and global commodity price fluctuations. In 1980, inflation was relatively high at 9.8%, reflecting price pressures in a developing economy with limited market integration and supply constraints. Inflation rates decreased over the subsequent decades, reaching a low of 3.4% in 2000, which suggested a period of relative price stability and effective monetary policy management. However, inflation surged again to a peak of 12.6% in 2009, likely due to rising food and fuel prices as well as domestic supply-side challenges. In recent years, inflation has stabilized, with an estimated rate of 5.6% in 2024, consistent with moderate price increases that support economic growth while maintaining purchasing power. Government debt as a percentage of GDP was not recorded or is unavailable prior to 2000, but from that year onward, data reveals fluctuations in Nepal’s public debt relative to its economic output. In 2000, government debt stood at 50.8% of GDP, reflecting the fiscal pressures associated with development spending and budget deficits. Over the next decade and a half, the debt-to-GDP ratio declined, reaching a low of 25.0% in 2016 and 2017, indicative of improved fiscal management, economic growth, and possibly debt restructuring or forgiveness. However, the ratio increased again in subsequent years, rising to an estimated 49.7% in 2024. This upward trend may be attributed to increased borrowing for infrastructure projects, social programs, and responses to economic shocks, highlighting the ongoing challenges Nepal faces in balancing fiscal sustainability with developmental needs. Key economic indicators at specific benchmark years illustrate Nepal’s macroeconomic evolution in greater detail. In 1980, the GDP measured at purchasing power parity was 7.68 billion US dollars, with a GDP per capita of 491 US dollars and a nominal GDP of 2.26 billion US dollars. The real GDP growth rate was negative at −2.3%, inflation was relatively high at 9.8%, and government debt data was not available. By 1990, GDP (PPP) had more than doubled to 18.37 billion US dollars, GDP per capita rose to 936 US dollars, and nominal GDP reached 4.44 billion US dollars. The real GDP growth rate improved to 4.6%, inflation moderated slightly to 8.9%, while government debt figures remained unavailable. The year 2000 marked a significant milestone, with GDP (PPP) at 36.70 billion US dollars and GDP per capita at 1,494 US dollars, reflecting continued economic progress. Nominal GDP stood at 6.54 billion US dollars, real GDP growth was a healthy 6.1%, inflation was low at 3.4%, and government debt was recorded at 50.8% of GDP. By 2010, Nepal’s economy had expanded further, with GDP (PPP) reaching 66.94 billion US dollars and GDP per capita increasing to 2,465 US dollars. Nominal GDP rose sharply to 18.25 billion US dollars, real GDP growth remained positive at 4.8%, inflation climbed to 9.6%, and government debt had decreased to 35.4% of GDP. The year 2020 reflected the impact of global and domestic disruptions, with GDP (PPP) at 122.69 billion US dollars and GDP per capita at 4,180 US dollars. Nominal GDP was 33.43 billion US dollars, but real GDP growth contracted by −2.4%, inflation was moderate at 6.2%, and government debt increased to 43.3% of GDP. Looking ahead to 2024, estimates project GDP (PPP) to reach 169.12 billion US dollars, GDP per capita to rise to 5,348 US dollars, and nominal GDP to climb to 43.67 billion US dollars. Real GDP growth is expected to recover to 3.1%, inflation to stabilize around 5.6%, and government debt to increase to 49.7% of GDP. Collectively, these data points reflect Nepal’s transition from a low-income country to a lower-middle-income economy characterized by steady growth in GDP and GDP per capita over more than four decades. This economic progress has been accompanied by fluctuations in inflation and government debt levels, which underscore the challenges of managing macroeconomic stability while pursuing development objectives. The trends highlight the dynamic nature of Nepal’s economy, shaped by internal policy decisions, external shocks, and evolving global economic conditions.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:47.226295",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 16,
      "generated_content_length": 9240,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Nepal",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Statistics",
    "text": "**GDP:** purchasing power parity - $84.37 Billion (2018 est.)[_dubious –\ndiscuss_]\n\n**GDP - real growth rate:** 21.77% (2017)\n\n**GDP - per capita:** purchasing power parity (current international $) -\n$2700 (2017 est.) **GDP - composition by sector:**\n_agriculture:_ 17%\n_industry:_ 13.5%\n_services:_ 60.5% (2017 est.)\n_tourism:_ 9%\n\n**Population below poverty line:** 25.6% (2017/2018)\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ 3.2%\n_highest 10%:_ 29.8% (1995–96)\n\n**Inflation rate (consumer prices):** 4.5% (2017)\n\n**Labour force:** 4 million (2016 est.) [_citation needed_]\n\n**Labor force - by occupation:** agriculture 19%, services 69%, industry 12%\n(2014 est.)\n\n**Unemployment rate:** 1.47% (2017 est.)\n\n**Budget:**\n_revenues:_ $5.954 billion\n_expenditures:_ $5.974 billion, including capital expenditures of $NA (2017\nest.)\n\n**Industries:** tourism, carpet, textile; small rice, jute, sugar, and oilseed\nmills; cigarette; cement and brick production\n\n**Industrial production growth rate:** 10.9% (2017 est.):\n\n**Electricity - production:** 41,083 GWh (2017)\n\n**Electricity - production by source:**\n_fossil fuel:_ 7.5%\n_hydro:_ 91.5%\n_nuclear:_ 0.3%\n_other:_ 0.7% (2001)\n\n**Available energy:** 6957.73 GWh (2017) **NEA Hydro:** 2290.78 GWh (2014)\n**NEA Thermal:** 9.56 GWh (2014) **purchase (total):** 2331.17 GWh (2014)\n**India (purchase):** 2175.04 GWh (2017) **Nepal (IPP):** 1258.94 GWh (2014)\n\n**Electricity - consumption:** 4,776.53 GWh (2017)\n\n**Electricity - exports:** 856 GWh (2001) **Electricity - imports:** 12 GWh\n(2001)\n\n**Oil - production:** 0 barrels per day (0 m3/d) (2001 est.)\n\n**Oil - consumption:** 1,600 barrels per day (250 m3/d) 2001\n\n**Agriculture - products:** Fruits and vegetables, mostly: apples, pears,\ntomatoes, peaches, nectarines, potatoes, rice, maize, wheat, sugarcane, root\ncrops, milk, and buffalo meat.\n\n**Exports:** $1.29 billion f.o.b., but does not include unrecorded border\ntrade with India (2020 est.)\n\n**Exports - commodities:** carpets, clothing, leather goods, jute goods, grain\n\n**Exports - partners:** India 56.6%, US 11.5%, Turkey 9.2% (2016 est.)\n\n**Imports:** $1.6 billion f.o.b. (2021 est.)\n\n**Imports - commodities:** gold, machinery and equipment, petroleum products,\nelectrical goods, medicine\n\n**Imports - partners:** India 70.1%, China 10.3%, UAE 2.6%, Singapore 2.1%,\nSaudi Arabia 1.2%. (2016 est.)\n\n**Debt - external:** $9.1 billion (2022 est.)\n\n**Economic aid - recipient:** $2 billion (FY 2019/20)\n\n**Currency:** 1 Nepali rupee (NPR) = 100 paisa\n\n**Fiscal year:** 16 July - 15 July",
    "openai_summarised_points": [
      "• Nepal's GDP based on purchasing power parity was estimated at $84.37 billion in 2018, though this figure is marked as dubious and requires further verification.",
      "• The real GDP growth rate of Nepal was recorded at 21.77% in 2017.",
      "• GDP per capita in terms of purchasing power parity (current international dollars) was approximately $2,700 in 2017.",
      "• The composition of Nepal’s GDP by sector in 2017 was as follows: agriculture contributed 17%, industry 13.5%, and services 60.5%, with tourism accounting for 9%.",
      "• The proportion of the population living below the poverty line was 25.6% during the fiscal year 2017/2018.",
      "• Household income or consumption distribution from 1995–96 showed the lowest 10% of the population held 3.2% of income, while the highest 10% held 29.8%.",
      "• The inflation rate based on consumer prices was 4.5% in 2017.",
      "• Nepal’s labor force was estimated at 4 million people in 2016, though this figure lacks citation.",
      "• Labor force distribution by occupation in 2014 was 19% in agriculture, 69% in services, and 12% in industry.",
      "• The unemployment rate stood at 1.47% in 2017.",
      "• Nepal’s government budget for 2017 estimated revenues at $5.954 billion and expenditures at $5.974 billion, with capital expenditures unspecified.",
      "• Key industries in Nepal include tourism, carpet manufacturing, textiles, small-scale rice, jute, sugar, and oilseed mills, cigarette production, cement, and brick manufacturing.",
      "• Industrial production growth rate was 10.9% in 2017.",
      "• Electricity production in Nepal totaled 41,083 GWh in 2017.",
      "• Electricity production by source in 2001 was predominantly hydroelectric at 91.5%, fossil fuels at 7.5%, nuclear at 0.3%, and other sources at 0.7%.",
      "• Available energy in 2017 was 6,957.73 GWh; Nepal Electricity Authority (NEA) hydroelectric production was 2,290.78 GWh in 2014, and NEA thermal production was 9.56 GWh in 2014.",
      "• Total electricity purchases in 2014 amounted to 2,331.17 GWh; purchases from India were 2,175.04 GWh in 2017, and Nepal’s Independent Power Producers (IPP) generated 1,258.94 GWh in 2014.",
      "• Electricity consumption was 4,776.53 GWh in 2017.",
      "• Electricity exports were 856 GWh in 2001, while imports were 12 GWh in the same year.",
      "• Nepal produced no oil in 2001, with oil production recorded at 0 barrels per day.",
      "• Oil consumption was 1,600 barrels per day (250 m3/d) in 2001.",
      "• Major agricultural products include fruits and vegetables such as apples, pears, tomatoes, peaches, nectarines, potatoes, as well as rice, maize, wheat, sugarcane, root crops, milk, and buffalo meat.",
      "• Exports were valued at $1.29 billion f.o.b. in 2020, excluding unrecorded border trade with India.",
      "• Principal export commodities include carpets, clothing, leather goods, jute goods, and grain.",
      "• Major export partners in 2016 were India (56.6%), the United States (11.5%), and Turkey (9.2%).",
      "• Imports were valued at $1.6 billion f.o.b. in 2021.",
      "• Key import commodities include gold, machinery and equipment, petroleum products, electrical goods, and medicine.",
      "• Major import partners in 2016 were India (70.1%), China (10.3%), the United Arab Emirates (2.6%), Singapore (2.1%), and Saudi Arabia (1.2%).",
      "• Nepal’s external debt was estimated at $9.1 billion in 2022.",
      "• The country received approximately $2 billion in economic aid during the fiscal year 2019/20.",
      "• The official currency of Nepal is the Nepali rupee (NPR), subdivided into 100 paisa.",
      "• Nepal’s fiscal year runs from 16 July to 15 July of the following year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:03:26.351757",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2579,
      "bullet_points_count": 32
    },
    "generated_detailed_content": "Nepal's gross domestic product (GDP) based on purchasing power parity (PPP) was estimated at approximately $84.37 billion in 2018; however, this figure has been marked as dubious and requires further verification due to inconsistencies in data sources and reporting methodologies. Despite this uncertainty, available economic indicators provide insight into the country's growth trajectory and sectoral composition. In 2017, Nepal recorded a remarkably high real GDP growth rate of 21.77%, reflecting a period of rapid economic expansion influenced by various factors including increased investment, remittances, and recovery from the 2015 earthquake. The GDP per capita, measured in terms of purchasing power parity and expressed in current international dollars, stood at around $2,700 in 2017, indicating modest improvements in average income levels compared to previous years. The structural composition of Nepal’s economy in 2017 revealed a predominance of the services sector, which accounted for 60.5% of the GDP. Agriculture contributed 17% to the GDP, underscoring its continued importance as a livelihood source for a significant portion of the population, while industry represented 13.5%. Within the services sector, tourism emerged as a vital component, constituting approximately 9% of the GDP, driven by Nepal’s rich cultural heritage and natural attractions such as the Himalayas. Despite these economic advances, socioeconomic challenges persisted, as evidenced by the poverty rate; during the fiscal year 2017/2018, 25.6% of the population lived below the poverty line, highlighting ongoing disparities in wealth distribution and access to resources. Income inequality remained a notable issue, as reflected in household income and consumption distribution data from 1995–96. The lowest 10% of the population held only 3.2% of the income, whereas the highest 10% controlled 29.8%, indicating a significant concentration of wealth among the upper income brackets. Inflation, measured by the consumer price index, was recorded at 4.5% in 2017, reflecting moderate price increases that could impact purchasing power and cost of living. The labor force was estimated at around 4 million people in 2016, although this figure lacks citation and should be interpreted cautiously. Occupational distribution within the labor force in 2014 showed that 19% were engaged in agriculture, 69% in services, and 12% in industry, illustrating a labor market heavily skewed towards the service sector. The unemployment rate remained relatively low at 1.47% in 2017, suggesting near-full employment, although underemployment and informal sector work were prevalent. Government fiscal management in 2017 projected revenues of $5.954 billion against expenditures of $5.974 billion, indicating a slight budget deficit. Details regarding capital expenditures were unspecified, leaving gaps in the understanding of investment priorities and infrastructure development. Nepal's industrial landscape was characterized by key sectors such as tourism, carpet manufacturing, textiles, and small-scale production of rice, jute, sugar, and oilseed mills. Additionally, industries producing cigarettes, cement, and bricks contributed to the industrial output. The industrial production growth rate in 2017 was robust at 10.9%, signaling expansion and diversification within manufacturing and related sectors. Electricity production in Nepal totaled 41,083 gigawatt-hours (GWh) in 2017, reflecting the country’s growing energy needs and capacity. Historical data from 2001 indicated that electricity generation was predominantly hydroelectric, constituting 91.5% of total production, with fossil fuels accounting for 7.5%, nuclear energy 0.3%, and other sources 0.7%. This reliance on hydroelectric power aligns with Nepal’s abundant water resources and topography conducive to hydropower development. In 2017, the available energy supply was recorded at 6,957.73 GWh. The Nepal Electricity Authority (NEA) reported hydroelectric production of 2,290.78 GWh and thermal production of 9.56 GWh in 2014. Total electricity purchases in 2014 amounted to 2,331.17 GWh, with significant imports from India reaching 2,175.04 GWh in 2017. Independent Power Producers (IPP) contributed 1,258.94 GWh in 2014, highlighting the role of private sector participation in energy generation. Electricity consumption in 2017 was 4,776.53 GWh, demonstrating increasing domestic demand. In 2001, Nepal exported 856 GWh of electricity while importing 12 GWh, reflecting its position as a net exporter of electricity at that time. Nepal did not produce any oil in 2001, with oil production recorded at zero barrels per day. However, oil consumption was significant, amounting to 1,600 barrels per day (approximately 250 cubic meters per day) in the same year, indicating reliance on imports to meet energy needs for transportation and industry. Agriculture remained a cornerstone of Nepal’s economy, with major products including a variety of fruits and vegetables such as apples, pears, tomatoes, peaches, nectarines, and potatoes. Staple crops like rice, maize, and wheat were widely cultivated, alongside sugarcane and root crops. Livestock products such as milk and buffalo meat also contributed to agricultural output and rural livelihoods. Nepal’s export sector was valued at $1.29 billion free on board (f.o.b.) in 2020, excluding substantial unrecorded border trade with India, which plays a critical role in informal economic exchanges. Principal export commodities comprised carpets, clothing, leather goods, jute products, and grain, reflecting the country’s comparative advantages in labor-intensive manufacturing and agricultural produce. In 2016, Nepal’s major export partners included India, which accounted for 56.6% of exports, followed by the United States with 11.5%, and Turkey at 9.2%. Imports were valued at $1.6 billion f.o.b. in 2021, with key commodities including gold, machinery and equipment, petroleum products, electrical goods, and medicine, underscoring the country’s dependence on imported capital goods and essential supplies. Major import partners in 2016 were India (70.1%), China (10.3%), the United Arab Emirates (2.6%), Singapore (2.1%), and Saudi Arabia (1.2%), reflecting regional trade linkages and supply chain networks. Nepal’s external debt was estimated at $9.1 billion in 2022, representing obligations to foreign creditors that influence fiscal policy and development financing. The country received approximately $2 billion in economic aid during the fiscal year 2019/20, highlighting the significance of foreign assistance in supporting development projects, infrastructure, and social programs. The official currency of Nepal is the Nepali rupee (NPR), which is subdivided into 100 paisa, serving as the medium of exchange and unit of account within the domestic economy. Nepal’s fiscal year runs from 16 July to 15 July of the following year, aligning government budgeting and financial planning with this annual cycle.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:25:40.565355",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 32,
      "generated_content_length": 7033,
      "generation_type": "detailed_expansion"
    }
  }
]