[
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Nutmeg is one of Grenada's key exports\n\nThe **economy of Grenada** is largely tourism-based, small, and open economy.\nBetween the 1980s and the 2000s, the main thrust of Grenada's economy has\nshifted from agriculture to services, with tourism serving as the leading\nforeign currency earning sector. The country's principal export crops are the\nspices nutmeg and mace (Grenada is the world's second-largest producer of\nnutmeg after Indonesia). Other crops for export include cocoa, citrus fruits,\nbananas, cloves, and cinnamon. Manufacturing industries in Grenada operate\nmostly on a small scale, including production of beverages and other\nfoodstuffs, textiles, and the assembly of electronic components for export.\n\nEconomic growth picked up in the late 1990s following slow growth and domestic\nfiscal adjustment in the early years of the decade. Despite an expansionary\nfiscal policy, the public debt remained moderate at around 50 percent of GDP\nas deficits were financed partly by privatization receipts. Since 2001,\neconomic growth has declined. The decline was caused by adverse shocks, such\nas a slowdown in the global economy and natural disasters. To deal with the\nshocks, fiscal policy became more expansionary, while privatization receipts\ndeclined. As a result, public debt increased sharply to near 110 percent of\nGDP in 2003. Economic conditions worsened when Hurricane Ivan hit the country\nin September 2004; progress in fiscal consolidation was impeded as government\nrevenues fell and policy priorities was shifted to post-hurricane relief.\n\nAlthough reconstruction has proceeded quickly with significant aid from the\ninternational community, tourism and agricultural activities remain weak and\nnearly offset the stimulus from the reconstruction boom. The country is still\nfacing the difficult task of reconstruction and recovery, while public debt is\nunsustainable and the government faces large financing gaps. In the years\nahead, reinvigorating growth will be a high priority, and continued efforts\nare needed to address vulnerabilities."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "The economy of Grenada is small, and tourism is its largest foreign exchange\nearner. Grenada shares a common central bank with Organisation of Eastern\nCaribbean States (OECS) and holds East Caribbean dollars as its currency.\nAfter tourism, Grenada relies heavily on agricultural exports, mainly\ndifferent types of spices. Nutmeg, wheat flour, and various fruits make up the\nmajority of Grenada's exports (per 2017). Grenada has suffered many economic\ndrawbacks since becoming a nation. A major concern is the rising fiscal\ndeficit and heavy debt crippling its government operations. Hurricane Ivan in\n2004 led to serious setbacks for Grenada, along with the Great Recession in\n2008 as the United States of America is one of Grenada's largest trade\npartners. Grenada was listed nine spaces above the bottom when it came to\ntotal debt in 126 developing countries in 2017."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic Performance",
    "text": "After experiencing GDP growth averaging nearly six percent a year in the late\n1990s, economic growth declined considerably after 2001 as a result of a\ndecline in the tourism industry following the September 11, 2001, terrorist\nattacks, and damages caused by several hurricanes.\n\nThe economy of Grenada was brought to a near standstill in September 2004 by\nHurricane Ivan, which damaged or destroyed 90 percent of the country's\nbuildings, including some tourist facilities. In July 2005, Hurricane Emily\nstruck Grenada who was still recovering from the impact of Hurricane Ivan.\nBesides the negative impacts to the tourism industry, the two devastating\nhurricanes destroyed or significantly damaged a large percentage of Grenada's\ntree crops, which may take years to recover.\n\nAs the damage of Hurricane Ivan to the economy exceeded 200 percent of GDP,\neconomic growth registered a negative growth of three percent in 2004,\ncompared with a positive growth rate of 5.8 percent in 2003. Although signs of\nrecovery have been seen in Grenada after the damage inflicted by Hurricanes\nIvan and Emily, economic conditions remain difficult; GDP is projected at a\ngrowth rate of only one percent for 2005.\n\nWith the absence of sustained growth, the fiscal situation started to\ndeteriorate after 2001, reflecting a continued expansionary policy with a\nsharp increase in spending on social sectors, the wage bill, and goods and\nservices. As a result, the fiscal deficit rose to 8.5 percent of GDP in 2001\nfrom 3.2 percent in 2000. The fiscal situation remained shaky in 2002, with\nthe deficit widening to 19.2 percent of GDP due to dampened output from\nTropical Storm Lili. As the economy began to recover in 2003, the government\nbegan to take steps for fiscal consolidation, and the fiscal deficit fell to\n4.8 percent of GDP. Progress in fiscal consolidation was impeded in 2004 as\nthe government policy changed abruptly to post-hurricane relief. Meanwhile,\ngovernment revenues decreased as a result of the impact of the hurricanes on\nthe economy.\n\nWhile economic growth has declined since 2001 due to adverse shocks, including\na slowdown in the global economy and natural disasters, fiscal policy became\nmore expansionary when privatization receipts declined. As a result, public\ndebt has increased sharply to over 100 percent of GDP since 2002; it remained\nas high as near 130 percent of GDP in 2004.\n\nGrenada is a member of the Eastern Caribbean Central Bank (ECCB), which\nmanages monetary policy and issues a common currency for all the member\ncountries. Inflation has remained low and stable within the framework of the\ncurrency board arrangement, with inflation averaging at two percent over the\npast 15 years."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Balance of Payments",
    "text": "Grenada's current account balance has remained in large deficit due to its\nheavy dependence on import of most consumer goods and domestic investment.\nFollowing an average deficit of around 44 percent of GDP from 1997 to 2000,\nthe current account deficit has increased to over 35 percent of GDP since 2001\ndue to higher import demand combined with lower receipts from tourism and\nnutmeg exports. The current account deficits are financed by inflows of\nforeign direct investment, official grants and loans, and commercial borrowing\nby the private sector. Grenada's economy is vulnerable to external shocks\nconsidering its high dependence on tourism, exports, and imports of most of\nthe goods that are consumed or invested domestically. It is also prone to\nother adverse shocks such as natural disasters."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Regional Situation",
    "text": "In the aftermath of Hurricanes Ivan and Emily, the priority now for Grenada is\nto continue the recovery process necessary to restore the infrastructure that\nwas devastated by the hurricanes. The international community has disbursed\nsignificant amounts of aid, including financial help under the International\nMonetary Fund's emergency assistance policy for natural disasters and\nassistance from the World Bank and the Caribbean Development Bank.\n\nIn the context of regional economic development, further integration into the\nEastern Caribbean regional economy will help enhance Grenada's competitiveness\nand increase its scale of economy in production, marketing and distribution.\nThe country also launched a citizenship by investment program in 2013."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "International Monetary Fund",
    "text": "The nation of Grenada joined the International Monetary Fund (IMF) on August\n27, 1975. Since then, Grenada has been under heavy review with the IMF, who\nhave made Grenada eligible for special drawing rights. Special drawing rights\n(abbreviated SDR) are supplementary foreign exchange reserve assets defined\nand maintained by the IMF. Based on Grenada's performances, both economically\nand policy wise, Grenada can be eligible for more SDRs. In the previous years,\nGrenada and the IMF have been working closely to grow and sustain their\neconomy."
  },
  {
    "chapter_name": "Economy of Grenada",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Statistics",
    "text": "Grenada electricity production 1980-2019\n\n* **GDP:** purchasing power parity \\- $1.401 billion (2015 est.)\n* **GDP -real growth rate:** 4.6% (2015 est.)\n* **GDP -per capita:** purchasing power parity - $13,100 (2015 est.)\n* **GDP - composition by sector:**\n* _Agriculture:_ 6.2%\n* _Industry:_ 14.3%\n* _Services:_ 79.5% (2015 est.)\n* **Population below poverty line:** 38% (2008 est.)\n* **Household income or consumption by percentage share:**\n* _lowest 10%:_ NA%\n* _highest 10%:_ NA%\n* **Inflation rate (consumer prices):** 1.3% (2015)\n* **Labor force:** 59,900 (2013)\n* **Labor force - by occupation:**\n* Services 69%\n* Agriculture 11%\n* Industry 20% (2008 est.)\n* **Unemployment rate:** 33.5% (2013)\n* **Budget:**\n* _Revenues:_ $191.8 million\n* _Expenditures:_ $230.9 million (2012 est)\n* **Industries:** food and beverages, textiles, light assembly operations, tourism, construction\n* **Industrial production growth rate:** -1% (2015 est.)\n* **Electricity - production:** 193 GWh (2012 est.)\n* **Electricity - production by source:**\n* _Fossil fuel:_ 98.2%\n* _Hydro:_ 0%\n* _Nuclear:_ 0%\n* _Other:_ 1.4% (2012 est.)\n* **Electricity - consumption:** 178 GWh (2012 est.)\n* **Electricity - exports:** 0 kWh (2013 est.)\n* **Electricity - imports:** 0 kWh (2013 est.)\n* **Agriculture - products:** bananas, cocoa, nutmeg, mace, citrus, avocados, root crops, sugarcane, maize, vegetables\n* **Exports:** $43.8 million (2015 est.)\n* **Exports - commodities:** nutmeg, bananas, cocoa, fruit and vegetables, clothing, mace\n* **Exports - partners:** Nigeria 44.7%, St. Lucia 10.8%, Antigua and Barbuda 7.3%, St. Kitts and Nevis 6.6%, Dominica 6.6%, United States 5.8% (2015)\n* **Imports:** $310.4 million (2015 est.)\n* **Imports - commodities:** food, manufactured goods, machinery, chemicals, fuel\n* **Imports - partners:** Trinidad and Tobago 49.6%, United States 16.4% (2015)\n* **Debt - external:** $679 million (2013 est.)\n* **Economic aid \\- recipient:** $8.3 million (1995)\n* **Currency:** 1 East Caribbean dollar (EC$) = 100 cents\n* **Exchange rates:** East Caribbean dollars (EC$) per US$1 – 2.7000 (fixed rate since 1976)\n* **Fiscal year:** calendar year"
  }
]