[
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofSan Marino** is a developed free-market economy focused on\nindustries such as tourism, banking, and the manufacture of ceramics,\nclothing, fabrics, furniture, paints, spirits, tiles, and wine. Taken\ntogether, the manufacturing and financial sector make up more than half of the\nnational GDP. The primary sector contribution to the GDP of the country is\nmarginal, with the main agricultural products being wine and cheeses. In\naddition, San Marino sells collectible postage stamps to philatelists."
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "San Marino's per-capita GDP stands at almost $53,000 in 2023, placing the\ncountry 17th in the world. Overall, the per capita level of output and\nstandard of living is comparable to the richest regions of Italy. Most of the\nfood, water, and other raw resources are imported from Italy, including also\nthe totality of electricity and natural gas. Taxes, especially on labor and\ncapital income, are generally much lower than in Italy, therefore, there are\nextremely strict requirements to obtain citizenship.\n\nFollowing the global recession of 2007–2008, San Marino's economy contracted\nconsiderably, especially in the finance and banking sector. As a result, GDP\ndecreased by 40% between 2008 and 2019, and unemployment, which was\npractically nonexistent until 2007, arose to around 5–8 % in the years\nfollowing the great recession. During the same period, banks' deposits\nplummeted, going from almost 14 billion euros in 2008 to 5.2 billion. An\nimportant liquidity crisis followed suit, also made worse by the absence of a\nlender of last resort, as San Marino is not part of the European Union. As a\nconsequence of these events, several banks have been bailed-out by the\ngovernment, including Cassa di Risparmio, the main bank of the country. Still,\nthe banking system remains weak, with balance sheets that are impaired by Non-\nPerforming Loans, which amount to 114% of the country's GDP.\n\nThe country is shifting away from an economic model typical of tax havens,\nreliant on banks and tax secrecy. Major steps in this direction were taken in\n2010 with the abolition of anonymous companies and in 2017 with the abolition\nof banking secrecy. Currently, San Marino actively cooperates with\ninternational organizations, especially the Council of Europe and the European\nUnion, for what regards fighting against money laundering and terrorism\nfinancing. As a result, San Marino was removed from the Italian blacklist of\ntax havens in 2014, and from that of Ecofin in 2017."
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Public finances",
    "text": "In the years preceding the great recession, San Marino's public finances were\nin very good shape, with a central government budget surplus and no national\ndebt. During the global downturn, the government adopted measures to dampen\nthe shock on the real economy and to bail out financial institutions, which\ncame at a high price for the soundness of public finances. The official\nestimates place government debt at 32% of GDP in 2020, however, the actual\nvalue is equal to 86% according to the International Monetary Fund, which\ntakes a broader view in considering government's liabilities.\n\nWhile San Marino does not issue public debt securities that are traded on\nfinancial markets, its creditworthiness is monitored by the rating agency\nFitch. The current rating of BB+ is the result of several downgrades that\noccurred during and after the great recession: from AA to A in 2009 and to BBB\nin 2016."
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Economic relations with Italy and the EU",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( December 2023)__(Learn how and when to remove this message)_\n---|---\n\nIn the years following the Italian unification of 1861, several treaties were\nsigned between San Marino and the newborn Kingdom of Italy. The first such\ntreaty addressing economic issues was signed in 1865 for the introduction of\nthe Sammarinese lira, which was equivalent to the Italian lira and fully\nrecognized as a legal tender in both countries. Probably the most important\nagreement is the convention of friendship and good neighborhood that was\nsigned in 1939, during fascism. This treaty establishes a customs union with\nItaly and sets out some limitations on the carrying out of certain economic\nactivities, like tobacco cultivation, gambling, and radio broadcasting.\n\nWhile San Marino is not part of the European Union, it had a customs union\nwith it since 1991, and there is an open border between the two areas. San\nMarino also uses the Euro as its currency since 2000, when an agreement was\nsigned with Italy, on behalf of the EU. A new monetary convention was signed\nin 2012 directly with the EU, covering a wider range of financial and monetary\nissues. San Marino is also allowed to mint Sammarinese Euro coins, which are\nprinted by the Italian mint in Rome but feature a different national design\nthan Italian Euro coins. Since they are minted in a very limited amount, they\nare rare and highly appreciated by coin collectors.\n\nThe main commercial partner of San Marino is Italy, with which around 88% of\nexports and 78% of imports take place (2017). Other important partners are the\nother countries of the EU, especially France and Germany."
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in San\nMarino is Retail Trade with 756 companies followed by Wholesale Trade and\nServices with 753 and 752 companies respectively."
  },
  {
    "chapter_name": "Economy of San Marino",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Coins and stamps",
    "text": "One of the sources of income from tourism comes from the sale of historic\ncoins and stamps. In 1894, San Marino issued the first commemorative stamps\nand since then that has been part of a large livelihood in the republic. All\n10 of the Post Offices of San Marino sell these stamps and collectible coins,\nincluding \"Legal Gold Tender Coins\".\n\nTraditional economic activities in San Marino were food crops, sheep farming,\nand stone quarrying. Today farming activities focus on grain, vines, and\norchards, as well as animal husbandry (cattle and swine)."
  }
]