[
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of North Macedonia\" – news **·** newspapers **·**\nbooks **·** scholar **·** JSTOR _( November 2010)__(Learn how and when to\nremove this message)_  \n---|---  \n  \nThe **economy of North Macedonia** has become more liberalized, with an\nimproved business environment, since its independence from Yugoslavia in 1991,\nwhich deprived the country of its key protected markets and the large transfer\npayments from Belgrade. Prior to independence, North Macedonia was\nYugoslavia's poorest republic (only 5% of the total federal output of goods\nand services). An absence of infrastructure, United Nations sanctions on its\nlargest market (the Federal Republic of Yugoslavia), and a Greek economic\nembargo hindered economic growth until 1996.\n\nWorker remittances and foreign aid have softened the subsequent volatile\nrecovery period. The country's GDP has increased each year except in 2001,\nrising by 5% in 2000. However, growth in 1999 was held down by the severe\nregional economic dislocations caused by the Kosovo War.\n\nSuccessful privatization in 2000 boosted the country's reserves to over $700\nmillion. Also, the leadership demonstrated a continuing commitment to economic\nreform, free trade, and regional integration. The economy can meet its basic\nfood needs, and its coal and hydroelectric power needs, but depends on outside\nsources for all of its petroleum, natural gas, and most of its modern\nmachinery and parts. Inflation jumped to 11% in 2000 largely due to higher oil\nprices,[_citation needed_] but the currency has calmed since the exchange rate\nwas normalised when the EU Stabilisation and Association Agreement entered\ninto force in 2004.",
    "openai_summarised_points": [
      "• Since gaining independence from Yugoslavia in 1991, North Macedonia's economy has become more liberalized with an improved business environment, despite losing access to key protected markets and large transfer payments previously provided by Belgrade.",
      "• Before independence, North Macedonia was the poorest republic within Yugoslavia, contributing only 5% to the total federal output of goods and services.",
      "• Economic growth was hindered until 1996 due to a lack of infrastructure, United Nations sanctions on its largest market—the Federal Republic of Yugoslavia—and a Greek economic embargo.",
      "• Worker remittances and foreign aid played a significant role in mitigating the volatility of the country's economic recovery period following independence.",
      "• The country’s GDP increased annually except in 2001, with a notable growth rate of 5% recorded in the year 2000.",
      "• Economic growth in 1999 was suppressed due to severe regional economic disruptions caused by the Kosovo War.",
      "• Successful privatization efforts in 2000 increased North Macedonia’s reserves to over $700 million.",
      "• The government demonstrated ongoing commitment to economic reform, free trade, and regional integration during this period.",
      "• North Macedonia’s economy is self-sufficient in meeting its basic food requirements and coal and hydroelectric power needs.",
      "• The country remains dependent on external sources for all petroleum, natural gas, and most modern machinery and parts.",
      "• Inflation rose sharply to 11% in 2000, primarily attributed to higher oil prices, although the currency stabilized following normalization of the exchange rate.",
      "• The normalization of the exchange rate occurred after the European Union Stabilisation and Association Agreement came into force in 2004."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:16.162589",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1859,
      "bullet_points_count": 12
    },
    "generated_detailed_content": "Since gaining independence from the Socialist Federal Republic of Yugoslavia in 1991, North Macedonia underwent a significant transformation in its economic structure, moving toward a more liberalized market economy with a progressively improved business environment. This transition was marked by the loss of access to key protected markets and the cessation of substantial transfer payments that had previously been provided by the federal government in Belgrade. These transfers had played an important role in sustaining the republic’s economy during the Yugoslav era, and their removal posed immediate challenges for economic stability and growth. Despite these setbacks, North Macedonia pursued policies aimed at liberalization and economic reform, seeking to establish a self-sustaining economy integrated into regional and global markets. Prior to independence, North Macedonia was the poorest of the six republics constituting Yugoslavia, contributing only about 5% to the total federal output of goods and services. This limited economic contribution reflected structural weaknesses, including underdeveloped industrial capacity, limited infrastructure, and a predominantly agrarian economy with low productivity levels. The republic’s economic underperformance was compounded by its peripheral geographic location and lack of access to major seaports, which constrained trade opportunities. These factors collectively resulted in a relatively low standard of living compared to other Yugoslav republics, setting a challenging baseline for the newly independent state. The initial years following independence were marked by significant economic difficulties that hindered growth until approximately 1996. One major impediment was the lack of adequate infrastructure, which limited the country’s ability to attract investment and develop competitive industries. Additionally, the imposition of United Nations sanctions on the Federal Republic of Yugoslavia (comprising Serbia and Montenegro), which was North Macedonia’s largest trading partner, severely disrupted traditional trade flows and economic relations. Compounding these challenges was a Greek economic embargo, which was implemented due to a dispute over the country’s name and had a pronounced impact on trade and investment. Together, these factors created a hostile external environment that constrained economic recovery and development during the early 1990s. During this period of economic volatility, worker remittances and foreign aid proved crucial in mitigating the adverse effects of the transition and supporting the country’s fragile economy. Many Macedonian workers emigrated to Western Europe and other regions, sending back remittances that provided a vital source of foreign currency and household income. These inflows helped sustain domestic consumption and investment at a time when formal economic activity was limited. Simultaneously, international donors and organizations provided foreign aid aimed at stabilizing the economy, promoting structural reforms, and supporting social programs. This external financial assistance played a stabilizing role, helping to bridge gaps in the country’s balance of payments and facilitating gradual economic adjustment. From the mid-1990s onward, North Macedonia’s gross domestic product (GDP) exhibited a generally positive trajectory, increasing annually with the sole exception of 2001, a year marked by internal conflict and political instability. The year 2000 was particularly notable, with the economy achieving a growth rate of approximately 5%, reflecting the initial benefits of liberalization policies and improved political stability. This period of growth was supported by ongoing structural reforms, increased investment, and the gradual normalization of trade relations with neighboring countries. However, the broader regional context continued to influence economic performance, as evidenced by the suppression of growth in 1999 due to severe disruptions caused by the Kosovo War. The conflict generated instability in the Balkans, disrupted trade routes, and created refugee flows that strained North Macedonia’s resources, all of which negatively impacted economic activity. Privatization efforts, which accelerated around the year 2000, played a pivotal role in strengthening North Macedonia’s economic foundations. The government undertook a series of measures to transfer state-owned enterprises into private hands, aiming to improve efficiency, attract investment, and stimulate competition. These reforms were largely successful, leading to an increase in the country’s foreign exchange reserves to over $700 million. The accumulation of reserves enhanced the government’s ability to manage external shocks and maintain macroeconomic stability. Moreover, the privatization process was part of a broader commitment by the government to economic reform, free trade, and regional integration, signaling a strategic orientation toward aligning North Macedonia with European and global economic systems. In terms of resource self-sufficiency, North Macedonia was able to meet its basic food requirements domestically, reflecting a relatively strong agricultural sector capable of supplying staple crops and livestock products. Additionally, the country was self-sufficient in coal production and hydroelectric power generation, which provided the foundation for its energy needs. These resources contributed to energy security and reduced dependence on external suppliers for basic energy inputs. However, despite these strengths, North Macedonia remained heavily dependent on imports for other critical resources, including all petroleum and natural gas supplies. Furthermore, the country relied on foreign sources for most modern machinery and industrial parts, underscoring the need for continued industrial development and technological upgrading. The economic environment in North Macedonia during this period was also characterized by inflationary pressures, with inflation rising sharply to approximately 11% in the year 2000. This surge in inflation was primarily attributed to higher global oil prices, which increased the cost of energy and transportation, thereby exerting upward pressure on consumer prices. Despite this inflationary spike, the national currency, the Macedonian denar, stabilized following the normalization of the exchange rate. This normalization was facilitated by the entry into force of the European Union Stabilisation and Association Agreement (SAA) in 2004, which provided a framework for political and economic cooperation between North Macedonia and the EU. The SAA contributed to improved investor confidence, trade liberalization, and macroeconomic stability, reinforcing the country’s path toward integration with European markets and institutions.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:20.036852",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 12,
      "generated_content_length": 6841,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "| This article's **factual accuracy isdisputed**. Relevant discussion may be\nfound on the talk page. Please help to ensure that disputed statements are\nreliably sourced. _( June 2012)__(Learn how and when to remove this message)_\n---|---\n\nNorth Macedonia's economy has almost always been completely agricultural in\nnature from the beginning of the Ottoman Empire when it was part of the Sanjak\nof Üsküp and Salonica vilayet. It concentrated on pasture farming and vineyard\ngrowing. Opium poppy, introduced into the region in 1835, became an important\ncrop as well by the late 19th century, and remained so until the 1930s.\n\nThe role of industry in the region's economy increased during the industrial\nage. The geographical region of Macedonia was responsible for large outputs of\ntextiles and several other goods in the Ottoman Empire. However, outdated\ntechniques to produce the goods persisted. The stagnation of the regional\neconomy began under the rule of the Kingdom of Serbia.[_citation needed_]\n\nWhen World War II ended, the local economy began to experience revitalization\nby way of subsidies from Federal Belgrade. The subsidies assisted North\nMacedonia to redevelop its \"lost\" industry and shift its agricultural-centered\neconomy to an industry-centered economy with new hearts of industry emerging\nall over the country in Veles, Bitola, Štip and Kumanovo. Previously, Skopje\nwas the only industrial centre in North Macedonia, this expanded to several\nother cities during Socialist Yugoslavia.\n\nAfter the fall of Socialist Yugoslavia, the economy experienced several shocks\nthat damaged the local economy. Starting with the Western embargo on the\nYugoslavian common market, and ending with the Greek embargo on Macedonia over\nthe Macedonia naming dispute.[_citation needed_] The economy began to recover\nin 1995 and experienced a full recovery after the 2001 insurgency by ethnic\nAlbanians. Macedonia's GDP grew by an average of 6% annually until the 2008\nfinancial crisis, when its economy contracted. The crisis had little impact on\nthe country. North Macedonia today maintains a low debt-to-GDP ratio and is\nexperiencing a revitalized investment interest by companies from Turkey,\nAlgeria, Albania, and others.",
    "openai_summarised_points": [
      "• North Macedonia's economy was predominantly agricultural from the beginning of the Ottoman Empire, during which it was part of the Sanjak of Üsküp and the Salonica vilayet, focusing mainly on pasture farming and vineyard cultivation.",
      "• Opium poppy was introduced to the region in 1835 and became a significant crop by the late 19th century, maintaining its importance until the 1930s.",
      "• During the industrial age, the role of industry in the Macedonian region increased, with Macedonia producing large quantities of textiles and various other goods within the Ottoman Empire, although production methods remained outdated.",
      "• Economic stagnation in the region began under the rule of the Kingdom of Serbia, contributing to a decline in economic development.",
      "• After World War II, North Macedonia’s economy was revitalized through subsidies from Federal Belgrade, which helped redevelop lost industries and transition the economy from agriculture to industry-centered.",
      "• New industrial centers emerged in cities such as Veles, Bitola, Štip, and Kumanovo, expanding beyond Skopje, which had previously been the sole industrial hub during Socialist Yugoslavia.",
      "• Following the dissolution of Socialist Yugoslavia, North Macedonia’s economy suffered multiple shocks, including the Western embargo on the Yugoslavian common market and the Greek embargo related to the Macedonia naming dispute.",
      "• The economy began recovering in 1995 and achieved full recovery after the 2001 insurgency by ethnic Albanians.",
      "• Between the recovery period and the 2008 financial crisis, Macedonia’s GDP grew at an average annual rate of 6%.",
      "• The 2008 global financial crisis caused an economic contraction in North Macedonia, but its impact was relatively minor.",
      "• Currently, North Macedonia maintains a low debt-to-GDP ratio and is experiencing renewed investment interest from companies originating in Turkey, Algeria, Albania, and other countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:24.767223",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2223,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "From the onset of Ottoman rule, the economy of the region now known as North Macedonia was predominantly agrarian, reflecting the broader economic patterns of the Sanjak of Üsküp and the Salonica vilayet, administrative divisions within the empire. The rural economy centered primarily on pasture farming, which supported livestock rearing, and the cultivation of vineyards, both of which were well-suited to the region’s varied terrain and climate. These agricultural activities formed the backbone of local livelihoods, with small-scale farming communities sustaining themselves and contributing to the Ottoman market system. The emphasis on pastoralism and viticulture underscored the limited diversification of the economy during this period, as industrial development was minimal and largely confined to artisanal production. A notable agricultural development occurred in 1835 with the introduction of the opium poppy to the region. This crop quickly gained prominence due to its high value and demand, becoming a significant agricultural product by the late nineteenth century. The cultivation of opium poppies was integrated into the local economy, providing farmers with a lucrative cash crop that supplemented traditional agricultural outputs. Its importance persisted well into the early twentieth century, maintaining a key role until the 1930s when changing political and economic conditions, including shifts in international drug control policies, led to its decline. The opium poppy’s introduction and sustained cultivation illustrate the region’s adaptive agricultural practices and its integration into wider economic networks within the Ottoman Empire and beyond. The advent of the industrial age brought gradual changes to the Macedonian economy, as industrial activity began to expand within the Ottoman framework. Macedonia emerged as a notable producer of textiles, leveraging local raw materials and labor to manufacture fabrics and garments. In addition to textiles, the region produced a variety of other goods, contributing to the Ottoman Empire’s internal market and export capacity. However, despite this increased industrial output, production methods remained largely traditional and outdated, limiting efficiency and competitiveness. The persistence of artisanal techniques and the lack of modern machinery meant that Macedonian industry could not fully capitalize on the opportunities presented by industrialization, resulting in a mixed economic landscape where agriculture continued to dominate alongside nascent industrial ventures. Economic stagnation set in during the period of Serbian rule following the Balkan Wars and the dissolution of Ottoman control. The Kingdom of Serbia’s administration imposed policies and economic structures that failed to stimulate significant growth or modernization in the Macedonian region. This stagnation was characterized by a decline in investment, limited industrial development, and a general slowdown in economic activity. The region’s integration into the Serbian economy did not translate into improved infrastructure or expanded markets, and the legacy of Ottoman-era underdevelopment persisted. Consequently, the Macedonian economy experienced a prolonged period of economic decline, which hindered its ability to catch up with more industrialized parts of the Balkans and Europe. The aftermath of World War II marked a turning point for North Macedonia’s economy, as it became part of the Socialist Federal Republic of Yugoslavia. During this period, the economy was revitalized through substantial subsidies and economic planning directed from Federal Belgrade. These financial supports were instrumental in redeveloping industries that had been lost or damaged during the war and earlier periods of stagnation. The Yugoslav government’s emphasis on industrialization led to a strategic shift from an agriculture-based economy toward one centered on manufacturing and heavy industry. This transition was facilitated by state-led initiatives to build factories, improve infrastructure, and foster technological advancement, thereby laying the foundation for a more diversified and modern economic structure. Industrial development during the socialist era was not confined to the capital city of Skopje but spread to other urban centers, contributing to a more balanced regional economy. Cities such as Veles, Bitola, Štip, and Kumanovo emerged as important industrial hubs, each specializing in different sectors ranging from textiles and machinery to chemical production and food processing. This decentralization of industrial activity was part of broader Yugoslav policies aimed at reducing regional disparities and promoting economic self-sufficiency. The growth of these new industrial centers created employment opportunities, stimulated urbanization, and enhanced the overall economic resilience of North Macedonia within the Yugoslav federation. The dissolution of Socialist Yugoslavia in the early 1990s precipitated a series of economic shocks that severely impacted North Macedonia’s economy. The breakup disrupted established trade networks and economic cooperation within the Yugoslav common market, leading to a significant loss of markets and supply chains. Compounding these difficulties, North Macedonia faced a Western embargo on the Yugoslavian common market, which further restricted access to goods, capital, and investment. Additionally, the country was subjected to a Greek embargo related to the Macedonia naming dispute, which hindered trade and diplomatic relations with a key neighboring country. These combined pressures resulted in economic contraction, rising unemployment, and a decline in industrial output, challenging the newly independent state’s efforts to stabilize and grow its economy. Despite these initial setbacks, North Macedonia’s economy began to recover in 1995 as political stability improved and international relations gradually normalized. This recovery was bolstered by structural reforms, efforts to attract foreign investment, and initiatives to reintegrate into regional and global markets. The economy achieved full recovery following the 2001 insurgency by ethnic Albanians, a conflict that had posed significant risks to internal security and economic confidence. The resolution of this conflict and subsequent political agreements helped restore investor confidence and facilitated renewed economic growth. This period marked a critical phase in North Macedonia’s post-independence development, as the country sought to overcome the legacies of conflict and economic disruption. Between the mid-1990s recovery and the onset of the 2008 global financial crisis, North Macedonia experienced robust economic growth, with its gross domestic product (GDP) expanding at an average annual rate of approximately 6%. This growth was driven by a combination of factors, including increased foreign direct investment, expansion of export-oriented industries, and improvements in domestic consumption. The government’s commitment to market-oriented reforms, privatization of state-owned enterprises, and enhancement of the business environment contributed to this positive trajectory. The sustained GDP growth during this period reflected the country’s successful transition toward a more market-based economy and its integration into the global economic system. The global financial crisis of 2008 had a contractionary effect on North Macedonia’s economy, as it did on many countries worldwide. However, the impact was relatively minor compared to other nations, owing in part to the country’s limited exposure to high-risk financial instruments and its relatively conservative banking sector. While economic growth slowed and certain sectors faced challenges, North Macedonia avoided a deep recession, maintaining macroeconomic stability and continuing to attract investment. The resilience demonstrated during this period underscored the country’s improved economic fundamentals and prudent fiscal management. In the contemporary period, North Macedonia maintains a low debt-to-GDP ratio, reflecting sound fiscal policies and sustainable public finance management. This low level of public debt provides the country with greater economic flexibility and reduces vulnerability to external shocks. Additionally, North Macedonia has witnessed renewed interest from foreign investors, particularly companies originating from Turkey, Algeria, Albania, and other countries. These investments span various sectors, including manufacturing, services, and infrastructure, contributing to job creation and economic diversification. The inflow of foreign capital and expertise signals growing confidence in North Macedonia’s economic prospects and its strategic position as a gateway between Europe and the broader Balkan region.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:23.086313",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 8852,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic activity",
    "text": "Pelagonija, breadbasket region of North Macedonia.\n\nNorth Macedonia is vulnerable to economic developments in Europe - due to\nstrong banking and trade ties - and dependent on regional integration and\nprogress toward EU membership for continued economic growth. At independence\nin September 1991, North Macedonia was the least developed of the Yugoslav\nrepublics, producing a mere 5% of the total federal output of goods and\nservices. The collapse of the Socialist Federal Republic of Yugoslavia ended\ntransfer payments from the central government and eliminated advantages from\ninclusion in a de facto free trade area. An absence of infrastructure, UN\nsanctions on the downsized Yugoslavia, and a Greek economic embargo over a\ndispute about the country's constitutional name and flag hindered economic\ngrowth until 1996.[_citation needed_] Since then, North Macedonia has\nmaintained macroeconomic stability with low inflation, but it has so far\nlagged the region in attracting foreign investment and creating jobs, despite\nmaking extensive fiscal and business sector reforms. Official unemployment\nremains high at 24.6% (2015, Q4), but may be overstated based on the existence\nof an extensive gray market that is not captured by official statistics. In\nthe wake of the global economic downturn, North Macedonia has experienced\ndecreased foreign direct investment, lowered credit availability, and a large\ntrade deficit. However, as a result of conservative fiscal policies and a\nsound financial system, in 2010 the country credit rating improved slightly to\nBB+ and was kept at that level in 2011. Macroeconomic stability has been\nmaintained by a prudent monetary policy, which keeps the domestic currency\npegged against the euro. As a result, GDP growth was modest, but positive, in\n2010 and 2011, and inflation was under control. Latest data from North\nMacedonia's State Statistical Office show that overall, output for 2012\ndropped by 6.6 percent compared to 2011.\n\nAs of 2020, the country had signed free trade agreements with the Central\nEuropean Free Trade Agreement (CEFTA), the Stabilisation and Association\nAgreement with the European Union, the European Free Trade Association (EFTA)\nwith Switzerland, Norway, Iceland, and Liechtenstein, and bilateral agreements\nwith Turkey and Ukraine.",
    "openai_summarised_points": [
      "• North Macedonia is economically vulnerable to developments in Europe due to strong banking and trade ties, and its continued economic growth depends on regional integration and progress toward European Union (EU) membership.",
      "• At the time of its independence in September 1991, North Macedonia was the least developed republic within the former Yugoslavia, producing only 5% of the total federal output of goods and services.",
      "• The collapse of the Socialist Federal Republic of Yugoslavia resulted in the cessation of transfer payments from the central government and the loss of benefits from participation in a de facto free trade area.",
      "• Economic growth was hindered until 1996 by a lack of infrastructure, United Nations sanctions on the reduced Yugoslavia, and a Greek economic embargo related to disputes over North Macedonia’s constitutional name and flag.",
      "• Since 1996, North Macedonia has maintained macroeconomic stability characterized by low inflation, although it has lagged behind the region in attracting foreign investment and generating employment despite extensive fiscal and business sector reforms.",
      "• Official unemployment was reported at 24.6% in the fourth quarter of 2015, though this figure may be overstated due to a substantial gray market not reflected in official statistics.",
      "• Following the global economic downturn, North Macedonia experienced declines in foreign direct investment, reduced credit availability, and a significant trade deficit.",
      "• Conservative fiscal policies and a sound financial system contributed to a slight improvement in the country’s credit rating to BB+ in 2010, a rating which was maintained in 2011.",
      "• Macroeconomic stability has been supported by prudent monetary policy, including maintaining a domestic currency peg to the euro.",
      "• As a result of these policies, North Macedonia experienced modest but positive GDP growth in 2010 and 2011, with inflation remaining under control.",
      "• According to data from North Macedonia’s State Statistical Office, overall economic output in 2012 declined by 6.6% compared to 2011.",
      "• By 2020, North Macedonia had signed free trade agreements with the Central European Free Trade Agreement (CEFTA), the Stabilisation and Association Agreement with the European Union, the European Free Trade Association (EFTA) including Switzerland, Norway, Iceland, and Liechtenstein, as well as bilateral agreements with Turkey and Ukraine."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:34.188315",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2297,
      "bullet_points_count": 12
    },
    "generated_detailed_content": "North Macedonia's economy has demonstrated a pronounced vulnerability to economic developments within Europe, largely attributable to its strong banking and trade ties with the region. The country’s continued economic growth is closely linked to its degree of regional integration and progress toward European Union (EU) membership, which are seen as critical factors for enhancing trade opportunities, attracting foreign investment, and fostering sustainable development. This interdependence underscores the importance of political and economic reforms aligned with EU standards, as well as active participation in regional economic initiatives. At the moment of its independence in September 1991, North Macedonia was recognized as the least developed republic within the former Socialist Federal Republic of Yugoslavia. Despite being one of the constituent republics, it contributed only about 5% to the total federal output of goods and services, reflecting a relatively small industrial base and limited economic diversification compared to other republics such as Slovenia and Croatia. This underdevelopment was compounded by structural challenges inherited from the Yugoslav era, including outdated infrastructure and a reliance on federal subsidies and centralized economic planning. The disintegration of the Socialist Federal Republic of Yugoslavia had profound economic consequences for North Macedonia. The collapse resulted in the immediate cessation of transfer payments from the federal government, which had previously provided significant financial support to the republic. Additionally, North Macedonia lost the benefits of participation in a de facto free trade area that had facilitated the movement of goods, services, and labor within the federation. The sudden fragmentation of markets and supply chains disrupted established economic relationships, leading to a sharp contraction in industrial production and trade flows. Economic growth in North Macedonia was significantly hindered until 1996 by a combination of factors. The country faced a lack of adequate infrastructure necessary for economic development, including transportation networks, energy supply, and communication systems. Compounding these internal challenges were external pressures such as United Nations sanctions imposed on the reduced Yugoslavia (comprising Serbia and Montenegro), which indirectly affected North Macedonia’s trade and financial relations. Furthermore, a Greek economic embargo was enforced due to disputes over North Macedonia’s constitutional name and national symbols, particularly its flag. This embargo severely restricted trade with Greece, one of North Macedonia’s key neighbors and trading partners, further isolating the economy and limiting growth prospects. From 1996 onward, North Macedonia managed to maintain a degree of macroeconomic stability characterized by low inflation rates, which was a notable achievement given the turbulent economic environment of the preceding years. This stability was underpinned by fiscal and monetary reforms aimed at controlling inflation and stabilizing the domestic currency. Despite these reforms, the country lagged behind many of its regional peers in attracting foreign direct investment and generating sufficient employment opportunities. Structural challenges, including a relatively small market size, bureaucratic inefficiencies, and a persistent informal economy, continued to constrain economic dynamism and job creation. Official statistics reported an unemployment rate of 24.6% in the fourth quarter of 2015, highlighting significant labor market challenges. However, this figure is widely believed to overstate the true level of unemployment, as a substantial portion of economic activity occurs within the gray market, which is not captured by official data. The informal sector provides alternative employment opportunities for many individuals, albeit often in precarious and low-productivity jobs, thereby complicating efforts to accurately assess labor market conditions and design effective employment policies. The global economic downturn that began in 2008 had a noticeable impact on North Macedonia’s economy. The country experienced declines in foreign direct investment as global capital flows contracted and investor confidence waned. Credit availability also diminished, restricting the ability of businesses and households to finance consumption and investment. Simultaneously, the trade deficit widened significantly, reflecting reduced export revenues and continued reliance on imports. These factors collectively exerted downward pressure on economic growth and fiscal stability during this period. Despite these challenges, conservative fiscal policies and a sound financial system contributed to a modest improvement in North Macedonia’s credit rating. In 2010, the country’s sovereign credit rating was upgraded to BB+, a status it maintained in 2011. This improvement reflected prudent fiscal management, including efforts to control public expenditures and maintain budgetary discipline, as well as a relatively stable banking sector. The credit rating upgrade was an important signal to international investors and financial institutions, enhancing the country’s access to external financing on more favorable terms. Macroeconomic stability in North Macedonia has been further supported by prudent monetary policy, notably through the maintenance of a domestic currency peg to the euro. This fixed exchange rate regime has helped anchor inflation expectations and reduce exchange rate volatility, contributing to a predictable economic environment conducive to investment and trade. The central bank’s commitment to this policy framework has been a key factor in sustaining low inflation and fostering confidence among economic agents. As a result of these combined fiscal and monetary policies, North Macedonia experienced modest but positive gross domestic product (GDP) growth in 2010 and 2011. Economic expansion during this period was accompanied by inflation remaining under control, reinforcing the country’s macroeconomic stability. However, this growth was relatively subdued compared to pre-crisis levels and regional peers, reflecting persistent structural impediments and limited external demand. Contrasting with the modest growth of the early 2010s, data from North Macedonia’s State Statistical Office indicated that overall economic output declined by 6.6% in 2012 compared to the previous year. This contraction was attributed to a combination of domestic and external factors, including reduced industrial production, lower investment levels, and ongoing challenges in the export sector. The economic downturn underscored the vulnerability of North Macedonia’s economy to external shocks and the need for continued reform and diversification. By 2020, North Macedonia had actively pursued the expansion of its trade relations through the signing of multiple free trade agreements. These included membership in the Central European Free Trade Agreement (CEFTA), which facilitates trade among several Western Balkan countries, thereby enhancing regional economic integration. The country also concluded the Stabilisation and Association Agreement with the European Union, a key step toward eventual EU accession that provides preferential trade access and supports regulatory alignment. Additionally, North Macedonia signed free trade agreements with the European Free Trade Association (EFTA), encompassing Switzerland, Norway, Iceland, and Liechtenstein, broadening its access to European markets beyond the EU. Bilateral agreements with Turkey and Ukraine further diversified its trade partnerships, reflecting a strategic approach to expanding export opportunities and attracting foreign investment through enhanced market access.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:19.545857",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 12,
      "generated_content_length": 7852,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Free Economic Zones",
    "text": "In a bid to attract more interest from domestic and foreign investors after\n2000 the government has pursued a Free economic zone (FEZ) policy, in which\nmore than a dozen geographically disparate FEZs have sprouted. One benefit is\na tax holiday for 10 years. The social contribution rate hovered at\napproximately 30% for the five-year period to 2019.",
    "openai_summarised_points": [
      "• After the year 2000, the government of North Macedonia implemented a Free Economic Zone (FEZ) policy aimed at attracting increased interest from both domestic and foreign investors.",
      "• As a result of this policy, more than a dozen geographically dispersed Free Economic Zones have been established across the country.",
      "• One significant incentive offered within these FEZs is a tax holiday lasting for a period of 10 years, designed to encourage investment and economic activity.",
      "• The social contribution rate associated with employment in these zones remained approximately 30% over the five-year period leading up to 2019."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:37.772588",
      "openai_model": "gpt-4.1-mini",
      "content_length": 349,
      "bullet_points_count": 4
    },
    "generated_detailed_content": "Following the year 2000, the government of North Macedonia undertook a strategic initiative to stimulate economic growth and attract both domestic and foreign investment by implementing a Free Economic Zone (FEZ) policy. This policy was designed to create specialized areas within the country where businesses could operate under more favorable economic and regulatory conditions compared to the rest of the national territory. The primary objective was to enhance the country’s competitiveness by offering incentives that would lower operational costs, thereby encouraging companies to establish manufacturing, processing, and service facilities within these zones. The introduction of the FEZ policy reflected a broader trend in transitional economies seeking to integrate more fully into global supply chains and attract foreign direct investment by creating business-friendly environments. As a direct consequence of this policy, North Macedonia saw the establishment of more than a dozen Free Economic Zones strategically distributed throughout the country. These zones were geographically dispersed to leverage regional advantages and to promote balanced economic development across different parts of the nation. The locations were selected based on factors such as proximity to transportation hubs, availability of infrastructure, and access to skilled labor, thereby maximizing their attractiveness to potential investors. Each FEZ was equipped with the necessary infrastructure and administrative support to facilitate efficient business operations, including streamlined customs procedures and simplified regulatory compliance. The proliferation of these zones underscored the government’s commitment to creating multiple centers of economic activity, thus fostering regional development and reducing disparities between urban and rural areas. One of the most significant incentives offered within these Free Economic Zones was a tax holiday that lasted for a period of ten years. This tax exemption was designed as a powerful inducement to encourage investment and stimulate economic activity within the zones. By eliminating corporate income tax obligations for a decade, the policy substantially reduced the initial financial burden on businesses, improving their profitability and cash flow during the critical early years of operation. This long-term tax relief was particularly attractive to foreign investors seeking to establish manufacturing plants or service centers, as it enhanced the return on investment and mitigated some of the risks associated with entering a new market. The tax holiday was complemented by other fiscal and administrative benefits, such as exemptions from customs duties on imported equipment and raw materials, further enhancing the zones’ appeal as investment destinations. Despite the attractive tax incentives, the social contribution rate related to employment within these Free Economic Zones remained relatively stable, averaging approximately 30% over the five-year period leading up to 2019. This rate encompassed mandatory contributions to social security funds, including pensions, health insurance, and unemployment benefits, which employers were required to pay on behalf of their employees. While the tax holiday reduced corporate tax liabilities, the social contribution rate ensured that workers employed in the zones continued to benefit from social protection programs. The consistency of this rate over several years indicated a stable regulatory environment regarding labor costs, which allowed businesses to plan their human resource expenses with a degree of predictability. Moreover, maintaining a social contribution rate at this level balanced the need to attract investment with the government’s responsibility to provide social welfare benefits, contributing to the overall sustainability of the FEZ policy framework. Together, these elements of the Free Economic Zone policy—strategic establishment of multiple zones, the provision of a decade-long tax holiday, and the maintenance of a stable social contribution rate—formed a comprehensive approach to fostering economic development in North Macedonia. The policy not only attracted a diverse range of investors but also contributed to job creation, technology transfer, and integration into regional and global markets. Over time, the Free Economic Zones became key drivers of economic transformation, supporting the country’s transition towards a more open and competitive market economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:12.458233",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 4,
      "generated_content_length": 4516,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture",
    "text": "Vineyard in North Macedonia\n\nNorth Macedonia produced in 2020:\n\n* 318,000 tons of grape;\n* 246,000 tons of wheat;\n* 205,000 tons of bell pepper;\n* 193,000 tons of potato;\n* 168,000 tons of cabbage;\n* 155,000 tons of tomato;\n* 150,000 tons of maize;\n* 148,000 tons of barley;\n* 125,000 tons of watermelon;\n* 106,000 tons of apple;\n* 63,000 tons of onion;\n* 49,000 tons of cucumber;\n\nIn addition to smaller productions of other agricultural products.",
    "openai_summarised_points": [
      "• In 2020, North Macedonia produced 318,000 tons of grapes, making it the highest quantity crop produced that year.",
      "• Wheat production in North Macedonia reached 246,000 tons in 2020, ranking as the second-largest agricultural output.",
      "• Bell pepper production amounted to 205,000 tons in 2020, indicating its significance in the country's agriculture.",
      "• Potato cultivation yielded 193,000 tons in 2020, reflecting its role as a staple crop in North Macedonia.",
      "• Cabbage production was recorded at 168,000 tons in 2020, contributing substantially to the vegetable sector.",
      "• Tomato output reached 155,000 tons in 2020, highlighting its importance among vegetable crops.",
      "• Maize production totaled 150,000 tons in 2020, underscoring its role in North Macedonia’s agricultural economy.",
      "• Barley was produced at 148,000 tons in 2020, representing a key cereal crop for the country.",
      "• Watermelon production was 125,000 tons in 2020, indicating a notable presence in fruit cultivation.",
      "• Apple output reached 106,000 tons in 2020, emphasizing its significance in the fruit production sector.",
      "• Onion production amounted to 63,000 tons in 2020, contributing to the diversity of vegetable crops.",
      "• Cucumber cultivation yielded 49,000 tons in 2020, representing a smaller but important vegetable product.",
      "• Besides the listed major crops, North Macedonia also produced various other agricultural products in smaller quantities during 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:43.506541",
      "openai_model": "gpt-4.1-mini",
      "content_length": 448,
      "bullet_points_count": 13
    },
    "generated_detailed_content": "In 2020, North Macedonia's agricultural sector demonstrated a diverse and robust production profile, with grapes emerging as the leading crop by quantity. The country produced 318,000 tons of grapes, underscoring the significance of viticulture within its agricultural economy. This high volume reflects both the favorable climatic conditions and the long-standing tradition of grape cultivation in the region, which supports not only fresh fruit consumption but also wine production, an important component of the national agro-industry. The prominence of grapes in North Macedonia’s agriculture highlights the crop’s economic and cultural value, as vineyards are widespread across the country’s fertile valleys and hillsides. Following grapes, wheat production reached 246,000 tons in 2020, marking it as the second-largest agricultural output. Wheat has historically been a staple cereal crop in North Macedonia, essential for both domestic consumption and as a raw material for various food industries. The substantial wheat harvest reflects the country's efforts to maintain grain self-sufficiency and supports the production of bread and other wheat-based products that are central to the Macedonian diet. The cultivation of wheat benefits from the country’s temperate continental climate and the availability of arable land, which together facilitate stable yields. Bell peppers also played a significant role in the country's agricultural output, with production totaling 205,000 tons in 2020. This volume underscores the importance of bell peppers as a key vegetable crop, widely cultivated across North Macedonia’s agricultural zones. The crop’s popularity is tied to both domestic consumption and export potential, as bell peppers are a staple ingredient in Macedonian cuisine and are sought after in regional markets. The cultivation of bell peppers benefits from the country’s diverse microclimates, which allow for multiple growing seasons and contribute to high-quality yields. Potato cultivation yielded 193,000 tons in 2020, reflecting its status as a staple crop within North Macedonia’s agricultural landscape. Potatoes are a fundamental component of the national diet, providing a vital source of carbohydrates and nutrients. The crop is grown extensively across various regions, particularly in areas with cooler temperatures and suitable soil conditions. The significant production volume indicates the continued reliance on potatoes as a food security crop and highlights the efforts of farmers to optimize yields through improved agricultural practices and seed varieties. Cabbage production was recorded at 168,000 tons in 2020, contributing substantially to the vegetable sector. This leafy vegetable is widely consumed in North Macedonia, often used in traditional dishes such as stuffed cabbage rolls and salads. The high production volume reflects the crop’s adaptability to the country’s climate and soil types, as well as its relatively low input requirements compared to other vegetables. Cabbage cultivation plays an important role in supporting rural livelihoods and diversifying the agricultural output. Tomato output reached 155,000 tons in 2020, further emphasizing the importance of vegetable crops in North Macedonia’s agriculture. Tomatoes are a versatile crop with significant demand both for fresh consumption and processing into products like sauces and pastes. The production volume reflects the widespread cultivation of tomatoes across the country, supported by favorable growing conditions and advances in irrigation and pest management techniques. Tomatoes contribute to the agricultural economy by providing income opportunities for smallholder farmers and supporting agro-processing industries. Maize production totaled 150,000 tons in 2020, underscoring its role as a key cereal crop within North Macedonia’s agricultural economy. Maize is primarily used for animal feed, but it also serves as a food source in various traditional dishes. The crop’s production volume indicates its importance in supporting the country’s livestock sector and maintaining agricultural diversity. Maize cultivation benefits from the country’s varied topography and climate zones, which allow for different planting schedules and crop rotations. Barley was produced at 148,000 tons in 2020, representing another essential cereal crop for North Macedonia. Barley is utilized for animal feed, brewing, and food products, making it a versatile component of the agricultural system. The production volume reflects the crop’s adaptability to the country’s semi-arid regions and its role in crop rotation practices aimed at maintaining soil fertility. Barley cultivation supports both commercial farming operations and smaller-scale producers, contributing to the overall stability of the agricultural sector. Watermelon production reached 125,000 tons in 2020, indicating a notable presence in the fruit cultivation sector. Watermelons are popular summer fruits in North Macedonia, favored for their refreshing qualities and high water content. The significant production volume highlights the crop’s importance in meeting domestic demand during the warmer months and its potential for export to neighboring countries. Watermelon cultivation is concentrated in regions with warm temperatures and adequate irrigation, enabling the production of high-quality fruit. Apple output reached 106,000 tons in 2020, emphasizing its significance within the fruit production sector. Apples are among the most widely grown fruits in North Macedonia, cultivated in orchards that benefit from the country’s temperate climate and fertile soils. The production volume reflects the crop’s role in supporting both fresh fruit markets and processing industries, including juice and cider production. Apple cultivation contributes to rural employment and the diversification of agricultural income sources. Onion production amounted to 63,000 tons in 2020, contributing to the diversity of vegetable crops in North Macedonia. Onions are a fundamental ingredient in Macedonian cuisine and are cultivated across various regions with suitable soil and climatic conditions. The production volume indicates steady demand and the crop’s adaptability to different farming systems. Onion cultivation supports both small-scale farmers and commercial producers, playing a role in local food security and market supply. Cucumber cultivation yielded 49,000 tons in 2020, representing a smaller but important vegetable product within the agricultural portfolio. Cucumbers are commonly grown in greenhouses and open fields, providing fresh produce for domestic consumption and local markets. The production volume reflects the crop’s role in diversifying vegetable offerings and meeting consumer preferences for fresh, seasonal vegetables. Cucumber farming benefits from advances in cultivation techniques, including controlled environment agriculture, which enhance yield and quality. Beyond these major crops, North Macedonia’s agricultural sector in 2020 also produced various other agricultural products in smaller quantities. These included a range of fruits, vegetables, cereals, and legumes that collectively contribute to the country’s food supply and agricultural diversity. The presence of these additional crops supports rural economies by providing alternative income sources and helps maintain ecological balance through crop rotation and diversification. The overall agricultural output in 2020 illustrates the multifaceted nature of North Macedonia’s farming sector and its capacity to meet both domestic needs and export opportunities.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:18.912149",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 13,
      "generated_content_length": 7643,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Energy",
    "text": "In September 2019, it was said that \"thermal power plants account for 842 MW\nof North Macedonia’s total power generation capacity of 1.41 GW, with\nhydroelectricity and wind accounting for 553.6 MW and 36.8 MW, respectively.\"\nThere are 20 economically-exploitable locations for coal in the country, whose\ntotal geological reserves are estimated at 2,5 billion tons. There exist four\nhydroelectric reservoirs, located at: Pelagonia, Kičevo, Mariovo and Tikveš.\nThe first two produce energy, while the latter two are speculative.",
    "openai_summarised_points": [
      "• As of September 2019, thermal power plants contribute 842 MW to North Macedonia’s total power generation capacity, which amounts to 1.41 GW.",
      "• Hydroelectric power accounts for 553.6 MW of the country’s power generation capacity, while wind power contributes 36.8 MW.",
      "• North Macedonia possesses 20 economically exploitable coal locations, with total geological coal reserves estimated at 2.5 billion tons.",
      "• The country has four hydroelectric reservoirs situated in Pelagonia, Kičevo, Mariovo, and Tikveš.",
      "• Among these reservoirs, the Pelagonia and Kičevo sites actively produce energy, whereas the Mariovo and Tikveš reservoirs are currently speculative and not used for energy production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:50.263148",
      "openai_model": "gpt-4.1-mini",
      "content_length": 526,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "As of September 2019, North Macedonia's total power generation capacity stood at approximately 1.41 gigawatts (GW), with thermal power plants contributing a significant portion of this capacity. Specifically, thermal power plants accounted for 842 megawatts (MW), representing nearly 60 percent of the overall installed capacity. These thermal plants primarily rely on the combustion of fossil fuels, predominantly coal, which has historically formed the backbone of the country's electricity generation infrastructure. The reliance on thermal power reflects North Macedonia’s abundant coal reserves and the established infrastructure supporting coal mining and energy production. In addition to thermal power, hydroelectric power played a substantial role in the country’s energy mix, contributing 553.6 MW to the total generation capacity. Hydropower has been a critical renewable energy source for North Macedonia, harnessing the potential of its river systems and reservoirs to produce electricity. The hydroelectric capacity, accounting for roughly 39 percent of the total installed power capacity, underscores the importance of water resources in the national energy strategy. Wind power, while a smaller component, contributed 36.8 MW, indicating the nascent stage of wind energy development within the country. This figure highlights the emerging interest in diversifying energy sources and incorporating renewable technologies to reduce dependence on fossil fuels and enhance energy security. North Macedonia’s energy sector is closely linked to its substantial coal reserves, which remain a cornerstone of its electricity generation. The country possesses 20 economically exploitable coal locations, reflecting a widespread distribution of coal deposits across its territory. These coal sites are integral to sustaining the thermal power plants that dominate the energy landscape. Geological surveys estimate the total coal reserves at approximately 2.5 billion tons, a figure that underscores the vast potential for continued coal extraction and utilization. This abundance of coal has historically provided a stable and relatively low-cost energy source, though it also presents challenges related to environmental impact and the global shift toward cleaner energy alternatives. The hydroelectric infrastructure in North Macedonia is supported by four main reservoirs, strategically located in the regions of Pelagonia, Kičevo, Mariovo, and Tikveš. These reservoirs serve as critical components of the country’s hydropower system, enabling the regulation of water flow and the generation of electricity through hydroelectric plants. Among these, the Pelagonia and Kičevo reservoirs are actively utilized for energy production, contributing to the operational capacity of the hydroelectric sector. These sites benefit from favorable geographic and hydrological conditions that allow for consistent and efficient electricity generation. Conversely, the Mariovo and Tikveš reservoirs remain speculative in terms of energy production. While these reservoirs exist and have potential for future development, they are not currently harnessed for electricity generation, possibly due to technical, economic, or environmental considerations that have delayed or prevented their operationalization. The combination of thermal, hydroelectric, and wind power capacities reflects North Macedonia’s energy profile as of 2019, characterized by a heavy reliance on coal-based thermal plants supplemented by significant hydropower resources and emerging renewable technologies. The country’s extensive coal reserves have historically underpinned its energy security, while the development of hydroelectric reservoirs in key regions has provided a renewable complement to fossil fuel-based generation. The modest contribution from wind power indicates a growing awareness and investment in diversifying the energy mix to include sustainable sources. Together, these elements illustrate the multifaceted nature of North Macedonia’s energy sector, shaped by natural resource endowments, technological infrastructure, and evolving energy policies aimed at balancing economic, environmental, and security objectives.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:11.800649",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 4207,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Mining and metallurgy",
    "text": "The country has been home to mines since at least the Roman era. Gold, silver,\nlead, copper, iron, nickel, zinc, gypsum and sulfur have been or are now being\neconomically exploited. Marble has since Ancient Greek days been quarried at\nSivec.",
    "openai_summarised_points": [
      "• North Macedonia has a long history of mining activities dating back to at least the Roman era, indicating the region's longstanding significance in mineral extraction.",
      "• The country has economically exploited a variety of minerals, including gold, silver, lead, copper, iron, nickel, zinc, gypsum, and sulfur, reflecting a diverse mineral resource base.",
      "• Marble quarrying in North Macedonia has been conducted since Ancient Greek times, specifically at the Sivec quarry, highlighting the historical importance of this natural resource in the region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:24:53.130438",
      "openai_model": "gpt-4.1-mini",
      "content_length": 241,
      "bullet_points_count": 3
    },
    "generated_detailed_content": "Mining activities in North Macedonia trace back to at least the Roman era, underscoring the region's longstanding importance as a center for mineral extraction. Archaeological evidence and historical records reveal that the area was actively exploited for its mineral wealth during antiquity, with mining operations contributing to the local economy and supplying raw materials for various uses across the Roman Empire. This deep-rooted tradition of mining has shaped the economic and industrial development of North Macedonia over centuries, establishing a foundation upon which modern mining practices have been built. Throughout its history, North Macedonia has economically exploited a diverse array of mineral resources, encompassing precious metals such as gold and silver, as well as base metals including lead, copper, iron, nickel, and zinc. The extraction and processing of these minerals have played a significant role in the country’s industrial sector, providing essential inputs for manufacturing, construction, and export. In addition to metallic minerals, the country has also developed industries around non-metallic minerals like gypsum and sulfur, which have been important for chemical production and building materials. This varied mineral resource base reflects the complex geology of the region and has enabled North Macedonia to sustain a multifaceted mining and metallurgical industry. Marble quarrying in North Macedonia holds particular historical significance, with operations dating back to Ancient Greek times. The Sivec quarry, located near the town of Prilep, is one of the most renowned marble extraction sites in the country and has been in use since antiquity. This quarry is famous for producing high-quality white marble, which was highly valued in classical architecture and sculpture. The continuity of marble quarrying at Sivec illustrates the enduring importance of this natural resource in the region’s cultural and economic history. Over the centuries, marble from this quarry has been utilized not only locally but also exported, contributing to the artistic and architectural heritage of various civilizations.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:18.793911",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 3,
      "generated_content_length": 2155,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Trade",
    "text": "North Macedonia remains committed to pursuing membership in the European Union\n(EU) and NATO. It became a full World Trade Organization (WTO) member in April\n2003. Following a 1997 cooperation agreement with the EU, North Macedonia\nsigned a Stabilization and Association Agreement with the EU in April 2001,\ngiving North Macedonia duty-free access to European markets. In December 2005,\nit moved a step forward, obtaining candidate country status for EU accession.\nNorth Macedonia has had a foreign trade deficit since 1994, which reached a\nrecord high of $2.873 billion in 2008, or 30.2% of GDP. Total trade in 2010\n(imports plus exports of goods and services) was $8.752 billion, and the trade\ndeficit amounted to $2.149 billion, or 23.4% of GDP. In the first 8 months of\n2011, total trade was $7.470 billion and the trade deficit was $1.778 billion.\nA significant 56.5% of North Macedonia's total trade was with EU countries.\nNorth Macedonia's major trading partners are Germany, Greece, Serbia,\nBulgaria, Russia, and Italy. In 2010, total trade between North Macedonia and\nthe United States was $116.6 million, and in the first 8 months of 2011 it was\n$65 million. U.S. meat, mainly poultry, and electrical machinery and equipment\nhave been particularly attractive to North Macedonia importers. Principal\nexports from North Macedonia to the United States are tobacco, apparel, iron,\nand steel.\n\nNorth Macedonia has bilateral free trade agreements with Ukraine, Turkey, and\nthe European Free Trade Association (EFTA—Switzerland, Norway, Iceland, and\nLiechtenstein). Bilateral agreements with Albania, Bosnia and Herzegovina,\nCroatia, Serbia, Montenegro, Kosovo, and Moldova were replaced by membership\nin the Central European Free Trade Agreement (CEFTA). North Macedonia also has\nconcluded an \"Agreement for Promotion and Protection of Foreign Direct\nInvestments\" with Albania, Austria, Bosnia and Herzegovina, Bulgaria, Belarus,\nBelgium, Luxembourg, Germany, Egypt, Iran, Italy, India, Spain, Serbia,\nMontenegro, People's Republic of China, South Korea, Malaysia, Poland,\nRomania, Russia, Slovenia, Turkey, Ukraine, Hungary, Finland, France, the\nNetherlands, Croatia, Czech Republic, Switzerland, and Sweden.",
    "openai_summarised_points": [
      "• North Macedonia is actively pursuing membership in the European Union (EU) and the North Atlantic Treaty Organization (NATO), demonstrating its commitment to Euro-Atlantic integration.",
      "• The country became a full member of the World Trade Organization (WTO) in April 2003, marking a significant step in its integration into the global trading system.",
      "• In 1997, North Macedonia signed a cooperation agreement with the EU, which laid the groundwork for closer economic and political relations.",
      "• In April 2001, North Macedonia signed a Stabilization and Association Agreement (SAA) with the EU, granting it duty-free access to European markets and enhancing trade opportunities.",
      "• North Macedonia achieved candidate country status for EU accession in December 2005, advancing its formal process toward EU membership.",
      "• Since 1994, North Macedonia has consistently experienced a foreign trade deficit, which peaked at a record $2.873 billion in 2008, equivalent to 30.2% of its Gross Domestic Product (GDP).",
      "• In 2010, North Macedonia’s total trade volume, including imports and exports of goods and services, was $8.752 billion, with a trade deficit of $2.149 billion, representing 23.4% of GDP.",
      "• During the first eight months of 2011, total trade amounted to $7.470 billion, while the trade deficit reached $1.778 billion, indicating ongoing trade imbalances.",
      "• A substantial 56.5% of North Macedonia’s total trade was conducted with European Union countries, underscoring the EU’s importance as a trading partner.",
      "• The country’s major trading partners include Germany, Greece, Serbia, Bulgaria, Russia, and Italy, reflecting its regional and European trade connections.",
      "• Trade between North Macedonia and the United States totaled $116.6 million in 2010, and $65 million during the first eight months of 2011, highlighting a smaller but notable bilateral trade relationship.",
      "• U.S. exports to North Macedonia primarily consist of meat products, especially poultry, as well as electrical machinery and equipment, which are in demand by Macedonian importers.",
      "• North Macedonia’s principal exports to the United States include tobacco, apparel, iron, and steel, indicating the country’s export strengths in these sectors.",
      "• The country has established bilateral free trade agreements with Ukraine, Turkey, and the European Free Trade Association (EFTA) countries, which include Switzerland, Norway, Iceland, and Liechtenstein.",
      "• Bilateral free trade agreements previously held with Albania, Bosnia and Herzegovina, Croatia, Serbia, Montenegro, Kosovo, and Moldova were superseded by North Macedonia’s membership in the Central European Free Trade Agreement (CEFTA).",
      "• North Macedonia has concluded \"Agreements for Promotion and Protection of Foreign Direct Investments\" with a wide range of countries, including Albania, Austria, Bosnia and Herzegovina, Bulgaria, Belarus, Belgium, Luxembourg, Germany, Egypt, Iran, Italy, India, Spain, Serbia, Montenegro, the People’s Republic of China, South Korea, Malaysia, Poland, Romania, Russia, Slovenia, Turkey, Ukraine, Hungary, Finland, France, the Netherlands, Croatia, the Czech Republic, Switzerland, and Sweden, facilitating foreign investment inflows."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:25:04.497634",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2213,
      "bullet_points_count": 16
    },
    "generated_detailed_content": "North Macedonia has demonstrated a steadfast commitment to Euro-Atlantic integration through its active pursuit of membership in both the European Union (EU) and the North Atlantic Treaty Organization (NATO). This strategic orientation reflects the country's broader foreign policy goals aimed at fostering political stability, economic development, and security cooperation within the Euro-Atlantic community. The pursuit of EU and NATO membership has shaped many aspects of North Macedonia’s domestic reforms and international relations, aligning its policies with Western standards and practices. A significant milestone in North Macedonia’s integration into the global economic system was achieved in April 2003, when the country became a full member of the World Trade Organization (WTO). This accession marked a pivotal step in embedding North Macedonia within the rules-based international trading framework, enabling it to participate more actively in global trade negotiations and benefit from the WTO’s dispute resolution mechanisms. WTO membership also signaled to foreign investors and trading partners that North Macedonia was committed to adhering to internationally recognized trade norms and liberalization policies. The foundation for closer economic and political relations with the European Union was laid earlier, in 1997, when North Macedonia signed a cooperation agreement with the EU. This agreement established a framework for dialogue and collaboration, setting the stage for deeper integration and cooperation in various sectors. It facilitated technical assistance and policy alignment, helping North Macedonia to gradually harmonize its legislation and economic policies with those of the EU. Further advancing this trajectory, in April 2001, North Macedonia signed a Stabilization and Association Agreement (SAA) with the European Union. The SAA was a crucial development as it granted North Macedonia duty-free access to European markets, significantly enhancing its trade opportunities and economic ties with EU member states. This agreement also provided a structured framework for political dialogue, economic cooperation, and the gradual integration of North Macedonia into the EU’s internal market. The SAA served as a preparatory stage for eventual EU membership by encouraging reforms in governance, the rule of law, and market economy principles. In December 2005, North Macedonia’s progress was formally recognized when it achieved candidate country status for EU accession. This status marked a key advancement in the country’s formal process toward EU membership, signaling that it had met the necessary political and economic criteria to begin accession negotiations. Candidate status also increased North Macedonia’s visibility and credibility on the international stage, attracting greater attention from investors and trading partners. Despite these positive developments in international integration, North Macedonia has consistently experienced a foreign trade deficit since 1994. This persistent imbalance between imports and exports has been a defining feature of the country’s trade dynamics. The trade deficit reached its peak in 2008, when it soared to a record $2.873 billion, equivalent to 30.2% of the country’s Gross Domestic Product (GDP). This substantial deficit reflected structural challenges in the economy, including limited export diversification and reliance on imported goods and services. By 2010, North Macedonia’s total trade volume, encompassing both imports and exports of goods and services, amounted to $8.752 billion. Within this total, the trade deficit stood at $2.149 billion, representing 23.4% of GDP. Although the deficit had decreased from its 2008 peak, it remained a significant economic concern, underscoring ongoing challenges in achieving a balanced trade position. The trade figures from 2010 illustrated the scale of North Macedonia’s engagement in international commerce, while also highlighting the need for enhanced export competitiveness. During the first eight months of 2011, total trade in North Macedonia reached $7.470 billion, with the trade deficit amounting to $1.778 billion. These figures indicated that trade imbalances persisted into 2011, reflecting structural factors that continued to influence the country’s external economic relations. The ongoing trade deficit underscored the importance of policies aimed at boosting export capacity, attracting foreign investment, and improving the overall trade balance. A notable characteristic of North Macedonia’s trade profile is the dominant role of the European Union as a trading partner. Approximately 56.5% of the country’s total trade was conducted with EU countries, underscoring the EU’s central importance in North Macedonia’s external economic relations. This heavy reliance on the EU market reflects geographical proximity, historical ties, and the benefits derived from preferential trade agreements such as the Stabilization and Association Agreement. The EU’s role as the primary destination for Macedonian exports and the main source of imports highlights the country’s integration into European supply chains and economic networks. North Macedonia’s major trading partners extend beyond the EU and include several neighboring and regional countries. Germany, Greece, Serbia, Bulgaria, Russia, and Italy stand out as key partners, illustrating the country’s diverse trade connections within both the European and broader regional contexts. Germany and Italy, as major EU economies, provide significant markets for Macedonian goods, while Greece, Serbia, and Bulgaria represent important neighbors with whom North Macedonia shares historical, cultural, and economic linkages. Russia’s role as a trading partner reflects energy imports and other economic ties. Trade relations between North Macedonia and the United States, while smaller in scale compared to EU trade, represent a notable bilateral economic relationship. In 2010, trade between the two countries totaled $116.6 million, and during the first eight months of 2011, it amounted to $65 million. These figures indicate a modest but meaningful exchange of goods and services, contributing to North Macedonia’s diversified trade portfolio and international economic engagement. U.S. exports to North Macedonia primarily consisted of meat products, with a particular emphasis on poultry, as well as electrical machinery and equipment. These goods were in demand by Macedonian importers, reflecting consumer preferences and industrial needs within the country. The importation of such products from the United States supports various sectors of the Macedonian economy, including food processing and manufacturing. Conversely, North Macedonia’s principal exports to the United States included tobacco, apparel, iron, and steel. These export categories highlight the country’s strengths in agricultural products, textile manufacturing, and metal industries. The export of tobacco and apparel indicates the presence of established production capabilities and supply chains, while iron and steel exports underscore North Macedonia’s role in regional raw material and semi-finished goods markets. North Macedonia has actively sought to expand its trade opportunities through the establishment of bilateral free trade agreements with several countries and regional groups. Among these are agreements with Ukraine, Turkey, and the European Free Trade Association (EFTA) countries, which include Switzerland, Norway, Iceland, and Liechtenstein. These agreements facilitate the reduction or elimination of tariffs and other trade barriers, promoting increased trade flows and economic cooperation. By engaging in these free trade arrangements, North Macedonia has enhanced its access to diverse markets beyond the EU, supporting export growth and economic diversification. Previously, North Macedonia held bilateral free trade agreements with Albania, Bosnia and Herzegovina, Croatia, Serbia, Montenegro, Kosovo, and Moldova. However, these agreements were superseded by North Macedonia’s membership in the Central European Free Trade Agreement (CEFTA). CEFTA serves as a regional trade bloc that harmonizes trade relations among its member countries, simplifying customs procedures and fostering economic integration. North Macedonia’s participation in CEFTA reflects its commitment to regional cooperation and the development of a more integrated and competitive regional market. In addition to trade agreements, North Macedonia has concluded numerous \"Agreements for Promotion and Protection of Foreign Direct Investments\" (BITs) with a wide array of countries. These agreements are designed to create a favorable investment climate by providing legal protections and guarantees for foreign investors, thereby facilitating investment inflows. The countries with which North Macedonia has signed such agreements include Albania, Austria, Bosnia and Herzegovina, Bulgaria, Belarus, Belgium, Luxembourg, Germany, Egypt, Iran, Italy, India, Spain, Serbia, Montenegro, the People’s Republic of China, South Korea, Malaysia, Poland, Romania, Russia, Slovenia, Turkey, Ukraine, Hungary, Finland, France, the Netherlands, Croatia, the Czech Republic, Switzerland, and Sweden. This extensive network of BITs underscores North Macedonia’s proactive approach to attracting foreign direct investment from diverse global sources, supporting economic development and integration into international markets.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:42.803094",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 16,
      "generated_content_length": 9507,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Unemployment",
    "text": "Unemployed  | 1995  | 2000  | 2005  | 2010  | 2015  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021\n---|---|---|---|---|---|---|---|---|---|---|---\nPersons  | N/A  | N/A  | N/A  | 311,000  | 265,000  | 225,000  | 218,601  | 199,325  | 161,242  | 156,627  | 142,206\nPercent (%)  | 30%  | 33%  | 38%  | 32%  | 27%  | 24%  | 22.9%  | 19.4%  | 16.6%  | 16.2%  | 15.2%\n\nUnemployment is a continuing problem in the Republic's economy where a large\npercentage of the Republic's qualified labor force cannot find work. Many\npeople lost their jobs with the collapse of Yugoslavia. As a result, national\nunemployment was above 35% (37.30% in 2005), but that number has since dropped\nto 16.6% (2019), with population below the poverty line also dropping from\n30.4% (2011) to 21.5% (2015), it is reasonable to assume that based on the\ntrend over the past few years, further declines are likely for both\nunemployment and poverty. Full-time employment has risen steadily over the\nlast few years, with part-time employment trending slightly downward over the\nsame period resulting in an overall increase to employment, wages increased\nsharply after 2008, with steady increases continuing into 2016",
    "openai_summarised_points": [
      "• Unemployment in the Republic of North Macedonia has been a persistent economic issue, characterized by a significant portion of the qualified labor force being unable to secure employment.",
      "• The collapse of Yugoslavia led to widespread job losses, causing national unemployment rates to exceed 35%, reaching 37.30% in 2005.",
      "• Statistical data on unemployment persons is unavailable for the years 1995, 2000, and 2005; however, from 2010 onwards, the number of unemployed persons has shown a consistent decline: 311,000 in 2010, 265,000 in 2015, 225,000 in 2016, 218,601 in 2017, 199,325 in 2018, 161,242 in 2019, 156,627 in 2020, and 142,206 in 2021.",
      "• Correspondingly, the unemployment rate as a percentage of the labor force decreased from 30% in 1995, rising to 33% in 2000 and peaking at 38% in 2005, before declining to 32% in 2010, 27% in 2015, 24% in 2016, 22.9% in 2017, 19.4% in 2018, 16.6% in 2019, 16.2% in 2020, and reaching 15.2% in 2021.",
      "• The poverty rate in North Macedonia has also decreased alongside unemployment, with the population living below the poverty line dropping from 30.4% in 2011 to 21.5% in 2015.",
      "• Given the observed trends over recent years, it is reasonable to anticipate further reductions in both unemployment and poverty rates in the near future.",
      "• Employment patterns indicate a steady increase in full-time employment over recent years, while part-time employment has experienced a slight downward trend, cumulatively resulting in an overall rise in employment levels.",
      "• Wage levels in North Macedonia saw a sharp increase following 2008, with consistent wage growth continuing through to 2016, reflecting improvements in economic conditions and labor market dynamics."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:25:12.181824",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1181,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Unemployment in the Republic of North Macedonia has long represented a significant challenge for the national economy, with a substantial segment of the qualified labor force consistently unable to find gainful employment. This persistent issue has roots in the structural transformations the country underwent following the dissolution of the Socialist Federal Republic of Yugoslavia. The collapse of Yugoslavia in the early 1990s precipitated widespread job losses across the newly independent states, including North Macedonia, as centrally planned industries faced closures or drastic restructuring. Consequently, the national unemployment rate surged to alarming levels, exceeding 35% during this turbulent period and peaking at 37.30% in 2005. This high unemployment rate reflected not only the immediate economic dislocation caused by the transition from a socialist to a market economy but also the broader challenges of integrating into global markets and attracting foreign investment. Comprehensive statistical data on the number of unemployed persons in North Macedonia is unavailable for certain years, specifically 1995, 2000, and 2005, which complicates precise longitudinal analysis. Nevertheless, from 2010 onwards, official records indicate a consistent downward trend in the number of unemployed individuals. In 2010, the number of unemployed persons stood at approximately 311,000. This figure steadily declined over the subsequent decade, falling to 265,000 in 2015, then to 225,000 in 2016. The downward trajectory continued with 218,601 unemployed in 2017, 199,325 in 2018, 161,242 in 2019, 156,627 in 2020, and reaching 142,206 by 2021. This sustained reduction in unemployment numbers reflects both macroeconomic stabilization and targeted policy efforts to stimulate job creation and improve labor market efficiency. Parallel to the absolute numbers of unemployed persons, the unemployment rate as a percentage of the labor force has also experienced significant fluctuations over the past few decades. In 1995, the unemployment rate was approximately 30%, rising to 33% in 2000, and then reaching its zenith at 38% in 2005. This peak corresponded with the period of greatest economic hardship following the post-Yugoslav transition. However, from 2005 onwards, the unemployment rate began a gradual but steady decline. By 2010, the rate had decreased to 32%, further falling to 27% in 2015 and 24% in 2016. The improvement continued with rates of 22.9% in 2017, 19.4% in 2018, and 16.6% in 2019. Despite the global economic disruptions caused by the COVID-19 pandemic, North Macedonia’s unemployment rate remained relatively stable, registering 16.2% in 2020 and further decreasing to 15.2% in 2021. This trend underscores the resilience of the labor market and the effectiveness of governmental and international initiatives aimed at economic recovery and employment promotion. The reduction in unemployment has been accompanied by a notable decline in the poverty rate within North Macedonia. In 2011, approximately 30.4% of the population lived below the poverty line, reflecting the economic difficulties faced by a significant portion of society. However, by 2015, this proportion had decreased markedly to 21.5%. This decline in poverty levels is closely linked to improvements in employment opportunities and income generation, as well as social welfare programs designed to support vulnerable groups. The correlation between falling unemployment and reduced poverty highlights the interconnected nature of economic growth, labor market conditions, and social well-being. Given these observed trends over recent years, it is reasonable to anticipate continued progress in lowering both unemployment and poverty rates in the near future, provided that economic policies remain conducive to sustainable development and inclusive growth. Employment patterns in North Macedonia have evolved alongside these broader economic shifts. There has been a steady increase in full-time employment in recent years, reflecting greater stability and growth in key sectors of the economy. This rise in full-time jobs has been accompanied by a slight downward trend in part-time employment, suggesting a shift towards more permanent and secure forms of work. The combined effect of these changes has been an overall increase in employment levels, which contributes positively to economic productivity and household income stability. This trend also indicates a maturing labor market where employers are more willing and able to offer full-time positions, potentially improving job quality and worker satisfaction. Wage levels in North Macedonia have mirrored these positive developments in employment and economic conditions. Following the global financial crisis of 2008, wages in the country experienced a sharp increase, signaling a recovery in labor market dynamics and enhanced economic performance. This upward trajectory in wage growth continued consistently through to 2016, reflecting improvements in productivity, inflation control, and labor demand. Rising wages have played a crucial role in boosting domestic consumption and reducing income inequality, thereby supporting broader economic development goals. The sustained wage growth also suggests that the labor market has been able to absorb economic shocks and adapt to changing conditions, contributing to the overall resilience of North Macedonia’s economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:36.493229",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 5442,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Tourism",
    "text": "Ohrid is a popular tourist destination in North Macedonia.\n\nTourism is a significant part of the economy.",
    "openai_summarised_points": [
      "• Ohrid is identified as a popular tourist destination within North Macedonia, attracting visitors due to its cultural, historical, and natural significance.",
      "• Tourism constitutes a significant sector of North Macedonia's economy, contributing notably to the country's overall economic activity and development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:25:13.912457",
      "openai_model": "gpt-4.1-mini",
      "content_length": 105,
      "bullet_points_count": 2
    },
    "generated_detailed_content": "Ohrid stands out as one of the most prominent tourist destinations in North Macedonia, renowned for its rich cultural heritage, historical significance, and stunning natural landscapes. Situated on the shores of Lake Ohrid, one of Europe's oldest and deepest lakes, the city offers a unique combination of natural beauty and well-preserved architectural monuments. Its historical importance is underscored by numerous ancient churches, monasteries, and archaeological sites that date back to the Byzantine and medieval periods, many of which have been recognized as UNESCO World Heritage Sites. Visitors are drawn to Ohrid not only for its spiritual and cultural attractions but also for its vibrant festivals, traditional crafts, and scenic surroundings that include pristine beaches and mountainous terrain, making it a year-round destination for both cultural tourism and outdoor activities. Tourism plays a vital role in the economy of North Macedonia, serving as a key driver of economic growth and development. The sector contributes significantly to the country’s gross domestic product (GDP), providing employment opportunities across various industries such as hospitality, transportation, and retail. Over the years, North Macedonia has invested in improving its tourism infrastructure, including the enhancement of accommodation facilities, promotion of cultural events, and development of transport links, to attract a growing number of international visitors. The government has also implemented policies aimed at sustainable tourism development, recognizing the importance of preserving the country's natural and cultural assets while maximizing economic benefits. As a result, tourism has become an increasingly important source of foreign exchange earnings and has helped diversify the national economy beyond traditional sectors such as agriculture and manufacturing. The growth of tourism in North Macedonia has been supported by the country's strategic location in the Balkans, which facilitates access from neighboring countries and other parts of Europe. Additionally, the diversity of tourism offerings—from historical and religious sites to natural parks and spa resorts—has broadened the appeal to different types of travelers. Ohrid, in particular, serves as a flagship destination that exemplifies the potential of North Macedonia’s tourism industry, drawing hundreds of thousands of visitors annually. This influx of tourists has stimulated local economies, encouraged small business development, and fostered cultural exchange. The ongoing efforts to promote North Macedonia as a competitive and attractive tourist destination continue to shape the sector’s contribution to the national economy, highlighting tourism as a cornerstone of the country’s future economic strategy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:36:31.327142",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 2,
      "generated_content_length": 2804,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Macroeconomics",
    "text": "Real GDP in the first half of 2011 increased by 5.2%. This robust growth was\nmainly driven by 23.6% growth in the construction sector; 13.2% in mining,\nquarrying, and manufacturing; 12.4% in wholesale and retail trade; and 4.2% in\ntransport and communication services. Industrial output in the first 8 months\nof 2011 was 7.5% higher than in the same period of 2010. Low public and\nexternal debt and a comfortable level of foreign exchange reserves allowed for\nfurther relaxation of monetary policy, with the reference interest rate of the\nCentral Bank decreasing to 4%. Due to rising prices for energy, fuel, and food\non international markets, inflation increased in the first half of 2011, but\nlater decreased to an annualized rate of 3.4% at the end of September. The\nofficial unemployment rate dropped to 24.6% in the fourth quarter of 2015, but\nremained one of the highest in Europe. Many people work in the gray economy,\nand many experts estimate North Macedonia's actual unemployment is lower.\n\nThe government budget has generally kept within projections. The budget\ndeficit at the end of August 2011 reached about 2% of GDP, and fiscal\nauthorities seemed committed to keeping it under the projected target of 2.5%\nof GDP by the end of the year. In addition to 220 million euros (approx. $298\nmillion) drawn from an IMF Precautionary Credit Line (PCL) in March, financing\nmostly came from domestic borrowing. However, by the end of the year a\nfinancing gap remained of about 50 million to 60 million euros (approx. $67\nmillion to $81 million), which the government plans to cover by borrowing from\ninternational capital markets, supported by a policy-based guarantee by the\nWorld Bank. The central government's public debt remained low at 26% of GDP,\nbut represents a gradual increase from previous years. Despite lowering the\nCentral Bank bills rate, the Central Bank has not changed liquidity indicators\nfor banks or the reserve requirement since 2009, curbing credit growth to 7.5%\nin the first three-quarters of 2011. Nikola Gruevski says the government will\npay off its entire debt to the private sector by February 2013 in order to\nimprove the economy's overall liquidity. North Macedonia's external trade\nstruggled in 2010 due to the slow recovery from the economic crisis of its\nmain trading partners, particularly EU members. Starting from a very low base,\nexport growth in the first 8 months of 2011 reached 41.7%, topping import\ngrowth of 36.8%. The trade deficit has widened to 18.3% of GDP, approaching\nthe end-year target of 21.9% of GDP. At the same time, the current account\nbalance deficit significantly improved and the end-year projection was revised\nupward to 5.5% of GDP. This was due primarily to a 4.4% higher inflow of\ncurrent transfers, mostly during the summer, and came despite a poor level of\nforeign direct investment (FDI) of only $237.2 million by end-July 2011.\nForeign currency reserves remained at about $2.6 billion, a level that\ncomfortably covers 4 months of imports and about 110% of the country's short-\nterm debt.\n\nIn October 2010, the World Bank Board of Directors approved a new Country\nPartnership Strategy (CPS) with North Macedonia for the period 2011–2014. This\nCPS will provide the country assistance of about $100 million in funding for\nthe first 2 years to improve competitiveness, strengthen employability and\nsocial protection, and increase the use of sustainable energy. This assistance\nalso includes a commitment of $30 million in direct budget support in the form\nof a policy-based guarantee by the World Bank to the government to facilitate\nits access to financing from international capital markets, a process that had\nbeen started as of November 2011.\n\nNorth Macedonia became the first country eligible for the IMF's Precautionary\nCredit Line in January 2011. This program gives North Macedonia a line of\ncredit worth 475 million euros (about $675 million) over 2 years, intended to\nbe accessed only in case of need brought about by external shocks. The credit\nline was approved after extensive consultations with the IMF in October and\nDecember 2010. The IMF expects that there will be no additional withdrawals\nfrom the PCL.\n\nNorth Macedonia has the best economic freedom in the region, according to the\n2012 Index of Economic Freedom, released in January, 2012 by the conservative\nU.S. think tank Heritage Foundation and the Wall Street Journal.",
    "openai_summarised_points": [
      "• In the first half of 2011, North Macedonia’s real GDP increased by 5.2%, driven primarily by sectoral growth including 23.6% in construction, 13.2% in mining, quarrying, and manufacturing, 12.4% in wholesale and retail trade, and 4.2% in transport and communication services.",
      "• Industrial output for the first eight months of 2011 was 7.5% higher compared to the same period in 2010.",
      "• The country’s low public and external debt levels, combined with comfortable foreign exchange reserves, enabled the Central Bank to relax monetary policy, reducing the reference interest rate to 4%.",
      "• Inflation rose in the first half of 2011 due to increasing international prices of energy, fuel, and food, but subsequently decreased to an annualized rate of 3.4% by the end of September 2011.",
      "• The official unemployment rate declined to 24.6% in the fourth quarter of 2015, remaining among the highest in Europe; however, many workers are employed in the gray economy, leading experts to estimate a lower actual unemployment rate.",
      "• The government budget generally adhered to projections, with the budget deficit reaching about 2% of GDP by the end of August 2011, below the projected target of 2.5% of GDP for the full year.",
      "• Financing in 2011 included 220 million euros (approximately $298 million) drawn from an IMF Precautionary Credit Line (PCL) in March, with the remainder primarily sourced from domestic borrowing.",
      "• By the end of 2011, a financing gap of approximately 50 to 60 million euros (about $67 million to $81 million) remained, which the government planned to cover through borrowing from international capital markets, supported by a World Bank policy-based guarantee.",
      "• Central government public debt remained low at 26% of GDP but showed a gradual increase compared to previous years.",
      "• Despite lowering the Central Bank bills rate, liquidity indicators for banks and the reserve requirement remained unchanged since 2009, limiting credit growth to 7.5% during the first three quarters of 2011.",
      "• Prime Minister Nikola Gruevski announced plans for the government to fully repay its debt to the private sector by February 2013 to enhance overall economic liquidity.",
      "• North Macedonia’s external trade faced challenges in 2010 due to slow recovery among key trading partners, especially EU members; however, export growth in the first eight months of 2011 surged by 41.7%, exceeding import growth of 36.8%.",
      "• The trade deficit widened to 18.3% of GDP by August 2011, nearing the year-end target of 21.9% of GDP.",
      "• The current account deficit improved significantly, with the end-year projection revised upward to 5.5% of GDP, largely due to a 4.4% increase in current transfers during the summer of 2011.",
      "• Foreign direct investment (FDI) remained low, totaling only $237.2 million by the end of July 2011.",
      "• Foreign currency reserves stood at approximately $2.6 billion, sufficient to cover four months of imports and about 110% of the country’s short-term debt.",
      "• In October 2010, the World Bank Board of Directors approved a new Country Partnership Strategy (CPS) for North Macedonia covering 2011–2014, providing about $100 million in funding over the first two years to enhance competitiveness, employability, social protection, and sustainable energy use.",
      "• The World Bank’s assistance under the CPS included a $30 million direct budget support commitment via a policy-based guarantee to facilitate the government’s access to international capital markets, a process initiated in November 2011.",
      "• North Macedonia became the first country eligible for the IMF’s Precautionary Credit Line (PCL) in January 2011, granting access to a credit line worth 475 million euros (about $675 million) over two years, intended for use only in response to external shocks.",
      "• The IMF approved the PCL after extensive consultations in October and December 2010 and anticipated no additional withdrawals from the credit line.",
      "• According to the 2012 Index of Economic Freedom, released in January 2012 by the Heritage Foundation and the Wall Street Journal, North Macedonia had the highest level of economic freedom in the region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:25:28.669351",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4411,
      "bullet_points_count": 21
    },
    "generated_detailed_content": "In the first half of 2011, North Macedonia experienced a notable increase in its real gross domestic product (GDP), which grew by 5.2% compared to the corresponding period in the previous year. This growth was driven primarily by significant sectoral expansions, with the construction industry leading the surge by expanding 23.6%. The mining, quarrying, and manufacturing sectors collectively contributed a robust 13.2% increase, reflecting heightened industrial activity and production capacity. Additionally, the wholesale and retail trade sector grew by 12.4%, indicating a revival in consumer demand and commercial transactions. The transport and communication services sectors also experienced moderate growth of 4.2%, supporting the overall economic momentum through improved connectivity and logistics services. Industrial output further underscored the positive economic trajectory, with production levels for the first eight months of 2011 rising by 7.5% relative to the same period in 2010. This increase in industrial output was indicative of a recovering manufacturing base and expanding industrial capacity, which played a crucial role in sustaining the country’s economic growth. The expansion in industrial production was supported by both domestic demand and export activities, contributing to a more diversified and resilient economic structure. North Macedonia’s macroeconomic stability during this period was bolstered by its relatively low public and external debt levels, which provided the Central Bank with the flexibility to adopt a more accommodative monetary policy stance. This fiscal prudence, combined with comfortable foreign exchange reserves, enabled the Central Bank to reduce the reference interest rate to 4%. Lowering the interest rate was aimed at stimulating investment and consumption by making borrowing more affordable, thereby supporting economic growth without compromising financial stability. Inflationary pressures were evident in the first half of 2011, primarily driven by rising international prices for energy, fuel, and food commodities. These external cost shocks contributed to an upward trend in consumer prices, reflecting the country’s vulnerability to global commodity price fluctuations. However, inflationary pressures moderated in the subsequent months, with the annualized inflation rate decreasing to 3.4% by the end of September 2011. This decline was facilitated by stabilizing global prices and domestic monetary policy measures aimed at containing inflation, thereby preserving purchasing power and economic stability. Despite some improvements in labor market conditions, North Macedonia’s official unemployment rate remained high, standing at 24.6% in the fourth quarter of 2015. This rate was among the highest in Europe, highlighting persistent challenges in job creation and labor market integration. Nevertheless, the official figures did not fully capture the employment landscape, as a significant portion of the workforce was engaged in the informal or gray economy. Experts estimated that the actual unemployment rate was lower than official statistics suggested, reflecting the prevalence of informal employment arrangements that, while providing income, often lacked social protections and formal labor rights. Fiscal discipline characterized the government’s budgetary performance in 2011, with expenditures and revenues generally adhering to projections. By the end of August 2011, the budget deficit reached approximately 2% of GDP, remaining below the initially projected target of 2.5% of GDP for the entire year. This fiscal outcome was achieved through prudent budget management and efforts to contain public spending, which helped maintain macroeconomic stability and investor confidence. To finance its budgetary needs in 2011, North Macedonia drew 220 million euros (approximately $298 million) from an International Monetary Fund (IMF) Precautionary Credit Line (PCL) in March. This credit facility was part of a broader strategy to ensure adequate liquidity and financial stability amid global economic uncertainties. The remainder of the government’s financing requirements was primarily met through domestic borrowing, reflecting a balanced approach to managing fiscal resources without excessive reliance on external debt. By the end of 2011, a financing gap estimated at approximately 50 to 60 million euros (about $67 million to $81 million) persisted, which the government planned to address by borrowing from international capital markets. This strategy was supported by a World Bank policy-based guarantee, which enhanced the government’s creditworthiness and facilitated access to external funding on favorable terms. The utilization of international capital markets marked an important step in diversifying financing sources and strengthening the country’s fiscal framework. Central government public debt remained relatively low at 26% of GDP by the end of 2011, although it exhibited a gradual upward trend compared to previous years. This increase reflected the government’s measured use of borrowing to support economic growth and infrastructure development while maintaining debt sustainability. The moderate debt level provided room for fiscal maneuvering without compromising long-term macroeconomic stability. Despite the reduction in the Central Bank bills rate, liquidity indicators for banks and the reserve requirement remained unchanged since 2009. This policy stance limited credit growth to 7.5% during the first three quarters of 2011, as banks operated under relatively tight liquidity conditions. The unchanged reserve requirement meant that banks had to maintain a certain proportion of deposits as reserves, which constrained their ability to expand lending aggressively. Consequently, credit expansion was moderate, reflecting cautious banking sector behavior amid ongoing economic adjustments. Prime Minister Nikola Gruevski announced plans for the government to fully repay its debt to the private sector by February 2013. This initiative aimed to enhance overall economic liquidity by freeing up resources within the private sector and improving cash flow for businesses and financial institutions. The repayment of government arrears was expected to stimulate economic activity by reducing financial bottlenecks and fostering a more conducive environment for private sector growth. North Macedonia’s external trade faced challenges in 2010 due to a slow recovery among key trading partners, particularly members of the European Union. The sluggish demand in these markets constrained export growth and affected the country’s trade balance. However, the first eight months of 2011 saw a remarkable turnaround, with export growth surging by 41.7%, significantly outpacing import growth, which increased by 36.8%. This robust export performance was driven by improved competitiveness, diversification of export products, and recovery in external demand, contributing positively to the country’s external sector. Despite the strong export growth, the trade deficit widened to 18.3% of GDP by August 2011, approaching the year-end target of 21.9% of GDP. The expanding deficit reflected the continued reliance on imports to meet domestic demand and support economic growth. The trade deficit remained a key macroeconomic challenge, necessitating efforts to boost export competitiveness and reduce external imbalances. The current account deficit showed significant improvement during 2011, with the end-year projection revised upward to 5.5% of GDP. This improvement was largely attributable to a 4.4% increase in current transfers during the summer of 2011, which included remittances from the diaspora and other inflows. The enhanced current transfers helped offset the widening trade deficit, contributing to a more balanced external position and supporting foreign exchange reserves. Foreign direct investment (FDI) inflows remained relatively low, totaling only $237.2 million by the end of July 2011. This modest level of FDI reflected ongoing challenges in attracting substantial foreign capital, including structural issues, regulatory barriers, and regional economic uncertainties. Increasing FDI was recognized as a priority for fostering long-term economic growth, technology transfer, and employment generation. Foreign currency reserves stood at approximately $2.6 billion in 2011, a level sufficient to cover four months of imports and about 110% of the country’s short-term debt. This reserve adequacy provided a buffer against external shocks and exchange rate volatility, enhancing the country’s financial stability and creditworthiness. The comfortable reserve position allowed the Central Bank to maintain confidence in the domestic currency and support monetary policy objectives. In October 2010, the World Bank Board of Directors approved a new Country Partnership Strategy (CPS) for North Macedonia covering the period from 2011 to 2014. The CPS aimed to provide about $100 million in funding over the first two years, focusing on enhancing competitiveness, employability, social protection, and sustainable energy use. This strategic partnership sought to support structural reforms and inclusive growth by addressing key development challenges and promoting economic diversification. Under the CPS, the World Bank committed $30 million in direct budget support through a policy-based guarantee to facilitate the government’s access to international capital markets. This initiative, launched in November 2011, was designed to improve the country’s borrowing terms and reduce financing costs by leveraging the World Bank’s creditworthiness. The policy-based guarantee represented a critical component of the government’s strategy to strengthen fiscal management and mobilize external resources. North Macedonia became the first country eligible for the IMF’s Precautionary Credit Line (PCL) in January 2011, granting access to a credit facility worth 475 million euros (about $675 million) over two years. The PCL was intended as a precautionary measure to provide financial support only in response to external shocks, thereby enhancing the country’s resilience to global economic volatility. The IMF’s approval of the PCL followed extensive consultations in October and December 2010, during which the Fund assessed the country’s economic policies and prospects. The IMF anticipated no additional withdrawals from the PCL after the initial drawdown, reflecting confidence in North Macedonia’s macroeconomic management and external position. The availability of the PCL served as a financial safety net, reassuring investors and markets of the country’s capacity to withstand potential external disturbances without resorting to disruptive adjustment measures. According to the 2012 Index of Economic Freedom, released in January 2012 by the Heritage Foundation and the Wall Street Journal, North Macedonia achieved the highest level of economic freedom in the region. This ranking reflected the country’s progress in implementing market-oriented reforms, improving regulatory efficiency, and fostering a business-friendly environment. The high level of economic freedom was indicative of North Macedonia’s commitment to liberal economic policies and integration into the global economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:37:04.251807",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 21,
      "generated_content_length": 11333,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of North Macedonia",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Macroeconomic trends",
    "text": "Year  | GDP\n(in bil. US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in bil. US$ nominal)  | GDP per capita\n(in US$ nominal)  | GDP growth rate\n---|---|---|---|---|---\n1992  | 12.5  | 6,470  | 2.4  | 1,264  | n/a\n1993  | 11.8  | 6,097  | 2.7  | 1,384  | -7.5%\n1994  | 11.9  | 6,084  | 3.6  | 1,824  | -1.8%\n1995  | 12.0  | 6,107  | 4.7  | 2,387  | -1.1%\n1996  | 12.4  | 6,250  | 4.6  | 2,348  | 1.2%\n1997  | 12.7  | 6,423  | 3.9  | 1,980  | 1.4%\n1998  | 13.3  | 6,683  | 3.8  | 1,889  | 3.4%\n1999  | 14.1  | 7,041  | 3.9  | 1,932  | 4.3%\n2000  | 15.1  | 7,498  | 3.8  | 1,878  | 4.5%\n2001  | 14.9  | 7,407  | 3.7  | 1,840  | -3.1%\n2002  | 15.4  | 7,614  | 4.0  | 1,974  | 1.5%\n2003  | 16.0  | 7,918  | 4.9  | 2,441  | 2.2%\n2004  | 17.2  | 8,527  | 5.7  | 2,810  | 4.7%\n2005  | 18.6  | 9,289  | 6.3  | 3,120  | 4.7%\n2006  | 20.2  | 10,123  | 6.9  | 3,440  | 5.1%\n2007  | 22.1  | 11,134  | 8.3  | 4,204  | 6.5%\n2008  | 23.7  | 12,039  | 9.9  | 5,027  | 5.5%\n2009  | 23.8  | 12,148  | 9.4  | 4,799  | -0.4%\n2010  | 24.9  | 12,790  | 9.4  | 4,837  | 3.4%\n2011  | 26.0  | 13,421  | 10.5  | 5,419  | 2.3%\n2012  | 26.4  | 13,662  | 9.8  | 5,053  | -0.5%\n2013  | 27.6  | 14,354  | 10.8  | 5,629  | 2.9%\n2014  | 29.1  | 15,175  | 11.4  | 5,933  | 3.6%\n2015  | 30.5  | 15,949  | 10.1  | 5,264  | 3.9%\n2016  | 31.7  | 16,612  | 10.7  | 5,605  | 2.8%\n2017  | 32.6  | 17,161  | 11.3  | 5,971  | 1.1%\n2018  | 34.9  | 18,460  | 12.7  | 6,720  | 2.9%\n2019  | 37.9  | 20,223  | 12.6  | 6,720  | 3.9%\n2020  | 37.1  | 19,962  | 12.4  | 6,673  | -4.7%\n2021  | 41.1  | 22,373  | 14.0  | 7,625  | 4.5%\n2022  | 45.0  | 24,572  | 13.7  | 7,499  | 2.2%\n2023  | 47.1  | 25,718  | 14.8  | 8,063  | 1.0%\n2024  | 49.3  | 26,912  | 15.9  | 8,659  | 2.2%",
    "openai_summarised_points": [
      "• In 1992, North Macedonia's GDP was 12.5 billion US$ PPP with a GDP per capita of 6,470 US$ PPP; nominal GDP was 2.4 billion US$ with a nominal GDP per capita of 1,264 US$, and the GDP growth rate data was not available (n/a).",
      "• In 1993, the GDP decreased to 11.8 billion US$ PPP and GDP per capita to 6,097 US$ PPP; nominal GDP rose slightly to 2.7 billion US$ and nominal GDP per capita to 1,384 US$, with a GDP growth rate of -7.5%.",
      "• In 1994, GDP was 11.9 billion US$ PPP and GDP per capita 6,084 US$ PPP; nominal GDP increased to 3.6 billion US$ and nominal GDP per capita to 1,824 US$, with a GDP growth rate of -1.8%.",
      "• In 1995, GDP was 12.0 billion US$ PPP, GDP per capita 6,107 US$ PPP; nominal GDP rose to 4.7 billion US$ and nominal GDP per capita to 2,387 US$, with a GDP growth rate of -1.1%.",
      "• In 1996, GDP increased to 12.4 billion US$ PPP and GDP per capita to 6,250 US$ PPP; nominal GDP slightly decreased to 4.6 billion US$ and nominal GDP per capita to 2,348 US$, with a positive GDP growth rate of 1.2%.",
      "• In 1997, GDP was 12.7 billion US$ PPP and GDP per capita 6,423 US$ PPP; nominal GDP decreased to 3.9 billion US$ and nominal GDP per capita to 1,980 US$, with a GDP growth rate of 1.4%.",
      "• In 1998, GDP rose to 13.3 billion US$ PPP and GDP per capita to 6,683 US$ PPP; nominal GDP was 3.8 billion US$ and nominal GDP per capita 1,889 US$, with a GDP growth rate of 3.4%.",
      "• In 1999, GDP increased to 14.1 billion US$ PPP and GDP per capita to 7,041 US$ PPP; nominal GDP was 3.9 billion US$ and nominal GDP per capita 1,932 US$, with a GDP growth rate of 4.3%.",
      "• In 2000, GDP reached 15.1 billion US$ PPP and GDP per capita 7,498 US$ PPP; nominal GDP slightly decreased to 3.8 billion US$ and nominal GDP per capita to 1,878 US$, with a GDP growth rate of 4.5%.",
      "• In 2001, GDP slightly declined to 14.9 billion US$ PPP and GDP per capita to 7,407 US$ PPP; nominal GDP decreased to 3.7 billion US$ and nominal GDP per capita to 1,840 US$, with a negative GDP growth rate of -3.1%.",
      "• In 2002, GDP increased to 15.4 billion US$ PPP and GDP per capita to 7,614 US$ PPP; nominal GDP rose to 4.0 billion US$ and nominal GDP per capita to 1,974 US$, with a GDP growth rate of 1.5%.",
      "• In 2003, GDP was 16.0 billion US$ PPP and GDP per capita 7,918 US$ PPP; nominal GDP increased to 4.9 billion US$ and nominal GDP per capita to 2,441 US$, with a GDP growth rate of 2.2%.",
      "• In 2004, GDP rose to 17.2 billion US$ PPP and GDP per capita to 8,527 US$ PPP; nominal GDP was 5.7 billion US$ and nominal GDP per capita 2,810 US$, with a GDP growth rate of 4.7%.",
      "• In 2005, GDP increased to 18.6 billion US$ PPP and GDP per capita to 9,289 US$ PPP; nominal GDP rose to 6.3 billion US$ and nominal GDP per capita to 3,120 US$, with a GDP growth rate of 4.7%.",
      "• In 2006, GDP reached 20.2 billion US$ PPP and GDP per capita 10,123 US$ PPP; nominal GDP was 6.9 billion US$ and nominal GDP per capita 3,440 US$, with a GDP growth rate of 5.1%.",
      "• In 2007, GDP increased to 22.1 billion US$ PPP and GDP per capita to 11,134 US$ PPP; nominal GDP rose significantly to 8.3 billion US$ and nominal GDP per capita to 4,204 US$, with a GDP growth rate of 6.5%.",
      "• In 2008, GDP was 23.7 billion US$ PPP and GDP per capita 12,039 US$ PPP; nominal GDP increased to 9.9 billion US$ and nominal GDP per capita to 5,027 US$, with a GDP growth rate of 5.5%.",
      "• In 2009, GDP slightly increased to 23.8 billion US$ PPP and GDP per capita to 12,148 US$ PPP; nominal GDP decreased to 9.4 billion US$ and nominal GDP per capita to 4,799 US$, with a negative GDP growth rate of -0.4%.",
      "• In 2010, GDP rose to 24.9 billion US$ PPP and GDP per capita to 12,790 US$ PPP; nominal GDP remained at 9.4 billion US$ and nominal GDP per capita was 4,837 US$, with a GDP growth rate of 3.4%.",
      "• In 2011, GDP increased to 26.0 billion US$ PPP and GDP per capita to 13,421 US$ PPP; nominal GDP rose to 10.5 billion US$ and nominal GDP per capita to 5,419 US$, with a GDP growth rate of 2.3%.",
      "• In 2012, GDP was 26.4 billion US$ PPP and GDP per capita 13,662 US$ PPP; nominal GDP decreased to 9.8 billion US$ and nominal GDP per capita to 5,053 US$, with a GDP growth rate of -0.5%.",
      "• In 2013, GDP increased to 27.6 billion US$ PPP and GDP per capita to 14,354 US$ PPP; nominal GDP rose to 10.8 billion US$ and nominal GDP per capita to 5,629 US$, with a GDP growth rate of 2.9%.",
      "• In 2014, GDP reached 29.1 billion US$ PPP and GDP per capita 15,175 US$ PPP; nominal GDP was 11.4 billion US$ and nominal GDP per capita 5,933 US$, with a GDP growth rate of 3.6%.",
      "• In 2015, GDP increased to 30.5 billion US$ PPP and GDP per capita to 15,949 US$ PPP; nominal GDP decreased to 10.1 billion US$ and nominal GDP per capita to 5,264 US$, with a GDP growth rate of 3.9%.",
      "• In 2016, GDP rose to 31.7 billion US$ PPP and GDP per capita to 16,612 US$ PPP; nominal GDP increased to 10.7 billion US$ and nominal GDP per capita to 5,605 US$, with a GDP growth rate of 2.8%.",
      "• In 2017, GDP was 32.6 billion US$ PPP and GDP per capita 17,161 US$ PPP; nominal GDP increased to 11.3 billion US$ and nominal GDP per capita to 5,971 US$, with a GDP growth rate of 1.1%.",
      "• In 2018, GDP increased to 34.9 billion US$ PPP and GDP per capita to 18,460 US$ PPP; nominal GDP rose to 12.7 billion US$ and nominal GDP per capita to 6,720 US$, with a GDP growth rate of 2.9%.",
      "• In 2019, GDP reached 37.9 billion US$ PPP and GDP per capita 20,223 US$ PPP; nominal GDP slightly decreased to 12.6 billion US$ and nominal GDP per capita remained at 6,720 US$, with a GDP growth rate of 3.9%.",
      "• In 2020, GDP declined to 37.1 billion US$ PPP and GDP per capita to 19,962 US$ PPP; nominal GDP decreased to 12.4 billion US$ and nominal GDP per capita to 6,673 US$, with a negative GDP growth rate of -4.7%.",
      "• In 2021, GDP increased significantly to 41.1 billion US$ PPP and GDP per capita to 22,373 US$ PPP; nominal GDP rose to 14.0 billion US$ and nominal GDP per capita to 7,625 US$, with a GDP growth rate of 4.5%.",
      "• In 2022, GDP rose to 45.0 billion US$ PPP and GDP per capita to 24,572 US$ PPP; nominal GDP slightly decreased to 13.7 billion US$ and nominal GDP per capita to 7,499 US$, with a GDP growth rate of 2."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:26:04.598674",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1723,
      "bullet_points_count": 31
    },
    "generated_detailed_content": "In 1992, North Macedonia's gross domestic product (GDP) measured at 12.5 billion US dollars in terms of purchasing power parity (PPP), with a GDP per capita of 6,470 US dollars PPP. The nominal GDP for the same year stood at 2.4 billion US dollars, corresponding to a nominal GDP per capita of 1,264 US dollars. Data regarding the GDP growth rate for 1992 was not available, leaving the economic expansion or contraction during that year undocumented. The early 1990s marked a period of economic transition for North Macedonia, emerging from the dissolution of Yugoslavia, which influenced its initial economic indicators. By 1993, the country's GDP had decreased to 11.8 billion US dollars PPP, with the GDP per capita declining to 6,097 US dollars PPP. Despite this contraction in PPP terms, nominal GDP showed a slight increase to 2.7 billion US dollars, and nominal GDP per capita rose to 1,384 US dollars. The GDP growth rate registered a significant decline of -7.5%, reflecting the economic challenges faced during this period, including regional instability and the adjustment to a market economy. In 1994, North Macedonia's GDP stabilized somewhat at 11.9 billion US dollars PPP, with the GDP per capita marginally decreasing to 6,084 US dollars PPP. Nominal GDP experienced a more notable increase to 3.6 billion US dollars, while nominal GDP per capita rose to 1,824 US dollars. The GDP growth rate remained negative but improved to -1.8%, indicating a slowing of economic contraction and the beginning of gradual recovery efforts. The year 1995 saw a slight growth in GDP to 12.0 billion US dollars PPP, with GDP per capita increasing to 6,107 US dollars PPP. Nominal GDP continued its upward trend, reaching 4.7 billion US dollars, and nominal GDP per capita rose to 2,387 US dollars. The GDP growth rate, however, was still negative at -1.1%, suggesting that while nominal values improved, the overall economy was still struggling to achieve positive growth. In 1996, the economy showed signs of recovery as GDP increased to 12.4 billion US dollars PPP, with GDP per capita rising to 6,250 US dollars PPP. Interestingly, nominal GDP slightly decreased to 4.6 billion US dollars, and nominal GDP per capita fell to 2,348 US dollars. Despite this nominal decline, the GDP growth rate turned positive at 1.2%, marking the first year of economic expansion after several years of contraction. The upward trend continued in 1997, with GDP reaching 12.7 billion US dollars PPP and GDP per capita increasing to 6,423 US dollars PPP. Nominal GDP, however, decreased to 3.9 billion US dollars, and nominal GDP per capita declined to 1,980 US dollars. The GDP growth rate was 1.4%, indicating modest economic growth despite fluctuations in nominal terms, possibly reflecting currency valuation effects or inflation adjustments. In 1998, the economy expanded further with GDP rising to 13.3 billion US dollars PPP and GDP per capita increasing to 6,683 US dollars PPP. Nominal GDP was recorded at 3.8 billion US dollars, with nominal GDP per capita at 1,889 US dollars. The GDP growth rate accelerated to 3.4%, reflecting improving economic conditions and increased productivity. The year 1999 saw continued growth as GDP increased to 14.1 billion US dollars PPP, with GDP per capita reaching 7,041 US dollars PPP. Nominal GDP was 3.9 billion US dollars, and nominal GDP per capita stood at 1,932 US dollars. The GDP growth rate rose to 4.3%, signaling a strengthening economy amid regional challenges, including the Kosovo conflict, which had indirect effects on North Macedonia's economic environment. In 2000, GDP reached 15.1 billion US dollars PPP, with GDP per capita climbing to 7,498 US dollars PPP. Nominal GDP slightly decreased to 3.8 billion US dollars, and nominal GDP per capita fell to 1,878 US dollars. Despite the nominal decline, the GDP growth rate was 4.5%, indicating robust real economic growth driven by increased output and investment. However, in 2001, the GDP slightly declined to 14.9 billion US dollars PPP, and GDP per capita decreased to 7,407 US dollars PPP. Nominal GDP dropped to 3.7 billion US dollars, with nominal GDP per capita at 1,840 US dollars. The GDP growth rate recorded a negative value of -3.1%, reflecting the impact of the internal conflict and political instability that affected economic performance during this period. Economic recovery resumed in 2002, with GDP increasing to 15.4 billion US dollars PPP and GDP per capita rising to 7,614 US dollars PPP. Nominal GDP grew to 4.0 billion US dollars, and nominal GDP per capita increased to 1,974 US dollars. The GDP growth rate was 1.5%, indicating a cautious return to growth as the country stabilized politically and economically. In 2003, the economy expanded further, with GDP reaching 16.0 billion US dollars PPP and GDP per capita at 7,918 US dollars PPP. Nominal GDP increased significantly to 4.9 billion US dollars, and nominal GDP per capita rose to 2,441 US dollars. The GDP growth rate improved to 2.2%, reflecting enhanced economic activity and investment. The year 2004 saw continued growth, with GDP rising to 17.2 billion US dollars PPP and GDP per capita increasing to 8,527 US dollars PPP. Nominal GDP was 5.7 billion US dollars, and nominal GDP per capita stood at 2,810 US dollars. The GDP growth rate accelerated to 4.7%, indicating strong economic momentum driven by structural reforms and increased foreign investment. In 2005, GDP further increased to 18.6 billion US dollars PPP, with GDP per capita reaching 9,289 US dollars PPP. Nominal GDP rose to 6.3 billion US dollars, and nominal GDP per capita increased to 3,120 US dollars. The GDP growth rate remained robust at 4.7%, reflecting sustained economic expansion and improved business confidence. By 2006, GDP had reached 20.2 billion US dollars PPP, with GDP per capita climbing to 10,123 US dollars PPP. Nominal GDP was 6.9 billion US dollars, and nominal GDP per capita stood at 3,440 US dollars. The GDP growth rate increased to 5.1%, marking one of the highest growth rates in the decade, supported by increased industrial output and export growth. In 2007, the economy continued its upward trajectory, with GDP rising to 22.1 billion US dollars PPP and GDP per capita reaching 11,134 US dollars PPP. Nominal GDP experienced a significant increase to 8.3 billion US dollars, and nominal GDP per capita rose to 4,204 US dollars. The GDP growth rate accelerated to 6.5%, reflecting a period of rapid economic development and integration into regional markets. The year 2008 saw GDP grow to 23.7 billion US dollars PPP, with GDP per capita increasing to 12,039 US dollars PPP. Nominal GDP rose to 9.9 billion US dollars, and nominal GDP per capita reached 5,027 US dollars. The GDP growth rate was 5.5%, maintaining strong economic performance despite the onset of the global financial crisis. In 2009, GDP slightly increased to 23.8 billion US dollars PPP, with GDP per capita at 12,148 US dollars PPP. However, nominal GDP decreased to 9.4 billion US dollars, and nominal GDP per capita fell to 4,799 US dollars. The GDP growth rate turned negative at -0.4%, indicating the impact of the global economic downturn on North Macedonia’s economy, which experienced stagnation and contraction in certain sectors. Economic recovery became evident in 2010 as GDP rose to 24.9 billion US dollars PPP, with GDP per capita increasing to 12,790 US dollars PPP. Nominal GDP remained stable at 9.4 billion US dollars, and nominal GDP per capita was 4,837 US dollars. The GDP growth rate rebounded to 3.4%, reflecting renewed growth driven by domestic demand and export recovery. In 2011, GDP increased further to 26.0 billion US dollars PPP, with GDP per capita reaching 13,421 US dollars PPP. Nominal GDP rose to 10.5 billion US dollars, and nominal GDP per capita increased to 5,419 US dollars. The GDP growth rate moderated to 2.3%, indicating steady but slower growth compared to the previous year. The year 2012 saw GDP at 26.4 billion US dollars PPP, with GDP per capita at 13,662 US dollars PPP. Nominal GDP decreased to 9.8 billion US dollars, and nominal GDP per capita fell to 5,053 US dollars. The GDP growth rate was negative at -0.5%, reflecting economic challenges such as reduced investment and external demand pressures. In 2013, the economy began to recover, with GDP increasing to 27.6 billion US dollars PPP and GDP per capita rising to 14,354 US dollars PPP. Nominal GDP increased to 10.8 billion US dollars, and nominal GDP per capita rose to 5,629 US dollars. The GDP growth rate improved to 2.9%, signaling renewed confidence and economic expansion. GDP growth continued in 2014, reaching 29.1 billion US dollars PPP, with GDP per capita at 15,175 US dollars PPP. Nominal GDP was 11.4 billion US dollars, and nominal GDP per capita was 5,933 US dollars. The GDP growth rate accelerated to 3.6%, supported by increased industrial production and service sector growth. In 2015, GDP increased to 30.5 billion US dollars PPP, with GDP per capita rising to 15,949 US dollars PPP. Nominal GDP, however, decreased to 10.1 billion US dollars, and nominal GDP per capita fell to 5,264 US dollars. Despite the nominal decline, the GDP growth rate remained positive at 3.9%, indicating ongoing real economic growth. The year 2016 saw GDP rise to 31.7 billion US dollars PPP, with GDP per capita increasing to 16,612 US dollars PPP. Nominal GDP increased to 10.7 billion US dollars, and nominal GDP per capita rose to 5,605 US dollars. The GDP growth rate slowed to 2.8%, reflecting moderate economic expansion amid global economic uncertainties. In 2017, GDP reached 32.6 billion US dollars PPP, with GDP per capita at 17,161 US dollars PPP. Nominal GDP increased to 11.3 billion US dollars, and nominal GDP per capita rose to 5,971 US dollars. The GDP growth rate further decelerated to 1.1%, indicating a period of slower growth as the economy adjusted to external and domestic factors. Economic growth accelerated again in 2018, with GDP increasing to 34.9 billion US dollars PPP and GDP per capita rising to 18,460 US dollars PPP. Nominal GDP rose to 12.7 billion US dollars, and nominal GDP per capita increased to 6,720 US dollars. The GDP growth rate improved to 2.9%, supported by increased investment and export activity. In 2019, GDP reached 37.9 billion US dollars PPP, with GDP per capita climbing to 20,223 US dollars PPP. Nominal GDP slightly decreased to 12.6 billion US dollars, while nominal GDP per capita remained steady at 6,720 US dollars. The GDP growth rate was 3.9%, reflecting continued economic expansion despite nominal fluctuations. The year 2020 was marked by a decline in economic activity, with GDP falling to 37.1 billion US dollars PPP and GDP per capita decreasing to 19,962 US dollars PPP. Nominal GDP decreased to 12.4 billion US dollars, and nominal GDP per capita fell to 6,673 US dollars. The GDP growth rate was negative at -4.7%, largely due to the global COVID-19 pandemic, which disrupted economic activity and reduced demand across sectors. In 2021, the economy rebounded significantly, with GDP increasing to 41.1 billion US dollars PPP and GDP per capita rising to 22,373 US dollars PPP. Nominal GDP rose to 14.0 billion US dollars, and nominal GDP per capita increased to 7,625 US dollars. The GDP growth rate recovered to 4.5%, reflecting a strong post-pandemic economic recovery supported by government stimulus and renewed consumer spending. By 2022, GDP further increased to 45.0 billion US dollars PPP, with GDP per capita reaching 24,572 US dollars PPP. Nominal GDP slightly decreased to 13.7 billion US dollars, and nominal GDP per capita fell to 7,499 US dollars. The GDP growth rate slowed to 2%, indicating continued growth but at a more moderate pace as the economy adjusted to ongoing global economic challenges, including inflationary pressures and geopolitical uncertainties.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T16:37:09.553047",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 31,
      "generated_content_length": 11922,
      "generation_type": "detailed_expansion"
    }
  }
]