[
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Saint Lucia\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( May 2018)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nOnce a single-crop agricultural economy, Saint Lucia has shifted to a tourism\nand banking serviced-based economy. Tourism, the island's biggest industry and\nmain source of jobs, income and foreign exchange, accounts for 65% of its GDP.\nAgriculture, which was once the biggest industry, now contributes to less than\n3% of GDP, but still accounts for 20% of jobs. The banana industry is now on a\ndecline due to strong competition from low-cost Latin American producers and\nreduced European trade preferences, but the government has helped revitalize\nthe industry, with 13,734 tonnes exported in 2018. Agricultural crops grown\nfor export are bananas, mangoes, and avocados. The island is considered to\nhave the most diverse and well-developed manufacturing industry in the eastern\nCaribbean.\n\nSaint Lucia has been able to attract many foreign businesses and\ninvestors.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "The island's banana output was heavily impacted in 2007 by Hurricane Dean. In\n2006, the governor stated:\n\nWhile living standards have improved for many, a large number of people have been pushed to the margin of economic activity, especially in the areas which once depended heavily on the banana industry for a livelihood.\nSt. Lucia Bananas"
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( June 2020)__(Learn how and when to remove this message)_\n---|---\n\nAgriculture is the second-largest industry in Saint Lucia. In 2020,\nagriculture only contributed 2.2% to Saint Lucia's GDP, but still accounts for\na significant number of jobs - some 10% of the employed population. As of the\n2010 census, the roughly 10,000 agricultural holdings covered an area of\n30,204 acres, an average of 3.0 acres per agricultural holding.\n\nAbout 18% of the land is used for agricultural practices. Most farms consist\nof less than 5 acres of land. The main agricultural products grown in Saint\nLucia are bananas, coconuts, cocoa beans, mangoes, avocados, vegetables,\ncitrus fruits, and root crops such as yams and sweet potatoes. Most of these\nagricultural products are grown for local consumption, but bananas and\ncoconuts are mainly grown for export, with some vegetables. Bananas occupy\nabout 14,826 acres of the agricultural land, while coconuts occupy 12,400\nacres.\n\nSaint Lucia has a small livestock sector, which is dominated by poultry and\npork. The island is self-sufficient in egg production and is trying to become\nself-sufficient in poultry and pork production. The Ministry of Agriculture is\nencouraging farmers to raise sheep and goats to reduce the island's\nimportation of frozen meats, and has helped by providing support to farmers,\nimporting bloodlines of livestock to increase the productivity of animals, and\nproviding subsidies on animal feed.\n\nHelp is also being given to revitalize the local dairy and beef industries\nthrough the introduction of efficient cattle breeds, training of farmers to\ncare properly for livestock, and establishing funds for the construction of\ndairy units and abattoirs.\n\nThe island is also looking to expand its exports under the Taste of Saint\nLucia brand sponsored by Export Saint Lucia. Products that are being promoted\ninclude Saint Lucia Honey, rum, chocolate, coconut oil, granola, and insect\nrepellent."
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Tourism",
    "text": "The island currently attracts over 900,000 visitors annually. St Lucia has\nbeen able to attract foreign businesses and investment, especially in its\noffshore banking and tourism industries. Tourism is St Lucia's main source of\njobs and income, accounting for 65% of GDP, and the island's main source of\nforeign exchange earnings. The northern end of St Lucia is tourism's most\nurbanized area, with a fair number of hotels and resorts located along\nbeaches, or with seaside views. This is also home to many of the island's\nlarge, all-inclusive resorts."
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic trends",
    "text": "The level of island households living at or below the poverty level increased\nfrom 18.7 to 21.4% from 1995 to 2005. As of 2006, another 16.2% of the\nisland's population are vulnerable to economic shocks that could easily push\nthem below the poverty line. One rural district had 44.9% of households living\nbelow the poverty line (2005).\n\nTo broaden the island's economic base, the government added small, computer-\ndriven information technology and financial services as development\nobjectives.\n\nSt. Lucia's leading revenue producers—agriculture, tourism, and small-scale\nmanufacturing—benefited from a focus on infrastructure improvements in roads,\ncommunications, water supply, sewerage, and port facilities. Foreign investors\nalso have been attracted by the infrastructure improvements and by the\neducated and skilled work force and relatively stable political conditions.\nThe largest investment is in a petroleum storage and transshipment terminal\nbuilt by Hess Oil. The Caribbean Development Bank funded an airport expansion\nproject.\n\nUntil the events of 11 September 2001, the tourism sector had made significant\ngains, experiencing a boom despite some untimely and destructive hurricanes.\nStay-over visitors and cruise arrivals declined in 2001, and several hotels\ndeclared bankruptcy, including the Hyatt. The development of the tourism\nsector remains a priority, and the government is committed to providing a\nfavourable investment environment. Incentives are available for building and\nupgrading tourism facilities. Use of public funds to improve the physical\ninfrastructure of the island has been liberal, and the government has made\nefforts to attract cultural and sporting events and develop historical sites."
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Overview",
    "text": "St. Lucia's economy depends primarily on revenue from tourism and banana\nproduction, with some contribution from small-scale manufacturing.\n\nAlthough banana revenues have helped fund the country's development since the\n1960s, the industry is now in a terminal decline, due to reduced European\nUnion trade preferences and competition from lower-cost Latin American banana\nproducers. The country is encouraging farmers to plant crops such as cocoa,\nmangoes, and avocados to diversify its agricultural production and provide\njobs for displaced banana workers.\n\nTourism recovered in 2004, following the post-11 September 2001 recession, and\ncontinued to grow in 2005, making up more than 48% of St. Lucia's GDP. The\nhotel and restaurant industry grew by 6.3% during 2005. Stay-over arrivals\nincreased by 6.5%, and the United States remained the most important market,\naccounting for 35.4% of these arrivals. Yacht passengers rose by 21.9%.\nRedeployment of cruise ships, remedial berth construction, and high fuel costs\nprevented higher growth rates. However, several investors have planned new\ntourism projects for the island, including a large hotel and resort in the\nsouthern part of the island. The global recession has caused a reduction in\ntourist revenue and foreign investment, significantly slowing growth rates.\n\nSt. Lucia's currency is the Eastern Caribbean Dollar (EC$), a regional\ncurrency shared among members of the Eastern Caribbean Currency Union (ECCU).\nThe Eastern Caribbean Central Bank (ECCB) issues the EC$, manages monetary\npolicy, and regulates and supervises commercial banking activities in its\nmember countries. The ECCB has kept the EC$ pegged at EC$2.7 = US$1.\n\nSt. Lucia is a beneficiary of the U.S. Caribbean Basin Initiative and is a\nmember of the Caribbean Community and Common Market. The country hosts the\nexecutive secretariat of the Organization of Eastern Caribbean States.\n\nSt. Lucia is the headquarters of the Eastern Caribbean Telecommunications\nauthority, which is developing the regulations to liberalize the\ntelecommunications sector in the region by 2004."
  },
  {
    "chapter_name": "Economy of Saint Lucia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic statistics",
    "text": "Saint Lucia electricity production by source\n\n**GDP:** purchasing power parity - $1,667 billion (2016 est.)\n\n**GDP - real growth rate:** 3.5% (2012 est.)\n\n**GDP - per capita:** purchasing power parity - $12,952 (2016 est.)\n\n**GDP - composition by sector:**\n\n* _agriculture:_ 2.43%\n* _industry:_ 13.43%\n* _services:_ 84.14% (2016 est.)\n\n**Population below poverty line:** 21.4% (2005)\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ NA%\n_highest 10%:_ NA%\n\n**Inflation rate (consumer prices):** -0.934% (2016 est.)\n\n**Labour force:** 50,300 (2011)\n\n**Labour force - by occupation:**\n\n* agriculture 21.7%,\n* industry and commerce 24.7%,\n* services 53.6% (2002 est.)\n\n**Unemployment rate:** 15% (2013 est.)\n\n**Pay:** best is $350 a week\n\n**Budget:**\n_revenues:_ $141.2 million\n_expenditures:_ $146.7 million, including capital expenditures of $25.1\nmillion (2000 estimate) **Industries:** clothing, assembly of electronic\ncomponents, beverages, corrugated cardboard boxes, tourism, lime processing,\ncoconut processing\n\n**Industrial production growth rate:**\n\n* 8.9% (1997 est.)\n\n**Electricity - production:** 281 GWh (2003)\n\n**Electricity - production by source:**\n_fossil fuel:_ 100%\n_hydro:_ 0%\n_nuclear:_ 0%\n_other:_ 0% (1998)\n\n**Electricity - consumption:** 102 KWh (1998)\n\n**Agriculture - products:**\nbananas, coconuts, vegetables, citrus, root crops, cocoa\n\n**Exports:** $82 million (2004)\n\n**Exports - commodities:**\nbananas 41%, clothing, cocoa, vegetables, fruits, coconut oil\n\n**Exports - partners:**\nFrance 25%, United States 18.3%, United Kingdom 14.5%, Brazil 6.8% (2005)\n\n**Imports:** $410 million (2004)\n\n**Imports - commodities:**\nfood 23%, manufactured goods 21%, machinery and transportation equipment 19%,\nchemicals, fuels\n\n**Imports - partners:** United States 23.8%, Trinidad and Tobago 16%,\nNetherlands 11.1%, Venezuela 6.3%, Finland 6.2%, United Kingdom 5.7%, France\n4.7% (2005)\n\n**Debt - external:**\n\n* $214 million (2000)\n\n**Economic aid - recipient:** $51.8 million (1995)\n\n**Currency:** 1 East Caribbean dollar (EC$) = 100 cents\n\n**Exchange rates:** East Caribbean dollars (EC$) per US$1 – 2.7000 (fixed rate\nsince 1976)\n\n**Fiscal year:** 1 April – 31 March"
  }
]