[
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( March 2022)_  \n---|---  \n  \nIn ancient times, Maldives were renowned for cowries, coir rope, dried tuna\nfish (Maldive fish), ambergris (_maavaharu_) and coco de mer (_tavakkaashi_).\nLocal and foreign trading ships used to load these products in the Maldives\nand bring them abroad.\n\nNowadays, the mixed economy of Maldives is based on the principal activities\nof tourism, fishing and shipping. This results from the Maldives' strategic\ngeographic positioning near crucial sea routes essential for China's energy\nprovisions. Consequently, China has persistently utilized its economic\nresources to enhance its sway over the Maldivian government.\n\n**Tourism** is the largest industry in the Maldives, accounting for 28% of GDP\nand more than 60% of the Maldives' foreign exchange receipts. It powered the\ncurrent GDP per capita to expand 265% in the 1980s and a further 115% in the\n1990s. Over 90% of government tax revenue flows in from import duties and\ntourism-related taxes.\n\n**Fishing** is the second leading sector in the Maldives. The economic reform\nprogram by the government in 1989 lifted import quotas and opened some exports\nto the private sector. Subsequently, it has liberalized regulations to allow\nmore foreign investment.\n\n**Agriculture** and manufacturing play a minor role in the economy,\nconstrained by the limited availability of cultivable land and shortage of\ndomestic labour. Most staple foods are imported.\n\n**Industry** in the Maldives consists mainly of garment production, boat\nbuilding, and handicrafts. It accounts for around 18% of GDP. Maldivian\nauthorities are concerned about the impact of erosion and possible global\nwarming in the low-lying country.\n\nAmong the 1,190 islands in the Maldives, only 198 are inhabited. The\npopulation is scattered throughout the country, and the greatest concentration\nis on the capital island, Malé. Limitations on potable water and arable land,\nplus the added difficulty of congestion are some of the problems faced by\nhouseholds in Malé.\n\nDevelopment of the infrastructure in the Maldives is mainly dependent on the\ntourism industry and its complementary tertiary sectors, transport,\ndistribution, real estate, construction, and government. Taxes on the tourist\nindustry have been plowed into infrastructure and it is used to improve\ntechnology in the agricultural sector."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "This is a chart of trend of gross domestic product of Maldives at market\nprices estimated [1] by the International Monetary Fund with figures in\nmillions of rufiyaa.\n\nYear | Gross domestic product | US dollar exchange | Per capita income\n(as % of USA)\n---|---|---|---\n1980 | 440 | 7.58 rufiyaa | 3.11\n1985 | 885 | 7.08 rufiyaa | 3.85\n1990 | 2,054 | 9.55 rufiyaa | 4.34\n1995 | 4,696 | 11.76 rufiyaa | 6.29\n2000 | 7,348 | 11.77 rufiyaa | 6.77\n2005 | 10,458 | 12.80 rufiyaa | 5.33\n2011 | 10,458 | 15.40 rufiyaa | 7.43\n\nThe Maldives has experienced relatively low inflation throughout the recent\nyears. Real GDP growth averaged about 10% in the 1980s. It expanded by an\nexceptional 16.2% in 1990, declined to 4% in 1993, and, over the 1995–2004\ndecade, real GDP growth averaged just over 7.5% per year. In 2005, as a result\nof the tsunami, the GDP contracted by about 5.5%; however, the economy\nrebounded in 2006 with a 13% increase.\n\nThe following table shows the main economic indicators in 1980–2020.\n\nYear  | 1980  | 1985  | 1990  | 1995  | 2000  | 2005  | 2010  | 2015  | 2020\n---|---|---|---|---|---|---|---|---|---\nGDP in $\n(PPP) | 0.24 bn.  | 0.51 bn.  | 0.80 bn.  | 1.24 bn.  | 2.01 bn.  | 2.86 bn.  | 4.65 bn.  | 7.63 bn.  | 7.27 bn.\nGDP per capita in $\n(PPP) | 1,599  | 2,791  | 3,768  | 5,090  | 7,444  | 9,732  | 14,528  | 21,931  | 19,222\nInflation\n(in Percent Change) | 27.9 %  | -9.16 %  | 15.5 %  | 5.49 %  | −1.18 %  | 2.46 %  | 6.15 %  | 1.37 %  | -1.59 %\nGovernment debt\n(Percentage of GDP) | ...  | ...  | ...  | ...  | 39 %  | 43 %  | 53 %  | 55 %  | 146 %"
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Industry",
    "text": "The industrial sector provides only about 7% of GDP. Traditional industry\nconsists of boat building and handicrafts, while modern industry is limited to\na few tuna canneries, five garment factories, a bottling plant, and a few\nenterprises in the capital producing PVC pipe, soap, furniture, and food\nproducts. There are no patent laws in the Maldives."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Financial",
    "text": "The banking industry dominates the small financial sector of the Maldives. The\ncountry's seven banks are regulated by the Maldives Monetary Authority.\n\nWhile formerly the Maldives had no income, sales, property, or capital-gains\ntaxes, and was considered to have the simplest tax code in the world, now\ntaxation is regulated by the Maldives Inland Revenue Authority (MIRA). In\n2011, the Tax Justice Network gave the Maldives a \"secrecy score\" of 92 on its\nFinancial Secrecy Index - the highest score in that category of any actively-\nranked country; however by 2022 with a secrecy score of 75, no longer ranked\nin the top ten. However in both 2011 and 2022, the Maldives' minor market\nshare put it near the bottom of the overall weighted lists.\n\nA recurrent trend of Beijing leveraging its economic influence to attain\ngeopolitical goals is observable. This pattern is not confined solely to small\nisland nations in the Indian Ocean, like the Maldives and Sri Lanka, but\nextends to the wider Indo-Pacific region, encompassing countries with sizable\nand advanced economies as well. The Maldives government is grappling with\nconcerns about falling into a potential debt entrapment with China."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Shipping",
    "text": "Beginning in the 1990s, the Port of Male received over £10 million in loans\nfrom the Asian Development Bank designated for infrastructure upgraded. The\nADB notes that from 1991 to 2011, due to the loans, the ports annual\nthroughput in freight tons equaled 273,000. By 2011 that number reached 1\nmillion. The ADB also provided training for port authority staff to increase\nefficiency. ADB and the Government of Maldives, in a joint report address ship\nturn-around, \"What used to take about 10 days in 1991 was achieved in 3.8 days\nby 1997, and about 2.6 days by 2014\"."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Environmental concerns",
    "text": "There is growing concern towards the coral reef and marine life due to coral\nmining (used for building and jewelry making), sand dredging, solid waste\npollution and oil spills from boats. Mining of sand and coral has destroyed\nthe natural coral reef that once protected several important islands, now\nmaking them highly susceptible to the erosive effects of the sea. The\ndestruction of large coral beds due to heat is also a growing concern.\n\nIn April 1987, high tides swept over the Maldives, inundating much of Malé and\nnearby islands which prompted Maldivian authorities to take global climatic\nchanges seriously. An INQUA research in 2003 found that actual sea levels in\nthe Maldives had dropped in the 1970s and forecasts little change in the next\ncentury. There is also concern over the questionable shark fishing practices\nin place in the island. Shark fishing is forbidden by law, but these laws are\nnot enforced. The population of sharks has sharply decreased in recent years.\n\nThe Asian brown cloud hovering in the atmosphere over the northern Indian\nOcean is also another concern. Studies show that decreased sunshine and\nincreased acid rain source from this cloud."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Energy",
    "text": "While electricity in the Maldives has historically come entirely from diesel\ngenerators, solar power has been increasingly adopted to avoid high fuel\ncosts. The resort on Dhiddhoofinolhu claims to have the world's largest\noceanic floating solar plant, with 678 kW enough to supply peak demand. The\ncountry's Environment Ministry has deployed solar–battery–diesel hybrid\nsystems across the outer islands to reduce subsidies for imported diesel and\npromote low-carbon energy independence."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Poverty, income and gender inequality",
    "text": "Old street sellers in Malé\n\nMaldives achieved their Millennium Development Goal (MDG) of halving the\nproportion of people living under the poverty line to 1% as of 2011.\nStarvation is non-existent, HIV rates have fallen and malaria has been\neradicated. Despite these accomplishments and progressive economic growth,\ndevelopmental issues remain. In particular, the country needs to address\nincome and gender disparities. Development in Maldives has occurred\npredominantly in the capital Malé; islands outside the capital continue to\nencounter high poverty vulnerability, lower per-capita income, lower\nemployment and limited access to social services. A country-wide household\nincome survey in 1997-1998 showed that the average income in the capital Malé\nwas 75% higher than in surrounding islands. Maldives's Gini co-efficient\nstands at 0.41."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Poverty and Income Disparity",
    "text": "The factors that have led to Maldivians falling into or remaining in poverty\nare:\n\n1. **Geography** : Residents of the northern regions of Maldives tend to remain in poverty more than other regions due to the relatively lower level of development in the North;\n2. **Health** : Maldivians who do not work due to poor health remain in poverty possibly on account of lower accessibility to health services in the country;\n3. **Young household members** : Larger proportion of young family members results in a lower overall household income;\n4. **Female household members** : Lower female labour participation rate and therefore, households with a greater proportion of females will have lower household income.\n\nThe difficulty of accessing social services and infrastructure in the outer\natolls has meant that geography is a key reason for poverty and income\ndisparity in Maldives. In islands far from the capital, there tends to be lack\nof production, inadequate use of fishery resources, low value chain\ndevelopment and insufficient credit for small-scale producers and\nentrepreneurs. The scarcity of land and water, the underdeveloped farming\npractices and absence of support services in atolls has meant low production\nand thus low incomes in these regions."
  },
  {
    "chapter_name": "Economy of the Maldives",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Current Efforts",
    "text": "The government has recognized these issues of income and gender disparities\nand with the United Nations Development Programme (UNDP), Maldives has\nimplemented policies that directly address these issues. In 2011, President\nNasheed said, \"The most important facility for a country's development is its\npeople... and since women are half of the population in any country, for a\ncertainty their full participation will speed up the pace of development.\""
  }
]