[
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "GNI per capita:  \n\nSlovenia ($23,520)\n\nHigher GNI per capita compared to Slovenia\n\nLower GNI per capita compared to Slovenia\n\nThe economy of Slovenia is a developed mixed economy. The country maintains a\nhigh quality of life and economic stability as well as above-average GDP per\ncapita by purchasing power parity at 91% of the EU average in 2023. The\nnominal GDP in 2023 is 68.108 billion USD, nominal GDP per capita (GDP/pc) in\n2023 is USD 32,350. The highest GDP per capita is in central Slovenia, where\nthe capital city Ljubljana is located. It is part of the Western Slovenia\nstatistical region, which has a higher GDP per capita than eastern Slovenia.\n\nIn 2007, Slovenia became the first former Yugoslav republic to join the\nEuropean Union, adopting the euro currency within the Eurozone. It has also\nbeen a member of the Organisation for Economic Co-operation and Development\nsince 2010. Slovenia has a highly educated workforce, well-developed\ninfrastructure, and is situated at a major transport crossroads. Almost two-\nthirds of the working population is employed in services. The level of foreign\ndirect investment (FDI) is one of the lowest in Europe but has seen steady\ngains since the mid-2010s. The Slovenian economy was heavily impacted by the\nEuropean economic crisis of the late 2000s. In 2013, GDP per capita began\nrising again."
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Slovenia comprised approximately one-eleventh of Yugoslavia's total\npopulation, it was the most productive of the Yugoslav republics, accounting\nfor one-fifth of its GDP and one-third of its exports. Slovenia thus gained\nindependence in 1991 with an already relatively prosperous economy and strong\nmarket ties to the West.\n\nSince that time it has vigorously pursued diversification of its trade with\nthe West and integration into Western and transatlantic institutions. Slovenia\nis a founding member of the World Trade Organization, joined CEFTA in 1996,\nand joined the European Union on 1 May 2004. In June 2004 it joined the\nEuropean Exchange Rate Mechanism. The euro was introduced at the beginning of\n2007 and circulated alongside the tolar until 14 January 2007. Slovenia also\nparticipates in SECI (Southeast European Cooperation Initiative), as well as\nin the Central European Initiative, the Royaumont Process, and the Black Sea\nEconomic Council.\n\nDuring the Great Recession, the Slovenian economy suffered a severe setback.\nIn 2009 the Slovenian GDP per capita shrank by 7.9%. After a slow recovery\nfrom the 2009 recession, thanks to exports, the economy of Slovenia again slid\ninto recession in the last quarter of 2011. This has been attributed to the\nfall in domestic consumption and the slowdown in the growth of exports.\nSlovenia mainly exports to countries of the eurozone. The reasons for the\ndecrease in domestic consumption have been multiple: fiscal austerity, the\nfreeze in budget expenditure in the final months of 2011, a failure in the\nefforts to implement economic reforms, inappropriate financing, and the\ndecrease in exports. In addition, the construction industry was severely hit\nin 2010 and 2011. From 2014 onwards GDP of Slovenia is rising again. The main\nfactors of GDP growth are export and in the year 2016 also domestic\nconsumption, which started to revive after the economic crisis. The GDP growth\nin 2015 was 2.3%; in the first half of 2016 it was 2.5%, and in the 2nd\nquarter of 2016 it was 2.7%. This means that GDP growth accelerated in 2016.\n\nDuring the EU accession negotiations, Slovenia insisted on numerous\nderogations, refusing to open up certain key sectors of the economy to full\ncompetition. The country is the only one in Central and Eastern Europe to have\nretained control of its banking sector. The country has also preserved an\nimportant public service built during the socialist period: Slovenia still has\none of the best healthcare systems in the world, and education is free up to\nthe postgraduate level."
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Trade",
    "text": "Slovenia's trade is orientated towards other EU countries, mainly Germany and\nItaly. This is the result of a wholesale reorientation of trade toward the\nWest and the growing markets of central and eastern Europe in the face of the\ncollapse of its Yugoslav markets. Slovenia's economy is highly dependent on\nforeign trade. Trade equals about 120% of GDP (exports and imports\ncombined).[_clarification needed_] About two-thirds of Slovenia's trade is\nwith other EU members.\n\nThis high level of openness makes it extremely sensitive to economic\nconditions in its main trading partners and changes in its international price\ncompetitiveness. However, despite the economic slowdown in Europe in 2001–03,\nSlovenia maintained a 3% GDP growth. Keeping labour costs in line with\nproductivity is thus a key challenge for Slovenia's economic well-being, and\nSlovenian firms have responded by specializing in mid- to high-tech\nmanufacturing. Industry and construction comprise about one-quarter of the\nGDP. As in most industrial economies, services make up an increasing share of\noutput (57.1 percent), notably in financial services."
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "The agricultural output of Slovenia in 2018:\n\n* 350,000 metric tons (390,000 short tons) of maize;\n* 126,000 metric tons (139,000 short tons) of grapes;\n* 121,000 metric tons (133,000 short tons) of wheat;\n* 88,000 metric tons (97,000 short tons) of barley;\n* 86,000 metric tons (95,000 short tons) of apples;\n* 72,000 metric tons (79,000 short tons) of potatoes,\n\nin addition to smaller amounts of other agricultural products.\n\nNeonicotinoids are commonly used as they are throughout the world, including\nthe use of thiacloprid in the country's apple orchards. Smodiš Škerl et al\n(2009) found that thiacloprid/apple application practices leave a residue in\nthe pollen but not in bee bread."
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic performance",
    "text": "The historical primary industries of agriculture, forestry, and fishing\ncontribute a comparatively low 2.5 percent of GDP, and engage only 6 percent\nof the population. The average farm is only 5.5 hectares. Part of Slovenia\nlies in the Alpe-Adria bioregion, which is currently involved in a major\ninitiative in organic farming. Between 1998 and 2003, the organic sector grew\nfrom less than 0.1% of Slovenian agriculture to roughly the European Union\naverage of 3.3%.\n\nPublic finances have shown a deficit in recent years. This averaged around\n$650 million per annum between 1999 and 2007; however, this amounted to less\nthan 23 percent of GDP. There was a slight surplus in 2008 with revenues\ntotalling $23.16 billion and expenditures $22.93 billion. Government\nexpenditure equalled 38 percent of GDP.[_citation needed_] As of January\n2011[update], the total national debt of Slovenia was unknown. The Statistical\nOffice of the Republic of Slovenia (SURS) reported it to be (not counting\nstate-guaranteed loans) 19.5 billion euros or 54.2% of GDP at the end of\nSeptember 2010. According to the data provided by the Slovenian Ministry of\nFinance in January 2011, it was just below 15 billion euros or 41.6% of the\n2009 GDP. However, the Slovenian financial newspaper Finance calculated in\nJanuary 2011 that it was actually 22.4 billion euros or almost 63% of GDP,\nsurpassing the limit of 60% allowed by the European Union. On 12 January 2011,\nthe Slovenian Court of Audit rejected the data reported by the ministry as\nincorrect and demanded the dismissal of the finance minister Franc Križanič.\n\nSlovenia's traditional anti-inflation policy relied heavily on capital inflow\nrestrictions. Its privatization process favoured insider purchasers and\nprescribed a long lag time on share trading, complicated by a cultural\nwariness of being \"bought up\" by foreigners. As such, Slovenia has had a\nnumber of impediments to foreign participation in its economy. Slovenia has\ngarnered some notable foreign investments, including the investment of $125\nmillion by Goodyear in 1997. At the end of 2008, there was around $11.5\nbillion of foreign capital in Slovenia. Slovenians had invested $7.5 billion\nabroad. As of 31 December 2007, the value of shares listed on the Ljubljana\nStock Exchange was $29 billion.\n\nInvestments from neighboring Croatia have begun in Slovenia. On 1 July 2010,\nDroga Kolinska was purchased by the Atlantic Group of Croatia for 382 million\neuros. Mercator was sold to Croatia's Agrocor in June 2014.\n\nAt the end of the year 2014, there were 10 billion[_clarification needed_]\nforeign direct investment in Slovenia, 13.9% more than at the end of the year\n2013. In 2013 (latest published data) direct foreign investments accounted for\n24.7% of the GDP of Slovenia. The most important investor countries are\nAustria (33.6%), Switzerland (11.3%), Germany (10.4%), Italy (7.9%), and\nCroatia (7.7%)."
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators from 1993–2019.\n\nYear  | GDP (in bil. US$ PPP)  | GDP (in bil. EUR PPP)  | GDP per capita (in EUR PPP)  | GDP (in bil. US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Unemployment rate  | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1993  | 23.5  | 7.8  | 3,908  | 16.6  | 2.8 %  | 31.9 %  | 8.6 %  | ...\n1995  | 26.9  | 10.6  | 8,311  | 21.4  | 4.1 %  | 13.7 %  | 7.0 %  | 18.2 %\n2000  | 35.8  | 18.9  | 11,076  | 20.4  | 3.7 %  | 8.9 %  | 6.7 %  | 25.9 %\n2005  | 47.8  | 29.1  | 14,551  | 36.3  | 3.8 %  | 2.5 %  | 6.5 %  | 26.4 %\n2006  | 52.2  | 31.5  | 15,676  | 39.5  | 5.7 %  | 2.5 %  | 6.0 %  | 26.1 %\n2007  | 57.3  | 35.1  | 17,373  | 48.1  | 7.0 %  | 3.7 %  | 4.9 %  | 22.8 %\n2008  | 60.5  | 37.9  | 18,757  | 55.8  | 3.5 %  | 5.7 %  | 4.4 %  | 21.8 %\n2009  | 56.2  | 36.3  | 17,758  | 50.5  | −7.5 %  | 0.8 %  | 5.1 %  | 34.5 %\n2010  | 57.7  | 36.4  | 17,749  | 48.2  | 1.3 %  | 1.8 %  | 5.4 %  | 38.3 %\n2011  | 59.4  | 37.1  | 18,052  | 51.6  | 0.9 %  | 1.8 %  | 7.1 %  | 46.5 %\n2012  | 59.7  | 36.3  | 17,626  | 46.6  | −2.6 %  | 2.6 %  | 8.5 %  | 53.6 %\n2013  | 61.7  | 36.5  | 17,700  | 48.4  | −1.0 %  | 1.8 %  | 11.1 %  | 70 %\n2014  | 63.7  | 37.6  | 18,253  | 50.0  | 2.8 %  | 0.2 %  | 10.8 %  | 80.3 %\n2015  | 65.3  | 38.9  | 18,830  | 43.1  | 2.2 %  | −0.5 %  | 9.8 %  | 82.6 %\n2016  | 70.1  | 40.4  | 19,589  | 44.8  | 3.2 %  | −0.1 %  | 8.9 %  | 78.5 %\n2017  | 75.8  | 43.0  | 20,820  | 48.6  | 4.8 %  | 1.4 %  | 7.8 %  | 74.1 %\n2018  | 81.1  | 45.9  | 22,136  | 54.2  | 4.4 %  | 1.7 %  | 5.9 %  | 70.3 %\n2019  | 85.4  | 48.4  | 23,167  | 54.4  | 3.3 %  | 1.6 %  | 4.8 %  | 65.6 %"
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nSlovenia is services with 60,260 companies followed by wholesale trade and\nconstruction with 9,980 and 9,010 companies respectively."
  }
]