[
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "GNI per capita:  \n\nSlovenia ($23,520)\n\nHigher GNI per capita compared to Slovenia\n\nLower GNI per capita compared to Slovenia\n\nThe economy of Slovenia is a developed mixed economy. The country maintains a\nhigh quality of life and economic stability as well as above-average GDP per\ncapita by purchasing power parity at 91% of the EU average in 2023. The\nnominal GDP in 2023 is 68.108 billion USD, nominal GDP per capita (GDP/pc) in\n2023 is USD 32,350. The highest GDP per capita is in central Slovenia, where\nthe capital city Ljubljana is located. It is part of the Western Slovenia\nstatistical region, which has a higher GDP per capita than eastern Slovenia.\n\nIn 2007, Slovenia became the first former Yugoslav republic to join the\nEuropean Union, adopting the euro currency within the Eurozone. It has also\nbeen a member of the Organisation for Economic Co-operation and Development\nsince 2010. Slovenia has a highly educated workforce, well-developed\ninfrastructure, and is situated at a major transport crossroads. Almost two-\nthirds of the working population is employed in services. The level of foreign\ndirect investment (FDI) is one of the lowest in Europe but has seen steady\ngains since the mid-2010s. The Slovenian economy was heavily impacted by the\nEuropean economic crisis of the late 2000s. In 2013, GDP per capita began\nrising again.",
    "openai_summarised_points": [
      "• Slovenia has a Gross National Income (GNI) per capita of $23,520.",
      "• The economy of Slovenia is classified as a developed mixed economy characterized by a high quality of life and economic stability.",
      "• In 2023, Slovenia's GDP per capita by purchasing power parity (PPP) is 91% of the European Union (EU) average, indicating an above-average economic performance within the EU.",
      "• The nominal Gross Domestic Product (GDP) of Slovenia in 2023 is 68.108 billion USD.",
      "• The nominal GDP per capita in Slovenia for 2023 is 32,350 USD.",
      "• The highest GDP per capita within Slovenia is recorded in central Slovenia, which includes the capital city Ljubljana.",
      "• Central Slovenia is part of the Western Slovenia statistical region, which exhibits a higher GDP per capita compared to the eastern part of the country.",
      "• Slovenia became the first former Yugoslav republic to join the European Union in 2007.",
      "• Upon joining the EU, Slovenia adopted the euro as its official currency and became a member of the Eurozone.",
      "• Slovenia has been a member of the Organisation for Economic Co-operation and Development (OECD) since 2010.",
      "• The country benefits from a highly educated workforce and well-developed infrastructure.",
      "• Slovenia is strategically located at a major transport crossroads, enhancing its economic connectivity.",
      "• Approximately two-thirds of Slovenia’s working population is employed in the services sector.",
      "• Despite having one of the lowest levels of foreign direct investment (FDI) in Europe, Slovenia has experienced steady increases in FDI since the mid-2010s.",
      "• The Slovenian economy was significantly affected by the European economic crisis of the late 2000s.",
      "• Starting in 2013, Slovenia’s GDP per capita began to rise again, marking a recovery from the economic downturn."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:31.987891",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1348,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Slovenia comprised approximately one-eleventh of Yugoslavia's total\npopulation, it was the most productive of the Yugoslav republics, accounting\nfor one-fifth of its GDP and one-third of its exports. Slovenia thus gained\nindependence in 1991 with an already relatively prosperous economy and strong\nmarket ties to the West.\n\nSince that time it has vigorously pursued diversification of its trade with\nthe West and integration into Western and transatlantic institutions. Slovenia\nis a founding member of the World Trade Organization, joined CEFTA in 1996,\nand joined the European Union on 1 May 2004. In June 2004 it joined the\nEuropean Exchange Rate Mechanism. The euro was introduced at the beginning of\n2007 and circulated alongside the tolar until 14 January 2007. Slovenia also\nparticipates in SECI (Southeast European Cooperation Initiative), as well as\nin the Central European Initiative, the Royaumont Process, and the Black Sea\nEconomic Council.\n\nDuring the Great Recession, the Slovenian economy suffered a severe setback.\nIn 2009 the Slovenian GDP per capita shrank by 7.9%. After a slow recovery\nfrom the 2009 recession, thanks to exports, the economy of Slovenia again slid\ninto recession in the last quarter of 2011. This has been attributed to the\nfall in domestic consumption and the slowdown in the growth of exports.\nSlovenia mainly exports to countries of the eurozone. The reasons for the\ndecrease in domestic consumption have been multiple: fiscal austerity, the\nfreeze in budget expenditure in the final months of 2011, a failure in the\nefforts to implement economic reforms, inappropriate financing, and the\ndecrease in exports. In addition, the construction industry was severely hit\nin 2010 and 2011. From 2014 onwards GDP of Slovenia is rising again. The main\nfactors of GDP growth are export and in the year 2016 also domestic\nconsumption, which started to revive after the economic crisis. The GDP growth\nin 2015 was 2.3%; in the first half of 2016 it was 2.5%, and in the 2nd\nquarter of 2016 it was 2.7%. This means that GDP growth accelerated in 2016.\n\nDuring the EU accession negotiations, Slovenia insisted on numerous\nderogations, refusing to open up certain key sectors of the economy to full\ncompetition. The country is the only one in Central and Eastern Europe to have\nretained control of its banking sector. The country has also preserved an\nimportant public service built during the socialist period: Slovenia still has\none of the best healthcare systems in the world, and education is free up to\nthe postgraduate level.",
    "openai_summarised_points": [
      "• Slovenia comprised approximately one-eleventh of Yugoslavia's total population but was the most productive Yugoslav republic, contributing one-fifth of Yugoslavia's GDP and one-third of its exports.",
      "• Upon gaining independence in 1991, Slovenia inherited a relatively prosperous economy with strong market ties to Western countries.",
      "• Since independence, Slovenia has actively pursued diversification of trade with Western countries and integration into Western and transatlantic institutions.",
      "• Slovenia is a founding member of the World Trade Organization (WTO) and joined the Central European Free Trade Agreement (CEFTA) in 1996.",
      "• Slovenia became a member of the European Union (EU) on 1 May 2004.",
      "• In June 2004, Slovenia joined the European Exchange Rate Mechanism (ERM II), a precursor to adopting the euro.",
      "• The euro was introduced in Slovenia at the beginning of 2007 and circulated alongside the Slovenian tolar until 14 January 2007, when the tolar was fully replaced.",
      "• Slovenia participates in several regional cooperation initiatives, including the Southeast European Cooperation Initiative (SECI), the Central European Initiative, the Royaumont Process, and the Black Sea Economic Council.",
      "• The Slovenian economy experienced a severe setback during the Great Recession, with GDP per capita shrinking by 7.9% in 2009.",
      "• After a slow recovery driven by exports, Slovenia's economy slipped back into recession in the last quarter of 2011 due to a decline in domestic consumption and a slowdown in export growth.",
      "• The primary export markets for Slovenia are countries within the eurozone.",
      "• The decrease in domestic consumption during the 2011 recession was caused by multiple factors: fiscal austerity measures, a freeze in budget expenditure in late 2011, failure to implement economic reforms, inappropriate financing, and reduced exports.",
      "• The construction industry in Slovenia was severely affected during 2010 and 2011.",
      "• From 2014 onwards, Slovenia's GDP began to rise again, with exports as the main growth driver and domestic consumption contributing to growth starting in 2016.",
      "• Slovenia's GDP growth rates were 2.3% in 2015, 2.5% in the first half of 2016, and 2.7% in the second quarter of 2016, indicating an acceleration of economic growth in 2016.",
      "• During EU accession negotiations, Slovenia insisted on numerous derogations, refusing to fully open certain key economic sectors to competition.",
      "• Slovenia is unique among Central and Eastern European countries in retaining control of its banking sector.",
      "• The country has preserved significant public services established during the socialist period, including one of the world's best healthcare systems and free education up to the postgraduate level."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:34.750497",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2559,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Trade",
    "text": "Slovenia's trade is orientated towards other EU countries, mainly Germany and\nItaly. This is the result of a wholesale reorientation of trade toward the\nWest and the growing markets of central and eastern Europe in the face of the\ncollapse of its Yugoslav markets. Slovenia's economy is highly dependent on\nforeign trade. Trade equals about 120% of GDP (exports and imports\ncombined).[_clarification needed_] About two-thirds of Slovenia's trade is\nwith other EU members.\n\nThis high level of openness makes it extremely sensitive to economic\nconditions in its main trading partners and changes in its international price\ncompetitiveness. However, despite the economic slowdown in Europe in 2001–03,\nSlovenia maintained a 3% GDP growth. Keeping labour costs in line with\nproductivity is thus a key challenge for Slovenia's economic well-being, and\nSlovenian firms have responded by specializing in mid- to high-tech\nmanufacturing. Industry and construction comprise about one-quarter of the\nGDP. As in most industrial economies, services make up an increasing share of\noutput (57.1 percent), notably in financial services.",
    "openai_summarised_points": [
      "• Slovenia's trade is primarily oriented towards other European Union (EU) countries, with Germany and Italy being the main trading partners.",
      "• This trade orientation results from a wholesale reorientation of Slovenia's trade towards Western Europe and the growing markets of Central and Eastern Europe, following the collapse of its traditional Yugoslav markets.",
      "• The Slovenian economy is highly dependent on foreign trade, with the total trade volume (exports plus imports) equating to approximately 120% of the country's Gross Domestic Product (GDP).",
      "• Approximately two-thirds of Slovenia's trade is conducted with other EU member states, highlighting the country's integration within the European single market.",
      "• Slovenia's high level of trade openness makes its economy extremely sensitive to economic conditions in its primary trading partners and to fluctuations in its international price competitiveness.",
      "• Despite the economic slowdown experienced in Europe between 2001 and 2003, Slovenia sustained a GDP growth rate of 3%, demonstrating relative economic resilience during that period.",
      "• A critical challenge for Slovenia's economic well-being is maintaining labor costs in line with productivity to preserve competitiveness in international markets.",
      "• Slovenian firms have adapted to this challenge by specializing in mid- to high-technology manufacturing sectors, enhancing the value-added component of their exports.",
      "• The industrial and construction sectors together account for about one-quarter (approximately 25%) of Slovenia's GDP, indicating a significant role of these sectors in the national economy.",
      "• Services constitute an increasing share of Slovenia's economic output, representing 57.1% of GDP, with financial services being notably prominent within this sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:34.243155",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1121,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "The agricultural output of Slovenia in 2018:\n\n* 350,000 metric tons (390,000 short tons) of maize;\n* 126,000 metric tons (139,000 short tons) of grapes;\n* 121,000 metric tons (133,000 short tons) of wheat;\n* 88,000 metric tons (97,000 short tons) of barley;\n* 86,000 metric tons (95,000 short tons) of apples;\n* 72,000 metric tons (79,000 short tons) of potatoes,\n\nin addition to smaller amounts of other agricultural products.\n\nNeonicotinoids are commonly used as they are throughout the world, including\nthe use of thiacloprid in the country's apple orchards. Smodiš Škerl et al\n(2009) found that thiacloprid/apple application practices leave a residue in\nthe pollen but not in bee bread.",
    "openai_summarised_points": [
      "• In 2018, Slovenia produced 350,000 metric tons (390,000 short tons) of maize, marking it as the country's leading agricultural output by quantity.",
      "• The grape harvest in Slovenia in 2018 amounted to 126,000 metric tons (139,000 short tons), reflecting the significance of viticulture in the national agricultural sector.",
      "• Wheat production in Slovenia during 2018 reached 121,000 metric tons (133,000 short tons), indicating its role as a staple cereal crop within the country.",
      "• Barley output in Slovenia for the year 2018 was recorded at 88,000 metric tons (97,000 short tons), contributing to the cereal crop portfolio of the nation.",
      "• Apple production in Slovenia in 2018 totaled 86,000 metric tons (95,000 short tons), underscoring the importance of fruit cultivation in the agricultural economy.",
      "• Potato cultivation yielded 72,000 metric tons (79,000 short tons) in Slovenia in 2018, highlighting its role as a key root crop in the country.",
      "• Besides these major crops, Slovenia also produced smaller quantities of various other agricultural products in 2018, indicating a diverse agricultural output.",
      "• Neonicotinoid pesticides are widely used in Slovenian agriculture, consistent with global practices, including the application of thiacloprid specifically in apple orchards.",
      "• A study by Smodiš Škerl et al. (2009) investigated the impact of thiacloprid use in Slovenian apple orchards and found that this pesticide application leaves residues in pollen but not in bee bread, suggesting selective residue presence in bee-related products."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:32.397670",
      "openai_model": "gpt-4.1-mini",
      "content_length": 690,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic performance",
    "text": "The historical primary industries of agriculture, forestry, and fishing\ncontribute a comparatively low 2.5 percent of GDP, and engage only 6 percent\nof the population. The average farm is only 5.5 hectares. Part of Slovenia\nlies in the Alpe-Adria bioregion, which is currently involved in a major\ninitiative in organic farming. Between 1998 and 2003, the organic sector grew\nfrom less than 0.1% of Slovenian agriculture to roughly the European Union\naverage of 3.3%.\n\nPublic finances have shown a deficit in recent years. This averaged around\n$650 million per annum between 1999 and 2007; however, this amounted to less\nthan 23 percent of GDP. There was a slight surplus in 2008 with revenues\ntotalling $23.16 billion and expenditures $22.93 billion. Government\nexpenditure equalled 38 percent of GDP.[_citation needed_] As of January\n2011[update], the total national debt of Slovenia was unknown. The Statistical\nOffice of the Republic of Slovenia (SURS) reported it to be (not counting\nstate-guaranteed loans) 19.5 billion euros or 54.2% of GDP at the end of\nSeptember 2010. According to the data provided by the Slovenian Ministry of\nFinance in January 2011, it was just below 15 billion euros or 41.6% of the\n2009 GDP. However, the Slovenian financial newspaper Finance calculated in\nJanuary 2011 that it was actually 22.4 billion euros or almost 63% of GDP,\nsurpassing the limit of 60% allowed by the European Union. On 12 January 2011,\nthe Slovenian Court of Audit rejected the data reported by the ministry as\nincorrect and demanded the dismissal of the finance minister Franc Križanič.\n\nSlovenia's traditional anti-inflation policy relied heavily on capital inflow\nrestrictions. Its privatization process favoured insider purchasers and\nprescribed a long lag time on share trading, complicated by a cultural\nwariness of being \"bought up\" by foreigners. As such, Slovenia has had a\nnumber of impediments to foreign participation in its economy. Slovenia has\ngarnered some notable foreign investments, including the investment of $125\nmillion by Goodyear in 1997. At the end of 2008, there was around $11.5\nbillion of foreign capital in Slovenia. Slovenians had invested $7.5 billion\nabroad. As of 31 December 2007, the value of shares listed on the Ljubljana\nStock Exchange was $29 billion.\n\nInvestments from neighboring Croatia have begun in Slovenia. On 1 July 2010,\nDroga Kolinska was purchased by the Atlantic Group of Croatia for 382 million\neuros. Mercator was sold to Croatia's Agrocor in June 2014.\n\nAt the end of the year 2014, there were 10 billion[_clarification needed_]\nforeign direct investment in Slovenia, 13.9% more than at the end of the year\n2013. In 2013 (latest published data) direct foreign investments accounted for\n24.7% of the GDP of Slovenia. The most important investor countries are\nAustria (33.6%), Switzerland (11.3%), Germany (10.4%), Italy (7.9%), and\nCroatia (7.7%).",
    "openai_summarised_points": [
      "• The historical primary industries of agriculture, forestry, and fishing in Slovenia contribute a comparatively low 2.5 percent of GDP and engage only 6 percent of the population.",
      "• The average farm size in Slovenia is only 5.5 hectares.",
      "• Part of Slovenia lies within the Alpe-Adria bioregion, which is currently involved in a major initiative promoting organic farming.",
      "• Between 1998 and 2003, Slovenia’s organic agriculture sector grew from less than 0.1% to approximately the European Union average of 3.3%.",
      "• Public finances in Slovenia showed a deficit averaging around $650 million per annum between 1999 and 2007, amounting to less than 23 percent of GDP during that period.",
      "• In 2008, Slovenia experienced a slight budget surplus, with government revenues totaling $23.16 billion and expenditures at $22.93 billion.",
      "• Government expenditure in 2008 equaled 38 percent of GDP.",
      "• As of January 2011, the total national debt of Slovenia was uncertain, with conflicting reports from different sources.",
      "• The Statistical Office of the Republic of Slovenia (SURS) reported the national debt (excluding state-guaranteed loans) as 19.5 billion euros or 54.2% of GDP at the end of September 2010.",
      "• The Slovenian Ministry of Finance, in January 2011, reported the national debt as just below 15 billion euros or 41.6% of the 2009 GDP.",
      "• The Slovenian financial newspaper Finance calculated in January 2011 that the national debt was actually 22.4 billion euros or almost 63% of GDP, exceeding the European Union’s 60% debt limit.",
      "• On 12 January 2011, the Slovenian Court of Audit rejected the Ministry of Finance’s reported data as incorrect and demanded the dismissal of Finance Minister Franc Križanič.",
      "• Slovenia’s traditional anti-inflation policy relied heavily on capital inflow restrictions.",
      "• The privatization process in Slovenia favored insider purchasers and imposed a long lag time on share trading, complicated by a cultural wariness of foreign takeovers.",
      "• These factors created several impediments to foreign participation in Slovenia’s economy.",
      "• Despite these barriers, Slovenia attracted notable foreign investments, including a $125 million investment by Goodyear in 1997.",
      "• At the end of 2008, foreign capital invested in Slovenia amounted to approximately $11.5 billion.",
      "• Slovenians had invested $7.5 billion abroad by the same time.",
      "• As of 31 December 2007, the value of shares listed on the Ljubljana Stock Exchange was $29 billion.",
      "• Investments from neighboring Croatia into Slovenia have begun, exemplified by the purchase of Droga Kolinska by Croatia’s Atlantic Group for 382 million euros on 1 July 2010.",
      "• In June 2014, the Slovenian company Mercator was sold to Croatia’s Agrocor.",
      "• At the end of 2014, foreign direct investment (FDI) in Slovenia totaled 10 billion euros, representing a 13.9% increase compared to the end of 2013.",
      "• In 2013, the latest published data, direct foreign investments accounted for 24.7% of Slovenia’s GDP.",
      "• The most important investor countries in Slovenia are Austria (33.6%), Switzerland (11.3%), Germany (10.4%), Italy (7.9%), and Croatia (7.7%)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:38.746562",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2907,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators from 1993–2019.\n\nYear  | GDP (in bil. US$ PPP)  | GDP (in bil. EUR PPP)  | GDP per capita (in EUR PPP)  | GDP (in bil. US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Unemployment rate  | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1993  | 23.5  | 7.8  | 3,908  | 16.6  | 2.8 %  | 31.9 %  | 8.6 %  | ...\n1995  | 26.9  | 10.6  | 8,311  | 21.4  | 4.1 %  | 13.7 %  | 7.0 %  | 18.2 %\n2000  | 35.8  | 18.9  | 11,076  | 20.4  | 3.7 %  | 8.9 %  | 6.7 %  | 25.9 %\n2005  | 47.8  | 29.1  | 14,551  | 36.3  | 3.8 %  | 2.5 %  | 6.5 %  | 26.4 %\n2006  | 52.2  | 31.5  | 15,676  | 39.5  | 5.7 %  | 2.5 %  | 6.0 %  | 26.1 %\n2007  | 57.3  | 35.1  | 17,373  | 48.1  | 7.0 %  | 3.7 %  | 4.9 %  | 22.8 %\n2008  | 60.5  | 37.9  | 18,757  | 55.8  | 3.5 %  | 5.7 %  | 4.4 %  | 21.8 %\n2009  | 56.2  | 36.3  | 17,758  | 50.5  | −7.5 %  | 0.8 %  | 5.1 %  | 34.5 %\n2010  | 57.7  | 36.4  | 17,749  | 48.2  | 1.3 %  | 1.8 %  | 5.4 %  | 38.3 %\n2011  | 59.4  | 37.1  | 18,052  | 51.6  | 0.9 %  | 1.8 %  | 7.1 %  | 46.5 %\n2012  | 59.7  | 36.3  | 17,626  | 46.6  | −2.6 %  | 2.6 %  | 8.5 %  | 53.6 %\n2013  | 61.7  | 36.5  | 17,700  | 48.4  | −1.0 %  | 1.8 %  | 11.1 %  | 70 %\n2014  | 63.7  | 37.6  | 18,253  | 50.0  | 2.8 %  | 0.2 %  | 10.8 %  | 80.3 %\n2015  | 65.3  | 38.9  | 18,830  | 43.1  | 2.2 %  | −0.5 %  | 9.8 %  | 82.6 %\n2016  | 70.1  | 40.4  | 19,589  | 44.8  | 3.2 %  | −0.1 %  | 8.9 %  | 78.5 %\n2017  | 75.8  | 43.0  | 20,820  | 48.6  | 4.8 %  | 1.4 %  | 7.8 %  | 74.1 %\n2018  | 81.1  | 45.9  | 22,136  | 54.2  | 4.4 %  | 1.7 %  | 5.9 %  | 70.3 %\n2019  | 85.4  | 48.4  | 23,167  | 54.4  | 3.3 %  | 1.6 %  | 4.8 %  | 65.6 %",
    "openai_summarised_points": [
      "• In 1993, Slovenia's GDP measured in billion US$ PPP was 23.5, with GDP in billion EUR PPP at 7.8, and GDP per capita in EUR PPP at 3,908; nominal GDP was 16.6 billion US$, real GDP growth was 2.8%, inflation was notably high at 31.9%, unemployment rate stood at 8.6%, and government debt data was not available.",
      "• By 1995, GDP increased to 26.9 billion US$ PPP and 10.6 billion EUR PPP, with GDP per capita rising significantly to 8,311 EUR PPP; nominal GDP was 21.4 billion US$, real GDP growth was 4.1%, inflation decreased to 13.7%, unemployment rate dropped to 7.0%, and government debt was recorded at 18.2% of GDP.",
      "• In the year 2000, Slovenia's GDP reached 35.8 billion US$ PPP and 18.9 billion EUR PPP, with GDP per capita at 11,076 EUR PPP; nominal GDP was 20.4 billion US$, real GDP growth was 3.7%, inflation further declined to 8.9%, unemployment rate slightly decreased to 6.7%, and government debt rose to 25.9% of GDP.",
      "• The 2005 data shows GDP at 47.8 billion US$ PPP and 29.1 billion EUR PPP, with GDP per capita at 14,551 EUR PPP; nominal GDP was 36.3 billion US$, real GDP growth was 3.8%, inflation was low at 2.5%, unemployment rate was 6.5%, and government debt was 26.4% of GDP.",
      "• In 2006, GDP increased to 52.2 billion US$ PPP and 31.5 billion EUR PPP, with GDP per capita at 15,676 EUR PPP; nominal GDP was 39.5 billion US$, real GDP growth rose sharply to 5.7%, inflation remained steady at 2.5%, unemployment rate decreased to 6.0%, and government debt slightly decreased to 26.1% of GDP.",
      "• For 2007, GDP reached 57.3 billion US$ PPP and 35.1 billion EUR PPP, with GDP per capita at 17,373 EUR PPP; nominal GDP was 48.1 billion US$, real GDP growth peaked at 7.0%, inflation increased to 3.7%, unemployment rate fell to 4.9%, and government debt declined to 22.8% of GDP.",
      "• In 2008, GDP was 60.5 billion US$ PPP and 37.9 billion EUR PPP, with GDP per capita at 18,757 EUR PPP; nominal GDP was 55.8 billion US$, real GDP growth slowed to 3.5%, inflation rose to 5.7%, unemployment rate was 4.4%, and government debt further decreased to 21.8% of GDP.",
      "• The 2009 figures indicate a GDP contraction to 56.2 billion US$ PPP and 36.3 billion EUR PPP, with GDP per capita at 17,758 EUR PPP; nominal GDP was 50.5 billion US$, real GDP growth sharply declined by −7.5%, inflation dropped to 0.8%, unemployment rate slightly increased to 5.1%, and government debt surged to 34.5% of GDP.",
      "• In 2010, GDP slightly recovered to 57.7 billion US$ PPP and 36.4 billion EUR PPP, with GDP per capita at 17,749 EUR PPP; nominal GDP was 48.2 billion US$, real GDP growth was modest at 1.3%, inflation was 1.8%, unemployment rate rose to 5.4%, and government debt increased to 38.3% of GDP.",
      "• The year 2011 saw GDP at 59.4 billion US$ PPP and 37.1 billion EUR PPP, with GDP per capita at 18,052 EUR PPP; nominal GDP was 51.6 billion US$, real GDP growth was 0.9%, inflation remained at 1.8%, unemployment rate increased to 7.1%, and government debt rose significantly to 46.5% of GDP.",
      "• In 2012, GDP was 59.7 billion US$ PPP and 36.3 billion EUR PPP, with GDP per capita at 17,626 EUR PPP; nominal GDP declined to 46.6 billion US$, real GDP growth contracted by −2.6%, inflation increased to 2.6%, unemployment rate rose to 8.5%, and government debt escalated to 53.6% of GDP.",
      "• The 2013 data shows GDP at 61.7 billion US$ PPP and 36.5 billion EUR PPP, with GDP per capita at 17,700 EUR PPP; nominal GDP was 48.4 billion US$, real GDP growth was negative at −1.0%, inflation was 1.8%, unemployment rate sharply increased to 11.1%, and government debt reached 70% of GDP.",
      "• In 2014, GDP increased to 63.7 billion US$ PPP and 37.6 billion EUR PPP, with GDP per capita at 18,253 EUR PPP; nominal GDP was 50.0 billion US$, real GDP growth rebounded to 2.8%, inflation was very low at 0.2%, unemployment rate slightly decreased to 10.8%, and government debt rose to 80.3% of GDP.",
      "• The year 2015 recorded GDP at 65.3 billion US$ PPP and 38.9 billion EUR PPP, with GDP per capita at 18,830 EUR PPP; nominal GDP dropped to 43.1 billion US$, real GDP growth was 2.2%, inflation was negative at −0.5%, unemployment rate decreased to 9.8%, and government debt increased to 82.6% of GDP.",
      "• In 2016, GDP rose to 70.1 billion US$ PPP and 40.4 billion EUR PPP, with GDP per capita at 19,589 EUR PPP; nominal GDP was 44.8 billion US$, real GDP growth improved to 3.2%, inflation was slightly negative at −0.1%, unemployment rate declined to 8.9%, and government debt decreased to 78.5% of GDP.",
      "• The 2017 figures show GDP at 75.8 billion US$ PPP and 43.0 billion EUR PPP, with GDP per capita at 20,820 EUR PPP; nominal GDP was 48.6 billion US$, real GDP growth accelerated to 4.8%, inflation rose to 1.4%, unemployment rate fell to 7.8%, and government debt further decreased to 74.1% of GDP.",
      "• In 2018, GDP reached 81.1 billion US$ PPP and 45.9 billion EUR PPP, with GDP per capita at 22,136 EUR PPP; nominal GDP was 54.2 billion US$, real GDP growth was 4.4%, inflation increased to 1.7%, unemployment rate dropped significantly to 5.9%, and government debt declined to 70.3% of GDP.",
      "• By 2019, Slovenia's GDP was 85.4 billion US$ PPP and 48.4 billion EUR PPP, with GDP per capita at 23,167 EUR PPP; nominal GDP was 54.4 billion US$, real GDP growth slowed to 3.3%, inflation was 1.6%, unemployment rate further decreased to 4.8%, and government debt reduced to 65.6% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:52.235967",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1692,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Slovenia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nSlovenia is services with 60,260 companies followed by wholesale trade and\nconstruction with 9,980 and 9,010 companies respectively.",
    "openai_summarised_points": [
      "• In 2022, the services sector registered the highest number of companies in Slovenia, totaling 60,260 enterprises.",
      "• The wholesale trade sector was the second largest in terms of company registrations in Slovenia in 2022, with 9,980 companies.",
      "• The construction sector ranked third in Slovenia for the number of registered companies in 2022, with a total of 9,010 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:59:34.848715",
      "openai_model": "gpt-4.1-mini",
      "content_length": 203,
      "bullet_points_count": 3
    }
  }
]