[
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Bosnia and Herzegovina** is a developing, upper-middle income\neconomy. Bosnia and Herzegovina declared independence from socialist\nYugoslavia on 1 March 1992. The main trading partners are Germany, Italy,\nAustria, Turkey and neighboring countries in Southeast Europe.",
    "openai_summarised_points": [
      "• The economy of Bosnia and Herzegovina is classified as a developing, upper-middle income economy, indicating a moderate level of income and economic development.",
      "• Bosnia and Herzegovina declared independence from socialist Yugoslavia on 1 March 1992, marking a significant political and economic transition.",
      "• The country's primary trading partners include Germany, Italy, Austria, Turkey, and neighboring countries in Southeast Europe, highlighting regional and international economic integration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:02.622479",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 284,
      "bullet_points_count": 3
    },
    "generated_detailed_content": "The economy of Bosnia and Herzegovina is classified as a developing, upper-middle income economy, reflecting a moderate level of income and economic development relative to global standards. This classification indicates that while the country has made significant progress in improving living standards and expanding economic activities, it still faces challenges typical of developing economies, such as structural reforms, unemployment, and regional disparities. The upper-middle income status is based on gross national income (GNI) per capita thresholds established by international financial institutions, which place Bosnia and Herzegovina above lower-middle income countries but below high-income economies. This economic categorization underscores the transitional nature of Bosnia and Herzegovina’s economy as it continues to evolve from its socialist past toward a more market-oriented system. Bosnia and Herzegovina declared independence from the Socialist Federal Republic of Yugoslavia on 1 March 1992, a pivotal moment that marked a profound political and economic transition for the country. The declaration of independence came amid the disintegration of Yugoslavia, which had been a multi-ethnic federation under socialist rule since the end of World War II. This transition was accompanied by significant upheaval, including the outbreak of the Bosnian War from 1992 to 1995, which severely disrupted economic activities and infrastructure. The post-war period required extensive reconstruction and reform efforts to stabilize the economy, establish new institutions, and integrate into international markets. The shift from a centrally planned socialist economy to a market-based system involved privatization of state-owned enterprises, development of a private sector, and establishment of legal frameworks conducive to foreign investment and trade. Bosnia and Herzegovina’s primary trading partners include Germany, Italy, Austria, Turkey, and neighboring countries in Southeast Europe, illustrating the country’s integration into both regional and international economic networks. Trade with Germany, Italy, and Austria reflects strong economic ties with key European Union members, which serve as major destinations for Bosnian exports and sources of imports. These relationships are facilitated by geographic proximity, historical connections, and the presence of Bosnian diaspora communities in these countries, which also contribute to remittances and investment flows. Turkey represents an important partner due to historical, cultural, and economic links, as well as growing bilateral trade and investment. Additionally, trade with neighboring countries in Southeast Europe, such as Croatia, Serbia, and Montenegro, highlights Bosnia and Herzegovina’s role within the regional economic framework, which is characterized by efforts to promote economic cooperation and integration through initiatives like the Central European Free Trade Agreement (CEFTA). This network of trading relationships supports Bosnia and Herzegovina’s export-driven sectors, including manufacturing, metal processing, textiles, and agriculture, and is crucial for sustaining economic growth and development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:34.983306",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 3,
      "generated_content_length": 3212,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Bosnia and Herzegovina is an upper middle-income country which has\naccomplished a great deal since the mid-1990s. It is an EU candidate country\nand is embarking on a new growth model after a period of slow growth and the\n2008 financial crisis. Bosnia and Herzegovina is a small, open economy,\ndominated by services, which accounted for 55% of gross domestic product (GDP)\nin 2016, with a moderately developed industrial and manufacturing sector (23%\nand 12%, respectively), and a limited agricultural base (about 6% of GDP).\n\nThe konvertibilna marka (convertible mark or BAM) - the national currency\nintroduced in 1998 - is pegged to the euro, and confidence in the currency and\nthe banking sector has increased. Implementation of privatization, however,\nhas been slow, and local entities only reluctantly support national-level\ninstitutions. Banking reform accelerated in 2001 as all ; foreign banks,\nprimarily from Western Europe, now control most of the banking sector. A\nsizable current account deficit and a very high unemployment rate remain the\ntwo most serious economic problems. The country receives substantial amounts\nof reconstruction assistance and humanitarian aid from the international\ncommunity but will have to prepare for an era of declining assistance.\n\nThe United States Embassy in Sarajevo, Bosnia and Herzegovina produces the\nCountry Commercial Guide – an annual report that delivers a comprehensive look\nat Bosnia and Herzegovina's commercial and economic environment, using\neconomic, political, and market analysis.\n\nAccording to Serbian American economist, Branko Milanović, Bosnia and\nHerzegovina did the best job in the transition from socialism to capitalism\nwhen compared to the other republics of the former Yugoslavia. From 1985 until\n2021, Bosnia and Herzegovina performed the best on the annual average GDP\ngrowth per capita (1.6%), Slovenia (1.4%), Croatia (1%), Serbia without Kosovo\n(0.9%) and North Macedonia (0.5%).\n\nAt the time of the Socialist Federal Republic of Yugoslavia (SFRY), Bosnia and\nHerzegovina was an important mineral processing centre and provided the other\nrepublics with basic mineral commodities in exchange for current consumption\ngoods. While large amounts of public capital investments poured in during the\n1970s, productivity levels remained low, often due to the limited capacity of\npublic managers. Under former republican premier Džemal Bijedić, and Yugoslav\npresident Tito, metal-product industries were promoted in the republic,\nresulting in the development of a large share of Yugoslavia's metal products\nplants.\n\nMerging small firms into larger agglomerates was a common practice in the SFRY\nto preserve employment levels. As a result, four large conglomerates emerged\nin Bosnia and Herzegovina over time: Energoinvest (energy sector), Unis\n(automotive and defence industry, which partnered with Volkswagen in the early\n1970s), Šipad (wood processing) and RMK Zenica (steel industry, later acquired\nby ArcelorMittal). Construction and defence were important industries in the\nBosnian economy, despite their low efficiency and, ultimately, excess supply.\nThe defence industry was particularly developed in the southern districts and\naround Mostar, which was also a relevant metallurgical centre (Aluminij\nMostar). Machinery production was concentrated in the north, particularly\naround Banja Luka. The Tuzla district was renowned for its chemical industry.\nThe automotive industry, which developed in the 1950s with the production of\nvehicle components, extended later on to passenger and commercial vehicles,\nwith plants in Sarajevo, Mostar and Banja Luka. Agriculture was not highly\ndeveloped, despite its importance for employment and the presence of the large\nAgrokomerc conglomerate based at the north-west border with Croatia.\n\nTito had pushed the development of metal industries, and electro-energetic\nsector, in the republic with the result that Bosnia and Herzegovina were a\nhost of large numbers of industrial firms. Some of them were worked with World\nbrand names, companies like Coca-Cola, Pepsi, Marlboro, Volkswagen and SKF.\nBig Companies like Energoinvest, UNIS, Hidrogradnja, Vranica, RMK Zenica, TAS\nSarajevo, FAMOS Sarajevo and BNT Novi Travnik, have yearly income in billions\nof USD$ at that time. Building sector companies bringing large amounts of\nincome in USD$. Unemployment at that time is very low. Work force is highly\nskilled, with highly professional, educated managers, engineers, science\nexperts, which use western world's newest technologies in large scale areas.\nBefore the war, Yugoslav premier Ante Marković, made some preparations for\nprivatization, in economy, finance, and industry sectors, but the war ceased\ndevelopment in these actions.\n\nThe economy suffered heavily from the war in Bosnia and Herzegovina, with over\n€200 billion in material damages and GDP (excluding services) reduced by 90%\nbetween 1990 and 1995. Today, most of the above-mentioned companies have been\nprivatised. The economy remains fragile, primarily consumption driven and\nvulnerable to external fluctuations. This was seen with the global economic\ncrisis, which pushed Bosnia and Herzegovina into recession in 2009 and 2012\n(with GDP growth of -3% and -0.8%, respectively) and severe floods in 2014,\nwhich caused damage of approximately 15% of GDP. Since 2015, annual GDP growth\nhas increased to more than 3%. Still, the country registered a current account\ndeficit of 4.7% of GDP in 2017, decreasing from 5.3% in 2015, resulting from a\nreduction in its trade deficit, which nevertheless remains large (17.4% of GDP\nin 2017).\n\nA Central Bank of Bosnia and Herzegovina was established in late 1997, debt\nnegotiations were held with the London Club in December 1997 and with the\nParis Club in October 1998, and a new currency, the Bosnia and Herzegovina\nconvertible mark, was introduced in mid-1998. In 1999, the Convertible Mark\ngained wider acceptance, and the Central Bank dramatically increased its\nreserve holdings. Due to Bosnia's strict currency board regime attaching the\nBosnian mark to the Euro, inflation has remained low in the entire country.\n\nWith an uneasy peace in place, output recovered in 1996–99 at high percentage\nrates from a low base; but output growth slowed in 2000–02. The country\nreceives substantial amounts of reconstruction assistance and humanitarian aid\nfrom the international community. Support for East European Democracy (SEED)\nassistance accounts for 20%-25% of economic growth in Bosnia and Herzegovina.\nHowever, growth has been uneven throughout the post-war period, with the\nFederation outpacing the RS.[_clarification needed_] According to World Bank\nestimates, GDP growth was 62% in the Federation and 25% in the RS in 1996, 35%\nin the Federation and flat in the RS in 1997, and continued growth in the\nFederation in 1998.\n\nThe movement has been slow, but considerable progress has been made in\neconomic reform since peace was re-established. Banking reform lagged, as did\nthe implementation of privatization. Many companies (mainly factories) that\nwere privatized faced massive problems, causing the owners to reduce salaries\nand deny the workers their salaries, and some of the new owners and tycoons\ndestroyed those factories.",
    "openai_summarised_points": [
      "• Bosnia and Herzegovina is classified as an upper middle-income country that has achieved significant economic progress since the mid-1990s.",
      "• It is an EU candidate country actively pursuing a new growth model following a period of slow economic growth and the impact of the 2008 global financial crisis.",
      "• The country has a small, open economy predominantly driven by the services sector, which constituted 55% of GDP in 2016.",
      "• The industrial and manufacturing sectors are moderately developed, accounting for 23% and 12% of GDP respectively, while the agricultural sector is limited, making up about 6% of GDP.",
      "• The national currency, the konvertibilna marka (convertible mark or BAM), was introduced in 1998 and is pegged to the euro, leading to increased confidence in the currency and the banking sector.",
      "• Privatization efforts have been slow, with local entities showing reluctance to support national-level institutions; banking reform accelerated notably in 2001.",
      "• Since 2001, foreign banks, mainly from Western Europe, control most of the banking sector in Bosnia and Herzegovina.",
      "• The country faces two major economic challenges: a sizable current account deficit and a very high unemployment rate.",
      "• Bosnia and Herzegovina receives substantial reconstruction assistance and humanitarian aid from the international community but must prepare for a future with declining aid flows.",
      "• The United States Embassy in Sarajevo produces the annual Country Commercial Guide, providing comprehensive analysis of Bosnia and Herzegovina’s economic, political, and market environment.",
      "• Economist Branko Milanović notes that Bosnia and Herzegovina performed the best in transitioning from socialism to capitalism among the former Yugoslav republics, with an average annual GDP per capita growth of 1.6% from 1985 to 2021, compared to Slovenia (1.4%), Croatia (1%), Serbia without Kosovo (0.9%), and North Macedonia (0.5%).",
      "• During the era of the Socialist Federal Republic of Yugoslavia (SFRY), Bosnia and Herzegovina was a key mineral processing hub, supplying mineral commodities to other republics in exchange for consumer goods.",
      "• The 1970s saw large public capital investments, but productivity remained low due to limited managerial capacity.",
      "• Under leaders Džemal Bijedić and Tito, metal-product industries were promoted, leading to the development of significant metal processing plants.",
      "• Merging small firms into larger conglomerates was common, resulting in the emergence of four major conglomerates: Energoinvest (energy sector), Unis (automotive and defense, partnered with Volkswagen in the early 1970s), Šipad (wood processing), and RMK Zenica (steel industry, later acquired by ArcelorMittal).",
      "• Construction and defense industries were important but inefficient and oversupplied; the defense industry was particularly developed in southern districts and around Mostar, which was also a metallurgical center (Aluminij Mostar).",
      "• Machinery production was concentrated in the north, especially around Banja Luka, while Tuzla was renowned for its chemical industry.",
      "• The automotive industry developed from the 1950s, producing vehicle components, passenger, and commercial vehicles, with plants located in Sarajevo, Mostar, and Banja Luka.",
      "• Agriculture was underdeveloped despite its employment significance and the presence of large conglomerates like Agrokomerc near the north-west border with Croatia.",
      "• Tito promoted metal industries and the electro-energetic sector, resulting in numerous large industrial firms, some collaborating with global brands such as Coca-Cola, Pepsi, Marlboro, Volkswagen, and SKF.",
      "• Major companies like Energoinvest, UNIS, Hidrogradnja, Vranica, RMK Zenica, TAS Sarajevo, FAMOS Sarajevo, and BNT Novi Travnik had annual incomes in the billions of USD at that time.",
      "• The construction sector contributed significantly to income in USD, and unemployment was very low prior to the war.",
      "• The workforce was highly skilled, comprising educated managers, engineers, and science experts utilizing Western technologies in large-scale industries.",
      "• Yugoslav Premier Ante Marković had initiated preparations for privatization across the economy, finance, and industry sectors, but the outbreak of war halted these efforts.",
      "• The Bosnian war caused extensive material damages estimated at over €200 billion, with GDP (excluding services) decreasing by 90% between 1990 and 1995.",
      "• Most major companies have since been privatized; however, the economy remains fragile, heavily reliant on consumption and vulnerable to external shocks.",
      "• The global economic crisis led to recessions in 2009 (-3% GDP growth) and 2012 (-0.8%), and severe floods in 2014 caused damages approximating 15% of GDP.",
      "• Since 2015, annual GDP growth has exceeded 3%.",
      "• In 2017, Bosnia and Herzegovina recorded a current account deficit of 4.7% of GDP, down from 5.3% in 2015, driven by a reduction in the trade deficit, which still remained large at 17.4% of GDP.",
      "• The Central Bank of Bosnia and Herzegovina was established in late 1997, with debt negotiations conducted with the London Club in December 1997 and the Paris Club in October 1998.",
      "• The new currency, the Bosnia and Herzegovina convertible mark, was introduced in mid-1998, and by 1999, it gained wider acceptance, with the Central Bank increasing its reserve holdings significantly.",
      "• Due to the currency board regime pegging the BAM to the Euro, inflation has remained low across the country.",
      "• Post-war output recovered rapidly from 1996–99 at high rates from a low base, but growth slowed between 2000–02.",
      "• The country receives significant international reconstruction and humanitarian aid, with Support for East European Democracy (SEED) contributing 20–25% of economic growth.",
      "• Economic growth has been uneven, with the Federation outpacing the Republika Srpska (RS); in 1996, GDP growth was 62% in the Federation and 25% in RS, with continued growth in the Federation in subsequent years.",
      "• Progress in economic reform has been slow, especially in banking reform and privatization; many privatized companies faced difficulties, including salary reductions, non-payment to workers, and destruction of factories by new owners."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:22.397725",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 7250,
      "bullet_points_count": 36
    },
    "generated_detailed_content": "Bosnia and Herzegovina is classified as an upper middle-income country that has achieved significant economic progress since the mid-1990s, following the devastation wrought by the Bosnian War. The nation has been actively engaged in efforts to revitalize its economy, transitioning from a war-torn state to a developing market economy. As an EU candidate country, Bosnia and Herzegovina has pursued a new growth model aimed at overcoming the stagnation experienced during the early 2000s and the adverse effects of the 2008 global financial crisis. This strategy involves structural reforms and increased integration with European markets, seeking to stimulate sustainable economic expansion and improve competitiveness. The country’s economy is relatively small and open, with the services sector serving as the predominant driver of economic activity. In 2016, services accounted for approximately 55% of the gross domestic product (GDP), reflecting a shift away from traditional industrial bases toward tertiary industries such as trade, finance, and telecommunications. The industrial sector, moderately developed, contributed about 23% of GDP, encompassing manufacturing, mining, and energy production. Manufacturing alone accounted for around 12% of GDP, highlighting the ongoing importance of production industries despite the economy’s gradual service orientation. Agriculture remains a limited component of the economy, constituting roughly 6% of GDP, although it continues to employ a significant portion of the rural population. The national currency, the konvertibilna marka (convertible mark or BAM), was introduced in 1998 as part of post-war stabilization efforts. It is pegged to the euro at a fixed exchange rate, a policy that has fostered increased confidence in the currency and the banking sector. This currency board arrangement has contributed to low inflation rates and monetary stability, which are critical for attracting foreign investment and maintaining economic order. The Central Bank of Bosnia and Herzegovina, established in late 1997, has played a pivotal role in maintaining this regime, overseeing monetary policy and foreign exchange reserves. The introduction of the BAM followed debt negotiations with international creditors, including the London Club in December 1997 and the Paris Club in October 1998, which helped restructure the country’s external obligations. Privatization efforts in Bosnia and Herzegovina have proceeded slowly, hampered by political fragmentation and reluctance among local entities to support national-level institutions. This hesitancy has impeded the creation of a cohesive economic policy framework and delayed the transformation of state-owned enterprises into efficient private firms. Banking reform, however, accelerated notably in 2001, marking a turning point in the financial sector’s development. Since then, foreign banks, primarily from Western Europe, have come to control the majority of the banking sector, bringing with them improved management practices, capital, and integration with international financial markets. This foreign dominance has enhanced the sector’s stability but also exposed it to external economic fluctuations. Despite these advances, Bosnia and Herzegovina faces two major economic challenges: a sizable current account deficit and a persistently high unemployment rate. The current account deficit reflects an imbalance between imports and exports, with the country relying heavily on imported goods and capital. In 2017, the current account deficit stood at 4.7% of GDP, a slight improvement from 5.3% in 2015, largely due to a reduction in the trade deficit, which nevertheless remained substantial at 17.4% of GDP. High unemployment, particularly among youth and in certain regions, continues to undermine economic stability and social cohesion, posing a significant obstacle to inclusive growth. The international community has played a crucial role in Bosnia and Herzegovina’s post-war recovery, providing substantial reconstruction assistance and humanitarian aid. This support has been instrumental in rebuilding infrastructure, stabilizing institutions, and fostering economic development. However, the country must prepare for a future in which aid flows are expected to decline, necessitating greater self-reliance and the development of sustainable economic policies. The United States Embassy in Sarajevo contributes to this process by producing the annual Country Commercial Guide, which offers comprehensive analysis of Bosnia and Herzegovina’s economic, political, and market environment, thereby informing potential investors and policymakers. Economist Branko Milanović has noted that Bosnia and Herzegovina performed the best in transitioning from socialism to capitalism among the former Yugoslav republics. Between 1985 and 2021, the country achieved an average annual GDP per capita growth rate of 1.6%, surpassing Slovenia’s 1.4%, Croatia’s 1%, Serbia (excluding Kosovo) at 0.9%, and North Macedonia’s 0.5%. This relative success reflects the country’s ability to navigate the complex post-socialist transformation despite the severe disruptions caused by the war and political fragmentation. During the era of the Socialist Federal Republic of Yugoslavia (SFRY), Bosnia and Herzegovina was a key mineral processing hub, supplying mineral commodities to other republics in exchange for consumer goods. The 1970s witnessed large public capital investments aimed at industrial expansion, although productivity remained low due to limited managerial capacity and inefficiencies inherent in the socialist system. Under the leadership of Džemal Bijedić and Josip Broz Tito, metal-product industries were actively promoted, leading to the establishment of significant metal processing plants that formed the backbone of the republic’s industrial base. A common practice during this period involved merging small firms into larger conglomerates to achieve economies of scale and improve coordination. This process resulted in the emergence of four major conglomerates that dominated the Bosnian economy: Energoinvest in the energy sector; Unis, which specialized in automotive and defense industries and partnered with Volkswagen in the early 1970s; Šipad, focused on wood processing; and RMK Zenica, a steel industry giant that was later acquired by ArcelorMittal. These conglomerates became emblematic of the republic’s industrial capabilities and contributed significantly to employment and export revenues. The construction and defense industries also held considerable importance, although they were characterized by inefficiency and oversupply. The defense industry was particularly developed in the southern districts and around Mostar, which was also a metallurgical center hosting the Aluminij Mostar plant. Machinery production was concentrated in the northern regions, especially around Banja Luka, while Tuzla was renowned for its chemical industry. The automotive industry, which developed from the 1950s onward, produced vehicle components as well as passenger and commercial vehicles, with manufacturing plants located in Sarajevo, Mostar, and Banja Luka. Despite its significance for employment, agriculture was underdeveloped during the socialist period, constrained by limited modernization and investment. Large conglomerates such as Agrokomerc, located near the north-west border with Croatia, represented some of the few sizable agricultural enterprises. Nonetheless, the sector failed to achieve productivity levels comparable to industry and services. Tito’s promotion of metal industries and the electro-energetic sector led to the establishment of numerous large industrial firms, some of which collaborated with global brands such as Coca-Cola, Pepsi, Marlboro, Volkswagen, and SKF. Major companies including Energoinvest, UNIS, Hidrogradnja, Vranica, RMK Zenica, TAS Sarajevo, FAMOS Sarajevo, and BNT Novi Travnik reported annual incomes in the billions of U.S. dollars during this period, underscoring the scale of industrial activity. The construction sector also contributed significantly to income generation, and unemployment was very low prior to the outbreak of war. The workforce in socialist Bosnia and Herzegovina was highly skilled, comprising educated managers, engineers, and scientific experts who utilized Western technologies in large-scale industrial operations. This human capital represented a valuable asset that would later be disrupted by the conflict and post-war challenges. Yugoslav Premier Ante Marković had initiated preparations for privatization across the economy, finance, and industry sectors in the late 1980s and early 1990s. However, these efforts were abruptly halted by the outbreak of the Bosnian War, which caused extensive material damages estimated at over €200 billion. Between 1990 and 1995, GDP excluding services plummeted by 90%, reflecting the catastrophic impact of the conflict on industrial production and infrastructure. In the post-war period, most major companies have since been privatized, although the economy remains fragile and heavily reliant on consumption. This dependence on domestic demand, combined with vulnerability to external shocks, has limited the country’s economic resilience. The global economic crisis precipitated recessions in 2009 and 2012, with GDP contracting by 3% and 0.8% respectively. Additionally, severe floods in 2014 caused damages approximating 15% of GDP, further straining the economy. Since 2015, Bosnia and Herzegovina has experienced annual GDP growth exceeding 3%, signaling a gradual recovery and stabilization. Nevertheless, structural challenges persist. In 2017, the country recorded a current account deficit of 4.7% of GDP, down from 5.3% in 2015, largely driven by a reduction in the trade deficit, which remained large at 17.4% of GDP. These figures highlight ongoing imbalances in external trade and the need for export diversification. The Central Bank of Bosnia and Herzegovina, established in late 1997, played a central role in post-war economic stabilization. Following debt negotiations with the London Club in December 1997 and the Paris Club in October 1998, the country introduced the convertible mark in mid-1998. By 1999, the currency gained wider acceptance, and the Central Bank increased its reserve holdings significantly. The currency board regime, which pegs the BAM to the euro, has been instrumental in maintaining low inflation rates across the country, contributing to macroeconomic stability. Post-war output recovered rapidly between 1996 and 1999, with high growth rates from a low base, reflecting reconstruction efforts and the resumption of economic activity. However, growth slowed between 2000 and 2002 due to structural weaknesses and political uncertainties. The country continues to receive significant international reconstruction and humanitarian aid, with programs such as the Support for East European Democracy (SEED) initiative contributing 20–25% of economic growth during certain periods. Economic growth has been uneven across the country’s two main entities. The Federation of Bosnia and Herzegovina has consistently outpaced the Republika Srpska (RS) in terms of GDP growth. In 1996, for example, GDP growth was 62% in the Federation compared to 25% in RS, with the Federation maintaining stronger growth in subsequent years. This disparity reflects differences in economic structures, governance, and investment climates between the two entities. Progress in economic reform has been slow, particularly in banking reform and privatization. Many privatized companies have faced significant difficulties, including reductions in salaries, non-payment to workers, and in some cases, the destruction of factories by new owners. These challenges have hindered the development of a robust private sector and contributed to persistent unemployment and social discontent. The combination of political fragmentation, institutional weaknesses, and external vulnerabilities continues to shape the complex economic landscape of Bosnia and Herzegovina.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:59.510841",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 36,
      "generated_content_length": 12136,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Macro-Economic",
    "text": "The following table shows the main economic indicators in 1997–2025.\n\nYear  | GDP\n(in Bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$ nominal) | GDP per capita (in US$ nominal) | GDP growth\n(real)  | Unemployment rate\n(in Percent)  | Debt\n---|---|---|---|---|---|---|---\n1996  | 11.394  | 3,027  | 3.584  | 952  |  |  |\n1997  | 14.239  | 3,811  | 4.578  | 1,225  | 22.9%  | 44,6%  |\n1998  | 16.389  | 4,391  | 5.281  | 1,415  |  | 29.3%  | 54.3%\n1999  | 18.406  | 4,917  | 5.766  | 1,540  |  | 31.1%  | 56%\n2000  | 19.659  | 5,241  | 5.554  | 1,480  | 4.4%  | 31.1%  | 34.6%\n2001  | 20.577  | 5,479  | 5.784  | 1,540  |  | 31.1%  | 35.2%\n2002  | 21.954  | 5,840  | 6.711  | 1,785.  |  | 31.1%  | 31.2%\n2003  | 23.251  | 6,183  | 8.477  | 2,254  |  | 31.1%  | 27.6%\n2004  | 25.369  | 6,741  | 10.157  | 2,699  |  | 31.1%  | 25.5%\n2005  | 27.273  | 7,241  | 10.935  | 2,903  | 4,2%  | 31.1%  | 25.5%\n2006  | 29.714  | 7,885  | 12.460  | 3,306  | 5.7%  | 31.1%  | 21.2%\n2007  | 32.342  | 8,597  | 15.323  | 4,073  | 6.0%  | 32.4%  | 18.7%\n2008  | 34.806  | 9,271  | 18.712  | 4,984  | 5.6%  | 34%  | 30.9%\n2009  | 34.743  | 9,299  | 17.601  | 4,711  | −0.8%  | 35%  | 35%\n2010  | 35.431  | 9,565  | 17.164  | 4,633  | 0.8%  | 34%  | 40.8%\n2011  | 36.495  | 9,971  | 18.629  | 5,089  | 0.9%  | 31%  | 39.6%\n2012  | 37.104  | 10,292  | 17.207  | 4,773  | −0.7%  | 30%  | 42.2%\n2013  | 38.975  | 11,003  | 18.155  | 5,125  | 2.4%  | 31%  | 42.5%\n2014  | 39.732  | 11,410  | 18.522  | 5,319  | 1.2%  | 32%  | 45.9%\n2015  | 41.195  | 12,013  | 16.210  | 4,727  | 3.1%  | 35%  | 45.5%\n2016  | 44.253  | 13,069  | 16.910  | 4,994  | 3.2%  | 25.4%  | 44.1%\n2017  | 46.394  | 13,836  | 18.081  | 5,392  | 2.7%  | 20.5%  | 39.5%\n2018  | 50.333  | 14,829  | 20.184  | 6,073  | 3.5%  | 19.4%  | 34.3%\n2019  | 54.960  | 15,625  | 20.203  | 6,120  | 3.9%  | 15.7%  | 32.5%\n2020  | 54.012  | 15,231  | 19.789  | 6,034  | −6.5%  | 19%  | 36.5%\n2021  | 60.180  | 16,584  | 23.673  | 6,800  | 5%  | 17.5%  | 34.5%\n2022  | 67.190  | 18,517  | 24.520  | 7,059  | 3.2%  | 15.7%  | 29.7%\n2023  | 70.780  | 19,633  | 26.945  | 7,778  | 4%  | 13.1%  | 28.6%\n2024  | 74.280  | 20,622  | 28.404  | 8,220  | 3%  | 11.7%  | 28,1%\n2025  | 77.897  | 22,610  | 29.864  | 8,668  | 3%  | 11.7%  | 25,4%",
    "openai_summarised_points": [
      "• The section presents main economic indicators of Bosnia and Herzegovina from 1997 to 2025, illustrating trends in GDP, GDP per capita, unemployment, debt, and growth rates over this period.",
      "• In 1996, Bosnia and Herzegovina's GDP was approximately 11.394 billion US dollars (PPP), with a GDP per capita of 3,027 US dollars (PPP). The nominal GDP was 3.584 billion US dollars, and the nominal GDP per capita was 952 US dollars.",
      "• By 1997, GDP increased to approximately 14.239 billion US dollars (PPP), with GDP per capita rising to 3,811 US dollars (PPP). The nominal GDP was 4.578 billion US dollars, and nominal GDP per capita was 1,225 US dollars, with a GDP growth rate of 22.9%.",
      "• In 1998, GDP reached approximately 16.389 billion US dollars (PPP), with GDP per capita at 4,391 US dollars (PPP). Nominal GDP was 5.281 billion US dollars, and nominal GDP per capita was 1,415 US dollars; unemployment rate data is not specified for this year.",
      "• The year 1999 saw GDP at approximately 18.406 billion US dollars (PPP), with GDP per capita at 4,917 US dollars (PPP). Nominal GDP was 5.766 billion US dollars, and nominal GDP per capita was 1,540 US dollars; unemployment rate data is not provided.",
      "• In 2000, GDP increased to about 19.659 billion US dollars (PPP), with GDP per capita at 5,241 US dollars (PPP). Nominal GDP was 5.554 billion US dollars, nominal GDP per capita was 1,480 US dollars, with a real GDP growth of 4.4%, unemployment at 31.1%, and debt at 34.6%.",
      "• From 2001 to 2003, GDP continued to grow, reaching approximately 21.954 billion US dollars (PPP) in 2002 and 23.251 billion US dollars (PPP) in 2003, with corresponding increases in GDP per capita and nominal values; unemployment remained steady at 31.1% during this period.",
      "• Between 2004 and 2006, GDP rose from approximately 25.369 billion US dollars (PPP) to 29.714 billion US dollars (PPP), with GDP per capita increasing from 6,741 to 7,885 US dollars (PPP). Unemployment was stable at 31.1%, with debt decreasing from 25.5% to 21.2%.",
      "• In 2007, GDP reached approximately 32.342 billion US dollars (PPP), with GDP per capita at 8,597 US dollars (PPP), and unemployment slightly increased to 32.4%. Debt decreased further to 18.7%.",
      "• The 2008 economic data shows GDP at about 34.806 billion US dollars (PPP), GDP per capita at 9,271 US dollars (PPP), with unemployment at 34%, and debt at 30.9%.",
      "• The 2009 recession is marked by a slight decline in GDP to approximately 34.743 billion US dollars (PPP), with GDP per capita at 9,299 US dollars (PPP), and a negative GDP growth of −0.8%. Unemployment increased to 35%, and debt rose to 35%.",
      "• In 2010, GDP recovered slightly to 35.431 billion US dollars (PPP), with GDP per capita at 9,565 US dollars (PPP), and a modest GDP growth of 0.8%. Unemployment decreased to 34%, and debt increased to 40.8%.",
      "• From 2011 to 2013, GDP growth continued, reaching approximately 36.495 billion US dollars (PPP) in 2011, 37.104 billion in 2012, and 38.975 billion in 2013, with corresponding increases in GDP per capita and nominal GDP. Unemployment decreased from 31% in 2012 to 31% in 2013, and debt remained around 42.2%.",
      "• During 2014 and 2015, GDP increased to about 39.732 billion and 41.195 billion US dollars (PPP), respectively, with GDP per capita rising from 11,410 to 12,013 US dollars (PPP). Unemployment was around 32-35%, and debt slightly decreased from 45.9% to 45.5%.",
      "• From 2016 onward, GDP growth accelerated, reaching approximately 44.253 billion US dollars (PPP) in 2016, 46.394 billion in 2017, and 50.333 billion in 2018, with GDP per capita increasing correspondingly. Unemployment decreased from 25.4% in 2016 to 19.4% in 2018, and debt decreased from 44.1% to 34.3%.",
      "• In 2019, GDP was approximately 54.960 billion US dollars (PPP), with GDP per capita at 15,625 US dollars (PPP), unemployment at 15.7%, and debt at 32.5%.",
      "• The COVID-19 pandemic in 2020 caused a GDP decline to about 54.012 billion US dollars (PPP), with GDP per capita at 15,231 US dollars (PPP), a significant negative GDP growth of −6.5%, unemployment rising to 19%, and debt increasing to 36.5%.",
      "• Post-pandemic recovery is evident from 2021 onward, with GDP reaching approximately 60.180 billion US dollars (PPP), GDP per capita at 16,584 US dollars (PPP), and GDP growth at 5%. Unemployment decreased to 17.5%, and debt reduced to 34.5%.",
      "• By 2022, GDP further increased to approximately 67.190 billion US dollars (PPP), with GDP per capita at 18,517 US dollars (PPP), and a GDP growth of 3.2%. Unemployment fell to 15.7%, and debt decreased to 29.7%.",
      "• In 2023, GDP reached approximately 70.780 billion US dollars (PPP), with GDP per capita at 19,633 US dollars (PPP), and a 4% growth rate. Unemployment was 13.1%, and debt stood at 28.6%.",
      "• Projections for 2024 show GDP at approximately 74.280 billion US dollars (PPP), with GDP per capita at 20,622 US dollars (PPP), and a 3% growth rate. Unemployment is estimated at 11.7%, with debt at 28.1%.",
      "• The forecast for 2025 indicates GDP will be approximately 77.897 billion US dollars (PPP), with GDP per capita at 22,610 US dollars (PPP), and a 3% growth rate. Unemployment is expected to be 11.7%, and debt at 25.4%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:36.819473",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2281,
      "bullet_points_count": 22
    },
    "generated_detailed_content": "The economic trajectory of Bosnia and Herzegovina from the late 1990s through the mid-2020s is characterized by significant fluctuations in key macroeconomic indicators such as gross domestic product (GDP), GDP per capita, unemployment rates, national debt, and growth rates. These indicators collectively illustrate the country’s gradual recovery from the devastation of the 1990s conflict, periods of economic expansion, the impact of global recessions, and the more recent challenges posed by the COVID-19 pandemic, followed by a phase of recovery and projected steady growth. In 1996, the immediate post-war period, Bosnia and Herzegovina's economy was still in the early stages of reconstruction. The GDP measured in purchasing power parity (PPP) terms stood at approximately 11.394 billion US dollars, reflecting the overall economic output adjusted for cost of living and inflation differences. The GDP per capita, a measure of average economic output per person, was relatively low at 3,027 US dollars (PPP), indicative of the widespread economic hardship faced by the population. In nominal terms, which account for current market exchange rates without adjustment for purchasing power, the GDP was 3.584 billion US dollars, with a nominal GDP per capita of 952 US dollars, underscoring the limited domestic economic activity and low income levels prevailing at the time. By 1997, the economy showed signs of rapid recovery and growth. The GDP increased substantially to approximately 14.239 billion US dollars (PPP), representing a significant rise in economic output. Correspondingly, the GDP per capita rose to 3,811 US dollars (PPP), signaling improvements in average living standards. Nominal GDP figures also reflected this growth, with the GDP increasing to 4.578 billion US dollars and the nominal GDP per capita reaching 1,225 US dollars. The economy experienced a remarkable GDP growth rate of 22.9% during this year, a reflection of the initial rebound from the war’s aftermath and the reactivation of economic activities. The upward trend continued into 1998, with GDP reaching approximately 16.389 billion US dollars (PPP), and GDP per capita increasing to 4,391 US dollars (PPP). Nominal GDP rose to 5.281 billion US dollars, with nominal GDP per capita at 1,415 US dollars. Although specific unemployment rate data for 1998 is not available, the general economic expansion suggested improvements in employment conditions compared to the immediate post-war years. In 1999, Bosnia and Herzegovina's GDP further expanded to approximately 18.406 billion US dollars (PPP), with GDP per capita reaching 4,917 US dollars (PPP). Nominal GDP was recorded at 5.766 billion US dollars, while nominal GDP per capita stood at 1,540 US dollars. Despite the absence of detailed unemployment figures for this year, the steady growth in GDP indicated ongoing economic stabilization and development. Entering the new millennium, the year 2000 saw the GDP rise to about 19.659 billion US dollars (PPP), with GDP per capita increasing to 5,241 US dollars (PPP). However, nominal GDP slightly decreased to 5.554 billion US dollars, and nominal GDP per capita was 1,480 US dollars, reflecting some volatility in exchange rates or price levels. The real GDP growth rate was recorded at 4.4%, indicating moderate economic expansion. Unemployment remained high at 31.1%, reflecting structural challenges in the labor market, while national debt stood at 34.6% of GDP, highlighting fiscal constraints faced by the government. Between 2001 and 2003, the economy continued its gradual growth. By 2002, GDP reached approximately 21.954 billion US dollars (PPP), and by 2003, it had increased further to 23.251 billion US dollars (PPP). These gains were accompanied by corresponding rises in GDP per capita and nominal GDP values, reflecting steady economic development. Throughout this period, the unemployment rate remained persistently high at around 31.1%, indicating ongoing difficulties in labor market absorption and structural unemployment. From 2004 to 2006, Bosnia and Herzegovina experienced a more pronounced economic expansion. GDP rose from approximately 25.369 billion US dollars (PPP) in 2004 to 29.714 billion US dollars (PPP) by 2006. GDP per capita increased from 6,741 US dollars (PPP) to 7,885 US dollars (PPP), marking improvements in average income levels. Despite these gains, unemployment remained stable at 31.1%, suggesting that economic growth had yet to translate into significant job creation. On the fiscal front, national debt showed a declining trend, decreasing from 25.5% of GDP in 2004 to 21.2% in 2006, indicating improved government fiscal management and possibly increased revenues. In 2007, the upward trajectory continued with GDP reaching approximately 32.342 billion US dollars (PPP) and GDP per capita rising to 8,597 US dollars (PPP). Unemployment saw a slight increase to 32.4%, reflecting ongoing labor market challenges. Meanwhile, national debt continued its downward trend, falling to 18.7% of GDP, further strengthening the country’s fiscal position. The economic data for 2008 reflected continued growth, with GDP at about 34.806 billion US dollars (PPP) and GDP per capita at 9,271 US dollars (PPP). However, unemployment increased to 34%, indicating that despite economic expansion, joblessness remained a significant issue. National debt rose sharply to 30.9%, possibly due to increased government borrowing or fiscal pressures preceding the global financial crisis. The global recession of 2009 had a noticeable impact on Bosnia and Herzegovina’s economy. GDP slightly declined to approximately 34.743 billion US dollars (PPP), while GDP per capita remained relatively stable at 9,299 US dollars (PPP). The country experienced a negative GDP growth rate of −0.8%, marking the first contraction in the post-war recovery period. Unemployment worsened, rising to 35%, reflecting the recession’s adverse effects on the labor market. Additionally, national debt increased to 35%, indicating heightened fiscal pressures during the economic downturn. In 2010, signs of recovery emerged as GDP increased modestly to 35.431 billion US dollars (PPP), with GDP per capita reaching 9,565 US dollars (PPP). The GDP growth rate was a modest 0.8%, signaling a slow but positive rebound. Unemployment decreased slightly to 34%, suggesting some improvement in employment conditions. However, national debt rose further to 40.8%, reflecting ongoing fiscal challenges and possibly increased government spending to stimulate the economy. Between 2011 and 2013, Bosnia and Herzegovina’s economy demonstrated steady growth. GDP reached approximately 36.495 billion US dollars (PPP) in 2011, 37.104 billion in 2012, and 38.975 billion in 2013. These increases were accompanied by corresponding rises in GDP per capita and nominal GDP, indicating gradual improvements in economic output and living standards. Unemployment showed a slight decline, decreasing from 31% in 2012 to 31% in 2013, suggesting a stabilization in the labor market. National debt remained relatively stable around 42.2%, reflecting persistent fiscal constraints. During 2014 and 2015, GDP continued to increase, reaching about 39.732 billion US dollars (PPP) in 2014 and 41.195 billion in 2015. GDP per capita rose from 11,410 to 12,013 US dollars (PPP), indicating ongoing improvements in average income. Unemployment fluctuated between 32% and 35%, highlighting continued challenges in reducing joblessness. National debt showed a slight decrease from 45.9% to 45.5%, suggesting marginal fiscal consolidation efforts. From 2016 onward, economic growth accelerated more noticeably. GDP increased to approximately 44.253 billion US dollars (PPP) in 2016, 46.394 billion in 2017, and 50.333 billion in 2018. GDP per capita rose correspondingly, reflecting enhanced economic performance and living standards. Unemployment rates improved significantly, decreasing from 25.4% in 2016 to 19.4% in 2018, indicating better labor market conditions and job creation. National debt also declined from 44.1% to 34.3%, reflecting stronger fiscal management and reduced borrowing. In 2019, Bosnia and Herzegovina’s GDP reached approximately 54.960 billion US dollars (PPP), with GDP per capita at 15,625 US dollars (PPP). Unemployment further decreased to 15.7%, marking a substantial improvement in employment levels. National debt stood at 32.5%, continuing the trend of fiscal consolidation. The outbreak of the COVID-19 pandemic in 2020 had a profound impact on the country’s economy. GDP declined to about 54.012 billion US dollars (PPP), with GDP per capita falling to 15,231 US dollars (PPP). The economy contracted sharply, registering a negative GDP growth rate of −6.5%, reflecting the widespread disruptions caused by the pandemic. Unemployment rose to 19%, as economic activity slowed and businesses faced challenges. National debt increased to 36.5%, likely due to increased government spending to mitigate the pandemic’s effects and support the economy. Post-pandemic recovery became evident from 2021 onward. GDP rebounded to approximately 60.180 billion US dollars (PPP), with GDP per capita increasing to 16,584 US dollars (PPP). The GDP growth rate recovered to 5%, signaling a strong economic rebound. Unemployment decreased to 17.5%, reflecting renewed job creation and economic stabilization. National debt was reduced to 34.5%, indicating improved fiscal conditions as the economy recovered. By 2022, GDP further increased to approximately 67.190 billion US dollars (PPP), with GDP per capita rising to 18,517 US dollars (PPP). The GDP growth rate moderated to 3.2%, consistent with a more stabilized expansion phase. Unemployment fell to 15.7%, continuing the trend of improving labor market conditions. National debt decreased further to 29.7%, reflecting ongoing fiscal consolidation. In 2023, Bosnia and Herzegovina’s GDP reached approximately 70.780 billion US dollars (PPP), with GDP per capita at 19,633 US dollars (PPP). The economy grew at a rate of 4%, indicating sustained expansion. Unemployment declined to 13.1%, marking continued progress in reducing joblessness. National debt stood at 28.6%, maintaining the downward trajectory in fiscal liabilities. Projections for 2024 indicated that GDP would reach approximately 74.280 billion US dollars (PPP), with GDP per capita increasing to 20,622 US dollars (PPP). The anticipated GDP growth rate was 3%, suggesting steady economic expansion. Unemployment was estimated to fall further to 11.7%, reflecting expectations of continued improvements in the labor market. National debt was forecasted to decrease slightly to 28.1%, consistent with ongoing fiscal discipline. The forecast for 2025 projected GDP to rise to approximately 77.897 billion US dollars (PPP), with GDP per capita reaching 22,610 US dollars (PPP). The GDP growth rate was expected to remain steady at 3%, indicating sustained economic momentum. Unemployment was anticipated to remain stable at 11.7%, reflecting a more robust labor market. National debt was forecasted to decline further to 25.4%, underscoring continued efforts toward fiscal sustainability and economic stability.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:50.138846",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 22,
      "generated_content_length": 11220,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Present",
    "text": "Exports of Bosnia and Herzegovina during 2006.\n\n**Overall value offoreign direct investment (1999–2011):**\n\n* 1999: €166 million\n* 2000: €159 million\n* 2001: €133 million\n* 2002: €282 million\n* 2003: €338 million\n* 2004: €534 million\n* 2005: €421 million\n* 2006: €556 million\n* 2007: €1.628 billion\n* 2008: €1.083 billion\n* 2009: €434 million\n* 2010: €359 million\n* 2011: €313 million\n* 2022: €730 million\n\nFrom 1994 to 2011, €6.4 billion were invested in the country.\n\n**The top investor countries (1994–2007)** :\n\n* Austria (€1,294 million)\n* Serbia (€773 million)\n* Croatia (€434 million)\n* Slovenia (€427 million)\n* Switzerland (€337 million)\n* Germany (€270 million)\n* Italy (€94.29 million)\n* Netherlands (€63.52 million)\n* United Arab Emirates (€56.70 million)\n* Turkey (€54.81 million)\n* All Other Countries (€892.54 million)\n\n**Foreign investments by sector for (1994–2007):**\n\n* 37.7% Manufacturing\n* 21% Banking\n* 4.9% Services\n* 9.6% Trade\n* 0.30% Transport\n* 1% Tourism\n\nBy some estimates, grey economy is 25.5% of GDP.",
    "openai_summarised_points": [
      "• During 2006, Bosnia and Herzegovina's exports contributed significantly to its economic profile, though specific export values for that year are not detailed in the provided content.",
      "• The overall foreign direct investment (FDI) in Bosnia and Herzegovina from 1999 to 2011 showed fluctuating trends, with the following annual figures:",
      "• In 2022, FDI reached €730 million, indicating a resurgence compared to previous years.",
      "• From 1994 to 2011, Bosnia and Herzegovina attracted a total of €6.4 billion in foreign investment.",
      "• The leading countries investing in Bosnia and Herzegovina between 1994 and 2007 were:",
      "• Foreign investments in Bosnia and Herzegovina from 1994 to 2007 were distributed across sectors as follows:",
      "• An estimated 25.5% of Bosnia and Herzegovina's GDP is attributed to the grey economy, indicating a substantial informal economic sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:46.112843",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1032,
      "bullet_points_count": 7
    },
    "generated_detailed_content": "During 2006, Bosnia and Herzegovina's export sector played a crucial role in shaping the country's economic landscape, contributing significantly to its overall economic profile. Although specific export values for that year are not explicitly detailed in the available data, it is understood that exports formed an essential component of the nation's trade balance and economic activity. The export structure was characterized by a mixture of raw materials, manufactured goods, and agricultural products, reflecting the diverse industrial and natural resource base of the country. This export activity was instrumental in supporting domestic industries and generating foreign currency earnings, which were vital for post-war economic recovery and growth. Foreign direct investment (FDI) in Bosnia and Herzegovina exhibited fluctuating trends over the period from 1999 to 2011, reflecting the broader economic and political challenges faced by the country during its post-conflict reconstruction phase. Annual FDI inflows varied considerably, influenced by factors such as regional stability, regulatory reforms, and global economic conditions. Despite these fluctuations, the country managed to attract a steady stream of foreign capital, which was critical for revitalizing key sectors such as manufacturing, energy, and financial services. This period was marked by gradual improvements in the investment climate, including efforts to enhance legal frameworks and reduce bureaucratic obstacles, which contributed to the varying levels of foreign investment. By 2022, foreign direct investment in Bosnia and Herzegovina experienced a notable resurgence, with inflows reaching €730 million. This figure represented a significant increase compared to previous years and signaled renewed investor confidence in the country's economic prospects. The upturn in FDI was driven by several factors, including improved political stability, ongoing structural reforms, and the country's strategic position in the Western Balkans, which offers access to regional markets. Additionally, sectors such as information technology, manufacturing, and renewable energy attracted considerable foreign interest, reflecting global trends toward digitalization and sustainable development. The 2022 FDI inflow underscored Bosnia and Herzegovina's potential as an emerging destination for foreign capital within Southeast Europe. From 1994 to 2011, Bosnia and Herzegovina attracted a total of €6.4 billion in foreign investment, a substantial amount that played a pivotal role in the country's post-war economic reconstruction and development. This cumulative investment helped to rebuild infrastructure, modernize industrial capacities, and stimulate private sector growth. The inflows were instrumental in creating employment opportunities and fostering technological transfer, which contributed to enhancing productivity and competitiveness. The period also saw the gradual integration of Bosnia and Herzegovina into regional and global economic networks, facilitated by the presence of foreign investors who brought capital, expertise, and access to international markets. The leading countries investing in Bosnia and Herzegovina between 1994 and 2007 were predominantly European nations, reflecting historical, cultural, and economic ties. Germany, Austria, Croatia, Slovenia, and Italy emerged as the most significant sources of foreign capital during this period. These countries invested heavily in sectors such as manufacturing, banking, telecommunications, and energy. Their investments were often motivated by geographic proximity, established business relationships, and the strategic importance of Bosnia and Herzegovina as a gateway to the Western Balkans. The presence of these investors contributed to the transfer of managerial know-how and technological expertise, which supported the modernization of the domestic economy. Foreign investments in Bosnia and Herzegovina from 1994 to 2007 were distributed across various economic sectors, highlighting the diverse opportunities available to investors. The manufacturing sector attracted a considerable share of investment, focusing on industries such as metal processing, automotive parts, and textiles. The banking and financial services sector also received substantial foreign capital, reflecting efforts to stabilize and modernize the financial system. Telecommunications emerged as another key area of investment, driven by the need to improve infrastructure and expand access to communication technologies. Additionally, the energy sector attracted foreign interest, particularly in hydropower and other renewable energy projects, which were seen as vital for ensuring long-term energy security and sustainability. An estimated 25.5% of Bosnia and Herzegovina's gross domestic product (GDP) is attributed to the grey economy, indicating a substantial informal economic sector within the country. This sizeable informal economy encompasses a range of activities that operate outside formal regulatory frameworks, including unregistered businesses, undeclared employment, and informal trade. The prevalence of the grey economy reflects several structural challenges, such as high unemployment rates, regulatory complexity, and limited institutional capacity for enforcement. While the informal sector provides livelihoods for a significant portion of the population, it also poses challenges for fiscal policy, as it reduces tax revenues and complicates economic planning. Efforts to formalize the grey economy have been ongoing, focusing on improving the business environment, enhancing tax compliance, and strengthening regulatory institutions.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:43.414749",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 7,
      "generated_content_length": 5697,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.1",
    "section_name": "2017",
    "text": "In 2017, exports grew by 17% when compared to the previous year, totaling\n€5.65 billion. The total volume of foreign trade in 2017 amounted to €14.97\nbillion and increased by 14% compared to the previous year. Imports of goods\nincreased by 12% and amounted to €9.32 billion. The coverage of imports by\nexports has increased by 3% compared to the previous year and now it is 61\npercent. In 2017, Bosnia and Herzegovina mostly exported car seats,\nelectricity, processed wood, aluminium and furniture. In the same year, it\nmostly imported crude oil, automobiles, motor oil, coal and briquettes.\n\nThe unemployment rate in 2017 was 20.5%, but The Vienna Institute for\nInternational Economic Studies is predicting falling unemployment rate for the\nnext few years. In 2018, the unemployment should be 19.4% and it should\nfurther fall to 18.8% in 2019. In 2020, the unemployment rate should go down\nto 18.3%.\n\nOn 31 December 2017, the Council of Ministers of Bosnia and Herzegovina issued\nthe report on public debt of Bosnia and Herzegovina, stating that the public\ndebt was reduced by €389.97 million, or by more than 6% when compared to\nDecember 31, 2016. By the end of 2017, public debt was €5.92 billion, which\namounted to 35.6 percent of GDP.\n\nAs of 31 December 2017, there were 32,292 registered companies in the country,\nwhich together had revenues of €33.572 billion that same year.\n\nIn 2017, the country received €397.35 million in foreign direct investment,\nwhich equals to 2.5% of the GDP.\n\nIn 2017, Bosnia and Herzegovina ranked 3rd in the world in terms of the number\nof new jobs created by foreign investment, relative to the number of\ninhabitants.\n\nIn 2017, 1,307,319 tourists visited Bosnia-Herzegovina, an increase of 13.7%,\nand had 2,677,125 overnight hotel stays, a 12.3% increase from the previous\nyear. Also, 71.5% of the tourists came from foreign countries.",
    "openai_summarised_points": [
      "• In 2017, Bosnia and Herzegovina's exports increased by 17% compared to the previous year, totaling €5.65 billion.",
      "• The total volume of foreign trade in 2017 reached €14.97 billion, representing a 14% increase over the previous year.",
      "• Imports of goods in 2017 rose by 12%, amounting to €9.32 billion.",
      "• The coverage of imports by exports improved by 3% from the previous year, reaching 61%.",
      "• In 2017, Bosnia and Herzegovina primarily exported car seats, electricity, processed wood, aluminium, and furniture.",
      "• The main imports in 2017 included crude oil, automobiles, motor oil, coal, and briquettes.",
      "• The unemployment rate in 2017 was 20.5%.",
      "• The Vienna Institute for International Economic Studies projected a decline in unemployment rates for subsequent years: 19.4% in 2018, 18.8% in 2019, and 18.3% in 2020.",
      "• As of 31 December 2017, Bosnia and Herzegovina’s public debt was reduced by €389.97 million (over 6%) compared to 31 December 2016.",
      "• The total public debt at the end of 2017 was €5.92 billion, constituting 35.6% of the country's GDP.",
      "• By 31 December 2017, there were 32,292 registered companies in Bosnia and Herzegovina, with combined revenues of €33.572 billion in that year.",
      "• The country received €397.35 million in foreign direct investment in 2017, accounting for 2.5% of GDP.",
      "• In 2017, Bosnia and Herzegovina ranked 3rd worldwide in the number of new jobs created by foreign investment relative to its population.",
      "• Tourist arrivals in 2017 totaled 1,307,319, marking a 13.7% increase from the previous year.",
      "• Tourist overnight stays numbered 2,677,125, reflecting a 12.3% rise compared to the previous year.",
      "• Approximately 71.5% of tourists visiting Bosnia and Herzegovina in 2017 were from foreign countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:53.616296",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1872,
      "bullet_points_count": 16
    },
    "generated_detailed_content": "In 2017, Bosnia and Herzegovina experienced a significant expansion in its export sector, with exports increasing by 17% compared to the previous year, reaching a total value of €5.65 billion. This growth in exports contributed to an overall increase in the volume of foreign trade, which amounted to €14.97 billion, representing a 14% rise over the previous year. Imports of goods also saw a substantial increase, rising by 12% to total €9.32 billion. The improvement in trade dynamics was further reflected in the coverage of imports by exports, which increased by 3 percentage points from the prior year, reaching 61%, indicating a narrowing trade deficit and enhanced export capacity. The composition of Bosnia and Herzegovina’s exports in 2017 was characterized by a focus on manufactured and processed goods. Key export items included car seats, which underscored the country’s developing automotive supply chain, as well as electricity, processed wood products, aluminium, and furniture. These exports highlighted the country’s industrial diversification and its ability to supply both raw materials and finished goods to international markets. On the import side, the country primarily brought in crude oil, automobiles, motor oil, coal, and briquettes, reflecting its energy needs and the demand for transportation equipment and fuel necessary to support domestic consumption and industrial activity. Despite positive trade developments, the unemployment rate in Bosnia and Herzegovina remained relatively high in 2017, standing at 20.5%. This figure underscored ongoing challenges in the labor market, including structural unemployment and the need for job creation. However, projections from the Vienna Institute for International Economic Studies offered a cautiously optimistic outlook, forecasting a gradual decline in unemployment rates over the subsequent years: 19.4% in 2018, 18.8% in 2019, and 18.3% in 2020. These projections suggested that economic growth and foreign investment could contribute to improved employment conditions in the near future. Fiscal management in 2017 showed progress as well, with Bosnia and Herzegovina’s public debt decreasing by €389.97 million, which equated to a reduction of over 6% compared to the debt level at the end of 2016. By 31 December 2017, the total public debt stood at €5.92 billion, representing 35.6% of the country’s gross domestic product (GDP). This reduction in public debt as a share of GDP indicated efforts to improve fiscal sustainability and manage public finances prudently amid economic expansion. The business environment in Bosnia and Herzegovina also reflected growth, with 32,292 companies registered by the end of 2017. These enterprises collectively generated revenues amounting to €33.572 billion during the year, demonstrating the scale and activity of the private sector. Foreign direct investment (FDI) played a notable role in the economy, with inflows totaling €397.35 million in 2017, equivalent to 2.5% of GDP. This level of FDI indicated increasing international confidence in the country’s economic potential and investment climate. Bosnia and Herzegovina’s success in attracting foreign investment was further illustrated by its global ranking in job creation. In 2017, the country ranked third worldwide in terms of the number of new jobs created by foreign investment relative to its population size. This achievement highlighted the significant impact of foreign enterprises on employment and economic development, contributing to the gradual reduction of unemployment and the diversification of the labor market. Tourism also experienced robust growth in 2017, with total tourist arrivals reaching 1,307,319, marking a 13.7% increase compared to the previous year. This surge in visitor numbers was accompanied by a rise in tourist overnight stays, which totaled 2,677,125, reflecting a 12.3% increase year-on-year. The majority of tourists, approximately 71.5%, were from foreign countries, underscoring Bosnia and Herzegovina’s growing appeal as an international travel destination. The expansion of the tourism sector contributed positively to the country’s service economy and provided additional employment opportunities in related industries.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:46.753332",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 16,
      "generated_content_length": 4247,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.2",
    "section_name": "2018",
    "text": "In 2018, Bosnia and Herzegovina exported goods worth 11.9 billion KM (€6.07\nbillion), which is 7.43% higher than in the same period in 2017, while imports\namounted to 19.27 billion KM (€9.83 billion), which is 5.47% higher.\n\nThe average price of new apartments sold in the country in the first six\nmonths of 2018 is 1,639 km (€886.31) per square meter. This represents a jump\nof 3.5% from the previous year.\n\nOn June 30, 2018, public debt of Bosnia and Herzegovina amounted to about\n€6.04 billion, of which external debt is 70.56 percent, while the internal\ndebt is 29.4 percent of total public indebtedness. The share of public debt in\ngross domestic product was 34.92 percent.\n\nIn 2018, 1,465,412 tourists visited Bosnia-Herzegovina, an increase of 12.1%,\nand had 3,040,190 overnight hotel stays, a 13.5% increase from the previous\nyear. Also, 71.2% of the tourists came from foreign countries.\n\nIn 2018, the total value of mergers and acquisitions in Bosnia and Herzegovina\namounted to €404.6 million.\n\nIn 2018, 99.5 percent of enterprises in Bosnia and Herzegovina used computers\nin their business, while 99.3 percent had internet connections, according to a\nsurvey conducted by the Bosnia and Herzegovina Statistics Agency.\n\nIn 2018, Bosnia and Herzegovina received 783.4 million KM (€400.64 million) in\ndirect foreign investment, which was equivalent to 2.3% of GDP.\n\nIn 2018, the Central Bank of Bosnia and Herzegovina made a profit of 8,430,875\nkm (€4,306,347).",
    "openai_summarised_points": [
      "• In 2018, Bosnia and Herzegovina exported goods valued at 11.9 billion KM (€6.07 billion), representing a 7.43% increase compared to the same period in 2017.",
      "• During the same year, imports totaled 19.27 billion KM (€9.83 billion), marking a 5.47% rise from the previous year.",
      "• The average price of new apartments sold in Bosnia and Herzegovina during the first six months of 2018 was 1,639 KM (€886.31) per square meter, reflecting a 3.5% increase from the previous year.",
      "• As of June 30, 2018, the public debt of Bosnia and Herzegovina was approximately €6.04 billion, with external debt constituting 70.56% and internal debt making up 29.4% of the total public debt.",
      "• The share of public debt in the country's gross domestic product (GDP) was 34.92% in 2018.",
      "• In 2018, the country received 1,465,412 tourists, representing a 12.1% increase from the previous year, and these tourists generated 3,040,190 overnight hotel stays, a 13.5% rise.",
      "• Of the tourists in 2018, 71.2% were from foreign countries.",
      "• The total value of mergers and acquisitions in Bosnia and Herzegovina in 2018 amounted to €404.6 million.",
      "• According to a survey by the Bosnia and Herzegovina Statistics Agency, 99.5% of enterprises used computers in their business operations, and 99.3% had internet connections in 2018.",
      "• Bosnia and Herzegovina attracted €400.64 million (783.4 million KM), equivalent to 2.3% of GDP, in direct foreign investment in 2018.",
      "• The Central Bank of Bosnia and Herzegovina reported a profit of 8,430,875 KM (€4,306,347) in 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:01.806218",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1469,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "In 2018, Bosnia and Herzegovina experienced notable growth in its trade activities, with the export of goods reaching a value of 11.9 billion convertible marks (KM), equivalent to approximately €6.07 billion. This figure represented a significant increase of 7.43% compared to the export values recorded in the same period of the previous year, 2017. The upward trend in exports reflected improvements in various sectors of the economy, including manufacturing and raw materials, which contributed to the country's enhanced trade performance. Concurrently, imports into Bosnia and Herzegovina also rose, totaling 19.27 billion KM (€9.83 billion) during 2018, marking a 5.47% increase from the previous year. This growth in imports indicated a rising domestic demand for foreign goods and services, which, while contributing to the trade deficit, also suggested expanding consumer markets and industrial inputs necessary for economic development. The real estate market in Bosnia and Herzegovina demonstrated moderate growth during the first half of 2018, as evidenced by the average price of new apartments sold. The average price per square meter was recorded at 1,639 KM (€886.31), which constituted a 3.5% increase compared to the prices in the previous year. This rise in housing prices was indicative of increased demand for residential properties, possibly driven by urbanization trends, improved economic conditions, and greater consumer confidence. The real estate sector’s growth also reflected broader economic dynamics, including the availability of financing options and investment interest in the housing market. Public debt levels in Bosnia and Herzegovina as of June 30, 2018, stood at approximately €6.04 billion. The composition of this debt revealed a predominance of external liabilities, which accounted for 70.56% of the total public debt, while internal debt constituted the remaining 29.4%. This distribution underscored the country’s reliance on foreign borrowing to finance its budgetary needs and development projects, a common practice among emerging economies seeking to balance fiscal requirements with limited domestic capital markets. The public debt’s share relative to the gross domestic product (GDP) was 34.92% in 2018, situating Bosnia and Herzegovina within a moderate debt burden range, which policymakers monitored closely to maintain fiscal sustainability and economic stability. Tourism in Bosnia and Herzegovina experienced robust growth in 2018, with the country welcoming a total of 1,465,412 tourists, representing a 12.1% increase over the previous year. This surge in visitor numbers was accompanied by a corresponding rise in overnight stays, which reached 3,040,190 in hotels across the country, marking a 13.5% increase. The tourism sector’s expansion was driven by the country’s rich cultural heritage, natural landscapes, and improved infrastructure, which together enhanced its attractiveness as a travel destination. Notably, a significant majority of tourists, accounting for 71.2%, originated from foreign countries, highlighting Bosnia and Herzegovina’s growing international appeal and its integration into global tourism circuits. The financial landscape of Bosnia and Herzegovina in 2018 was also characterized by considerable activity in mergers and acquisitions (M&A), with the total value of such transactions amounting to €404.6 million. This level of M&A activity indicated a dynamic business environment where companies sought strategic partnerships, expansions, and consolidations to strengthen their market positions. The volume and value of these transactions reflected investor confidence and the ongoing restructuring processes within various sectors of the economy, including manufacturing, services, and finance. Technological adoption among enterprises in Bosnia and Herzegovina was notably high in 2018, according to a survey conducted by the Bosnia and Herzegovina Statistics Agency. The survey revealed that 99.5% of enterprises utilized computers in their business operations, demonstrating widespread integration of digital tools in daily activities. Furthermore, 99.3% of these enterprises had internet connections, underscoring the critical role of connectivity in modern business processes, communication, and access to information. This high level of technological penetration reflected the country’s efforts to modernize its economy and align with global digital trends, thereby enhancing productivity and competitiveness. Foreign direct investment (FDI) inflows into Bosnia and Herzegovina were substantial in 2018, totaling €400.64 million, equivalent to 783.4 million KM. This amount represented approximately 2.3% of the country’s GDP, indicating a significant contribution of FDI to the national economy. The inflows were directed towards various sectors, including manufacturing, services, and infrastructure, providing capital for expansion, technology transfer, and job creation. The level of foreign investment highlighted Bosnia and Herzegovina’s attractiveness to international investors, driven by its strategic location, skilled labor force, and ongoing reforms aimed at improving the business climate. The Central Bank of Bosnia and Herzegovina reported a profit of 8,430,875 KM (€4,306,347) in 2018, reflecting the institution’s stable financial performance during the year. This profit was indicative of effective monetary policy management and operational efficiency within the central banking system. The Central Bank’s positive financial results contributed to maintaining confidence in the country’s monetary framework, supporting currency stability, and facilitating economic growth. The bank’s role remained pivotal in overseeing the banking sector, regulating financial institutions, and ensuring the overall soundness of the financial system in Bosnia and Herzegovina.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:44.016696",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 5876,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.3",
    "section_name": "2019",
    "text": "The World Bank estimates that the economy grew by 2.8% in 2019.\n\nBosnia and Herzegovina was placed 83rd on the Index of Economic Freedom for\n2019. The total rating for Bosnia and Herzegovina is 61.9. This position\nrepresents some progress relative to the 91st place in 2018. This result is\nbelow the regional level, but still above the global average, making Bosnia\nand Herzegovina a \"moderately free\" country.\n\nOn 31 January 2019, total deposits in Bosnian banks were KM 21.9 billion\n(€11.20 billion), which represents 61.15% of nominal GDP.\n\nIn the second quarter of 2019, the average price of new apartments sold in\nBosnia and Herzegovina was 1,606 km (€821.47) per square meter.\n\nIn the first six months of 2019, exports amounted to 5.829 billion KM (€2.98\nbillion), which is 0.1% less than in the same period of 2018, while imports\namounted to 9.779 billion KM (€5.00 billion), which is by 4.5% more than in\nthe same period of the previous year.\n\nIn the first seven months of 2019, 906,788 tourists visited the country, an\n11.7% jump from the previous year.\n\nIn the first six months of 2019, foreign direct investment amounted to 650.1\nmillion KM (€332.34 million).",
    "openai_summarised_points": [
      "• The World Bank estimated that Bosnia and Herzegovina's economy grew by 2.8% in 2019.",
      "• Bosnia and Herzegovina was ranked 83rd on the Index of Economic Freedom for 2019, with an overall score of 61.9.",
      "• This ranking represented an improvement from 91st place in 2018, indicating some progress in economic freedom.",
      "• The country's economic freedom score of 61.9 is below the regional average but remains above the global average, categorizing Bosnia and Herzegovina as a \"moderately free\" economy.",
      "• As of 31 January 2019, total deposits in Bosnian banks reached KM 21.9 billion (€11.20 billion), accounting for 61.15% of the country's nominal GDP.",
      "• In the second quarter of 2019, the average price of newly sold apartments was 1,606 KM (€821.47) per square meter.",
      "• During the first six months of 2019, Bosnia and Herzegovina's exports totaled 5.829 billion KM (€2.98 billion), representing a 0.1% decrease compared to the same period in 2018.",
      "• In the same period, imports amounted to 9.779 billion KM (€5.00 billion), which is a 4.5% increase over the first six months of 2018.",
      "• Tourist arrivals in Bosnia and Herzegovina for the first seven months of 2019 numbered 906,788, marking an 11.7% increase from the previous year.",
      "• Foreign direct investment (FDI) in Bosnia and Herzegovina during the first six months of 2019 was KM 650.1 million (€332.34 million)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:09.491573",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1170,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "In 2019, the World Bank estimated that Bosnia and Herzegovina's economy experienced a growth rate of 2.8%, reflecting a modest yet steady expansion in economic activity. This growth was indicative of gradual improvements in various sectors despite ongoing structural challenges. The country's performance was further contextualized by its standing on the Index of Economic Freedom for that year, where Bosnia and Herzegovina was ranked 83rd globally with an overall score of 61.9. This ranking demonstrated a notable advancement from its 91st place position in 2018, signaling some progress in the implementation of policies conducive to economic freedom, such as regulatory efficiency, rule of law, and open markets. Despite this upward movement, the economic freedom score of 61.9 placed Bosnia and Herzegovina below the average for the broader regional grouping, which includes neighboring countries in Southeast Europe. Nevertheless, the score remained above the global average, categorizing the country as having a \"moderately free\" economy. This classification suggests that while Bosnia and Herzegovina had made strides in improving its business environment and reducing barriers to trade and investment, significant obstacles persisted, including bureaucratic inefficiencies, corruption, and a complex political structure that could hinder further economic liberalization. The banking sector in Bosnia and Herzegovina demonstrated considerable strength as of 31 January 2019, with total deposits in domestic banks reaching 21.9 billion convertible marks (KM), equivalent to approximately €11.20 billion. This figure represented 61.15% of the country's nominal gross domestic product (GDP), underscoring the banking system's substantial role in the national economy and its capacity to mobilize domestic savings. The high level of deposits relative to GDP also indicated a degree of financial stability and public confidence in the banking institutions, which is crucial for supporting credit expansion and investment. In the real estate market, data from the second quarter of 2019 revealed that the average price of newly sold apartments stood at 1,606 KM per square meter, which equated to about €821.47. This pricing reflected the ongoing demand for residential properties in urban centers, driven by factors such as population growth, urbanization, and increasing disposable incomes in certain segments of the population. The apartment price levels also highlighted regional disparities within the country, with higher prices typically observed in major cities like Sarajevo and Banja Luka, where economic activity and employment opportunities are concentrated. Trade dynamics in the first half of 2019 showed a slight contraction in exports, which totaled 5.829 billion KM (€2.98 billion), representing a 0.1% decrease compared to the same period in 2018. This marginal decline suggested challenges in maintaining export growth, potentially due to external factors such as fluctuating demand in key markets or competition from other regional exporters. Conversely, imports rose by 4.5% during the same period, reaching 9.779 billion KM (€5.00 billion). The increase in imports indicated a growing domestic demand for goods and services, possibly fueled by consumer spending and investment activities, but also contributed to a widening trade deficit, which remained a persistent issue for the country's external balance. Tourism emerged as a bright spot in Bosnia and Herzegovina's economy during 2019, with tourist arrivals totaling 906,788 in the first seven months of the year. This figure marked an 11.7% increase over the previous year's corresponding period, reflecting the country's growing appeal as a travel destination. The rise in tourist numbers was attributed to factors such as improved infrastructure, increased international marketing efforts, and the country's rich cultural heritage and natural attractions. Tourism's expansion contributed positively to employment and income generation, particularly in regions with significant historical sites and natural beauty. Foreign direct investment (FDI) inflows into Bosnia and Herzegovina during the first six months of 2019 amounted to 650.1 million KM (€332.34 million). This level of investment signaled a moderate degree of confidence among international investors in the country's economic prospects. FDI was directed toward various sectors, including manufacturing, energy, and services, reflecting ongoing efforts to diversify the economy and integrate more fully into regional and global value chains. However, challenges such as political uncertainty, regulatory complexity, and infrastructure deficits continued to temper the pace and scale of foreign investment.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:44.608454",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 4749,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.4",
    "section_name": "2020–2022",
    "text": "2020 saw a contraction in the economy of around 4.7%, caused by the COVID-19\npandemic, with increased costs by the government, before bouncing back in\n2021. Employment rates have been climbing, however youth unemployment in 2022\nwas still over 33%.",
    "openai_summarised_points": [
      "• In 2020, the economy of Bosnia and Herzegovina contracted by approximately 4.7%, primarily due to the impacts of the COVID-19 pandemic.",
      "• The contraction was associated with increased government expenditures aimed at mitigating the economic effects of the pandemic.",
      "• Following the downturn in 2020, the economy experienced a recovery and rebounded in 2021.",
      "• During the period from 2020 to 2022, employment rates in Bosnia and Herzegovina showed an upward trend, indicating improvements in the labor market.",
      "• Despite overall employment growth, youth unemployment remained high in 2022, exceeding 33%, highlighting persistent challenges in youth employment opportunities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:12.249386",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 248,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "In 2020, the economy of Bosnia and Herzegovina experienced a significant contraction, shrinking by approximately 4.7%. This downturn was largely attributable to the widespread impacts of the COVID-19 pandemic, which disrupted economic activities across various sectors. The pandemic led to reduced domestic consumption, interruptions in supply chains, and a decline in both domestic and international demand, all of which contributed to the overall economic decline. In response to these challenges, the government of Bosnia and Herzegovina implemented increased expenditures aimed at mitigating the negative effects of the pandemic on the economy. These fiscal measures included support packages for businesses, social welfare programs to assist vulnerable populations, and investments in healthcare infrastructure to manage the public health crisis. The rise in government spending, while necessary to cushion the economic blow, also placed additional strain on public finances during this period of contraction. Following the economic downturn in 2020, Bosnia and Herzegovina’s economy began to recover in 2021, reflecting a broader global trend of economic rebound as pandemic-related restrictions eased and economic activities resumed. This recovery was characterized by a gradual increase in industrial production, revitalization of the service sector, and a rebound in export activities, all contributing to renewed economic growth. The recovery phase also benefited from ongoing government support measures and the adaptation of businesses to new operating conditions, including the adoption of digital technologies and remote working arrangements. The positive momentum in 2021 helped to restore confidence among investors and consumers, which was crucial for sustaining the economic upswing. Throughout the period from 2020 to 2022, employment rates in Bosnia and Herzegovina demonstrated an upward trend, signaling improvements in the labor market despite the initial shock caused by the pandemic. This increase in employment was supported by the gradual reopening of businesses and the revival of economic sectors that had been severely affected in 2020. Additionally, government initiatives aimed at stimulating job creation and supporting workforce reintegration played a role in enhancing employment opportunities. The labor market's resilience during this period was also reflected in the stabilization of unemployment rates after the spike experienced in 2020. However, while overall employment figures improved, certain demographic groups continued to face significant challenges. One of the most persistent issues during this period was the high rate of youth unemployment, which remained a critical concern in 2022. Despite the general growth in employment, the unemployment rate among young people exceeded 33%, indicating that a substantial portion of the youth population struggled to find stable employment. This high level of youth unemployment underscored ongoing structural problems in the labor market, such as a mismatch between the skills possessed by young job seekers and the demands of employers, limited access to vocational training, and insufficient opportunities for work experience and internships. The situation was further compounded by the economic uncertainties brought about by the pandemic, which disproportionately affected entry-level positions and sectors that typically employ younger workers. Addressing youth unemployment remained a priority for policymakers, as it posed long-term risks to social cohesion and economic development in Bosnia and Herzegovina.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:55.252153",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 3608,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.5",
    "section_name": "2023",
    "text": "As of 30 November 2023, Bosnia and Herzegovina had 1.3 million registered\nmotor vehicles.",
    "openai_summarised_points": [
      "• As of 30 November 2023, Bosnia and Herzegovina had a total of 1.3 million registered motor vehicles."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:13.781413",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 89,
      "bullet_points_count": 1
    },
    "generated_detailed_content": "As of 30 November 2023, Bosnia and Herzegovina had a total of 1.3 million registered motor vehicles, reflecting the country's growing reliance on automotive transportation for both personal and commercial purposes. This figure includes a diverse range of vehicles such as passenger cars, trucks, motorcycles, and buses, which collectively serve the mobility needs of the population across urban and rural areas. The steady increase in vehicle registrations over recent years can be attributed to economic recovery trends and improvements in disposable incomes, enabling more households to afford private vehicles. Additionally, the expansion of road infrastructure and cross-border trade within the region has further stimulated demand for commercial vehicles, supporting logistics and distribution networks. The vehicle registration data also highlights the challenges faced by Bosnia and Herzegovina in terms of traffic management, environmental impact, and road safety, prompting ongoing governmental efforts to modernize transportation policies and promote sustainable mobility solutions. Overall, the total number of registered motor vehicles serves as an important indicator of the country's economic development and the evolving dynamics of its transportation sector in 2023.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:47.366965",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 1,
      "generated_content_length": 1282,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Sarajevo",
    "text": "ARIA shopping and business center, also the headquarters of Al Jazeera Balkans\n\nSarajevo industries now include tobacco products, furniture, hosiery,\nautomobiles, and communication equipment. Companies based in Sarajevo include\nBH Telecom, Bosnalijek, Energopetrol, FlyBosnia, Sarajevo Tobacco Factory, and\nSarajevska Pivara (Sarajevo Brewery).\n\nSarajevo has a strong tourist industry and was named by Lonely Planet one of\nthe top 50 \"Best Cities in the World\" in 2006. Sports-related tourism uses the\nlegacy facilities of the 1984 Winter Olympics, especially the skiing\nfacilities on the nearby mountains of Bjelašnica, Igman, Jahorina, Trebević,\nand Treskavica. Sarajevo's 600 years of history, influenced by both Western\nand Eastern empires, is also a strong tourist attraction. Sarajevo has hosted\ntravellers for centuries, because it was an important trading center during\nthe Ottoman and Austria-Hungarian empires.\n\nToday, Sarajevo is one of the fastest developing cities in the region. Various\nnew modern buildings have been built, most significantly the Bosmal City\nCenter, ARIA Centar and the Avaz Twist Tower, which is one of the tallest\nskyscraper in the Balkans. A new highway was recently (2006–2011) completed\nbetween Sarajevo and the city of Kakanj. Due to growth in population, tourism\nand airport traffic the service sector in the city is developing fast and\nwelcoming new investors from various businesses.\n\nSarajevo has one of the most representable commercial infrastructures in\nSouth-East Europe. The Sarajevo City Center is one of the biggest shopping\ncentres in South-East Europe, after its completion in 2014. Airport Center\nSarajevo which will be connected directly to the new airport terminal will\noffer a great variety of brands, products and services.\n\nIn 1981, Sarajevo's GDP per capita was 133% of the Yugoslav average.\n\nIn 2011, Sarajevo's GDP was estimated to be 16.76 billion US$ by the Central\nBank of Bosnia and Herzegovina, comprising 37% of the total GDP of the\ncountry.",
    "openai_summarised_points": [
      "• The ARIA shopping and business center in Sarajevo also serves as the headquarters of Al Jazeera Balkans.",
      "• Sarajevo's industries encompass tobacco products, furniture manufacturing, hosiery, automobile production, and communication equipment.",
      "• Prominent companies based in Sarajevo include BH Telecom, Bosnalijek (a pharmaceutical company), Energopetrol (a petroleum company), FlyBosnia (an airline), Sarajevo Tobacco Factory, and Sarajevska Pivara (Sarajevo Brewery).",
      "• The city has a strong tourism sector, recognized by Lonely Planet in 2006 as one of the top 50 \"Best Cities in the World.\"",
      "• Sarajevo's sports tourism leverages legacy facilities from the 1984 Winter Olympics, notably skiing facilities on nearby mountains such as Bjelašnica, Igman, Jahorina, Trebević, and Treskavica.",
      "• The city’s 600-year history, influenced by both Western and Eastern empires, is a significant tourist attraction.",
      "• Historically, Sarajevo has been an important trading hub during the Ottoman and Austria-Hungarian empires, attracting travelers for centuries.",
      "• Currently, Sarajevo is among the fastest developing cities in the region, with notable modern constructions including the Bosmal City Center, ARIA Centar, and the Avaz Twist Tower, the latter being one of the tallest skyscrapers in the Balkans.",
      "• A new highway connecting Sarajevo and Kakanj was completed between 2006 and 2011, facilitating transportation and economic growth.",
      "• The city’s service sector is rapidly expanding due to population growth, increased tourism, and airport traffic, attracting new business investments.",
      "• Sarajevo boasts one of the most advanced commercial infrastructures in Southeast Europe, with the Sarajevo City Center, completed in 2014, being one of the largest shopping centers in the region.",
      "• The Airport Center Sarajevo, which will be directly connected to the new airport terminal, offers a wide variety of brands, products, and services.",
      "• In 1981, Sarajevo's GDP per capita was 133% of the Yugoslav average.",
      "• In 2011, Sarajevo's GDP was estimated at 16.76 billion US dollars, representing 37% of Bosnia and Herzegovina's total GDP, according to the Central Bank of Bosnia and Herzegovina."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:20.026390",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2007,
      "bullet_points_count": 14
    },
    "generated_detailed_content": "The ARIA shopping and business center in Sarajevo functions not only as a commercial hub but also as the headquarters of Al Jazeera Balkans, a prominent regional news network. This dual role underscores the center’s significance in both economic and media landscapes within the city. Sarajevo’s industrial sector is diverse, encompassing the production of tobacco products, furniture manufacturing, hosiery, automobile assembly, and communication equipment. These industries reflect a blend of traditional craftsmanship and modern manufacturing techniques, contributing substantially to the local economy and employment. Several major companies are headquartered in Sarajevo, highlighting the city’s role as an economic powerhouse in Bosnia and Herzegovina. BH Telecom stands as a leading telecommunications provider, while Bosnalijek, a pharmaceutical company, plays a crucial role in the healthcare and pharmaceutical sectors. Energopetrol, a petroleum company, is integral to the country’s energy infrastructure. The airline FlyBosnia represents the city’s growing aviation industry. Additionally, the Sarajevo Tobacco Factory and Sarajevska Pivara (Sarajevo Brewery) are historic enterprises that have long contributed to the city’s industrial and cultural heritage. Tourism constitutes a vital component of Sarajevo’s economy, with the city earning international recognition for its appeal. In 2006, the travel guide publisher Lonely Planet included Sarajevo among the top 50 \"Best Cities in the World,\" a testament to its cultural richness, historical significance, and natural beauty. The city’s sports tourism is particularly notable due to its legacy from the 1984 Winter Olympics, which left behind extensive sporting infrastructure. Skiing facilities on the nearby mountains of Bjelašnica, Igman, Jahorina, Trebević, and Treskavica continue to attract winter sports enthusiasts, providing year-round opportunities for recreation and competition. Sarajevo’s appeal to tourists is further enhanced by its 600-year history, which reflects a unique confluence of Western and Eastern influences. The city’s architecture, cultural traditions, and historical sites bear the marks of both the Ottoman and Austria-Hungarian empires, offering visitors a rich tapestry of heritage to explore. Historically, Sarajevo served as an important trading hub during these imperial periods, drawing merchants, travelers, and settlers from across the region. This longstanding role as a crossroads of commerce and culture has shaped the city’s identity and economic development over the centuries. In contemporary times, Sarajevo has emerged as one of the fastest developing cities in the Western Balkans. This rapid growth is visible in its modern skyline, punctuated by notable constructions such as the Bosmal City Center, ARIA Centar, and the Avaz Twist Tower. The Avaz Twist Tower, in particular, stands out as one of the tallest skyscrapers in the Balkans, symbolizing the city’s aspirations and economic vitality. Between 2006 and 2011, a new highway connecting Sarajevo and Kakanj was completed, significantly improving transportation infrastructure. This development has facilitated economic growth by enhancing connectivity and reducing travel times between key urban centers. The service sector in Sarajevo has experienced rapid expansion, driven by factors such as population growth, increased tourism, and rising airport traffic. This growth has attracted new business investments, further diversifying the city’s economic base. Sarajevo boasts one of the most advanced commercial infrastructures in Southeast Europe, exemplified by the Sarajevo City Center. Completed in 2014, this shopping complex ranks among the largest in the region, offering a wide array of retail, dining, and entertainment options. Complementing this is the Airport Center Sarajevo, which is planned to be directly connected to the new airport terminal. This center will provide a broad selection of brands, products, and services, enhancing the city’s commercial appeal to both residents and visitors. Historically, Sarajevo’s economic performance has been strong relative to its regional peers. In 1981, the city’s GDP per capita was recorded at 133% of the Yugoslav average, reflecting its status as a prosperous urban center within the former federation. More recently, in 2011, Sarajevo’s GDP was estimated at 16.76 billion US dollars, accounting for 37% of Bosnia and Herzegovina’s total GDP according to data from the Central Bank of Bosnia and Herzegovina. This concentration of economic activity underscores Sarajevo’s role as the country’s primary economic engine, driving development and growth across multiple sectors.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:10:59.255035",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 14,
      "generated_content_length": 4708,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Mostar",
    "text": "The construction of the largest trade center in Herzegovina – \"Brodomerkur\"\n\nMostar's economy relies heavily on tourism, aluminium and metal industry,\nbanking services and telecommunication sector. The city is the seat of some of\nthe country's largest corporations.\n\nAlong with Sarajevo, it is the largest financial center in Bosnia and\nHerzegovina, with two out of three largest banks in the country having their\nheadquarters in Mostar. Bosnia-Herzegovina has three national electric, postal\nand telecommunication service corporations; These three companies banks and\nthe aluminium factory make a vast portion of overall economic activity in the\ncity.\n\nAluminij is one of the most influential companies in the city, region, but\nalso country. In relation to the current manufacturing capacity it generates\nan annual export of more than €150 million. The partners with which the\nAluminij does business are renowned global companies, from which the most\nimportant are: Venture Coke Company L.L.C. (Venco-Conoco joint Venture) from\nthe US, Glencore International AG from Switzerland, Debis International\ntrading GmbH, Daimler-Chrysler and VAW Aluminium Technologie GmbH from\nGermany, Hydro ASA from Norway, Fiat from Italy, and TLM-Šibenik from\nCroatia[5]. Mostar area alone receives an income of €40 million annually from\nAluminij.",
    "openai_summarised_points": [
      "• The construction of the largest trade center in Herzegovina, \"Brodomerkur,\" is a significant development in Mostar's economy.",
      "• Mostar's economy is predominantly based on tourism, the aluminium and metal industries, banking services, and the telecommunication sector.",
      "• The city hosts some of the largest corporations in Bosnia and Herzegovina, highlighting its economic importance.",
      "• Along with Sarajevo, Mostar is the second-largest financial center in Bosnia and Herzegovina, with two out of the three largest banks in the country headquartered there.",
      "• Bosnia and Herzegovina has three major national corporations providing electric, postal, and telecommunication services; these, along with banks and the aluminium factory, constitute a substantial portion of the city's overall economic activity.",
      "• Aluminij is one of the most influential companies in Mostar, the region, and the country, playing a key role in the local economy.",
      "• Aluminij generates an annual export value exceeding €150 million, reflecting its significant manufacturing capacity.",
      "• The company's international partners include renowned global corporations such as Venture Coke Company L.L.C. (Venco-Conoco joint venture) from the US, Glencore International AG from Switzerland, Debis International Trading GmbH, Daimler-Chrysler, and VAW Aluminium Technologie GmbH from Germany, Hydro ASA from Norway, Fiat from Italy, and TLM-Šibenik from Croatia.",
      "• Mostar area benefits economically from Aluminij, receiving approximately €40 million annually in income derived from the company's operations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:25.676594",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1329,
      "bullet_points_count": 9
    },
    "generated_detailed_content": "The construction of Brodomerkur, the largest trade center in Herzegovina, marked a significant milestone in the economic development of Mostar. This expansive commercial complex was designed to serve as a central hub for trade and commerce, facilitating both local business activities and regional economic integration. By providing modern retail spaces, office facilities, and logistical support, Brodomerkur attracted a variety of enterprises and investors, thereby enhancing the city's commercial infrastructure. Its establishment not only created numerous employment opportunities but also contributed to the diversification and modernization of Mostar's economy, positioning the city as a key player in Herzegovina’s trade sector. Mostar’s economy has traditionally been multifaceted, with several key sectors underpinning its financial stability and growth. Tourism stands out as a predominant pillar, capitalizing on the city's rich cultural heritage, historic architecture, and scenic landscapes that draw visitors from across the globe. Alongside tourism, the aluminium and metal industries have played a crucial role in shaping the industrial landscape of Mostar. These sectors have benefited from the region’s natural resources and skilled workforce, fostering a robust manufacturing base. Banking services have also become increasingly important, reflecting the city’s role as a financial hub, while the telecommunication sector has expanded rapidly in recent decades, driven by technological advancements and growing demand for digital connectivity. Together, these industries form a diversified economic foundation that supports Mostar’s continued development. Mostar hosts some of the largest corporations in Bosnia and Herzegovina, underscoring its economic significance within the national context. These companies span various industries, including manufacturing, finance, and services, and their presence in the city highlights Mostar’s capacity to attract and sustain major business operations. The concentration of such corporations not only boosts local employment but also stimulates ancillary sectors such as logistics, retail, and professional services. This corporate presence has helped Mostar maintain a competitive edge in the country’s economic landscape, fostering innovation and investment that contribute to regional prosperity. In terms of financial services, Mostar ranks as the second-largest financial center in Bosnia and Herzegovina, trailing only the capital, Sarajevo. This status is reinforced by the fact that two of the three largest banks in the country have their headquarters in Mostar. These financial institutions play a pivotal role in the national banking system, offering a wide range of services including retail banking, corporate finance, and investment management. Their operations facilitate capital flow, credit availability, and economic growth not only within Mostar but across the entire country. The prominence of these banks also reflects the city’s strategic importance as a financial hub, attracting both domestic and international investors. Bosnia and Herzegovina’s national infrastructure is supported by three major corporations responsible for electric, postal, and telecommunication services, all of which have a significant presence in Mostar. These entities form the backbone of essential public utilities and communication networks, ensuring the delivery of critical services to residents and businesses alike. Alongside these national corporations, the banking sector and the aluminium factory constitute a substantial portion of Mostar’s overall economic activity. The synergy between these sectors creates a dynamic economic environment, where industrial production, financial services, and infrastructure development mutually reinforce each other, driving sustained growth and modernization within the city. Among the industrial enterprises in Mostar, Aluminij stands out as one of the most influential companies, not only within the city but also across the region and the country. Established as a key player in the aluminium production industry, Aluminij has contributed significantly to the local economy by providing employment, fostering technological innovation, and generating substantial export revenues. Its operations have positioned Mostar as a critical node in the global aluminium supply chain, attracting partnerships and investments that have further enhanced the company’s capabilities. Aluminij’s impact extends beyond economics, as it also plays a role in community development and regional industrial policy. Aluminij’s manufacturing capacity is reflected in its impressive annual export value, which exceeds €150 million. This substantial figure underscores the company’s role as a major exporter and a vital contributor to Bosnia and Herzegovina’s trade balance. The high export volume indicates a strong production output and a competitive position in international markets, where Aluminij’s products are in demand for various industrial applications. The company’s export performance not only generates significant foreign exchange earnings but also supports a wide network of suppliers, distributors, and service providers, amplifying its economic footprint within Mostar and beyond. The company’s international partnerships further highlight its global integration and strategic importance. Aluminij collaborates with renowned corporations from various countries, including Venture Coke Company L.L.C., a joint venture between Venco and Conoco from the United States, which supplies essential raw materials for aluminium production. Swiss-based Glencore International AG is another key partner, providing expertise and market access in commodity trading. German firms such as Debis International Trading GmbH, Daimler-Chrysler, and VAW Aluminium Technologie GmbH contribute technological know-how, industrial equipment, and automotive industry connections. Norwegian Hydro ASA brings additional aluminium industry expertise, while Italian automotive giant Fiat and Croatian company TLM-Šibenik represent important regional collaborators. These partnerships enable Aluminij to maintain high production standards, innovate continuously, and expand its market reach, reinforcing Mostar’s position in the global industrial network. The economic benefits of Aluminij’s operations extend directly to the Mostar area, which receives approximately €40 million annually in income derived from the company’s activities. This income supports local government budgets, infrastructure projects, and social programs, contributing to the overall quality of life in the region. The financial inflows generated by Aluminij also stimulate secondary economic activities, including retail, construction, and services, creating a multiplier effect that enhances economic resilience. By anchoring the local economy, Aluminij plays a vital role in sustaining Mostar’s economic vitality and supporting its long-term development goals.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:03.142585",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 9,
      "generated_content_length": 7014,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Prijedor",
    "text": "Prijedor regional location.\n\nPrijedor is the sixth largest city in Bosnia and Herzegovina. It is an\neconomically prosperous municipality hosting a wide range of industries,\nservices and educational institutions. The city's geographical location close\nto major European capitals has made it an important industrial and commercial\nhub nationally. It has a developed financial sector, 11 international banks\nare represented, 5 microcredit organizations and a foundation for development.\nThe city's huge economic potential is in the strategic geographical location\nbeing close to Zagreb, Belgrade, Budapest and Vienna. Giving it one of the\nbest climates for economic expansion in Bosnia and Herzegovina.\n\nThe agricultural land around the city, raw minerals in the municipality and\ngrowth of high educated population in the city proper gives it a unique\ncombination of both being able to produce sophisticated industrial products,\nfood and service branches.\n\nCompanies\n\nZenica host today the Bosnian part of ArcelorMittal Steel Company, former RMK\nZenica, which employ about 3000 workers, steel company from Luxembourg with\nover 320,000 employees in more than 60 countries. It also has companies\nspecialized in the chemical industry such as Ferrox a.d., producing iron\noxides-pigments. BosnaMontaza AD., one of Bosnias most specialized steel\nmanufacturers, manufacturing: steel construction, pipelines, reservoirs,\ntechnological equipment, cranes and energy plants. Other companies such as the\nCroatian food company Kraš has one of its biggest facilities in Bosnia and\nHerzegovina in Prijedor, producing confectionery products under the brand\nnames MIRA and Kraš. Brand names such as \"Prijedorčanka\" is one of the leading\nproducers of the alcoholic beverage Rakija in Bosnia and Herzegovina. Prijedor\nis also a big enterprise producing cellulose and paper for export.\n\nIn 2022, the sector with the highest number of companies registered in Bosnia\nand Herzegovina is Services with 39,707 companies followed by Retail Trade and\nWholesale Trade with 12,060 and 11,970 companies respectively.\n\nAgricultural sector\n\nLake Saničani fish farm\n\nAmong this Prijedor has a fruit growing production, gardening production, crop\nfarming production, mill and bakery industries, stock farming production,\nprocessing industries and a milk industry.\n\nLake Saničani, near Prijedor, is one of the biggest commercial fish-farming\nlakes in the southern Europe.\n\nPrijedor municipality takes up 8340.6 hectares (5845.0 private property and\n2495.6 state property). Plowed fields and gardens take up 340.26 hectares,\norchards 23.86 hectares and vineyards 5 hectares. All cultivated soil takes up\n402.06 hectares.\n\nService sector\n\nThe service sector in Prijedor is growing rapidly and this reflects in the\ngrowth of hotels, stores, roads, educational facilities and shoppings centers\nthat are being built in the city. Making it a growing commercial hub in Bosnia\nand Hercegovina.",
    "openai_summarised_points": [
      "• Prijedor is the sixth largest city in Bosnia and Herzegovina, recognized for its economic prosperity and diverse industrial, service, and educational sectors.",
      "• Its geographical location near major European capitals—Zagreb, Belgrade, Budapest, and Vienna—has established it as a significant industrial and commercial hub at the national level.",
      "• The city features a well-developed financial sector, with 11 international banks operating within its territory, alongside 5 microcredit organizations and a development foundation.",
      "• Prijedor's strategic position and favorable climate contribute to its substantial economic potential and prospects for expansion within Bosnia and Herzegovina.",
      "• The surrounding agricultural land, local raw mineral resources, and a growing highly educated population enable the city to produce both sophisticated industrial products and food and service industry outputs.",
      "• The city hosts the Bosnian branch of ArcelorMittal Steel Company (formerly RMK Zenica), which employs approximately 3,000 workers; ArcelorMittal is a Luxembourg-based steel corporation with over 320,000 employees across more than 60 countries.",
      "• Other notable companies include Ferrox a.d., specializing in the production of iron oxides-pigments for the chemical industry; BosnaMontaza AD., a leading steel manufacturer producing steel constructions, pipelines, reservoirs, technological equipment, cranes, and energy plants.",
      "• The Croatian food company Kraš operates one of its largest facilities in Prijedor, producing confectionery products under the brands MIRA and Kraš.",
      "• The brand \"Prijedorčanka\" is a prominent producer of Rakija, an alcoholic beverage, in Bosnia and Herzegovina.",
      "• Prijedor also has a significant enterprise involved in the production of cellulose and paper for export.",
      "• In 2022, the services sector was the most extensive in Bosnia and Herzegovina, with 39,707 registered companies, followed by retail trade with 12,060 companies and wholesale trade with 11,970 companies.",
      "• The agricultural sector in Prijedor includes fruit growing, gardening, crop farming, mill and bakery industries, stock farming, processing industries, and a milk industry.",
      "• Lake Saničani, located near Prijedor, is one of the largest commercial fish-farming lakes in southern Europe.",
      "• The Prijedor municipality covers an area of 8,340.6 hectares, with 5,845 hectares privately owned and 2,495.6 hectares under state ownership.",
      "• Agricultural land use includes 340.26 hectares of plowed fields and gardens, 23.86 hectares of orchards, and 5 hectares of vineyards, totaling 402.06 hectares of cultivated soil.",
      "• The service sector in Prijedor is experiencing rapid growth, evidenced by the development of hotels, retail stores, roads, educational facilities, and shopping centers, positioning it as an expanding commercial hub within Bosnia and Herzegovina."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:33.097020",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2947,
      "bullet_points_count": 16
    },
    "generated_detailed_content": "Prijedor ranks as the sixth largest city in Bosnia and Herzegovina, distinguished by its economic prosperity and a multifaceted economy encompassing industrial, service, and educational sectors. The city’s economic landscape is characterized by a diverse industrial base, complemented by a vibrant service sector and a growing educational infrastructure that supports workforce development and innovation. Its economic vitality is reflected in the presence of numerous enterprises and institutions that contribute to both local employment and the broader regional economy. Strategically situated near several major European capitals—namely Zagreb, Belgrade, Budapest, and Vienna—Prijedor benefits from its advantageous geographical position, which has established it as a significant industrial and commercial hub at the national level. This proximity to important urban centers facilitates trade, investment, and logistical connections, enabling Prijedor to serve as a critical node in regional supply chains and economic networks. The city’s location enhances its accessibility to markets across Central and Southeastern Europe, fostering opportunities for export-oriented industries and attracting foreign direct investment. The financial sector in Prijedor is notably well-developed, hosting eleven international banks that operate within its jurisdiction. This robust banking presence provides a wide range of financial services to businesses and individuals, supporting economic activities through credit provision, investment facilitation, and financial management. In addition to these banks, the city is home to five microcredit organizations that play a crucial role in financing small and medium-sized enterprises (SMEs), thereby stimulating entrepreneurship and local economic growth. Complementing these financial institutions is a development foundation that focuses on fostering sustainable economic development and supporting innovative projects, further enhancing the city’s financial ecosystem. Prijedor’s strategic position is complemented by a favorable climate, both of which contribute significantly to its substantial economic potential and prospects for expansion within Bosnia and Herzegovina. The city’s climate supports agricultural productivity, while its location ensures ease of access to transportation corridors and markets. These factors collectively create a conducive environment for industrial diversification and service sector growth. The combination of geographical advantages and climatic conditions positions Prijedor as a promising center for future economic development and investment. The surrounding region of Prijedor is endowed with fertile agricultural land and abundant local raw mineral resources, which, together with a growing population of highly educated individuals, enable the city to produce a wide range of sophisticated industrial products as well as outputs in the food and service industries. The availability of raw materials such as minerals supports heavy industry and manufacturing, while the agricultural sector benefits from arable land suitable for diverse crops and livestock. The presence of a skilled workforce, nurtured by local educational institutions, facilitates the production of high-quality goods and services, enhancing the city’s competitive advantage in both domestic and export markets. A key industrial presence in Prijedor is the Bosnian branch of the ArcelorMittal Steel Company, formerly known as RMK Zenica. This facility employs approximately 3,000 workers, making it one of the city’s largest employers and a cornerstone of its industrial sector. ArcelorMittal, headquartered in Luxembourg, is a global steel corporation with a workforce exceeding 320,000 employees across more than 60 countries. The company’s operations in Prijedor contribute significantly to the local economy through job creation, technology transfer, and integration into global steel production networks. The facility’s output plays a vital role in supplying steel products for both domestic consumption and export. Other notable industrial enterprises in Prijedor include Ferrox a.d., which specializes in the production of iron oxides-pigments used in the chemical industry. Ferrox a.d. is recognized for its role in supplying essential raw materials for various industrial applications, contributing to the chemical manufacturing sector’s development. Additionally, BosnaMontaza AD. stands out as a leading steel manufacturer in the region, producing a diverse array of products such as steel constructions, pipelines, reservoirs, technological equipment, cranes, and energy plants. The company’s broad product portfolio and advanced manufacturing capabilities underscore Prijedor’s importance as a center for heavy industry and engineering. The food industry in Prijedor is exemplified by the presence of the Croatian company Kraš, which operates one of its largest production facilities in the city. This facility focuses on manufacturing confectionery products under well-known brands such as MIRA and Kraš. The operation not only provides employment opportunities but also contributes to the diversification of the local economy by integrating food production with regional and international markets. The presence of such a major food producer highlights Prijedor’s capacity to support large-scale manufacturing in the consumer goods sector. In the realm of traditional beverages, the brand \"Prijedorčanka\" holds prominence as a leading producer of Rakija, a popular alcoholic beverage in Bosnia and Herzegovina. The brand’s reputation is built on the quality and cultural significance of its products, which are widely consumed both locally and nationally. The production of Rakija under the Prijedorčanka label contributes to the preservation of local heritage and supports the agricultural sector through the use of locally sourced fruits and ingredients. Prijedor also hosts a significant enterprise engaged in the production of cellulose and paper, primarily for export markets. This industry leverages the region’s natural resources and manufacturing capabilities to produce high-quality paper products, contributing to the city’s export portfolio and industrial diversification. The cellulose and paper production facility exemplifies the integration of resource-based industries with global trade networks, enhancing Prijedor’s economic resilience. In 2022, the services sector emerged as the most extensive in Bosnia and Herzegovina, with a total of 39,707 registered companies nationwide. Within this context, retail trade accounted for 12,060 companies, while wholesale trade comprised 11,970 companies, indicating a robust commercial environment. Prijedor’s service sector reflects these national trends, with a growing number of enterprises engaged in various service activities. The expansion of services supports the city’s economic diversification and provides essential support to both industrial and consumer markets. The agricultural sector in Prijedor encompasses a wide range of activities, including fruit growing, gardening, crop farming, mill and bakery industries, stock farming, processing industries, and a milk industry. This diversity reflects the region’s rich agricultural heritage and the adaptability of its farming practices. Fruit growing and gardening benefit from favorable climatic conditions, while crop farming utilizes fertile soils to produce staple and specialty crops. The presence of mill and bakery industries indicates vertical integration within the agricultural value chain, adding value to raw agricultural products. Stock farming and milk production contribute to the supply of animal products for local consumption and processing. Lake Saničani, located in close proximity to Prijedor, is recognized as one of the largest commercial fish-farming lakes in southern Europe. The lake’s extensive aquaculture operations play a significant role in the local economy by providing fish products for regional markets and supporting related industries. The scale and productivity of Lake Saničani highlight the importance of aquaculture as a complementary sector to traditional agriculture and industry in the Prijedor area. The municipality of Prijedor encompasses an area of 8,340.6 hectares, of which 5,845 hectares are privately owned while 2,495.6 hectares remain under state ownership. This division of land ownership reflects the post-socialist transition in land tenure and the balance between private enterprise and public management. The availability of substantial private agricultural land supports individual and commercial farming activities, while state-owned land may be utilized for public purposes, infrastructure, or managed agricultural enterprises. Within the municipality, agricultural land use includes 340.26 hectares dedicated to plowed fields and gardens, 23.86 hectares allocated to orchards, and 5 hectares planted with vineyards, amounting to a total of 402.06 hectares of cultivated soil. This cultivated area demonstrates the focus on both arable farming and horticulture, with orchards and vineyards contributing to the diversification of agricultural production. The relatively modest vineyard area suggests potential for growth in viticulture, while the extent of plowed fields and gardens supports staple crop and vegetable production. The service sector in Prijedor is undergoing rapid growth, as evidenced by the development of hotels, retail stores, roads, educational facilities, and shopping centers. This expansion reflects increasing demand for commercial and social infrastructure, driven by rising population needs and economic activity. The growth of hospitality services, retail outlets, and improved transportation infrastructure enhances the city’s attractiveness to investors, tourists, and residents alike. Educational institutions are also expanding, supporting workforce development and innovation. Collectively, these developments position Prijedor as an emerging commercial hub within Bosnia and Herzegovina, capable of supporting sustained economic growth and diversification.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:02.788492",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 16,
      "generated_content_length": 10144,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Banja Luka",
    "text": "Banja Luka west transit\n\nAlthough the city itself was not directly affected by the Bosnian War in the\nearly 1990s, its economy was. For four years, Banja Luka fell behind the world\nin key areas such as technology, resulting in a rather stagnant economy.\nHowever, in recent years, the financial services sector has gained in\nimportance in the city. In 2002, the trading began on the newly established\nBanja Luka Stock Exchange. The number of companies listed, the trading volume\nand the number of investors have increased significantly. A number of big\ncompanies such as Telekom Srpske, Rafinerija ulja Modriča, Banjalučka Pivara\nand Vitaminka are all listed on the exchange and are traded regularly.\nInvestors, apart from those from Slovenia, Croatia and Serbia, now include a\nnumber of investment funds from the European Union, Norway, the United States,\nJapan and China.\n\nA number of financial services regulators, such as the Indirect Taxation\nAuthority of Bosnia and Herzegovina, Republika Srpska Securities Commission\nand the RS Banking Agency are headquartered in Banja Luka. This, along with\nthe fact that some of the major banks in Bosnia, the Deposit Insurance Agency\nand the Value-added tax (VAT) Authority are all based in the city, has helped\nBanja Luka establish itself as a major financial centre of the country.\n\nIn 1981 Banja Luka's GDP per capita was 97% of the Yugoslav average.",
    "openai_summarised_points": [
      "• Although Banja Luka was not directly affected by the Bosnian War in the early 1990s, its economy experienced significant setbacks during that period.",
      "• For four years, the city fell behind global technological advancements, resulting in a stagnant economy.",
      "• In recent years, the financial services sector in Banja Luka has gained increasing importance and prominence within the city’s economy.",
      "• The Banja Luka Stock Exchange was established in 2002, marking a significant development in the city’s financial infrastructure.",
      "• Since its inception, the stock exchange has seen substantial growth, with increases in the number of listed companies, trading volume, and investor participation.",
      "• Notable companies listed on the Banja Luka Stock Exchange include Telekom Srpske, Rafinerija ulja Modriča, Banjalučka Pivara, and Vitaminka, all of which are traded regularly.",
      "• The investor base has expanded beyond regional countries to include investment funds from the European Union, Norway, the United States, Japan, and China, alongside investors from Slovenia, Croatia, and Serbia.",
      "• Several key financial regulatory bodies are headquartered in Banja Luka, including the Indirect Taxation Authority of Bosnia and Herzegovina, the Republika Srpska Securities Commission, and the RS Banking Agency.",
      "• The city also hosts major financial institutions such as some of Bosnia’s largest banks, the Deposit Insurance Agency, and the Value-added Tax (VAT) Authority.",
      "• The concentration of these financial institutions and regulators has established Banja Luka as a major financial centre within Bosnia and Herzegovina.",
      "• In 1981, Banja Luka’s GDP per capita was 97% of the Yugoslav average, indicating its economic standing prior to the disintegration of Yugoslavia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:37.625583",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1396,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "Although Banja Luka was spared the direct physical destruction that afflicted many other parts of Bosnia and Herzegovina during the Bosnian War in the early 1990s, the city’s economy nevertheless suffered significant setbacks throughout the conflict. The war’s broader destabilizing effects, including disrupted trade routes, economic sanctions, and the breakdown of regional cooperation, created an environment in which economic activity was severely constrained. Despite the absence of direct combat damage, Banja Luka’s industries and businesses faced challenges such as reduced investment, limited access to international markets, and a general atmosphere of uncertainty that hindered economic growth. As a result, the city’s economy stagnated during this tumultuous period, unable to keep pace with the rapid changes occurring elsewhere in the global economy. For approximately four years during and immediately following the war, Banja Luka lagged behind global technological advancements, which further contributed to economic stagnation. While other regions were beginning to integrate new technologies into manufacturing, communications, and services, Banja Luka’s industrial and commercial sectors remained largely static. This technological lag was compounded by the isolation imposed by the conflict and the subsequent political fragmentation of Bosnia and Herzegovina, which limited the city’s access to foreign investment and technological transfer. The cumulative effect was a period during which economic modernization stalled, and the city’s economic performance fell behind that of both regional and international peers. In the years following the war and the Dayton Agreement, the financial services sector in Banja Luka gradually gained increasing importance and prominence within the city’s economy. This shift reflected broader trends in post-conflict economic restructuring, where services, particularly financial services, became key drivers of growth and development. The emergence of a more robust financial sector was facilitated by the establishment of new financial institutions, regulatory frameworks, and market infrastructure designed to attract investment and promote economic stability. As a result, financial services began to play a central role in supporting other sectors of the economy, facilitating capital formation, and integrating Banja Luka more closely into regional and global financial networks. A landmark development in the city’s financial infrastructure was the establishment of the Banja Luka Stock Exchange in 2002. This institution represented a significant step toward creating a formalized capital market in Republika Srpska and Bosnia and Herzegovina as a whole. The stock exchange was designed to provide a transparent and regulated platform for the trading of securities, thereby encouraging investment and enabling companies to raise capital more efficiently. Its creation was part of a broader post-war effort to rebuild and modernize the country’s financial system, aligning it with international standards and practices. The Banja Luka Stock Exchange quickly became a focal point for financial activity in the region, signaling a new era of economic development and market-oriented reforms. Since its inception, the Banja Luka Stock Exchange has experienced substantial growth, marked by increases in the number of listed companies, trading volume, and investor participation. The expansion of the exchange reflected growing confidence among both domestic and international investors in the city’s financial markets and economic prospects. Over time, the exchange broadened its range of listed securities, attracting companies from various sectors and thereby enhancing market liquidity and depth. This growth also facilitated greater price discovery and transparency, contributing to the overall stability and attractiveness of the financial market in Banja Luka. The increasing activity on the exchange underscored the city’s evolving role as a regional financial hub. Among the notable companies listed on the Banja Luka Stock Exchange are Telekom Srpske, Rafinerija ulja Modriča, Banjalučka Pivara, and Vitaminka, all of which are traded regularly. Telekom Srpske, a major telecommunications provider, represents a key player in the region’s communications infrastructure. Rafinerija ulja Modriča, an oil refinery, is significant for its role in the energy sector and industrial production. Banjalučka Pivara, a prominent brewery, contributes to the food and beverage industry, while Vitaminka, a leading producer of confectionery products, is an important name in the consumer goods market. The regular trading of these companies’ shares on the stock exchange highlights their importance to the local economy and their appeal to investors seeking exposure to diverse sectors within Republika Srpska. The investor base of the Banja Luka Stock Exchange has expanded significantly beyond the immediate region to include investment funds and institutional investors from a broad array of countries. While initial participation was primarily from neighboring countries such as Slovenia, Croatia, and Serbia, over time the exchange attracted investment from the European Union, Norway, the United States, Japan, and China. This diversification of investors reflects growing international recognition of the exchange’s potential and the economic opportunities in Banja Luka and Republika Srpska more broadly. The presence of foreign investment funds has helped to increase market liquidity, introduce new investment practices, and enhance the overall credibility of the financial market. It also signifies the city’s increasing integration into the global financial system. Several key financial regulatory bodies are headquartered in Banja Luka, underscoring the city’s central role in the governance and oversight of financial activities within Republika Srpska and Bosnia and Herzegovina. Among these institutions is the Indirect Taxation Authority of Bosnia and Herzegovina, which is responsible for administering value-added tax (VAT), customs duties, and excise taxes across the entire country. The presence of this authority in Banja Luka highlights the city’s administrative importance in national fiscal matters. Additionally, the Republika Srpska Securities Commission, tasked with regulating and supervising the securities market within the entity, is based in the city. This commission ensures compliance with securities laws, protects investors, and promotes market transparency. The RS Banking Agency, also headquartered in Banja Luka, oversees the banking sector, ensuring financial stability, soundness, and adherence to regulatory standards among banks operating in Republika Srpska. Banja Luka also hosts several major financial institutions, including some of Bosnia and Herzegovina’s largest banks, the Deposit Insurance Agency, and the Value-added Tax (VAT) Authority. The concentration of these entities within the city has contributed to the development of a comprehensive financial ecosystem that supports economic activity across multiple sectors. The Deposit Insurance Agency plays a critical role in maintaining depositor confidence by guaranteeing bank deposits up to a certain limit, thereby enhancing the stability of the banking system. The VAT Authority manages the collection and administration of VAT, a key source of government revenue, which is essential for public finance and economic policy. Together, these institutions provide a robust framework for financial intermediation, regulation, and fiscal management, reinforcing Banja Luka’s status as a financial center. The aggregation of financial institutions, regulatory agencies, and market infrastructure has firmly established Banja Luka as a major financial centre within Bosnia and Herzegovina. This status reflects the city’s evolution from a war-affected economy to a dynamic hub of financial services and capital markets. The presence of a well-regulated stock exchange, key regulatory bodies, and significant banking institutions has attracted investment and facilitated economic growth. Banja Luka’s financial sector plays a pivotal role in supporting the broader economy, enabling the mobilization of capital, fostering entrepreneurship, and integrating the region into international financial networks. This development has helped to diversify the city’s economic base and enhance its regional significance. In 1981, prior to the disintegration of Yugoslavia, Banja Luka’s economic standing was relatively strong, with its gross domestic product (GDP) per capita reaching 97% of the Yugoslav average. This figure indicates that the city’s economy was nearly on par with the overall economic performance of the Yugoslav federation at the time, reflecting a relatively high level of industrialization, productivity, and living standards. The city’s economic structure during this period was characterized by a mix of manufacturing, services, and agriculture, supported by well-developed infrastructure and a skilled workforce. This historical economic position provides important context for understanding the challenges and opportunities faced by Banja Luka in the post-war period, as the city sought to rebuild and modernize its economy within a new political and economic framework.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:15.136877",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 9346,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Energy",
    "text": "The country has been a heavy user of energy compared with the EU, with\nartificially low prices providing a disincentive to make savings. Heavily\nreliant on lignite coal for power generation, in 2021 Bosnia and Herzegovina\nis one of very few countries still making plans to expand coal energy\ngeneration.\n\nStatistics\n\n**2020 energy statistics** Production capacities for electricity\n(billion kWh)  | Type | Amount\n---|---\nFossil fuel | 26.27\nHydro | 14.81\nWind power | 0.62\nSolar | 0.12\nBiomass | 0.04\nTotal | 41.86\n|  Electricity\n(billion kWh)  | Category | Amount\n---|---\nConsumption | 11.66\nProduction | 16.96\nImport | 3.27\nExport | 7.32\n|  Natural Gas\n(billion m3)  | Consumption | 0.218\n---|---\nImport | 0.218\n\n**CO 2 emissions:**\n20.95 million tons",
    "openai_summarised_points": [
      "• Bosnia and Herzegovina has historically been a heavy user of energy relative to the European Union (EU), with artificially low energy prices that create a disincentive for consumers and industries to implement energy-saving measures.",
      "• The country relies heavily on lignite coal for power generation, making it one of the few nations still planning to expand its coal energy capacity as of 2021.",
      "• In 2020, the total electricity production capacity in Bosnia and Herzegovina was 41.86 billion kWh, distributed across various energy sources:",
      "• In 2020, the country's electricity consumption was 11.66 billion kWh, while total electricity production was 16.96 billion kWh, indicating a surplus that allowed for imports and exports.",
      "• Bosnia and Herzegovina imported 3.27 billion kWh of electricity in 2020 and exported 7.32 billion kWh, reflecting a net export position.",
      "• The country consumed 0.218 billion cubic meters of natural gas in 2020, with all of this consumption being through imports, as no domestic natural gas production is reported.",
      "• CO₂ emissions from energy production and consumption in Bosnia and Herzegovina amounted to 20.95 million tons in 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:41.588280",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 753,
      "bullet_points_count": 7
    },
    "generated_detailed_content": "Bosnia and Herzegovina has historically exhibited a relatively high level of energy consumption compared to the average within the European Union. This pattern has been influenced in part by the presence of artificially low energy prices, which have persisted over time and consequently diminished the incentives for both consumers and industrial sectors to adopt energy-saving technologies or implement efficiency measures. The artificially suppressed cost of energy has led to a consumption behavior that does not reflect the true economic or environmental costs associated with energy use, thereby perpetuating inefficiencies and a higher overall demand. This dynamic has complicated efforts to transition toward more sustainable energy practices and has maintained the country’s dependence on traditional, carbon-intensive energy sources. A significant characteristic of Bosnia and Herzegovina’s energy sector is its heavy reliance on lignite coal for electricity generation. Lignite, a low-grade form of coal with relatively high moisture content and lower calorific value, has historically been abundant and economically accessible within the country’s borders. This reliance places Bosnia and Herzegovina among the few nations worldwide that, as of 2021, were still actively planning to expand their coal energy capacity. The decision to continue investing in lignite coal infrastructure contrasts with broader European trends, where many countries have sought to reduce coal dependency due to environmental concerns and commitments to reduce greenhouse gas emissions. The persistence of coal expansion plans reflects a combination of domestic resource availability, existing infrastructure, and economic considerations tied to energy security and employment in coal mining regions. In terms of electricity production, Bosnia and Herzegovina had a total installed capacity of 41.86 billion kilowatt-hours (kWh) in 2020, sourced from a mix of energy types. This capacity distribution included coal-fired thermal power plants, hydroelectric facilities, and a smaller but growing contribution from renewable energy sources such as wind and solar power. The dominance of coal-fired generation was evident, with lignite coal plants accounting for the majority of the production capacity, while hydropower contributed a substantial share due to the country’s mountainous terrain and river systems. The diversification of energy sources, although limited, provided some degree of flexibility and resilience in the national grid, supporting both baseload and peak demand requirements. Electricity consumption in Bosnia and Herzegovina during 2020 totaled approximately 11.66 billion kWh, while the country’s electricity production reached 16.96 billion kWh. This production surplus of over 5 billion kWh indicated that the nation generated more electricity than it consumed domestically. Such a surplus enabled Bosnia and Herzegovina to engage in cross-border electricity trade, balancing imports and exports to optimize supply and demand. The ability to produce beyond domestic needs was partly attributable to the operational capacity of existing power plants and the availability of hydropower during favorable water flow conditions, which can vary seasonally but contribute significantly to the overall electricity mix. Despite the production surplus, Bosnia and Herzegovina imported 3.27 billion kWh of electricity in 2020. These imports were often necessary to meet regional or temporal demand fluctuations, cover shortfalls in specific areas, or ensure grid stability during maintenance periods or unexpected outages. Conversely, the country exported a larger volume of electricity, totaling 7.32 billion kWh in the same year. This net export position underscored Bosnia and Herzegovina’s role as an electricity supplier within the regional energy market, contributing to the interconnected European grid system. The export capacity was particularly important for generating foreign exchange revenue and maintaining positive trade balances in the energy sector, while also reflecting the operational efficiency of the country’s power generation infrastructure. Natural gas consumption in Bosnia and Herzegovina was recorded at 0.218 billion cubic meters in 2020. Notably, the entirety of this natural gas demand was met through imports, as the country did not report any domestic production of natural gas. This reliance on imported natural gas highlighted a vulnerability in terms of energy security, as it subjected the country to external market fluctuations and geopolitical risks associated with supply routes and international contracts. The relatively modest volume of natural gas consumption compared to coal and hydropower reflected the limited role of gas-fired power plants and industrial usage within the national energy mix. Nonetheless, natural gas remained an important component for certain industrial processes, heating, and potentially as a transition fuel in efforts to reduce carbon emissions. The environmental impact of Bosnia and Herzegovina’s energy sector was significant, with carbon dioxide (CO₂) emissions from energy production and consumption reaching 20.95 million tons in 2020. These emissions were predominantly linked to the combustion of lignite coal in thermal power plants, which is characterized by high carbon intensity due to the fuel’s low energy density and high pollutant content. The substantial CO₂ output underscored the challenges faced by the country in aligning its energy policies with international climate commitments, such as those under the Paris Agreement. Efforts to reduce emissions have been complicated by the economic reliance on coal, the need for affordable energy, and the infrastructural investments required to transition toward cleaner energy sources. The environmental footprint of the energy sector remains a critical consideration for Bosnia and Herzegovina’s sustainable development and integration into broader European energy and climate frameworks.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:11.024321",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 7,
      "generated_content_length": 6027,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Renewable power",
    "text": "Wind and Solar\n\nThe first wind farm was built in 2018.\n\nThe 2030 plan envisages 1.5 GW of solar power and 0.5 GW of wind power\ncapacity being built.\n\nHydro power\n\nIn 2021 the country had around 2076 MW of installed hydropower capacity larger\nthan 10 MW, with 180 MW of small hydropower units.",
    "openai_summarised_points": [
      "• The first wind farm in Bosnia and Herzegovina was constructed in 2018, marking the beginning of wind energy development in the country.",
      "• The national 2030 energy plan aims to develop 1.5 gigawatts (GW) of solar power capacity, reflecting a significant investment in renewable energy sources.",
      "• The same plan also targets the addition of 0.5 GW (500 megawatts) of wind power capacity by 2030, indicating a strategic focus on expanding wind energy infrastructure.",
      "• As of 2021, Bosnia and Herzegovina had approximately 2,076 megawatts (MW) of installed hydropower capacity for plants larger than 10 MW, representing the country's substantial reliance on hydroelectric energy.",
      "• In addition to large hydropower plants, the country had about 180 MW of small hydropower units, contributing to its renewable energy portfolio."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:44.731857",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 292,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "The development of wind energy in Bosnia and Herzegovina began relatively recently, with the construction of the country’s first wind farm in 2018. This marked a significant milestone in the diversification of the nation’s renewable energy sector, as prior to this, wind power had not been harnessed on a commercial scale. The establishment of this initial wind farm demonstrated both the technical feasibility and the growing interest in utilizing the country’s wind resources, setting a precedent for further investments and development in this area. The project not only contributed to the generation of clean energy but also served as a catalyst for policy discussions and strategic planning related to renewable energy expansion. In alignment with the country’s broader energy strategy, the national 2030 energy plan outlines ambitious targets for renewable power capacity, particularly emphasizing solar and wind energy. The plan aims to develop 1.5 gigawatts (GW) of solar power capacity by 2030, reflecting a substantial commitment to solar energy as a key component of the future energy mix. This target represents a significant increase from previous levels of solar capacity and indicates the government’s recognition of solar power’s potential to contribute to energy security, reduce greenhouse gas emissions, and foster economic growth through new technology sectors. The emphasis on solar energy development includes not only utility-scale photovoltaic installations but also the promotion of decentralized solar systems, which can enhance energy access and resilience across various regions. Complementing the solar power goals, the 2030 energy plan also sets a target of adding 0.5 GW (500 megawatts) of wind power capacity within the same timeframe. This objective underscores a strategic focus on expanding wind energy infrastructure as a means to diversify the renewable energy portfolio and reduce dependence on fossil fuels. The planned increase in wind capacity aims to build upon the initial progress made since the first wind farm’s commissioning in 2018, encouraging further investments in wind projects, improving grid integration, and fostering technological innovation. The integration of wind power is expected to play a crucial role in meeting the country’s renewable energy targets, supporting grid stability, and contributing to climate change mitigation efforts. Hydropower has historically been the dominant source of renewable electricity generation in Bosnia and Herzegovina, with substantial installed capacity that forms the backbone of the country’s energy system. As of 2021, the nation possessed approximately 2,076 megawatts (MW) of installed hydropower capacity from plants larger than 10 MW. This significant capacity highlights the extensive utilization of the country’s abundant river resources and mountainous terrain, which provide favorable conditions for large-scale hydroelectric power generation. The reliance on hydropower has contributed to a relatively low carbon intensity in the electricity sector, although it also presents challenges related to water resource management, seasonal variability, and environmental impacts. In addition to large hydropower plants, Bosnia and Herzegovina also maintained about 180 MW of small hydropower units, which form an important part of the renewable energy portfolio. These smaller-scale installations, typically defined as plants with capacities below 10 MW, contribute to local energy supply, often serving remote or rural areas where grid connectivity may be limited. Small hydropower units offer advantages such as lower environmental impact compared to large dams, faster construction times, and the ability to support decentralized energy systems. Their presence complements the larger hydropower infrastructure and aligns with broader goals of sustainable energy development by promoting diverse and resilient renewable energy sources. Together, the expansion of wind and solar power capacities, alongside the substantial existing hydropower infrastructure, reflects Bosnia and Herzegovina’s evolving energy landscape. The country’s strategic plans for 2030 emphasize a balanced approach to renewable energy development, aiming to harness a variety of natural resources while addressing environmental, economic, and social considerations. This multifaceted renewable energy strategy is designed to enhance energy security, reduce greenhouse gas emissions, and support sustainable economic growth within the context of regional and global energy transitions.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:06.721898",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 4560,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Fossil fuels",
    "text": "Coal\n\nIn 2021, electricity production came from five main lignite coal power plants\ngenerating up to 2065 MW.\n\nTuzla Thermal Power Plant was supposed to close unit 4 in 2022 however the\ngovernment has extended this lignite coal generators life. Kakanj Power\nStation was also supposed to have closed unit 5 in 2022 under the 2006 Energy\nCommunity Treaty.\n\nUnder the 2030 plan a number of coal power stations will close or convert to\nbiomass.\n\n* Breza coal mine\n* Gacko coal mine\n* Kakanj coal mine\n\n|\n\n* Kamengrad coal mine\n* Kongora coal mine\n* Stanari coal mine\n\n|\n\n* Tušnica coal mine\n* Ugljevik coal mine\n* Zenica coal mine\n\n\n---|---|---",
    "openai_summarised_points": [
      "• In 2021, electricity production in Bosnia and Herzegovina was primarily generated from five main lignite coal power plants, with a combined capacity of up to 2,065 MW.",
      "• The Tuzla Thermal Power Plant was scheduled to close its Unit 4 in 2022; however, the government extended the operational life of this lignite coal generator.",
      "• The Kakanj Power Station was also planned to shut down Unit 5 in 2022, as mandated by the 2006 Energy Community Treaty.",
      "• Under the national 2030 energy plan, several coal power stations are slated for closure or conversion to biomass energy sources.",
      "• The coal mines associated with these power plants include: Breza coal mine, Gacko coal mine, Kakanj coal mine, Kamengrad coal mine, Kongora coal mine, Stanari coal mine, Tušnica coal mine, Ugljevik coal mine, and Zenica coal mine."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:48.726549",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 640,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "In 2021, the electricity sector in Bosnia and Herzegovina was heavily reliant on lignite coal as its primary energy source, with production concentrated in five major lignite coal-fired power plants. These facilities collectively possessed an installed capacity reaching up to 2,065 megawatts (MW), making them the backbone of the country's electricity generation infrastructure. The dominance of lignite coal power plants reflected the abundant domestic lignite reserves and the historical development of the energy sector, which prioritized coal-fired generation due to its relative affordability and resource availability. This reliance on lignite coal, however, also presented challenges related to environmental sustainability and compliance with evolving European energy and climate policies. Among these power plants, the Tuzla Thermal Power Plant held a significant position, with multiple operational units contributing substantially to the national grid. Unit 4 of the Tuzla plant, which had been a critical component of the plant's capacity, was originally scheduled for closure in 2022 as part of Bosnia and Herzegovina's efforts to reduce coal dependency and align with international environmental commitments. Despite this planned shutdown, the government opted to extend the operational life of Unit 4, recognizing the plant's importance in ensuring energy security and managing electricity demand fluctuations. This decision highlighted the tension between environmental objectives and the practical considerations of maintaining a stable electricity supply in the face of limited alternative energy sources. Similarly, the Kakanj Power Station was subject to regulatory mandates stemming from Bosnia and Herzegovina's obligations under the 2006 Energy Community Treaty, which aimed to harmonize the country's energy policies with those of the European Union. In accordance with this treaty, Unit 5 of the Kakanj Power Station was scheduled for closure in 2022 to reduce emissions and phase out older, less efficient coal-fired units. The treaty imposed strict deadlines and environmental standards on coal power plants, compelling Bosnia and Herzegovina to undertake reforms and modernizations within its energy sector. The planned shutdown of Unit 5 was part of a broader strategy to transition towards cleaner energy sources and improve air quality, although it also raised concerns about potential impacts on electricity supply and local employment. Looking beyond the immediate timelines, Bosnia and Herzegovina formulated a national energy plan targeting the year 2030, which outlined a strategic vision for the future of its energy sector. This plan included provisions for the gradual closure of several coal power stations, reflecting a commitment to decarbonization and alignment with European climate goals. In addition to closures, the plan proposed the conversion of certain coal-fired power plants to biomass energy sources, thereby leveraging existing infrastructure while reducing greenhouse gas emissions. This approach aimed to balance the need for energy transition with economic and social considerations, particularly in regions heavily dependent on coal mining and coal power generation. The national 2030 energy plan thus represented a roadmap for transforming the fossil fuel-dependent electricity sector into a more sustainable and diversified energy system. Integral to the operation of these coal power plants were numerous coal mines distributed across Bosnia and Herzegovina, which supplied the lignite necessary for electricity generation. These mines included the Breza coal mine, Gacko coal mine, Kakanj coal mine, Kamengrad coal mine, Kongora coal mine, Stanari coal mine, Tušnica coal mine, Ugljevik coal mine, and Zenica coal mine. Each of these mining operations played a vital role in supporting the country's energy infrastructure by providing a steady supply of lignite, often located in close proximity to the associated power plants to minimize transportation costs and logistical complexities. The coal mining sector not only contributed to energy production but also served as a significant source of employment and economic activity in the respective regions. However, the environmental impact of lignite mining and combustion, including land degradation, air pollution, and carbon emissions, posed ongoing challenges that Bosnia and Herzegovina needed to address within its broader energy transition framework.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:06.426453",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 4471,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Tourism",
    "text": "Stari Most in Mostar, a UNESCO World Heritage Site\n\nThe tourism sector has been recovering and helping the economy altogether in\nthe process, with popular winter skiing destinations as well as summer\ncountryside tourism. Bosnia and Herzegovina has been a top performer in recent\nyears in terms of tourism development; tourist arrivals have grown by an\naverage of 24% annually from 1995 to 2000. The European region's solid growth\nin arrivals in 2007 was due in significant part to Southern and Mediterranean\nEurope's strong performance (+7%). In particular, Bosnia and Herzegovina were\namong the stronger players with a growth of 20%.\n\nIn 2012, Bosnia and Herzegovina had 747,827 tourists an increase of 9% and\n1,645,521 overnight stays which is a 9,4% increase from 2012. 58.6% of the\ntourists came from foreign countries.\n\nAccording to an estimate of the World Tourism Organization, Bosnia and\nHerzegovina will have the third highest tourism growth rate in the world\nbetween 1995 and 2020.\n\nOf particular note is the diaspora population which often returns home during\nthe summer months, bringing in an increase in retail sales and food service\nindustry.\n\nIn 2017, 1,307,319 tourists visited Bosnia and Herzegovina, an increase of\n13.7%, and had 2,677,125 overnight hotel stays, a 12.3% increase from the\nprevious year. Also, 71.5% of the tourists came from foreign countries.",
    "openai_summarised_points": [
      "• Stari Most in Mostar is recognized as a UNESCO World Heritage Site, highlighting its cultural and historical significance.",
      "• The tourism sector in Bosnia and Herzegovina has been recovering, contributing positively to the overall economy through diverse activities such as winter skiing and summer countryside tourism.",
      "• The country has been a top performer in tourism development in recent years, with tourist arrivals growing at an average rate of 24% annually from 1995 to 2000.",
      "• In 2007, the European region experienced solid growth in tourist arrivals (+7%), largely driven by strong performances in Southern and Mediterranean Europe; Bosnia and Herzegovina was among the leading countries with a growth rate of 20%.",
      "• In 2012, Bosnia and Herzegovina hosted 747,827 tourists, representing a 9% increase from the previous year, and recorded 1,645,521 overnight stays, which was a 9.4% increase from 2012.",
      "• Of the total tourists in 2012, 58.6% were from foreign countries, indicating a significant international tourism influx.",
      "• The World Tourism Organization estimates that Bosnia and Herzegovina will have the third highest tourism growth rate globally between 1995 and 2020.",
      "• The diaspora population plays a notable role in tourism, frequently returning during summer months, thereby boosting retail sales and the food service industry.",
      "• In 2017, the country saw 1,307,319 tourists, marking a 13.7% increase from the previous year, and recorded 2,677,125 overnight hotel stays, a 12.3% rise from 2016.",
      "• In 2017, 71.5% of tourists visiting Bosnia and Herzegovina were from foreign countries, emphasizing the country's appeal to international visitors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:54.454088",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1378,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "Stari Most in Mostar stands as a prominent symbol of Bosnia and Herzegovina’s rich cultural and historical heritage, having been officially recognized as a UNESCO World Heritage Site. This iconic Ottoman-era bridge, originally constructed in the 16th century, not only represents a remarkable feat of engineering but also embodies the multicultural history of the region. Its destruction during the Bosnian War in the 1990s and subsequent meticulous reconstruction in 2004 further underscored its significance as a symbol of reconciliation and resilience. The bridge attracts numerous visitors annually, drawn by its architectural beauty and the traditional diving competitions held from its arch into the Neretva River below, which have become a celebrated tourist attraction. The tourism sector in Bosnia and Herzegovina has experienced a steady recovery since the post-war period, gradually becoming a vital contributor to the country’s overall economic growth. This resurgence has been driven by a diverse array of activities that cater to both winter and summer tourists. During the winter months, the country’s mountainous terrain, particularly in regions such as Jahorina and Bjelašnica, offers well-developed skiing facilities that attract enthusiasts from across Europe and beyond. In contrast, the summer season sees an influx of visitors seeking countryside tourism, exploring the country’s natural landscapes, historical towns, and cultural sites. This diversification has allowed the tourism industry to generate consistent revenue streams throughout the year, supporting local businesses and employment. Between 1995 and 2000, Bosnia and Herzegovina emerged as one of the top performers in tourism development within the region, achieving an impressive average annual growth rate of 24% in tourist arrivals. This rapid expansion reflected the country’s successful efforts to rebuild its tourism infrastructure and promote its unique cultural and natural assets in the aftermath of conflict. The growth was also facilitated by increasing international interest in the Balkans as a travel destination, alongside improvements in regional stability and accessibility. This period laid the foundation for the country’s continued development as a notable tourism hub in Southeastern Europe. The year 2007 marked a period of solid growth for the European tourism sector, with the region experiencing a 7% increase in tourist arrivals. This growth was predominantly driven by strong performances in Southern and Mediterranean Europe, where countries capitalized on their favorable climates and established tourism industries. Bosnia and Herzegovina distinguished itself during this period by registering a remarkable 20% growth rate in tourist arrivals, significantly outpacing the average European increase. This surge was indicative of the country’s rising profile as a destination of choice, benefiting from enhanced marketing efforts, improved infrastructure, and the growing appeal of its natural and cultural attractions. In 2012, Bosnia and Herzegovina hosted a total of 747,827 tourists, marking a 9% increase compared to the previous year. This upward trend was accompanied by a corresponding rise in overnight stays, which reached 1,645,521—a 9.4% increase from 2011 figures. These statistics underscored the growing popularity of the country among both domestic and international travelers. Of the total tourists recorded in 2012, 58.6% were foreign visitors, highlighting the significant influx of international tourists and the country’s expanding reach in global tourism markets. This growth in foreign tourism contributed to increased foreign exchange earnings and stimulated sectors such as hospitality, transportation, and retail. The World Tourism Organization projected Bosnia and Herzegovina to achieve the third highest tourism growth rate globally between 1995 and 2020. This forecast was based on the country’s consistent performance in attracting tourists and its potential for further development in various tourism niches. Factors contributing to this optimistic outlook included the country’s diverse natural landscapes, rich cultural heritage, and improving political and economic stability. The projection also reflected expectations that Bosnia and Herzegovina would continue to capitalize on emerging trends in experiential and adventure tourism, as well as the growing interest in post-conflict destinations. The diaspora population of Bosnia and Herzegovina plays a significant role in the country’s tourism dynamics, particularly during the summer months when many expatriates return to visit family and reconnect with their homeland. These return visits provide a substantial boost to the local economy, especially in sectors such as retail and food service. The spending patterns of the diaspora during their stays contribute to increased demand for goods, dining, and accommodation services, thereby supporting small businesses and generating employment opportunities. This cyclical influx of diaspora tourists also fosters cultural exchange and helps maintain strong transnational ties. By 2017, Bosnia and Herzegovina had further solidified its position as an emerging tourism destination, welcoming 1,307,319 tourists—a 13.7% increase from the previous year. The number of overnight hotel stays also rose significantly, reaching 2,677,125, which represented a 12.3% increase compared to 2016. These figures reflected sustained growth in both the volume of visitors and the length of their stays, indicating enhanced visitor satisfaction and improved tourism infrastructure. The expansion of accommodation options, along with increased promotional activities and the development of new tourist products, contributed to this positive trend. In the same year, foreign tourists constituted 71.5% of all visitors to Bosnia and Herzegovina, underscoring the country’s growing appeal to international travelers. This majority share of foreign visitors highlighted the success of efforts to position the country as a competitive destination in the global tourism market. The diverse origins of these tourists, ranging from neighboring countries in the Balkans to Western Europe and beyond, reflected Bosnia and Herzegovina’s increasing accessibility and attractiveness. The prominence of international tourism also brought about greater cultural exchange and economic benefits, further integrating the country into the broader European tourism landscape.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:36.722572",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 6492,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Challenges of doing business",
    "text": "While business regulations are of comparable strictness as in most countries\nin Central Europe, many problems persist. Post-war high percentage of\nunemployment (16.85%) remains high, and the economical progress is very slow.\nComplicated bureaucracy system, complex procedures and often misconducted\naudition and regulation by public officers also make for volatile and insecure\nbusiness environment, which is considered major hindrance to foreign\ninvestment into the country's industrial and manufacturing potential.\n\nThe workforce is comparably cheap, with average net salary being €580, and\naverage gross salary being €891, (as of June 2022[update]) and good skilled,\nespecially in sectors present in pre-war economy. However, with slow but\npersistent know-how obsolescence, workforce exodus, high unemployment and long\naverage time outside labor market for the unemployed, need a foreign-owned\nbusiness investing in industry sectors where the country could be competitive.\n\nBosnia and Herzegovina is also lacking a good e-governance structure, as well\nas good methods to enforce administrative accountability, both of which are\nconsidered necessary for more conductive business climate. Today[_when?_] it\ntakes between 3–5 weeks to register a company in the country (and in some\nbusiness sectors it can still take months to acquire all required permits,\nmostly due to administrative inefficiency), and many other business related\nadministrative procedures are similarly convoluted and time-consuming.\n\nPolitical corruption is one of the more acute problems in Bosnia and\nHerzegovina, and along with size of administration and its inefficiency, the\nbiggest detriment to tax money being spent where it should be spent – on\nservices to the population and the economy.\n\nBosnia and Herzegovina has been preparing for an era of declining\ninternational assistance. Country's most immediate task remains economic\nrevitalization to create jobs and income. After the 2014 riots, both\nadministrations have shyly started the reform, dealing with some of the many\npressing issues to local economy, but the overall process is still considered\nslow and tenuous by the populace and local as well as foreign economic\nanalysts.",
    "openai_summarised_points": [
      "• Business regulations in Bosnia and Herzegovina are comparable in strictness to those in most Central European countries, yet numerous problems persist that hinder economic development.",
      "• The country faces a high post-war unemployment rate of 16.85%, which remains elevated, contributing to slow economic progress.",
      "• The business environment is characterized by complicated bureaucracy, complex procedures, and frequent misconduct by public officers during audits and regulation enforcement, leading to volatility and insecurity for businesses.",
      "• These bureaucratic challenges are considered a major obstacle to attracting foreign investment, particularly into the country's industrial and manufacturing sectors.",
      "• The workforce in Bosnia and Herzegovina is relatively inexpensive, with an average net salary of €580 and an average gross salary of €891 as of June 2022.",
      "• The workforce is well-skilled, especially in sectors that were prominent in the pre-war economy.",
      "• Despite the skilled workforce, issues such as slow technological obsolescence, workforce exodus, high unemployment, and prolonged periods outside the labor market for unemployed individuals hinder economic efficiency.",
      "• There is a need for foreign-owned businesses to invest in industrial sectors where Bosnia and Herzegovina could be competitive, given the current economic and labor market conditions.",
      "• The country lacks a robust e-governance infrastructure and effective methods to enforce administrative accountability, both of which are essential for creating a more conducive business climate.",
      "• Company registration in Bosnia and Herzegovina takes between 3 to 5 weeks; in some sectors, obtaining all necessary permits can still take months due to administrative inefficiencies.",
      "• Many administrative procedures related to business operations are convoluted and time-consuming, further complicating business development and investment.",
      "• Political corruption remains a significant issue, exacerbating inefficiencies within the administrative system and undermining effective allocation of tax revenues.",
      "• The large and inefficient administrative apparatus hampers the proper expenditure of tax money, affecting the provision of public services and economic support.",
      "• Bosnia and Herzegovina is preparing for a future with declining international assistance, making economic revitalization a top priority to generate jobs and income.",
      "• Following the 2014 riots, both governmental administrations initiated reforms aimed at addressing economic issues, but progress has been slow and fragile, according to both local populations and economic analysts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:49:01.517714",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2212,
      "bullet_points_count": 15
    },
    "generated_detailed_content": "Business regulations in Bosnia and Herzegovina exhibit a level of strictness comparable to those found in most Central European countries. Despite this regulatory framework, numerous persistent problems continue to impede the country’s economic development. These challenges reflect a complex interplay between legal standards and practical implementation, where formal regulations coexist with operational inefficiencies and systemic obstacles. The regulatory environment, while ostensibly rigorous, often fails to translate into a stable and predictable business climate, thereby limiting the potential for sustained economic growth. One of the most pressing economic challenges faced by Bosnia and Herzegovina is its persistently high post-war unemployment rate, which stood at 16.85%. This elevated level of unemployment has remained a significant barrier to economic progress, constraining domestic consumption and limiting the availability of skilled labor. The legacy of the 1990s conflict continues to cast a long shadow over the labor market, contributing to structural unemployment and underemployment. High unemployment rates have also exacerbated social tensions and hindered efforts to foster a dynamic and inclusive economy. The business environment in Bosnia and Herzegovina is further complicated by a cumbersome bureaucracy characterized by complex procedures and frequent misconduct by public officers, particularly during audits and the enforcement of regulations. This environment has generated a sense of volatility and insecurity among businesses, which often face unpredictable administrative hurdles and inconsistent application of rules. Such challenges undermine investor confidence and create an atmosphere where compliance becomes both costly and uncertain. The frequent irregularities and lack of transparency in administrative processes have contributed to a perception of arbitrariness that discourages both domestic entrepreneurship and foreign investment. Bureaucratic inefficiencies are widely regarded as a major obstacle to attracting foreign investment, especially in the country’s industrial and manufacturing sectors. These sectors, which hold significant potential for economic expansion and job creation, require a stable and transparent regulatory environment to thrive. However, the convoluted administrative landscape, marked by delays and discretionary enforcement, has deterred many potential investors. The inability to streamline business processes and provide clear, consistent guidelines has limited the inflow of foreign capital that could otherwise stimulate industrial modernization and diversification. Despite these challenges, the workforce in Bosnia and Herzegovina remains relatively inexpensive by regional standards. As of June 2022, the average net salary was approximately €580, while the average gross salary stood at €891. This cost advantage presents an opportunity for businesses, particularly in labor-intensive industries, to leverage competitive wage levels. The affordability of labor, combined with a pool of skilled workers, could serve as a foundation for economic revitalization if other structural impediments are addressed. The country’s workforce is notably well-skilled, especially in sectors that were prominent before the war. Many workers possess technical expertise and professional experience rooted in the industrial and manufacturing base that once formed the backbone of the economy. This legacy of skilled labor offers a comparative advantage that could be harnessed to support economic recovery and growth. However, the persistence of outdated technologies and production methods has limited the full utilization of these skills in a modern economic context. Several factors have hindered the effective deployment of the skilled workforce. Slow technological obsolescence has left many enterprises operating with outdated equipment and processes, reducing productivity and competitiveness. Additionally, a significant exodus of workers, particularly among the younger and more educated demographic, has depleted the labor pool. High unemployment rates have also contributed to prolonged periods during which individuals remain outside the labor market, eroding skills and diminishing employability. These dynamics collectively undermine economic efficiency and the country’s ability to adapt to evolving market demands. Given the existing economic and labor market conditions, there is a pronounced need for foreign-owned businesses to invest in industrial sectors where Bosnia and Herzegovina could maintain a competitive edge. Strategic foreign investment could catalyze modernization efforts, introduce new technologies, and create employment opportunities. Such investments would be instrumental in transforming the industrial landscape and fostering sustainable economic growth. However, attracting this investment requires addressing the systemic issues that currently deter potential investors, including bureaucratic inefficiencies and regulatory unpredictability. The country’s lack of a robust e-governance infrastructure and effective mechanisms for enforcing administrative accountability further complicates efforts to improve the business climate. The absence of comprehensive digital platforms for government services impedes transparency and efficiency, prolonging administrative procedures and increasing opportunities for corruption. Without reliable systems to monitor and enforce accountability, public institutions struggle to deliver consistent and fair services to businesses. The development of e-governance is widely recognized as essential for streamlining interactions between the private sector and government agencies, reducing administrative burdens, and enhancing investor confidence. Company registration in Bosnia and Herzegovina typically requires between three to five weeks to complete. However, in certain sectors, obtaining all necessary permits can take several months due to administrative inefficiencies and procedural complexities. This protracted timeline reflects the fragmented and often redundant nature of regulatory requirements, which impose significant delays on business startups and expansions. Lengthy registration and permitting processes not only increase costs but also discourage entrepreneurial activity and foreign investment, as businesses seek more predictable and efficient environments. Many administrative procedures related to business operations remain convoluted and time-consuming, further complicating business development and investment. The multiplicity of agencies involved, overlapping jurisdictions, and inconsistent application of rules create a labyrinthine system that is difficult to navigate. These procedural challenges increase operational risks and reduce the attractiveness of Bosnia and Herzegovina as a destination for both domestic and international investors. The complexity of administrative processes often necessitates reliance on intermediaries, adding to the cost and inefficiency of doing business. Political corruption continues to pose a significant challenge, exacerbating inefficiencies within the administrative system and undermining the effective allocation of tax revenues. Corruption manifests in various forms, including bribery, favoritism, and nepotism, which distort market mechanisms and erode public trust. The prevalence of corrupt practices hampers efforts to implement reforms and weakens institutional capacity. It also diverts resources away from productive investments and public services, thereby impeding economic development and social equity. The large and inefficient administrative apparatus in Bosnia and Herzegovina hampers the proper expenditure of tax money, affecting the provision of public services and economic support. The bureaucratic overhead consumes a disproportionate share of public resources, limiting the government’s ability to invest in infrastructure, education, and social programs that are vital for economic revitalization. Inefficiencies in public administration contribute to fiscal imbalances and reduce the overall effectiveness of government interventions aimed at stimulating growth and employment. Bosnia and Herzegovina is preparing for a future characterized by declining international assistance, which has historically played a significant role in supporting its post-conflict recovery. This anticipated reduction in external aid has elevated economic revitalization to a top national priority, as the country seeks to generate sustainable jobs and income domestically. The shift toward self-reliance necessitates structural reforms and the creation of a more conducive environment for private sector development. Without substantial improvements in the business climate and labor market conditions, the country risks stagnation and increased socio-economic vulnerabilities. Following the riots of 2014, both governmental administrations in Bosnia and Herzegovina initiated a series of reforms aimed at addressing the country’s economic challenges. These reforms targeted various aspects of the business environment, including regulatory simplification, anti-corruption measures, and efforts to improve public administration. However, progress has been slow and fragile, as noted by both local populations and economic analysts. Persistent political fragmentation, institutional inertia, and resistance to change have limited the effectiveness of reform initiatives. Consequently, despite some positive developments, the overall business climate remains challenging, and the country continues to face significant obstacles to achieving robust economic growth.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:26.900341",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 15,
      "generated_content_length": 9701,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Infrastructure",
    "text": "Motorway on the Pan-European Corridor Vc between Sarajevo and Visoko\n\nThe Bosnian government has issued an international tender for the construction\nof the 350 km long Pan-European Corridor Vc in Bosnia and Herzegovina which\nwill passes along the route Budapest-Osijek-Sarajevo-Ploče. The highway along\nthis corridor is the most significant roadway in Bosnia and Herzegovina and\nthe shortest communication route between Central Europe and the Southern\nAdriatic. The routing of the road passes through the central part of the\ncountry in the north–south direction from Donji Svilaj to the border of B&H,\nnorth from the Croatian port of Ploče, following the rivers Bosna and Neretva.\nMore than 50% of the total population and the economic activity of Bosnia and\nHerzegovina lies within the zone of influence along this route.\n\nAs of August 2018, 200 km of the motorway has been completed.\n\nDue to annual growth of nearly 10% the Sarajevo International Airport\nextension of the passenger terminal, together with upgrading and expanding the\ntaxiway and apron is planned to start in Fall 2012. The existing terminal will\nbe expanded with 7.000 square metres. The upgraded airport will also be\ndirectly connected to the commercial retail center Sarajevo Airport Center\nmaking it easy for tourist and travellers to use the time before the flight\nfor some last minute shopping.",
    "openai_summarised_points": [
      "• The Bosnian government has issued an international tender for the construction of the 350 km long Pan-European Corridor Vc in Bosnia and Herzegovina, which will pass along the route Budapest-Osijek-Sarajevo-Ploče.",
      "• The highway along Corridor Vc is the most significant roadway in Bosnia and Herzegovina and serves as the shortest communication route between Central Europe and the Southern Adriatic.",
      "• The route of the corridor passes through the central part of Bosnia and Herzegovina in a north–south direction, from Donji Svilaj to the border of Bosnia and Herzegovina, north of the Croatian port of Ploče, following the rivers Bosna and Neretva.",
      "• More than 50% of Bosnia and Herzegovina’s total population and economic activity are located within the zone of influence along this corridor route.",
      "• As of August 2018, 200 km of the motorway along Corridor Vc had been completed.",
      "• The construction and development of infrastructure are driven by the corridor’s importance as a major transportation link in the region.",
      "• The Sarajevo International Airport has experienced an annual passenger growth rate of nearly 10%.",
      "• In Fall 2012, plans were initiated to extend the passenger terminal of Sarajevo International Airport, including upgrading and expanding the taxiway and apron.",
      "• The expansion of the existing terminal will add 7,000 square metres of space.",
      "• The upgraded airport will be directly connected to the Sarajevo Airport Center, a commercial retail center, facilitating last-minute shopping for tourists and travelers before their flights."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:49:07.167898",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1368,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "The government of Bosnia and Herzegovina undertook a significant infrastructure initiative by issuing an international tender for the construction of the Pan-European Corridor Vc, a major transportation artery extending approximately 350 kilometers across the country. This corridor is planned to follow the route connecting Budapest in Hungary, Osijek in Croatia, Sarajevo in Bosnia and Herzegovina, and terminating at the Croatian port of Ploče on the Adriatic Sea. The development of this corridor represents a strategic effort to enhance regional connectivity and integrate Bosnia and Herzegovina more closely into the broader European transport network. The tender process attracted international interest, reflecting the corridor's importance not only for Bosnia and Herzegovina but also for neighboring countries seeking improved transit routes. The highway constructed along Corridor Vc holds the distinction of being the most significant roadway within Bosnia and Herzegovina. It functions as the shortest and most efficient communication and transport route between Central Europe and the Southern Adriatic coast. This positioning makes it a vital conduit for commercial traffic, tourism, and economic exchange, facilitating faster and more reliable movement of goods and people. The corridor’s strategic importance is underscored by its role in connecting inland European markets with maritime ports, thereby enhancing Bosnia and Herzegovina’s potential as a transit country and boosting regional economic integration. Geographically, the corridor traverses the central region of Bosnia and Herzegovina in a predominantly north–south orientation. It begins at Donji Svilaj, situated near the northern border with Croatia, and extends southwards to the border of Bosnia and Herzegovina, just north of the Croatian Adriatic port of Ploče. The route closely follows the natural courses of the Bosna and Neretva rivers, utilizing the river valleys to navigate the country’s mountainous terrain. This alignment not only facilitates easier construction and maintenance but also connects several key urban and economic centers along the way. The corridor’s path through the heart of the country ensures that it serves as a backbone for internal connectivity as well as international transit. The corridor’s influence extends beyond mere transportation, encompassing significant demographic and economic dimensions. More than half of Bosnia and Herzegovina’s total population resides within the zone of influence surrounding this route, highlighting its centrality to the country’s human geography. Additionally, the corridor encompasses the majority of the nation’s economic activity, with numerous industrial, commercial, and service sectors located along or near its path. This concentration of population and economic resources amplifies the corridor’s role as a catalyst for regional development, job creation, and investment attraction. By facilitating easier access to markets and resources, Corridor Vc contributes to reducing regional disparities and promoting balanced economic growth. By August 2018, substantial progress had been made in the corridor’s development, with approximately 200 kilometers of the motorway completed. This milestone reflected years of concerted construction efforts, funding allocations, and international cooperation. The completed sections of the motorway enabled improved traffic flow and reduced travel times, enhancing safety and efficiency for both freight and passenger vehicles. Despite the progress, work continued on remaining segments to ensure full completion of the 350-kilometer stretch, with ongoing attention to engineering challenges posed by the country’s varied topography. The phased approach to construction allowed for incremental benefits to be realized while maintaining momentum toward the corridor’s full operational status. The impetus for constructing and developing infrastructure along Corridor Vc stemmed from its critical importance as a major transportation link within the region. The corridor is envisioned as a key element in the Trans-European Transport Network (TEN-T), aimed at fostering economic cohesion and connectivity across Europe. Its development supports Bosnia and Herzegovina’s aspirations to integrate more fully into European markets and to attract foreign direct investment. Moreover, the corridor enhances regional cooperation by linking multiple countries and facilitating cross-border trade and mobility. The strategic focus on infrastructure development along this route reflects a broader recognition of transport corridors as drivers of economic growth, competitiveness, and sustainable development in the Western Balkans. In addition to road infrastructure, Sarajevo International Airport has experienced significant growth, reflecting the country’s expanding connectivity and tourism potential. The airport recorded an annual passenger growth rate approaching 10%, indicative of rising demand for air travel to and from Bosnia and Herzegovina. This growth has been driven by increased business travel, diaspora connections, and tourism, as well as improved airline services and route networks. The airport’s expanding passenger base necessitated modernization and capacity enhancements to accommodate future traffic and improve service quality. Responding to this demand, plans were initiated in the fall of 2012 to extend the passenger terminal at Sarajevo International Airport. These plans included comprehensive upgrades and expansions of critical airport infrastructure, such as the taxiway and apron areas, to support increased aircraft movements and improve operational efficiency. The terminal expansion aimed to enhance passenger experience by providing additional space for check-in, security, waiting areas, and retail services. This development was part of a broader strategy to position Sarajevo International Airport as a modern regional hub capable of meeting international standards and accommodating growing passenger volumes. The terminal expansion was designed to add approximately 7,000 square meters of new space, significantly increasing the airport’s capacity and functionality. This additional area allowed for the incorporation of new facilities, including upgraded lounges, retail outlets, and passenger amenities. The expanded terminal also facilitated smoother passenger flows and reduced congestion during peak travel periods. By enhancing the physical infrastructure, the airport sought to improve its competitiveness and attractiveness to airlines and travelers alike. A notable feature of the upgraded airport is its direct connection to the Sarajevo Airport Center, a commercial retail complex integrated with the terminal. This connection provides travelers with convenient access to a variety of shops and services, enabling last-minute shopping and other retail opportunities before boarding flights. The integration of commercial retail within the airport environment reflects modern trends in airport design, where passenger experience and non-aeronautical revenue generation are prioritized. The Sarajevo Airport Center thus contributes to the airport’s economic sustainability while enhancing the overall travel experience for tourists and business travelers.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:19.372496",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 7300,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "International rankings",
    "text": "World map representing Human Development Index categories (based on 2021 data, published in 2022)  Very high (≥ 0.800) High (0.700–0.799) Medium (0.550–0.699) |  Low (≤ 0.549) Data unavailable\n---|---\n\n* 74th in Human Development Index (2021)\n* 60th in inequality-adjusted Human Development Index (2021)\n* 97th in Democracy Index (2022)\n* 48th in Henley Passport Index (2023)\n* 81st in Human Capital Index (2020)\n* 88th in Quality of Nationality Index (2018)\n* 72nd in Legatum Prosperity Index (2023)\n* 63rd in Social Progress Index (2022)\n* 90th in Ease of Doing Business (2020)\n* 39th in Economic Complexity Index (2021)\n* 92nd in Global Competitiveness Report (2019)\n* 68th in Index of Economic Freedom (2023)\n* 61st in Global Peace Index (2023)\n* 110th in Corruption Perceptions Index (2022)",
    "openai_summarised_points": [
      "• Bosnia and Herzegovina ranked 74th in the Human Development Index (HDI) based on 2021 data, which assesses overall human development levels globally.",
      "• In the inequality-adjusted Human Development Index (IHDI) for 2021, Bosnia and Herzegovina was positioned at 60th place, reflecting disparities in human development.",
      "• The country ranked 97th in the Democracy Index in 2022, indicating its relative standing in democratic governance and political freedoms.",
      "• In the Henley Passport Index of 2023, Bosnia and Herzegovina held the 48th position, denoting its citizens' travel freedom and visa-free access to various countries.",
      "• Bosnia and Herzegovina was ranked 81st in the Human Capital Index in 2020, measuring the potential of its population to contribute to economic productivity through education and health.",
      "• The country was placed 88th in the Quality of Nationality Index in 2018, which evaluates the overall quality and desirability of nationalities based on factors like quality of life, economic strength, and political stability.",
      "• In the Legatum Prosperity Index of 2023, Bosnia and Herzegovina ranked 72nd, assessing overall prosperity through economic quality, business environment, governance, education, health, safety, and personal freedom.",
      "• Bosnia and Herzegovina was positioned 63rd in the Social Progress Index in 2022, measuring the extent to which countries provide for the social and environmental needs of their citizens.",
      "• The country ranked 90th in the Ease of Doing Business index in 2020, indicating the relative ease for entrepreneurs to start and operate businesses.",
      "• In the Economic Complexity Index of 2021, Bosnia and Herzegovina was ranked 39th, reflecting the diversity and sophistication of its export structure and productive capabilities.",
      "• Bosnia and Herzegovina held the 92nd position in the Global Competitiveness Report in 2019, assessing the competitiveness of its economy based on factors like infrastructure, macroeconomic stability, and innovation capability.",
      "• In the Index of Economic Freedom of 2023, Bosnia and Herzegovina was ranked 68th, evaluating economic policies that promote economic freedom, including trade, investment, and property rights.",
      "• The country was placed 61st in the Global Peace Index of 2023, measuring the level of peace and safety within Bosnia and Herzegovina.",
      "• Bosnia and Herzegovina ranked 110th in the Corruption Perceptions Index in 2022, indicating a relatively high perception of corruption within the country’s public sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:49:13.909155",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 795,
      "bullet_points_count": 14
    },
    "generated_detailed_content": "Based on data from 2021, Bosnia and Herzegovina was ranked 74th in the Human Development Index (HDI), a composite measure designed to assess overall human development levels across countries worldwide. The HDI incorporates indicators such as life expectancy, education, and per capita income to provide a comprehensive view of a nation's social and economic development. This ranking places Bosnia and Herzegovina in the medium human development category, reflecting moderate achievements in health, education, and living standards relative to other countries. The country's position in the HDI underscores ongoing challenges in improving quality of life and economic opportunities for its population, while also highlighting areas where progress has been made since the post-conflict recovery period. When adjusting for inequality, Bosnia and Herzegovina’s standing improves somewhat, as evidenced by its 60th place ranking in the inequality-adjusted Human Development Index (IHDI) for 2021. The IHDI accounts for disparities in human development outcomes within the population, measuring how unevenly health, education, and income are distributed. This higher placement relative to the standard HDI suggests that while overall development levels are moderate, the internal inequalities in Bosnia and Herzegovina are less severe than in many other countries. Nonetheless, the gap between the HDI and IHDI rankings indicates that disparities remain a significant concern, particularly given the country’s complex ethnic and regional divisions which continue to influence access to resources and opportunities. In terms of political governance and democratic freedoms, Bosnia and Herzegovina was positioned 97th in the Democracy Index in 2022. This index, compiled by the Economist Intelligence Unit, evaluates countries based on electoral processes, civil liberties, government functioning, political participation, and political culture. The country’s ranking reflects its status as a flawed democracy, characterized by a political system shaped by the Dayton Agreement, which created a complex and often fragmented institutional framework. Challenges such as ethnic power-sharing arrangements, political gridlock, and limited government effectiveness contribute to this middling position. The Democracy Index ranking highlights ongoing struggles to strengthen democratic institutions and promote political inclusiveness in the post-war period. Regarding international mobility and travel freedom, Bosnia and Herzegovina held the 48th position in the Henley Passport Index of 2023. This index ranks passports according to the number of destinations their holders can access without a prior visa. Citizens of Bosnia and Herzegovina enjoyed visa-free or visa-on-arrival access to numerous countries, reflecting moderate travel freedom relative to other nations. This ranking indicates that while Bosnian passport holders have considerable mobility within certain regions, particularly Europe, restrictions remain when traveling to countries with stricter visa policies. The passport’s ranking is influenced by bilateral agreements and the country’s diplomatic relations, which continue to evolve as Bosnia and Herzegovina seeks greater integration with European and global institutions. The Human Capital Index of 2020 placed Bosnia and Herzegovina at 81st, measuring the potential of its population to contribute to economic productivity through investments in education and health. This index, developed by the World Bank, considers factors such as expected years of schooling, learning-adjusted years of schooling, and healthy life expectancy. Bosnia and Herzegovina’s ranking reflects moderate levels of human capital development, with ongoing challenges in education quality and health outcomes. The legacy of conflict, economic transition, and uneven regional development have impacted the country’s ability to fully harness the potential of its workforce. Efforts to improve educational attainment and healthcare access remain critical for enhancing economic growth and competitiveness. In 2018, Bosnia and Herzegovina was ranked 88th in the Quality of Nationality Index, which evaluates the overall quality and desirability of nationalities based on factors including quality of life, economic strength, political stability, and international mobility. This index provides a holistic assessment of the benefits and privileges associated with a particular nationality. Bosnia and Herzegovina’s position reflects a nationality that offers moderate advantages in terms of living standards and economic opportunities, but is constrained by political complexities and limited global influence. The ranking also underscores the impact of the country’s geopolitical situation and ongoing domestic challenges on its citizens’ ability to fully benefit from their nationality on the international stage. The Legatum Prosperity Index of 2023 ranked Bosnia and Herzegovina 72nd, assessing overall prosperity through a multidimensional framework encompassing economic quality, business environment, governance, education, health, safety, and personal freedom. This index highlights the country’s moderate performance across these domains, with particular strengths and weaknesses shaping its overall prosperity. Bosnia and Herzegovina’s economic quality and business environment have shown gradual improvement, yet governance issues and political instability continue to hamper sustained progress. Social indicators such as education and health services have improved since the early 2000s, but disparities and inefficiencies persist. The country’s ranking in the Legatum Prosperity Index reflects the complex interplay between economic potential and structural challenges in achieving comprehensive prosperity. In the Social Progress Index of 2022, Bosnia and Herzegovina was positioned 63rd, measuring the extent to which countries provide for the social and environmental needs of their citizens. This index assesses basic human needs, foundations of wellbeing, and opportunity, offering a broad perspective on social development beyond economic metrics. Bosnia and Herzegovina’s ranking indicates moderate success in areas such as nutrition, sanitation, access to basic knowledge, and personal rights, while highlighting areas requiring further attention, including environmental sustainability and inclusiveness. The country’s post-conflict recovery and ongoing reforms have contributed to improvements in social infrastructure, but challenges remain in addressing regional disparities and ensuring equitable access to services. The Ease of Doing Business index of 2020 ranked Bosnia and Herzegovina 90th, reflecting the relative ease with which entrepreneurs can start and operate businesses within the country. This World Bank index evaluates regulatory environments across various dimensions, including starting a business, dealing with construction permits, getting electricity, registering property, and enforcing contracts. Bosnia and Herzegovina’s position suggests that while some progress has been made in simplifying business procedures and improving the regulatory framework, significant obstacles remain. These include bureaucratic inefficiencies, complex administrative requirements, and legal uncertainties that can hinder entrepreneurship and investment. Enhancing the business climate is a priority for fostering economic growth and attracting foreign direct investment. According to the Economic Complexity Index of 2021, Bosnia and Herzegovina was ranked 39th, reflecting the diversity and sophistication of its export structure and productive capabilities. This index measures the knowledge intensity embedded in a country’s exports, indicating the complexity of its economy. Bosnia and Herzegovina’s relatively high ranking demonstrates a diversified export base with a range of manufactured goods and industrial products, signaling a degree of economic resilience and potential for upgrading production. This complexity is a positive indicator for long-term economic development, as it suggests the country possesses the necessary capabilities to innovate and compete in global markets. However, challenges such as limited market access and infrastructural constraints continue to affect export performance. In the Global Competitiveness Report of 2019, Bosnia and Herzegovina held the 92nd position, assessing the competitiveness of its economy based on factors such as infrastructure, macroeconomic stability, health, education, market size, and innovation capability. This ranking reflects the country’s moderate performance in creating a conducive environment for productivity and economic growth. While Bosnia and Herzegovina benefits from a strategic geographic location and a skilled labor force, deficiencies in infrastructure quality, regulatory efficiency, and innovation ecosystems have limited its competitiveness. Political fragmentation and institutional weaknesses also contribute to challenges in achieving higher rankings. The report underscores the need for structural reforms to enhance the country’s economic potential and integration into global value chains. The Index of Economic Freedom in 2023 placed Bosnia and Herzegovina at 68th, evaluating economic policies that promote economic freedom, including trade openness, investment climate, property rights, and regulatory efficiency. This ranking indicates a moderate level of economic freedom, with strengths in trade liberalization and market openness balanced against weaknesses in governance and rule of law. Bosnia and Herzegovina has undertaken reforms aimed at improving the business environment and attracting investment, but issues such as corruption, bureaucratic obstacles, and inconsistent enforcement of property rights continue to pose challenges. The country’s economic freedom ranking reflects the ongoing transition from a centrally planned economy to a market-oriented system, with progress tempered by institutional constraints. In terms of peace and safety, Bosnia and Herzegovina was placed 61st in the Global Peace Index of 2023, which measures the level of peace within countries based on indicators such as levels of violence, conflict, incarceration rates, and militarization. This ranking indicates a relatively stable security environment compared to many other nations, though the country still faces challenges related to political tensions, ethnic divisions, and the legacy of the 1990s conflict. The presence of international peacekeeping forces and ongoing efforts to strengthen the rule of law have contributed to maintaining relative peace. Nonetheless, the index highlights the importance of continued reconciliation and institutional reforms to sustain and improve security conditions. The Corruption Perceptions Index of 2022 ranked Bosnia and Herzegovina 110th, signaling a relatively high perception of corruption within the country’s public sector. This index, compiled by Transparency International, assesses perceived levels of public sector corruption based on expert assessments and opinion surveys. Bosnia and Herzegovina’s low ranking reflects widespread concerns about corruption, including nepotism, bribery, and lack of transparency in government institutions. Corruption has been identified as a major impediment to economic development, governance reforms, and foreign investment. Efforts to combat corruption have been ongoing but face significant obstacles due to entrenched political interests and weak institutional capacity. The index underscores the critical need for stronger anti-corruption measures to improve public trust and economic prospects.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:11:45.428900",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 14,
      "generated_content_length": 11700,
      "generation_type": "detailed_expansion"
    }
  }
]