[
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Uzbekistan** , formerly a Soviet-style command economy, has\nundergone changes that align more with a market economy. Under the\nadministration of Islam Karimov, currency conversion capacity was restricted,\nimports were controlled and Uzbekistan's borders with neighboring Kazakhstan,\nKyrgyzstan, and Tajikistan were sporadically closed. Since the election of\nPresident Shavkat Mirziyoyev, Uzbekistan economic and social reforms have been\nimplemented to boost growth and modernize the country. International Financial\nInstitutions, including EBRD, Asian Development Bank and the World Bank, are\nsupportive of the reform process and increased their presence in the country.\n\nUzbekistan is a major producer and exporter of cotton. In 2022, the Cotton\nCampaign and other agencies, including the US Government, lifted all bans on\nthe import of cotton imposed due to international human rights concerns.\n\nUzbekistan is also a big producer of gold, with the largest open-pit gold mine\nin the world. The country has substantial deposits of silver, strategic\nminerals, gas, and oil.\n\nSince 2016, there have been significant economic reforms in Uzbekistan. The\ncountry liberalised the currency in 2017, allowing freer flows of foreign\ncurrency and allowing the import and export of goods, and the path to foreign\ninvestment. 2019 tax reforms also allowed company consolidation, tax\nsimplification and the professionalisation of the Private sector. The\nGovernment is also committed to privatisation of State Owned Enterprises\n(SOEs), with the domestic IPO of UzAuto predicted in 2022.\n\nThe Uzbekistan Economic Forum run by the Ministry of Finance brings together\nIFIs, businesses, government officials and other stakeholders on an annual\nbasis. The first iteration was in Tashkent, and the Uzbekistan Economic Forum\nII took place in Samarkand. In December 2022, the Uzbek Government received a\nloan from the World Bank of almost US$1bn to \"implement strategic reforms\".\nToday, the volume of GDP of Uzbekistan has reached 146 billion dollars."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "GDP and employment",
    "text": "This is a chart depicting the trend of the gross domestic product in\nUzbekistan in constant prices of 1995, estimated by the International Monetary\nFund with figures in millions of soum. The chart also shows the consumer price\nindex(CPI) as a measure of inflation from the same source and the end-of-year\nU.S. dollar exchange rate from the Central Bank of the Uzbekistan database.\nFor purchasing power parity comparisons in 2006, the U.S. dollar is exchanged\nat 340 som.\n\nYear | GDP (constant prices) | US Dollar Exchange | CPI (2000=100)\n---|---|---|---\n1992 | 330,042 | 1 soum | 0.07\n1995 | 302,790 | 36 soum | 20\n2000 | 356,325 | 325 soum | 100\n2003 | 402,361 | 980 soum | 166\n2006 | 497,525 | 1,240 soum | 226\nUzbekistan: growth of GDP in constant prices 1992–2008\n\nUzbekistan's GDP, like that of all CIS countries, declined during the first\nyears of transition and then recovered after 1995, as the cumulative effect of\npolicy reforms began to be felt. It showed robust growth, rising by 4% per\nyear between 1998 and 2003, and accelerating thereafter to 7–8% per year. In\n2011 the growth rate rose to 9%.\n\nGiven the growing economy, the total number of people employed rose from 8.5\nmillion in 1995 to 13.5 million in 2011. This increase of nearly 25% in the\nlabor force lagged behind the increase in GDP during the same period (64%, see\nchart), which implied a significant increase in labor productivity. Official\nunemployment is low: less than 30,000 job seekers were registered in\ngovernment labor exchanges in 2005–2006 (0.3% of the labor force).\nUnderemployment, on the other hand, is quite high, especially in agriculture,\nwhich accounts for fully 28% of all employed, many working part-time on small\nhousehold plots.\n\nThe minimum wage, public-sector wages, and old-age pensions are raised twice a\nyear to ensure that base income is not eroded by inflation. Although no\nstatistics are published on average wages in Uzbekistan, pensions as a proxy\nfor the average wage increased significantly between 1995 and 2006, both in\nreal terms and in U.S. dollars. The monthly old-age pension increased in real\n(CPI-adjusted) soums by almost a factor of 5 between 1995 and 2006. The\nmonthly pension in U.S. dollars was around $20–$25 until 2000, then dropped to\n$15–$20 between 2001 and 2004, and now is $64. The minimum wage was raised to\n$34.31 in November 2011. Assuming that the average wages in the country are at\na level of 3–4 times the monthly pension, we estimate the wages in 2006 at\n$100–$250 per month, or $3–$8 per day.\n\nAccording to the forecast by the Asian Development Bank, the GDP in Uzbekistan\nin 2009 was expected to grow by 7%. Meanwhile, in 2010 the Uzbekistan GDP\ngrowth is predicted at 6,5%."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Work force and vocational training",
    "text": "Tashkent City Park\n\nLiteracy in Uzbekistan is almost universal, but in order to meet labor force\nneeds, hundreds of students are sent to the United States, Europe, and Japan\nfor university degrees, after which they commit to working for the government\nfor 5 years. About 60% of students who study abroad find employment with\nforeign companies upon completing their degrees despite their commitment to\nwork for the government.\n\nIn addition, Uzbekistan subsidizes studies for students at Westminster\nInternational University in Tashkent—one of the few Western-style institutions\nin Uzbekistan. In 2002, the government \"Istedod\" Foundation (formerly as\n\"Umid\" Foundation) paid for 98 out of 155 students studying at Westminster.\nFor the following academic year, Westminster admitted 360 students, with\nIstedod paying for 160 students. Tuition is $5,200 per academic year.\n\nIn 2008 Management Development Institute of Singapore at Tashkent opened to\nprovide high quality education with international degrees. Tuition fee was\n$5000 in 2012.\n\nIn 2009 Turin Polytechnik University was opened. It is the only university in\nCentral Asia that prepares high quality employees for industries. With the\nclosing or downsizing of many foreign firms, it is relatively easy to find\nqualified employees, though salaries are very low by Western standards. Salary\ncaps, which the government implements in an apparent attempt to prevent firms\nfrom circumventing restrictions on withdrawal of cash from banks, prevent many\nforeign firms from paying their workers as much as they would like. Labor\nmarket regulations in Uzbekistan are similar to those of the Soviet Union,\nwith all rights guaranteed but some rights unobserved. Unemployment is a\ngrowing problem, and the number of people looking for jobs in Russia,\nKazakhstan, and Southeast Asia is increasing each year. Uzbekistan's Ministry\nof Labor does not publish information on Uzbek citizens working abroad, but\nRussia's Federal Migration Service reports 2.5 million Uzbek migrant workers\nin Russia. There are also indications of up to 1 million Uzbek migrants\nworking illegally in Kazakhstan. Uzbekistan's migrant workers may thus be\naround 3.5–4 million people, or a staggering 25% of its labor force of 14.8\nmillion. The U.S. Department of State also estimates that between three and\nfive million Uzbek citizens of working age live outside Uzbekistan.\n\nAfter acknowledging the need for more higher education to support labor market\nneeds, new programs were opened and cooperation commenced with foreign\nuniversities. Moreover, private higher education providers started to emerge\non the market to provide students with necessary skills, knowledge and\ncompetencies required on the labor market. One of the private universities in\nTashkent TEAM University aims at development of skills necessary for starting\nentrepreneurial activities, thus contributing to development of businesses and\nprivate enterprises."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Prices and monetary policy",
    "text": "Uzbekistan experienced galloping inflation of around 1000% per year\nimmediately after independence (1992–1994). Stabilization efforts implemented\nwith active guidance from the International Monetary Fund rapidly paid off, as\ninflation rates were brought down to 50% in 1997 and then to 22% in 2002.\nSince 2003 annual inflation rates averaged less than 10%.\n\nThe severe inflationary pressures that characterized the early years of\nindependence inevitably led to a dramatic depreciation of the national\ncurrency. The exchange rate of Uzbekistan's first currency, the \"notional\"\nrouble inherited from the Soviet period and its successor, the transient\n\"coupon soum\" introduced in November 1993 in a ratio of 1:1 to the rouble,\nwent up from 100 roubles/US$ in the early 1992 to 3,627 roubles (or coupon\nsoum) in mid-April 1994. On July 1, 1994, the \"coupon soum\" was replaced with\nthe permanent new Uzbek soum (UZS) in a ratio of 1000:1, and the starting\nexchange rate for the new national currency was set at 7 soum/US$, implying an\nalmost two-fold depreciation since mid-April. Within the first six months,\nbetween July and December 1994, the national currency depreciated further to\n25 soum/US$ and continued depreciating at a fast clip until December 2002,\nwhen the exchange rate had reached 969 soum/US$, i.e., 138 times the starting\nexchange rate eight and a half years earlier or nearly 10,000 times the\nexchange rate in early 1992, soon after the declaration of independence. Then\nthe depreciation of the soum virtually stopped in response to the government's\nstabilization program, which at the same time dramatically reduced the\ninflation rates. During the four years that followed (2003–2007) the exchange\nrate of the soum to the US dollar increased only by a factor of 1.33, from 969\nsoum to around 1,865 soum in May 2012.\n\nFrom 1996 until the spring of 2003, the official and so-called \"commercial\"\nexchange rate – both set administratively by the Central Bank – were highly\novervalued. Many businesses and individuals were unable to buy dollars legally\nat these \"low\" rates, so a widespread black market developed to meet hard\ncurrency demand. The spread between the official exchange rate and the curb\nrate widened especially after the 1998 Russian financial crisis: at the end of\n1999 the curb rate stood at 550 soum/US$ compared with the official rate of\n140 soum/US$, a gap by nearly a factor of 4 (up from a factor of \"only\" 2 in\n1997 and the first half of 1998). By mid-2003, the government's stabilization\nand liberalization efforts had reduced the gap between the black market,\nofficial, and commercial rates to approximately 8% and it quickly disappeared\nas the soum was made convertible after October 2003. Today, four foreign\ncurrencies—the U.S. dollar, the euro, the pound sterling, and the yen—are\nfreely exchanged in commercial booths all around the cities, while other\ncurrencies, including the Russian rouble and the Kazakh tenge, are bought and\nsold by individual (\"black market\") money changers, who are allowed to operate\nopenly without harassment. The foreign exchange regime since October 2003 is\ncharacterized as \"controlled floating rate\". Liberalization of the trade\nregime remains a prerequisite for Uzbekistan to proceed to an IMF-financed\nprogram. In 2012, \"black market\" rate is again significantly higher than\nofficial rate, 2,850 soum/US$ vs. 1,865 soum/US$ (as of mid-June 2011). This\ncurb rate is often referred to as 'bazar rate', because money changers operate\nat or near 'bazars' – large farmer markets.\n\nTax collection rates remained high, due to the use of the banking system by\nthe government as a collection agency. Technical assistance from the World\nBank, Office of Technical Assistance at the U.S. Treasury Department, and UNDP\nis being provided in reforming the Central Bank and Ministry of Finance into\ninstitutions capable of conducting market-oriented fiscal and monetary policy."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Agriculture",
    "text": "In 2018, Uzbekistan produced:\n\n* 5.4 million tonnes of wheat;\n* 2.9 million tons of potato;\n* 2.2 million tons of cotton (8th largest producer in the world);\n* 2.2 million tons of tomato (14th largest producer in the world);\n* 2.1 million tonnes of carrot (2nd largest producer in the world, just behind China);\n* 1.8 million tons of watermelon (8th largest producer in the world);\n* 1.5 million tons of grape (15th largest producer in the world);\n* 1.4 million tons of onion (15th largest producer in the world);\n* 1.1 million tons of apple (14th largest producer in the world);\n* 857 thousand tons of cucumber (7th largest producer in the world);\n* 743 thousand tons of cabbage;\n* 493 thousand tons of apricot (2nd largest producer in the world, just behind Turkey);\n* 413 thousand tons of maize;\n* 254 thousand tons of garlic;\n* 221 thousand tons of rice;\n* 172 thousand tons of cherry;\n* 161 thousand tons of peach;\n* 134 thousand tons of plum (17th largest producer in the world);\n\nIn addition to smaller productions of other agricultural products.\n\nAt the end of 2013, the government announced through the Central Bank of the\nRepublic of Uzbekistan that it predicted agriculture as playing a major\ncomponent of the country's economic development in the future. Agriculture in\nUzbekistan employs 28% of labor force and contributes 24% of GDP (2006 data).\nAnother 8% of GDP is from processing of domestic agricultural output. Cotton,\nonce Uzbekistan's star cash earner, has lost much its luster since\nindependence as wheat began to gain prominence from considerations of food\nsecurity for the rapidly growing population. Areas cropped to cotton were\nreduced by more than 25% from 2 million hectares in 1990 to less than 1.5\nmillion hectares in 2006, while wheat cultivation jumped 60% from around 1\nmillion hectares in 1990 to 1.6 million hectares in 2006. Cotton production\ndropped from 3 million tons annually in the pre-independence decade to around\n1.2 million tons since 1995, but even at these reduced levels Uzbekistan\nproduces 3 times as much cotton as all the other Central Asian countries and\nAzerbaijan combined. Cotton exports tumbled from highs of around 45% of\nUzbekistan's total exports in the early 1990s to 17% in 2006. Uzbekistan is\nthe largest producer of jute in West Asia and it also produces significant\nquantities of silk (Uzbek ikat), fruit, and vegetables, with food products\ncontributing nearly 8% of total exports in 2006. Virtually all agriculture\nrequires irrigation, but because of budgetary constraints there has been\npractically no expansion of irrigated area since independence: it remains\nstatic at 4.2 million hectares, the level reached by 1990 after rapid growth\nduring the Soviet period.\n\nGovernment intervention in agriculture is reflected in the persistence of\nstate orders for the two main cash crops, cotton and wheat. Farmers receive\nbinding directives on the area to be cropped to these commodities and are\nobliged to surrender their harvest to designated marketers at state-fixed\nprices. The incomes of farmers and agricultural workers are substantially\nlower than the national average because the government pays them less than the\nworld prices for their cotton and wheat, using the difference to subsidize\ncapital intensive industrial concerns, such as factories producing\nautomobiles, airplanes, and tractors. Consequently, many farmers focus on\nproduction of fruits and vegetables on their small household plots, because\nthe prices of these commodities are determined by supply and demand, not by\ngovernment decrees. Farmers also resort to smuggling cotton and especially\nwheat across the border with Kazakhstan and Kyrgyzstan in order to obtain\nhigher prices.\n\nThe government's pricing for the main cash crops, cotton and wheat, is\napparently responsible for the exceptionally rapid growth of the cattle herd\nin recent years, as the prices of milk and meat, like those of fruits and\nvegetables, are also determined by market forces. The number of cattle\nincreased from 4 million head in 1990 to 7 million head in 2006, and virtually\nall these animals are maintained by rural families with just 2–3 head per\nhousehold. Sales of own-produced milk, meat, and vegetables in town markets\nare an important source for augmenting rural family incomes.\n\nThe Soviet practice of using \"volunteer labor\" to help gathering the cotton\nharvest continues in Uzbekistan where schoolchildren, university students,\nmedical professionals, and state employees are driven en masse out to the\nfields every year. A recent article posted by a domestic news agency\n(admittedly with strong anti-government leanings) describes Uzbekistan's\ncotton as \"riches gathered by the hands of hungry children\"."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Natural resources and energy",
    "text": "In 2019, the country was the 5th largest world producer of uranium; 12th\nlargest world producer of gold; 7th largest world producer of rhenium; 12th\nlargest world producer of molybdenum; 21st largest world producer of\nphosphate, and the 19th largest world producer of graphite\n\nMinerals and mining are important economic sectors. Gold and cotton are major\nforeign exchange earners, unofficially estimated at 20% of total exports.\nUzbekistan is the world's seventh-largest gold producer, mining about 80 tons\nper year, and holds the fourth-largest reserves in the world. Uzbekistan has\nan abundance of natural gas, used both for domestic consumption and export;\noil used for domestic consumption; and significant reserves of copper, lead,\nzinc, tungsten, and uranium. Energy use is generally high since the controlled\nprices do not stimulate consumers to conserve energy. Uzbekistan was a partner\ncountry of the EU INOGATE energy programme, which focused on enhancing energy\nsecurity, convergence of member state energy markets on the basis of EU\ninternal energy market principles, supporting sustainable energy development,\nand attracting investment for energy projects of common and regional interest.\n\nThe country's largest steel manufacturer is Uzmetkombinat. The company planned\nan IPO in 2023."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "External trade and investment",
    "text": "Uzbekistan export destinations in 2006| This section needs to be **updated**.\nPlease help update this article to reflect recent events or newly available\ninformation. _( April 2025)_\n---|---\n\nSince the 2017 liberalisation of the foreign exchange market, Uzbekistan has\nseen rapid growth in exports. Traditional export products such as gas and\ncotton are now kept domestically for processing. They have been replaced by a\nvast growth in exports in areas such as fruit, textiles and home appliances.\nIn recent years textile export has doubled in revenue to almost US$3bn worth\nof goods exports. Home appliance manufacturer Artel has seen exports rise from\n$5.6m in 2017, to around $100m in 2021.\n\nBefore this, the system of multiple exchange rates combined with the highly\nregulated trade regime caused both imports and exports to drop each from about\nUS$4.5 billion in 1996 to less than US$3 billion in 2002. The success of\nstabilization and currency liberalization in 2003 has led to significant\nincreases in exports and imports in recent years, although imports have\nincreased much less rapidly: while exports had more than doubled to US$15.5 by\n2011, imports had risen to US$6.5 billion only, reflecting the impact of the\ngovernment's import substitution policies designed to maintain hard currency\nreserves. Draconian tariffs, sporadic border closures, and border crossing\n\"fees\" have a negative effect on legal imports of both consumer products and\ncapital equipment.\n\nUzbekistan is a member of the International Monetary Fund, World Bank, Asian\nDevelopment Bank, and European Bank for Reconstruction and Development. It has\nobserver status at the World Trade Organization, is a member of the World\nIntellectual Property Organization, and is a signatory to the _Convention on\nSettlement of Investment Disputes Between States and Nationals of Other\nStates_ , the _Paris Convention for the Protection of Industrial Property_ ,\nthe _Madrid Agreement on Trademarks Protection_, and the _Patent Cooperation\nTreaty_. In 2002, Uzbekistan was again placed on the special \"301\" Watch List\nfor lack of intellectual copyright protection.\n\nDaewoo Gentra is currently a flagship of UzDaewooAuto.\n\nUntil 2017, according to EBRD transition indicators, Uzbekistan's investment\nclimate remains among the least favorable in the CIS, with only Belarus and\nTurkmenistan ranking lower. The unfavorable investment climate has caused\nforeign investment inflows to dwindle to a trickle. It is believed that\nUzbekistan has the lowest level of foreign direct investment per capita in the\nCIS. Since Uzbekistan's independence, U.S. firms have invested roughly $500\nmillion in the country, but due to declining investor confidence, harassment,\nand currency convertibility problems, numerous international investors have\nleft the country or are considering leaving. In 2005, the Central Bank has\nrevoked the license of the nascent Biznes Bank citing unspecified violations\nof local currency exchange rules. The revocation prompted immediate bankruptcy\nprocedures, under which clients' deposits stay arrested for two month. No\ninterest was accrued during that two-month period. In 2006, the Government of\nUzbekistan forced out Newmont Mining Corporation (at the time the largest U.S.\ninvestor) from its gold mining joint venture in the Muruntau gold mine.\nNewmont and the government resolved their dispute, but the action adversely\naffected Uzbekistan's image among foreign investors. The government attempted\nthe same with British-owned Oxus Mining. Coscom, a U.S.-owned\ntelecommunications company, involuntarily sold its stake in a joint venture to\nanother foreign company. GM-DAT, a Korean subsidiary of GM, is the only known\nU.S. business to have entered Uzbekistan in over two years. It recently signed\na joint-venture agreement with UzDaewooAuto to assemble Korean-manufactured\ncars for export and domestic sale. Other large U.S. investors in Uzbekistan\ninclude Case IH, manufacturing and servicing cotton harvesters and tractors;\nCoca-Cola, with bottling plants in Tashkent, Namangan, and Samarkand; Texaco,\nproducing lubricants for sale in the Uzbek market; and Baker Hughes, in oil\nand gas development.\n\nIn 2024, Uzbekistan’s external debt reached $64.1 billion, or 55.7% of GDP, up\nfrom 51.9% in 2023. This included both public and private liabilities, though\nmuch of the private sector; particularly banks and industrial enterprises;\nremained state-owned. Government debt rose to $33.9 billion (29.5% of GDP),\nwhile corporate external debt reached $30.2 billion (26.2%). The government\ncontinued to control about 65% of the banking sector and held stakes in major\nfirms like UzAuto Motors and Uzbekneftegaz. Public debt was projected to rise\nto $45.1 billion (36.7% of GDP) by the end of 2025.\n\nIn 2025, President Shavkat Mirziyoyev signed a law on Uzbekistan's accession\nto the Agreement Establishing the Eurasian Development Bank (EADB). Uzbekistan\nwill become the seventh member of the Bank and the third largest shareholder\nwith a 10% equity stake."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Banking",
    "text": "Uzbekistan's banks have demonstrated reasonably stable performance in a\nlargely state-dominated local economy. Sector stability is currently supported\nby rapid economic growth, low exposure to external financial markets and the\nstrong external and fiscal position of the sovereign. However, the sector\nremains vulnerable to possible economic shocks due to weak corporate\ngovernance and risk management, fast recent asset growth, significant directed\nlending and acquisitions of problem assets. Banks’ foreign currency\nobligations, specifically those arising from trade finance, are particularly\nvulnerable due to existing foreign exchange constraints.\n\nAccording to Fitch Ratings, there are notable risks of asset quality\ndeterioration in case of a reversal in economic trends. The funding base is\nmainly short-term, largely sourced from corporate current accounts, while\nretail funds account for only a small 25% of total deposits. Longer-term\nfunding is provided by the Ministry of Finance and other state agencies, which\ncomprise a notable proportion of sector liabilities. Foreign funding is small,\nestimated at 10% of the total liabilities, and plans for further borrowings\nare moderate. Liquidity management is constrained be the lack of deep capital\nmarkets, and banks generally tend to hold substantial cash reserves on their\nbalance sheets. The quality of capital is sometimes compromised by less\nconservative regulatory requirements for recognition of credit impairment and\nby investments in non-core assets."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Retail",
    "text": "Uzbekistan's retail sector remains dominated by traditional markets, known as\n_bozorlar_ , where individual vendors sell food, housewares, clothing, and\nother consumer goods. But the country's retail sector is rapidly modernizing.\nThe construction of modern supermarkets and malls has accelerated in recent\nyears. The country's retail market was estimated at $17 billion in 2017 and\nrising incomes, population growth, and a move from informal to formal retail\nare expected to drive continued expansion of the sector. Major supermarket\nchains include local players Korzinka.uz and Makro (Uzbekistan) and the French\nmultinational chain Carrefour, which will open its first store in Uzbekistan\nin 2021. The country's first modern shopping malls are located in Tashkent,\nand include the Samarkand Darvoza and Compass developments. The sector has\nalso seen growth in online retail. In 2021, Korzinka acquired a US$40m stake\nin Anglesey Food, the Singapore mother entity of Korzinka. In 2021, the\ncompany also signed a signed $12 million in debt financing to promote food\nsecurity and sustain the livelihoods of more than 5,000 employees and 1,200\nfarm workers in Uzbekistan."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Tourism",
    "text": "Silk road route's three important cities are located in Uzbekistan, namely\nKhiva, Bukhara and Samarkand. There are numerous well connected tourist\ndestinations in Uzbekistan. There are five UNESCO World Heritage Sites in\nUzbekistan and 30 are on tentative list."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Controversy",
    "text": "According to the Organized Crime and Corruption Reporting Project (OCCRP),\nVlast, and iStories, after February 24, 2022, Uzbekistan significantly\nincreased its exports of cotton pulp and nitrocellulose, key components for\nmaking explosives and gunpowder, to Russia. According to Ekonomichna Pravda,\nat least two large Uzbek exporters have been working with Russian military-\nindustrial complex enterprises. Documents from the Russian Federal Tax Service\nconfirm that at least three Russian companies – Bina Group, Khimtrade, and\nLenakhim - sold imported cotton pulp to military plants in Russia. Among them:\nKazan Powder Plant (a strategic defense-industrial enterprise that produces\ngunpowder and charges for various types of weapons, subject to US sanctions),\nTambov Powder Plant (a defense-industrial enterprise that produces ammunition\nand special chemicals, It is subject to US and Ukrainian sanctions), Perm\nPowder Plant (an enterprise involved in the production of Topol-M and Bulava\nintercontinental ballistic missiles, as well as Kornet ATGMs and Grad and\nSmerch multiple rocket launchers. It is under Ukrainian sanctions)."
  },
  {
    "chapter_name": "Economy of Uzbekistan",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Miscellaneous data",
    "text": "The following table shows the main economic indicators in 1993–2024.\n\nYear  | GDP\n(in billion US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in billion US$ nominal) | GDP per capita\n(in US$ nominal) | GDP growth (real)  | Inflation (in Percent)  | Government debt (Percentage of GDP)\n---|---|---|---|---|---|---|---\n1993  | 46.6  | 2,133  | 6.9  | 316  | −2.3%  | 534.2%  | n/a\n1994  | 45.1  | 2,026  | 8.2  | 367  | −5.2%  | 1,568.3%  | n/a\n1995  | 45.7  | 2,013  | 12.7  | 562  | −0.9%  | 304.6%  | n/a\n1996  | 47.3  | 2,045  | 17.5  | 755  | 1.7%  | 54.0%  | n/a\n1997  | 50.6  | 2,121  | 18.4  | 772  | 5.2%  | 70.9%  | 15.3%\n1998  | 53.4  | 2,203  | 18.7  | 773  | 4.3%  | 29.0%  | 18.0%\n1999  | 56.5  | 2,297  | 21.4  | 869  | 4.3%  | 29.1%  | 18.4%\n2000  | 59.9  | 2,448  | 17.2  | 702  | 3.8%  | 25.0%  | 29.5%\n2001  | 63.9  | 2,574  | 14.6  | 588  | 4.2%  | 27.3%  | 44.8%\n2002  | 67.4  | 2,686  | 12.1  | 482  | 4.0%  | 27.3%  | 41.6%\n2003  | 71.7  | 2,819  | 12.7  | 499  | 4.2%  | 12.5%  | 31.4%\n2004  | 79.0  | 3,075  | 15.0  | 585  | 7.4%  | 7.3%  | 26.9%\n2005  | 87.2  | 3,352  | 17.9  | 689  | 7.0%  | 10.7%  | 21.0%\n2006  | 96.7  | 3,674  | 21.3  | 811  | 7.5%  | 13.1%  | 13.5%\n2007  | 108.7  | 4,077  | 28.0  | 1,049  | 9.5%  | 11.2%  | 9.6%\n2008  | 120.8  | 4,461  | 35.9  | 1,325  | 9.0%  | 13.1%  | 8.3%\n2009  | 131.4  | 4,771  | 41.9  | 1,523  | 8.1%  | 12.3%  | 7.3%\n2010  | 142.4  | 5,085  | 49.8  | 1,777  | 7.1%  | 12.3%  | 6.6%\n2011  | 156.3  | 5,366  | 60.2  | 2,068  | 7.5%  | 12.4%  | 6.3%\n2012  | 170.5  | 5,768  | 67.5  | 2,285  | 7.1%  | 11.9%  | 6.8%\n2013  | 186.0  | 6,203  | 73.2  | 2,440  | 7.3%  | 11.7%  | 6.2%\n2014  | 202.3  | 6,634  | 80.8  | 2,651  | 6.9%  | 9.1%  | 6.1%\n2015  | 218.9  | 7,056  | 85.7  | 2,761  | 7.2%  | 8.5%  | 10.0%\n2016  | 234.1  | 7,414  | 85.7  | 2,713  | 5.9%  | 8.8%  | 8.2%\n2017  | 248.8  | 7,745  | 69.7  | 2,170  | 4.4%  | 13.9%  | 17.3%\n2018  | 263.2  | 8,058  | 58.7  | 1,797  | 5.6%  | 17.5%  | 17.5%\n2019  | 281.7  | 8,469  | 67.3  | 2,024  | 6.8%  | 14.5%  | 25.4%\n2020  | 283.9  | 8,372  | 66.4  | 1,960  | 1.6%  | 12.9%  | 33.7%\n2021  | 316.7  | 9,163  | 77.3  | 2,238  | 8.0%  | 10.8%  | 31.7%\n2022  | 359.6  | 10,196  | 90.1  | 2,555  | 6.0%  | 11.4%  | 30.5%\n2023  | 396.0  | 10,992  | 101.6  | 2,820  | 6.3%  | 10.0%  | 32.5%\n2024  | 428.2  | 11,596  | 112.7  | 3,051  | 5.6%  | 10.0%  | 34.3%\n2025  | 471.9  | 12,596  | 127.2  | 3,355  | 6.3%  | 9.4%  | 35.4%\n\n**Household income or consumption by percentage share** :\n\n* _Lowest 10%_ : 2.8%\n* _Highest 10%_ : 29.6% (2003)\n\n**Distribution of family income –Gini index**: 36.8 (2003)\n\n**Agriculture – products** : cotton, vegetables, fruits, grain; livestock\n\n**Industrial production growth rate** : 6.2% (2003 est.)\n\n**Electricity** :\n\n* _Production_ : 47.7 TWh (2002)\n* _Consumption_ : 46.66 TWh (2002)\n* _Exports_ : 4.5 TWh (2002)\n* _Imports_ : 6.8 TWh (2002)\n\n**Electricity – production by source** :\n\n* _Fossil fuel_ : 88.2%\n* _Hydro_ : 11.8%\n* _Other_ : 0% (2001)\n* _Nuclear_ : 0%\n\n**Oil** :\n\n* _Production_ : 143,300 barrels per day (22,780 m3/d) (2004 est.)\n* _Consumption_ : 142,000 barrels per day (22,600 m3/d) (2001 est.)\n* _Exports_ : NA\n* _Imports_ : NA\n* _Proved reserves_ : 297,000,000 barrels (47,200,000 m3) (1 January 2002)\n\n**Natural gas** :\n\n* _Production_ : 63.1 billion m3 (2001 est.)\n* _Consumption_ : 45.2 billion m3 (2001 est.)\n* _Exports_ : 17.9 billion m3 (2001 est.)\n* _Imports_ : 0 m3 (2001 est.)\n* _Proved reserves_ : 937.3 billion m3 (1 January 2002)\n\n**Current account balance** : $3.045 billion (2007 est.)\n\n**Exports – commodities** : cotton 17.2%, energy products 13.1%, metals 12.9%,\nmachinery and equipment 10.1%, food products 7.9%, chemical products 5.6%,\nservices 12.1%( 2006)\n\n**Imports – commodities** : machinery and equipment 40.3%, chemical products\n15.0%, metals 10.4%, food products 8.1%, energy products 4.3%, services 9.1%\n(2006)\n\n**Reserves of foreign exchange & gold**: $5.6 billion (Dec. 2007 est.)\n\n**Exchange rates** :\n\n* UZS per USD – 1,865 (early 2012)\n* UZS (s'om) per USD – 10,097 (Apr 2020)\n* UZS per EUR – 2,900\n* UZS per EUR – 10,981 (Apr 2020)\n\n**Current economy growth (6 months of 2009)** :\n\n* _GDP growth_ : +8,2%\n* _Volume of industrial production_ : +9.1%\n* _Volume of agricultural production_ : +4,6%"
  }
]