[
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Cape Verde** is a service-oriented economy that is focused on\ncommerce, trade, transport and public services. Cape Verde is a small\narchipelagic nation that lacks resources and has experienced severe droughts.\nAgriculture is made difficult by lack of rain and is restricted to only four\nislands for most of the year. Cape Verde's economy has been steadily growing\nsince the late 1990s, and it is now officially considered a country of average\ndevelopment, being only the second African country to have achieved such\ntransition, after Botswana in 1994. Cape Verde has significant cooperation\nwith Portugal at every level of the economy, which has led it to link its\ncurrency (the Cape Verdean escudo) first to the Portuguese escudo and, in\n1999, to the euro.",
    "openai_summarised_points": [
      "• The economy of Cape Verde is primarily service-oriented, with a focus on commerce, trade, transport, and public services.",
      "• Cape Verde is a small archipelagic nation characterized by a lack of natural resources and a history of severe droughts.",
      "• Agricultural activities are limited due to insufficient rainfall and are confined to only four islands for most of the year.",
      "• The country's economy has experienced steady growth since the late 1990s.",
      "• Cape Verde is officially classified as a country of average development, becoming only the second African nation to achieve this status after Botswana in 1994.",
      "• The nation maintains significant economic cooperation with Portugal at all levels of its economy.",
      "• This cooperation has influenced Cape Verde to link its currency, the Cape Verdean escudo, initially to the Portuguese escudo and subsequently to the euro in 1999."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:17.365493",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 774,
      "bullet_points_count": 7
    },
    "generated_detailed_content": "The economy of Cape Verde is predominantly service-oriented, with commerce, trade, transport, and public services constituting the main pillars of economic activity. This emphasis on services reflects the country’s strategic position as a hub for maritime transport and its growing tourism sector, which collectively contribute significantly to the national income. The commercial sector thrives on both domestic trade and international exchanges, leveraging Cape Verde’s geographic location in the central Atlantic Ocean to facilitate connections between Africa, Europe, and the Americas. Public services, including government administration and education, also play a crucial role in sustaining employment and supporting economic stability. Cape Verde is a small archipelagic nation composed of ten volcanic islands, situated approximately 570 kilometers off the coast of West Africa. The country is characterized by a scarcity of natural resources, which has historically constrained its economic development. The islands have limited arable land and mineral wealth, factors that have necessitated a reliance on external trade and service industries. Furthermore, Cape Verde has endured a history marked by frequent and severe droughts, which have periodically undermined agricultural productivity and exacerbated food insecurity. These environmental challenges have shaped the nation’s economic structure and policy priorities, compelling it to diversify beyond traditional sectors. Agricultural activities in Cape Verde remain limited and are largely constrained by the country’s arid climate and insufficient rainfall. The islands receive minimal precipitation, averaging between 100 and 500 millimeters annually, which is inadequate for most forms of intensive farming. Consequently, agricultural production is mostly confined to four islands—Santiago, Santo Antão, Fogo, and São Nicolau—where microclimates and slightly higher rainfall levels permit cultivation. Even on these islands, farming is predominantly subsistence-oriented, focusing on drought-resistant crops such as maize, beans, and sweet potatoes. Livestock rearing is similarly modest, and the sector’s contribution to GDP remains relatively minor compared to services and industry. The limited agricultural base has necessitated substantial food imports to meet domestic demand. Since the late 1990s, Cape Verde’s economy has experienced steady growth, driven by structural reforms and increased investment in key sectors such as tourism, infrastructure, and financial services. The government implemented policies aimed at liberalizing the economy, improving the business environment, and attracting foreign direct investment. These reforms, coupled with political stability and improved governance, have fostered a favorable climate for economic expansion. Growth rates have averaged around 4 to 5 percent annually during this period, reflecting the country’s successful transition toward a more diversified and service-oriented economy. The expansion of the tourism industry, in particular, has played a pivotal role in generating foreign exchange earnings and creating employment opportunities. Cape Verde is officially classified as a country of average development, a status that it achieved in 2007, making it only the second African nation to reach this classification after Botswana in 1994. This designation by the United Nations Development Programme (UNDP) reflects improvements in various human development indicators, including life expectancy, education, and per capita income. The classification signifies Cape Verde’s progress in overcoming historical challenges related to poverty and underdevelopment, positioning it among middle-income countries. This achievement underscores the effectiveness of national development strategies and the country’s commitment to sustainable economic growth and social advancement. The nation maintains significant economic cooperation with Portugal, its former colonial power, which continues to influence Cape Verde’s economic policies and development trajectory. This cooperation encompasses various dimensions, including trade relations, technical assistance, investment, and cultural exchange. Portugal remains one of Cape Verde’s principal trading partners and a major source of foreign investment and development aid. Bilateral agreements facilitate collaboration in sectors such as education, health, infrastructure, and governance, reinforcing institutional capacity and economic integration. The enduring ties between the two countries reflect historical connections and shared linguistic and cultural affinities, which have fostered a mutually beneficial partnership. This close economic relationship with Portugal has also influenced Cape Verde’s monetary policy, particularly in the management of its currency, the Cape Verdean escudo. Initially, the escudo was pegged to the Portuguese escudo, providing exchange rate stability and facilitating trade and financial transactions between the two countries. Following Portugal’s adoption of the euro in 1999, Cape Verde adjusted its currency linkage accordingly, fixing the Cape Verdean escudo to the euro at a stable exchange rate. This arrangement has helped to anchor inflation expectations, reduce currency volatility, and enhance investor confidence. The currency peg reflects Cape Verde’s strategic choice to maintain monetary stability through alignment with a major international currency, thereby supporting its broader economic development objectives.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:27.774327",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 7,
      "generated_content_length": 5546,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Resources",
    "text": "About 75% of food is imported. Cape Verde annually runs a high trade deficit,\nfinanced by foreign aid and remittances from emigrants; remittances constitute\na supplement to GDP of more than 20%. Economic reforms, launched by the new\ndemocratic government in 1991, are aimed at developing the private sector and\nattracting foreign investment to diversify the economy. Since 1991, the\npolicies the government has pursued include an open welcome to foreign\ninvestors and a far-reaching privatization program.\n\nFish and shellfish are plentiful, and small quantities are exported. Cape\nVerde has cold storage and freezing facilities as well as fish processing\nplants in Mindelo, Praia, and on Sal. However, the fishing potential, mostly\nlobster and tuna, is not fully exploited.\n\nThe economy is service-oriented, with commerce, transport, and public services\naccounting for almost 70% of the GDP. Although nearly 35% of the population\nlives in rural areas, the share of agriculture in GDP in 2010 was only 9.2%\n(up from 8.9% in 1995); of the 1998 total, fishing accounts for 1.5%.\n\nThe Cape Verdean government established the top priorities for development as\nthe promotion of a market economy and of the private sector; the development\nof tourism, light manufacturing industries, and fisheries; and the development\nof transport, communications, and energy facilities. In 1994-95 Cape Verde\nreceived a total of about U.S.$50 million in foreign investments, of which 50%\nwas in industry, 19% in tourism, and 31% in fisheries and services. Prospects\nfor 2000 depend heavily on the maintenance of aid flows, remittances, and the\nmomentum of the government's development program.",
    "openai_summarised_points": [
      "• Approximately 75% of food consumed in Cape Verde is imported, indicating a heavy reliance on external sources for sustenance.",
      "• The country annually experiences a significant trade deficit, which is financed primarily through foreign aid and remittances from emigrants.",
      "• Remittances from Cape Verdean emigrants contribute more than 20% to the nation's Gross Domestic Product (GDP), serving as a crucial economic supplement.",
      "• Economic reforms initiated by the new democratic government in 1991 aim to develop the private sector and attract foreign investment to diversify the economy.",
      "• Since 1991, the government has adopted policies including an open stance toward foreign investors and a comprehensive privatization program to stimulate economic growth.",
      "• The fishing industry in Cape Verde is characterized by abundant fish and shellfish resources, with small quantities exported.",
      "• The country possesses cold storage, freezing facilities, and fish processing plants located in Mindelo, Praia, and Sal, supporting its fisheries sector.",
      "• Despite the potential, the fishing industry, primarily targeting lobster and tuna, remains underexploited and not fully developed.",
      "• The economy is predominantly service-oriented, with commerce, transport, and public services making up nearly 70% of the GDP.",
      "• Although about 35% of the population resides in rural areas, agriculture's contribution to GDP was only 9.2% in 2010, a slight increase from 8.9% in 1995.",
      "• In 1998, fishing contributed approximately 1.5% to the total GDP.",
      "• The Cape Verdean government prioritized promoting a market economy and strengthening the private sector as key development strategies.",
      "• Other development priorities include expanding tourism, light manufacturing industries, fisheries, and improving transport, communications, and energy infrastructure.",
      "• Between 1994 and 1995, Cape Verde attracted approximately U.S.$50 million in foreign investments, with 50% allocated to industry, 19% to tourism, and 31% to fisheries and services.",
      "• The economic outlook for 2000 heavily depends on the continuation of aid flows, remittances, and the progress of the government's development initiatives."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:22.586126",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1670,
      "bullet_points_count": 15
    },
    "generated_detailed_content": "Cape Verde has historically exhibited a significant dependence on imported foodstuffs, with approximately 75% of the food consumed within the country being sourced from abroad. This heavy reliance on external supplies underscores the challenges faced by the archipelago in achieving food self-sufficiency, largely due to its arid climate, limited arable land, and recurrent droughts that constrain domestic agricultural production. Consequently, the nation's food security is intricately tied to international trade and the stability of global markets, rendering it vulnerable to external shocks and price fluctuations. The country’s economy has consistently experienced a substantial trade deficit, reflecting the imbalance between imports and exports. This persistent deficit has been primarily financed through two critical channels: foreign aid and remittances sent by Cape Verdean emigrants living abroad. Foreign aid, provided by various international donors and development agencies, has played a pivotal role in supporting the government’s budgetary needs and funding development projects. Meanwhile, remittances have emerged as a vital lifeline for the economy, supplementing household incomes and contributing to national economic stability. Remittances from the Cape Verdean diaspora constitute a significant portion of the country’s Gross Domestic Product (GDP), accounting for more than 20%. This substantial inflow of funds has not only bolstered domestic consumption but also facilitated investment in housing, education, and small businesses. The reliance on remittances reflects the extensive migration patterns established over decades, with Cape Verdeans maintaining strong ties to their homeland and actively supporting family members. This financial support has been instrumental in cushioning the economy against external shocks and fostering socio-economic development. In response to the structural challenges facing the economy, the new democratic government that came to power in 1991 embarked on a series of economic reforms aimed at revitalizing the private sector and attracting foreign investment. These reforms were designed to diversify the economy beyond its traditional reliance on agriculture and remittances, thereby promoting sustainable growth. The government recognized the necessity of creating a more conducive environment for private enterprise and foreign participation to stimulate economic dynamism and reduce vulnerability. Since 1991, the government adopted a range of policies that underscored an open stance toward foreign investors and implemented a comprehensive privatization program. This approach was intended to dismantle state monopolies and encourage competition, thereby enhancing efficiency and productivity across various sectors. The privatization efforts targeted key industries and public enterprises, facilitating the transfer of ownership to private hands and fostering a market-oriented economy. These policy shifts were complemented by regulatory reforms aimed at improving the investment climate and ensuring transparency. The fishing industry in Cape Verde is endowed with abundant fish and shellfish resources, reflecting the rich marine biodiversity surrounding the islands. Despite this natural wealth, the sector has remained relatively modest in scale, with only small quantities of fish and seafood being exported. The fishing industry primarily focuses on species such as lobster and tuna, which have significant commercial value. However, the full potential of these resources has yet to be realized, as the industry faces challenges related to infrastructure, capital investment, and market access. To support the fisheries sector, Cape Verde has developed cold storage and freezing facilities, as well as fish processing plants located in key urban centers including Mindelo, Praia, and Sal. These installations are critical for preserving the quality of seafood products and enabling their distribution both domestically and internationally. The presence of such infrastructure indicates a foundational capacity to expand the fisheries industry, although further development and modernization are required to enhance competitiveness and increase export volumes. Despite the availability of valuable marine resources and existing infrastructure, the fishing industry remains underexploited and not fully developed. Factors contributing to this underdevelopment include limited investment, inadequate technology, and constraints in skilled labor. Moreover, the sector has yet to achieve economies of scale or establish robust value chains that could maximize returns from the abundant lobster and tuna stocks. Addressing these challenges is essential for unlocking the industry’s potential as a driver of economic growth and employment. The broader economy of Cape Verde is predominantly service-oriented, with commerce, transport, and public services collectively accounting for nearly 70% of the GDP. This dominance of the service sector reflects the country’s strategic positioning as a hub for maritime transport and its growing tourism industry. The prominence of services also highlights the limited contribution of traditional sectors such as agriculture and fishing to overall economic output, underscoring the structural transformation that the economy has undergone in recent decades. Agriculture, while still a significant source of livelihood for a considerable portion of the population, contributes relatively little to the national economy. Approximately 35% of Cape Verde’s population resides in rural areas, where agricultural activities are concentrated. Nevertheless, agriculture’s share of GDP was only 9.2% in 2010, representing a slight increase from 8.9% recorded in 1995. This marginal growth indicates persistent challenges in the sector, including limited land resources, water scarcity, and vulnerability to climatic variability, which have constrained productivity and expansion. In 1998, the fishing industry’s contribution to the total GDP was approximately 1.5%, reflecting its modest scale relative to other sectors. Although the sector holds potential for growth given the country’s marine resources, its current economic impact remains limited. This low contribution is indicative of the underutilization of fisheries and the need for strategic investments to enhance production, processing, and marketing capabilities. The Cape Verdean government has consistently prioritized the promotion of a market economy and the strengthening of the private sector as central pillars of its development strategy. This focus aligns with broader efforts to foster economic diversification, increase competitiveness, and reduce dependence on external assistance. By encouraging private enterprise and facilitating a business-friendly environment, the government aims to stimulate domestic investment, generate employment, and promote sustainable economic growth. Additional development priorities identified by the government include the expansion of tourism, the growth of light manufacturing industries, the enhancement of fisheries, and improvements in transport, communications, and energy infrastructure. Tourism, in particular, has been targeted as a key sector with significant growth potential, given Cape Verde’s natural attractions and strategic location. Similarly, light manufacturing is seen as a means to diversify the economic base and create value-added products. Investments in infrastructure are critical to supporting these sectors and improving overall economic efficiency. Between 1994 and 1995, Cape Verde attracted approximately U.S.$50 million in foreign investments, reflecting increased international confidence in the country’s reform agenda and economic prospects. Of this investment, 50% was allocated to industry, underscoring efforts to develop manufacturing and processing capabilities. Tourism received 19% of the investment, highlighting its growing importance as a source of foreign exchange and employment. The remaining 31% was directed toward fisheries and services, sectors identified as vital for economic diversification and development. The economic outlook for the year 2000 was heavily contingent upon the continuation of aid flows, remittances, and the successful implementation of the government’s development initiatives. Sustained foreign assistance and diaspora support were deemed essential for financing the trade deficit and supporting public expenditures. Concurrently, progress in economic reforms, private sector development, and infrastructure improvements were critical for achieving long-term growth and reducing external vulnerabilities. The interplay of these factors shaped the trajectory of Cape Verde’s economy at the turn of the millennium.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:30.975313",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 15,
      "generated_content_length": 8803,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mineral industry",
    "text": "Mining is an insignificant contributor to the country's economy. Most of the\ncountry's mineral requirements are imported. As of 2007, production of mineral\ncommodities was limited to clay on the islands of Boa Vista, Sal, and São\nVicente; gypsum and iron ore on the island of Maio; limestone on the islands\nof Boa Vista, Sal, and Santo Antão; pozzolana on the island of Santo Antão;\nand salt on the islands of Maio and Sal. Cape Verde was not a natural gas or\npetroleum producer as of 2007.",
    "openai_summarised_points": [
      "• Mining is an insignificant contributor to Cape Verde's economy, with most mineral requirements being imported.",
      "• As of 2007, mineral commodity production in Cape Verde was limited and primarily consisted of the following:",
      "• Clay, produced on the islands of Boa Vista, Sal, and São Vicente.",
      "• Gypsum and iron ore, produced on the island of Maio.",
      "• Limestone, produced on the islands of Boa Vista, Sal, and Santo Antão.",
      "• Pozzolana, produced on the island of Santo Antão.",
      "• Salt, produced on the islands of Maio and Sal.",
      "• Cape Verde was not a producer of natural gas or petroleum as of 2007."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:24.738244",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 490,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Mining played a minimal role in the overall economy of Cape Verde, contributing insignificantly to the nation's gross domestic product and industrial output. The country relied heavily on imports to satisfy the majority of its mineral needs, as domestic production was limited in both scale and diversity. This dependence on imported minerals underscored the relatively underdeveloped state of Cape Verde's mineral industry, which had not yet evolved into a significant sector for economic growth or export revenue. The archipelago's geographic and geological characteristics, combined with limited exploration and investment, constrained the expansion of mining activities. By 2007, the production of mineral commodities within Cape Verde remained modest and was confined to a handful of materials extracted from specific islands. Clay was among the primary minerals produced, with extraction operations concentrated on the islands of Boa Vista, Sal, and São Vicente. These islands possessed deposits of clay that were utilized locally for construction and artisanal purposes, reflecting the limited industrialization of the sector. The clay extracted was typically used in the manufacture of bricks, tiles, and other building materials, contributing to the domestic construction industry but not reaching levels of large-scale commercial mining. In addition to clay, gypsum and iron ore were produced on the island of Maio. Gypsum, a soft sulfate mineral commonly used in the production of plaster, cement, and fertilizer, was mined in small quantities to meet local demand. The presence of iron ore on Maio, although noted, was not developed extensively, and extraction remained limited due to the lack of substantial deposits or the infrastructure necessary for large-scale mining. The mining of these minerals on Maio reflected localized efforts to harness available resources, yet the overall output was insufficient to influence the national economy significantly. Limestone production was another notable component of Cape Verde's mineral industry, with extraction activities taking place on the islands of Boa Vista, Sal, and Santo Antão. Limestone, a sedimentary rock primarily composed of calcium carbonate, served as a fundamental raw material for construction and the production of cement. The availability of limestone on these islands facilitated small-scale quarrying operations that supplied materials for local construction projects and infrastructure development. Despite this, the scale of limestone production was modest, and the industry did not expand into large-scale commercial mining or exportation. Pozzolana, a volcanic ash used as a supplementary cementitious material in concrete production, was produced on the island of Santo Antão. The island's volcanic geology provided deposits of pozzolanic material, which were exploited to enhance the quality and durability of concrete in local construction. The utilization of pozzolana demonstrated an adaptation to the natural resources available within the archipelago, contributing to building practices that leveraged indigenous materials. However, similar to other mineral commodities, pozzolana production remained limited in volume and primarily served domestic needs. Salt production was carried out on the islands of Maio and Sal, where natural salt pans and favorable climatic conditions facilitated the evaporation of seawater to harvest salt. Salt extraction in these locations had historical significance and was traditionally an important economic activity, although by 2007, its contribution to the national economy had diminished. The salt produced was mainly intended for local consumption and small-scale commercial use, with limited export potential due to competition from larger salt producers globally. The salt industry on Maio and Sal represented one of the few mineral-related activities with a longer-standing cultural and economic presence in Cape Verde. As of 2007, Cape Verde did not engage in the production of natural gas or petroleum. The absence of these energy resources meant that the country was entirely dependent on imports to meet its energy requirements. Exploration for hydrocarbons had not yielded commercially viable reserves, and the lack of domestic production underscored the challenges faced by Cape Verde in diversifying its mineral and energy sectors. This reliance on imported fossil fuels had implications for the country's energy security and economic stability, highlighting the strategic importance of developing alternative energy sources or enhancing energy efficiency. Overall, the mineral industry in Cape Verde as of 2007 was characterized by small-scale extraction of a limited range of minerals, primarily serving domestic construction and industrial needs. The sector's marginal role in the economy reflected both the limited availability of mineral resources and the constraints posed by the country's insular geography and infrastructural challenges. Consequently, Cape Verde continued to depend heavily on imported minerals and energy resources, with little indication at that time of significant expansion or diversification in its mineral production capabilities.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:23.944066",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 5204,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Transportation",
    "text": "Shipyard at Mindelo\n\nCape Verde's strategic location at the crossroads of mid-Atlantic air and sea\nlanes has been enhanced by significant improvements at Mindelo's harbour\n(Porto Grande) and at Sal's international airport. Ship repair facilities at\nMindelo were opened in 1983, and the harbours at Mindelo and Praia were\nrecently renovated. The major ports are Mindelo and Praia, but all other\nislands have small port facilities, some of which are to be expanded in the\nnear future. In addition to the international airport on Sal, airports are\nlocated on all of the inhabited islands except for the smallest island, Brava,\nwhich was built, but found to be too dangerous so it was shut down after a few\nfailed attempted landings. The archipelago has 3,050 kilometers (1,830 mi.) of\nroads, of which 1,010 kilometers (606 mi.) are paved. The new Praia\nInternational Airport is currently operative.",
    "openai_summarised_points": [
      "• Cape Verde's strategic geographic position at the crossroads of mid-Atlantic air and sea lanes has been significantly enhanced through improvements at key transportation hubs.",
      "• The harbour at Mindelo, known as Porto Grande, has undergone substantial upgrades to bolster maritime connectivity and logistics.",
      "• Sal's international airport has also seen notable improvements, contributing to the archipelago's enhanced accessibility.",
      "• Ship repair facilities at Mindelo were officially opened in 1983, marking a key development in maritime infrastructure.",
      "• The harbours at both Mindelo and Praia have recently been renovated to improve port operations and capacity.",
      "• The primary ports in Cape Verde are Mindelo and Praia; however, all other islands possess smaller port facilities, with plans underway to expand some of these facilities in the near future.",
      "• In addition to the international airport on Sal, airports are present on all inhabited islands except for the smallest island, Brava.",
      "• The airport on Brava was constructed but subsequently shut down after being deemed too dangerous due to multiple failed landings.",
      "• The archipelago has a total road network of 3,050 kilometers (1,830 miles), of which 1,010 kilometers (606 miles) are paved roads.",
      "• The new Praia International Airport is currently operational, enhancing air connectivity for the region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:29.690859",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 895,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "Cape Verde's geographic position at the crossroads of major mid-Atlantic air and sea lanes has long been recognized as a strategic advantage, facilitating its role as a vital hub for transportation and trade between continents. This advantageous location has been further leveraged through a series of targeted improvements at key transportation nodes, which have collectively enhanced the archipelago’s connectivity and logistical capabilities. Among these critical infrastructure developments, the harbour at Mindelo, locally known as Porto Grande, has undergone substantial upgrades aimed at strengthening maritime operations. These enhancements included the expansion of docking facilities, modernization of cargo handling equipment, and improvements in navigational aids, all of which contributed to increased capacity and efficiency in accommodating both commercial and passenger vessels. The upgrades at Porto Grande have not only bolstered Cape Verde’s maritime connectivity but also reinforced its position as a central transshipment point in the Atlantic, facilitating the flow of goods and passengers across the region. Parallel to the developments at Mindelo, Sal’s international airport has experienced significant improvements that have played a crucial role in enhancing the archipelago’s accessibility by air. These enhancements encompassed runway extensions, terminal modernization, and the introduction of advanced air traffic control systems, which collectively allowed the airport to handle larger aircraft and increased passenger volumes. Sal’s airport serves as the primary international gateway for Cape Verde, linking the islands with Europe, Africa, and the Americas, and its upgraded facilities have been instrumental in supporting the growth of tourism and international business. The airport’s improved infrastructure has also enabled the archipelago to attract more direct flights, reducing travel times and increasing the convenience for both visitors and residents. A pivotal milestone in Cape Verde’s maritime infrastructure was the official opening of ship repair facilities at Mindelo in 1983. This development marked a significant enhancement in the archipelago’s capacity to service vessels, reducing the need for ships to seek repairs abroad and thereby lowering operational costs and turnaround times for maritime operators. The ship repair yard was equipped to handle a variety of maintenance and repair tasks, ranging from routine servicing to more complex structural work, which contributed to the sustainability and growth of Cape Verde’s shipping industry. The establishment of these facilities underscored the government’s commitment to developing a comprehensive maritime support system, which complemented the ongoing upgrades to port infrastructure. In recent years, both the harbours at Mindelo and Praia have undergone renovations aimed at improving port operations and expanding capacity to meet increasing demand. These renovations included dredging to deepen access channels, construction of new berths, and the installation of modern cargo handling equipment. The improvements facilitated smoother and faster cargo handling processes, reduced congestion, and enhanced safety standards within the ports. Praia, as the capital city’s principal harbour, plays a critical role in domestic and international trade, and its modernization has been essential in supporting economic growth and diversification. Similarly, Mindelo’s harbour renovations have reinforced its status as a key maritime hub, capable of accommodating larger vessels and a broader range of maritime activities. While Mindelo and Praia are the primary ports serving Cape Verde, the archipelago’s other islands are equipped with smaller port facilities that cater to inter-island transport and local fishing activities. These minor ports are vital for maintaining connectivity between the islands, enabling the movement of people, goods, and services across the archipelago. Recognizing the importance of these facilities, plans have been formulated to expand and upgrade selected smaller ports to improve their operational capabilities and safety standards. The expansion initiatives aim to support regional development, enhance economic integration among the islands, and foster greater resilience in the face of increasing maritime traffic and climatic challenges. Air transportation infrastructure across Cape Verde is notably comprehensive, with airports present on all inhabited islands except for the smallest, Brava. This widespread distribution of airports facilitates domestic connectivity, allowing for efficient inter-island travel that supports both economic activities and social cohesion. The exception of Brava is notable; although an airport was constructed on the island, it was subsequently closed due to safety concerns. The airport was deemed too dangerous following multiple failed landing attempts, which highlighted the challenges posed by the island’s topography and weather conditions. As a result, Brava remains the only inhabited island without an operational airport, relying instead on maritime transport for connectivity. The archipelago’s road network totals approximately 3,050 kilometers (1,830 miles), of which about 1,010 kilometers (606 miles) are paved. This extensive network facilitates land transportation across the islands, connecting urban centers, rural areas, and ports. The paved roads, while constituting roughly one-third of the total network, are primarily concentrated in more densely populated and economically active regions, enabling efficient movement of goods and passengers. The remaining unpaved roads serve more remote areas and are subject to ongoing efforts aimed at improvement and maintenance, which are critical for supporting local development and access to essential services. Complementing the existing air transport infrastructure, the new Praia International Airport has become operational, significantly enhancing air connectivity for the region. This modern facility features expanded passenger terminals, improved runways, and upgraded navigation systems, enabling it to accommodate increased air traffic and larger aircraft. The airport serves as a vital link for the capital city and surrounding areas, facilitating international travel and commerce. Its operation has contributed to the diversification of Cape Verde’s economy by supporting tourism growth, attracting foreign investment, and improving the overall accessibility of the archipelago. The development of Praia International Airport represents a strategic investment in the country’s transportation infrastructure, aligning with broader goals of economic modernization and regional integration.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:27.676412",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 6748,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "International recognition",
    "text": "Cape Verde is considered a developing country, and is included on the list of\nthe United Nations Small Island Developing States.\n\nIn 2007 the United Nations graduated Cape Verde from the category of Least\nDeveloped Countries, only the second time this has happened to a country.\n\nOn December 18, 2007, the General Council of the World Trade Organization\napproved a package for the accession of Cape Verde to the WTO. Accession was\neffective on July 23, 2008, 30 days after ratification by Cape Verde, which\ntook place on 23 June. The package requires Cape Verde to adapt some of its\neconomic regulation. In particular, it will need to introduce a new Customs\nCode, and to introduce copyright and patent laws complying with the Agreement\non Trade-Related Aspects of Intellectual Property Rights. According to the\nWorld Intellectual Property Organization (WIPO), Cape Verde have a law on\ncopyrights (Law No. 101/III/90, December 1990) and an Industrial Property Code\n(Legislative Decree No. 4/2007 of August 20, 2007). Pascal Lamy, director-\ngeneral of the WTO said, \"I am very pleased to welcome Cape Verde as a new\nmember. This new membership will strengthen multilateral trading system. Being\npart of the WTO will enable Cape Verde to continue its integration into the\nworld economy.\"",
    "openai_summarised_points": [
      "• Cape Verde is classified as a developing country and is included on the United Nations list of Small Island Developing States, highlighting its status within the international community.",
      "• In 2007, Cape Verde was officially graduated from the category of Least Developed Countries (LDCs) by the United Nations, marking only the second instance in history where a country has achieved this transition.",
      "• On December 18, 2007, the General Council of the World Trade Organization (WTO) approved a comprehensive accession package for Cape Verde, facilitating its entry into the organization.",
      "• Cape Verde's accession to the WTO became effective on July 23, 2008, exactly 30 days after the country ratified its membership on June 23, 2008.",
      "• The accession package mandated that Cape Verde adapt certain aspects of its economic regulation, including the introduction of a new Customs Code and the enactment of copyright and patent laws aligned with the Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS).",
      "• Specifically, Cape Verde is required to implement legal frameworks consistent with international intellectual property standards, including laws on copyrights and industrial property.",
      "• According to the World Intellectual Property Organization (WIPO), Cape Verde has established a law on copyrights (Law No. 101/III/90, enacted in December 1990) and an Industrial Property Code (Legislative Decree No. 4/2007, dated August 20, 2007).",
      "• Pascal Lamy, the Director-General of the WTO, expressed his satisfaction with Cape Verde’s accession, stating that it would strengthen the multilateral trading system.",
      "• Lamy emphasized that WTO membership would enable Cape Verde to further integrate into the global economy, promoting economic development and international trade."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:35.770605",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1285,
      "bullet_points_count": 9
    },
    "generated_detailed_content": "Cape Verde is classified as a developing country and is recognized on the United Nations list of Small Island Developing States (SIDS), a designation that underscores its unique challenges and opportunities within the international community. This classification reflects the nation’s geographic and economic characteristics, including its limited land area, vulnerability to environmental and economic shocks, and reliance on a narrow range of economic activities. Being part of the SIDS group has allowed Cape Verde to participate in specialized international programs and initiatives aimed at addressing the sustainable development needs of small island nations, particularly in areas such as climate change adaptation, disaster risk reduction, and economic diversification. In a significant milestone for its economic and social development, Cape Verde was officially graduated from the category of Least Developed Countries (LDCs) by the United Nations in 2007. This graduation marked only the second time in history that a country had successfully transitioned out of the LDC category, highlighting Cape Verde’s progress in improving key development indicators such as income per capita, human assets, and economic vulnerability. The graduation process involved a rigorous assessment by the Committee for Development Policy, which evaluated Cape Verde’s sustained improvements in areas including health, education, infrastructure, and economic resilience. This transition not only signified enhanced international recognition of Cape Verde’s development achievements but also implied changes in the nature of international support and trade preferences previously accorded to LDCs. Further consolidating its integration into the global economic system, Cape Verde achieved a major diplomatic and economic milestone on December 18, 2007, when the General Council of the World Trade Organization (WTO) approved a comprehensive accession package for the country. This approval followed extensive negotiations that addressed Cape Verde’s trade policies, regulatory frameworks, and commitments to international trade rules. The accession package was designed to facilitate Cape Verde’s entry into the WTO, providing the country with access to the multilateral trading system and the benefits of WTO membership, including dispute settlement mechanisms, market access opportunities, and participation in global trade rule-making processes. The approval by the General Council represented the culmination of years of preparatory work and demonstrated the international community’s confidence in Cape Verde’s readiness to adhere to WTO obligations. Cape Verde’s accession to the WTO became effective on July 23, 2008, exactly thirty days after the country ratified its membership on June 23, 2008. This swift ratification and subsequent entry into the WTO underscored Cape Verde’s commitment to embracing international trade norms and enhancing its economic openness. As a WTO member, Cape Verde gained the ability to engage more actively in global trade negotiations and to benefit from the multilateral framework that governs international commerce. The timing of the accession also aligned with broader national strategies aimed at economic liberalization, export promotion, and attracting foreign investment, all of which were expected to contribute to sustainable economic growth and development. The accession package required Cape Verde to undertake several important reforms to align its economic regulations with WTO standards. Among these reforms was the introduction of a new Customs Code designed to streamline customs procedures, enhance transparency, and facilitate trade flows. Additionally, Cape Verde was mandated to enact copyright and patent laws consistent with the Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS), which sets minimum standards for the protection and enforcement of intellectual property rights among WTO members. These legal and regulatory adjustments were intended to create a more predictable and secure environment for both domestic and foreign investors, encourage innovation, and support the development of a knowledge-based economy. The reforms also aimed to harmonize Cape Verde’s trade-related policies with international best practices, thereby improving the country’s competitiveness in global markets. Specifically, Cape Verde was required to implement legal frameworks that conformed to international intellectual property standards, encompassing laws on copyrights and industrial property. This entailed not only the adoption of legislation but also the establishment of institutional mechanisms to enforce intellectual property rights effectively. By aligning its legal infrastructure with TRIPS provisions, Cape Verde sought to protect the rights of creators and inventors, promote creativity and technological advancement, and attract foreign direct investment in sectors reliant on intellectual property protection. The implementation of these frameworks was a critical component of Cape Verde’s broader strategy to integrate into the global economy and to diversify its economic base beyond traditional sectors such as agriculture and fisheries. According to the World Intellectual Property Organization (WIPO), Cape Verde has established foundational legislation to support its intellectual property regime. The country enacted a law on copyrights, Law No. 101/III/90, in December 1990, which laid the groundwork for protecting the rights of authors and creators within its jurisdiction. More recently, Cape Verde introduced an Industrial Property Code through Legislative Decree No. 4/2007, dated August 20, 2007, which provided a comprehensive legal framework for the protection of patents, trademarks, industrial designs, and other forms of industrial property. These legislative measures demonstrated Cape Verde’s commitment to developing a robust intellectual property system aligned with international standards, thereby facilitating its WTO accession and enhancing its ability to participate in the global knowledge economy. Pascal Lamy, who served as the Director-General of the World Trade Organization during Cape Verde’s accession, expressed his satisfaction with the country’s entry into the organization. He highlighted that Cape Verde’s accession would strengthen the multilateral trading system by expanding the membership to include a country that had demonstrated a strong commitment to trade liberalization and economic reform. Lamy emphasized that the inclusion of Cape Verde in the WTO membership base would contribute to the diversity and inclusiveness of the organization, reinforcing its role as a platform for equitable and rules-based international trade. His remarks underscored the importance of Cape Verde’s accession not only for the country itself but also for the broader global trading community. Lamy further stressed that WTO membership would enable Cape Verde to deepen its integration into the global economy, thereby promoting economic development and facilitating international trade. He noted that the multilateral trading system provides a framework for small and developing countries like Cape Verde to benefit from predictable and non-discriminatory trade rules, which can help attract investment, stimulate exports, and support sustainable growth. By participating fully in the WTO, Cape Verde would gain access to technical assistance, capacity-building programs, and dispute resolution mechanisms that could enhance its trade policy formulation and implementation. Lamy’s statements reflected the broader international consensus that Cape Verde’s accession represented a positive step toward achieving greater economic inclusion and development through multilateral cooperation.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:28.912130",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 9,
      "generated_content_length": 7803,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 0.23  | 798  | 0.16  | 5.3%  | 15.1%  | ...\n1985  | 0.41  | 1,287  | 0.15  | 8.6%  | 5.9%  | ...\n1990  | 0.69  | 1,633  | 0.34  | 0.7%  | 11.1%  | ...\n1995  | 0.84  | 2,106  | 0.54  | 7.5%  | 8.4%  | ...\n2000  | 1.37  | 3,089  | 0.61  | 7.3%  | −2,4 %  | 83%\n2005  | 2.05  | 4,278  | 1.12  | 5.8%  | 0,4 %  | 85%\n2006  | 2.30  | 4,778  | 1.26  | 9.1%  | 4,8 %  | 77%\n2007  | 2.58  | 5,338  | 1.65  | 9.2%  | 4,4 %  | 65%\n2008  | 2.81  | 5,793  | 1.96  | 6.7%  | 6.8%  | 57%\n2009  | 2.79  | 5,750  | 1.85  | −1.3 %  | 1.0%  | 65%\n2010  | 2.87  | 5,883  | 1.83  | 1.5%  | 2.1%  | 72%\n2011  | 3.04  | 6,205  | 2.05  | 4.0%  | 4.5%  | 79%\n2012  | 3.13  | 6,195  | 1.91  | 1.1%  | 2.5%  | 91%\n2013  | 3.21  | 6,268  | 2.03  | 0.8%  | 1.5%  | 102%\n2014  | 3.29  | 6,342  | 2.04  | 0.6%  | −0.2 %  | 116%\n2015  | 3.36  | 6,396  | 1.75  | 1.0%  | 0.1%  | 126%\n2016  | 3.53  | 6,643  | 1.86  | 3.8%  | −1.4 %  | 129%\n2017  | 3.96  | 6,944  | 1.97  | 4.0%  | 0.8%  | 126%",
    "openai_summarised_points": [
      "• The data table presents key economic indicators for Cape Verde spanning the years 1980 to 2017, providing a comprehensive overview of the country's economic development over nearly four decades.",
      "• In 1980, Cape Verde's Gross Domestic Product (GDP) measured approximately 0.23 billion US dollars in Purchasing Power Parity (PPP), with a per capita GDP of 798 US dollars PPP, and a nominal GDP of 0.16 billion US dollars.",
      "• The GDP growth rate in 1980 was 5.3%, with an inflation rate of 15.1%, and the government debt constituted an unspecified percentage of GDP.",
      "• By 1985, GDP in PPP terms increased to 0.41 billion US dollars, with per capita GDP rising to 1,287 US dollars PPP, and nominal GDP slightly decreased to 0.15 billion US dollars; GDP growth was 8.6%, inflation decreased to 5.9%, and government debt data remained unspecified.",
      "• In 1990, GDP in PPP terms reached 0.69 billion US dollars, with per capita GDP at 1,633 US dollars PPP, and nominal GDP at 0.34 billion US dollars; GDP growth was 0.7%, inflation increased to 11.1%, and government debt was 11.1% of GDP.",
      "• The year 1995 saw GDP in PPP terms at 0.84 billion US dollars, with per capita GDP at 2,106 US dollars PPP, and nominal GDP at 0.54 billion US dollars; GDP growth was 7.5%, inflation was 8.4%, and government debt was 8.4% of GDP.",
      "• In 2000, GDP in PPP terms was 1.37 billion US dollars, with per capita GDP at 3,089 US dollars PPP, and nominal GDP at 0.61 billion US dollars; GDP growth was 7.3%, inflation was negative at −2.4%, and government debt was notably high at 83% of GDP.",
      "• By 2005, GDP in PPP terms increased to 2.05 billion US dollars, with per capita GDP at 4,278 US dollars PPP, and nominal GDP at 1.12 billion US dollars; GDP growth slowed to 5.8%, inflation was 0.4%, and government debt was 85% of GDP.",
      "• In 2006, GDP in PPP terms was 2.30 billion US dollars, with per capita GDP at 4,778 US dollars PPP, and nominal GDP at 1.26 billion US dollars; GDP growth was 9.1%, inflation increased to 4.8%, and government debt decreased to 77% of GDP.",
      "• The year 2007 saw GDP in PPP terms at 2.58 billion US dollars, with per capita GDP at 5,338 US dollars PPP, and nominal GDP at 1.65 billion US dollars; GDP growth was 9.2%, inflation was 4.4%, and government debt was 65% of GDP.",
      "• In 2008, GDP in PPP terms reached 2.81 billion US dollars, with per capita GDP at 5,793 US dollars PPP, and nominal GDP at 1.96 billion US dollars; GDP growth was 6.7%, inflation was 6.8%, and government debt was 57% of GDP.",
      "• The 2009 data shows a slight contraction with GDP in PPP terms at 2.79 billion US dollars, per capita GDP at 5,750 US dollars PPP, and nominal GDP at 1.85 billion US dollars; GDP experienced a decline of −1.3%, inflation was 1.0%, and government debt increased to 65% of GDP.",
      "• In 2010, GDP in PPP terms increased marginally to 2.87 billion US dollars, with per capita GDP at 5,883 US dollars PPP, and nominal GDP at 1.83 billion US dollars; GDP growth was 1.5%, inflation was 2.1%, and government debt was 72% of GDP.",
      "• The year 2011 saw GDP in PPP terms at 3.04 billion US dollars, with per capita GDP at 6,205 US dollars PPP, and nominal GDP at 2.05 billion US dollars; GDP growth was 4.0%, inflation was 4.5%, and government debt was 79% of GDP.",
      "• In 2012, GDP in PPP terms was 3.13 billion US dollars, with per capita GDP at 6,195 US dollars PPP, and nominal GDP at 1.91 billion US dollars; GDP growth was 1.1%, inflation was 2.5%, and government debt was 91% of GDP.",
      "• The 2013 data indicates GDP in PPP terms at 3.21 billion US dollars, with per capita GDP at 6,268 US dollars PPP, and nominal GDP at 2.03 billion US dollars; GDP growth was 0.8%, inflation was 1.5%, and government debt was 102% of GDP.",
      "• In 2014, GDP in PPP terms increased to 3.29 billion US dollars, with per capita GDP at 6,342 US dollars PPP, and nominal GDP at 2.04 billion US dollars; GDP growth was 0.6%, inflation was negative at −0.2%, and government debt was 116% of GDP.",
      "• The year 2015 saw GDP in PPP terms at 3.36 billion US dollars, with per capita GDP at 6,396 US dollars PPP, and nominal GDP at 1.75 billion US dollars; GDP growth was 1.0%, inflation was 0.1%, and government debt was 126% of GDP.",
      "• In 2016, GDP in PPP terms reached 3.53 billion US dollars, with per capita GDP at 6,643 US dollars PPP, and nominal GDP at 1.86 billion US dollars; GDP growth was 3.8%, inflation was negative at −1.4%, and government debt was 129% of GDP.",
      "• The final year in the dataset, 2017, recorded GDP in PPP terms at 3.96 billion US dollars, with per capita GDP at 6,944 US dollars PPP, and nominal GDP at 1.97 billion US dollars; GDP growth was 4.0%, inflation was 0.8%, and government debt was 126% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:56.277619",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1243,
      "bullet_points_count": 20
    },
    "generated_detailed_content": "The economic data for Cape Verde from 1980 to 2017 reveals a trajectory of gradual growth and fluctuating fiscal indicators that reflect the country's evolving economic landscape over nearly four decades. In 1980, the nation's Gross Domestic Product (GDP) in terms of Purchasing Power Parity (PPP) was approximately 0.23 billion US dollars, while the nominal GDP stood at 0.16 billion US dollars. The per capita GDP at that time was 798 US dollars PPP, indicating the average economic output per individual within the country. The GDP growth rate was recorded at 5.3%, suggesting a moderate expansion of the economy during that year. However, inflation was relatively high at 15.1%, which could have exerted pressure on prices and purchasing power. The data regarding government debt as a percentage of GDP for 1980 was not specified, leaving the fiscal leverage of the government during this period unclear. By 1985, Cape Verde experienced a notable increase in GDP measured in PPP terms, which rose to 0.41 billion US dollars, nearly doubling the value from five years prior. Correspondingly, the per capita GDP increased to 1,287 US dollars PPP, reflecting improved economic conditions on an individual level. Interestingly, nominal GDP slightly decreased to 0.15 billion US dollars, which may indicate currency valuation effects or statistical revisions. The GDP growth rate accelerated to 8.6%, marking a period of robust economic expansion. Inflation, however, showed a significant decline, dropping to 5.9%, which suggests that the country was able to stabilize prices more effectively compared to the previous half-decade. Government debt data for 1985 remained unspecified, continuing the trend of limited fiscal transparency or reporting for this period. In 1990, the economy of Cape Verde further expanded, with GDP in PPP terms reaching 0.69 billion US dollars. The per capita GDP rose to 1,633 US dollars PPP, indicating continued improvements in average income levels. Nominal GDP also increased to 0.34 billion US dollars, reflecting enhanced economic output in current dollar terms. However, the GDP growth rate slowed considerably to 0.7%, signaling a period of economic stagnation or transition. Inflation rose to 11.1%, indicating renewed price pressures that could have affected consumer purchasing power and cost structures. Notably, government debt was recorded at 11.1% of GDP, providing a quantifiable measure of the country's fiscal obligations relative to its economic size, which was relatively moderate. The year 1995 marked further economic development, with GDP in PPP terms reaching 0.84 billion US dollars. Per capita GDP increased to 2,106 US dollars PPP, reflecting ongoing improvements in living standards. Nominal GDP rose to 0.54 billion US dollars, consistent with the upward trend in economic output. The GDP growth rate rebounded to 7.5%, indicating a strong recovery and expansion phase. Inflation decreased to 8.4%, suggesting some control over price increases, although it remained elevated by international standards. Government debt was recorded at 8.4% of GDP, showing a slight reduction in fiscal leverage compared to 1990, which may reflect prudent fiscal management or improved revenue collection. Entering the new millennium, Cape Verde's economy continued its upward trajectory. In 2000, GDP in PPP terms was 1.37 billion US dollars, almost doubling the figure from 1995. The per capita GDP rose significantly to 3,089 US dollars PPP, indicating substantial growth in average income levels. Nominal GDP was 0.61 billion US dollars, marking a steady increase in economic output. The GDP growth rate was 7.3%, consistent with a dynamic and expanding economy. Inflation was notably negative at −2.4%, signaling a period of deflation which could have been driven by various factors including decreased demand or structural adjustments. However, government debt surged dramatically to 83% of GDP, highlighting a period of increased fiscal stress and potential challenges in debt sustainability. By 2005, the GDP in PPP terms had increased to 2.05 billion US dollars, with per capita GDP reaching 4,278 US dollars PPP, reflecting continued economic growth and improved living standards. Nominal GDP rose to 1.12 billion US dollars, nearly doubling the figure from 2000. The GDP growth rate slowed to 5.8%, indicating a deceleration in economic expansion relative to the previous half-decade. Inflation was very low at 0.4%, suggesting price stability and a controlled monetary environment. Government debt remained high at 85% of GDP, indicating persistent fiscal challenges despite economic growth. In 2006, Cape Verde's economy showed further expansion with GDP in PPP terms rising to 2.30 billion US dollars, while per capita GDP increased to 4,778 US dollars PPP. Nominal GDP also grew to 1.26 billion US dollars. The GDP growth rate accelerated to 9.1%, marking a period of rapid economic development. Inflation increased moderately to 4.8%, reflecting some upward pressure on prices. Government debt decreased to 77% of GDP, signaling some improvement in fiscal management or debt restructuring efforts. The year 2007 saw continued growth with GDP in PPP terms reaching 2.58 billion US dollars and per capita GDP rising to 5,338 US dollars PPP. Nominal GDP experienced a significant increase to 1.65 billion US dollars. The GDP growth rate remained strong at 9.2%, indicating sustained economic momentum. Inflation was slightly lower at 4.4%, suggesting some moderation in price increases. Government debt further decreased to 65% of GDP, reflecting ongoing efforts to reduce fiscal liabilities. In 2008, the GDP in PPP terms reached 2.81 billion US dollars, with per capita GDP at 5,793 US dollars PPP, continuing the trend of rising income levels. Nominal GDP increased to 1.96 billion US dollars, reflecting robust economic activity. The GDP growth rate slowed to 6.7%, still indicating healthy expansion. Inflation rose to 6.8%, marking a notable increase in price levels which could have been influenced by global economic conditions. Government debt declined further to 57% of GDP, suggesting improved fiscal discipline. The global economic downturn impacted Cape Verde in 2009, as evidenced by a slight contraction in economic output. GDP in PPP terms decreased marginally to 2.79 billion US dollars, and per capita GDP fell slightly to 5,750 US dollars PPP. Nominal GDP declined to 1.85 billion US dollars. The GDP growth rate was negative at −1.3%, indicating an economic contraction likely linked to the global financial crisis. Inflation dropped to 1.0%, reflecting subdued demand pressures. Government debt rose to 65% of GDP, reversing previous gains in fiscal consolidation. In 2010, the economy showed signs of recovery with GDP in PPP terms increasing marginally to 2.87 billion US dollars and per capita GDP rising to 5,883 US dollars PPP. Nominal GDP was slightly lower at 1.83 billion US dollars. The GDP growth rate rebounded to 1.5%, signaling the beginning of economic stabilization. Inflation was moderate at 2.1%, indicating controlled price levels. Government debt increased to 72% of GDP, reflecting ongoing fiscal challenges. The year 2011 saw further economic improvement, with GDP in PPP terms reaching 3.04 billion US dollars and per capita GDP rising to 6,205 US dollars PPP. Nominal GDP increased to 2.05 billion US dollars. The GDP growth rate accelerated to 4.0%, reflecting stronger economic performance. Inflation increased to 4.5%, indicating rising price pressures. Government debt rose to 79% of GDP, suggesting an expanding fiscal deficit or increased borrowing. In 2012, GDP in PPP terms was 3.13 billion US dollars, with per capita GDP slightly declining to 6,195 US dollars PPP. Nominal GDP decreased to 1.91 billion US dollars. The GDP growth rate slowed to 1.1%, indicating a period of subdued economic expansion. Inflation moderated to 2.5%, reflecting relative price stability. Government debt increased significantly to 91% of GDP, highlighting growing fiscal vulnerabilities. The 2013 data showed GDP in PPP terms at 3.21 billion US dollars and per capita GDP at 6,268 US dollars PPP. Nominal GDP rose to 2.03 billion US dollars. The GDP growth rate was 0.8%, indicating near stagnation. Inflation was low at 1.5%, suggesting stable prices. Government debt surpassed the 100% threshold, reaching 102% of GDP, marking a critical level of indebtedness that could pose risks to fiscal sustainability. In 2014, GDP in PPP terms increased to 3.29 billion US dollars, with per capita GDP at 6,342 US dollars PPP. Nominal GDP remained steady at 2.04 billion US dollars. The GDP growth rate declined further to 0.6%, indicating very slow economic growth. Inflation turned negative at −0.2%, signaling deflationary pressures. Government debt rose sharply to 116% of GDP, underscoring significant fiscal stress and potential challenges in debt servicing. The year 2015 saw GDP in PPP terms at 3.36 billion US dollars and per capita GDP at 6,396 US dollars PPP. Nominal GDP decreased to 1.75 billion US dollars. The GDP growth rate was modest at 1.0%, reflecting limited economic expansion. Inflation was nearly zero at 0.1%, indicating price stability. Government debt increased further to 126% of GDP, reaching a level that typically signals a high risk of fiscal distress. In 2016, GDP in PPP terms reached 3.53 billion US dollars, with per capita GDP rising to 6,643 US dollars PPP. Nominal GDP increased to 1.86 billion US dollars. The GDP growth rate improved to 3.8%, suggesting a rebound in economic activity. Inflation was negative at −1.4%, indicating deflationary conditions that could affect consumption and investment. Government debt peaked at 129% of GDP, representing a critical fiscal challenge for the country. The final year in the dataset, 2017, recorded GDP in PPP terms at 3.96 billion US dollars, with per capita GDP reaching 6,944 US dollars PPP. Nominal GDP increased to 1.97 billion US dollars. The GDP growth rate was 4.0%, indicating sustained economic growth. Inflation rose slightly to 0.8%, reflecting mild price increases. Government debt decreased marginally to 126% of GDP, suggesting some improvement in fiscal management, though the debt burden remained substantially high. This comprehensive dataset illustrates Cape Verde’s economic evolution, highlighting periods of robust growth, inflationary fluctuations, and significant fiscal challenges over the nearly four decades covered.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:23:43.181687",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 20,
      "generated_content_length": 10508,
      "generation_type": "detailed_expansion"
    }
  }
]