[
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Zambian exports in 2006\n\nZambia is a developing country, and it achieved middle-income status in 2011.\nThrough the first decade of the 21st century, the **economy of Zambia** was\none of the fastest-growing economies in Africa, and its capital, Lusaka, the\nfastest-growing city in the Southern African Development Community (SADC).\nZambia's economic performance has stalled in recent years due to declining\ncopper prices, significant fiscal deficits, and energy shortages. The economy\nhas been reliant on mineral extraction since the 1920s, in particular copper.\n\nUpon achieving independence, Zambia had a higher GDP per capita than almost\nall sub-Saharan African countries. Over the subsequent decades, Zambia's\neconomy contracted, in part due to declining copper prices. Since the 2000s,\nZambia's economy has been growing. As of 2019, Zambia's GDP per capita\n(current international dollars) stands at $1,305.00.\n\nZambia is one of Sub-Saharan Africa's most urbanized countries. About one-half\nof the country's 16 million people are concentrated in a few urban zones\nstrung along the major transportation corridors, while rural areas are under-\npopulated.\n\nCopper and cobalt are among Zambia's main exports, while non-traditional\nexports include cotton, coffee, fresh flowers, burley tobacco, gemstones and\nmaize (corn). Zambia is eligible to export duty-free goods to the United\nStates under the African Growth and Opportunity Act (AGOA); the Act allows\neligible countries from sub-Saharan Africa to export over 6,400 goods to the\nUnited States.\n\nCopper output has increased steadily since 2004, due to higher copper prices\nand the opening of new mines. The maize harvest was again good in 2005,\nhelping boost GDP and agricultural exports. Cooperation continues with\ninternational bodies on programs to reduce poverty, including a new lending\narrangement with the IMF in the second quarter of 2004.",
    "openai_summarised_points": [
      "• Zambia is classified as a developing country and attained middle-income status in 2011.",
      "• Throughout the first decade of the 21st century, Zambia's economy was among the fastest-growing in Africa, with its capital city, Lusaka, recognized as the fastest-growing city within the Southern African Development Community (SADC).",
      "• In recent years, Zambia's economic growth has stalled due to several challenges, including declining copper prices, significant fiscal deficits, and energy shortages.",
      "• Since the 1920s, Zambia's economy has been heavily dependent on mineral extraction, particularly copper mining.",
      "• At the time of its independence, Zambia had a higher GDP per capita than nearly all other sub-Saharan African countries.",
      "• Over the subsequent decades following independence, Zambia's economy contracted, partly as a result of falling copper prices.",
      "• From the 2000s onward, Zambia's economy resumed growth, and by 2019, the country's GDP per capita, measured in current international dollars, was $1,305.00.",
      "• Zambia is one of the most urbanized countries in sub-Saharan Africa, with approximately half of its population of 16 million people residing in a few urban zones located along major transportation corridors, while rural areas remain sparsely populated.",
      "• The main exports of Zambia include copper and cobalt, with non-traditional exports comprising cotton, coffee, fresh flowers, burley tobacco, gemstones, and maize (corn).",
      "• Zambia benefits from the African Growth and Opportunity Act (AGOA), which permits eligible sub-Saharan African countries to export over 6,400 duty-free goods to the United States.",
      "• Copper production in Zambia has increased steadily since 2004, driven by higher copper prices and the development of new mining operations.",
      "• The maize harvest in 2005 was favorable, contributing positively to Zambia's GDP and agricultural export performance.",
      "• Zambia continues to collaborate with international organizations on poverty reduction programs, including entering into a new lending arrangement with the International Monetary Fund (IMF) in the second quarter of 2004."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:12.968387",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1898,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Economic policies soon after independence (1964–1967)",
    "text": "GDP per capita development of Zambia, since 1950\n\nThe British South Africa Company (BSAC, originally set up by the British\nimperialist Cecil Rhodes) retained commercial assets and mineral rights that\nit acquired from a concession signed with the Litunga of Barotseland in 1892\n(the Lochner Concession). Only by threatening to expropriate the BSAC, on the\neve of independence, did the incoming Zambian government manage to get the\nBSAC to relinquish the mineral rights. The Federation's government assigned\nroles to each of the three territories: Southern Rhodesia was assigned the\nresponsibility of providing managerial and administrative skills; Northern\nRhodesia provided copper revenues; and Nyasaland provided the Black labour.\n\nAfter independence, Zambia instituted a program of national development plans,\nunder the direction of a National Commission for Development Planning: the\nTransitional Development Plan (1964–66) was followed by the First National\nDevelopment Plan (1966–71). These two plans, which provided for major\ninvestment in infrastructure and manufacturing, were largely implemented and\nwere generally successful. This was not true for subsequent plans.",
    "openai_summarised_points": [
      "• The British South Africa Company (BSAC), originally established by British imperialist Cecil Rhodes, retained commercial assets and mineral rights acquired through the Lochner Concession, a 1892 agreement with the Litunga of Barotseland.",
      "• On the eve of Zambia’s independence in 1964, the incoming Zambian government threatened to expropriate the BSAC in order to compel the company to relinquish its mineral rights.",
      "• The Federation of Rhodesia and Nyasaland assigned specific economic roles to its three territories: Southern Rhodesia was responsible for providing managerial and administrative skills; Northern Rhodesia (later Zambia) supplied copper revenues; and Nyasaland provided Black labor.",
      "• Following independence, Zambia established a series of national development plans overseen by the National Commission for Development Planning.",
      "• The Transitional Development Plan (1964–1966) was the first post-independence economic plan, focusing on infrastructure and manufacturing investment.",
      "• The Transitional Development Plan was succeeded by the First National Development Plan (1966–1971), which continued the emphasis on major infrastructure and manufacturing development.",
      "• Both the Transitional Development Plan and the First National Development Plan were largely implemented and generally regarded as successful in promoting Zambia’s early economic development.",
      "• Subsequent national development plans after 1971 did not achieve the same level of success as the initial two plans."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:12.967514",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1175,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "The Mulungushi Economic Reforms (1968)",
    "text": "A major switch in the structure of Zambia's economy came with the Mulungushi\nReforms of April 1968: the government declared its intention to acquire equity\nholdings (usually 51% or more) in a number of key foreign-owned firms, to be\ncontrolled by a parastatal conglomerate named the Industrial Development\nCorporation (INDECO). By January 1970, Zambia had acquired majority holding in\nthe Zambian operations of the two major foreign mining corporations, the Anglo\nAmerican Corporation and the Rhodesia Selection Trust (RST); the two became\nthe Nchanga Consolidated Copper Mines (NCCM) and Roan Consolidated Mines\n(RCM), respectively. The Zambian government then created a new parastatal\nbody, the Mining Development Corporation (MINDECO). The Finance and\nDevelopment Corporation (FINDECO) allowed the Zambian government to gain\ncontrol of insurance companies and building societies. However, foreign-owned\nbanks (such as Barclays, Standard Chartered and Grindlays) successfully\nresisted takeover. In 1971, INDECO, MINDECO, and FINDECO were brought together\nunder an omnibus parastatal, the Zambia Industrial and Mining Corporation\n(ZIMCO), to create one of the largest companies in sub-Saharan Africa, with\nthe country's president, Kenneth Kaunda as chairman of the board. The\nmanagement contracts under which day-to-day operations of the mines had been\ncarried out by Anglo American and RST were ended in 1973. In 1982 NCCM and RCM\nwere merged into the giant Zambia Consolidated Copper Mines Ltd (ZCCM).\n\nIn 1973 a massive increase in the price of oil was followed by a slump in\ncopper prices in 1975, resulting in a diminution of export earnings. In 1973\nthe price of copper accounted for 95% of all export earnings; this halved in\nvalue on the world market in 1975. By 1976 Zambia had a balance-of-payments\ncrisis, and rapidly became massively indebted to the International Monetary\nFund (IMF). The Third National Development Plan (1978–83) had to be abandoned\nas crisis management replaced long-term planning.\n\nBy the mid-1980s Zambia was one of the most indebted nations in the world,\nrelative to its gross domestic product (GDP). The IMF was insisting that the\nZambian government should introduce programs aimed at stabilizing the economy\nand restructuring it to reduce dependence on copper. The proposed measures\nincluded: the ending of price controls; devaluation of the kwacha (Zambia's\ncurrency); cut-backs in government expenditure; cancellation of subsidies on\nfood and fertilizer; and increased prices for farm produce. Kaunda's removal\nof food subsidies caused massive increases in the prices of basic foodstuffs;\nthe country's urbanized population rioted in protest. In desperation, Kaunda\nbroke with the IMF in May 1987 and introduced a New Economic Recovery\nProgramme in 1988. However, this did not help him and he eventually moved\ntoward a new understanding with the IMF in 1989. In 1990 Kaunda was forced to\nmake a major policy volteface: he announced the intention to partially\nprivatize the parastatals. Time, however, was running out for him. Like many\nAfrican independence leaders Kaunda tried to hang on to power but unlike many\nhe called multiparty elections and lost them to the Movement for Multiparty\nDemocracy (MMD) and abided by the results. Kaunda left office with the\ninauguration of MMD leader Frederick Chiluba as president on 2 November 1991.",
    "openai_summarised_points": [
      "• In April 1968, Zambia initiated the Mulungushi Economic Reforms, marking a significant structural shift in its economy by declaring government intent to acquire majority equity holdings (usually 51% or more) in key foreign-owned firms through a parastatal conglomerate named the Industrial Development Corporation (INDECO).",
      "• By January 1970, the Zambian government had acquired majority ownership of the Zambian operations of two major foreign mining corporations: the Anglo American Corporation and the Rhodesia Selection Trust (RST), which were renamed Nchanga Consolidated Copper Mines (NCCM) and Roan Consolidated Mines (RCM), respectively.",
      "• Following these acquisitions, the government established the Mining Development Corporation (MINDECO) as a new parastatal entity to oversee mining operations, while the Finance and Development Corporation (FINDECO) enabled government control over insurance companies and building societies.",
      "• Despite these nationalizations, foreign-owned banks such as Barclays, Standard Chartered, and Grindlays successfully resisted government takeover efforts.",
      "• In 1971, INDECO, MINDECO, and FINDECO were consolidated under a single umbrella parastatal, the Zambia Industrial and Mining Corporation (ZIMCO), creating one of sub-Saharan Africa’s largest companies, with President Kenneth Kaunda serving as chairman of the board.",
      "• The management contracts previously held by Anglo American and RST for day-to-day mine operations were terminated in 1973, signaling full government control over mining activities.",
      "• In 1982, NCCM and RCM were merged to form the Zambia Consolidated Copper Mines Ltd (ZCCM), further consolidating the mining sector under government ownership.",
      "• In 1973, a sharp increase in oil prices was followed by a significant slump in copper prices in 1975, which caused a severe reduction in Zambia’s export earnings; copper had accounted for 95% of export earnings in 1973 but its value halved on the world market by 1975.",
      "• By 1976, Zambia faced a balance-of-payments crisis and accumulated substantial debt to the International Monetary Fund (IMF), leading to the abandonment of the Third National Development Plan (1978–83) as crisis management took precedence over long-term economic planning.",
      "• By the mid-1980s, Zambia was among the most heavily indebted countries globally relative to its gross domestic product (GDP), with the IMF demanding economic stabilization and restructuring programs aimed at reducing dependence on copper.",
      "• The IMF’s proposed measures included ending price controls, devaluing the kwacha (Zambia’s currency), reducing government expenditure, canceling subsidies on food and fertilizer, and increasing prices for farm produce.",
      "• President Kaunda’s removal of food subsidies caused sharp increases in basic food prices, provoking widespread riots among the urban population.",
      "• In May 1987, Kaunda broke with the IMF and introduced a New Economic Recovery Programme in 1988, but this initiative failed to resolve the economic crisis.",
      "• By 1989, Kaunda sought a new understanding with the IMF, and in 1990 he announced plans to partially privatize parastatal companies as part of a major policy reversal.",
      "• Despite attempts to retain power, Kaunda called multiparty elections in 1991, which he lost to the Movement for Multiparty Democracy (MMD); he respected the election results and peacefully transferred power.",
      "• Kenneth Kaunda left office on 2 November 1991 with the inauguration of Frederick Chiluba, leader of the MMD, as the new president of Zambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:19.218322",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3377,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Chiluba's economic reforms (1991–2000)",
    "text": "Zambia's Economic System of Government is Unitary because of that the\nFrederick Chiluba government (1991–2001), which came to power after democratic\nmulti-party elections in November 1991, was committed to extensive economic\nreform.[_page needed_]\n\nZambia's economic transformation into a free market system began toward the\nend of 1991 following a change of government. To tackle a serious economic\ncrisis, the government agreed to introduce substantial economic reforms to\nsecure much-needed loans from the World Bank and IMF.\n\nOne of the greatest challenges was the privatization of the country's copper\nmines, Zambia's prime export earner. The government privatised many state\nindustries, and maintained positive real interest rates. Exchange controls\nwere eliminated and free market principles endorsed. It remains to be seen\nwhether the Mwanawasa government will follow a similar path of implementing\neconomic reform and undertaking further privatization. Zambia has yet to\naddress issues such as reducing the size of the public sector, which still\nrepresents 44% of total formal employment, and improving Zambia's social\nsector delivery systems.\n\nAfter the government privatized the giant parastatal mining company Zambian\nConsolidated Copper Mines (ZCCM), donors resumed balance-of-payment support.\nThe final transfer of ZCCM's assets occurred on March 31, 2000. Although\nbalance-of-payment payments are not the answer to Zambia's long-term debt\nproblems, it will in the short term provide the government some breathing room\nto implement further economic reforms. The government has, however, spent much\nof its foreign exchange reserves to intervene in the exchange rate mechanism.\nTo continue to do so, however, would jeopardize Zambia's debt relief. Zambia\nqualified for HIPC debt relief in 2000, contingent upon the country meeting\ncertain performance criteria, and this should offer a long-term solution to\nZambia's debt situation.",
    "openai_summarised_points": [
      "• Zambia operates under a Unitary economic system of government, which framed the context for Frederick Chiluba’s administration from 1991 to 2001 following democratic multi-party elections in November 1991, during which the government committed to extensive economic reforms.",
      "• The transformation of Zambia’s economy toward a free market system commenced at the end of 1991 after the change in government, motivated by the need to address a serious economic crisis and secure essential loans from the World Bank and the International Monetary Fund (IMF).",
      "• A major challenge during Chiluba’s reforms was the privatization of Zambia’s copper mines, the country’s primary export earner, which involved the government privatizing numerous state-owned industries and maintaining positive real interest rates.",
      "• The government eliminated exchange controls and endorsed free market principles as part of its reform agenda, although it remained uncertain whether the succeeding Mwanawasa government would continue with similar economic reforms and further privatization efforts.",
      "• Despite reforms, Zambia had yet to tackle significant issues such as reducing the size of the public sector, which still accounted for 44% of total formal employment, and improving the delivery systems within the social sector.",
      "• The privatization of the giant parastatal mining company, Zambian Consolidated Copper Mines (ZCCM), culminated with the final transfer of its assets on March 31, 2000, after which international donors resumed balance-of-payment support to Zambia.",
      "• Although balance-of-payment support provided short-term fiscal relief, it was not considered a solution to Zambia’s long-term debt problems; however, it offered the government temporary breathing space to implement further economic reforms.",
      "• The government expended a significant portion of its foreign exchange reserves to intervene in the exchange rate mechanism, but continued intervention risked jeopardizing Zambia’s eligibility for debt relief.",
      "• Zambia qualified for the Heavily Indebted Poor Countries (HIPC) debt relief initiative in 2000, contingent upon meeting specific performance criteria, which was expected to provide a sustainable long-term solution to the country’s debt challenges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:23.514288",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1943,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "2001–2010",
    "text": "On 2 January 2002, MMD's Levy Mwanawasa won the presidential election which\nmany observers claimed had actually been won by the opposition. In January\n2003, the Zambian Government informed the International Monetary Fund and\nWorld Bank that it wished to renegotiate some of the agreed performance\ncriteria calling for privatization of the Zambia National Commercial Bank and\nthe national telephone and electricity utilities.\n\nForeign investors liked Mwanawasa, owing partly to his anti-corruption drive.\nDuring his presidency, Zambia received foreign investment. The main driver of\neconomic growth was minerals. Mwanawasa's policies helped to lower inflation\nto single digits in 2006, a record the country had not seen in over 25 years,\nand spread some benefits to the poor. Tourists and white farmers diverted from\nZimbabwe and helped the Zambian economy. The policies turned the Zambian town\nof Livingstone, near Victoria Falls, into a tourist hub. Zambia received a\nrelatively large amount of aid and debt relief because of liberalisation and\nMwanawasa's efforts. Overall, economic growth increased to about 6% per year.\n\nAfter Mwanawasa suffered a stroke while attending an African Union summit in\nEgypt on 29 June 2008, Rupiah Banda became acting president and subsequently\nPresident. With divisions within the MMD, Banda promised to \"unite the party\nand the entire nation\" and to \"continue implementing [Mwanawasa's] programs\".\nAfter taking office, however, Banda dismantled much of the anti-corruption\neffort put into place by his predecessor, Mwanawasa. This, compounded with the\neffects of the Great Recession, led to a sustained period of increased\ninflation.",
    "openai_summarised_points": [
      "• On 2 January 2002, Levy Mwanawasa of the Movement for Multi-Party Democracy (MMD) won the Zambian presidential election, although many observers claimed the opposition had actually won.",
      "• In January 2003, the Zambian Government notified the International Monetary Fund (IMF) and the World Bank of its intention to renegotiate certain agreed performance criteria, specifically those requiring the privatization of the Zambia National Commercial Bank and the national telephone and electricity utilities.",
      "• Foreign investors favored President Mwanawasa, partly due to his strong anti-corruption campaign during his tenure.",
      "• Under Mwanawasa’s presidency, Zambia experienced an influx of foreign investment, with the mineral sector serving as the primary engine of economic growth.",
      "• Mwanawasa’s economic policies successfully reduced inflation to single-digit levels by 2006, a milestone not achieved in over 25 years in Zambia.",
      "• The economic benefits of Mwanawasa’s policies were partially distributed to the poor, contributing to poverty alleviation.",
      "• Zambia’s tourism sector expanded as tourists and white farmers, displaced from Zimbabwe, relocated to Zambia, notably boosting the economy.",
      "• The town of Livingstone, located near Victoria Falls, was transformed into a significant tourist hub during this period.",
      "• Zambia received substantial foreign aid and debt relief, attributed to economic liberalization and Mwanawasa’s reform efforts.",
      "• Overall, Zambia’s economic growth rate increased to approximately 6% per annum during Mwanawasa’s presidency.",
      "• On 29 June 2008, Mwanawasa suffered a stroke while attending an African Union summit in Egypt, leading to Rupiah Banda becoming acting president and subsequently the official president.",
      "• Rupiah Banda faced internal divisions within the MMD and pledged to \"unite the party and the entire nation\" and to \"continue implementing [Mwanawasa's] programs\" upon assuming office.",
      "• Despite Banda’s initial promises, he dismantled much of Mwanawasa’s anti-corruption framework after taking office.",
      "• The weakening of anti-corruption measures under Banda, combined with the global economic impact of the Great Recession, resulted in a prolonged period of increased inflation in Zambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:23.814957",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1669,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "2011–2020",
    "text": "In September 2011, the social democrat, Michael Sata led the Patriotic Front\n(PF) to victory with a vow to improve conditions for their Zambian employees.\nThough known to previously oppose Chinese investment, he declared his change\nin perspective prior to his election victory. Sata died on 28 October 2014 and\nwas succeeded by Edgar Lungu. The period, saw an infrastructure boom with the\ndevelopment of the Kafue Gorge Lower Power Station, two multi-purpose\nstadiums, Levy Mwanawasa Stadium and National Heroes Stadium, expansions of\nthe Kenneth Kaunda International Airport, the Harry Mwanga Nkumbula\nInternational Airport and the Simon Mwansa Kapwepwe International Airport, and\nthe Pave Zambia 2000 project intended to create and repair major urban roads\ncountrywide.\n\nUnfortunately this came at a huge debt cost that slowed the economy and\ncompounded by corruption and the COVID-19 pandemic resulted in weak GDP growth\nand a recession in 2019 and 2020 respectively. Zambia's GDP had shrunk from\nUS$29 billion to US$19 billion and its debt grew from 16% to 140% of GDP from\n2010 through 2020. In November 2020, Zambia became Africa's first coronavirus-\nera default when it opted to bow out of a US$42.5 million eurobond repayment.",
    "openai_summarised_points": [
      "• In September 2011, Michael Sata, a social democrat and leader of the Patriotic Front (PF), won the Zambian general election with a commitment to improve conditions for Zambian employees.",
      "• Prior to his election victory, Michael Sata, who had previously opposed Chinese investment, publicly changed his stance to support it.",
      "• Michael Sata passed away on 28 October 2014 and was succeeded as president by Edgar Lungu.",
      "• Between 2011 and 2020, Zambia experienced an infrastructure boom including the development of the Kafue Gorge Lower Power Station.",
      "• Two multi-purpose stadiums were constructed during this period: the Levy Mwanawasa Stadium and the National Heroes Stadium.",
      "• Major expansions were undertaken at three international airports: Kenneth Kaunda International Airport, Harry Mwanga Nkumbula International Airport, and Simon Mwansa Kapwepwe International Airport.",
      "• The Pave Zambia 2000 project was launched to create and repair major urban roads throughout the country.",
      "• Despite infrastructure growth, the period was marked by a significant increase in national debt, which slowed economic progress.",
      "• Economic challenges were exacerbated by widespread corruption and the global COVID-19 pandemic.",
      "• These factors contributed to weak GDP growth and led to a recession in Zambia in 2019 and 2020, respectively.",
      "• Zambia’s GDP contracted from US$29 billion in 2010 to US$19 billion in 2020.",
      "• During the same decade, Zambia’s national debt surged dramatically from 16% of GDP in 2010 to 140% of GDP by 2020.",
      "• In November 2020, Zambia became the first African country to default on a debt repayment during the coronavirus pandemic by opting not to repay a US$42.5 million eurobond."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:13.377817",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1234,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "From 2021",
    "text": "In August 2021, the Zambian populace ushered in a new government with a\npromise for jobs growth. Hakainde Hichilema's United Party for National\nDevelopment (UPND) government delivered an ambitious budget that included an\nincrease in the Constituency Development Fund (CDF) from ZMW 1.6 million\n(US$91 thousand) to ZMW 25.7 million (US$1.5 million) for each of Zambia's 156\nconstituencies and its decentralization in release to these constituencies.\nThe expectation is that this will generate jobs growth in addition to the\ngovernment's targeted employment of 30,000 new teachers and 11,200 health\nworkers. In mid July 2022, the government recruited 30,496 Teachers. At the\nend of July 2022, 11,276 health workers, being doctors, nurses and ancillary\nstaff such as drivers were recruited by the government.\n\nWith a push for Zambia to be able to produce 3 million tonnes of Copper per\nannum within the next 10 years, the government reintroduced the deductibility\nof mineral royalty for corporate income tax assessment purposes. The results\nof these policy changes are yet to be seen.\n\nAt the 2022 IMF-World Bank Spring Meetings, the World Bank announced it would\nfund projects worth US$560 million in Zambia in 2022.\n\nIn July 2022, to address its debt challenges, the Zambian government engaged\ncreditors of undisbursed loans to facilitate the formal cancellation of loans\nestimated to be about US$2.0 billion. Projects that were already ongoing would\nnow be financed through government revenues.\n\nIn early August 2022, the Zambia Development Agency, a quasi-government\ninstitution under the Ministry of Commerce, Trade and Industry reported that\nit had recorded numerous investment pledges worth US$3.8 billion in the first\nhalf to 2022 targeting the agriculture, tourism, construction and mining\nsectors with a potential job market of 19,000.\n\nIn October 2021, to spur economic development, Zambia took measures to promote\nlocal development in its ambitious 2022 national budget. The Government\nannounced an unprecedented constituency development fund (CDF) increment from\nZMW 1.6 million (U$91,000) to ZMW 25.7 million (U$1.5million) for each\nconstituency taking the total development fund injection into the local\ncommunities from ZMW 250 million (U$14.2 million) to ZMW 4 billion (U$228.4\nmillion). After winning a crucial Staff-Level IMF Deal, in early December\n2021, Zambia went on to cut fuel subsidies later that month as a key step in\nseeking U$1.4 billion from the IMF.\n\nAt the end of July 2022, the Official Creditor Committee co-chaired by China\nand France, and vice chaired by South Africa agreed to provide the financing\nassurances under the G20 Common Framework for debt treatment that Zambia had\nbeen waiting for to secure final approval from the International Monetary Fund\nfor a US$1.4 billion bailout under the Extended Credit Facility. In early\nAugust 2022, at the symposium on the midyear budget and economic performance\nand the 2023 to 2025 medium term budget plan, Zambia's Minister of Finance and\nNational Planning, Dr. Situmbeko Musokotwane said the IMF board was expected\nto meet at the end of August 2022 to approve the loan programme.\n\nOn 31 August 2022, the International Monetary Fund (IMF) board approved a\nUS$1.3 billion extended credit facility to help Zambia restore fiscal\nstability.\n\nIn June 2023, Zambia reached an agreement in principle to restructure US$6.3\nbillion of debt with bilateral lenders. In October 2023, Zambia agreed a\nmemorandum of understanding (MoU) with its bilateral creditors on\nrestructuring about $6.3 billion of debt. Following the signing of the MoU,\nthe terms would be implemented through bilateral agreements with each member\nof the OCC (Official Creditor Committee).\n\nIn March 2024, Zambia struck an 76.5 billion kwacha (US$3.0 billion)\nrestructuring deal with bondholders. The agreement included important\nconcessions from the Bondholders, while providing the required debt relief to\nthe Government. Under the agreement, Bondholders would forego approximately\n21.4 billion kwacha (US$840 million) of their claims, and provide cash flow\nrelief of approximately 63.8 billion kwacha (US$2.5 billion) during the IMF\nprogramme period.",
    "openai_summarised_points": [
      "• In August 2021, Zambia elected a new government led by Hakainde Hichilema's United Party for National Development (UPND), which promised to stimulate job growth.",
      "• The UPND government introduced an ambitious budget that increased the Constituency Development Fund (CDF) from ZMW 1.6 million (US$91,000) to ZMW 25.7 million (US$1.5 million) for each of Zambia's 156 constituencies, with a policy to decentralize the release of these funds directly to constituencies.",
      "• The government targeted employment creation by planning to hire 30,000 new teachers and 11,200 health workers; by mid-July 2022, 30,496 teachers had been recruited, and by the end of July 2022, 11,276 health workers—including doctors, nurses, and ancillary staff such as drivers—were employed.",
      "• To boost copper production to 3 million tonnes annually within the next decade, the government reintroduced the deductibility of mineral royalty payments for corporate income tax assessment purposes; the outcomes of these policy changes remain pending.",
      "• At the 2022 IMF-World Bank Spring Meetings, the World Bank announced funding of US$560 million for projects in Zambia during 2022.",
      "• In July 2022, to address debt challenges, the Zambian government engaged creditors of undisbursed loans to facilitate formal cancellation of approximately US$2.0 billion in loans, with ongoing projects to be financed through government revenues.",
      "• In early August 2022, the Zambia Development Agency, a quasi-government institution under the Ministry of Commerce, Trade and Industry, reported investment pledges totaling US$3.8 billion in the first half of 2022, targeting agriculture, tourism, construction, and mining sectors, with a potential to create 19,000 jobs.",
      "• In October 2021, Zambia’s 2022 national budget included measures to promote local development, notably increasing the Constituency Development Fund from ZMW 1.6 million (US$91,000) to ZMW 25.7 million (US$1.5 million) per constituency, raising total local development funding from ZMW 250 million (US$14.2 million) to ZMW 4 billion (US$228.4 million).",
      "• After securing a crucial Staff-Level IMF Deal in early December 2021, Zambia cut fuel subsidies later that month as a key step toward obtaining US$1.4 billion from the IMF.",
      "• By the end of July 2022, the Official Creditor Committee (OCC), co-chaired by China and France and vice-chaired by South Africa, agreed to provide financing assurances under the G20 Common Framework for debt treatment, enabling Zambia to secure final approval from the IMF for a US$1.4 billion bailout under the Extended Credit Facility.",
      "• In early August 2022, Zambia’s Minister of Finance and National Planning, Dr. Situmbeko Musokotwane, announced that the IMF board was expected to meet at the end of August 2022 to approve the loan programme.",
      "• On 31 August 2022, the IMF board approved a US$1.3 billion Extended Credit Facility to assist Zambia in restoring fiscal stability.",
      "• In June 2023, Zambia reached an agreement in principle to restructure US$6.3 billion of debt with bilateral lenders.",
      "• In October 2023, Zambia signed a memorandum of understanding (MoU) with its bilateral creditors to restructure approximately US$6.3 billion of debt; the MoU’s terms were to be implemented through bilateral agreements with each member of the Official Creditor Committee (OCC).",
      "• In March 2024, Zambia concluded a 76.5 billion kwacha (US$3.0 billion) debt restructuring deal with bondholders, which included significant concessions from bondholders and provided necessary debt relief to the government.",
      "• Under the March 2024 agreement, bondholders agreed to forgo approximately 21.4 billion kwacha (US$840 million) of their claims and provide cash flow relief amounting to approximately 63.8 billion kwacha (US$2.5 billion) during the IMF programme period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:33.240819",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4193,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.1",
    "section_name": "Public-Private Dialogue Forum (PPDF)",
    "text": "In April 2022, Zambia launched a mechanism aimed at unlocking the potential of\nthe private sector as a driver of economic development and job creation. The\nPublic-Private Dialogue Forum (PPDF) is meant to act as a structured mechanism\nfor interactions between the public and the private sector in tackling\nbottlenecks that have hindered the growth of the private sector.",
    "openai_summarised_points": [
      "• In April 2022, Zambia established the Public-Private Dialogue Forum (PPDF) as a formal mechanism to enhance collaboration between the public and private sectors.",
      "• The PPDF was created with the objective of unlocking the potential of the private sector to serve as a key driver of economic development and job creation in Zambia.",
      "• The forum is designed to provide a structured platform for dialogue and interaction between government entities and private sector stakeholders.",
      "• A primary focus of the PPDF is to identify and address bottlenecks that have historically impeded the growth and expansion of Zambia’s private sector.",
      "• By facilitating continuous engagement and problem-solving, the PPDF aims to improve the business environment and stimulate private sector-led economic growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:21.666322",
      "openai_model": "gpt-4.1-mini",
      "content_length": 370,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.2",
    "section_name": "European Union (EU)–Zambia Economic Forum",
    "text": "In May 2022, the inaugural European Union (EU)-Zambia Economic Forum was\nlaunched in Lusaka by President Hakainde Hichilema under the theme ‘Economic\ntransformation through green growth’. It was a high-level event that brought\ntogether entrepreneurs, experts, financial institutions, innovators, and\npolicy decision-makers from Zambia, the EU and representatives of its 27\nmember states. Additional special guests included the EU Commissioner for\nAgriculture Janusz Wojciechowski and the commissioner for Trade and Industry\nof the African Union Commission, Albert M. Muchanga. The forum was launched as\na platform with a view to promoting employment, value addition and increased\ntrade through business-to-business (B2B) and business-to-government (B2G)\ncollaboration and economic synergies for EU and Zambian businesses.",
    "openai_summarised_points": [
      "• In May 2022, the inaugural European Union (EU)-Zambia Economic Forum was launched in Lusaka by President Hakainde Hichilema under the theme ‘Economic transformation through green growth’.",
      "• The forum was a high-level event that convened entrepreneurs, experts, financial institutions, innovators, and policy decision-makers from Zambia, the EU, and representatives of its 27 member states.",
      "• Special guests at the forum included the EU Commissioner for Agriculture, Janusz Wojciechowski, and the Commissioner for Trade and Industry of the African Union Commission, Albert M. Muchanga.",
      "• The EU-Zambia Economic Forum was established as a platform aimed at promoting employment, value addition, and increased trade between the EU and Zambia.",
      "• The forum sought to facilitate business-to-business (B2B) and business-to-government (B2G) collaboration and foster economic synergies for EU and Zambian businesses."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:17.981274",
      "openai_model": "gpt-4.1-mini",
      "content_length": 821,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.3",
    "section_name": "UK–Zambia Green Growth Compact",
    "text": "In November 2021, the Zambian and British government signed the UK-Zambia\nGreen Growth Compact, an agreement expected to boost the United Kingdom's\ninvestment into Zambia by **£** 1.0 billion (US$1.26 billion) with a focus on\njob creation and green energy production. In May 2022, the British High\nCommissioner to Zambia Nicholas Woolley, indicated that the British government\nhad set aside the **£** 1.0 billion to be spent over the next 5 years with\n**£** 100.0 million (US$126.0 million) targeted for funding Small Medium\nEntrepreneurs (SMEs) and **£ 5**00.0 million (US$629.9 million) for investment\nin renewable energy.",
    "openai_summarised_points": [
      "• In November 2021, the governments of Zambia and the United Kingdom signed the UK-Zambia Green Growth Compact, a bilateral agreement aimed at enhancing UK investment in Zambia.",
      "• The agreement is projected to increase UK investment in Zambia by £1.0 billion, equivalent to US$1.26 billion, with a strategic focus on job creation and the development of green energy production.",
      "• In May 2022, Nicholas Woolley, the British High Commissioner to Zambia, announced that the British government had allocated the full £1.0 billion investment to be disbursed over a five-year period.",
      "• Of the £1.0 billion, £100.0 million (US$126.0 million) is specifically earmarked to support Small and Medium Entrepreneurs (SMEs) in Zambia, promoting business growth and economic diversification.",
      "• Additionally, £500.0 million (US$629.9 million) of the allocated funds are designated for investment in renewable energy projects within Zambia, underscoring the commitment to sustainable and green economic development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:25.865946",
      "openai_model": "gpt-4.1-mini",
      "content_length": 624,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.4",
    "section_name": "World Bank Support",
    "text": "In July 2022, the World Bank approved US$155.0 million in International\nDevelopment Assistance for Social Cash Transfer to mitigate the high cost of\nliving pressures in Zambia and a further US$27.0 million credit facility to\nsupport the government's development programs.\n\nIn July 2022, the World Bank approved a further US$665.0 million to fund\nprojects in Zambia to spur economic recovery and growth and also lighten the\ndebt burden. Through 2032, the World Bank plans to support Zambia with new\nfinancing of over US$2.0 billion in the form of concessional loans.\n\nIn late October 2022, the World Bank approved US$275.0 million concessional\nloan targeted at fiscal stabilization and accelerated economic programs.\nFinancing was provided by the World Bank's International Development\nAssociation (IDA).",
    "openai_summarised_points": [
      "• In July 2022, the World Bank approved US$155.0 million in International Development Assistance specifically for Social Cash Transfer programs aimed at mitigating the high cost of living pressures experienced in Zambia.",
      "• Alongside the Social Cash Transfer funding, the World Bank also approved an additional US$27.0 million credit facility in July 2022 to support the Zambian government's broader development programs.",
      "• In the same month, July 2022, the World Bank further approved US$665.0 million to finance various projects in Zambia with the objectives of spurring economic recovery, promoting growth, and alleviating the country’s debt burden.",
      "• The World Bank has outlined plans to provide Zambia with over US$2.0 billion in new financing through concessional loans extending through the year 2032, demonstrating a long-term commitment to the country’s economic development.",
      "• In late October 2022, the World Bank approved a concessional loan amounting to US$275.0 million, which was targeted at fiscal stabilization and the acceleration of economic programs in Zambia.",
      "• This US$275.0 million concessional loan was financed by the World Bank’s International Development Association (IDA), highlighting the IDA’s role in supporting Zambia’s fiscal and economic initiatives."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:25.255006",
      "openai_model": "gpt-4.1-mini",
      "content_length": 803,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.5",
    "section_name": "African Export-Import Bank (Afreximbank) Support",
    "text": "In July 2022, the African Export-Import Bank President Benedict Oramah, whilst\nin Lusaka Zambia, announced that the bank would put up an investment of about\nUS$250 million for Zambia's first-ever Battery Electric Vehicle (BEV)\nmanufacturing plant.",
    "openai_summarised_points": [
      "• In July 2022, Benedict Oramah, President of the African Export-Import Bank (Afreximbank), announced during his visit to Lusaka, Zambia, that the bank would invest approximately US$250 million in the country.",
      "• The investment is designated for the establishment of Zambia's first-ever Battery Electric Vehicle (BEV) manufacturing plant.",
      "• This initiative marks a significant milestone in Zambia's industrial and economic development, particularly in the automotive and clean energy sectors.",
      "• The announcement underscores Afreximbank's commitment to supporting industrialization and technological advancement within Zambia and the broader African continent."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:23.515399",
      "openai_model": "gpt-4.1-mini",
      "content_length": 247,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.6",
    "section_name": "EAC-SADC-COMESA Free Trade Area",
    "text": "In July 2022, during the 4th Mid-Year Coordination Meeting of the African\nUnion, Regional Economic Communities and Regional Mechanisms in Lusaka,\nZambia, the three regional blocs, East African Community (EAC), Southern\nAfrican Development Community (SADC), and Common Market for Eastern and\nSouthern Africa (COMESA) agreed to have a tripartite ministers' summit to fast\ntrack the finalization of the border control-free travel and free movement of\ngoods and services area by the end of 2022.",
    "openai_summarised_points": [
      "• In July 2022, the 4th Mid-Year Coordination Meeting of the African Union, Regional Economic Communities, and Regional Mechanisms was held in Lusaka, Zambia.",
      "• During this meeting, three regional blocs—the East African Community (EAC), Southern African Development Community (SADC), and Common Market for Eastern and Southern Africa (COMESA)—reached a significant agreement.",
      "• The agreement entailed convening a tripartite ministers' summit aimed at accelerating the completion of a border control-free travel and free movement of goods and services area.",
      "• The objective was to finalize this integrated free trade and movement zone by the end of 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:26.481165",
      "openai_model": "gpt-4.1-mini",
      "content_length": 491,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.7",
    "section_name": "Zambia-China Trade and Investment Forum",
    "text": "In September 2022, Zambia and China launched the inaugural trade and\ninvestment forum aimed at unlocking trade and investment potential between the\ntwo countries. The event also saw the signing of an Exchange Letter of the\nDuty Free Treatment for Zambian products corresponding to 98-percent of the\ntariff lines by Finance Minister Situmbeko Musokotwane and Chinese Ambassador\nto Zambia Du Xiao.",
    "openai_summarised_points": [
      "• In September 2022, Zambia and China inaugurated their first-ever trade and investment forum designed to enhance and unlock the trade and investment potential between the two nations.",
      "• During this inaugural forum, an Exchange Letter was signed to grant Duty Free Treatment for Zambian products, covering 98 percent of the tariff lines.",
      "• The Exchange Letter was signed by Zambia’s Finance Minister Situmbeko Musokotwane and the Chinese Ambassador to Zambia, Du Xiao."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:25.925467",
      "openai_model": "gpt-4.1-mini",
      "content_length": 395,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.8",
    "section_name": "Zambia-China bilateral trade growth",
    "text": "In mid-September 2023, President Hakainde Hichilema met with The President of\nThe Peoples Republic of China, Xi Jinping in Beijing where they witnessed the\nsigning of over 15 MOUs amounting to a potential investment of about ZMW 62.3\nbillion kwacha (US$3.0 billion) by China into Zambia and the leaders also\nagreed to increase the use of local currencies in trade between the two\ncountries. One of the MOUs signed during Mr. Hichilema's visit to China was\nwith the international telecoms manufacturer ZTE to construct and open a\nsmartphone manufacturing plant in Zambia. In late-September 2023, China\nNonferrous Metal Mining Group (CNMC) unveiled plans to inject an additional\nZMW 27.0 billion kwacha (US $1.3 billion) into Zambia from 2023 through 2028,\nspanning the mining, energy, education and technology economic sectors.",
    "openai_summarised_points": [
      "• In mid-September 2023, Zambian President Hakainde Hichilema met with Chinese President Xi Jinping in Beijing to discuss bilateral relations and economic cooperation.",
      "• During the meeting, over 15 Memoranda of Understanding (MOUs) were signed, representing a potential Chinese investment of approximately ZMW 62.3 billion kwacha (equivalent to US$3.0 billion) into Zambia.",
      "• The two leaders agreed to increase the use of local currencies in trade transactions between Zambia and China, aiming to facilitate smoother and more cost-effective bilateral trade.",
      "• Among the MOUs signed was a significant agreement with ZTE, an international telecommunications manufacturer, to establish and operate a smartphone manufacturing plant in Zambia, marking a strategic industrial collaboration.",
      "• In late September 2023, China Nonferrous Metal Mining Group (CNMC) announced plans to invest an additional ZMW 27.0 billion kwacha (US$1.3 billion) into Zambia over the period from 2023 to 2028.",
      "• CNMC’s planned investment targets multiple sectors of the Zambian economy, including mining, energy, education, and technology, indicating a diversified approach to economic development and cooperation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:31.500030",
      "openai_model": "gpt-4.1-mini",
      "content_length": 826,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.6.9",
    "section_name": "U.S.-Zambia Business Summit",
    "text": "In October 2022, more than 50 United States and Zambian business and\ngovernment leaders gathered in Lusaka for the two-day inaugural U.S.-Zambia\nBusiness Summit at the Intercontinental Hotel. Representatives from the U.S.\nTrade and Development Agency, U.S. International Development Finance\nCorporation also attended the Summit. The Summit focused on promoting Zambia\nas one of the most attractive business environments for investment on the\nAfrican continent.\n\n**African Continental Free Trade Area (AfCFTA) Digital Trade Forum**\n\nIn May 2025, Zambia hosted the inaugural, African Continental Free Trade Area\n(AfCFTA) Digital Trade Forum in Lusaka. The Digital Trade Forum, bringing\ntogether policymakers and business leaders from across Africa, aimed to\ndevelop practical strategies for implementing the AfCFTA’s digital commerce\nprovisions.",
    "openai_summarised_points": [
      "• In October 2022, over 50 business and government leaders from the United States and Zambia convened in Lusaka for the inaugural U.S.-Zambia Business Summit, held over two days at the Intercontinental Hotel.",
      "• The Summit included participation from key U.S. agencies such as the U.S. Trade and Development Agency and the U.S. International Development Finance Corporation.",
      "• The primary focus of the Summit was to promote Zambia as one of the most attractive business environments for investment within the African continent.",
      "• In May 2025, Zambia hosted the inaugural African Continental Free Trade Area (AfCFTA) Digital Trade Forum in Lusaka.",
      "• The AfCFTA Digital Trade Forum gathered policymakers and business leaders from across Africa to collaborate on developing practical strategies for implementing the digital commerce provisions outlined in the AfCFTA agreement."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:28.835144",
      "openai_model": "gpt-4.1-mini",
      "content_length": 843,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.7",
    "section_name": "Mining",
    "text": "In 2019, the country was the world's 7th largest producer of copper.\n\nThe Zambian economy has historically been based on the copper-mining industry.\nThe industrialization of the copper industry is owed partly to Frederick\nRussell Burnham, the famous American scout who worked for Cecil Rhodes. By\n1998, however, output of copper had fallen to a low of 228,000 tonnes,\ncontinuing a 30-year decline in output due to lack of investment, and until\nrecently, low copper prices and uncertainty over privatization. In 2001, the\nfirst full year of a privatized industry, Zambia recorded its first year of\nincreased productivity since 1973. The future of the copper industry in Zambia\nwas thrown into doubt in January 2002, when investors in Zambia's largest\ncopper mine announced their intention to withdraw their investment. However,\nsurging copper prices from 2004 to the present day rapidly rekindled\ninternational interest in Zambia's copper sector with a new buyer found for\nKCCM and massive investments in expanding capacity launched. China has become\na major investor in the Zambian copper industry, and in February 2007, the two\ncountries announced the creation of a Chinese-Zambian economic partnership\nzone around the Chambishi copper mine.\n\nToday copper mining is central to the economic prospects for Zambia and covers\n85% of all the country's exports, but concerns remain that the economy is not\ndiversified enough to cope with a collapse in international copper prices.\n\nProduction of Mineral Raw Materials 2016-2024  Year  | Copper (MT)  | % Growth of Cu | Cobalt (MT)  | Gold (kg)  | Nickel (MT)  | Manganese (MT)  | Coal(MT)  | Emeralds(kg)  | Beryllium (kg)  | Sulfur (elemental & industrial) (MT)\n---|---|---|---|---|---|---|---|---|---|---\n2016  | 774,290  | 8.82%  | 5,276  | 4.610  | 0  | 27,500  | 129,470  | 74,742  | 5,000  | 363,000\n2017  | 799,329  | 3.23%  | 2,649  | 4,373  | 0  | 39,900  | 208,608  | 65,243  | 4,000  | 679,500\n2018  | 861,946  | 7.83%  | 1,766  | 4,044  | 0  | 37,800  | 344,717  | 18,869  | 7,000  | 947,800\n2019  | 796,430  | -7.60%  | 1,271  | 4.522  | 1,110  | 15,904  | 361,648  | 23,705  | 7,000  | 960,300\n2020  | 882,061  | 10.75%  |  367  | 3,994  | 3,226  | 46,515  | 446,153  | 7,653  | 2,000  | 917,300\n2021  | 802,967  | -8.97%  |  247  | 2,432  | 3,834  | 132,241  | 663,345  | 12,871  |  |\n2022  | 763,287  | -4.94%  |  251  | 1,515  | 4,059  | 161,611  | 781,466  | 20,703  |  |\n2023  | 682,431  | -10.59%  |  1,467  |  1,945  | 6,169  | 171,066  | 915,187  | 14,814  |  |\n2024  | 771,036  | 12.98%  | 1,310  | 3.159  | 19,137  |  | 769,531  | 31,683  |  |\n\nIn January 2013, the Zambia Environmental Management Agency (ZEMA) approved 27\nmining and exploration licences, with more rumoured to be confirmed.\n\nZambia is the world's second biggest producer of emeralds, with its Kafubu\nRiver area deposits (Kagem Mines) about 45 km (28 mi) southwest of Kitwe\nresponsible for 20% of the world's production of gem-quality stones in 2004.\nIn the first half of 2011, the Kagem Mines produced 3.74 tons of emeralds. In\nApril 2022, Gemfields, the majority owner in the mine, recorded a record\nU$42.3 million at a sold out March/April auction and since 2009, Kagem-sourced\ngemstones (emerald and beryl) have netted Gemfields revenue totaling U$792\nmillion with the proceeds fully repatriated to Kagem in Zambia, with all\nroyalties due to the Zambian government paid on the full sales prices achieved\nat auctions.\n\nKagem Mines Performance  Year  | Premium Emerald (carats)  | Emerald and Beryl ('000 carats)\n---|---|---\n2019  | 204,600  | 36,300\n2020  | 133,900  | 9,400\n2021  | 230,500  | 32,000\n2022  | 259,500  | 37,241\n2023  | 156,700  | 30,153\n\nRich deposits of Uranium have been discovered in some parts of Zambia. In\n2007, the Zambian government sought scrutiny and guidance from the\nInternational Atomic Energy Agency (IAEA) on its developed guidelines to\nregulate the mining of uranium in the country. In 2008, deposits were found in\nKaputa District, Northern Province. Albidon Zambia Limited also confirmed the\npresence of high-grade uranium mineralisation at its Njame east project near\nChirundu. In the Southern Province, 31 km North of Siavonga, and north of Lake\nKariba, there are 5 main Uranium Deposits: Mutanga, Dibwe, Dibwe East, Njame,\nand Gwabe explored under The Mutanga Uranium Project. The Canadian Toronto\nStock Exchange (TSX) listed GoviEx Uranium Inc acquired 100% of the Mutanga\nProject also known as the Kariba Uranium Project in 2016. In March 2022,\nGoviEx announced that the Project is forecast to start production in 2027 and\ncould be the lowest capital intensive uranium project in Africa.\n\nLumwana Mining Company Limited (LMC) who had embarked on uranium exploration\nin 2007 in Solwezi District are currently stock piling uranium that the firm\nis getting as a by-product of Copper from its operations as they are yet to\nobtain a uranium license. The mining of uranium in Zambia is monitored by the\nZambia Environmental Management Agency (ZEMA).\n\n_See Also:_\n\n* Munali Nickel Mine estimated development cost U$180 million in 2007\n* Enterprise Nickel Project estimated development cost U$275 million",
    "openai_summarised_points": [
      "• In 2019, Zambia ranked as the world's 7th largest producer of copper, underscoring the country's significant role in the global copper market.",
      "• The Zambian economy has historically been heavily reliant on the copper-mining industry, which has been central to its industrialization and economic development.",
      "• The industrialization of Zambia's copper industry is partly attributed to Frederick Russell Burnham, an American scout who worked under Cecil Rhodes, highlighting early foreign influence in the sector.",
      "• By 1998, copper output in Zambia had declined to a low of 228,000 tonnes, marking a 30-year downward trend caused by insufficient investment, low copper prices, and uncertainty surrounding the privatization of the mining sector.",
      "• In 2001, following the privatization of the copper industry, Zambia experienced its first increase in copper productivity since 1973, signaling a potential turnaround in the sector.",
      "• In January 2002, the future of Zambia's copper industry faced uncertainty when investors in the country’s largest copper mine announced plans to withdraw their investments.",
      "• From 2004 onwards, rising international copper prices revitalized global interest in Zambia’s copper sector, leading to the acquisition of the Konkola Copper Mines (KCCM) by new investors and significant capital investments aimed at expanding production capacity.",
      "• China emerged as a major investor in Zambia’s copper mining industry, culminating in February 2007 with the establishment of a Chinese-Zambian economic partnership zone centered around the Chambishi copper mine.",
      "• Copper mining remains pivotal to Zambia’s economy, accounting for approximately 85% of the country’s exports; however, concerns persist regarding the lack of economic diversification and vulnerability to fluctuations in global copper prices.",
      "• Production data from 2016 to 2024 indicates fluctuating outputs in various minerals: copper production ranged from 682,431 MT in 2023 to a projected 771,036 MT in 2024, with growth rates varying annually, including a peak growth of 12.98% in 2024 and declines such as -10.59% in 2023.",
      "• Other mineral outputs during 2016-2024 include cobalt (ranging from 367 MT in 2020 to 5,276 MT in 2016), gold (from 1,515 kg in 2022 to 4,610 kg in 2016), nickel (starting production in 2019 with 1,110 MT and increasing to 19,137 MT projected in 2024), manganese (from 15,904 MT in 2019 to 171,066 MT in 2023), coal (from 129,470 MT in 2016 to 915,187 MT in 2023), emeralds (ranging from 7,653 kg in 2020 to 31,683 kg projected in 2024), beryllium (from 2,000 kg in 2020 to 7,000 kg in 2018 and 2019), and sulfur (elemental and industrial) increasing from 363,000 MT in 2016 to 960,300 MT in 2019.",
      "• In January 2013, the Zambia Environmental Management Agency (ZEMA) approved 27 mining and exploration licenses, with additional licenses rumored to be forthcoming, indicating regulatory support for mining expansion.",
      "• Zambia is the world’s second-largest producer of emeralds, with the Kafubu River area deposits, particularly Kagem Mines located about 45 km southwest of Kitwe, responsible for 20% of global gem-quality emerald production in 2004.",
      "• In the first half of 2011, Kagem Mines produced 3.74 tons of emeralds, demonstrating significant output from this key mining site.",
      "• In April 2022, Gemfields, the majority owner of Kagem Mines, achieved a record U$42.3 million in revenue from a sold-out March/April auction; since 2009, Kagem-sourced gemstones (emerald and beryl) have generated total revenue of U$792 million for Gemfields, with all proceeds fully repatriated to Kagem in Zambia and all royalties duly paid to the Zambian government based on full auction sales prices.",
      "• Kagem Mines’ performance data from 2019 to 2023 shows fluctuations in premium emerald carats and total emerald and beryl production: premium emerald carats ranged from 133,900 in 2020 to 259,500 in 2022, while emerald and beryl production varied between 9,400,000 carats in 2020 and 37,241,000 carats in 2022.",
      "• Rich uranium deposits have been discovered in various parts of Zambia, prompting the government in 2007 to seek guidance from the International Atomic Energy Agency (IAEA) to develop regulatory guidelines for uranium mining.",
      "• In 2008, uranium deposits were identified in Kaputa District, Northern Province, and Albidon Zambia Limited confirmed high-grade uranium mineralization at its Njame East project near Chirundu.",
      "• The Southern Province hosts five main uranium deposits—Mutanga, Dibwe, Dibwe East, Njame, and Gwabe—explored under the Mutanga Uranium Project located 31 km north of Siavonga and north of Lake Kariba.",
      "• The Mutanga Uranium Project, also known as the Kariba Uranium Project, was acquired in 2016 by GoviEx Uranium Inc, a company listed on the Toronto Stock Exchange (TSX) in Canada.",
      "• In March 2022, GoviEx announced that the Mutanga Uranium Project is forecasted to commence production in 2027 and is expected to be the lowest capital-intensive uranium project in Africa.",
      "• Lumwana Mining Company Limited (LMC), which began uranium exploration in 2007 in Solwezi District, is currently stockpiling uranium obtained as a by-product of copper mining operations while awaiting a uranium mining license.",
      "• Uranium mining activities in Zambia are regulated and monitored by the Zambia Environmental Management Agency (ZEMA), ensuring environmental compliance.",
      "• Additional notable mining projects include the Munali Nickel Mine, with an estimated development cost of U$180 million in 2007, and the Enterprise Nickel Project, estimated at U$275 million, reflecting ongoing investments in nickel mining development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:46.145704",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5174,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.8",
    "section_name": "Agriculture",
    "text": "The agriculture sector represented 2.7% GDP in 2019. Agriculture accounted for\n85% of total employment (formal and informal) for 2000. Maize (corn) is the\nprincipal cash crop as well as the staple food. Other important crops include\nsoybean, cotton, sugar, sunflower seeds, wheat, sorghum, pearl millet,\ncassava, tobacco and various vegetable and fruit crops. Floriculture is a\ngrowth sector, and agricultural non-traditional exports now rival the mining\nindustry in foreign exchange receipts. Zambia has the potential for\nsignificantly increasing its agricultural output; currently, less than 20% of\nits arable land is cultivated. In the past, the agriculture sector suffered\nfrom low producer prices, difficulties in availability and distribution of\ncredit and inputs, and the shortage of foreign exchange.\n\nMajor Crop Production Statistics and Growth  Year  | Maize (MT)  | Cassava (MT)  | Sugarcane (MT)  | Wheat (MT)  | Soya Beans (MT)  | Sweet Potato(MT)  | Cotton (MT)  | Groundnuts (MT)  | Millet(MT)  | Vegetables (MT)  | Tobacco(US$)\n---|---|---|---|---|---|---|---|---|---|---|---\n2010  | 2,800,000  | 1,151,000  | 3,700,000  | 172,256  | 111,887  | 252,867  | 107,000  | 164,602  | 47,997  | 364,326  | 147,201,182\n2011  | 3,020,000  | 1,132,150  | 4,200,000  | 237,332  | 116,539  | 146,614  | 131,298  | 279,000  | 41,602  | 335,000  | 153,242,976\n2012  | 2,850,000  | 1,107,954  | 4,300,000  | 253,522  | 203,038  | 163,484  | 269,501  | 113,026  | 28,445  | 350,000  | 163,890,992\n2013  | 2,533,000  | 1,114,583  | 4,600,000  | 273,584  | 262,063  | 187,774  | 139,583  | 106,792  | 23,942  | 350,000  | 169,418,496\n2014  | 3,351,000  |  919,497  | 4,600,000  | 201,504  | 214,179  | 149,355  | 120,314  | 143,591  | 30,504  | 353,586  | 179,120,836\n2015  | 2,618,000  |  952,770  | 4,155,000  | 309,100  | 226,323  | 117,215  | 103,889  | 111,429  | 31,967  | 374,208  | 188,823,176\n2016  | 2,873,000  | 2,222,844  | 4,083,000  | 221,644  | 267,490  | 230,248  | 111,902  | 131,562  | 29,972  | 369,542  | 198,525,516\n2017  | 3,607,000  | 3,695,182  | 4,365,965  | 279,329  | 351,416  | 205,834  |  89,293  | 168,699  | 32,566  | 365,779  | 205,936,998\n2018  | 2,395,000  | 4,102,300  | 4,630,000  | 171,424  | 302,720  | 183,280  |  88,219  | 181,772  | 32,278  | 369,843  | 213,838,216\n2019  | 2,004,389  | 4,036,584  | 4,682,000  | 151,850  | 281,389  | 109,336  |  66,315  | 130,825  | 24,843  | 368,338  | 221,581,410\n2020  | 3,387,469  | 3,931,915  | 4,827,104  | 191,620  | 296,866  | 144,706  |  41.441  | 127,172  | 45,005  | 368,003  | 185,000,000\n2021  | 3,620,244  | 3,800,153  | 5,102,118  | 205,881  | 411,115  | 213,566  |  31,859  | 175,329  | 34,702  | 445,625  | 114,184,304\n2022  | 2,653,805  | 3,315,611  |  | 277,586  | 438,679  | 162,614  |  19,375  | 180,256  | 24,224  |  | N/A\n2023  | 3,261,686  | 4,450,019  |  | 277,492  | 760,067  | 234,631  | 55,971  | 235,446  | 46,753  |  |\nCut flowers and flower buds **suitable for bouquets or for ornamental purposes, fresh,** **dried, dyed, bleached, impregnated or otherwise prepared** Year  | **Exports (US$)** | Export Growth%  | **Imports (US$)**\n---|---|---|---\n2010  |  333,520  |  -62.05%  | 7,140\n2011  | 17,364,392  |  5,106.40%  | 4,574\n2012  | 23,820,333  |  37.17%  | 3,369\n2013  | 32,150,400  |  34.97%  | 12,039\n2014  | 13,623,771  |  -57.64%  | 6,645\n2015  | 12,326,666  |  -9.52%  | 20,330\n2016  | 10,371,243  |  -15.86%  | 31,849\n2017  | 10,531,349  |  1.54%  | 3,065\n2018  |  9,371,243  |  -6.99%  | 15,623\n2019  |  8,068,641  |  -17.61%  | 17,302\n2020  |  7,051,388  |  -12.60%  | 32,755\n\nIn 2019 Zambia produced:[_verification needed_]\n\n* 4.7 million tons of sugarcane;\n* 4 million tons of cassava (18th largest producer in the world);\n* 2 million tons of maize;\n* 281 thousand tons of soy;\n* 153 thousand tons of tobacco (6th largest producer in the world);\n* 151 thousand tons of wheat;\n* 130 thousand tons of peanut;\n* 109 thousand tons of sweet potato;\n* 72 thousand tons of cotton;\n* 6,900 tons of coffee;\n\nIn addition to other productions of other agricultural products.\n\nDue to high demand for flour in neighboring Democratic Republic of the Congo\nDRC, Zambia increased Wheat production from 205,000 tonnes in 2020 to 400,000\ntonnes 2021.\n\nIn July 2022, Zambia and China sealed a memorandum of understanding on soya\nbean meal and stevia export from Zambia to China.",
    "openai_summarised_points": [
      "• In 2019, the agriculture sector contributed 2.7% to Zambia's GDP, reflecting its economic significance within the country.",
      "• Agriculture accounted for 85% of total employment (both formal and informal) as of the year 2000, indicating its role as a primary source of livelihood for the majority of the population.",
      "• Maize (corn) serves as both the principal cash crop and the staple food in Zambia, underscoring its centrality in the agricultural landscape.",
      "• Other significant crops cultivated in Zambia include soybean, cotton, sugar, sunflower seeds, wheat, sorghum, pearl millet, cassava, tobacco, and various vegetable and fruit crops, highlighting the sector's crop diversity.",
      "• Floriculture has emerged as a growth sector within Zambian agriculture, with agricultural non-traditional exports now rivaling the mining industry in terms of foreign exchange earnings.",
      "• Zambia possesses considerable potential to increase agricultural output, as currently less than 20% of its arable land is under cultivation, indicating room for expansion and intensification.",
      "• Historically, the agriculture sector faced challenges such as low producer prices, difficulties in accessing and distributing credit and inputs, and shortages of foreign exchange, which constrained growth.",
      "• Major crop production statistics from 2010 to 2023 show fluctuations and growth in various crops:",
      "• Maize production ranged from 2,004,389 MT in 2019 to a peak of 3,620,244 MT in 2021.",
      "• Cassava production increased significantly from 1,151,000 MT in 2010 to 4,450,019 MT in 2023.",
      "• Sugarcane production rose from 3,700,000 MT in 2010 to over 5,102,118 MT in 2021, with some years missing data.",
      "• Wheat production varied between 151,850 MT in 2019 and 277,586 MT in 2022, with a notable increase to 400,000 tonnes in 2021 due to demand from the Democratic Republic of the Congo.",
      "• Soybean production grew from 111,887 MT in 2010 to 760,067 MT in 2023, reflecting rapid expansion.",
      "• Sweet potato production fluctuated, peaking at 252,867 MT in 2010 and reaching 234,631 MT in 2023.",
      "• Cotton production declined from 107,000 MT in 2010 to 55,971 MT in 2023.",
      "• Groundnuts production showed variability, with 164,602 MT in 2010 and 235,446 MT in 2023.",
      "• Millet production ranged from 23,942 MT in 2013 to 46,753 MT in 2023.",
      "• Vegetable production remained relatively stable, around 350,000 to 445,625 MT between 2010 and 2021, with some missing data in later years.",
      "• Tobacco exports in US dollars increased from approximately $147 million in 2010 to a peak of $221.58 million in 2019, then declined to $114.18 million in 2021.",
      "• In 2019, Zambia's agricultural production included:",
      "• 4.7 million tons of sugarcane;",
      "• 4 million tons of cassava, ranking Zambia as the 18th largest producer globally;",
      "• 2 million tons of maize;",
      "• 281 thousand tons of soybeans;",
      "• 153 thousand tons of tobacco, making Zambia the 6th largest tobacco producer worldwide;",
      "• 151 thousand tons of wheat;",
      "• 130 thousand tons of peanuts;",
      "• 109 thousand tons of sweet potatoes;",
      "• 72 thousand tons of cotton;",
      "• 6,900 tons of coffee;",
      "• along with various other agricultural products.",
      "• Wheat production notably increased from 205,000 tonnes in 2020 to 400,000 tonnes in 2021, driven by high flour demand in the neighboring Democratic Republic of the Congo (DRC).",
      "• The floriculture sector, specifically exports of cut flowers and flower buds suitable for bouquets or ornamental purposes (fresh, dried, dyed, bleached, impregnated, or otherwise prepared), showed significant export growth:",
      "• Exports surged from US$333,520 in 2010 to a peak of US$32,150,400 in 2013, representing a 5,106.40% growth from 2010 to 2011.",
      "• After 2013, exports declined steadily to US$7,051,388 in 2020.",
      "• Imports of these floriculture products remained relatively low, fluctuating between US$3,369 and US$32,755 during 2010–2020.",
      "• In July 2022, Zambia and China signed a memorandum of understanding (MoU) to facilitate the export of soybean meal and stevia from Zambia to China, indicating growing international trade relations in agricultural commodities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:43.073898",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4378,
      "bullet_points_count": 37
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.9",
    "section_name": "Fisheries and Livestock",
    "text": "The Fisheries and Livestock sub-sector in Zambia contributes to employment\ncreation, food and nutrition security, and economic growth.\n\nCapture Fishery and Aquaculture Production  Year  | Capture Fishery (MT)  | % Growth of Capture Fishery  | Aquaculture (MT)  | % Growth of Aquaculture\n---|---|---|---|---\n2005  | 65,927  |  | 5,125  |\n2006  | 60,236  |  -8.63%  | 5,125  |  0.00%\n2007  | 73,542  |  22.09%  | 5,120  |  -0.10%\n2008  | 79,403  |  7.97%  | 5,876  |  14.77%\n2009  | 84,716  |  6.69%  | 5,640  |  -4.02%\n2010  | 76,396  |  -9.82%  | 9,535  |  69.06%\n2011  | 69,364  |  -9.20%  | 10,291  |  7.93%\n2012  | 80,638  |  16.25%  | 12,988  |  26.21%\n2013  | 75,187  |  -6.76%  | 20,271  |  56.07%\n2014  | 80,826  |  7.50%  | 19,281  |  -4.88%\n2015  | 83,719  |  3.58%  | 22,753  |  18.01%\n2016  | 83,918  |  0.24%  | 28,669  |  26.00%\n2017  | 88,075  |  4.95%  | 21,567  |  -24.77%\n2018  | 89,195  |  1.27%  | 29,565  |  37.08%\n2019  | 91,342  |  2.41%  | 38,480  |  30.15%\n2020  | 94,943  |  3.94%  | 45,670  |  18.69%\n2021  | 95,625  |  0.72%  | 59,679  |  30.67%\n2022  | 99, 928  |  4.50%  | 75,647  |  26.70%\n2023  | 101,825  | 1.90%  | 76,627  | 1.30%\nLivestock population 2017-2021  Year  | Cattle | Sheep | Goats | Pigs | Chickens\n---|---|---|---|---|---\n2017  | 3,714,667  | 170,262  | 3,583,696  | 1,082,765  | 39,147,000\n2018  | 3,927,432  | 185,105  | 4,008,197  | 1,292,287  | 39,008,000\n2019  | 3,814,438  | 165,236  | 3,948,861  | 1,331,576  | 39,690,000\n2020  | 3,885,336  | 174,001  | 3,957,252  | 1,166,924  | 40,438,000\n2021  | 4,371,801  | 190,876  | 4,117,674  | 1,146,276  | 41,230,000\n2022  | 4,698,972  | 260,560  | 4,455,860  | 1,160,842  | 30,586,024\n2023  | 4,839,941  | 264,729  | 4,548,542  | 1,167,807  | 31,824,758\nLivestock products 2018-2019  Year  | Milk (MT)  | Eggs (000)  | Hides (MT)  | Beef (MT)  | Pork (MT)  | Poultry (MT)\n---|---|---|---|---|---|---\n2018  | 1,686,400  | 1,642,693  | 345,549  | 6,103,281  | 555,270  | 5,111,098\n2019  | 2,045,603  | 1,744,047  | 369,357  | 6,763,045  | 595,472  | 5,537,874\n\nIn livestock, Zambia produced, in 2019: 191 thousand tons of beef; 50 thousand\ntons of chicken meat; 34 thousand tons of pork; 453 million liters of cow's\nmilk, among others.",
    "openai_summarised_points": [
      "• The Fisheries and Livestock sub-sector in Zambia plays a significant role in employment creation, food and nutrition security, and overall economic growth.",
      "• Capture fishery production in Zambia showed fluctuations from 2005 to 2023, starting at 65,927 metric tons (MT) in 2005 and increasing to 101,825 MT by 2023, with annual growth rates varying between -9.82% and 22.09%.",
      "• Aquaculture production in Zambia increased substantially from 5,125 MT in 2005 to 76,627 MT in 2023, with notable growth rates including 69.06% in 2010, 56.07% in 2013, and 37.08% in 2018, although some years experienced declines such as -24.77% in 2017.",
      "• The livestock population in Zambia from 2017 to 2023 demonstrated growth across all categories: cattle increased from 3,714,667 in 2017 to 4,839,941 in 2023; sheep rose from 170,262 to 264,729; goats grew from 3,583,696 to 4,548,542; pigs increased from 1,082,765 to 1,167,807; and chickens fluctuated, peaking at 41,230,000 in 2021 before declining to 31,824,758 in 2023.",
      "• Livestock product outputs for 2018 and 2019 showed increases in all categories: milk production rose from 1,686,400 MT to 2,045,603 MT; egg production increased from 1,642,693,000 to 1,744,047,000 units; hides production grew from 345,549 MT to 369,357 MT; beef production increased from 6,103,281 MT to 6,763,045 MT; pork production rose from 555,270 MT to 595,472 MT; and poultry meat production increased from 5,111,098 MT to 5,537,874 MT.",
      "• In 2019, Zambia produced approximately 191,000 tons of beef, 50,000 tons of chicken meat, 34,000 tons of pork, and 453 million liters of cow's milk, reflecting the country's substantial livestock production capacity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:32.422128",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2231,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.10",
    "section_name": "Energy",
    "text": "Energy in Zambia is the production of energy and electricity, for consumption\nor export. The Energy Regulation Board (ERB) has the mandate to balance and\nsafeguard the interests of all energy stakeholders. The Energy policy is as\nguided by the Energy Regulation Act No. 12 of 2019, the Electricity Act No. 11\nof 2019 and the Rural Electrification Act No.20 of 2003.",
    "openai_summarised_points": [
      "• Energy in Zambia encompasses the production of energy and electricity intended for both domestic consumption and export purposes.",
      "• The Energy Regulation Board (ERB) is the authoritative body mandated to balance and safeguard the interests of all stakeholders involved in the energy sector in Zambia.",
      "• Zambia’s energy policy framework is governed by several key legislative acts, including the Energy Regulation Act No. 12 of 2019, which provides regulatory oversight for the energy sector.",
      "• The Electricity Act No. 11 of 2019 also guides the energy policy, specifically addressing issues related to electricity generation, distribution, and regulation.",
      "• The Rural Electrification Act No. 20 of 2003 is a significant legislative instrument aimed at promoting and facilitating the extension of electricity services to rural areas across Zambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:30.782254",
      "openai_model": "gpt-4.1-mini",
      "content_length": 365,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.10.1",
    "section_name": "Electricity",
    "text": "Electricity Generation in Zambia (2000-2021)  Year  | Total Generation (GWh)  | Hydropower (GWh)  | Coal Power (GWh)  | Solar Power (GWh)  | Oil (GWh)  | Other Renewables (bioelectricity) (GWh)\n---|---|---|---|---|---|---\n2000  | 7,760  | 7,670  | \\-  | \\-  | 70  | 20\n2001  | 7,900  | 7,810  | \\-  | \\-  | 70  | 20\n2002  | 8,110  | 8,020  | \\-  | \\-  | 80  | 10\n2003  | 8,260  | 8,170  | \\-  | \\-  | 80  | 10\n2004  | 8,460  | 8,380  | \\-  | \\-  | 70  | 10\n2005  | 8,880  | 8,790  | \\-  | \\-  | 80  | 10\n2006  | 9,660  | 9,570  | \\-  | \\-  | 80  | 10\n2007  | 9,600  | 9,530  | \\-  | \\-  | 60  | 10\n2008  | 9,490  | 9,430  | \\-  | \\-  | 40  | 20\n2009  | 9,860  | 9,780  | \\-  | \\-  | 50  | 30\n2010  | 10,410  | 10.330  | \\-  | \\-  | 50  | 30\n2011  | 11,450  | 11,370  | \\-  | \\-  | 50  | 30\n2012  | 12,310  | 12,230  | \\-  | \\-  | 50  | 30\n2013  | 13,230  | 13,150  | \\-  | \\-  | 50  | 30\n2014  | 14,350  | 13,900  | \\-  | \\-  | 340  | 110\n2015  | 14,000  | 12,910  |  290  | \\-  | 700  | 100\n2016  | 11,610  | 10,910  |  460  | \\-  | 180  | 60\n2017  | 14,320  | 12,370  | 1,140  | \\-  | 660  | 150\n2018  | 15,980  | 13,560  | 1,420  | \\-  | 820  | 180\n2019  | 16,010  | 13,670  | 1,300  | 120  | 750  | 170\n2020  | 15,980  | 13,670  | 1,270  | 150  | 730  | 160\n2021  | 17,584  |  |  |  |  |\n2022  | 19,399  |  |  |  |  |\nElectrical Energy Export Earnings  Month  | ZMW  | Month  | ZMW  | Month  | ZMW  | Month  | ZMW  | Month  | ZMW\n---|---|---|---|---|---|---|---|---|---\nJan-21  | 259,900,000  | Jan-22  | \\-  | Jan-23  | 590,300,000  | Jan-24  | 877,700,000  | Jan-25  | \\-\nFeb-21  | \\-  | Feb-22  | \\-  | Feb-23  | 551,600,000  | Feb-24  | 748,000,000  | Feb-25  | \\-\nMar-21  | 299,900,000  | Mar-22  | 299,900,000  | Mar-23  | 638.600,000  | Mar-24  | 802,600,000  | Mar-25  | 521,900,000\nApr-21  | 294,100,000  | Apr-22  | \\-  | Apr-23  | 600,400,000  | Apr-24  | 668,400,000  | Apr-25  | \\-\nMay-21  | 384,400,000  | May-22  | \\-  | May-23  | 622,800,000  | May-24  | 623,100,000  | May-25  |\nJun-21  | \\-  | Jun-22  | \\-  | Jun-23  | 587,700,000  | Jun-24  | 625,500,000  | Jun-25  |\nJul-21  | 210,600,000  | Jul-22  | \\-  | Jul-23  | 668.800,000  | Jul-24  | 538,200,000  | Jul-25  |\nAug-21  | 290,500,000  | Aug-22  | \\-  | Aug-23  | 698.400,000  | Aug-24  | 621,700,000  | Aug-25  |\nSep-21  | \\-  | Sep-22  | 696,800,000  | Sep-23  | 678,800,000  | Sep-24  | 502,400,000  | Sep-25  |\nOct-21  | \\-  | Oct-22  | 560,200,000  | Oct-23  | 664,000,000  | Oct-24  | 426,700,000  | Oct-25  |\nNov-21  | \\-  | Nov-22  | 642,100,000  | Nov-23  | 901,300,000  | Nov-24  | 444,200,000  | Nov-25  |\nDec-21  | 223,100,000  | Dec-22  | 583,900,000  | Dec-23  | 826,500,000  | Dec-24  | 396,200,000  | Dec-25  |\n\nIn 2019, Zambia generated a total of 15,013GWh of Energy. 12,427GWh was\nRenewable and 2,586 GWh was non-renewable. Over 99% of the Renewable energy\ncomponent was Hydro electricity.\n\nWith a view to diversifying the power generation profile, Zambia increased its\nSolar Power generation Capacity in 2019.\n\nIn March 2019, the 54MW Bangweulu Solar Power Station was commissioned.\n\nIn May 2019, the 34MW Ngonye Solar Power Station was commissioned.\n\nIn July 2022, the local National utility ZESCO, announced it had achieved an\nelectricity generation surplus of about 1,156 MW. Zambia's national generation\ncapacity stands at 3,456.8 MW versus a peak national demand of 2,300 MW. The\nsurplus power is to be directed to service the power supply agreements for the\nexport of 180 MW to Namibia and 100 MW to Zimbabwe. The exportation of 100MW\nelectricity to Zimbabwe which is set to commence in August 2022 is under a\nfive-year contract with a condition precedent that ZESCO earns monthly income\nof US$6.3 million prior exporting to Zimbabwe.\n\nThe close of 2022 brought in some serious challenges to the Zambian economy,\nwhen low water levels at the Kariba Dam significantly impacted the 1080MW\nKariba Hydro Power plant's output capacity and resulted in load shedding for\nbusinesses and residents across the country. This was compounded by the\nmaintenance that was being carried out at the 300MW Maamba Coilleries Coal\nFired Power Plant.\n\nIn January 2023, Zambia signed a US$2 billion dollar MOU and Joint Development\nAgreement (JDA) with the United Arab Emirates for the development of 2000MW of\nSolar Power Projects.\n\nIn April 2023, Zambia, through its state owned utility company ZESCO Limited,\nsigned a ZMW 67 Billion (US$3.4 Billion) Power Purchase Agreement with\nIntegrated Clean Energy Power Company of China to produce 2,400 Mega Watts of\nrenewable energy. Implementation of the project is expected to be done in a\nphased manner with the first phase producing 600MW of solar energy distributed\nas one 300MW power plant in Central Province and another 300MW Power plant in\nSouthern Province. The two 300MW solar power plants of phase one are expected\nto be connected to the National Grid by the end of 2024.",
    "openai_summarised_points": [
      "• Between 2000 and 2020, Zambia's total electricity generation increased from 7,760 GWh to approximately 15,980 GWh, with hydropower consistently constituting the majority of the energy mix, ranging from 7,670 GWh in 2000 to 13,670 GWh in 2020.",
      "• Hydropower accounted for over 99% of Zambia's renewable energy generation in 2019, when the country produced a total of 15,013 GWh of electricity, of which 12,427 GWh was renewable and 2,586 GWh was non-renewable.",
      "• Coal power generation began to appear in Zambia's energy mix from 2015 onwards, starting at 290 GWh and increasing to a peak of 1,420 GWh in 2018 before slightly declining to 1,270 GWh in 2020.",
      "• Solar power generation commenced in 2019 with 120 GWh and increased to 150 GWh by 2020, reflecting Zambia's efforts to diversify its power generation portfolio.",
      "• The oil-based electricity generation fluctuated over the years, with a notable increase to 700 GWh in 2015, followed by a decline to around 730 GWh in 2020.",
      "• Other renewables, specifically bioelectricity, contributed modestly to the electricity generation, ranging between 10 GWh and 180 GWh from 2000 to 2020.",
      "• In March 2019, Zambia commissioned the 54 MW Bangweulu Solar Power Station, followed by the 34 MW Ngonye Solar Power Station in May 2019, marking significant milestones in the expansion of solar energy capacity.",
      "• By July 2022, Zambia's national electricity generation capacity reached 3,456.8 MW, surpassing the peak national demand of 2,300 MW, resulting in a surplus of approximately 1,156 MW.",
      "• The surplus electricity generated in 2022 was allocated to fulfill power supply agreements, including the export of 180 MW to Namibia and 100 MW to Zimbabwe, with the latter under a five-year contract requiring ZESCO to earn a monthly income of US$6.3 million prior to export commencement in August 2022.",
      "• At the end of 2022, Zambia faced significant electricity supply challenges due to low water levels at the Kariba Dam, which adversely affected the 1,080 MW Kariba Hydropower Plant's output, leading to load shedding nationwide.",
      "• These challenges were exacerbated by maintenance activities at the 300 MW Maamba Collieries Coal Fired Power Plant, further constraining electricity supply.",
      "• In January 2023, Zambia signed a Memorandum of Understanding (MOU) and Joint Development Agreement (JDA) valued at US$2 billion with the United Arab Emirates to develop 2,000 MW of solar power projects, signaling a major investment in renewable energy infrastructure.",
      "• In April 2023, ZESCO Limited, Zambia's state-owned utility, entered into a Power Purchase Agreement worth ZMW 67 billion (US$3.4 billion) with Integrated Clean Energy Power Company of China to develop 2,400 MW of renewable energy.",
      "• The renewable energy project with the Chinese company is planned to be implemented in phases, with the first phase consisting of two 300 MW solar power plants located in Central Province and Southern Province, respectively, both expected to be connected to the national grid by the end of 2024.",
      "• Zambia's electrical energy export earnings have shown substantial growth from 2021 through 2025, with monthly earnings reaching up to ZMW 901.3 million in November 2023 and continuing strong performance into 2024 and 2025, reflecting increased regional electricity trade.",
      "• The electricity export data indicates variable monthly revenues, with some months in 2022 and 2025 showing no recorded earnings, while other months consistently generated hundreds of millions of Zambian Kwacha, underscoring the fluctuating but growing importance of electricity exports to Zambia's economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:50.660620",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4912,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.10.2",
    "section_name": "Petroleum",
    "text": "Zambia is a net importer of petroleum and in 2019, Oil & Mineral Fuels ranked\ntop amongst the country's trade imports at a value of U$1.26 billion.\n\nIn January 2022, the ERB migrated from a Quarterly pricing cycle to a monthly\npricing cycle to enable the local price of fuel to be more responsive to the\nmarket fundamentals namely: international oil prices and the Kwacha/US Dollar\nexchange rate prevailing in the month preceding the pricing decision. Further,\nfollowing the UPND governments' policy decision to place INDENI Petroleum\nRefinery on care and maintenance, the nation moved to one type of Diesel sold\non the market, and that is the imported Low Sulphur Gasoil/Diesel.\n\nMonthly Pricing Cycle Trend (in ZMW)  Date Revised  | Petrol  | Low Sulphur Diesel  | Source  |  | Date Revised  | Petrol  | Low Sulphur Diesel  | Source  |  | Date Revised  | Petrol  | Low Sulphur Diesel  | Source  | Date Revised  | Petrol  | Low Sulphur Diesel  | Source\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n16 December 2021  | 21.16*  | 22.29*  |  |  | 31 December 2022  | 24.49  | 26.44  |  |  | 1 January 2024  | 29.98  | 29.96  |  | 31 December 2024  | 34.67  | 32.43  |\n31 January 2022  | 19.84  | 18.93  |  |  | 31 January 2023  | 27.22  | 29.25  |  |  | 1 February 2024  | 29.98  | 29.96  |  | 31 January 2025  | 34.98  | 34.98  |\n28 February 2022  | 21.96  | 21.54  |  |  | 1 March 2023  | 28.52  | 29.25  |  |  | 28 February 2024  | 34.19  | 32.15  |  | 28 February 2025  | 34.98  | 32.54  |\n31 March 2022  | 26.50  | 26.22  |  |  | 31 March 2023  | 27.59  | 26.28  |  |  | 31 March 2024  | 31.12  | 28.78  |  | 31 March 2025  | 34.98  | 30.23  |\n30 April 2022  | 24.15  | 25.64  |  |  | 30 April 2022  | 27.59  | 24.64  |  |  | 30 April 2024  | 35.56  | 29.60  |  | 30 April 2025  | 32.14  | 27.38  |\n31 May 2022  | 24.95  | 25.64  |  |  | 31 May 2023  | 24.45  | 21.87  |  |  | 31 May 2024  | 35.56  | 31.11  |  | 31 May 2025  | 31.36  | 25.12  |\n30 June 2022  | 26.75  | 28.01  |  |  | 30 June 2023  | 24.93  | 21.87  |  |  | 30 June 2024  | 31.58  | 29,34  |  |  |  |  |\n31 July 2022  | 23.19  | 24.87  |  |  | 31 July 2023  | 25.57  | 23.36  |  |  | 31 July 2024  | 33.47  | 30.05  |  |  |  |  |\n31 August 2022  | 21.54  | 23.12  |  |  | 31 August 2023  | 29.42  | 26.88  |  |  | 31 August 2024  | 33.47  | 30.05  |  |  |  |  |\n30 September 2022  | 22.74  | 26.16  | **  |  | 30 September 2023  | 29.98  | 29.96  |  |  | 30 September 2024  | 32.70  | 28.90  |  |  |  |  |\n31 October 2022  | 24.31  | 27.38  |  |  | 31 October 2023  | 29.98  | 29.96  |  |  | 31 October 2024  | 32.70  | 30.11  |  |  |  |  |\n1 December 2022  | 25.89  | 27.38  |  |  | 1 December 2023  | 29.98  | 29.96  |  |  | 30 November 2024  | 33.67  | 32.43  |  |  |  |  |\n\n*Final rate on quarterly price cycle.\n\n**Excise Duty and VAT Restored.\n\nBulk Fuel Depots in Zambia are listed below:\n\nBulk Fuel Depots  Location  | Capacity (million litres)  | Cost US $ (ZMW Annual Average Spot Conversion)  | Commissioned  | Source\n---|---|---|---|---\nChipata | 7.0  | US$40.0 million (ZMW 692.0 million)  | 2022  |\nLusaka | 25.0  | US$24.7 million (ZMW 132.0 million)  | 2013  |\nMansa | 6.5  |  | 2021  |\nMongu | 6.5  | US$27.4 million (ZMW 282.0 million)  | 2016  |\nMpika | 6.5  | US$8.1 million (ZMW 50.0 million)  | 2014  |\nNdola | 110  | N/A  | 1973  |\nSolwezi | 15.5  | US$7.0 million (ZMW 60.5 million)  | 2015  |\n**Total** | **177** |  |  |\nOil and Gas Pipelines (Existing and Planned Projects)  | Length  | JV Partners  | Project Construction Start  | Project Completion  | Cost  | Source  | Note(s)\n---|---|---|---|---|---|---|---\nTazama Pipeline | 1,710 km  |\n\n* Government of Zambia 66.70%\n* Government of Tanzania 33.30%\n\n| 1966 (January)  | 1968  | See Notes  |  |\n\n* 54 Years Old as of 2022.\n* Runs from the port of Dar-es-Salaam, Tanzania, to the Indeni Energy Company in Ndola, Zambia.\n* Funded by Mediobanca. In 1967, Zambia and Italy credited the consortium GBP 11,070,000.00 and Tanzania and Italy credited the consortium GBP 5,542,407.00. Terms 6% paid in 15 equal annual installments paid from earnings.\n\n\nNamibia-Zambia Multi-Product Petroleum and Natural Gas Pipelines Project (NAZOP)  | TBA  |\n\n* Government of Zambia\n* Government of Namibia\n\n| TBA  | TBA  | TBA  |  |\n\n* In October 2022, Zambia and Namibia signed a memorandum of understanding (MoU) to build an oil and gas pipeline connecting the two countries.\n* The MoU set the intention of the two Governments to support and facilitate the implementation of the private sector-led Namibia- Zambia Multi–Product Petroleum and Natural Gas Pipelines Project (NAZOP) that is envisioned to supply 100,000 to 120,000 barrels per day.\n\n\nLobito–Lusaka Oil Products Pipeline | 1,400 km  |\n\n* Sonangol\n* IDC Zambia Limited\n* Strategic Investor(s)\n\n| TBA  | Expected 2026  | US$5.0 billion  |  |\n\n* Feasibility assessments are a work in progress\n\n\n\n_See also_ : Tazama Pipeline, Indeni Petroleum Refinery and Lobito–Lusaka Oil\nProducts Pipeline.\n\nIn January 2023, Zambia announced plans to acquire a stake in its neighbor\nAngola's Lobito Oil Refinery located in Benguela Province along the Atlantic\nCoast. The Lobito refinery, that is set to be completed in 2026, will have the\ncapacity to produce 200,000 barrels per day. Under the current proposal,\nprivate investors, including Zambia, will own 70% shares in the refinery,\nwhile Angola's state oil firm, Sonangol Group, will hold 30% ownership.\n\nIn September 2023, TAZAMA began constructing a 3 km pipeline to tie the Tazama\nPipeline to the 6.5 million litre Mpika fuel storage depot at a cost of ZMW\n31.26 million kwacha (US$1.5 million). When commissioned the pipeline is\nplanned to divert a portion of the low sulfur diesel imported via the pipeline\nto the storage depot to service the Northern circuit of Zambia with long term\nbenefits of lower fuel costs in the region. This tie-in pipeline is the first\nof a planned network of distribution pipelines to the other fuel storage\ndepots in Zambia.",
    "openai_summarised_points": [
      "• Zambia is a net importer of petroleum, with Oil & Mineral Fuels ranking as the top import category in 2019, valued at US$1.26 billion.",
      "• In January 2022, the Energy Regulation Board (ERB) of Zambia transitioned from a quarterly to a monthly fuel pricing cycle to enhance responsiveness to market fundamentals, specifically international oil prices and the Kwacha/US Dollar exchange rate from the preceding month.",
      "• Following a policy decision by the United Party for National Development (UPND) government to place the Indeni Petroleum Refinery on care and maintenance, Zambia now sells only one type of diesel on the market: imported Low Sulphur Gasoil/Diesel.",
      "• Fuel price trends in Zambian Kwacha (ZMW) from December 2021 through early 2025 show fluctuations in petrol and low sulphur diesel prices, with petrol prices ranging from ZMW 19.84 (January 2022) to projected ZMW 34.98 (January 2025), and low sulphur diesel prices ranging from ZMW 18.93 (January 2022) to projected ZMW 34.98 (January 2025).",
      "• Notable pricing events include the restoration of Excise Duty and VAT in September 2022 and the final quarterly price cycle rates on 16 December 2021, when petrol was ZMW 21.16 and diesel ZMW 22.29.",
      "• Zambia’s bulk fuel depots have varying capacities and commissioning dates: Chipata (7.0 million litres, US$40 million, commissioned 2022), Lusaka (25.0 million litres, US$24.7 million, 2013), Mansa (6.5 million litres, 2021), Mongu (6.5 million litres, US$27.4 million, 2016), Mpika (6.5 million litres, US$8.1 million, 2014), Ndola (110 million litres, commissioned 1973), and Solwezi (15.5 million litres, US$7.0 million, 2015), totaling 177 million litres capacity.",
      "• The Tazama Pipeline, 1,710 km long, is a joint venture between the Government of Zambia (66.7%) and the Government of Tanzania (33.3%), constructed starting January 1966 and completed in 1968; it transports petroleum from the port of Dar-es-Salaam, Tanzania, to the Indeni Energy Company in Ndola, Zambia.",
      "• The Tazama Pipeline was funded by Mediobanca, with Zambia and Italy crediting GBP 11,070,000 and Tanzania and Italy crediting GBP 5,542,407 in 1967 at 6% interest, repayable in 15 equal annual installments from earnings; as of 2022, the pipeline is 54 years old.",
      "• The Namibia-Zambia Multi-Product Petroleum and Natural Gas Pipelines Project (NAZOP) is a planned pipeline with details to be announced; in October 2022, Zambia and Namibia signed a memorandum of understanding (MoU) to support and facilitate this private sector-led project, which aims to supply 100,000 to 120,000 barrels per day.",
      "• The Lobito–Lusaka Oil Products Pipeline is a planned 1,400 km pipeline involving Sonangol, IDC Zambia Limited, and strategic investors, with feasibility assessments ongoing; construction is expected to be completed by 2026 at an estimated cost of US$5.0 billion.",
      "• In January 2023, Zambia announced intentions to acquire a stake in Angola’s Lobito Oil Refinery in Benguela Province, which is expected to be completed in 2026 with a production capacity of 200,000 barrels per day; private investors, including Zambia, are proposed to hold 70% ownership, while Angola’s state oil firm Sonangol Group will retain 30%.",
      "• In September 2023, TAZAMA commenced construction of a 3 km pipeline linking the Tazama Pipeline to the Mpika fuel storage depot (6.5 million litres capacity) at a cost of ZMW 31.26 million (US$1.5 million); this pipeline aims to divert a portion of imported low sulphur diesel to serve the Northern circuit of Zambia, reducing fuel costs long-term.",
      "• The Mpika tie-in pipeline is the first phase of a planned network of distribution pipelines intended to connect other fuel storage depots across Zambia, enhancing fuel distribution efficiency nationwide."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:50.659974",
      "openai_model": "gpt-4.1-mini",
      "content_length": 6014,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.11",
    "section_name": "Tourism",
    "text": "Zambia's tourism revenue has been generally raised from local and\ninternational tourists visiting the Victoria Falls in Livingstone, and its\nassociated attractions such as the Livingstone Museum and the Mosi-oa-Tunya\nNational Park. In July 2020, the Livingstone Tourism Association reported that\nduring the Heroes and Unity holidays the holiday site received a record number\nof visitors. Celebrities such as Will Smith and some Entrepreneur[_who?_] have\nvisited the tourist site with the latter celebrating her £3 million nuptials\nin a picturesque ceremony at The Royal Livingstone Hotel by the banks of the\nZambezi River.\n\nTo advance home grown tourism, in March 2021, African Eagle Hotels, a multi-\nnational company, stated that a 2 Star and 5 Star Hotel each costing U$20\nmillion and U$30 million would be constructed and opened at the Kasaba Bay\nResort located in the Nsumbu National Park and open by 2023. In October 2021,\nthrough its national budget, the government also allocated ZMW 150 million\n(U$8.6 million) to further the development of Kasaba Bay, to spur tourism in\nthe Northern Circuit of Zambia.\n\nTourism Statistics 1995–2020  Year  | Number of Tourists | % Growth of Tourists  | Receipts ('000 US$)  | % of GNP\n---|---|---|---|---\n1995  | 163,000  |  | \\--  | \\--\n1996  | 264,000  | 62.0%  | \\--  | \\--\n1997  | 341,000  | 29.2%  | 29,000  | 0.67%\n1998  | 362,000  |  6.2%  | 40,000  | 1.1%\n1999  | 404,000  | 11.6%  | 53,000  | 1.6%\n2000  | 457,000  | 13.1%  | 67,000  | 1.9%\n2001  | 492,000  |  7.6%  | 80,000  | 2.0%\n2002  | 565,000  | 14.8%  | 64,000  | 1.5%\n2003  | 413,000  | -26.9%  | 88,000  | 1.8%\n2004  | 515,000  | 24.7%  | 92,000  | 1.5%\n2005  | 669,000  | 29.9%  | 447,000  | 5.4%\n2006  | 757,000  | 13.2%  | 506,000  | 4.0%\n2007  | 897,000  | 18.5%  | 599,000  | 4.3%\n2008  | 812,000  |  -9.5%  | 542,000  | 3.0%\n2009  | 710,000  | -12.6%  | 474,000  | 3.1%\n2010  | 815,000  | 14.8%  | 492,000  | 2.4%\n2011  | 920,000  | 12.9%  | 555,000  | 2.4%\n2012  | 859,000  |  -6.6%  | 518,000  | 2.0%\n2013  | 915,000  |  6.5%  | 552,000  | 2.0%\n2014  | 947,000  |  3.5%  | 642,000  | 2.4%\n2015  | 932,000  |  -1.6%  | 660,000  | 3.1%\n2016  | 956,000  |  2.6%  | 683,000  | 3.3%\n2017  | 1,010,000  |  5.6%  | 653,000  | 2.5%\n2018  | 1,070,000  |  5.9%  | 742,000  | 2.8%\n2019  | 1,270,000  | 18.7%  | 820,000  | 3.5%\n2020  | 502,000  | -60.5%  | N/A  | N/A\n2021  | 554,200  |  -0.4%  | N/A  | N/A\n2022  | 1,060,788  | 91.4%  | N/A  | N/A",
    "openai_summarised_points": [
      "• Zambia's tourism revenue is primarily generated from both local and international tourists visiting Victoria Falls in Livingstone, along with associated attractions such as the Livingstone Museum and Mosi-oa-Tunya National Park.",
      "• In July 2020, the Livingstone Tourism Association reported a record number of visitors during the Heroes and Unity holidays, indicating a peak in tourism activity at that time.",
      "• Notable celebrities, including Will Smith, have visited the Victoria Falls tourist site; additionally, an entrepreneur celebrated her £3 million wedding at The Royal Livingstone Hotel, located on the banks of the Zambezi River.",
      "• To promote domestic tourism growth, in March 2021, African Eagle Hotels, a multinational company, announced plans to construct two hotels at Kasaba Bay Resort in Nsumbu National Park: a 2-star hotel costing US$20 million and a 5-star hotel costing US$30 million, both scheduled to open by 2023.",
      "• In October 2021, the Zambian government allocated ZMW 150 million (equivalent to US$8.6 million) in its national budget to further develop Kasaba Bay, aiming to stimulate tourism within Zambia's Northern Circuit.",
      "• Tourism statistics from 1995 to 2020 show fluctuating numbers of tourists, growth rates, tourism receipts in thousands of US dollars, and tourism's percentage contribution to Zambia's Gross National Product (GNP).",
      "• In 1995, Zambia received 163,000 tourists, with no available data on receipts or GNP percentage.",
      "• Tourist arrivals increased by 62.0% in 1996 to 264,000 visitors, though receipts and GNP percentages were not reported.",
      "• By 1997, tourist numbers reached 341,000 (29.2% growth), generating US$29,000,000 in receipts and contributing 0.67% to GNP.",
      "• From 1998 to 2001, tourist numbers steadily increased from 362,000 to 492,000, with receipts rising from US$40,000,000 to US$80,000,000 and GNP contribution growing from 1.1% to 2.0%.",
      "• In 2002, tourists numbered 565,000 (14.8% growth), but receipts dropped to US$64,000,000 and GNP contribution fell to 1.5%.",
      "• A sharp decline occurred in 2003, with tourists decreasing by 26.9% to 413,000, though receipts increased to US$88,000,000 and GNP contribution was 1.8%.",
      "• The years 2004 to 2007 saw strong growth in tourists from 515,000 to 897,000, with receipts rising significantly from US$92,000,000 to US$599,000,000 and GNP contribution fluctuating between 1.5% and 5.4%.",
      "• In 2005, tourism receipts notably surged to US$447,000,000, representing 5.4% of GNP, coinciding with a 29.9% increase in tourists to 669,000.",
      "• Tourist numbers declined in 2008 and 2009 by 9.5% and 12.6% respectively, with receipts decreasing to US$542,000,000 and US$474,000,000, and GNP contributions falling to around 3.0% and 3.1%.",
      "• Recovery occurred from 2010 to 2011, with tourists increasing to 920,000 and receipts reaching US$555,000,000, maintaining a 2.4% GNP share.",
      "• Between 2012 and 2015, tourist arrivals fluctuated between 859,000 and 932,000, receipts ranged from US$518,000,000 to US$660,000,000, and GNP contribution varied from 2.0% to 3.1%.",
      "• From 2016 to 2019, tourist numbers grew steadily from 956,000 to 1,270,000, with receipts increasing from US$683,000,000 to US$820,000,000 and GNP contribution rising from 2.5% to 3.5%.",
      "• The year 2020 saw a dramatic decline in tourists by 60.5% to 502,000 due to unspecified factors, with no available data on receipts or GNP contribution.",
      "• In 2021, tourist numbers slightly decreased by 0.4% to 554,200, with receipts and GNP data not available.",
      "• By 2022, tourism rebounded strongly with a 91.4% increase to 1,060,788 tourists, though financial and GNP data remain unavailable."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:48.704237",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2456,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.12",
    "section_name": "Manufacturing",
    "text": "Manufacturing GDP at Current Prices (ZMW' million) 2020 Q1- 2024 Q4  Quarter  | Q1  | Q2  | Q3  | Q4\n---|---|---|---|---\n2020  | 5,293  | 5,556  | 7,179  | 7,605\n2021  | 9,200  | 11,654  | 10,717  | 10,211\n2022  | 10,677  | 9,463  | 9,600  | 11,019\n2023  | 10,814  | 9,918  | 12,892  | 13,734\n2024  | 13,849  | 15,131  | 17,220  | 17,753\nCompanies that Manufacture in Zambia  Company Name  | Product(s)  | Source\n---|---|---\nAfrican Explosives Zambia | Explosives |\nAirumi New Energy Zambia  | Car Batteries and Storage Batteries |\nBayer Seed Itaba Plant  | Maize Seed |\nChilanga Cement | Cement |\nDangote Cement | Cement |\nHitachi Construction Machinery Zambia (HCMZ) | Heavy Construction & Mining Equipment |\nKafue Steel Plant | Steel |\nKalene Hills Fruit Factory | Fruit Processing  |\nKawambwa Tea Industries Limited  | Tea |\nLarfarge | Cement |\nMetal Fabricators of Zambia (ZAMEFA)  | Electric Power Cables |\nMpande Limestone  | Limestone |\nMununshi Fruit Company Limited (MFCL)  | Bananas |\nNaipu Mining Machinery (Zambia) Company Limited  | Mining Equipment |\nNdola Lime Company Limited (NLC)  | Limestone |\nNitrogen Chemicals Of Zambia (NCZ)  | Fertilizers |\nNorthern Coffee Company Limited (NCCL)  | Coffee |\nPowerful Diligent Veracious (PDV) Metal Steel  | Steel |\nProton Electro Cables Zambia  | Building Wire & Electric Cables |\nSunbird Energy  | Cassava Ethanol |\nTrade Kings Zambia Limited  | FMCG, Steel |\nUniflex Wires and Cables Ltd  | Electric Cables |\nUnited Capital Fertilizer (UCF) Zambia Limited  | Fertilizers |\nZambeef Products | Meat, dairy, eggs, animal feed, leather |\nZambian Breweries | Alcoholic Beverages |\nZambia Forestry and Forest Industries Corporation Plc (ZAFFICO)  | Wood and Wood & Paper Products  |\nZambia Sugar Plc | Sugar and Molasses ethanol |\nZambia National Service (ZNS) Chingola Milling Plant  | Mealie Meal | 3\n\nBelow is a table for the Composite Purchasing Managers' Index (PMI)\nManufacturing Pulse in Zambia. 50 sets the benchmark, for expansion ->50 and\nexpansion -<50\\.\n\nComposite Purchasing Managers' Index (PMI)  Month / Year  | Jan  | Feb  | Mar  | Apr  | May  | Jun  | Jul  | Aug  | Sep  | Oct  | Nov  | Dec  | Source\n---|---|---|---|---|---|---|---|---|---|---|---|---|---\n2021  | 47.70  | 47.10  | 49.70  | 50.10  | 49.70  | 49.30  | 49.80  | 49.80  | 50.30  | 51.20  | 51.80  | 51.50  |\n2022  | 49.90  | 50.30  | 49.60  | 50.50  | 49.80  | 49.90  | 50.50  | 50.00  | 50.50  | 49.00  | 49.10  | 48.30  |\n2023  | 50.60  | 51.30  | 46.90  | 48.70  | 51.40  | 51.20  | 51.00  | 49.20  | 48.10  | 50.60  | 50.10  | 49.60  |\n2024  | 49.20  | 47.30  | 48.80  | 47.70  | 49.40  | 47.90  | 49.40  | 48.30  | 45.60  | 47.90  | 49.2  | 50.80  |\n2025  | 50.90  | 50.90  | 49.30  | 50.90  | 51.40  |  |  |  |  |  |  |  |\nAnnual Cement Production  Year  | Production (MT)\n---|---\n2020  |  2,127,832\n2021  |  2,732,013\n2022  |  2,369,193\n2023  |  2,740,288\n2024  |  3,265,299",
    "openai_summarised_points": [
      "• The manufacturing Gross Domestic Product (GDP) at current prices in Zambia showed a general upward trend from 2020 to 2024, with quarterly values measured in Zambian Kwacha (ZMW) million as follows: in 2020, Q1 was 5,293, Q2 was 5,556, Q3 was 7,179, and Q4 was 7,605; in 2021, Q1 was 9,200, Q2 was 11,654, Q3 was 10,717, and Q4 was 10,211; in 2022, Q1 was 10,677, Q2 was 9,463, Q3 was 9,600, and Q4 was 11,019; in 2023, Q1 was 10,814, Q2 was 9,918, Q3 was 12,892, and Q4 was 13,734; and in 2024, Q1 was 13,849, Q2 was 15,131, Q3 was 17,220, and Q4 was 17,753.",
      "• Key manufacturing companies operating in Zambia include African Explosives Zambia, producing explosives; Airumi New Energy Zambia, manufacturing car batteries and storage batteries; and Bayer Seed Itaba Plant, specializing in maize seed production.",
      "• Cement production is dominated by several companies such as Chilanga Cement, Dangote Cement, and Larfarge, all significant contributors to the sector.",
      "• Heavy construction and mining equipment are produced by Hitachi Construction Machinery Zambia (HCMZ), while steel manufacturing is undertaken by Kafue Steel Plant and Powerful Diligent Veracious (PDV) Metal Steel.",
      "• The food processing sector includes Kalene Hills Fruit Factory (fruit processing), Kawambwa Tea Industries Limited (tea), Mununshi Fruit Company Limited (MFCL) (bananas), Northern Coffee Company Limited (NCCL) (coffee), Zambeef Products (meat, dairy, eggs, animal feed, leather), Zambia Sugar Plc (sugar and molasses ethanol), and Zambia National Service (ZNS) Chingola Milling Plant (mealie meal).",
      "• Other manufacturing activities include Metal Fabricators of Zambia (ZAMEFA) producing electric power cables; Mpande Limestone and Ndola Lime Company Limited (NLC) producing limestone; Naipu Mining Machinery (Zambia) Company Limited manufacturing mining equipment; Nitrogen Chemicals Of Zambia (NCZ) and United Capital Fertilizer (UCF) Zambia Limited producing fertilizers.",
      "• Additional companies include Proton Electro Cables Zambia and Uniflex Wires and Cables Ltd, both producing electric cables; Sunbird Energy producing cassava ethanol; Trade Kings Zambia Limited manufacturing fast-moving consumer goods (FMCG) and steel; Zambian Breweries producing alcoholic beverages; and Zambia Forestry and Forest Industries Corporation Plc (ZAFFICO) producing wood and wood & paper products.",
      "• The Composite Purchasing Managers' Index (PMI) for Zambia’s manufacturing sector, where a value above 50 indicates expansion and below 50 indicates contraction, fluctuated between 2021 and 2025: in 2021, the PMI ranged from 47.10 in February to 51.80 in November; in 2022, it varied between 48.30 in December and 50.50 in April and July; in 2023, values ranged from a low of 46.90 in March to a high of 51.40 in May; in 2024, the PMI mostly remained below 50, ranging from 45.60 in September to 50.80 in December; and in early 2025, the PMI showed slight recovery with values of 50.90 in January, February, and April, and 51.40 in May.",
      "• Annual cement production in Zambia demonstrated growth from 2020 to 2024, with production figures in metric tonnes (MT) as follows: 2,127,832 MT in 2020; 2,732,013 MT in 2021; 2,369,193 MT in 2022; 2,740,288 MT in 2023; and 3,265,299 MT in 2024, indicating an overall increasing trend in cement manufacturing output."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:47.072616",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2918,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.13",
    "section_name": "Education",
    "text": "As of 2022, Zambia runs a free education policy at public early childhood and\nsecondary schools.\n\n* Education in Zambia\n* List of schools in Zambia\n* List of universities in Zambia",
    "openai_summarised_points": [
      "• As of 2022, Zambia implements a free education policy specifically targeting public early childhood and secondary schools, ensuring that education at these levels is accessible without direct tuition fees.",
      "• The education system in Zambia encompasses various institutions, including early childhood centers, primary and secondary schools, as well as higher education establishments such as universities.",
      "• Comprehensive information about the educational infrastructure in Zambia can be found in resources such as the \"Education in Zambia\" overview, which details the structure, policies, and challenges of the Zambian education sector.",
      "• Detailed listings of educational institutions are available, including the \"List of schools in Zambia,\" which catalogs primary and secondary schools across the country.",
      "• Higher education institutions are documented in the \"List of universities in Zambia,\" providing a directory of universities offering tertiary education and contributing to the nation's academic and professional development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:46.443568",
      "openai_model": "gpt-4.1-mini",
      "content_length": 180,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.14",
    "section_name": "Finance and Banking Services",
    "text": "* Central Bank: Bank of Zambia (BOZ)\n* List of banks in Zambia\n\nMonetary Policy(Tightening: Red. Easing: Green)  Date  | Policy Rate  | Monetary Policy Committee Statement\n---|---|---\n5 November 2015  | 15.50%  | Policy Rate adjusted upward by 300 basis points to 15.50%\n19 February 2016  | 15.50%  | Policy Rate maintained at 15.50%\n20 May 2016  | 15.50%  | Policy Rate maintained at 15.50%\n19 August 2016  | 15.50%  | Policy Rate maintained at 15.50%\n16 November 2016  | 15.50%  | Policy Rate maintained at 15.50%\n22 February 2017  | 14.00%  | Policy Rate Reduced by 150 basis points 14.00%, the Overnight Lending Facility (PLF) Rate reduced to 600 basis points above the Policy Rate, and the Statutory Reserve Ratio reduced by 250 basis points to 15.50%\n17 May 2017  | 12.50%  | Policy Rate Reduced by 150 basis points 12.50%\n10 August 2017  | 11.00%  | Policy Rate lowered to 11.00% and Statutory Reserve Ratio reduced to 9.50%\n22 November 2017  | 10.25%  | Policy Rate lowered to 10.25% and Statutory Reserve Ratio reduced to 8.00%\n16 February 2018  | 9.75%  | Policy Rate cut by 50 Basis Points to 9.75%\n16 May 2018  | 9.75%  | Policy Rate maintained at 9.75%\n22 August 2018  | 9.75%  | Policy Rate maintained at 9.75%\n21 November 2018  | 9.75%  | Policy Rate maintained at 9.75%\n20 February 2019  | 9.75%  | Policy Rate maintained at 9.75%\n22 May 2019  | 10.25%  | Policy Rate adjusted upwards by 50 basis points to 10.25%\n21 August 2019  | 10.25%  | Policy Rate maintained at 10.25%\n20 November 2019  | 11.50%  | Policy Rate adjusted upward by 125 basis points to 11.50%\n19 February 2020  | 11.50%  | Policy Rate maintained at 11.25%\n20 May 2020  | 9.25%  | Policy Rate cut by 225 Basis Points to 9.25%\n19 August 2020  | 8.00%  | Policy Rate cut by a further 125 Basis Points to 8.00%\n18 November 2020  | 8.00%  | Policy Rate held at 8.0%\n17 February 2021  | 8.50%  | Policy Rate adjusted upwards by 50 basis points to 8.50%\n19 May 2021  | 8.50%  | Policy Rate held at 8.50%\n1 September 2021  | 8.50%  | Policy Rate held at 8.50%\n24 November 2021  | 9.00%  | Policy Rate adjusted upwards by 50 basis points to 9.00%\n17 February 2022  | 9.00%  | Policy Rate maintained at 9.00%\n18 May 2022  | 9.00%  | Policy Rate maintained at 9.00%\n17 August 2022  | 9.00%  | Policy Rate maintained at 9.00%\n23 November 2022  | 9.00%  | Policy Rate maintained at 9.00%\n15 February 2023  | 9.25%  | Policy Rate adjusted upwards by 25 basis points to 9.25% On 2 February the Statutory Reserve Ratiowas increased to 11.50% from 9.00%\n17 May 2023  | 9.50%  | Policy Rate adjusted upwards by 25 basis points to 9.50%\n23 August 2023  | 10.00%  | Policy Rate adjusted upwards by 50 basis points to 10.00%\n22 November 2023  | 11.00%  | On 6 November the Statutory Reserve Ratio was increased by 300 basis points to 14.50% Policy Rate adjusted upwards by 100 basis points to 11.00% On 27 November the Statutory Reserve Ratio was increased by 250 basis points to 17.00%\n14 February 2024  | 12.50%  | On 2 February the Statutory Reserve Ratio was increased by 900 basis points to 26.00%Policy Rate raised by 150 basis points.\n15 May 2024  | 13.50%  | Policy Rate raised by 100 basis points.\n14 August 2024  | 13.50%  | Policy Rate maintained at 13.50%\n13 November 2024  | 14.00%  | Policy Rate adjusted upwards by 50 basis points to 14.00%\n12 February 2025  | 14.50%  | Policy Rate raised by 50 basis points.\n23 May 2025  | 14.50%  | Policy Rate held at 14.50%\n\nBOZ purchases gold locally from Kansanshi Copper Mine and the Zambia Gold\nCompany for its reserves.\n\nYear  | Cummulative Gold Reserves US$  | Source  | Notes  | Cumulative refined gold reserves (kg)\n---|---|---|---|---\n2021  | 43,000,000  |  |  |\n2022  | 83,000,000  |  | target for 2022 is US$100 million in Gold  | 1,438 kilograms\n2024  | 190,000,000 (≈ ZMW 3.7 bn)  |  |  | Approx. 2,469.17 kg\n2025  | 233,500,000 (≈ ZMW 6.3 bn)  |  |  | Approx. 2,163.26 kg\nCommercial Banks’ Average Lending Rates  Year  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022\n---|---|---|---|---|---|---|---\nRate  | 29.20%  | 24.90%  | 23.60%  | 25.63%  | 26.57%  | 25.90%  | 25.22%\nSource  |  |  |  |  |  |  |",
    "openai_summarised_points": [
      "• The central bank of Zambia is the Bank of Zambia (BOZ), which oversees the country's monetary policy and banking regulations.",
      "• The Bank of Zambia implements monetary policy primarily through adjustments to the policy rate and statutory reserve ratio, with detailed records of changes from November 2015 to May 2025.",
      "• On 5 November 2015, the policy rate was increased by 300 basis points to 15.50%, marking a tightening phase in monetary policy.",
      "• From 19 February 2016 through 16 November 2016, the policy rate was maintained steadily at 15.50%.",
      "• On 22 February 2017, the policy rate was reduced by 150 basis points to 14.00%, the Overnight Lending Facility (PLF) rate was set to 600 basis points above the policy rate, and the statutory reserve ratio was decreased by 250 basis points to 15.50%, indicating an easing of monetary policy.",
      "• Subsequent reductions in the policy rate occurred on 17 May 2017 (to 12.50%), 10 August 2017 (to 11.00%), and 22 November 2017 (to 10.25%), with corresponding reductions in the statutory reserve ratio to 9.50% and then 8.00%.",
      "• The policy rate was further cut by 50 basis points to 9.75% on 16 February 2018 and maintained at this level through 20 February 2019.",
      "• On 22 May 2019, the policy rate was increased by 50 basis points to 10.25%, maintained on 21 August 2019, and then raised by 125 basis points to 11.50% on 20 November 2019.",
      "• The policy rate was held at 11.25% on 19 February 2020, then cut by 225 basis points to 9.25% on 20 May 2020, followed by a further cut of 125 basis points to 8.00% on 19 August 2020, remaining at 8.00% through 18 November 2020.",
      "• On 17 February 2021, the policy rate was increased by 50 basis points to 8.50%, maintained through 1 September 2021, then raised by 50 basis points to 9.00% on 24 November 2021.",
      "• The policy rate was maintained at 9.00% through 23 November 2022, with a slight increase to 9.25% on 15 February 2023, coinciding with an increase in the statutory reserve ratio from 9.00% to 11.50% on 2 February 2023.",
      "• Further increases in the policy rate occurred on 17 May 2023 (to 9.50%), 23 August 2023 (to 10.00%), and 22 November 2023 (to 11.00%), with the statutory reserve ratio increased twice in November 2023: by 300 basis points to 14.50% on 6 November and by 250 basis points to 17.00% on 27 November.",
      "• On 14 February 2024, the policy rate was raised by 150 basis points to 12.50%, alongside a substantial increase in the statutory reserve ratio by 900 basis points to 26.00% on 2 February 2024.",
      "• The policy rate was further increased by 100 basis points to 13.50% on 15 May 2024, maintained at 13.50% on 14 August 2024, then raised by 50 basis points to 14.00% on 13 November 2024.",
      "• On 12 February 2025, the policy rate was increased by 50 basis points to 14.50% and held steady at this level on 23 May 2025.",
      "• The Bank of Zambia purchases gold locally from the Kansanshi Copper Mine and the Zambia Gold Company to bolster its reserves.",
      "• Cumulative gold reserves held by the Bank of Zambia increased significantly over recent years: US$43 million in 2021; US$83 million in 2022 with a target of US$100 million; approximately US$190 million (≈ ZMW 3.7 billion) in 2024 corresponding to about 2,469.17 kilograms of refined gold; and approximately US$233.5 million (≈ ZMW 6.3 billion) in 2025 with about 2,163.26 kilograms of refined gold.",
      "• Commercial banks’ average lending rates in Zambia have fluctuated between 2016 and 2022, starting at 29.20% in 2016, declining to 23.60% in 2018, rising again to 26.57% in 2020, and slightly decreasing to 25.22% by 2022.",
      "• The monetary policy adjustments by the Bank of Zambia reflect responses to economic conditions, with periods of both tightening and easing aimed at controlling inflation, stabilizing the currency, and supporting economic growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:02.307768",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4140,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.15",
    "section_name": "Health",
    "text": "In May 2025, the Zambian government signed a Joint Venture (JV) agreement with\none of India's largest pharmaceutical companies, Akums Drugs and\nPharmaceuticals Limited, to establish a manufacturing plant for the local\nproduction of approximately 150 essential medicines.",
    "openai_summarised_points": [
      "• In May 2025, the Zambian government entered into a Joint Venture (JV) agreement with Akums Drugs and Pharmaceuticals Limited, one of India's largest pharmaceutical companies.",
      "• The JV agreement aims to establish a manufacturing plant in Zambia dedicated to the local production of approximately 150 essential medicines."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:48.170637",
      "openai_model": "gpt-4.1-mini",
      "content_length": 270,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "0.16",
    "section_name": "Media",
    "text": "* Mass media in Zambia"
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Infrastructure",
    "text": "There are many forms of transport in Zambia. Zambia is highly dependent on\nroad transport.\n\n* Transport in Zambia\n* Roads in Zambia\n* List of airports in Zambia.\n* Rail transport in Zambia\n* Water transport in Zambia",
    "openai_summarised_points": [
      "• Zambia’s transportation system encompasses multiple modes, including road, rail, air, and water transport, reflecting a diverse infrastructure network.",
      "• The country is predominantly reliant on road transport, which serves as the primary means for the movement of goods and passengers across Zambia.",
      "• The road network in Zambia is a critical component of the national infrastructure, facilitating connectivity within the country and with neighboring states.",
      "• Zambia’s rail transport system plays a significant role in freight and passenger movement, contributing to the overall transport infrastructure.",
      "• Air transport is supported by a number of airports throughout Zambia, which are integral for domestic and international connectivity.",
      "• Water transport is also utilized in Zambia, leveraging the country’s rivers and lakes to support transportation needs, particularly in areas less accessible by road or rail."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:51.374329",
      "openai_model": "gpt-4.1-mini",
      "content_length": 216,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Growth",
    "text": "There are, however, positive macroeconomic signs, rooted in reforms\nimplemented in the early and mid-1990s. Zambia's floating exchange rate and\nopen capital markets have provided useful discipline on the government, while\nat the same time allowing continued diversification of Zambia's export sector,\ngrowth in the tourist industry, and procurement of inputs for growing\nbusinesses. Some parts of the Copper Belt have experienced a significant\nrevival as spin-off effects from the massive capital reinvestment are\nexperienced.",
    "openai_summarised_points": [
      "• Positive macroeconomic indicators in Zambia are evident, stemming from reforms enacted in the early and mid-1990s.",
      "• The adoption of a floating exchange rate system and the establishment of open capital markets have imposed fiscal discipline on the Zambian government.",
      "• These economic policies have facilitated the diversification of Zambia's export sector beyond traditional commodities.",
      "• Growth has been observed in the tourism industry, contributing to the broader economic expansion.",
      "• The availability of inputs for expanding businesses has improved due to these reforms, supporting overall economic development.",
      "• Certain areas within the Copper Belt region have experienced a notable economic revival, attributed to the spin-off effects from substantial capital reinvestment in the mining sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:51.854752",
      "openai_model": "gpt-4.1-mini",
      "content_length": 526,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Export Diversification",
    "text": "As Zambia continued on its path to diversifying from dependence on Copper with\nan emphasis on growth in agriculture, in April 2022, the country's Ministry of\nAgriculture through the Plant Quarantine and Phytosanitary Service (PQPS)\napproved the first consignment of over 37 metric tons of Zambian grown\navocados for export to countries in the European Union.",
    "openai_summarised_points": [
      "• In April 2022, Zambia's Ministry of Agriculture, through the Plant Quarantine and Phytosanitary Service (PQPS), approved the first consignment of over 37 metric tons of Zambian-grown avocados for export to European Union countries.",
      "• This approval marked a significant milestone in Zambia's ongoing efforts to diversify its economy away from dependence on copper by emphasizing growth in the agricultural sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:50.705137",
      "openai_model": "gpt-4.1-mini",
      "content_length": 358,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "The Multi-Facility Economic Zones (MFEZ)",
    "text": "In 2005, the Japanese Government through Japan International Corporation\nAgency (JICA) aided the Zambia government to introduce the Multi- Facility\nEconomic Zone (MFEZ) programme. The aim is to create a platform for Zambia to\nachieve economic development by attracting significant domestic and foreign\ndirect investment (FDI) through a strengthened policy and legislative\nenvironment. The MFEZs are, special industrial zones for both export-oriented\nand domestic-oriented industries. The zones are expected to have well\nappointed infrastructure in place in order to attract and facilitate\nestablishment of world-class enterprises in the zone (s).\n\nAmong the MFEZ investment incentives offered for companies operating under the\nMFEZ/Priority Sector include:\n\nMFEZ Incentives  Category  | Tax Rate  | Duration  | Conditions\n---|---|---|---\nCorporate Tax | 0%  | 5 years  | from the year of first declaration of dividends\nTax on Profits  | 30%  | 5 years  | from 6 to 8 years only 50% of the profits to be taxed for years 9 and 10, 75% of profits to be taxed\nImport Duty  | 0%  | 5 years  | on raw materials, capital goods, machinery including trucks and specialised motor vehicles\nValue Added Tax  | Deferred  | \\-  | on machinery and equipment including trucks and specialised motor vehicles imported\n\nCurrently there are numerous MFEZs in Zambia:",
    "openai_summarised_points": [
      "• In 2005, the Japanese Government, through the Japan International Cooperation Agency (JICA), assisted the Zambian government in introducing the Multi-Facility Economic Zone (MFEZ) programme aimed at fostering economic development in Zambia.",
      "• The primary objective of the MFEZ programme is to attract substantial domestic and foreign direct investment (FDI) by establishing a strengthened policy and legislative environment conducive to investment.",
      "• MFEZs are designated special industrial zones designed to accommodate both export-oriented and domestic-oriented industries, providing a strategic platform for industrial growth.",
      "• These zones are expected to be equipped with well-appointed infrastructure to attract and facilitate the establishment of world-class enterprises within the zones.",
      "• The MFEZ investment incentives for companies operating under the MFEZ or Priority Sector include:",
      "• Corporate Tax: 0% for 5 years, starting from the year of the first declaration of dividends.",
      "• Tax on Profits: 30% for 5 years; for years 6 to 8, only 50% of profits are taxed, and for years 9 and 10, 75% of profits are taxed.",
      "• Import Duty: 0% for 5 years on raw materials, capital goods, machinery, including trucks and specialized motor vehicles.",
      "• Value Added Tax (VAT): Deferred on machinery and equipment, including trucks and specialized motor vehicles imported.",
      "• Currently, Zambia hosts numerous Multi-Facility Economic Zones (MFEZs), although specific names and locations of these zones are not detailed in the section."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:53.661305",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1346,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.1",
    "section_name": "The Lusaka South Multi-Facility Economic Zone (LS-MFEZ)",
    "text": "Established in June 2012, the zone prioritizes agribusiness, packaging and\nprinting, palm oil processing, pulp and packaging boards, pharmaceuticals,\nelectrical and electronic appliances, ICTs, education and skills training,\nR&D, professional, medical, scientific and measuring services.\n\nIn 2020, the LS-MFEZ realised US$100.6 million worth of investments bringing\nthe accumulated investments to about US$567.6 million and generating about\n7,100 jobs since commencing operations in 2012.\n\nIn 2021, the LS-MFEZ realised a record US$309.4 million worth of investments\nbringing the accumulated investments to about US$877.4 million with permanent\njobs at about 9,360 and total jobs including construction workers at 11,560.",
    "openai_summarised_points": [
      "• The Lusaka South Multi-Facility Economic Zone (LS-MFEZ) was established in June 2012 with a strategic focus on multiple sectors including agribusiness, packaging and printing, palm oil processing, pulp and packaging boards, pharmaceuticals, electrical and electronic appliances, information and communication technologies (ICTs), education and skills training, research and development (R&D), as well as professional, medical, scientific, and measuring services.",
      "• By 2020, the LS-MFEZ had attracted investments totaling US$100.6 million for that year alone, contributing to an accumulated investment sum of approximately US$567.6 million since its inception in 2012, and had generated around 7,100 jobs.",
      "• In 2021, the LS-MFEZ achieved a record investment inflow of US$309.4 million, increasing the total accumulated investments to about US$877.4 million; during this period, permanent employment reached approximately 9,360 jobs, with total employment including construction workers rising to 11,560."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:56.182662",
      "openai_model": "gpt-4.1-mini",
      "content_length": 721,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.2",
    "section_name": "The Lusaka East Multi-Facility Economic Zone",
    "text": "This zone is also known as the Zambia-China Economic & Trade Cooperation Zone\n(ZCCZ).\n\nThe zone prioritizes agriculture (circular and tourism agricultures), agro-\nprocessing, brewery, pharmaceuticals, building materials, logistics (storage)\nand international commerce.",
    "openai_summarised_points": [
      "• The Lusaka East Multi-Facility Economic Zone is also referred to as the Zambia-China Economic & Trade Cooperation Zone (ZCCZ).",
      "• The economic zone prioritizes several key sectors including agriculture, specifically circular and tourism agricultures.",
      "• Agro-processing is a major focus area within the zone, emphasizing value addition to agricultural products.",
      "• The zone supports the brewery industry as part of its industrial activities.",
      "• Pharmaceutical manufacturing and related activities are prioritized within the zone.",
      "• Production and supply of building materials are key components of the zone’s industrial portfolio.",
      "• Logistics, particularly storage facilities, are emphasized to support efficient supply chain and distribution networks.",
      "• The zone is designed to facilitate and promote international commerce, enhancing trade opportunities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:56.791225",
      "openai_model": "gpt-4.1-mini",
      "content_length": 268,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.3",
    "section_name": "Roma Industrial and Commercial Park",
    "text": "Launched in 2011, is expected to generate more than 4,000 permanent jobs once\nfully developed and is focused on real estate and residential developments.",
    "openai_summarised_points": [
      "• The Roma Industrial and Commercial Park was launched in 2011.",
      "• The park is expected to generate more than 4,000 permanent jobs upon full development.",
      "• The primary focus of the Roma Industrial and Commercial Park is on real estate and residential developments."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:52.594951",
      "openai_model": "gpt-4.1-mini",
      "content_length": 153,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.4",
    "section_name": "Chambishi Multi-Facility Economic Zone (CMFEZ)",
    "text": "Opened in 2007, prioritizes mining, engineering equipment assembly,\nconstruction materials, fertilizers, agriculture, and service sectors such as\nbanking and hospitals.\n\nBy 2016, the CMFEZ had already received investment of about US$800 million\nfrom 14 enterprises.",
    "openai_summarised_points": [
      "• The Chambishi Multi-Facility Economic Zone (CMFEZ) was officially opened in 2007.",
      "• The CMFEZ prioritizes several key sectors including mining, engineering equipment assembly, construction materials, fertilizers, agriculture, and service industries such as banking and hospitals.",
      "• By the year 2016, the CMFEZ had attracted approximately US$800 million in investment.",
      "• This investment came from a total of 14 different enterprises operating within the economic zone."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:53.617179",
      "openai_model": "gpt-4.1-mini",
      "content_length": 265,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.5",
    "section_name": "Chembe Multi-Facility Economic Zone",
    "text": "In 2016, the government launched the development of the Chembe Multi-Facility\nEconomic Zone in Chembe, Luapula Province.",
    "openai_summarised_points": [
      "• In 2016, the Government of Zambia initiated the development of the Chembe Multi-Facility Economic Zone located in Chembe, within Luapula Province."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:53.993231",
      "openai_model": "gpt-4.1-mini",
      "content_length": 120,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.6",
    "section_name": "Chibombo Multi-Facility Economic Zone",
    "text": "Located in Chibombo District, Central Province, Zambia, the ground breaking\nfor this zone was held in November 2018 and is also known as the Jiangxi\nMulti-Facility Economic Zone.\n\nIn October 2021, the Chibombo MFEZ signed six project agreements worth US$160\nmillion projected to create over 1,000 jobs.",
    "openai_summarised_points": [
      "• The Chibombo Multi-Facility Economic Zone (MFEZ), also referred to as the Jiangxi Multi-Facility Economic Zone, is situated in Chibombo District within the Central Province of Zambia.",
      "• The groundbreaking ceremony for the Chibombo MFEZ took place in November 2018, marking the commencement of development activities for the zone.",
      "• In October 2021, the Chibombo MFEZ formalized six project agreements with a combined investment value of US$160 million.",
      "• These six projects signed in 2021 are projected to generate employment opportunities exceeding 1,000 jobs within the zone."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:55.462814",
      "openai_model": "gpt-4.1-mini",
      "content_length": 302,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.7",
    "section_name": "Lumwana Multi-Facility Economic Zone",
    "text": "In November 2009, the government of Zambia announced a plan for a US$1.2\nbillion investment into the declared Lumwana Multi-Facility Economic Zone.",
    "openai_summarised_points": [
      "• In November 2009, the government of Zambia announced a plan to invest US$1.2 billion into the Lumwana Multi-Facility Economic Zone.",
      "• The Lumwana Multi-Facility Economic Zone is a designated area intended to promote industrial and economic development within Zambia.",
      "• This investment plan was part of Zambia’s broader strategy to enhance economic growth through the establishment of specialized economic zones.",
      "• The US$1.2 billion investment reflects the government's commitment to developing infrastructure and attracting business activities in the Lumwana region.",
      "• The initiative aims to leverage the economic potential of the Lumwana area, which is known for its mining and industrial activities.",
      "• The announcement in 2009 marked a significant milestone in Zambia’s efforts to diversify its economy and create employment opportunities through targeted economic zones."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:58.020296",
      "openai_model": "gpt-4.1-mini",
      "content_length": 147,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.8",
    "section_name": "Sub-Saharan Gemstones Exchange Industrial Park",
    "text": "This Multi-Facility Economic Zone (MFEZ) is located in Ndola, Copperbelt\nProvince.\n\nBy October 2011, over US$10 million had been invested in the infrastructure in\nthe MFEZ.",
    "openai_summarised_points": [
      "• The Sub-Saharan Gemstones Exchange Industrial Park is a Multi-Facility Economic Zone (MFEZ) situated in Ndola, within Zambia's Copperbelt Province.",
      "• By October 2011, the infrastructure development of the MFEZ had attracted investments exceeding US$10 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:56.181980",
      "openai_model": "gpt-4.1-mini",
      "content_length": 172,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.9",
    "section_name": "Kalumbila Multi-Facility Economic Zone (MFEZ)",
    "text": "Located in North-Western Province, this MFEZ received approval by the Ministry\nof Commerce, Trade and Industry in September 2022.\n\nThe expected initial investment was approximately US$100 million.\n\nThe facility was intended to offer local vendors an industrial base to set up\na local supply chain for the growing Kalumbila copper mine, upcoming\nEnterprise nickel mine, and other businesses around the First Quantum Minerals\n(FQM) sites.",
    "openai_summarised_points": [
      "• The Kalumbila Multi-Facility Economic Zone (MFEZ) is situated in the North-Western Province of Zambia.",
      "• The MFEZ received official approval from the Ministry of Commerce, Trade and Industry in September 2022.",
      "• The initial investment anticipated for the development of the Kalumbila MFEZ was approximately US$100 million.",
      "• The primary purpose of the facility is to provide local vendors with an industrial base to establish a local supply chain.",
      "• This supply chain is intended to support the expanding Kalumbila copper mine, the forthcoming Enterprise nickel mine, and other businesses operating around the First Quantum Minerals (FQM) sites."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:58.952192",
      "openai_model": "gpt-4.1-mini",
      "content_length": 436,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.2.10",
    "section_name": "Actualized Investments",
    "text": "Multi-Facility Economic Zones (MFEZ) and Industrial Parks (IPs) Actualized Investments  Year  | Actualized Value (USD)  | Actualized Value (ZMW)  | Number of Jobs created  | Source\n---|---|---|---|---\n2019  | US$1.90 billion  | ZMW 24.53 billion  | 14,775  |\n2020  | US$2.18 billion  | ZMW 39.92 billion  | 25,795  |\n2021  | US$2.74 billion  | ZMW 53.95 billion  | 35,794  |\n2022  | US$4.40 billion  | ZMW 74.36 billion  | 19,528  |",
    "openai_summarised_points": [
      "• In 2019, actualized investments in Zambia's Multi-Facility Economic Zones (MFEZ) and Industrial Parks (IPs) amounted to US$1.90 billion, equivalent to ZMW 24.53 billion, resulting in the creation of 14,775 jobs.",
      "• In 2020, the actualized investment value increased to US$2.18 billion, or ZMW 39.92 billion, with a corresponding rise in employment to 25,795 jobs created within the MFEZ and IP sectors.",
      "• The year 2021 saw further growth in actualized investments, reaching US$2.74 billion (ZMW 53.95 billion), accompanied by the creation of 35,794 jobs in Zambia's economic zones and industrial parks.",
      "• In 2022, actualized investments peaked at US$4.40 billion, equivalent to ZMW 74.36 billion; however, the number of jobs created decreased to 19,528 compared to the previous year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:00.420452",
      "openai_model": "gpt-4.1-mini",
      "content_length": 432,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Fintech",
    "text": "Zambia has a relatively quiet startup and venture capital space; however, the\ntrend seems to be shifting as in August 2021 fintech company Union54 led the\nway by being the first Zambian startup accepted into Y Combinator's summer\nbatch of YC 2021. In October 2021, American investment firm Tiger Global led a\nU$3 million seed round in Union54. And in April 2022, the Zambian company\nraised an additional U$12 million in a seed extension round also led by Tiger\nGlobal.",
    "openai_summarised_points": [
      "• Zambia's startup and venture capital ecosystem has historically been relatively quiet, with limited activity in the fintech sector.",
      "• A notable shift occurred in August 2021 when Union54, a Zambian fintech company, became the first startup from Zambia to be accepted into Y Combinator's summer batch of YC 2021, marking a significant milestone for the country's tech ecosystem.",
      "• In October 2021, Union54 secured a U$3 million seed funding round led by the American investment firm Tiger Global, indicating growing international investor interest in Zambian fintech ventures.",
      "• Further demonstrating investor confidence, Union54 raised an additional U$12 million in April 2022 through a seed extension round, which was also led by Tiger Global, underscoring the company's rapid growth and the expanding fintech landscape in Zambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:31:59.966436",
      "openai_model": "gpt-4.1-mini",
      "content_length": 468,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Salaula",
    "text": "Standard economic theory and empirical data indicates that second-hand\nclothing import can have positive effects in a country like Zambia (one of the\nleast developed countries in the world). The _salaula_ market reduces the\nproportion of income that a family has to spend on clothing. It also helps to\nkeep employments like repairs and alterations in business and forces tailors\nto proceed into more specialize production of styled garments.\n\nThere is a downside to such imports, however; the massive importation of used\nclothing from the developed world has resulted in a near-total collapse of the\nZambian indigenous textile industry. In the face of cheap used clothing,\ntailors' specialized production may be irrelevant - customers will buy the\nleast expensive clothing available, irrespective of style. Those who might\notherwise work at textile mills or clothing factories are left jobless, or\nelse make significantly less money in the salaula resale business.",
    "openai_summarised_points": [
      "• Standard economic theory and empirical data indicate that the importation of second-hand clothing can have positive economic effects in a country like Zambia, which is classified as one of the least developed countries in the world.",
      "• The _salaula_ market in Zambia reduces the proportion of household income that families need to allocate for clothing expenses, thereby increasing affordability.",
      "• The _salaula_ market supports employment opportunities related to clothing repairs and alterations, helping to sustain these ancillary businesses.",
      "• The presence of second-hand clothing imports encourages tailors to specialize in the production of styled garments, potentially enhancing the diversity and quality of locally made clothing.",
      "• Despite these benefits, the massive importation of used clothing from developed countries has caused a near-total collapse of Zambia’s indigenous textile industry.",
      "• The availability of cheap used clothing undermines the relevance of tailors’ specialized garment production, as consumers tend to prioritize the lowest cost over style or quality.",
      "• Workers who might have been employed in textile mills or clothing factories face unemployment or are forced to accept significantly lower incomes by participating in the resale of _salaula_ clothing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:02.220513",
      "openai_model": "gpt-4.1-mini",
      "content_length": 964,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Electric Battery Value Chain",
    "text": "Zambia and Democratic Republic of the Congo (DRC), two countries, that have\nmore than 70% of the world's Cobalt reserves and an abundance of Copper,\nNickel and Manganese have resolved to set up a Zambia-DRC-Executive Battery\nCouncil to oversee the implementation of the cooperating agreement for the\nelectric vehicle battery value chain. The Executive Council's executive\ncommittee will be composed of President Hakainde Hichilema, his DRC\ncounterpart Felix Tshisekedi, the Deputy Secretary General of the African\nEconomic Community for the United Nations, as well as the President of AFREXIM\nBank, as a financial partner. Also issued was a communiqué by the two heads of\nstate that indicated that the two countries will also harmonize policies for\nthe initiative. Zambia and the DRC signed the MOU in Lusaka Zambia on 29 April\n2022.\n\nIn July 2022, the African Export-Import Bank President Benedict Oramah, whilst\nin Lusaka Zambia, announced that a pool of investors had earmarked more than\nUS$500.0 million to set up an industrial park for the purposes of adding value\nto the copper, cobalt, and manganese mined in Zambia. The investors will set\nup plants to process cobalt, copper, and lithium that are in Zambia and\nneighboring countries and establish a US$250 million Battery Electric Vehicle\n(BEV) manufacturing plant.\n\nIn July 2022, at the 94th Agricultural and Commercial Show in Lusaka, the\nmanaging director of the National Utility ZESCO, Victor Mapani announced that\nthe company plans to deploy Electric Vehicle EV charging stations across the\ncountry in an effort to accelerate and promote the transition to EVs and\nenhance carbon emission reduction.\n\nIn December 2022, on the sidelines of the ongoing US-Africa summit in\nWashington DC, Zambia, the Democratic Republic of the Congo (DRC) and the\nUnited States of America signed an MOU toward the actualization of the\nelectric vehicle battery value chain. Different US institutions and agencies\nsuch as USAID, the US Department of Commerce, the Trade and Development\nAgency, are exploring technical assistance for the Zambia-DRC EV supply chain.\nAdditionally, the Export-Import Bank of the United States, the Development\nFinance Corporation, will be exploring financing and support mechanisms for\ninvestment in African electric vehicle value chains.\n\nIn April 2023, The African Export-Import Bank (Afreximbank) and the United\nNations Economic Commission for Africa (ECA) signed a framework agreement with\nZambia and the Democratic Republic of Congo for the establishment of special\neconomic zones for the production of electric vehicles and batteries.\nAfreximbank and ECA will lead the establishment of an operating company in\nconsortium with public and private investors and Afreximbank's impact fund\nsubsidiary, the Fund for Export Development in Africa. The new company will\ndevelop special economic zones (SEZs) dedicated to the production of battery\nprecursors, batteries, and electric vehicles, in both nations.\n\nIn October 2023, the Chinese company Better Technology Group announced that\nprocurement of electric vehicle battery, energy storage battery and\nUninterruptiple Supply battery manufacturing equipment was under underway and\nwill be delivered in Zambia by December 2023. This equipment will be part of\nthe EV battery manufacturing facility to be set up in Zambia's Chibomba-\nJiangxi Multi Facility Economic Zone in Central Province with construction set\nto be completed by March 2024. The Group President also announced that the\ncompany has budgeted to invest ZMW 2.18 billion kwacha (US$100 million) in the\nVenture through 2026.",
    "openai_summarised_points": [
      "• Zambia and the Democratic Republic of the Congo (DRC) together hold more than 70% of the world’s cobalt reserves and possess abundant deposits of copper, nickel, and manganese, prompting them to establish a Zambia-DRC Executive Battery Council to oversee the implementation of a cooperative agreement focused on the electric vehicle battery value chain.",
      "• The Executive Council’s executive committee will include President Hakainde Hichilema of Zambia, President Felix Tshisekedi of the DRC, the Deputy Secretary General of the African Economic Community for the United Nations, and the President of AFREXIM Bank, which serves as a financial partner in the initiative.",
      "• A communiqué issued by the two heads of state emphasized that Zambia and the DRC will harmonize policies to support the electric vehicle battery value chain initiative.",
      "• Zambia and the DRC signed a Memorandum of Understanding (MOU) formalizing this cooperation in Lusaka, Zambia, on 29 April 2022.",
      "• In July 2022, Benedict Oramah, President of the African Export-Import Bank (Afreximbank), announced in Lusaka that a consortium of investors had earmarked over US$500 million to establish an industrial park aimed at adding value to copper, cobalt, and manganese mined in Zambia.",
      "• The planned industrial park will include plants to process cobalt, copper, and lithium sourced from Zambia and neighboring countries, alongside the establishment of a US$250 million Battery Electric Vehicle (BEV) manufacturing plant.",
      "• Also in July 2022, at the 94th Agricultural and Commercial Show in Lusaka, Victor Mapani, Managing Director of Zambia’s national utility company ZESCO, announced plans to deploy electric vehicle (EV) charging stations nationwide to accelerate EV adoption and support carbon emission reduction efforts.",
      "• In December 2022, during the US-Africa summit in Washington DC, Zambia, the DRC, and the United States signed an MOU to advance the electric vehicle battery value chain, with multiple US agencies—including USAID, the US Department of Commerce, and the Trade and Development Agency—exploring technical assistance for the Zambia-DRC EV supply chain.",
      "• Additionally, US financial institutions such as the Export-Import Bank of the United States and the Development Finance Corporation committed to exploring financing and support mechanisms to facilitate investment in African electric vehicle value chains.",
      "• In April 2023, Afreximbank and the United Nations Economic Commission for Africa (ECA) signed a framework agreement with Zambia and the DRC to establish special economic zones (SEZs) dedicated to electric vehicle and battery production.",
      "• Afreximbank and ECA will lead the creation of an operating company in partnership with public and private investors, including Afreximbank’s impact fund subsidiary, the Fund for Export Development in Africa, to develop SEZs focused on manufacturing battery precursors, batteries, and electric vehicles in both countries.",
      "• In October 2023, the Chinese company Better Technology Group announced that procurement of manufacturing equipment for electric vehicle batteries, energy storage batteries, and uninterruptible power supply batteries was underway, with delivery to Zambia scheduled by December 2023.",
      "• This equipment will be utilized in the EV battery manufacturing facility to be established in Zambia’s Chibomba-Jiangxi Multi Facility Economic Zone in Central Province, with construction expected to be completed by March 2024.",
      "• The Group President of Better Technology Group also revealed that the company has budgeted an investment of ZMW 2.18 billion (approximately US$100 million) in the venture through 2026."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:11.235889",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3605,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Telecommunications",
    "text": "In June 2023, an internet services license was granted to Starlink by the\nZambian Government through the Electronic Government Division – SMART Zambia,\nfollowing the completion of trial projects throughout the nation.",
    "openai_summarised_points": [
      "• In June 2023, the Zambian Government, through the Electronic Government Division known as SMART Zambia, granted an internet services license to Starlink.",
      "• The license was issued following the successful completion of trial projects conducted by Starlink throughout the nation of Zambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:00.439044",
      "openai_model": "gpt-4.1-mini",
      "content_length": 217,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Inflation",
    "text": "GDP per capita (current), compared to neighbouring countries (world average =\n100)\n\nLack of balance-of-payment support meant the Zambian government did not have\nresources for capital investment and periodically had to issue bonds or\notherwise expand the money supply to try to meet its spending and debt\nobligations. The government continued these activities even after balance-of-\npayment support resumed. This has kept interest rates at levels that are too\nhigh for local business, fuelled inflation, burdened the budget with domestic\ndebt payments, while still falling short of meeting the public payroll and\nother needs, such as infrastructure rehabilitation. The government was forced\nto draw down foreign exchange reserves sharply in 1998 to meet foreign debt\nobligations, putting further pressure on the kwacha and inflation. Inflation\nheld at 32% in 2000; consequently, the kwacha lost the same value against the\ndollar over the same period. In mid- to late 2001, Zambia's fiscal management\nbecame more conservative. As a result, 2001 year-end inflation was below 20%,\nits best result in decades. In 2002 inflation rose to 26.7%. However, in 2007\ninflation hit 8%, the first time in 30 years that Zambia had seen single digit\ninflation.\n\nOn January 27, 2011, it was reported by the Central Statistical Office that\ninflation rose to 9%. in 2012\n\nBetween April 2019 and April 2020 Zambia' s Annual inflation rate rose to\n15.7% from 14% in March 2020. The rise of prices in food and other non- food\nitems led to the increase in the Annual inflation rate.\n\nHowever, it is significant that inflation often peaks in election years,\nhitting a recent high of 17.9% in 2016. This suggests that a further peak is\nlikely approaching during the 2021 general elections. The value of the kwacha\nagainst the dollar has been relatively consistent for the past two years and\nhas yet to return to the recent high of almost 0.2 kwacha to the dollar in\n2013. Nonetheless, the real effective exchange rate of the kwacha against a\nweighted average of foreign currencies improved from 88.5 in 2016 to 96.4 in\n2017. The kwacha lost value against the dollar in September 2018 but has\nremained fairly consistent at 0.08 to the dollar in November to December,\nthough further instability remains likely due to both political and economic\nuncertainty.",
    "openai_summarised_points": [
      "• The Zambian government faced a lack of balance-of-payment support, which limited resources for capital investment and forced periodic issuance of bonds or expansion of the money supply to meet spending and debt obligations.",
      "• Despite the resumption of balance-of-payment support, the government continued issuing bonds and expanding the money supply, resulting in persistently high interest rates detrimental to local businesses, fueling inflation, and increasing the budget burden with domestic debt payments.",
      "• These financial pressures prevented the government from adequately meeting public payroll obligations and funding essential needs such as infrastructure rehabilitation.",
      "• In 1998, the government sharply drew down foreign exchange reserves to meet foreign debt obligations, exacerbating pressure on the Zambian kwacha and contributing to inflationary trends.",
      "• Inflation was recorded at 32% in the year 2000, during which the kwacha depreciated by the same percentage against the US dollar.",
      "• By mid- to late 2001, Zambia adopted more conservative fiscal management policies, resulting in a year-end inflation rate below 20%, marking the best inflation performance in decades.",
      "• Inflation increased again to 26.7% in 2002, indicating ongoing volatility in price levels.",
      "• In 2007, Zambia experienced an inflation rate of 8%, the first instance of single-digit inflation in 30 years.",
      "• On January 27, 2011, the Central Statistical Office reported that inflation had risen to 9%.",
      "• Between April 2019 and April 2020, Zambia’s annual inflation rate increased to 15.7% from 14% in March 2020, primarily driven by rising prices in food and other non-food items.",
      "• Inflation in Zambia tends to peak during election years, with a recent high of 17.9% recorded in 2016, suggesting a likely inflation peak around the 2021 general elections.",
      "• The exchange rate of the kwacha against the US dollar has remained relatively stable over the past two years but has not returned to the 2013 peak value of nearly 0.2 kwacha per dollar.",
      "• The real effective exchange rate of the kwacha, measured against a weighted average of foreign currencies, improved from 88.5 in 2016 to 96.4 in 2017, indicating some strengthening of the currency in real terms.",
      "• In September 2018, the kwacha depreciated against the US dollar but stabilized between 0.08 kwacha to the dollar from November to December 2018; however, further exchange rate instability remains likely due to ongoing political and economic uncertainties."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:11.332005",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2330,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic Statistics",
    "text": "Main Economic Indicators 1980–2020 (with IMF staff estimates in 2021–2022) Inflation below 10% is in green.  Year  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP)  | GDP (in Bil. US$nominal)  | GDP per capita (in US$ nominal)  | GDP growth % (real) | Inflation rate (in Percent)  | Unemployment (in percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 7.806  | 1,321.44  | 4.246  | 718.80  | 3.85%  | 11.73%  | N/A  | N/A\n1981  | 9.111  | 1,493.25  | 4.385  | 718.74  | 6.63%  | 14.00%  | N/A  | N/A\n1982  | 9.392  | 1,491.45  | 4.232  | 672.01  | -2.91%  | 12.50%  | N/A  | N/A\n1983  | 9.648  | 1,485.51  | 3.653  | 562.44  | -1.15%  | 19.69%  | N/A  | N/A\n1984  | 9.825  | 1,467.55  | 3.003  | 448.53  | -1.72%  | 20.02%  | N/A  | N/A\n1985  | 10.261  | 1,487.63  | 2.848  | 448.53  | 1.24%  | 37.43%  | N/A  | N/A\n1986  | 10.645  | 1,498.40  | 1.962  | 276.15  | 1.70%  | 47.99%  | N/A  | N/A\n1987  | 11.071  | 1,513.02  | 2.431  | 332.27  | 1.49%  | 43.04%  | N/A  | N/A\n1988  | 12.524  | 1,661.46  | 4.095  | 543.32  | 9.27%  | 45.82%  | N/A  | N/A\n1989  | 12.539  | 1,613.97  | 4.365  | 561.83  | -3.66%  | 113.16%  | N/A  | N/A\n1990  | 12.933  | 1,613.94  | 4.085  | 509.75  | -0.58%  | 93.87%  | N/A  | N/A\n1991  | 13.281  | 1,608.16  | 3.690  | 446.78  | -0.67%  | 85.28%  | N/A  | N/A\n1992  | 13.863  | 1,629.97  | 3.614  | 424.95  | 2.05%  | 146.71%  | N/A  | N/A\n1993  | 14.180  | 1,620.32  | 3.549  | 405.59  | -0.08%  | 158.40%  | N/A  | N/A\n1994  | 12.556  | 1,392.28  | 3.657  | 405.54  | -13.31%  | 46.07%  | N/A  | N/A\n1995  | 13.190  | 1,425.36  | 3.799  | 410.54  | 2.90%  | 31.46%  | N/A  | N/A\n1996  | 14.267  | 1,501.48  | 3.599  | 378.71  | 6.22%  | 38.38%  | N/A  | N/A\n1997  | 15.067  | 1,543.08  | 4.303  | 440.70  | 3.81%  | 21.42%  | N/A  | N/A\n1998  | 15.177  | 1,512.60  | 3.538  | 352.63  | -0.39%  | 22.66%  | N/A  | N/A\n1999  | 16.107  | 1,562.42  | 3.405  | 330.28  | 4.65%  | 23.86%  | N/A  | N/A\n2000  | 17.114  | 1,616.81  | 3.601  | 340.16  | 3.90%  | 24.09%  | 12.93%  | 28.89%\n2001  | 18.430  | 1,696.89  | 3.870  | 356.32  | 5.32%  | 21.36%  | 13.51%  | 21.89%\n2002  | 19.561  | 1,755.88  | 4.194  | 376.47  | 4.51%  | 22.24%  | 14.12%  | 21.74%\n2003  | 21.332  | 1,866.96  | 4.902  | 429.01  | 6.95%  | 21.40%  | 14.70%  | 23.92%\n2004  | 23.445  | 1,999.40  | 6.221  | 530.54  | 7.03%  | 17.97%  | 15.30%  | 19.26%\n2005  | 25.930  | 2,152.92  | 8.329  | 691.55  | 7.24%  | 18.33%  | 15.90%  | 13.09%\n2006  | 28.842  | 2,329.39  | 12.762  | 1,030.69  | 7.90%  | 9.02%  | 13.25%  | 21.61%\n2007  | 32.096  | 2,519.51  | 14.060  | 1,103.69  | 8.35%  | 10.66%  | 10.59%  | 17.59%\n2008  | 35.255  | 2,688.11  | 17.914  | 1,365.93  | 7.77%  | 12.45%  | 7.93%  | 16.28%\n2009  | 38.752  | 2,868.81  | 15.332  | 1,135.01  | 9.22%  | 13.39%  | 10.56%  | 16.47%\n2010  | 43.256  | 3,108.17  | 20.264  | 1,456.05  | 10.30%  | 8.50%  | 13.19%  | 15.95%\n2011  | 46.612  | 3,249.60  | 23.455  | 1,635.17  | 5.57%  | 8.66%  | 10.55%  | 16.42%\n2012  | 49.509  | 3,348.12  | 25.502  | 1,724.63  | 7.60%  | 6.58%  | 7.85%  | 20.07%\n2013  | 53.420  | 3,503.86  | 28.042  | 1,839.33  | 5.06%  | 6.98%  | 8.61%  | 22.43%\n2014  | 54.506  | 3,467.10  | 27.145  | 1,726.65  | 4.70%  | 7.81%  | 9.36%  | 31.91%\n2015  | 54.473  | 3,360.02  | 21.245  | 1,310.46  | 2.92%  | 10.12%  | 10.13%  | 61.94%\n2016  | 55.712  | 3,332.67  | 20.965  | 1,254.12  | 3.78%  | 17.87%  | 10.87%  | 58.32%\n2017  | 58.735  | 3,407.31  | 25.874  | 1,500.96  | 3.50%  | 6.58%  | 11.63%  | 63.46%\n2018  | 62.565  | 3,520.21  | 26.312  | 1,480.42  | 4.04%  | 6.99%  | 12.01%  | 77.96%\n2019  | 64.602  | 3,526.11  | 23.309  | 1,272.24  | 1.44%  | 9.15%  | 12.52%  | 97.39%\n2020  | 63.559  | 3,366.14  | 18.111  | 959.15  | -2.79%  | 15.73%  | 12.85%  | 140.21%\n2021  | 69.245  | 3,559.05  | 21.313  | 1,095.47  | 4.60%  | 22.02%  | 12.50%  | 119.41%\n2022  | 76.325  | 3,808.05  | 27.025  | 1,348.36  | 2.91%  | 12.53%  | N/A  | 71.10%\n2023  | 85.951  | 4,178.52  | 28.406  | 1,380.97  | 5.80%  | 10.95%  | N/A  | 115.23%",
    "openai_summarised_points": [
      "• In 1980, Zambia's GDP in PPP terms was 7.806 billion US dollars with a GDP per capita of 1,321.44 US dollars PPP; nominal GDP was 4.246 billion US dollars and nominal GDP per capita was 718.80 US dollars, with a real GDP growth of 3.85% and an inflation rate of 11.73%.",
      "• From 1981 to 1985, GDP in PPP increased from 9.111 billion to 10.261 billion US dollars, while nominal GDP decreased from 4.385 billion to 2.848 billion US dollars; inflation rates rose sharply, reaching 37.43% in 1985, and real GDP growth fluctuated, including negative growth in 1982 (-2.91%) and 1984 (-1.72%).",
      "• Between 1986 and 1989, GDP in PPP grew from 10.645 billion to 12.539 billion US dollars, nominal GDP rebounded from 1.962 billion to 4.365 billion US dollars, but inflation remained extremely high, peaking at 113.16% in 1989; real GDP growth was volatile, with a notable 9.27% growth in 1988 followed by a -3.66% contraction in 1989.",
      "• In the early 1990s (1990-1994), GDP in PPP rose from 12.933 billion to 12.556 billion US dollars, nominal GDP hovered around 3.6 to 4 billion US dollars, while inflation rates remained exceedingly high, reaching 158.40% in 1993; real GDP growth was mostly negative, with a significant -13.31% decline in 1994.",
      "• From 1995 to 1999, Zambia experienced gradual GDP growth in PPP from 13.190 billion to 16.107 billion US dollars and nominal GDP fluctuated between 3.4 and 4.3 billion US dollars; inflation rates decreased but remained elevated (around 21-38%), and real GDP growth was positive except for a slight contraction of -0.39% in 1998.",
      "• In 2000, GDP in PPP was 17.114 billion US dollars, nominal GDP was 3.601 billion US dollars, with real GDP growth of 3.90%, inflation at 24.09%, unemployment at 12.93%, and government debt at 28.89% of GDP.",
      "• Between 2001 and 2005, Zambia's GDP in PPP increased from 18.430 billion to 25.930 billion US dollars, nominal GDP rose from 3.870 billion to 8.329 billion US dollars, real GDP growth averaged around 5-7%, inflation remained high but declining from 21.36% to 18.33%, unemployment hovered around 13-16%, and government debt decreased from 21.89% to 13.09% of GDP.",
      "• From 2006 to 2010, GDP in PPP grew from 28.842 billion to 43.256 billion US dollars, nominal GDP surged from 12.762 billion to 20.264 billion US dollars, real GDP growth peaked at 10.30% in 2010, inflation rates dropped below 10% by 2010 (8.50%), unemployment ranged from 7.93% to 15.30%, and government debt fluctuated around 15-21% of GDP.",
      "• During 2011 to 2015, GDP in PPP increased from 46.612 billion to 54.473 billion US dollars, nominal GDP peaked at 28.042 billion in 2013 before declining to 21.245 billion in 2015, real GDP growth slowed to 2.92% in 2015, inflation rates remained mostly below 10% until rising to 10.12% in 2015, unemployment increased from 7.85% to 10.13%, and government debt escalated sharply from 16.42% to 61.94% of GDP.",
      "• Between 2016 and 2020, Zambia's GDP in PPP grew from 55.712 billion to 63.559 billion US dollars, nominal GDP declined from 20.965 billion to 18.111 billion US dollars, real GDP growth was volatile with a contraction of -2.79% in 2020, inflation spiked to 17.87% in 2016 and reached 15.73% in 2020, unemployment remained around 10-13%, and government debt surged dramatically from 58.32% to 140.21% of GDP.",
      "• In 2021 and 2022, IMF staff estimates show GDP in PPP rising from 69.245 billion to 76.325 billion US dollars, nominal GDP increasing from 21.313 billion to 27.025 billion US dollars, real GDP growth at 4.60% in 2021 and 2.91% in 2022, inflation rates elevated at 22.02% in 2021 but declining to 12.53% in 2022, unemployment was 12.50% in 2021 with no data for 2022, and government debt decreased from 119.41% to 71.10% of GDP.",
      "• The 2023 IMF staff estimate indicates Zambia's GDP in PPP reached 85.951 billion US dollars, nominal GDP was 28.406 billion US dollars, real GDP growth rebounded to 5.80%, inflation rate was 10.95%, unemployment data was not available, and government debt rose again to 115.23% of GDP.",
      "• Inflation rates below 10% are highlighted in green in the data, occurring notably in years such as 2006 (9.02%), 2010 (8.50%), 2011 (8.66%), 2012 (6.58%), 2013 (6.98%), 2014 (7.81%), 2017 (6.58%), and 2018 (6.99%).",
      "• Unemployment data is unavailable for most years prior to 2000, with recorded rates fluctuating between 7.85% and 15.90% from 2000 onwards, reflecting labor market challenges.",
      "• Government debt as a percentage of GDP was not reported before 2000; from 2000 it ranged from a low of 13.09% in 2005 to a high of 140.21% in 2020, indicating significant fiscal pressures in recent years.",
      "• Real GDP growth rates show periods of both expansion and contraction, with notable negative growth in 1982 (-2.91%), 1984 (-1.72%), 1989 (-3.66%), 1994 (-13.31%), 2020 (-2.79%), and strong growth peaks such as 10.30% in 2010 and 9.22% in 2009.",
      "• The data reflects Zambia's economic volatility over four decades, characterized by fluctuating inflation, variable real GDP growth, rising government debt, and persistent unemployment challenges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:27.823369",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4047,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Trade",
    "text": "Table Below shows Imports and Exports of Goods, Services and Primary Income (BoP)  Year  | Imports (current millions US$)  | Exports (current millions US$)  | Trade Balance (current millions US$)  | **Total Trade(current millions US$)** | **% Growth in Trade**\n---|---|---|---|---|---\n1997  | 1,633  | 1,269  | -364  | 2,902  |\n1998  | 1,507  | 961  | -546  | 2,468  |  -14.96%\n1999  | 1,353  | 923  | -430  | 2,276  |  -7.78%\n2000  | 1,567  | 891  | -676  | 2,458  |  8.00%\n2001  | 1,824  | 1,076  | -748  | 2,900  |  17.98%\n2002  | 1,885  | 1,146  | -739  | 2,961  |  2.10%\n2003  | 1,994  | 1,283  | -711  | 3,277  |  10.67%\n2004  | 2,582  | 2,108  | -474  | 4,690  |  30.13%\n2005  | 3,181  | 2,842  | -339  | 6,023  |  28.42%\n2006  | 4,337  | 4,567  | 230  | 8,904  |  47.83%\n2007  | 5,967  | 5,262  | -705  | 11,229  |  26.11%\n2008  | 6,818  | 5,661  | -1,157  | 12,479  |  10.02%\n2009  | 4,509  | 4,906  | 397  | 9,415  |  -24.55%\n2010  | 6,969  | 8,063  | 1,094  | 15,032  |  59.66%\n2011  | 8,715  | 9,430  | 715  | 18,145  |  20.71%\n2012  | 9,603  | 10,521  | 918  | 20,124  |  9.83%\n2013  | 12,170  | 11,607  | -563  | 23,777  |  20.71%\n2014  | 11,762  | 11,077  | -685  | 22,839  |  -3.94%\n2015  | 9,226  | 8,232  | -994  | 17,458  |  -23.56%\n2016  | 8,656  | 7,490  | -1,166  | 16,146  |  -7.52%\n2017  | 9,947  | 9,154  | -793  | 19,101  |  18.30%\n2018  | 10,628  | 10,010  | -618  | 20,638  |  8.05%\n2019  | 8,485  | 8,303  | -182  | 16,788  |  -18.65%\n2020  | 6,382  | 8,594  | 2,212  | 14,976  |  -10.79%\n2021  | 6,899  | 11,111  | 4,212  | 18,010  |  20.26%\n2022  | 9,047  | 11,651  | 2,604  | 20,698  |  14.93%\n2023  | 9,324  | 9,652  | 328  | 18,976  |  -8.32%\n2024  | 11,194  | 11,198  | 4  | 22,393  |  18.00%\nExport Earnings from Minerals  Year  | Copper (millions US$)  | NTEs (millions US$)  | Cobalt (millions US$)  | Gold (millions US$)  | Nickel (millions ZMW)\n---|---|---|---|---|---\n2014  | 7,619  | 2,272  | 123.9  | 152.2  |\n2015  | 5,234  | 1,849  |  70.7  | 152.8  |\n2016  | 4,399  | 1,749  | 112.9  | 191.2  |\n2017  | 6,039  | 1,780  | 138.4  | 154.1  |\n2018  | 6,658  | 2,036  | 116.7  | 148.2  |\n2019  | 4,995  | 1,919  |  42.7  | 196.4  |\n2020  | 5,867  | 1,869  |  10.6  | 220.5  |\n2021  | 8,345  | 2,508  |  5.0  | 209.2  | 1,642.4\n2022  | 8,136  | 3,179  |  0.0  | 187.3  | 1,951.0\n2023  | 6,613  | 3,766  |  0.0  | 127.5  | 2,679.1\n2024  | 7,360  |  | 37.3  | 223.4  | 8,428.1\n\nMajor trade enhancing infrastructure projects carried out in Zambia's history:\n\n* TAZARA Railway commissioned in 1975 for a cost of US $406 million (the equivalent of US $3.29 billion in 2022 USD rate).\n* Kazungula Bridge, commissioned in May 2021 for a cost of US$259.3 million.\n* Levy Mwanawasa (Chembe) Bridge, commissioned in October 2008 for a cost of US$1.5 million.\n* Chinsali-Nakonde road is being constructed using grant funds from the African Development Bank. The 210 km stretch is valued at 6.3 billion kwacha (US$255.76 million). The road which is being constructed constructed in two lots by China State Engineering Corporation and China Railway 7 group is expected to be completed in December 2026.",
    "openai_summarised_points": [
      "• Between 1997 and 2024, Zambia's imports, exports, trade balance, total trade (in current millions of US dollars), and percentage growth in trade exhibited significant fluctuations, with total trade rising from US$2,902 million in 1997 to an estimated US$22,393 million in 2024, reflecting an 18.00% growth in trade for that year.",
      "• Zambia experienced a trade deficit in most years from 1997 to 2024, with notable exceptions in 2006 (trade surplus of US$230 million), 2009 (US$397 million surplus), 2010 (US$1,094 million surplus), 2011 (US$715 million surplus), 2012 (US$918 million surplus), 2020 (US$2,212 million surplus), 2021 (US$4,212 million surplus), 2022 (US$2,604 million surplus), and 2024 (US$4 million surplus).",
      "• The largest total trade value within the period was recorded in 2013 at US$23,777 million, followed by 2024 with US$22,393 million, and 2014 with US$22,839 million, though 2013 and 2014 saw negative trade balances of -US$563 million and -US$685 million respectively.",
      "• The highest recorded imports were in 2013 at US$12,170 million, while the highest exports were in 2022 at US$11,651 million.",
      "• Export earnings from key minerals between 2014 and 2024 show copper as the dominant export commodity, with earnings fluctuating from US$7,619 million in 2014, dipping to US$4,399 million in 2016, peaking again at US$8,345 million in 2021, and estimated at US$7,360 million in 2024.",
      "• Non-traditional exports (NTEs) ranged from US$1,749 million in 2016 to US$3,766 million in 2023, showing a general upward trend, with an estimated US$3,179 million in 2022.",
      "• Cobalt export earnings varied significantly, with US$123.9 million in 2014, falling to zero in 2022 and 2023, before rising to US$37.3 million in 2024.",
      "• Gold export earnings ranged from US$127.5 million in 2023 to US$223.4 million estimated in 2024, with fluctuations in between.",
      "• Nickel exports, reported in millions of Zambian Kwacha (ZMW), showed a substantial increase from 1,642.4 million ZMW in 2021 to an estimated 8,428.1 million ZMW in 2024.",
      "• Major trade-enhancing infrastructure projects in Zambia include the TAZARA Railway, commissioned in 1975 at a cost of US$406 million, equivalent to US$3.29 billion in 2022 USD.",
      "• The Kazungula Bridge, commissioned in May 2021, was constructed at a cost of US$259.3 million, significantly improving regional trade connectivity.",
      "• The Levy Mwanawasa (Chembe) Bridge, commissioned in October 2008, was built for US$1.5 million, contributing to local infrastructure development.",
      "• The Chinsali-Nakonde road project, valued at 6.3 billion Zambian Kwacha (approximately US$255.76 million), is under construction with grant funding from the African Development Bank; the 210 km road is being built in two sections by China State Engineering Corporation and China Railway 7 Group, with expected completion in December 2026."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:12.384511",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3129,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Major exhibitions",
    "text": "* Zambia International Trade Fair Archived 2022-07-31 at the Wayback Machine held annually in Ndola at the beginning of July.\n* Agriculture and Commercial Show held annually in Lusaka at the beginning of August.\n* Central Province Agriculture Show, held in Mkushi.",
    "openai_summarised_points": [
      "• The Zambia International Trade Fair is an annual event held in Ndola at the beginning of July, serving as a significant platform for trade and commerce; this event was archived on 31 July 2022 at the Wayback Machine.",
      "• The Agriculture and Commercial Show takes place annually in Lusaka at the beginning of August, focusing on agricultural advancements and commercial activities within the region.",
      "• The Central Province Agriculture Show is conducted in Mkushi, highlighting agricultural developments specific to Zambia’s Central Province."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:05.087443",
      "openai_model": "gpt-4.1-mini",
      "content_length": 264,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Notable Companies",
    "text": "* List of companies of Zambia\n* Lusaka Stock Exchange LuSE",
    "openai_summarised_points": [
      "• The \"List of companies of Zambia\" encompasses prominent businesses operating within the Zambian economy, reflecting the diverse industrial and commercial sectors present in the country.",
      "• The Lusaka Stock Exchange (LuSE) serves as Zambia's principal stock exchange, providing a platform for the trading of shares and securities of Zambian companies, thereby facilitating capital formation and investment within the national economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:03.758626",
      "openai_model": "gpt-4.1-mini",
      "content_length": 58,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Public Private Partnerships (PPP)",
    "text": "In December 2021, Zambia's UPND Government set up the Public-Private\nPartnership (PPP) Council of Ministers composed of the Minister of Finance and\nNational Planning (Dr. Situmbeko Musokotwane) as the Chairperson and the\nMinisters of Infrastructure (Charles Milupi), Commerce, Trade, and Industry\n(Chipoka Mulenga), Transport and Logistics (Frank Tayali), and Technology and\nScience (Felix Mutati). The focus of the council is to have public-private\npartnerships become the primary avenue for infrastructure development as\nopposed to the solely government funded path.\n\nMajor Public Private Partnership (PPP) Projects  Project  | Length  | Tender Bidding Process  | Expected Impact  | JV Partners  | Project Construction Start  | Project Completion  | Source\n---|---|---|---|---|---|---|---\nLusaka-Ndola Dual Carriageway | 327 km  | Closed  | Key connection of the Trans-African Highway network in particular the Trans-African Highway 4 **(TAH 4)** and the Trans-African Highway 9 **(TAH 9)** $650 million concession agreement. 25-yr deal with 3-yrs construction and 22-yrs operate toll gates and maintain road. Deal includes 45 km of the Luanshya-Fisenge-Masangano Road  | Macro-Ocean Investment Consortium Government of Zambia | Q3 2023 (August)  | Expected 2026  |\nMufulira-Mokambo road | 15 km  | Closed  | Improved Trade with the Democratic Republic of the Congo PPP was signed in November 2024 $56.7 million concession agreement 22-yr deal with 2-yrs construction and 20-yrs operate toll gate and maintain road. Deal includes construction of border post facilities at Mokambo.  | Jasworld Ports Limited Government of Zambia  | Expected Q1 2025  | Expected 2027  |\nNdola-Sakania-Mufulira road | 70 km  | Closed  | Improved Trade with the Democratic Republic of the Congo Improved Trade for Local Markets ZMW 1.64 billion kwacha (US$76.1 million) concession agreement to develop the 61 kilometers of the Mufulira-Sakania-Ndola road The concession is contracted to run for a period of 22 years, inclusive of the three years for construction  | Jaswin Ports Limited Government of Zambia  | 2024  | Expected 2026  |\nChingola - Kasumbalesa road | 35 km  | Closed  | Improved Trade with the Democratic Republic of the Congo Improved Trade for Local Markets Improved Trade for the SADC Region Expected cost ZMW 558 million kwacha (U$31 million)  | Turbo Ka-Chin Investment Consortia Government of Zambia | Q2 2022 (May)  | December 2023  |\nKatete-Chanida Border Post | 55 km  | Closed  | Improved Trade with Mozambique PPP signing was in October 2023 The 25 year Concession agreement worth ZMW 1.7 billion kwacha (US$79.8 million) was signed in October 2023. The concession duration included 2 years for construction and 23 years for operation and maintenance.  | Lutembwe Consulting Company Government of Zambia  | Q1 2024  | Expected Q4 2025  |\nLumwana-Kambimba Border Post  | 45 km  | Closed  | The road will connect Lumwana with Kolwezi in Democratic Republic of the Congo Improved Trade for the SADC Region Concession agreement signed Q3 2023 (September)  | Sandstone Consortium Government of Zambia  | Q4 2024  | TBA  |\nKasomeno-Kasenga-Chalwe-Kabila-Mwenda Road and Luapula River Bridge  | 182 km  | Closed  | Also known as the Kasomeno-Mwendo Toll Road (KMTR) Project is a critical trade link between Luapula province in Zambia and Lubumbashi in the DRC Will be a key connection into the Trans-African Highway network in particular the Trans-African Highway 4 **(TAH 4)** to Dar es Salaam, Tanzania | GED Africa Agence Congolaise des Grands Travaux (ACGT) Zambia Road Development Agency (RDA)  | Q3 2023 (October)  | TBA  |\nChingola-Solwezi-Mutanda road | 205 km  | Closed  | The 30 year Concession agreement worth US$250 million was signed in 2021.  | Bert Pave and Maintenance Limited Government of Zambia  | Q1 2022  | TBA  |\nMutanda-Kasempa-Kaoma road | 371 km  | Closed  | The 25 year Concession agreement worth US$326 million was signed in 2024.  | Barotse Highway Limited Government of Zambia  | Q1 2025  | Expected 2027  |\nSolwezi-Kipushi road  | 111 km  | Closed  | The 25 year Concession agreement worth US$145 million was signed in 2024.  | Borderway Capital Investments Government of Zambia  | Q1 2025  | Expected 2027  |",
    "openai_summarised_points": [
      "• In December 2021, Zambia's UPND Government established the Public-Private Partnership (PPP) Council of Ministers, chaired by the Minister of Finance and National Planning, Dr. Situmbeko Musokotwane, with members including the Ministers of Infrastructure (Charles Milupi), Commerce, Trade, and Industry (Chipoka Mulenga), Transport and Logistics (Frank Tayali), and Technology and Science (Felix Mutati).",
      "• The PPP Council's primary objective is to promote public-private partnerships as the main mechanism for infrastructure development in Zambia, shifting away from solely government-funded projects.",
      "• The Lusaka-Ndola Dual Carriageway project spans 327 km and is a key connection within the Trans-African Highway network, specifically linking Trans-African Highway 4 (TAH 4) and Trans-African Highway 9 (TAH 9). It involves a $650 million concession agreement over 25 years, including 3 years of construction and 22 years of toll operation and maintenance, covering also 45 km of the Luanshya-Fisenge-Masangano Road. The project is a joint venture between Macro-Ocean Investment Consortium and the Government of Zambia, with construction starting in Q3 2023 (August) and expected completion in 2026.",
      "• The Mufulira-Mokambo road project covers 15 km and aims to enhance trade with the Democratic Republic of the Congo (DRC). The PPP concession agreement, signed in November 2024, is valued at $56.7 million with a 22-year term comprising 2 years of construction and 20 years of toll operation and maintenance, including border post facilities at Mokambo. The project partners are Jasworld Ports Limited and the Government of Zambia, with construction expected to begin in Q1 2025 and completion in 2027.",
      "• The Ndola-Sakania-Mufulira road project extends 70 km and focuses on improving trade with the DRC and local markets. It involves a ZMW 1.64 billion (US$76.1 million) concession agreement for developing 61 km of the road, with a 22-year concession period including 3 years of construction. The project is contracted to Jaswin Ports Limited and the Government of Zambia, with construction starting in 2024 and expected completion in 2026.",
      "• The Chingola-Kasumbalesa road project covers 35 km and aims to improve trade with the DRC, local markets, and the Southern African Development Community (SADC) region. The project cost is ZMW 558 million (US$31 million), undertaken by Turbo Ka-Chin Investment Consortia and the Government of Zambia. Construction began in Q2 2022 (May) and is expected to be completed by December 2023.",
      "• The Katete-Chanida Border Post project spans 55 km and targets improved trade with Mozambique. The PPP concession agreement, signed in October 2023, is worth ZMW 1.7 billion (US$79.8 million) over 25 years, including 2 years for construction and 23 years for operation and maintenance. The project partners are Lutembwe Consulting Company and the Government of Zambia, with construction starting in Q1 2024 and expected completion in Q4 2025.",
      "• The Lumwana-Kambimba Border Post project covers 45 km and will connect Lumwana with Kolwezi in the DRC, enhancing trade within the SADC region. The concession agreement was signed in Q3 2023 (September) with Sandstone Consortium and the Government of Zambia as partners. Construction is scheduled to start in Q4 2024; completion date is to be announced.",
      "• The Kasomeno-Kasenga-Chalwe-Kabila-Mwenda Road and Luapula River Bridge project, also known as the Kasomeno-Mwendo Toll Road (KMTR), spans 182 km and serves as a critical trade link between Luapula province in Zambia and Lubumbashi in the DRC. It is a key connection to the Trans-African Highway network, particularly TAH 4 to Dar es Salaam, Tanzania. The project is a joint venture among GED Africa, Agence Congolaise des Grands Travaux (ACGT), and Zambia Road Development Agency (RDA). Construction began in Q3 2023 (October); completion date is to be announced.",
      "• The Chingola-Solwezi-Mutanda road project covers 205 km with a 30-year concession agreement valued at US$250 million, signed in 2021. The project partners are Bert Pave and Maintenance Limited and the Government of Zambia. Construction started in Q1 2022; completion date is to be announced.",
      "• The Mutanda-Kasempa-Kaoma road project extends 371 km with a 25-year concession agreement worth US$326 million, signed in 2024. The project is managed by Barotse Highway Limited and the Government of Zambia, with construction scheduled to start in Q1 2025 and expected completion in 2027.",
      "• The Solwezi-Kipushi road project covers 111 km and involves a 25-year concession agreement valued at US$145 million, signed in 2024. The project partners are Borderway Capital Investments and the Government of Zambia. Construction is planned to begin in Q1 2025, with expected completion in 2027."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:27.205950",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4239,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Constituency Development Funds Performance",
    "text": "Decentralized funds directed at enhancing public service delivery and targeted\nat local communities to spur economic development at ward and constituency\nlevel.\n\nTable below tracks the reported absorption of disbursed funds into the local communities Below 50% is red. Above 50% is green  Year  | Allocation  | Disbursed  | Absorption Rate  | Absorption Value  | Reporting Period  | Source\n---|---|---|---|---|---|---\n2022  | ZMW 4.0 billion (US$228.4 million)  | ZMW 4.0 billion (US$228.4 million)  | 55.0% | ZMW 2.2 billion  | 1 January 2022 - 31 December 2022  |\n2023  | ZMW 4.4 billion (US$278.7 million)  | ZMW 2.7 billion  | 60.0% | ZMW 1.3 billion  | 1 January 2023 - 31 December 2023  |\n2024  | ZMW 4.8 billion (US$228.1 million)  | N/A  | N/A  | N/A  | N/A  |\n2025  | ZMW 5.6 billion (US$212.1 million)  | N/A  | N/A  | N/A  | N/A  |",
    "openai_summarised_points": [
      "• Constituency Development Funds (CDFs) in Zambia are decentralized financial resources aimed at improving public service delivery and fostering economic development at the ward and constituency levels within local communities.",
      "• The performance of CDFs is measured by the absorption rate, which indicates the proportion of disbursed funds effectively utilized within the reporting period.",
      "• In 2022, the total allocation and disbursement of CDFs amounted to ZMW 4.0 billion (equivalent to US$228.4 million), with an absorption rate of 55.0%, translating to an absorption value of ZMW 2.2 billion; the reporting period covered was from 1 January 2022 to 31 December 2022.",
      "• For the year 2023, the allocation increased to ZMW 4.4 billion (US$278.7 million), but only ZMW 2.7 billion was disbursed; the absorption rate improved to 60.0%, with an absorption value of ZMW 1.3 billion, covering the same annual reporting period from 1 January 2023 to 31 December 2023.",
      "• Data for the years 2024 and 2025 indicate planned allocations of ZMW 4.8 billion (US$228.1 million) and ZMW 5.6 billion (US$212.1 million), respectively; however, disbursement, absorption rates, absorption values, and reporting periods for these years are not available (N/A).",
      "• The absorption rate threshold is visually coded: rates below 50% are marked in red, while rates above 50% are marked in green, highlighting the satisfactory absorption performance for 2022 and 2023."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:11.536744",
      "openai_model": "gpt-4.1-mini",
      "content_length": 842,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Zambia",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Private Wealth",
    "text": "In 2021, the total estimated value of private wealth in Zambia was US$14\nbillion (ZMW 238 billion)",
    "openai_summarised_points": [
      "• In 2021, the total estimated value of private wealth in Zambia was US$14 billion, equivalent to ZMW 238 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:32:12.261996",
      "openai_model": "gpt-4.1-mini",
      "content_length": 98,
      "bullet_points_count": 1
    }
  }
]