[
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of the Gambia** is heavily reliant on agriculture. The Gambia\nhas a mixed economy with a heavy reliance on agriculture, combined with\nrelatively weak centralized economic planning and government regulation.\nBefore 2017 the Gambia had a under Yahya Jammeh liberal, market-based economy\ncharacterised by traditional subsistence agriculture, a historic reliance on\ngroundnuts (peanuts) for export earnings, a re-export trade built up around\nits ocean port, low import duties, minimal administrative procedures, a\nfluctuating exchange rate with no exchange controls, and a significant tourism\nindustry. The Gambia also has no significant mineral or other natural\nresources, and has a limited agricultural base. About 75% of the population\ndepends on crops and livestock for its livelihood. Small-scale manufacturing\nactivity features the processing of peanuts, fish, and animal hides.\n\nShort-run economic progress remains highly dependent on foreign aid, and on\nresponsible government economic management as forwarded by International\nMonetary Fund technical help and advice.",
    "openai_summarised_points": [
      "• The economy of the Gambia is heavily reliant on agriculture, forming the cornerstone of its economic activities.",
      "• The Gambia operates a mixed economy characterized by a significant dependence on agriculture, alongside relatively weak centralized economic planning and limited government regulation.",
      "• Prior to 2017, under the leadership of Yahya Jammeh, the Gambia maintained a liberal, market-based economy marked by traditional subsistence agriculture and a historic reliance on groundnuts (peanuts) as the primary export earner.",
      "• The country’s economy included a re-export trade developed around its ocean port, benefiting from low import duties and minimal administrative procedures.",
      "• The Gambia experienced a fluctuating exchange rate system without exchange controls, facilitating trade and currency movement.",
      "• Tourism constituted a significant sector within the Gambian economy, contributing notably to economic activity and foreign exchange earnings.",
      "• The Gambia lacks significant mineral or other natural resources, and its agricultural base is limited in scope and diversity.",
      "• Approximately 75% of the Gambian population depends on crops and livestock for their livelihood, underscoring the importance of agriculture to the general population.",
      "• Small-scale manufacturing in the Gambia primarily involves the processing of peanuts, fish, and animal hides, reflecting the country’s agricultural and natural resource outputs.",
      "• Short-term economic progress in the Gambia remains highly dependent on foreign aid, highlighting the country’s reliance on external financial support.",
      "• Responsible government economic management, supported by technical assistance and advice from the International Monetary Fund (IMF), is critical for sustaining economic development in the Gambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:04.041221",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1085,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Current GDP per capita Archived 2012-05-04 at the Wayback Machine of the\nGambia registered a peak growth of 23.3% in the 1970s. Economic growth slowed\nby 8.30% in the 1980s and a further 5.20% in the 1990s.\n\nRe-export trade normally constitutes a major segment of economic activity, but\nthe 50% devaluation of the CFA franc in January 1994 made Senegalese goods\nmore competitive and hurt the re-export trade. The Gambia has benefited from a\nrebound in tourism after its decline in response to the military's takeover in\nJuly 1994. Lately, Indian global health expert Dr Edmond Fernandes stated that\nGambia presents a global investment opportunity and dissected various areas of\nbusiness interests.",
    "openai_summarised_points": [
      "• The Gambia's current GDP per capita experienced a peak growth rate of 23.3% during the 1970s, indicating a period of significant economic expansion.",
      "• Economic growth in The Gambia decelerated by 8.30% in the 1980s, reflecting a notable slowdown compared to the previous decade.",
      "• Further economic contraction occurred in the 1990s, with growth declining by an additional 5.20%, marking continued economic challenges.",
      "• Re-export trade has traditionally been a major component of The Gambia's economic activity, playing a crucial role in its trade dynamics.",
      "• In January 1994, the 50% devaluation of the CFA franc adversely affected The Gambia’s re-export trade by making Senegalese goods more competitively priced, thereby undermining The Gambia’s market position.",
      "• The Gambia's tourism sector experienced a decline following the military takeover in July 1994, which negatively impacted visitor numbers and related economic benefits.",
      "• Subsequently, the tourism industry in The Gambia has seen a rebound, contributing positively to the country's economic recovery.",
      "• Indian global health expert Dr. Edmond Fernandes identified The Gambia as a global investment opportunity, highlighting various sectors and areas of business interest for potential investors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:05.199053",
      "openai_model": "gpt-4.1-mini",
      "content_length": 697,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Macro-economic trend",
    "text": "This is a chart of trend of gross domestic product of Gambia at market prices\nestimated by the International Monetary Fund with figures in millions of\nDalasi (currency used in Gambia).\n\nYear | Gross Domestic Product | US dollar exchange | Inflation index (2000=100)\n---|---|---|---\n1980 | 435 | 1.71 Dalasi | 13\n1985 | 782 | 4.09 Dalasi | 25\n1990 | 2,367 | 8.13 Dalasi | 65\n1995 | 3,617 | 9.49 Dalasi | 90\n2000 | 5,382 | 12.78 Dalasi | 100\n2005 | 13,174 | 28.70 Dalasi | 158\n\nFor purchasing power parity comparisons, the US dollar is exchanged at 4.35\nDalasi only.\n\nThe Gambia's economy is characterized by traditional subsistence agriculture,\na historic reliance on peanuts or groundnuts for export earnings, a re-export\ntrade built up around its ocean port, low import duties, minimal\nadministrative procedures, a fluctuating exchange rate with no exchange\ncontrols, and a significant tourism industry. Average wages in 2007 hover\naround $1–2 per day.",
    "openai_summarised_points": [
      "• The International Monetary Fund (IMF) provides estimates of the Gambia's gross domestic product (GDP) at market prices, expressed in millions of Dalasi, the national currency of the Gambia.",
      "• In 1980, the Gambia's GDP was 435 million Dalasi, with a US dollar exchange rate of 1.71 Dalasi per US dollar, and an inflation index of 13 (base year 2000=100).",
      "• By 1985, the GDP increased to 782 million Dalasi, the US dollar exchange rate depreciated to 4.09 Dalasi per US dollar, and the inflation index rose to 25.",
      "• In 1990, the GDP reached 2,367 million Dalasi, the exchange rate further depreciated to 8.13 Dalasi per US dollar, and the inflation index increased to 65.",
      "• The year 1995 saw the GDP grow to 3,617 million Dalasi, with the exchange rate at 9.49 Dalasi per US dollar and the inflation index at 90.",
      "• In 2000, the GDP was 5,382 million Dalasi, the exchange rate stood at 12.78 Dalasi per US dollar, and the inflation index was normalized at 100.",
      "• By 2005, the GDP had significantly increased to 13,174 million Dalasi, the exchange rate depreciated to 28.70 Dalasi per US dollar, and the inflation index rose to 158.",
      "• For purchasing power parity (PPP) comparisons, the US dollar is exchanged at a fixed rate of 4.35 Dalasi, which differs from the market exchange rates listed.",
      "• The Gambian economy is predominantly based on traditional subsistence agriculture, with a historical dependence on peanuts (groundnuts) as the main export commodity generating foreign exchange earnings.",
      "• The economy also features a re-export trade centered around the Gambia’s ocean port, benefiting from low import duties and minimal administrative procedures.",
      "• The exchange rate regime is characterized by fluctuations with no exchange controls imposed by the government.",
      "• The tourism sector constitutes a significant component of the Gambian economy, contributing to foreign exchange and employment.",
      "• Average daily wages in the Gambia around 2007 were approximately between US$1 and US$2, reflecting low income levels in the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:05.272530",
      "openai_model": "gpt-4.1-mini",
      "content_length": 953,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "Agriculture accounts for 23% of gross domestic product (GDP) and employs 75%\nof the labor force. Within agriculture, peanut production accounts for 5.3% of\nGDP, other crops 8.3%, livestock 4.4%, fishing 1.8%, and forestry 0.5%.",
    "openai_summarised_points": [
      "• Agriculture constitutes 23% of the Gambia's gross domestic product (GDP), reflecting its significant role in the national economy.",
      "• The agricultural sector employs 75% of the Gambia's labor force, indicating its importance as a primary source of employment.",
      "• Within the agricultural sector, peanut production contributes 5.3% to the overall GDP, highlighting peanuts as a key crop.",
      "• Other crops collectively account for 8.3% of the GDP, representing a diverse range of agricultural produce beyond peanuts.",
      "• Livestock farming contributes 4.4% to the GDP, underscoring the role of animal husbandry in the agricultural economy.",
      "• Fishing activities add 1.8% to the GDP, reflecting the significance of aquatic resources in the sector.",
      "• Forestry contributes 0.5% to the GDP, indicating a smaller but notable component of the agricultural economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:00.046851",
      "openai_model": "gpt-4.1-mini",
      "content_length": 227,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Industry",
    "text": "Industry accounts for 12% of GDP. Manufacturing accounts for 6% of GDP. The\nlimited amount of manufacturing is primarily agriculturally based (e.g.,\npeanut processing, bakeries, a brewery, and a tannery). Other manufacturing\nactivities include soap, soft drinks, and clothing. Services account for 19%\nof GDP.",
    "openai_summarised_points": [
      "• Industry contributes 12% to the Gross Domestic Product (GDP) of The Gambia.",
      "• Manufacturing represents 6% of The Gambia's GDP, indicating a modest industrial base within the economy.",
      "• The manufacturing sector in The Gambia is predominantly agriculturally based, with key activities including peanut processing, bakeries, a brewery, and a tannery.",
      "• Additional manufacturing activities in The Gambia encompass the production of soap, soft drinks, and clothing.",
      "• The services sector accounts for 19% of The Gambia's GDP, reflecting its role in the national economy alongside industry and manufacturing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:13:59.224605",
      "openai_model": "gpt-4.1-mini",
      "content_length": 309,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Tourism",
    "text": "Tourism in Gambia has three major strands. There is the traditional sun\nseeking holiday making use of the hot climate and wonderful beaches. The\nGambia is also usually the first African destination for many European\nbirders, due to its easily accessed and spectacular avian fauna. There are\nalso a significant number of African Americans tracing their roots in this\ncountry, from which many Africans were taken during the slave trade. While not\nthat many American slaves came from Gambia it was made popular by Alex Haleys\nhistoric novel and TV miniseries Roots: The Saga of an American Family\n\nThe tourist season is the dry season, during the Northern Hemisphere winter.",
    "openai_summarised_points": [
      "• Tourism in The Gambia comprises three primary components: traditional sun-seeking holidays capitalizing on the country's hot climate and attractive beaches, birdwatching tourism driven by The Gambia's accessible and remarkable avian fauna, and heritage tourism involving African Americans tracing their ancestral roots linked to the transatlantic slave trade.",
      "• The Gambia is often the first African destination for many European birders due to its easily accessible and spectacular bird species, making avian tourism a significant attraction.",
      "• A notable segment of tourists includes African Americans exploring their heritage, as The Gambia was a departure point for some Africans taken during the slave trade, although relatively few American slaves originated from The Gambia.",
      "• The popularity of The Gambia among African American tourists was significantly enhanced by Alex Haley’s historic novel and television miniseries \"Roots: The Saga of an American Family,\" which highlighted the country’s role in the slave trade.",
      "• The peak tourist season in The Gambia coincides with the dry season, which occurs during the Northern Hemisphere winter months, attracting visitors seeking favorable weather conditions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:02.400211",
      "openai_model": "gpt-4.1-mini",
      "content_length": 671,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Trade",
    "text": "In 2020 The Gambia's major export markets were Senegal, Mali, Guinea-Bissau,\nIndia and China, accounting for 84% of all exports. Neighboring Senegal\naccounted for 50.5% of exports. This contrasted with 1999 when the UK and\nother EU countries were The Gambia's major domestic export markets, accounting\nfor 86% of all exports.\n\nIn 2020 Norway, China, Cote d'Ivoire, Brazil and Turkey were the major sources\nof imports, accounting for 49% of the total. This contrasted with 1999 when\nthe UK and other EU countries were the major sources of imports, accounting\nfor 60% of all imports.",
    "openai_summarised_points": [
      "• In 2020, The Gambia's principal export markets were Senegal, Mali, Guinea-Bissau, India, and China, collectively accounting for 84% of the country's total exports.",
      "• Among these, neighboring Senegal was the dominant export destination, representing 50.5% of The Gambia's exports in 2020.",
      "• This export pattern in 2020 marked a significant shift from 1999, when the United Kingdom and other European Union countries were the primary export markets for The Gambia, comprising 86% of all exports at that time.",
      "• Regarding imports in 2020, the major source countries for The Gambia were Norway, China, Côte d'Ivoire, Brazil, and Turkey, together accounting for 49% of total imports.",
      "• This import composition in 2020 contrasted with the situation in 1999, when the United Kingdom and other European Union countries were the dominant sources of imports, making up 60% of all imports to The Gambia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:03.624104",
      "openai_model": "gpt-4.1-mini",
      "content_length": 581,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the Gambia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( January 2017)__(Learn how and when to remove this message)_\n---|---\n\n**GDP:**\n\n_purchasing power parity_ $2.264 billion (2008 est.)\n_real growth rate:_ 5.5% (2019 est.)\n_per capita:_ purchasing power parity - $1,300 (2008 est.)\n_composition by sector:_\n\n_agriculture:_ 33%\n_industry:_ 8.7%\n_services:_ 58.3% (2008 est.)\n\n**Inflation rate (consumer prices):** 6.5% (2019 est.)\n\n**Labor force:** 400,000\n\n**Labor force - by occupation:** agriculture 75%, industry, commerce, and\nservices 19%, government 6%\n\n**Budget:**\n\n_revenues:_ $88.6 million\n_expenditures:_ $98.2 million, including capital expenditures of $ (Not Available) (FY96/97 est.)\n\n**Industries:** processing peanuts, fish, and hides; tourism; beverages;\nagricultural machinery assembly, woodworking, metalworking; clothing\n\n**Electricity**\n\n_production:_ 75 GWh, entirely from fossil fuels (1998)\n_consumption:_ 70 GWh (1998)\n_Electricity is not imported or exported from the Gambia._\n\n**Agriculture - products:** peanuts, pearl millet, sorghum, rice, maize,\ncassava (tapioca), palm kernels; cattle, sheep, goats; forest and fishery\nresources not fully exploited.\n\n**Exports:** $132 million (f.o.b., 1998)\n\n_commodities:_ peanuts and peanut products, fish, cotton lint, palm kernels.\n_partners:_ Benelux 78%, Japan, United Kingdom, Hong Kong, France, Spain (1997)\n\n**Imports:** $201 million (f.o.b., 1998)\n\n_commodities:_ foodstuffs, manufactures, fuel, machinery and transport equipment.\n_partners:_ Hong Kong, United Kingdom, Netherlands, Ivory Coast, France, Senegal, Belgium (1997)\n\n**Debt - external:** $430 million (1997 est.)\n\n**Economic aid - recipient:** $45.400 million (1995)\n\n**Currency:** Dalasi (D)\n\n**Exchange rates:** dalasi (D) per US$1 – 43.860 (January 2017), 11.626\n(November 1999), 10.643 (1998), 10.200 (1997), 9.789 (1996), 9.546 (1995)\n\n**Fiscal year:** 1 July - 30 June",
    "openai_summarised_points": [
      "• The Gambia's GDP based on purchasing power parity was estimated at $2.264 billion in 2008.",
      "• The real GDP growth rate was estimated at 5.5% in 2019.",
      "• GDP per capita based on purchasing power parity was approximately $1,300 in 2008.",
      "• The composition of GDP by sector in 2008 was 33% agriculture, 8.7% industry, and 58.3% services.",
      "• The inflation rate, measured by consumer prices, was estimated at 6.5% in 2019.",
      "• The labor force in The Gambia consisted of approximately 400,000 individuals.",
      "• Labor force distribution by occupation was 75% in agriculture, 19% in industry, commerce, and services, and 6% in government.",
      "• The national budget for fiscal year 1996/97 showed revenues of $88.6 million and expenditures of $98.2 million, including unspecified capital expenditures.",
      "• Key industries included processing of peanuts, fish, and hides; tourism; production of beverages; assembly of agricultural machinery; woodworking; metalworking; and clothing manufacturing.",
      "• Electricity production in 1998 was 75 GWh, generated entirely from fossil fuels, with consumption at 70 GWh; The Gambia neither imported nor exported electricity.",
      "• Agricultural products comprised peanuts, pearl millet, sorghum, rice, maize, cassava (tapioca), palm kernels, and livestock such as cattle, sheep, and goats; forest and fishery resources were noted as not fully exploited.",
      "• Exports in 1998 were valued at $132 million (f.o.b.), primarily consisting of peanuts and peanut products, fish, cotton lint, and palm kernels.",
      "• Major export partners in 1997 included Benelux countries (78%), Japan, the United Kingdom, Hong Kong, France, and Spain.",
      "• Imports in 1998 totaled $201 million (f.o.b.), including foodstuffs, manufactured goods, fuel, machinery, and transport equipment.",
      "• Principal import partners in 1997 were Hong Kong, the United Kingdom, the Netherlands, Ivory Coast, France, Senegal, and Belgium.",
      "• External debt was estimated at $430 million in 1997.",
      "• The Gambia received economic aid amounting to $45.4 million in 1995.",
      "• The national currency is the Dalasi (D).",
      "• Exchange rates of the Dalasi per US dollar were 43.860 in January 2017, 11.626 in November 1999, 10.643 in 1998, 10.200 in 1997, 9.789 in 1996, and 9.546 in 1995.",
      "• The fiscal year in The Gambia runs from 1 July to 30 June."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:10.694140",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2029,
      "bullet_points_count": 20
    }
  }
]