[
  {
    "chapter_name": "Economy of Chad",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. _( February 2023)_  \n---|---  \n| This article was **imported from the CIA's _World Factbook_**. Please help\nrewrite this article.  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nThe **economy of Chad** suffers from the landlocked country's geographic\nremoteness, drought, lack of infrastructure, and political turmoil. About 80%\nof the population depends on subsistence agriculture, including livestock\nherding. Of Africa's Francophone countries, Chad benefited least from the 50%\ndevaluation of their currencies in January 1994. Financial aid from the World\nBank, the African Development Bank, and other sources is directed mainly at\nimproving agriculture, especially livestock production. Because of a lack of\nfinancing, the development of oil fields near Doba, originally due to finish\nin 2000, was delayed until 2003. It was finally developed and is now operated\nby ExxonMobil. until 2023 Regarding gross domestic product, Chad ranks 147th\nglobally with $11.051 billion as of 2018.",
    "openai_summarised_points": [
      "• The economy of Chad is significantly impacted by its geographic remoteness due to being a landlocked country, which contributes to economic challenges.",
      "• Chad's economy is also affected by recurrent droughts, inadequate infrastructure, and ongoing political turmoil.",
      "• Approximately 80% of Chad's population relies on subsistence agriculture, including livestock herding, for their livelihood.",
      "• Among Africa's Francophone countries, Chad benefited the least from the 50% devaluation of their currencies that occurred in January 1994.",
      "• International financial aid from organizations such as the World Bank and the African Development Bank is primarily targeted at improving agricultural productivity, with a particular focus on livestock production.",
      "• The development of oil fields near Doba was delayed due to a lack of financing; initially scheduled for completion in 2000, the project was postponed until 2003.",
      "• The Doba oil fields were eventually developed and are operated by ExxonMobil, with operations continuing until at least 2023.",
      "• As of 2018, Chad's gross domestic product (GDP) was valued at $11.051 billion, ranking it 147th globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:04:59.372867",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1295,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Chad's economy is profoundly influenced by its geographic position as a landlocked country, which imposes significant logistical and economic constraints. The absence of direct access to the sea complicates trade and increases transportation costs, thereby limiting the country's ability to efficiently import and export goods. This geographic remoteness has historically hindered economic integration with regional and global markets, contributing to persistent challenges in economic development. Moreover, the country's vast and often inhospitable terrain exacerbates these difficulties, making infrastructure development both costly and complex. In addition to geographic constraints, Chad's economy has been adversely affected by recurrent droughts that periodically devastate agricultural output and livestock herding, which form the backbone of the rural economy. These droughts, often linked to broader climatic variability in the Sahel region, lead to food insecurity and undermine the livelihoods of the majority of the population. The lack of adequate infrastructure—including roads, storage facilities, and irrigation systems—further limits agricultural productivity and market access. Political instability and ongoing turmoil have compounded these economic difficulties by disrupting governance, discouraging investment, and diverting resources away from development initiatives. Subsistence agriculture remains the primary source of livelihood for approximately 80% of Chad's population, reflecting the country's predominantly rural demographic profile. This sector encompasses both crop cultivation and livestock herding, with many households relying on traditional farming methods and pastoralism to meet their daily needs. The reliance on subsistence agriculture underscores the limited diversification of the economy and highlights the vulnerability of the population to environmental shocks and market fluctuations. Livestock herding, in particular, plays a critical role in the cultural and economic life of many communities, serving as a source of food, income, and social status. In the broader context of Francophone Africa, Chad experienced unique economic repercussions following the significant devaluation of the CFA franc in January 1994. The currency was devalued by 50% in an effort to restore competitiveness and stimulate economic growth across member countries. However, among these nations, Chad derived the least benefit from this monetary adjustment. The anticipated positive effects, such as increased export competitiveness and improved trade balances, were mitigated by the country's structural weaknesses, including limited production capacity and persistent political instability. Consequently, the devaluation did not translate into the expected economic revitalization for Chad, leaving its economy relatively stagnant in the years that followed. International financial assistance has played a crucial role in supporting Chad's development efforts, particularly in the agricultural sector. Organizations such as the World Bank and the African Development Bank have directed substantial aid towards improving agricultural productivity, with a special emphasis on enhancing livestock production. These initiatives aim to modernize farming practices, introduce better animal husbandry techniques, and develop value chains that can increase income for rural populations. By focusing on livestock, which is integral to the livelihoods of many Chadians, these programs seek to bolster food security and stimulate rural economic growth. Despite these efforts, progress has been uneven due to ongoing challenges related to infrastructure, governance, and environmental conditions. One of the most significant developments in Chad's recent economic history has been the exploitation of oil resources, particularly the development of oil fields near Doba. This project represented a major opportunity to diversify the economy and generate substantial revenue. However, the development of these oil fields was delayed due to difficulties in securing adequate financing. Initially, the completion of the oil extraction infrastructure was scheduled for the year 2000, but financial constraints and logistical challenges postponed the project until 2003. This delay slowed the anticipated influx of oil revenues and the associated economic benefits, prolonging the country's dependence on traditional sectors such as agriculture. Eventually, the Doba oil fields were successfully developed and have been operated by ExxonMobil, a major multinational oil corporation with extensive experience in African oil production. The involvement of ExxonMobil brought technical expertise and investment capital necessary to bring the project to fruition. Operations at the Doba fields have continued steadily, contributing to Chad's export earnings and government revenues. As of 2023, ExxonMobil maintained its operational presence in the region, underscoring the long-term significance of oil production for the country's economy. The revenue generated from oil has provided opportunities for infrastructure development and public spending, although challenges remain in ensuring that these benefits are broadly shared across the population. By 2018, Chad's gross domestic product (GDP) was valued at approximately $11.051 billion, positioning it as the 147th largest economy in the world. This ranking reflects the country's modest economic size relative to global standards, consistent with its status as a low-income nation facing numerous development hurdles. The GDP figure encapsulates the combined output of all goods and services produced within Chad, including agriculture, industry, and services. While the oil sector has contributed to GDP growth in recent years, the economy remains heavily reliant on subsistence agriculture and vulnerable to external shocks. The GDP ranking highlights the ongoing need for economic diversification and structural reforms to promote sustainable development and improve living standards for the Chadian population.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:24:02.020832",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 6082,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Chad",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "Chad produced in 2023:\n\n* 878 thousand tons of sorghum;\n* 782 thousand tons of groundnuts;\n* 634 thousand tons of millet;\n* 552 thousand tons of cereal;\n* 469 thousand tonnes of yam (8th largest producer in the world);\n* 454 thousand tons of sugarcane;\n* 354 thousand tons of maize;\n* 288 thousand tons of cassava;\n* 224 thousand tons of rice;\n* 218 thousand tons of sweet potato;\n* 210 thousand tons of sesame seed;\n* 150 thousand tons of beans;\n* 165 thousand 480-lb bales of cotton;\n\nIn addition to smaller productions of other agricultural products.",
    "openai_summarised_points": [
      "• In 2023, Chad produced approximately 878,000 tons of sorghum, making it a significant staple crop for the country.",
      "• The country’s groundnut production reached about 782,000 tons in 2023, contributing to both domestic consumption and export potential.",
      "• Millet production in Chad was approximately 634,000 tons in 2023, serving as an essential food source for the population.",
      "• Total cereal production in Chad was around 552,000 tons in 2023, encompassing various cereal grains vital for national food security.",
      "• Chad produced approximately 469,000 tons of yams in 2023, ranking it as the 8th largest producer globally in this crop.",
      "• Sugarcane production in Chad amounted to about 454,000 tons in 2023, supporting local sugar industries and consumption.",
      "• Maize production was approximately 354,000 tons in 2023, serving as a key cereal crop for the country’s diet and economy.",
      "• The country produced around 288,000 tons of cassava in 2023, a crucial root crop for both food and industrial uses.",
      "• Rice production in Chad was approximately 224,000 tons in 2023, contributing to domestic food supply and market needs.",
      "• Sweet potato production reached about 218,000 tons in 2023, adding to the diversity of root and tuber crops cultivated.",
      "• Sesame seed production was approximately 210,000 tons in 2023, indicating its importance as an export crop and source of income.",
      "• Beans were produced at a level of about 150,000 tons in 2023, serving as an important legume for nutrition and agriculture.",
      "• Cotton production was quantified at 165,480 480-lb bales in 2023, reflecting its role as a major cash crop for Chad’s economy.",
      "• Besides these major crops, Chad also produced smaller quantities of various other agricultural products, contributing to the country’s diverse agricultural sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:05:06.824330",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 553,
      "bullet_points_count": 14
    },
    "generated_detailed_content": "In 2023, Chad's agricultural sector demonstrated considerable productivity across a range of staple and cash crops, reflecting the country's reliance on agriculture for food security and economic development. Sorghum emerged as a particularly significant staple, with production reaching approximately 878,000 tons. This cereal grain has long been a central component of the Chadian diet, especially in arid and semi-arid regions where its drought-resistant qualities make it well-suited to local climatic conditions. The substantial output of sorghum not only underpinned domestic food consumption but also supported rural livelihoods and local markets. Groundnut production also played a vital role in Chad's agricultural landscape, with approximately 782,000 tons harvested in 2023. Groundnuts, or peanuts, have been cultivated extensively due to their adaptability to various soil types and their importance as both a food source and an export commodity. The high volume of groundnut production contributed to nutritional needs through the provision of protein and oil, while simultaneously offering opportunities for income generation through export markets, which are critical for the country’s foreign exchange earnings. Millet, another essential cereal crop, accounted for about 634,000 tons of production in 2023. Millet has traditionally been a staple food in Chad, particularly in regions where rainfall is limited, as it thrives under harsh environmental conditions. Its importance extends beyond mere caloric intake; millet is culturally significant and features prominently in local cuisines. The crop’s resilience to drought and poor soils has ensured its continued cultivation, thereby maintaining its role in food security for many Chadian communities. Total cereal production in Chad, encompassing sorghum, millet, maize, rice, and other grains, amounted to around 552,000 tons in 2023. Cereals are fundamental to the Chadian diet and agricultural economy, providing the bulk of caloric intake for the population. The aggregate cereal output reflects the combined efforts of subsistence farmers and commercial producers, highlighting the sector's contribution to national food security. These cereals are cultivated across diverse agro-ecological zones, adapting to varying climatic and soil conditions, which helps to stabilize food supplies despite periodic climatic challenges. Yam production in Chad reached approximately 469,000 tons in 2023, positioning the country as the eighth largest global producer of this root crop. Yams are a critical source of carbohydrates and are widely consumed in various forms across the country. Their cultivation is predominantly concentrated in the southern and central regions, where soil fertility and rainfall patterns are conducive to tuber development. The prominence of yam production underscores its importance not only for food security but also for cultural practices and local economies, as yams are often featured in traditional ceremonies and markets. Sugarcane production totaled about 454,000 tons in 2023, supporting Chad’s local sugar industries and contributing to domestic consumption. Sugarcane cultivation is primarily concentrated in irrigated areas and along river valleys, where water availability permits its growth. The crop’s role extends beyond direct consumption; it underpins agro-industrial activities such as sugar refining, which provides employment and stimulates economic activity in the processing sector. The development of sugarcane farming has been part of broader efforts to diversify agricultural production and reduce dependence on imported sugar. Maize production in Chad was approximately 354,000 tons in 2023, marking it as a key cereal crop within the country’s agricultural portfolio. Maize cultivation has expanded in recent decades due to its relatively high yields and versatility in food preparation. It is consumed in various forms, including porridge and bread, and serves as an important source of calories and nutrients. The crop is grown in multiple agro-ecological zones, benefiting from both rainfed and irrigated agriculture, which enhances its availability throughout the year. Cassava production reached around 288,000 tons in 2023, highlighting its role as a crucial root crop for food and industrial uses. Cassava is valued for its ability to grow in poor soils and withstand drought conditions, making it a reliable food source during periods of climatic stress. It is processed into various products such as flour and starch, which are used in both household consumption and commercial applications. The crop’s adaptability and multiple uses have made it an integral part of the agricultural system, particularly in regions where other crops may fail. Rice production in Chad was approximately 224,000 tons in 2023, contributing significantly to domestic food supply and market needs. Rice cultivation has been promoted in irrigated lowland areas and floodplains, where water management allows for higher yields compared to rainfed systems. The increasing production of rice reflects efforts to diversify staple foods and reduce reliance on imports, which have historically been necessary to meet growing demand. Rice has become an important component of urban diets and is gaining popularity in rural areas as well. Sweet potato production reached about 218,000 tons in 2023, adding to the diversity of root and tuber crops cultivated in Chad. Sweet potatoes are valued for their nutritional content, including vitamins and dietary fiber, and their ability to grow in a range of soil types. They are often grown by smallholder farmers as a subsistence crop, providing food security and contributing to dietary diversity. The crop’s relatively short growing cycle allows for multiple harvests within a year, which helps to stabilize food availability. Sesame seed production was approximately 210,000 tons in 2023, underscoring its importance as an export crop and source of income for many farmers. Sesame cultivation has expanded due to growing international demand for its oil and seeds, which are used in food products and cosmetics. The crop thrives in semi-arid conditions and requires relatively low inputs, making it attractive to small-scale producers. Sesame exports contribute to foreign exchange earnings and support rural economies, particularly in regions where other cash crops are less viable. Beans were produced at a level of about 150,000 tons in 2023, serving as an important legume for nutrition and agriculture. Beans provide a valuable source of protein and essential nutrients, complementing cereal-based diets. They also play a role in soil fertility through nitrogen fixation, which benefits subsequent crops in rotation systems. Bean cultivation is widespread across Chad, with farmers growing various varieties adapted to local conditions, thereby enhancing food security and agricultural sustainability. Cotton production was quantified at 165,480 480-pound bales in 2023, reflecting its role as a major cash crop for Chad’s economy. Cotton has historically been one of the country’s principal export commodities, generating significant revenue and employment. The crop is predominantly grown in the southern regions, where climatic conditions favor its growth. Despite challenges such as price volatility and pest pressures, cotton remains a cornerstone of Chad’s agricultural export sector, with efforts ongoing to improve yields and processing capabilities. In addition to these major crops, Chad produced smaller quantities of various other agricultural products, contributing to the country’s diverse agricultural sector. These include fruits, vegetables, spices, and other legumes that support local diets and markets. The diversity of agricultural production reflects the varied agro-ecological zones within the country and the adaptive strategies employed by farmers to manage climatic variability and market demands. This multiplicity of crops enhances resilience and provides multiple sources of income and nutrition for rural populations.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:24:10.376244",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 14,
      "generated_content_length": 8100,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Chad",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Macro-economic trend",
    "text": "The following table shows the leading economic indicators from 1980 to 2024.\n\nYear  | GDP (in bn. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bn. US$ nominal)  | GDP Growth\n(real)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---\n1980  | 2.3  | 498  | 1.0  | -6.0%  | n/a\n1985  | 3.6  | 704  | 1.3  | 7.9%  | n/a\n1990  | 5.2  | 872  | 2.5  | 3.2%  | n/a\n1995  | 6.8  | 970  | 2.2  | -0.8%  | n/a\n2000  | 8.4  | 1,005  | 2.1  | -0.9%  | 49.9%\n2005  | 18.9  | 1,875  | 9.1  | 8.3%  | 20.9%\n2006  | 19.8  | 1,898  | 10.2  | 1.7%  | 19.0%\n2007  | 21.2  | 1,957  | 12.0  | 3.9%  | 16.0%\n2008  | 22.5  | 2,008  | 14.4  | 4.0%  | 14.6%\n2009  | 23.3  | 2,011  | 13.0  | 2.9%  | 22.6%\n2010  | 26.0  | 2,175  | 14.3  | 10.5%  | 22.5%\n2011  | 26.9  | 2,174  | 16.2  | 1.3%  | 22.9%\n2012  | 29.3  | 2,290  | 16.2  | 6.9%  | 22.1%\n2013  | 31.4  | 2,379  | 16.9  | 5.6%  | 23.5%\n2014  | 34.0  | 2,485  | 18.2  | 6.1%  | 29.4%\n2015  | 34.7  | 2,462  | 14.5  | 1.4%  | 32.1%\n2016  | 32.9  | 2,256  | 13.4  | -6.3%  | 38.1%\n2017  | 32.8  | 2,182  | 13.3  | -2.0%  | 36.8%\n2018  | 36.0  | 2,325  | 15.3  | 5.9%  | 33.3%\n2019  | 39.3  | 2,462  | 14.9  | 6.6%  | 38.0%\n2020  | 36.8  | 2,240  | 14.6  | -2.1%  | 41.2%\n2021  | 41.0  | 2,422  | 15.9  | -0.9%  | 42.4%\n2022  | 45.5  | 2,612  | 16.3  | 3.6%  | 34.5%\n2023  | 49.4  | 2,758  | 17.6  | 4.9%  | 32.7%\n2024  | 52.2  | 2,832  | 18.7  | 3.2%  | 31.5%",
    "openai_summarised_points": [
      "• The table presents leading economic indicators for Chad from 1980 to 2024, illustrating trends in GDP, GDP per capita, GDP in nominal terms, real GDP growth, and government debt as a percentage of GDP.",
      "• In 1980, Chad's GDP was valued at 2.3 billion US dollars (PPP), with a GDP per capita of 498 US dollars (PPP), and a nominal GDP of 1.0 billion US dollars, experiencing a significant negative real growth rate of -6.0%, with government debt data not available.",
      "• By 1985, Chad's GDP increased to 3.6 billion US dollars (PPP), with GDP per capita rising to 704 US dollars (PPP), and nominal GDP reaching 1.3 billion US dollars, experiencing a positive real growth of 7.9%; government debt data remains unavailable.",
      "• In 1990, GDP further grew to 5.2 billion US dollars (PPP), with GDP per capita at 872 US dollars (PPP), and nominal GDP at 2.5 billion US dollars, with a modest real growth rate of 3.2%; government debt data not provided.",
      "• The 1995 data shows GDP at 6.8 billion US dollars (PPP), GDP per capita at 970 US dollars (PPP), and nominal GDP at 2.2 billion US dollars, with a slight negative real growth of -0.8%; government debt data remains unavailable.",
      "• In 2000, Chad's GDP reached 8.4 billion US dollars (PPP), with GDP per capita at 1,005 US dollars (PPP), and nominal GDP at 2.1 billion US dollars, experiencing a negative real growth of -0.9%; government debt was 49.9% of GDP.",
      "• The period from 2005 to 2008 shows rapid economic growth: in 2005, GDP was 18.9 billion US dollars (PPP), GDP per capita was 1,875 US dollars (PPP), and nominal GDP was 9.1 billion US dollars, with an 8.3% real growth and government debt at 20.9%; in 2006, GDP increased to 19.8 billion US dollars, with a slight real growth of 1.7%, government debt at 19.0%; in 2007, GDP reached 21.2 billion US dollars, with 3.9% real growth, debt at 16.0%; and in 2008, GDP was 22.5 billion US dollars, with 4.0% growth, debt at 14.6%.",
      "• The 2009 data indicates GDP of 23.3 billion US dollars (PPP), with a 2.9% real growth rate, and government debt at 22.6%; nominal GDP was 13.0 billion US dollars.",
      "• From 2010 to 2014, Chad experienced robust growth: in 2010, GDP was 26.0 billion US dollars (PPP), with a 10.5% growth rate and government debt at 22.5%; in 2011, GDP increased slightly to 26.9 billion US dollars, with 1.3% growth; in 2012, GDP reached 29.3 billion US dollars with 6.9% growth; in 2013, GDP was 31.4 billion US dollars with 5.6% growth; and in 2014, GDP was 34.0 billion US dollars, with a 6.1% growth rate and government debt at 29.4%.",
      "• During 2015, GDP was 34.7 billion US dollars (PPP), with a slight growth of 1.4%, and government debt increased to 32.1%; nominal GDP was 14.5 billion US dollars.",
      "• In 2016, GDP declined to 32.9 billion US dollars, with a negative growth of -6.3%, and government debt rose to 38.1%; GDP per capita decreased to 2,256 US dollars (PPP).",
      "• The 2017 data shows a slight decrease in GDP to 32.8 billion US dollars, with a -2.0% growth rate, and government debt at 36.8%; GDP per capita was 2,182 US dollars (PPP).",
      "• In 2018, GDP increased to 36.0 billion US dollars, with a 5.9% growth rate, and government debt at 33.3%; GDP per capita rose to 2,325 US dollars (PPP).",
      "• The 2019 figures indicate GDP of 39.3 billion US dollars, with a 6.6% growth rate, and government debt at 38.0%; GDP per capita was 2,462 US dollars (PPP).",
      "• In 2020, GDP slightly decreased to 36.8 billion US dollars, with a negative growth of -2.1%, and government debt increased to 41.2%; GDP per capita was 2,240 US dollars (PPP).",
      "• The 2021 data shows GDP rebounding to 41.0 billion US dollars, with a marginal negative growth of -0.9%, and government debt at 42.4%; GDP per capita increased to 2,422 US dollars (PPP).",
      "• In 2022, Chad's GDP grew to 45.5 billion US dollars, with a positive growth of 3.6%, and government debt decreased to 34.5%; GDP per capita reached 2,612 US dollars (PPP).",
      "• The 2023 data reports GDP at 49.4 billion US dollars, with a 4.9% growth rate, and government debt at 32.7%; GDP per capita increased to 2,758 US dollars (PPP).",
      "• For 2024, GDP is projected at 52.2 billion US dollars, with a 3.2% growth rate, and government debt at 31.5%; GDP per capita is expected to reach 2,832 US dollars (PPP)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:05:18.746208",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1405,
      "bullet_points_count": 19
    },
    "generated_detailed_content": "The economic trajectory of Chad from 1980 through 2024 is characterized by significant fluctuations in gross domestic product (GDP), GDP per capita, nominal GDP, real GDP growth rates, and government debt as a percentage of GDP, reflecting the nation’s evolving macroeconomic landscape. In 1980, Chad's GDP was valued at 2.3 billion US dollars on a purchasing power parity (PPP) basis, with a GDP per capita of 498 US dollars (PPP), while the nominal GDP stood at 1.0 billion US dollars. The economy experienced a sharp contraction that year, with a real GDP growth rate of -6.0%, indicative of substantial economic challenges. Data on government debt for this period is unavailable, which limits a comprehensive understanding of fiscal pressures during this early stage. By 1985, Chad's economy showed signs of recovery and expansion, as GDP increased to 3.6 billion US dollars (PPP), and GDP per capita rose to 704 US dollars (PPP), signaling improved economic conditions for the average citizen. The nominal GDP also grew to 1.3 billion US dollars, reflecting both real growth and inflationary effects. The real GDP growth rate was a robust 7.9%, marking a significant turnaround from the negative growth experienced five years earlier. However, government debt data remained unavailable, obscuring the fiscal context of this growth phase. The upward trend continued into 1990, with GDP reaching 5.2 billion US dollars (PPP) and GDP per capita climbing to 872 US dollars (PPP). Nominal GDP more than doubled from 1985 levels to 2.5 billion US dollars, illustrating both real economic expansion and currency valuation effects. The real GDP growth rate moderated to 3.2%, suggesting a period of steady but less volatile economic progress. Government debt data was still not provided, leaving gaps in the fiscal narrative. In 1995, Chad's GDP further increased to 6.8 billion US dollars (PPP), with GDP per capita reaching 970 US dollars (PPP), indicating continued growth in economic output and individual prosperity. However, nominal GDP decreased slightly to 2.2 billion US dollars, which may reflect currency depreciation or other macroeconomic factors. The real GDP growth rate turned slightly negative at -0.8%, signaling a contraction or stagnation in economic activity despite the higher GDP figures in PPP terms. Government debt data remained unavailable, continuing the trend of limited fiscal transparency during this period. Entering the new millennium, Chad's GDP was recorded at 8.4 billion US dollars (PPP) in 2000, with GDP per capita marginally surpassing the 1,000 US dollar mark at 1,005 US dollars (PPP). Nominal GDP was 2.1 billion US dollars, slightly lower than in 1995, which may reflect exchange rate fluctuations or inflationary pressures. The real GDP growth rate was negative again at -0.9%, indicating economic contraction. Notably, this year marks the first availability of government debt data, which stood at 49.9% of GDP, suggesting a relatively high debt burden that could have constrained economic growth. The period from 2005 to 2008 witnessed rapid economic expansion in Chad, driven in part by increased oil production and investment. In 2005, GDP surged to 18.9 billion US dollars (PPP), with GDP per capita rising to 1,875 US dollars (PPP), nearly doubling from 2000 levels. Nominal GDP also increased substantially to 9.1 billion US dollars. The real GDP growth rate was a strong 8.3%, reflecting robust economic activity, while government debt fell to 20.9% of GDP, indicating improved fiscal management or debt restructuring. The following year, 2006, saw GDP increase further to 19.8 billion US dollars, but real growth slowed to 1.7%, and government debt decreased slightly to 19.0%. In 2007, GDP reached 21.2 billion US dollars, with real growth accelerating to 3.9%, and government debt declining to 16.0%, continuing the trend of economic strengthening and fiscal consolidation. By 2008, GDP had grown to 22.5 billion US dollars, with a real growth rate of 4.0%, and government debt further reduced to 14.6%, highlighting a period of sustained economic expansion and improved debt sustainability. In 2009, Chad's GDP reached 23.3 billion US dollars (PPP), with a nominal GDP of 13.0 billion US dollars. The real GDP growth rate moderated to 2.9%, reflecting the global economic slowdown following the 2008 financial crisis. Government debt increased to 22.6% of GDP, suggesting some fiscal pressures amid the slower growth environment. From 2010 through 2014, Chad experienced a phase of robust economic growth, largely fueled by oil revenues and increased government spending. In 2010, GDP rose to 26.0 billion US dollars (PPP), accompanied by an impressive real growth rate of 10.5%, indicating a booming economy. Government debt remained relatively stable at 22.5% of GDP, suggesting manageable fiscal conditions. In 2011, GDP increased slightly to 26.9 billion US dollars, though real growth slowed significantly to 1.3%, reflecting possible economic adjustments or external shocks. The following year, 2012, saw GDP climb to 29.3 billion US dollars, with real growth rebounding to 6.9%, demonstrating renewed economic momentum. In 2013, GDP reached 31.4 billion US dollars, with a real growth rate of 5.6%, maintaining a positive trajectory. By 2014, GDP had expanded further to 34.0 billion US dollars, with a 6.1% growth rate, while government debt increased to 29.4% of GDP, indicating a gradual rise in fiscal liabilities amid ongoing economic expansion. In 2015, Chad's GDP stood at 34.7 billion US dollars (PPP), with real growth slowing to 1.4%, signaling a significant deceleration in economic activity. Government debt increased to 32.1% of GDP, reflecting rising fiscal pressures. Nominal GDP was recorded at 14.5 billion US dollars, illustrating the continued impact of currency and price level changes on economic measurements. The year 2016 marked a downturn in Chad's economic fortunes, with GDP declining to 32.9 billion US dollars (PPP) and a negative real growth rate of -6.3%, indicating a sharp contraction likely influenced by falling oil prices and internal challenges. Government debt rose substantially to 38.1% of GDP, suggesting increased borrowing or fiscal strain. GDP per capita decreased to 2,256 US dollars (PPP), reflecting the adverse impact of the economic slowdown on individual income levels. In 2017, the economic contraction persisted but at a reduced pace, with GDP slightly decreasing to 32.8 billion US dollars and a real growth rate of -2.0%. Government debt remained elevated at 36.8% of GDP, while GDP per capita declined further to 2,182 US dollars (PPP), underscoring ongoing economic difficulties. The economy rebounded in 2018, as GDP increased to 36.0 billion US dollars (PPP), supported by a real growth rate of 5.9%. Government debt decreased to 33.3% of GDP, indicating some fiscal improvement. GDP per capita rose to 2,325 US dollars (PPP), signaling enhanced average economic well-being. In 2019, Chad's GDP expanded further to 39.3 billion US dollars (PPP), with a real growth rate of 6.6%, reflecting strong economic performance. Government debt increased to 38.0% of GDP, suggesting renewed fiscal pressures. GDP per capita grew to 2,462 US dollars (PPP), continuing the trend of rising individual income levels. The global economic disruptions of 2020 affected Chad, with GDP slightly decreasing to 36.8 billion US dollars (PPP) and a negative real growth rate of -2.1%. Government debt rose to 41.2% of GDP, indicating increased borrowing or fiscal challenges. GDP per capita declined to 2,240 US dollars (PPP), reflecting the broader economic impact. In 2021, Chad's GDP rebounded to 41.0 billion US dollars (PPP), although real growth remained marginally negative at -0.9%, suggesting a fragile recovery. Government debt increased further to 42.4% of GDP, highlighting ongoing fiscal concerns. GDP per capita improved to 2,422 US dollars (PPP), indicating some restoration of individual economic conditions. The year 2022 saw renewed economic growth, with GDP rising to 45.5 billion US dollars (PPP) and a positive real growth rate of 3.6%. Government debt decreased significantly to 34.5% of GDP, reflecting improved fiscal management or debt reduction efforts. GDP per capita reached 2,612 US dollars (PPP), marking continued progress in economic well-being. In 2023, Chad's GDP further increased to 49.4 billion US dollars (PPP), accompanied by a real growth rate of 4.9%, indicating sustained economic expansion. Government debt declined to 32.7% of GDP, reinforcing the trend of fiscal consolidation. GDP per capita rose to 2,758 US dollars (PPP), reflecting ongoing improvements in average income levels. Projections for 2024 estimate Chad's GDP at 52.2 billion US dollars (PPP), with a real growth rate of 3.2%, suggesting continued but moderated economic growth. Government debt is expected to decrease slightly to 31.5% of GDP, indicating further fiscal stabilization. GDP per capita is anticipated to reach 2,832 US dollars (PPP), continuing the upward trend in individual economic prosperity.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:24:09.773180",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 19,
      "generated_content_length": 9116,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Chad",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Other statistics",
    "text": "Treemap of exports in 2019\n\n**GDP:** purchasing power parity – $28.62 billion (2017 est.)\n\n**GDP – real growth rate:** -3.1% (2017 est.)\n\n**GDP – per capita:** $2,300 (2017 est.)\n\n**Gross national saving:** 15.5% of GDP (2017 est.)\n\n**GDP – composition by sector:**\n_agriculture:_ 52.3% (2017 est.)\n_industry:_ 14.7% (2017 est.)\n_services:_ 33.1% (2017 est.)\n\n**Population below poverty line::** 46.7% (2011 est.)\n\n**Distribution of family income – Gini index:** 43.3 (2011 est.)\n\n**Inflation rate (consumer prices):** -0.9% (2017 est.)\n\n**Labor force:** 5.654 million (2017 est.)\n\n**Labor force – by occupation:** agriculture 80%, industry and services 20%\n(2006 est.)\n\n**Budget:**\n_revenues:_ 1.337 billion (2017 est.)\n_expenditures:_ 1.481 billion (2017 est.)\n\n**Budget surplus (+) or deficit (-):** -1.5% (of GDP) (2017 est.)\n\n**Public debt:** 52.5% of GDP (2017 est.)\n\n**Industries:** oil, cotton textiles, brewing, natron (sodium carbonate),\nsoap, cigarettes, construction materials\n\n**Industrial production growth rate:** -4% (2017 est.)\n\n**electrification:** total population: 4% (2013)\n\n**electrification:** urban areas: 14% (2013)\n\n**electrification:** rural areas: 1% (2013)\n\n**Electricity – production:** 224.3 million kWh (2016 est.)\n\n**Electricity – production by source:**\n_fossil fuel:_ ~98%\n_hydro:_ 0%\n_nuclear:_ 0%\n_other renewable:_ ~3% (2017)\n\n**Electricity – consumption:** 208.6 million kWh (2016 est.)\n\n**Electricity – exports:** 0 kWh (2016 est.)\n\n**Electricity – imports:** 0 kWh (2016 est.)\n\n**Agriculture – products:** cotton, sorghum, millet, peanuts, sesame, corn,\nrice, potatoes, onions, cassava (manioc, tapioca), cattle, sheep, goats,\ncamels\n\n**Exports:** $2.464 billion (2017 est.)\n\n**Exports – commodities:** oil, livestock, cotton, sesame, gum arabic, shea\nbutter\n\n**Exports – partners:** US 38.7%, China 16.6%, Netherlands 15.7%, UAE 12.2%,\nIndia 6.3% (2017)\n\n**Imports:** $2.16 billion (2017 est.)\n\n**Imports – commodities:** machinery and transportation equipment, industrial\ngoods, foodstuffs, textiles\n\n**Imports – partners:** China 19.9%, Cameroon 17.2%, France 17%, US 5.4%,\nIndia 4.9%, Senegal 4.5% (2017)\n\n**Debt – external:** $1.724 billion (31 December 2017 est.)\n\n**Reserves of foreign exchange and gold:** $22.9 million (31 December 2017\nest.)",
    "openai_summarised_points": [
      "• The treemap of Chad's exports in 2019 is referenced but not detailed in the provided content.",
      "• Chad's Gross Domestic Product (GDP) based on purchasing power parity was estimated at $28.62 billion in 2017.",
      "• The real GDP growth rate in 2017 was -3.1%, indicating economic contraction during that year.",
      "• GDP per capita in 2017 was approximately $2,300, reflecting the average economic output per person.",
      "• Gross national saving as a percentage of GDP was 15.5% in 2017, indicating the proportion of income saved rather than consumed.",
      "• The sectoral composition of GDP in 2017 was: agriculture at 52.3%, industry at 14.7%, and services at 33.1%.",
      "• As of 2011, approximately 46.7% of Chad's population was living below the poverty line.",
      "• The Gini index for income distribution in 2011 was 43.3, suggesting a moderate level of income inequality.",
      "• Consumer price inflation in 2017 was recorded at -0.9%, indicating deflation.",
      "• Chad's labor force in 2017 comprised approximately 5.654 million individuals.",
      "• In 2006, employment by occupation was estimated at 80% in agriculture and 20% in industry and services.",
      "• The government’s revenue in 2017 was approximately $1.337 billion, while expenditures totaled about $1.481 billion.",
      "• The budget deficit in 2017 was -1.5% of GDP, indicating a shortfall between revenues and expenditures.",
      "• Public debt in 2017 was 52.5% of GDP, reflecting the country's debt level relative to its economic output.",
      "• Key industries in Chad include oil, cotton textiles, brewing, natron (sodium carbonate), soap, cigarettes, and construction materials.",
      "• Industrial production experienced a decline of 4% in 2017.",
      "• Electrification coverage was minimal: total population at 4%, urban areas at 14%, and rural areas at 1% in 2013.",
      "• Electricity production in 2016 was approximately 224.3 million kWh.",
      "• Electricity generation sources in 2017 were predominantly fossil fuels (~98%), with renewable sources (~3%) and no hydro or nuclear energy.",
      "• Electricity consumption in 2016 was about 208.6 million kWh; exports and imports of electricity were zero in 2016.",
      "• Chad's agricultural products include cotton, sorghum, millet, peanuts, sesame, corn, rice, potatoes, onions, cassava (manioc, tapioca), and livestock such as cattle, sheep, goats, and camels.",
      "• Total exports in 2017 were valued at $2.464 billion.",
      "• Main export commodities include oil, livestock, cotton, sesame, gum arabic, and shea butter.",
      "• Export partner countries in 2017 were the US (38.7%), China (16.6%), Netherlands (15.7%), UAE (12.2%), and India (6.3%).",
      "• Total imports in 2017 amounted to $2.16 billion.",
      "• Major import commodities are machinery and transportation equipment, industrial goods, foodstuffs, and textiles.",
      "• Import partner countries in 2017 included China (19.9%), Cameroon (17.2%), France (17%), US (5.4%), India (4.9%), and Senegal (4.5%).",
      "• External debt as of 31 December 2017 was approximately $1.724 billion.",
      "• Reserves of foreign exchange and gold stood at $22.9 million as of 31 December 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:05:32.222326",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2292,
      "bullet_points_count": 29
    },
    "generated_detailed_content": "In 2019, Chad's export profile was visually represented through a treemap, illustrating the relative proportions of various commodities contributing to the country's export economy, although specific details of the composition were not delineated in the available data. The nation's Gross Domestic Product (GDP) measured by purchasing power parity (PPP) was estimated at $28.62 billion in 2017, reflecting the total economic output adjusted for price level differences relative to other countries. Despite this sizeable GDP, Chad experienced an economic contraction during the same year, with the real GDP growth rate recorded at -3.1%, indicating a decline in economic activity compared to the previous year. This negative growth rate underscored challenges within the economy, including fluctuations in key sectors and external economic pressures. The GDP per capita in 2017 was approximately $2,300, representing the average economic output per individual and providing a measure of the standard of living and economic productivity on a per-person basis. This figure, while modest, contextualizes the economic conditions faced by the population. Gross national saving, which indicates the portion of national income that is saved rather than consumed, stood at 15.5% of GDP in 2017. This level of saving reflects the capacity for investment and economic resilience, though it also suggests limitations in domestic capital accumulation. Examining the sectoral composition of Chad's GDP in 2017 reveals a predominantly agrarian economy, with agriculture accounting for 52.3% of GDP. This dominance highlights the critical role of farming and livestock in the country's economic structure. Industry contributed 14.7% to GDP, encompassing manufacturing, mining, and construction activities, while the services sector made up 33.1%, including trade, transportation, and public administration. The substantial share of agriculture underscores the reliance on subsistence and commercial farming, whereas the relatively smaller industrial sector points to limited diversification and industrialization. Poverty remained a significant issue, with approximately 46.7% of the population living below the poverty line as of 2011. This high poverty rate reflects widespread socioeconomic challenges, including limited access to basic services, education, and employment opportunities. Income inequality was moderate, as indicated by a Gini index of 43.3 in 2011, suggesting disparities in income distribution but not among the most extreme globally. Such inequality can impact social cohesion and economic development prospects. Consumer price inflation in 2017 was recorded at -0.9%, indicating a deflationary environment where the general price level of goods and services decreased slightly. Deflation can have mixed effects, potentially increasing the purchasing power of consumers but also signaling weak demand and economic stagnation. The labor force in 2017 consisted of approximately 5.654 million individuals, representing the segment of the population actively engaged or seeking employment. Employment distribution data from 2006 estimated that 80% of the workforce was employed in agriculture, reflecting the sector’s dominance in providing livelihoods, while the remaining 20% were engaged in industry and services. This distribution highlights the limited industrial and service sector employment opportunities relative to agriculture. Government finances in 2017 showed revenues of approximately $1.337 billion against expenditures totaling about $1.481 billion, resulting in a budget deficit equivalent to -1.5% of GDP. This fiscal shortfall indicated that government spending exceeded income, necessitating borrowing or other financing methods to cover the gap. Public debt stood at 52.5% of GDP in 2017, reflecting the total government debt relative to the size of the economy. This level of indebtedness suggests a moderate debt burden, with implications for fiscal sustainability and the capacity to finance development projects. Chad’s key industries encompass oil production, cotton textiles, brewing, natron (sodium carbonate) extraction, soap manufacturing, cigarette production, and the fabrication of construction materials. The oil sector, in particular, has been a significant contributor to export revenues and government income since the early 2000s. However, industrial production overall experienced a decline of 4% in 2017, signaling challenges such as reduced output, investment constraints, or external market conditions affecting industrial activity. Electrification coverage remained minimal as of 2013, with only 4% of the total population having access to electricity. Urban areas had slightly higher coverage at 14%, whereas rural electrification was extremely limited at just 1%. This stark disparity between urban and rural areas underscores infrastructural deficits and the challenges of extending energy services to remote regions. Electricity production in 2016 amounted to approximately 224.3 million kilowatt-hours (kWh), with consumption slightly lower at about 208.6 million kWh, indicating a modest surplus in generation capacity. There were no recorded exports or imports of electricity in 2016, highlighting a self-contained electricity market without cross-border energy trade. The sources of electricity generation in 2017 were predominantly fossil fuels, accounting for roughly 98% of total production. Renewable energy sources contributed about 3%, while there was no generation from hydroelectric or nuclear power. This heavy reliance on fossil fuels reflects limited diversification of energy sources and potential vulnerabilities to fuel supply and price fluctuations, as well as environmental considerations. Agriculture in Chad is diverse, with key products including cotton, sorghum, millet, peanuts, sesame, corn, rice, potatoes, onions, and cassava (also known as manioc or tapioca). Livestock farming is also significant, with cattle, sheep, goats, and camels being raised extensively. These agricultural activities form the backbone of rural livelihoods and contribute substantially to food security and export earnings. In 2017, Chad’s total exports were valued at $2.464 billion. The main export commodities included oil, which dominated the export portfolio, followed by livestock, cotton, sesame, gum arabic, and shea butter. These products reflect both the natural resource base and agricultural strengths of the country. The principal export partner countries in 2017 were the United States, accounting for 38.7% of exports, followed by China at 16.6%, the Netherlands at 15.7%, the United Arab Emirates at 12.2%, and India at 6.3%. This distribution illustrates Chad’s integration into global markets and the geographic diversity of its trade relationships. Total imports in 2017 amounted to $2.16 billion, with major import commodities including machinery and transportation equipment, industrial goods, foodstuffs, and textiles. These imports are essential for supporting domestic production, infrastructure development, and consumer needs. The main import partner countries were China, supplying 19.9% of imports, Cameroon at 17.2%, France at 17%, the United States at 5.4%, India at 4.9%, and Senegal at 4.5%. This array of trading partners reflects Chad’s economic ties with both regional neighbors and major global economies. External debt as of 31 December 2017 was approximately $1.724 billion, representing the total amount of debt owed to foreign creditors. This external indebtedness has implications for debt servicing obligations and financial stability. Foreign exchange and gold reserves stood at $22.9 million as of the same date, indicating the level of reserves available to support the national currency and meet international payment obligations. These reserves are relatively low, suggesting limited buffers against external shocks.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:24:08.867629",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 29,
      "generated_content_length": 7917,
      "generation_type": "detailed_expansion"
    }
  }
]