[
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Real GPD per capita development in Costa Rica\n\nThe **economy ofCosta Rica** has been very stable for some years now, with\ncontinuing growth in the GDP (Gross Domestic Product) and moderate inflation,\nthough with a high unemployment rate: 11.49% in 2019. Costa Rica's economy\nemerged from recession in 1997 and has shown strong aggregate growth since\nthen. The estimated GDP for 2023 is US$90 billion, up significantly from the\nUS$52.6 billion in 2015 while the estimated 2024 per capita (purchasing power\nparity) is US$28,558.\n\nInflation remained around 4% to 5% per annum for several years up to 2015 but\nthen dropped to 0.7% in 2016; it was expected to rise to a still moderate 2.8%\nby the end of 2017 In 2017, Costa Rica had the highest standards of living in\nCentral America in spite of the high poverty level. The poverty level dropped\nby 1.2% in 2017 to 20.5%, thanks to reducing inflation and benefits offered by\nthe government. The estimated unemployment level in 2017 was 8.1%, roughly the\nsame as in 2016.\n\nThe country has evolved from an economy that once depended solely on\nagriculture, to one that is more diverse, based on tourism, electronics and\nmedical components exports, medical manufacturing and IT services. Corporate\nservices for foreign companies employ some 3% of the workforce. Of the GDP,\n5.5% is generated by agriculture, 18.6% by industry and 75.9% by services\n(2016). Agriculture employs 12.9% of the labor force, industry 18.57%,\nservices 69.02% (2016) Many foreign companies operate in the various Free-\ntrade zones. In 2015, exports totalled US$12.6 billion while imports totalled\nUS$15 billion for a trade deficit of US$2.39 billion.\n\nThe growing debt and budget deficit are the country's primary concerns. By\nAugust 2017, Costa Rica was having difficulty paying its obligations and the\nPresident promised dramatic changes to handle the \"liquidity crisis\". Other\nchallenges face Costa Rica in its attempts to increase the economy by foreign\ninvestment. They include a poor infrastructure and a need to improve public\nsector efficiency.",
    "openai_summarised_points": [
      "• The economy of Costa Rica has maintained stability over recent years, characterized by continuous growth in Gross Domestic Product (GDP) and moderate inflation rates.",
      "• Despite economic stability, Costa Rica experienced a high unemployment rate of 11.49% in 2019.",
      "• The country’s economy emerged from a recession in 1997 and has demonstrated strong aggregate growth since that year.",
      "• The estimated GDP for 2023 is approximately US$90 billion, representing a significant increase from US$52.6 billion in 2015.",
      "• The projected 2024 per capita income, measured by purchasing power parity (PPP), is estimated at US$28,558.",
      "• Inflation rates remained around 4% to 5% annually up to 2015 but declined sharply to 0.7% in 2016.",
      "• Inflation was forecasted to rise modestly to 2.8% by the end of 2017.",
      "• In 2017, Costa Rica had the highest standards of living in Central America, despite persistent high poverty levels.",
      "• The poverty rate decreased by 1.2 percentage points in 2017, reaching 20.5%, attributed to reduced inflation and government benefits.",
      "• The estimated unemployment rate in 2017 was 8.1%, roughly unchanged from 2016.",
      "• The Costa Rican economy transitioned from reliance solely on agriculture to a more diversified structure, emphasizing tourism, electronics and medical component exports, medical manufacturing, and IT services.",
      "• Corporate services for foreign companies account for approximately 3% of the national workforce.",
      "• The composition of GDP in 2016 was approximately 5.5% from agriculture, 18.6% from industry, and 75.9% from services.",
      "• Labor force employment distribution in 2016 was about 12.9% in agriculture, 18.57% in industry, and 69.02% in services.",
      "• Many foreign companies operate within Costa Rica’s free-trade zones, facilitating international trade and investment.",
      "• In 2015, Costa Rica’s exports totaled US$12.6 billion, while imports reached US$15 billion, resulting in a trade deficit of US$2.39 billion.",
      "• The country’s primary economic challenges include growing public debt and a widening budget deficit; by August 2017, Costa Rica faced difficulties in meeting its financial obligations.",
      "• The President of Costa Rica in 2017 pledged to implement significant reforms to address the liquidity crisis.",
      "• Additional economic challenges involve poor infrastructure and the necessity to improve efficiency within the public sector to attract more foreign investment."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:16.181486",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2068,
      "bullet_points_count": 19
    },
    "generated_detailed_content": "The economy of Costa Rica has demonstrated notable stability over recent years, marked by continuous growth in its Gross Domestic Product (GDP) alongside moderate inflation rates. This steady expansion reflects the country’s ability to maintain economic equilibrium despite various internal and external pressures. However, this stability coexisted with a relatively high unemployment rate, which stood at 11.49% in 2019, indicating persistent challenges in the labor market despite overall economic progress. The unemployment figure underscored structural issues within the economy that limited job creation, even as other macroeconomic indicators improved. Costa Rica’s economic trajectory experienced a significant turning point following a recession in 1997. After this downturn, the country embarked on a path of strong aggregate growth, recovering steadily and expanding its economic output over the subsequent decades. This recovery was driven by diversification efforts and structural reforms that allowed the economy to move beyond its traditional agricultural base. By 2023, the estimated GDP had reached approximately US$90 billion, a substantial increase from US$52.6 billion recorded in 2015. This near doubling of GDP within eight years highlighted the country’s robust economic momentum and its success in attracting investment and expanding productive sectors. In terms of income levels, the projected per capita income for 2024, measured by purchasing power parity (PPP), was estimated at US$28,558. This figure illustrated a significant improvement in the average standard of living and purchasing capacity of Costa Rican residents, reflecting both economic growth and inflation control. Inflation rates in the country had historically hovered around 4% to 5% annually up to 2015, which is consistent with moderate inflation conducive to economic stability. Notably, inflation declined sharply to 0.7% in 2016, signaling a period of price stability that benefited consumers and businesses alike. Following this decline, inflation was forecasted to rise modestly to 2.8% by the end of 2017, suggesting a controlled return to more typical inflationary levels without jeopardizing economic stability. By 2017, Costa Rica had achieved the highest standards of living in Central America, a status that was remarkable given the region’s diverse economic conditions. This achievement was underscored by improvements in various social and economic indicators, although the country still faced persistent high poverty levels. The poverty rate decreased by 1.2 percentage points in 2017, reaching 20.5%. This reduction was attributed largely to the combined effects of lower inflation and targeted government benefits aimed at vulnerable populations. Despite these gains, poverty remained a significant challenge, reflecting ongoing inequalities and the need for inclusive growth strategies. The estimated unemployment rate in 2017 was 8.1%, which was roughly unchanged from the previous year, 2016. This stability in unemployment figures suggested that while the economy was growing, job creation was not accelerating sufficiently to reduce unemployment significantly. The labor market dynamics pointed to structural issues, including skills mismatches and limited opportunities in certain sectors, which constrained employment growth despite overall economic expansion. Costa Rica’s economy underwent a substantial transformation from its historical reliance solely on agriculture to a more diversified structure. This shift involved an increased emphasis on sectors such as tourism, electronics and medical component exports, medical manufacturing, and information technology (IT) services. Tourism became a major contributor to economic activity due to Costa Rica’s rich biodiversity and eco-tourism appeal, attracting millions of visitors annually. Meanwhile, the electronics and medical manufacturing sectors grew rapidly, supported by foreign direct investment and the establishment of multinational companies within the country’s free-trade zones. The IT services sector also expanded, leveraging Costa Rica’s educated workforce and favorable business environment to provide corporate services and technology solutions. Corporate services for foreign companies accounted for approximately 3% of the national workforce, reflecting the growing role of Costa Rica as a hub for international business operations and outsourcing. This segment of the economy benefited from the country’s strategic location, political stability, and investment incentives, which attracted multinational corporations seeking to establish regional headquarters or service centers. The composition of GDP in 2016 illustrated the diversified nature of the Costa Rican economy, with agriculture contributing approximately 5.5%, industry accounting for 18.6%, and services comprising the largest share at 75.9%. This distribution highlighted the shift away from traditional agriculture towards a service-oriented economy, supported by industrial activities related to manufacturing and export processing. Correspondingly, labor force employment distribution in 2016 showed about 12.9% of workers employed in agriculture, 18.57% in industry, and 69.02% in services. The disparity between GDP contribution and employment figures in agriculture reflected productivity differences, with agriculture employing a significant portion of the workforce but generating a smaller share of economic output. Many foreign companies operated within Costa Rica’s free-trade zones, which played a crucial role in facilitating international trade and investment. These zones offered tax incentives, streamlined customs procedures, and infrastructure support to attract export-oriented businesses. The presence of multinational corporations within these zones contributed significantly to export growth, technology transfer, and employment generation, reinforcing Costa Rica’s integration into the global economy. In 2015, Costa Rica’s exports totaled US$12.6 billion, while imports reached US$15 billion, resulting in a trade deficit of US$2.39 billion. This trade imbalance indicated that the country imported more goods and services than it exported, a situation influenced by factors such as domestic demand for capital goods, consumer products, and energy inputs. The trade deficit underscored the importance of maintaining competitive export sectors and diversifying the economy to reduce reliance on imports and improve the balance of payments. Despite these positive developments, Costa Rica faced significant economic challenges, including growing public debt and a widening budget deficit. By August 2017, the country encountered difficulties in meeting its financial obligations, signaling fiscal stress and the need for prudent economic management. The increasing public debt raised concerns about long-term sustainability and the capacity of the government to finance social programs and infrastructure investments without compromising fiscal stability. In response to the liquidity crisis, the President of Costa Rica in 2017 pledged to implement significant reforms aimed at restoring fiscal balance and improving the country’s economic outlook. These reforms included measures to enhance revenue collection, control public spending, and promote efficiency within the public sector. The government’s commitment to reform was viewed as essential for regaining investor confidence and ensuring sustainable economic growth. Additional economic challenges involved poor infrastructure, which constrained productivity and competitiveness across various sectors. The need to upgrade transportation networks, energy systems, and telecommunications infrastructure was critical to supporting economic expansion and attracting further foreign investment. Moreover, improving efficiency within the public sector was recognized as necessary to create a more conducive business environment, reduce bureaucratic obstacles, and enhance the delivery of public services. Addressing these structural issues was seen as vital for Costa Rica to maintain its economic stability and continue progressing toward higher standards of living.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:21.897945",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 19,
      "generated_content_length": 8199,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Public debt and deficit",
    "text": "One of the country's major concerns is the level of the public debt,\nespecially as a percentage of the GDP (Gross Domestic Product), increasing\nfrom 29.8% in 2011 to 40.8% in 2015 and to 45% in 2016. The total debt in 2015\nwas $22.648 billion, up by nearly $3 billion from 2014. On a per capita basis,\nthe debt was $4,711 per person. Costa Rica had a formal line of credit with\nthe World Bank valued at US$947 million in April 2014, of which US$645 million\nhad been accessed and US$600 million remained outstanding.\n\nIn a June 2017 report, the International Monetary Fund stated that annual\ngrowth was just over 4% with moderate inflation. The report added that\n\"financial system appears sound, and credit growth continues to be consistent\nwith healthy financial deepening and macroeconomic trends. The agency noted\nthat the fiscal deficit remains high and public debt continues to rise rapidly\ndespite the authorities’ deepened consolidation efforts in 2016. Recent\nadvances in fiscal consolidation have been partly reversed and political\nconsensus on a comprehensive fiscal package remains elusive\".\n\nThe IMF also expressed concern about increasing deficits, public debt and the\nheavy dollarization of bank assets and liabilities, warning that in tighter-\nthan-expected global financial conditions these aspects would \"seriously\nundermine investor confidence\". The group also recommended taking steps to\nreduce pension benefits and increase the amount of contribution by the public\nand increasing the cost effectiveness of the education system.\n\nThe country's credit rating was reduced by Moody's Investors Service in early\n2017 to Ba2 from Ba1, with a negative outlook on the rating. The agency\nparticularly cited the \"rising government debt burden and persistently high\nfiscal deficit, which was 5.2% of GDP in 2016\". Moody's was also concerned\nabout the \"lack of political consensus to implement measures to reduce the\nfiscal deficit [which] will result in further pressure on the government's\ndebt ratios\". In late July 2017, the Central Bank estimated the budget deficit\nat 6.1 percent of the country's GDP. A 2017 study by the Organisation for\nEconomic Co-operation and Development warned that reducing the foreign debt\nmust be a very high priority for the government. Other fiscal reforms were\nalso recommended to moderate the budget deficit.\n\nIn 2014, President Solís presented a budget with an increase in spending of\n19% for 2015, an increase of 0.5% for 2016 and an increase of 12% for 2017.\nWhen the 2017 budget was finally proposed, it totaled US$15.9 billion. Debt\npayments account for one-third of that amount. Of greater concern is the fact\nthat a full 46% of the budget will require financing, a step that will\nincrease the debt owed to foreign entities. In late July 2017, the Central\nBank estimated the budget deficit at 6.1 percent of the country's GDP.",
    "openai_summarised_points": [
      "• One of Costa Rica’s major economic concerns is the level of public debt, particularly as a percentage of GDP, which increased from 29.8% in 2011 to 40.8% in 2015 and further to 45% in 2016.",
      "• The total public debt in 2015 was valued at $22.648 billion, representing an increase of nearly $3 billion compared to 2014.",
      "• On a per capita basis, Costa Rica’s public debt was $4,711 per person in 2015.",
      "• Costa Rica maintained a formal line of credit with the World Bank valued at US$947 million as of April 2014, of which US$645 million had been accessed, leaving US$600 million outstanding.",
      "• The International Monetary Fund (IMF) reported in June 2017 that Costa Rica’s annual growth rate was just over 4%, with moderate inflation.",
      "• The IMF noted that the financial system appeared sound, with credit growth consistent with healthy financial deepening and macroeconomic trends.",
      "• Despite efforts, the IMF highlighted that the fiscal deficit remained high and public debt continued to rise rapidly, even after deepened fiscal consolidation efforts in 2016.",
      "• The IMF observed that recent fiscal consolidation advances had been partly reversed and that political consensus on a comprehensive fiscal package remained elusive.",
      "• The IMF expressed concern over increasing deficits, rising public debt, and the heavy dollarization of bank assets and liabilities, warning that tighter global financial conditions could seriously undermine investor confidence.",
      "• The IMF recommended measures including reducing pension benefits, increasing contributions from the public, and improving the cost-effectiveness of the education system.",
      "• Moody’s Investors Service downgraded Costa Rica’s credit rating in early 2017 from Ba1 to Ba2, with a negative outlook, citing rising government debt and a persistently high fiscal deficit of 5.2% of GDP in 2016.",
      "• Moody’s expressed concern about the lack of political consensus to implement measures to reduce the fiscal deficit, which could further pressure government debt ratios.",
      "• In late July 2017, the Central Bank estimated Costa Rica’s budget deficit at 6.1% of GDP.",
      "• The 2017 OECD study emphasized that reducing foreign debt should be a top priority for the government and recommended additional fiscal reforms to moderate the budget deficit.",
      "• In 2014, President Solís proposed a budget increase of 19% for 2015, 0.5% for 2016, and 12% for 2017.",
      "• The final proposed 2017 budget totaled US$15.9 billion, with debt payments accounting for one-third of the total.",
      "• A significant 46% of the 2017 budget required financing, which would increase foreign debt obligations.",
      "• The Central Bank’s July 2017 estimate placed the budget deficit at 6.1% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:24.776029",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2875,
      "bullet_points_count": 18
    },
    "generated_detailed_content": "One of the principal economic challenges facing Costa Rica has been the escalating level of public debt, particularly when measured as a percentage of the country's gross domestic product (GDP). Between 2011 and 2015, Costa Rica’s public debt-to-GDP ratio rose markedly from 29.8% to 40.8%, reflecting a substantial increase in the government’s indebtedness relative to the size of the economy. This upward trajectory continued into 2016, with the ratio reaching 45%, signaling growing fiscal pressures and highlighting the need for effective debt management strategies. The rising debt burden underscored concerns about fiscal sustainability and the potential constraints on future economic growth and public spending. In absolute terms, the total public debt of Costa Rica in 2015 was valued at approximately $22.648 billion, marking an increase of nearly $3 billion compared to the previous year, 2014. This significant rise in debt levels was indicative of ongoing fiscal deficits and borrowing requirements to finance government expenditures. On a per capita basis, this translated to a public debt burden of $4,711 for each Costa Rican resident in 2015, providing a tangible measure of the debt’s impact on the average citizen and illustrating the scale of financial obligations faced by the government. Costa Rica’s engagement with international financial institutions also played a role in its debt profile. As of April 2014, the country maintained a formal line of credit with the World Bank valued at US$947 million. Of this credit line, US$645 million had been accessed, leaving an outstanding balance of approximately US$600 million available for future use. This arrangement provided Costa Rica with access to concessional financing to support development projects and fiscal needs, but also contributed to the overall debt stock and required prudent management to avoid exacerbating fiscal vulnerabilities. The International Monetary Fund (IMF) provided assessments of Costa Rica’s economic performance and fiscal health in the mid-2010s. In June 2017, the IMF reported that Costa Rica’s annual economic growth rate was just over 4%, accompanied by moderate inflation levels. This growth was seen as a positive indicator of economic resilience and expansion, supported by a sound financial system. The IMF noted that credit growth within the country was consistent with healthy financial deepening and aligned with broader macroeconomic trends, suggesting that the banking sector was functioning effectively and supporting economic activity. Despite these positive signs, the IMF highlighted ongoing fiscal challenges. The fiscal deficit remained high, and public debt continued to rise rapidly despite intensified fiscal consolidation efforts undertaken in 2016. The Fund observed that some of the gains achieved through fiscal consolidation had been partly reversed, reflecting difficulties in maintaining sustained fiscal discipline. Moreover, the IMF pointed to the lack of political consensus on implementing a comprehensive fiscal package as a significant obstacle to addressing the country’s fiscal imbalances effectively. The IMF expressed particular concern over several interrelated issues: the increasing fiscal deficits, the upward trajectory of public debt, and the heavy dollarization of bank assets and liabilities. The dollarization of financial assets and liabilities posed risks to financial stability, especially in the context of potentially tighter global financial conditions. The Fund warned that such external shocks could seriously undermine investor confidence, exacerbate fiscal pressures, and complicate the management of the country’s public finances. In response to these challenges, the IMF recommended a series of policy measures aimed at improving fiscal sustainability and economic efficiency. These included reducing pension benefits to alleviate long-term fiscal burdens, increasing contributions from the public to ensure more equitable and sustainable financing of social programs, and enhancing the cost-effectiveness of the education system to improve public expenditure efficiency. These recommendations were intended to support a more balanced fiscal framework and foster conditions conducive to sustainable growth. Credit rating agencies also reflected concerns about Costa Rica’s fiscal position. Moody’s Investors Service downgraded the country’s credit rating in early 2017 from Ba1 to Ba2, assigning a negative outlook. The downgrade was primarily attributed to the rising government debt and a persistently high fiscal deficit, which stood at 5.2% of GDP in 2016. Moody’s underscored the risks associated with the lack of political consensus to implement necessary fiscal measures, warning that continued fiscal deterioration could further pressure government debt ratios and undermine creditworthiness. In late July 2017, the Central Bank of Costa Rica estimated the country’s budget deficit at 6.1% of GDP, indicating a worsening fiscal imbalance compared to previous years. This elevated deficit level underscored the challenges faced by the government in balancing expenditures with revenues and highlighted the urgency of fiscal reforms. The Organization for Economic Cooperation and Development (OECD) also weighed in on Costa Rica’s fiscal situation through a 2017 study, emphasizing that reducing foreign debt should be a top priority for the government. The OECD recommended additional fiscal reforms aimed at moderating the budget deficit and improving the country’s overall fiscal health. Fiscal policy proposals during this period reflected attempts to address the growing fiscal pressures. In 2014, President Luis Guillermo Solís proposed a budget increase of 19% for 2015, followed by a more modest 0.5% increase for 2016, and a significant 12% increase for 2017. These budgetary expansions were intended to support government priorities but also contributed to the challenges of fiscal consolidation. The final proposed budget for 2017 totaled approximately US$15.9 billion, with debt payments alone accounting for one-third of the total budget. This allocation underscored the substantial fiscal resources devoted to servicing debt obligations, limiting the government’s flexibility in other areas. A notable aspect of the 2017 budget was that 46% of it required financing, which implied an increase in foreign debt obligations. This reliance on external borrowing to finance nearly half of the budget raised concerns about the sustainability of public finances and the potential exposure to external shocks. The Central Bank’s July 2017 estimate of a 6.1% budget deficit further illustrated the fiscal challenges facing Costa Rica, highlighting the need for continued efforts to strengthen fiscal discipline and reduce debt vulnerabilities.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:15.123859",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 18,
      "generated_content_length": 6819,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Liquidity crisis",
    "text": "In early August 2017, President Luis Guillermo Solís admitted that the country\nwas facing a \"liquidity crisis\", an inability to pay all of its obligations\nand to guarantee the essential services. To address this issue, he promised\nthat a higher VAT and higher income tax rates were being considered by his\ngovernment. Such steps are essential, Solís told the nation. \"Despite all the\npublic calls and efforts we have made since the start of my administration to\ncontain spending and increase revenues, there is still a gap that we must\nclose with fresh resources,\" he said. The crisis was occurring in spite of the\ngrowth, low inflation and continued moderate interest rates, Solís concluded.\n\nSolís explained that the Treasury will prioritize payments on the public debt\nfirst, then salaries, and then pensions. The subsequent priorities include\ntransfers to institutions \"according to their social urgency.\" All other\npayments will be made only if funds are available.",
    "openai_summarised_points": [
      "• In early August 2017, Costa Rican President Luis Guillermo Solís publicly acknowledged that the country was experiencing a \"liquidity crisis,\" characterized by an inability to meet all financial obligations and to ensure the provision of essential public services.",
      "• To address the liquidity crisis, President Solís announced that his government was considering implementing higher Value Added Tax (VAT) rates and increased income tax rates as part of fiscal reforms.",
      "• President Solís emphasized the necessity of these measures, stating that \"despite all the public calls and efforts we have made since the start of my administration to contain spending and increase revenues, there is still a gap that we must close with fresh resources.\"",
      "• The liquidity crisis persisted despite the country experiencing economic growth, low inflation, and moderate interest rates at the time.",
      "• The government's fiscal prioritization plan involved first ensuring payments on the public debt, followed by salaries, then pensions.",
      "• Subsequent fiscal priorities included transfers to institutions based on their social urgency, with all other payments contingent upon available funds."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:28.081281",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 970,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "In early August 2017, Costa Rican President Luis Guillermo Solís publicly acknowledged that the nation was facing a significant liquidity crisis. This crisis was characterized by the government's inability to fulfill all of its financial obligations in a timely manner, which in turn jeopardized the continuous provision of essential public services. The liquidity shortfall reflected deeper fiscal imbalances that had accumulated over time, constraining the government's capacity to manage its expenditures effectively. Despite ongoing efforts to stabilize public finances, the administration confronted a situation where cash flow limitations threatened the operational functioning of various state institutions. In response to this pressing fiscal challenge, President Solís announced that his government was actively considering a series of tax reforms aimed at augmenting public revenues. Central to these reforms was the proposal to increase the rates of the Value Added Tax (VAT), a consumption tax levied on goods and services throughout the economy. Additionally, the administration contemplated raising income tax rates to broaden the fiscal base and generate additional funds necessary to bridge the budgetary gap. These measures were part of a broader strategy to restore fiscal sustainability by enhancing revenue collection, thereby enabling the government to meet its financial commitments without resorting to excessive borrowing or expenditure cuts that could undermine social programs. President Solís underscored the imperative nature of these fiscal adjustments by highlighting the persistent structural deficit that had eluded resolution despite prior efforts. He stated, \"despite all the public calls and efforts we have made since the start of my administration to contain spending and increase revenues, there is still a gap that we must close with fresh resources.\" This acknowledgment pointed to the limitations of expenditure containment and revenue enhancement measures implemented earlier in his tenure, emphasizing the need for additional fiscal tools to address the shortfall. The president’s remarks conveyed a candid assessment of the fiscal landscape, signaling to the public and lawmakers that difficult but necessary decisions were required to restore financial equilibrium. Interestingly, the liquidity crisis unfolded against a backdrop of relatively favorable macroeconomic conditions. At the time, Costa Rica was experiencing steady economic growth, which typically supports improved fiscal performance through higher tax receipts. Inflation remained low, reducing the cost pressures on government expenditures, while interest rates were moderate, facilitating manageable debt servicing costs. However, these positive economic indicators were insufficient to offset the structural fiscal imbalances and liquidity constraints faced by the government. The disconnect between macroeconomic stability and fiscal distress highlighted the complexity of Costa Rica’s public finance challenges, which were rooted not only in economic cycles but also in long-standing budgetary rigidities and revenue-expenditure mismatches. To navigate the liquidity crisis, the government established a clear fiscal prioritization plan to allocate scarce financial resources effectively. The first priority was to ensure payments on the public debt, reflecting the necessity of maintaining the country’s creditworthiness and avoiding default. Servicing debt obligations was critical to preserving investor confidence and securing access to capital markets for future financing needs. Following debt payments, the government prioritized the disbursement of salaries to public sector employees, recognizing the importance of maintaining workforce morale and the uninterrupted delivery of public services. Subsequently, pension payments to retirees were addressed, fulfilling social commitments to vulnerable populations dependent on these funds for their livelihoods. Beyond these primary obligations, the government adopted a tiered approach to other fiscal expenditures based on social urgency. Transfers to institutions and programs deemed essential for social welfare were prioritized, ensuring that critical services related to health, education, and social protection continued to receive funding. All other payments and disbursements were made contingent upon the availability of funds, reflecting a pragmatic approach to managing limited resources in a context of fiscal scarcity. This hierarchical allocation framework aimed to balance fiscal discipline with the need to sustain vital public functions, mitigating the impact of the liquidity crisis on the most vulnerable sectors of society. Through these measures, the government sought to navigate an acute financial challenge while laying the groundwork for longer-term fiscal reforms.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:05.884273",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 4861,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Other challenges",
    "text": "A 2016 report by the U.S. government report identifies other challenges facing\nCosta Rica as it works to expand its economy by working with potential foreign\ninvestors:\n\n* The ports, roads, water systems would benefit from major upgrading. Attempts by China to invest in upgrading such aspects were \"stalled by bureaucratic and legal concerns\".\n* The bureaucracy is \"often slow and cumbersome\".\n* The country needs even more workers who are fluent in English and languages such as Portuguese, Mandarin and French. It would also benefit from more graduates in Science, Technology, Engineering and Math (STEM) programs.\n* Some sectors are controlled by a state monopoly which excludes competition but in other respects, \"Costa Rican laws, regulations and practices are generally transparent and foster competition\".\n* The country has been slow in completing environmental impact assessments which have caused delays in projects being completed.\n* Product registration is a slow process, although this may improve with digitization.\n* In spite of government attempts at improving the enforcement of intellectual property laws, this aspect remains a concern.",
    "openai_summarised_points": [
      "• A 2016 U.S. government report identifies several challenges facing Costa Rica as it seeks to expand its economy through collaboration with potential foreign investors.",
      "• The country's ports, roads, and water systems require significant upgrades to support economic growth; efforts by China to invest in such infrastructure improvements have been hindered by bureaucratic and legal concerns.",
      "• The bureaucratic system in Costa Rica is characterized as \"often slow and cumbersome,\" which impedes efficient economic development and investment processes.",
      "• There is a need for a larger workforce proficient in English as well as other languages such as Portuguese, Mandarin, and French to meet the demands of a diverse, globalized economy.",
      "• The country would benefit from an increase in graduates specializing in Science, Technology, Engineering, and Math (STEM) fields to foster innovation and technological advancement.",
      "• Certain sectors in Costa Rica are monopolized by the state, which excludes competition; however, overall, Costa Rican laws, regulations, and practices are generally transparent and conducive to competition.",
      "• Environmental impact assessments in Costa Rica have been completed slowly, leading to delays in the initiation and completion of various projects.",
      "• The process for product registration is also slow, although improvements are anticipated through digitization initiatives.",
      "• Despite government efforts to strengthen the enforcement of intellectual property laws, enforcement remains a concern, indicating ongoing challenges in protecting intellectual property rights."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:32.453569",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1154,
      "bullet_points_count": 9
    },
    "generated_detailed_content": "A 2016 report issued by the United States government highlighted several significant challenges confronting Costa Rica as it endeavored to expand its economy through enhanced collaboration with potential foreign investors. These challenges were multifaceted, involving infrastructural deficiencies, bureaucratic inefficiencies, workforce limitations, and regulatory concerns that collectively affected the country’s ability to attract and sustain foreign direct investment. The report underscored that while Costa Rica had made strides in economic development, certain systemic issues continued to hinder the full realization of its growth potential, particularly in the context of integrating more deeply into the global economy. One of the foremost obstacles identified was the state of Costa Rica’s infrastructure, notably its ports, roads, and water systems, which required substantial upgrades to adequately support economic expansion. The existing infrastructure was often inadequate for the volume and complexity of trade and commerce associated with a modern, diversified economy. Recognizing this, China had expressed interest in investing in Costa Rica’s infrastructure development, aiming to provide much-needed capital and technical expertise to modernize these critical systems. However, these efforts encountered significant impediments due to bureaucratic and legal concerns within Costa Rica. Complex regulatory frameworks, protracted approval processes, and legal ambiguities created an environment of uncertainty that discouraged the rapid implementation of infrastructure projects. This bureaucratic inertia not only delayed the initiation of improvements but also raised concerns among investors about the reliability and predictability of the investment climate. The bureaucratic system in Costa Rica itself was characterized by the 2016 report as “often slow and cumbersome,” a description that reflected widespread perceptions of inefficiency within public administration. This sluggishness manifested in various ways, including lengthy processing times for permits, inconsistent application of regulations, and a general lack of coordination among governmental agencies. Such administrative bottlenecks impeded efficient economic development by increasing the costs and risks associated with investment and business operations. Investors frequently encountered delays that extended project timelines and inflated expenses, thereby diminishing the attractiveness of Costa Rica as a destination for foreign capital. The cumbersome nature of bureaucracy also affected domestic entrepreneurs, limiting the country’s capacity to foster a dynamic and competitive business environment. In addition to infrastructural and bureaucratic challenges, the report emphasized the need for a workforce with enhanced language skills to meet the demands of a diverse and globalized economy. While Costa Rica had traditionally focused on Spanish as the primary language of instruction and communication, the evolving international economic landscape necessitated proficiency in English as a baseline for participation in global markets. Beyond English, there was a growing recognition of the importance of other languages such as Portuguese, Mandarin, and French, which corresponded to emerging trade partnerships and investment flows. The shortage of workers fluent in these languages constrained Costa Rica’s ability to engage effectively with a broader array of international partners, limiting opportunities for trade, tourism, and foreign investment. Addressing this linguistic gap was seen as essential for enhancing the country’s competitiveness and facilitating deeper integration into global value chains. Complementing the language skills deficit was the need for an increased number of graduates specializing in Science, Technology, Engineering, and Mathematics (STEM) fields. The report identified this as a critical factor for fostering innovation and technological advancement, which are key drivers of sustainable economic growth in the contemporary global economy. Costa Rica’s educational system had made progress in expanding access to higher education, but the output of STEM graduates remained insufficient to meet the demands of industries reliant on advanced technical expertise. This shortage limited the country’s capacity to develop high-value-added sectors such as information technology, biotechnology, and advanced manufacturing. Enhancing STEM education and encouraging more students to pursue these disciplines were viewed as strategic priorities to build a more skilled labor force capable of supporting innovation-driven economic development. The structure of certain economic sectors in Costa Rica also posed challenges to competition and investment. Some industries remained monopolized by the state, effectively excluding private sector participation and limiting market dynamism. These monopolies often involved essential services or utilities, where state control was justified on grounds of public interest or national security. However, the presence of such monopolies reduced competitive pressures that typically drive efficiency and innovation. Despite this, the report acknowledged that, on the whole, Costa Rican laws, regulations, and business practices were generally transparent and conducive to competition. The legal framework provided a relatively stable and predictable environment for private enterprise, with protections for property rights and contractual obligations. This overall transparency and regulatory consistency were considered strengths that could be leveraged to attract investment and stimulate economic diversification, provided that monopolistic constraints were addressed or mitigated. Environmental considerations also played a significant role in shaping Costa Rica’s economic development trajectory. The process of conducting environmental impact assessments (EIAs) was identified as a source of delays for many projects. While Costa Rica had established rigorous environmental standards to preserve its rich biodiversity and natural resources, the implementation of these assessments was often slow. Lengthy review periods, procedural complexities, and limited institutional capacity contributed to protracted timelines before projects could receive necessary environmental clearances. These delays not only postponed the start of infrastructure and development initiatives but also increased uncertainty for investors and developers. Balancing environmental protection with economic growth remained a delicate task, necessitating improvements in the efficiency and transparency of the EIA process to reduce bottlenecks without compromising ecological safeguards. Similarly, the registration process for new products in Costa Rica was characterized by slow administrative procedures. This sluggishness affected a range of sectors, including pharmaceuticals, agricultural inputs, and manufactured goods, where timely approval was essential for market entry and competitiveness. Recognizing the negative impact of these delays, the Costa Rican government had initiated digitization efforts aimed at streamlining product registration and other regulatory procedures. By leveraging digital technologies, authorities sought to enhance transparency, reduce processing times, and facilitate better coordination among agencies. These reforms were expected to improve the overall business climate by making it easier for companies to comply with regulations and bring products to market more efficiently, thereby supporting economic diversification and growth. Despite government initiatives to strengthen the enforcement of intellectual property (IP) laws, challenges persisted in this area. Protecting intellectual property rights was critical for fostering innovation, attracting foreign investment, and encouraging the development of creative industries. The Costa Rican government had taken steps to enhance IP enforcement mechanisms, including improving legal frameworks and increasing the capacity of enforcement agencies. However, enforcement remained a concern due to factors such as limited resources, insufficient training, and occasional gaps in coordination among institutions responsible for IP protection. These shortcomings allowed for the continued prevalence of counterfeiting and piracy, undermining the incentives for innovation and investment. Addressing these enforcement challenges was essential for ensuring that creators and investors could confidently safeguard their intellectual property, thereby contributing to a more robust and dynamic economic environment.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:17.047241",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 9,
      "generated_content_length": 8657,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Natural resources",
    "text": "Costa Rica's rainfall, and its location in the Central American isthmus, which\nprovides easy access to North and South American markets and direct ocean\naccess to the European and Asian Continents. Costa Rica has two seasons, both\nof which have their own agricultural resources: the tropical wet and dry\nseasons. One-fourth of Costa Rica's land is dedicated to national forests,\noften adjoining beaches, which has made the country a popular destination for\naffluent retirees and ecotourists.\n\nA full 10.27% of the country is protected as national parks while an\nadditional 17% is set aside for reserves, wildlife refuges and protected\nzones. Costa Rica has over 50 wildlife refuges, 32 major national parks, more\nthan 12 forest reserves and a few biological reserves.\n\nBecause of ocean access, 23.7% of Costa Rica's people fish and trade their\ncatches to fish companies; this is viewed as \"small scale artisanal coastal\"\nfishing and is most common in the Gulf of Nicoya. Costa Rica also charges\nlicensing fees for commercial fishing fleets that are taking tuna, sardines,\nbanga mary, mahi-mahi, red tilapia, shrimp, red snapper, other snappers,\nshark, marlin and sailfish. In mid 2017, the country was planning to ban\nlarge-scale commercial fishing off the southern Pacific Coast in an area\nnearly a million acres in size. The bill in congress was intended to \"protect\nthe extraordinary marine and coastal resources\" from \"indiscriminate and\nunsustainable commercial fishing.\"\n\nSport fishing in Costa Rica is an important part of the tourism industry;\nspecies include marlin, sailfish, dorado, tarpon, snook, rooster fish, wahoo,\ntuna, mackerel, snapper and rainbow bass.\n\nIn terms of the 2012 Environmental Performance Index ranking, Costa Rica is\n5th in the world, and first among the Americas. The World Economic Forum's\n2017 Travel & Tourism Competitiveness Report ranked Costa Rica as third of 136\ncountries based on natural resources, the number of World Heritage natural\nsites, protected areas and species as well as eco tourism.",
    "openai_summarised_points": [
      "• Costa Rica's climate is characterized by significant rainfall and its strategic location in the Central American isthmus, providing easy access to North and South American markets and direct ocean access to European and Asian continents.",
      "• The country experiences two primary seasons: the tropical wet season and the dry season, each supporting distinct agricultural resources.",
      "• Approximately 25% of Costa Rica's land area is designated as national forests, often located adjacent to beaches, contributing to the country's popularity among affluent retirees and ecotourists.",
      "• A total of 10.27% of Costa Rica's territory is protected as national parks, with an additional 17% allocated for reserves, wildlife refuges, and protected zones.",
      "• Costa Rica hosts over 50 wildlife refuges, 32 major national parks, more than 12 forest reserves, and several biological reserves, reflecting its commitment to conservation.",
      "• Due to its ocean access, 23.7% of the population engages in fishing and trades their catches to fish companies; this activity is primarily small-scale artisanal coastal fishing, especially prevalent in the Gulf of Nicoya.",
      "• The country imposes licensing fees on commercial fishing fleets targeting species such as tuna, sardines, banga mary, mahi-mahi, red tilapia, shrimp, red snapper, other snappers, shark, marlin, and sailfish.",
      "• In mid-2017, Costa Rica planned to ban large-scale commercial fishing off the southern Pacific Coast over nearly a million acres to protect marine and coastal resources from \"indiscriminate and unsustainable commercial fishing,\" with a bill under consideration in Congress.",
      "• Sport fishing is a significant component of Costa Rica's tourism industry, with popular species including marlin, sailfish, dorado, tarpon, snook, roosterfish, wahoo, tuna, mackerel, snapper, and rainbow bass.",
      "• In the 2012 Environmental Performance Index, Costa Rica ranked 5th globally and was the top-ranked country in the Americas, indicating high environmental standards.",
      "• The World Economic Forum's 2017 Travel & Tourism Competitiveness Report ranked Costa Rica third out of 136 countries based on natural resources, the number of World Heritage natural sites, protected areas, species, and eco-tourism infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:36.757107",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2036,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "Costa Rica's climate is distinguished by its abundant rainfall and its strategic geographic position on the Central American isthmus, which serves as a natural land bridge connecting North and South America. This advantageous location not only facilitates easy access to the markets of both continents but also provides direct oceanic routes to Europe and Asia, enhancing the country's potential for international trade and economic integration. The interplay of tropical weather patterns and geographic positioning has shaped Costa Rica's natural environment and economic activities, particularly in sectors reliant on natural resources and environmental sustainability. The country's climate is marked by two distinct seasons: the tropical wet season and the dry season. The wet season typically spans from May to November, characterized by heavy and consistent rainfall that nourishes the lush vegetation and supports a wide variety of agricultural activities. Conversely, the dry season, lasting from December to April, features significantly reduced precipitation and higher temperatures, creating conditions favorable for harvesting and certain types of crop cultivation. These alternating seasons have historically influenced agricultural cycles, enabling the production of diverse crops adapted to each period. For example, during the wet season, crops such as bananas, pineapples, and coffee thrive, while the dry season supports the cultivation of sugarcane and other drought-tolerant plants. This seasonal dichotomy underpins Costa Rica’s agricultural productivity and contributes to the country's food security and export economy. Approximately one-quarter of Costa Rica's land area—about 25%—is designated as national forests, many of which are situated adjacent to the country's extensive coastline. These forested areas not only serve as critical habitats for a rich diversity of flora and fauna but also play a significant role in attracting affluent retirees and ecotourists from around the world. The proximity of these verdant national forests to scenic beaches creates a unique blend of natural beauty that appeals to visitors seeking both relaxation and immersive nature experiences. This combination of forest and coastal ecosystems has positioned Costa Rica as a premier destination for ecotourism, a sector that has grown substantially over recent decades and contributes significantly to the national economy. The preservation of these forests is integral to maintaining biodiversity, supporting sustainable tourism, and providing ecosystem services such as carbon sequestration and watershed protection. In addition to national forests, Costa Rica has committed a substantial portion of its territory to formal conservation efforts. Specifically, 10.27% of the country's land is protected as national parks, while an additional 17% is allocated to reserves, wildlife refuges, and other protected zones. This extensive network of protected areas reflects the government's longstanding dedication to environmental stewardship and biodiversity conservation. The national parks serve as sanctuaries for endangered species and preserve critical ecosystems ranging from tropical rainforests to cloud forests and coastal marine environments. The reserves and wildlife refuges complement these parks by safeguarding habitats that support migratory species, endemic wildlife, and important ecological processes. Together, these protected areas form a comprehensive system that balances conservation with sustainable use, ensuring that natural resources remain viable for future generations. Costa Rica's conservation framework includes over 50 wildlife refuges, 32 major national parks, more than 12 forest reserves, and several biological reserves. This extensive network is managed by the National System of Conservation Areas (SINAC), which integrates environmental protection with community involvement and scientific research. The wildlife refuges provide critical habitats for numerous species, including jaguars, tapirs, and hundreds of bird species, many of which are threatened or endangered. The national parks, such as Corcovado National Park and Manuel Antonio National Park, are internationally recognized for their biodiversity and attract millions of visitors annually. Forest reserves focus on sustainable timber production and ecosystem restoration, while biological reserves serve as research sites for scientists studying tropical ecology and conservation biology. The diversity and scope of these protected areas underscore Costa Rica’s global leadership in environmental protection and sustainable development. Costa Rica’s access to the Pacific Ocean and the Caribbean Sea has fostered a vibrant fishing sector, with approximately 23.7% of the population engaged in fishing activities. The majority of this fishing is small-scale artisanal coastal fishing, which is particularly prevalent in the Gulf of Nicoya, an area known for its rich marine biodiversity and productive fisheries. Artisanal fishers utilize traditional methods and small vessels to harvest a variety of species, supplying local markets and contributing to the livelihoods of coastal communities. This sector plays a crucial role in food security and cultural heritage, maintaining fishing traditions that have been passed down through generations. The artisanal nature of the fishery also tends to have a lower environmental impact compared to industrial-scale operations, aligning with Costa Rica’s broader commitment to sustainable resource management. Commercial fishing fleets operating in Costa Rican waters are subject to licensing fees, which regulate access to valuable fish stocks and help fund conservation and management efforts. These fleets target a diverse array of species, including tuna, sardines, banga mary, mahi-mahi, red tilapia, shrimp, red snapper, other snapper species, shark, marlin, and sailfish. The licensing system aims to balance economic interests with the preservation of marine ecosystems, ensuring that fishing activities do not exceed sustainable limits. By imposing fees and monitoring catches, the government seeks to prevent overfishing and protect vulnerable species, many of which are crucial both ecologically and economically. This regulatory framework is part of a broader strategy to maintain the health of marine resources while supporting the fishing industry's contribution to the national economy. In mid-2017, the Costa Rican government advanced plans to ban large-scale commercial fishing off the southern Pacific Coast, covering nearly one million acres of marine territory. This proposed ban was motivated by concerns over the detrimental effects of \"indiscriminate and unsustainable commercial fishing\" on marine and coastal resources. The bill, which was under consideration in the national Congress at the time, aimed to safeguard critical habitats, protect biodiversity, and promote the recovery of fish populations depleted by intensive fishing practices. This initiative reflected growing awareness of the need to balance economic development with environmental conservation, particularly in marine environments that support both biodiversity and local livelihoods. If enacted, the ban would represent a significant step toward marine conservation and sustainable fisheries management in Costa Rica. Sport fishing constitutes an important segment of Costa Rica’s tourism industry, attracting anglers from around the world who seek to catch a variety of prized game fish. Popular species targeted by sport fishers include marlin, sailfish, dorado (also known as mahi-mahi), tarpon, snook, roosterfish, wahoo, tuna, mackerel, snapper, and rainbow bass. These species inhabit the country’s diverse marine and freshwater ecosystems, offering challenging and rewarding experiences for both amateur and professional anglers. Sport fishing not only generates substantial revenue through tourism but also promotes conservation awareness, as many operators emphasize catch-and-release practices and sustainable fishing methods. The sector’s growth has led to the development of specialized infrastructure, including fishing lodges, charter boats, and guiding services, further integrating sport fishing into Costa Rica’s broader ecotourism framework. Costa Rica’s environmental performance has been internationally recognized, as evidenced by its ranking in the 2012 Environmental Performance Index (EPI). In this global assessment, Costa Rica placed fifth worldwide and was the highest-ranked country in the Americas. The EPI evaluates countries based on various indicators, including air and water quality, biodiversity and habitat protection, and climate change mitigation efforts. Costa Rica’s high ranking reflects its effective environmental policies, extensive protected areas, and commitment to renewable energy and sustainable development. This recognition has bolstered the country’s reputation as a leader in environmental stewardship and has attracted further investment and interest in its conservation initiatives. Further affirming Costa Rica’s status as a premier ecotourism destination, the World Economic Forum’s 2017 Travel & Tourism Competitiveness Report ranked the country third out of 136 nations based on its natural resources. This ranking considered factors such as the number of World Heritage natural sites, the extent of protected areas, species diversity, and the quality of eco-tourism infrastructure. Costa Rica’s rich biodiversity, well-managed national parks, and commitment to sustainable tourism contributed to its high placement. The report highlighted the country's ability to leverage its natural assets to create a competitive and sustainable tourism sector, which in turn supports economic growth and environmental conservation. This international recognition underscores Costa Rica’s success in integrating natural resource management with economic development strategies.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:27.697332",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 9973,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Tourism",
    "text": "Ecotourism is key in Costa Rica's tourism industry. Shown Savegre River,\nTalamanca.\n\nWith a $1.92-billion-a-year tourism industry, Costa Rica was the most visited\nnation in the Central American region, with 2.42 million foreign visitors in\n2013. By 2016, 2.6 million tourists visited Costa Rica. The Tourism Board\nestimates that this sector's spending in the country represented over US$3.4\nbillion, or about 5.8% of the GDP. The World Travel & Tourism Council's\nestimates indicate a direct contribution to the 2016 GDP of 5.1% and 110,000\ndirect jobs in Costa Rica; the total number of jobs indirectly supported by\ntourism was 271,000.\n\nEcotourism is extremely popular with the many tourists visiting the extensive\nnational parks and protected areas around the country. Costa Rica was a\npioneer in this type of tourism and the country is recognized as one of the\nfew with real ecotourism. Other important market segments are adventure, sun\nand beaches. Most of the tourists come from the U.S. and Canada (46%), and the\nEU (16%), the prime market travelers in the world, which translates into a\nrelatively high expenditure per tourist of $1000 per trip.\n\nIn the 2008 Travel and Tourism Competitiveness Index (TTCI), Costa Rica\nreached the 44th place in the world ranking, being the first among Latin\nAmerican countries, and second if the Caribbean is included. Just considering\nthe subindex measuring human, cultural, and natural resources, Costa Rica\nranks in the 24th place at a worldwide level, and 7th when considering just\nthe natural resources criteria. The TTCI report also notes Costa Rica's main\nweaknesses, ground transport infrastructure (ranked 113th), and safety and\nsecurity (ranked 128th).\n\nThe online travel magazine Travelzoo rated Costa Rica as one of five “Wow Deal\nDestinations for 2012”. The magazine Travel Weekly named Costa Rica the best\ndestination in Central and South America in 2011. In 2017, the country was\nnominated in the following categories in the World Travel Awards: Mexico &\nCentral America's Leading Beach Destination, Mexico & Central America's\nLeading Destination and Mexico & Central America's Leading Tourist Board.",
    "openai_summarised_points": [
      "• Ecotourism is a central component of Costa Rica's tourism industry, highlighting the country's extensive national parks and protected areas, exemplified by sites such as the Savegre River in Talamanca.",
      "• In 2013, Costa Rica's tourism industry generated approximately $1.92 billion annually, making it the most visited nation in the Central American region with 2.42 million foreign visitors.",
      "• By 2016, the number of tourists visiting Costa Rica increased to 2.6 million, reflecting continued growth in the sector.",
      "• The Tourism Board estimates that tourism-related spending in 2016 exceeded US$3.4 billion, accounting for about 5.8% of Costa Rica's Gross Domestic Product (GDP).",
      "• The World Travel & Tourism Council (WTTC) reports that in 2016, tourism contributed directly to 5.1% of the GDP and supported approximately 110,000 direct jobs, with a total of 271,000 jobs indirectly linked to the sector.",
      "• Ecotourism is highly popular among tourists, driven by the country's numerous national parks and protected areas, and Costa Rica is recognized as a pioneer and one of the few countries with authentic ecotourism practices.",
      "• Other significant market segments include adventure tourism, sun, and beaches, with most tourists originating from the United States and Canada (46%) and the European Union (16%), which are considered prime markets.",
      "• The high expenditure per tourist is approximately $1,000 per trip, reflecting the attractiveness of Costa Rica as a travel destination.",
      "• In the 2008 Travel and Tourism Competitiveness Index (TTCI), Costa Rica ranked 44th globally, the highest among Latin American countries and second among Caribbean nations.",
      "• When considering the subindex for human, cultural, and natural resources, Costa Rica ranked 24th worldwide, and 7th specifically for natural resources.",
      "• The TTCI report identified weaknesses in Costa Rica's ground transport infrastructure, ranked 113th, and safety and security, ranked 128th.",
      "• Travelzoo named Costa Rica one of five “Wow Deal Destinations for 2012,” highlighting its appeal as a travel bargain.",
      "• In 2011, Travel Weekly designated Costa Rica as the best destination in Central and South America.",
      "• In 2017, Costa Rica received nominations in the World Travel Awards for Mexico & Central America's Leading Beach Destination, Leading Destination, and Leading Tourist Board."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:44.699286",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2157,
      "bullet_points_count": 14
    },
    "generated_detailed_content": "Ecotourism has long been a cornerstone of Costa Rica's tourism industry, reflecting the country's commitment to environmental preservation and sustainable travel practices. The nation boasts an extensive network of national parks and protected areas, which serve as prime attractions for visitors seeking immersive natural experiences. Among these, the Savegre River in the Talamanca region stands out as a notable example, renowned for its pristine ecosystems and biodiversity. This river and its surrounding areas offer opportunities for wildlife observation, hiking, and river-based activities, underscoring Costa Rica's reputation as a global leader in authentic ecotourism. The country's proactive approach to conservation, combined with its diverse landscapes ranging from rainforests to cloud forests, has positioned it as one of the few nations to successfully integrate environmental stewardship with tourism development. By 2013, Costa Rica's tourism sector had become a significant contributor to the national economy, generating approximately $1.92 billion in annual revenue. This economic impact coincided with the country becoming the most visited nation within the Central American region, attracting around 2.42 million foreign visitors that year. The influx of tourists was driven by the country's natural attractions, political stability, and growing international recognition as a premier ecotourism destination. The steady increase in visitor numbers reflected both the effectiveness of Costa Rica's tourism policies and the global trend toward environmentally conscious travel. This growth not only boosted foreign exchange earnings but also stimulated related sectors such as hospitality, transportation, and local artisanal industries. The upward trajectory of Costa Rica’s tourism industry continued into the mid-2010s, with the number of tourists rising to 2.6 million by 2016. This increase demonstrated sustained interest in the country’s offerings and highlighted the sector's resilience amid global economic fluctuations. The expanding tourist base contributed to a broader distribution of income and employment opportunities across various regions, particularly in rural and ecologically sensitive areas where tourism often represents a primary source of livelihood. The diversification of tourism products, including adventure tourism and beach vacations, complemented the ecotourism appeal, attracting a wider demographic of travelers and further solidifying Costa Rica’s position as a multifaceted destination. According to estimates from the Costa Rican Tourism Board, tourism-related spending in 2016 surpassed US$3.4 billion. This figure accounted for approximately 5.8% of the country’s Gross Domestic Product (GDP), underscoring the sector’s vital role in the national economy. The substantial financial inflows from tourism supported infrastructure development, public services, and conservation initiatives, creating a positive feedback loop that enhanced the overall visitor experience. The economic significance of tourism also prompted government and private sector collaboration to maintain sustainable growth while mitigating environmental and social impacts. The integration of tourism into broader economic planning reflected an understanding of its potential as a driver for inclusive development and poverty alleviation. The World Travel & Tourism Council (WTTC) provided further insights into the sector’s economic footprint in 2016, reporting that tourism directly contributed 5.1% to Costa Rica’s GDP. In terms of employment, the sector supported approximately 110,000 direct jobs, encompassing roles in hotels, travel agencies, airlines, and other tourism-related services. Beyond direct employment, an estimated 271,000 jobs were indirectly linked to tourism, including positions in supply chains, construction, and retail. This extensive employment network highlighted tourism’s capacity to generate widespread economic benefits and foster social stability. The data underscored the importance of maintaining a skilled workforce and investing in human capital to sustain the sector’s growth and competitiveness. Ecotourism’s popularity among international visitors remained a defining characteristic of Costa Rica’s tourism profile. The country’s numerous national parks and protected areas attracted travelers interested in wildlife observation, hiking, birdwatching, and experiencing unspoiled natural environments. Costa Rica’s pioneering role in ecotourism was recognized globally, as it was among the first countries to implement authentic ecotourism practices that emphasized environmental conservation, community involvement, and education. This approach not only differentiated Costa Rica from other destinations but also set a benchmark for sustainable tourism worldwide. The government’s commitment to preserving biodiversity and promoting responsible tourism practices contributed to the country’s enduring appeal among environmentally conscious travelers. In addition to ecotourism, other significant market segments contributed to Costa Rica’s tourism industry, notably adventure tourism and sun-and-beach tourism. Adventure tourism encompassed activities such as zip-lining, white-water rafting, surfing, and canopy tours, leveraging the country’s varied topography and climate. Coastal areas with pristine beaches attracted sun-seekers and water sports enthusiasts, complementing the inland ecotourism offerings. The majority of tourists originated from North America, with the United States and Canada accounting for approximately 46% of visitors. The European Union represented another important market, contributing 16% of the tourist arrivals. These regions were considered prime markets due to their proximity, economic capacity, and cultural affinity for nature-based and adventure travel. Marketing efforts and air connectivity were often tailored to these demographics to maximize visitor numbers and spending. Costa Rica’s tourism industry was characterized by a relatively high expenditure per tourist, averaging around $1,000 per trip. This level of spending reflected the country’s attractiveness as a travel destination offering diverse experiences, quality accommodations, and a reputation for safety and environmental responsibility. The higher expenditure was also indicative of tourists engaging in multiple activities, including guided tours, adventure sports, and visits to national parks, which often required specialized services and equipment. The economic benefits of this spending extended beyond the tourism sector, supporting local businesses and contributing to rural development. The emphasis on quality over mass tourism aligned with Costa Rica’s sustainable tourism strategy and helped maintain the integrity of its natural and cultural resources. Costa Rica’s global standing in tourism competitiveness was highlighted in the 2008 Travel and Tourism Competitiveness Index (TTCI), where it ranked 44th worldwide. This position was the highest among Latin American countries and second among Caribbean nations, reflecting the country’s strengths in tourism infrastructure, natural resources, and business environment. The TTCI assessed various factors influencing tourism development, including policy frameworks, safety, health, and human resources. Costa Rica’s performance in this index underscored its leadership role in the region and its ability to attract international visitors despite competition from larger or more traditionally popular destinations. When examining specific subindices within the TTCI, Costa Rica demonstrated particular strengths in human, cultural, and natural resources. It ranked 24th globally in this category, highlighting the richness of its cultural heritage, the quality of its human capital, and the abundance of natural attractions. Notably, the country was ranked 7th worldwide for natural resources, reflecting its exceptional biodiversity, protected areas, and scenic landscapes. These rankings validated Costa Rica’s strategic focus on leveraging its environmental assets to build a competitive tourism industry. However, the TTCI also identified areas requiring improvement, which influenced subsequent policy and investment decisions. Among the weaknesses identified by the TTCI were Costa Rica’s ground transport infrastructure and safety and security conditions. The country was ranked 113th globally for ground transport infrastructure, pointing to challenges such as road quality, traffic congestion, and limited public transportation options. These issues affected accessibility to certain tourist destinations and could detract from the overall visitor experience. Additionally, Costa Rica ranked 128th in safety and security, indicating concerns related to crime rates and traveler perceptions of personal safety. Addressing these weaknesses became a priority for government agencies and tourism stakeholders to ensure sustainable growth and maintain international competitiveness. Costa Rica’s appeal as a travel bargain was recognized by Travelzoo, which named the country one of five “Wow Deal Destinations for 2012.” This designation highlighted Costa Rica’s ability to offer high-quality tourism experiences at competitive prices, making it an attractive option for budget-conscious travelers seeking value without compromising on natural beauty or adventure opportunities. Such accolades contributed to increased visibility in international markets and supported marketing campaigns aimed at expanding the tourist base. The recognition also reinforced Costa Rica’s image as a destination that balances affordability with sustainability and quality. In 2011, Travel Weekly further acknowledged Costa Rica’s prominence in the region by designating it as the best destination in Central and South America. This award reflected the country’s comprehensive tourism offerings, including its ecotourism leadership, adventure activities, and cultural attractions. The accolade served to enhance Costa Rica’s reputation among travel professionals and consumers alike, encouraging greater visitation and investment. It also underscored the effectiveness of the country’s tourism development strategies and its ability to deliver memorable experiences that met diverse traveler expectations. Costa Rica continued to receive international recognition in subsequent years, as evidenced by its nominations in the 2017 World Travel Awards. The country was nominated for Mexico & Central America’s Leading Beach Destination, Leading Destination, and Leading Tourist Board categories. These nominations highlighted Costa Rica’s strengths in coastal tourism, overall destination appeal, and institutional excellence in tourism promotion and management. Participation in such prestigious awards reflected the country’s ongoing commitment to maintaining high standards and adapting to evolving market trends. The recognition also contributed to reinforcing Costa Rica’s brand as a top-tier travel destination in the competitive Latin American and Caribbean tourism landscape.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:30.365873",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 14,
      "generated_content_length": 11112,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Agriculture",
    "text": "Costa Rica's economy was historically based on agriculture, and this has had a\nlarge cultural impact through the years. Costa Rica's main cash crop,\nhistorically and up to modern times, was Bananas. The coffee crop had been a\nmajor export, but decreased in value to the point where it added only 2.5% to\nthe 2013 exports of the country.\n\nAgriculture also plays an important part in the country's gross domestic\nproduct (GDP). It makes up about 6.5% of Costa Rica’s GDP, and employs 12.9%\nof the labor force (2016). By comparison, industry employs 18.57% of the labor\nforce, and the service sector 69.02%.\n\nDepending on location and altitude, many regions differ in agricultural crops\nand techniques. The main agricultural exports from the country include:\nbananas, pineapples (the second highest export, with over 50% share of the\nworld market), other tropical fruits, coffee (much of it grown in the Valle\nCentral or Meseta Central), sugar, rice, palm oil, vegetables, tropical\nfruits, ornamental plants, maize, and potatoes.\n\nLivestock activity consists of cattle, pigs and horses, as well as poultry.\nMeat and dairy produce are leading exports according to one source, but both\nwere not in the top 10 categories of 2013.\n\nThe combined export value of forest products and textiles in 2013 did not\nexceed that of either chemical products or plastics.",
    "openai_summarised_points": [
      "• Historically, Costa Rica's economy was primarily based on agriculture, which has significantly influenced its cultural development over the years.",
      "• The country's main cash crop historically and up to modern times has been bananas.",
      "• Coffee was once a major export commodity; however, its relative contribution has decreased to the point where it accounted for only 2.5% of Costa Rica's total exports in 2013.",
      "• Agriculture contributes approximately 6.5% to Costa Rica’s gross domestic product (GDP).",
      "• In 2016, agriculture employed about 12.9% of the country's labor force.",
      "• The industrial sector employs approximately 18.57% of the labor force, while the service sector accounts for about 69.02%.",
      "• Agricultural practices and crop choices vary significantly depending on geographic location and altitude within Costa Rica.",
      "• The main agricultural exports include bananas, pineapples (which constitute the second highest export with over 50% share of the global pineapple market), other tropical fruits, coffee (primarily grown in the Valle Central or Meseta Central), sugar, rice, palm oil, vegetables, ornamental plants, maize, and potatoes.",
      "• Livestock activities encompass cattle, pigs, horses, and poultry.",
      "• Meat and dairy products are considered leading exports according to some sources; however, they did not rank within the top 10 export categories in 2013.",
      "• In 2013, the combined export value of forest products and textiles was lower than that of chemical products or plastics, indicating these sectors' relatively smaller contribution to exports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:50.578554",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1351,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "Historically, Costa Rica's economy was predominantly rooted in agriculture, a sector that has profoundly shaped the nation's cultural and social development over the years. From the colonial period through much of the 20th century, agricultural production formed the backbone of economic activity, influencing settlement patterns, labor structures, and regional identities. The reliance on farming and plantation agriculture not only provided the primary source of income for a large portion of the population but also established Costa Rica’s reputation as a stable and productive agrarian society in Central America. This agricultural heritage has left a lasting imprint on Costa Rican culture, including culinary traditions, festivals, and rural community life. Among the various crops cultivated in Costa Rica, bananas have historically been the country’s principal cash crop and have maintained this status well into modern times. The banana industry emerged as a dominant economic force in the late 19th and early 20th centuries, driven by favorable climate conditions and growing international demand, particularly from the United States and Europe. Large-scale banana plantations, often operated by multinational corporations, became a significant source of export revenue and employment. The prominence of bananas in Costa Rica’s export economy has persisted due to the country’s competitive advantages in production efficiency, quality, and access to global markets. Coffee, once a major export commodity and a symbol of Costa Rica’s economic development, experienced a gradual decline in its relative contribution to the national economy over the decades. Coffee cultivation played a crucial role in the country’s 19th and early 20th-century economic expansion, fostering infrastructure development and integration into the global economy. However, by 2013, coffee accounted for only 2.5% of Costa Rica’s total exports, reflecting shifts in global commodity markets, competition from other coffee-producing countries, and diversification of the export base. Despite this decline, coffee remains culturally significant and continues to be cultivated primarily in the Valle Central or Meseta Central regions, where altitude and climate conditions are ideal for high-quality Arabica coffee production. Agriculture’s role in Costa Rica’s economy can be quantified by its contribution to gross domestic product (GDP), which stood at approximately 6.5%. This figure illustrates a relative decrease compared to earlier periods when agriculture dominated economic output, indicating a structural transformation toward industrialization and services. Nevertheless, agriculture remains a vital sector, particularly in rural areas, supporting livelihoods and food security. The sector’s contribution to GDP reflects both traditional farming and modern agribusiness activities, encompassing a range of crops and livestock products. In terms of employment, agriculture engaged about 12.9% of Costa Rica’s labor force in 2016, underscoring its continued importance as a source of jobs, especially outside urban centers. This agricultural labor force includes smallholder farmers, plantation workers, and seasonal laborers involved in planting, harvesting, and processing activities. Comparatively, the industrial sector employed approximately 18.57% of the labor force, while the service sector accounted for the largest share at about 69.02%. This distribution highlights the ongoing economic transition, with services such as tourism, finance, and information technology playing increasingly prominent roles in national employment. Agricultural practices and crop choices in Costa Rica vary significantly according to geographic location and altitude, reflecting the country’s diverse topography and microclimates. The Central Valley and Meseta Central, characterized by moderate altitudes and temperate climates, are ideal for coffee cultivation and vegetable farming. In contrast, the lowland coastal regions, with their warm and humid conditions, support the production of tropical fruits such as bananas and pineapples. Highland areas with cooler temperatures are suitable for growing potatoes and other temperate crops. This geographic diversity allows Costa Rica to produce a wide array of agricultural products, catering to both domestic consumption and export markets. The main agricultural exports of Costa Rica encompass a variety of tropical fruits and other commodities. Bananas remain the leading export product, followed closely by pineapples, which constitute the second highest export category. Costa Rica holds a dominant position in the global pineapple market, accounting for over 50% of worldwide exports. Other significant exports include coffee, primarily grown in the Central Valley; sugar; rice; palm oil; vegetables; ornamental plants; maize; and potatoes. This diverse export portfolio reflects the country’s ability to leverage its varied agroecological zones and adopt modern agricultural technologies to meet international quality standards and market demands. Livestock activities form an integral part of Costa Rica’s agricultural sector, with cattle, pigs, horses, and poultry being the primary animals raised. Cattle farming is especially prominent, supporting both meat and dairy production, while pig and poultry farming contribute to domestic consumption and local markets. Horse breeding has cultural and recreational significance but also plays a role in rural economies. The integration of livestock with crop production systems enhances farm sustainability and provides multiple income streams for agricultural households. Meat and dairy products have been identified by some sources as leading exports within Costa Rica’s agricultural sector. These products contribute to the diversification of the country’s export base and add value beyond raw agricultural commodities. However, despite their importance, meat and dairy did not rank within the top ten export categories in 2013, indicating that while they are significant, they have not reached the export prominence of tropical fruits or processed agricultural goods. This suggests potential for growth and further development in these sub-sectors through improved production techniques and market expansion. In 2013, the combined export value of forest products and textiles was lower than that of chemical products or plastics, highlighting the relatively smaller contribution of these sectors to Costa Rica’s overall export economy. Forest products, which include timber and non-timber forest goods, have traditionally been part of the rural economy but face challenges related to sustainable management and international competition. The textile industry, while present, has not achieved the scale or export competitiveness of other manufacturing sectors. In contrast, chemical products and plastics represent more dynamic and higher-value segments of Costa Rica’s industrial exports, reflecting the country’s gradual shift toward more diversified and technologically advanced economic activities.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:20.426911",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 7094,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Mining",
    "text": "Mining in Costa Rica contributes a small amount to the economy. In 2018 5.2\ntons of gold were produced.",
    "openai_summarised_points": [
      "• Mining in Costa Rica contributes a relatively minor portion to the national economy, indicating its limited economic significance within the country.",
      "• In the year 2018, Costa Rica produced a total of 5.2 tons of gold through mining activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:18:53.241384",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 103,
      "bullet_points_count": 2
    },
    "generated_detailed_content": "Mining in Costa Rica has historically played a relatively minor role in the national economy, reflecting its limited economic significance compared to other sectors such as agriculture, tourism, and manufacturing. The country’s geological formations do contain various mineral resources, but the scale of extraction and production has remained modest, largely due to environmental concerns, regulatory frameworks, and the prioritization of sustainable development. While mining activities do contribute to local employment and regional economies in certain areas, their overall impact on Costa Rica’s gross domestic product (GDP) is minimal, underscoring the sector’s peripheral status within the broader economic landscape. In 2018, Costa Rica’s mining industry produced a total of 5.2 metric tons of gold, a figure that illustrates both the presence and the relatively small scale of precious metal extraction in the country. Gold mining in Costa Rica has been concentrated primarily in specific regions known for their mineral deposits, such as the northern and central parts of the country, where artisanal and small-scale mining operations have historically taken place alongside more formal ventures. This output, while modest in global terms, represents a notable contribution to the country’s mineral production and highlights the ongoing interest in exploiting Costa Rica’s mineral wealth within the constraints of environmental regulations and social considerations. The extraction of gold and other minerals in Costa Rica has been subject to increasing scrutiny due to the country’s strong environmental policies and its commitment to conservation. The government has implemented stringent regulations to mitigate the ecological impact of mining, which has limited the expansion of large-scale mining projects. These policies reflect Costa Rica’s broader national priorities, which emphasize biodiversity preservation and sustainable resource management. Consequently, mining operations tend to be smaller in scale and often face opposition from environmental groups and local communities concerned about potential damage to fragile ecosystems and water resources. Despite these challenges, the mining sector continues to attract some investment and exploration activities, particularly in gold, which remains the most economically significant mineral extracted in Costa Rica. The 5.2 tons of gold produced in 2018 serve as an indicator of the sector’s ongoing, albeit constrained, contribution to the economy. This production level also suggests potential for future development, provided that mining practices align with the country’s environmental standards and social expectations. Overall, while mining is not a dominant economic force in Costa Rica, it remains a component of the country’s natural resource portfolio, contributing modestly to national output and local economies within a framework of sustainable development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:23.738002",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 2,
      "generated_content_length": 2942,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Exports, jobs, and energy",
    "text": "Intel microprocessor facility in Costa Rica\n\nMere decades ago, Costa Rica was known principally as a producer of bananas\nand coffee. Even though bananas, pineapple, sugar, coffee, lumber, wood\nproducts and beef are still important exports, in recent times medical\ninstruments, electronics, pharmaceuticals, financial outsourcing, software\ndevelopment, and ecotourism are now the prime exports. High levels of\neducation and fluency in English among its residents make the country an\nattractive investing location.\n\nIn 2015 the following were the major export products (US$): medical\ninstruments ($2 billion), bananas ($1.24B), tropical fruits ($1.22B),\nintegrated circuits ($841 million) and orthopedic appliances ($555M). The\ntotal exports in 2015 were US$12.6 billion, down from $18.9B in 2010; bananas\nand medical instruments were the two largest sectors. Total imports in 2015\nwere $15B, up from $13.8B in 2010; this resulted in a trade deficit.\n\nOver the years, Costa Rica successfully attracted important investments by\nsuch companies as Intel Corporation, Procter & Gamble, Abbott Laboratories and\nBaxter Healthcare. Manufacturing and industry's contribution to GDP overtook\nagriculture over the course of the 1990s, led by foreign investment in Costa\nRica's Free Trade Zones (FTZ) where companies benefit from investment and tax\nincentives. Companies in such zones must export at least 50% of their\nservices. Well over half of that type of investment has come from the U.S.\nAccording to the government, the zones supported over 82 thousand direct jobs\nand 43 thousand indirect jobs in 2015; direct employment grew 5% over 2014.\nThe average wages in the FTZ increased by 7% and were 1.8 times greater than\nthe average for private enterprise work in the rest of the country. Companies\nwith facilities in the America Free Zone in Heredia, for example, include\nDell, HP, Bayer, Bosch, DHL, IBM and Okay Industries.\n\nIn 2006 Intel's microprocessor facility alone was responsible for 20% of Costa\nRican exports and 4.9% of the country's GDP. In 2014, Intel announced it would\nend manufacturing in Costa Rica and lay off 1,500 staff but agreed to maintain\nat least 1,200 employees. The facility continued as a test and design center\nwith approximately 1,600 remaining staff. In 2017, Intel had 2000 employees in\nthe country, and was operating a facility which assembles, tests and\ndistributes processors and a Global Innovation Center, both in Heredia.\n\nThe fastest growing aspect of the economy is the provision of corporate\nservices for foreign companies which in 2016 employed approximately 54,000\npeople in a country with a workforce under 342,000; that was up from 52,400\nthe previous year. For example, Amazon.com employs some 5,000 people. Many\nwork in the free-trade areas such as Zona Franca America and earn roughly\ndouble the national average for service work. This sector generated US$4.6\nbillion in 2016, nearly as much as tourism.\n\nIn 2013, the total FDI stock in Costa Rica amounted to about 40 percent of\nGDP, of which investments from the United States accounted for 64 percent,\nfollowed by the United Kingdom and Spain with 6 percent each. Costa Rica's\noutward foreign direct investment stock is small, at about 3 percent of GDP as\nof 2011, and mainly concentrated in Central America (about 57 percent of the\ntotal outward direct investment stock).\n\nTourism is an important part of the economy, with the number of visitors\nincreasing from 780,000 in 1996, to 1 million in 1999, and to 2.089 million\nforeign visitors in 2008, allowing the country to earn $2.144-billion in that\nyear. By 2016, 2.6 million tourists visited Costa Rica, spending roughly\nUS$3.4 billion. Tourism directly supported 110,000 jobs and indirectly\nsupported 271,000 in 2016.\n\nCosta Rica has not discovered sources of fossil fuels—apart from minor coal\ndeposits—but its mountainous terrain and abundant rainfall have permitted the\nconstruction of a dozen hydroelectric power plants, making it self-sufficient\nin all energy needs, except for refined petroleum. In 2017, Costa Rica was\nconsidering the export of electricity to neighbouring countries. Mild climate\nand trade winds make neither heating nor cooling necessary, particularly in\nthe highland cities and towns where some 90% of the population lives.\nRenewable energy in Costa Rica is the norm. In 2016, 98.1 per cent of the\ncountry's electricity came from green sources: hydro generating stations,\ngeothermal plants, wind turbines, solar panels and biomass plants.",
    "openai_summarised_points": [
      "• Historically, Costa Rica was primarily known as a producer of bananas and coffee, with these commodities remaining important exports alongside pineapple, sugar, lumber, wood products, and beef.",
      "• In recent decades, the country's main exports have shifted towards medical instruments, electronics, pharmaceuticals, financial outsourcing, software development, and ecotourism, driven by high levels of education and English fluency among residents.",
      "• In 2015, Costa Rica's major export products by value included medical instruments ($2 billion), bananas ($1.24 billion), tropical fruits ($1.22 billion), integrated circuits ($841 million), and orthopedic appliances ($555 million).",
      "• Total exports in 2015 amounted to US$12.6 billion, representing a decline from US$18.9 billion in 2010; bananas and medical instruments remained the largest sectors.",
      "• Total imports in 2015 were US$15 billion, up from US$13.8 billion in 2010, resulting in a trade deficit.",
      "• Costa Rica has attracted significant foreign investment from companies such as Intel Corporation, Procter & Gamble, Abbott Laboratories, and Baxter Healthcare.",
      "• Manufacturing and industry contributions to GDP surpassed agriculture during the 1990s, largely due to foreign investment in Free Trade Zones (FTZs), where companies benefit from investment and tax incentives.",
      "• Companies in FTZs are required to export at least 50% of their services; over half of such investments originate from the United States.",
      "• In 2015, FTZs supported over 82,000 direct jobs and 43,000 indirect jobs; direct employment in these zones grew by 5% compared to 2014.",
      "• Wages in FTZs increased by 7%, and were 1.8 times higher than the average wages in private sector employment outside the zones.",
      "• Notable companies operating in the America Free Zone in Heredia include Dell, HP, Bayer, Bosch, DHL, IBM, and Okay Industries.",
      "• In 2006, Intel’s microprocessor facility accounted for 20% of Costa Rican exports and 4.9% of the country’s GDP.",
      "• In 2014, Intel announced plans to cease manufacturing in Costa Rica, laying off 1,500 staff but maintaining at least 1,200 employees; the facility continued as a test and design center with approximately 1,600 staff.",
      "• By 2017, Intel employed around 2,000 people in Costa Rica, operating a facility that assembles, tests, and distributes processors, along with a Global Innovation Center located in Heredia.",
      "• The fastest-growing sector of the economy is corporate services for foreign companies, which employed approximately 54,000 people in 2016, up from 52,400 in 2015, within a total workforce of under 342,000.",
      "• Major corporations such as Amazon.com employ about 5,000 Costa Rican workers in this sector, many earning roughly double the national average for service jobs.",
      "• The corporate services sector generated US$4.6 billion in revenue in 2016, nearly matching the revenue from tourism.",
      "• In 2013, foreign direct investment (FDI) stock in Costa Rica was approximately 40% of GDP, with U.S. investments constituting 64% of total FDI, followed by the United Kingdom and Spain, each with 6%.",
      "• Outward FDI from Costa Rica was modest, about 3% of GDP as of 2011, mainly concentrated in Central America, which accounted for approximately 57% of outward investments.",
      "• Tourism is a vital component of the economy, with visitor numbers increasing from 780,000 in 1996 to 1 million in 1999, and reaching 2.089 million in 2008, earning US$2.144 billion that year.",
      "• By 2016, tourist arrivals had grown to 2.6 million, with total tourism expenditure around US$3.4 billion, supporting 110,000 direct jobs and 271,000 indirect jobs.",
      "• Costa Rica lacks significant fossil fuel sources, aside from minor coal deposits, but its mountainous terrain and abundant rainfall facilitate the construction of hydroelectric power plants, making the country self-sufficient in energy except for refined petroleum.",
      "• In 2017, Costa Rica was exploring the export of electricity to neighboring countries.",
      "• The country’s mild climate and trade winds eliminate the need for heating or cooling in most areas, especially in highland cities where about 90% of the population resides.",
      "• Renewable energy sources dominate Costa Rica’s electricity generation, accounting for 98.1% of the total in 2016, including hydroelectric stations, geothermal plants, wind turbines, solar panels, and biomass plants."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:19:09.318751",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4512,
      "bullet_points_count": 25
    },
    "generated_detailed_content": "Historically, Costa Rica’s economy was predominantly anchored in the production and export of agricultural commodities, with bananas and coffee serving as the country’s most renowned and economically significant products. These two staples not only shaped the agricultural landscape but also established Costa Rica’s early presence in global markets. Alongside bananas and coffee, other agricultural exports such as pineapple, sugar, lumber, wood products, and beef maintained considerable importance, contributing to the country’s export revenues and rural employment. The cultivation and export of these goods were deeply embedded in the nation’s economic identity throughout much of the 20th century, reflecting its reliance on natural resource-based industries. However, in recent decades, Costa Rica’s export profile has undergone a substantial transformation, shifting away from traditional agricultural goods toward more diversified and technologically advanced products and services. The country has increasingly specialized in the export of medical instruments, electronics, pharmaceuticals, financial outsourcing, software development, and ecotourism. This evolution has been driven by several factors, including the country’s investment in education, which has resulted in a highly skilled workforce with widespread English fluency. These human capital advantages have attracted multinational corporations seeking a competitive base for manufacturing and services, enabling Costa Rica to integrate into global value chains beyond agriculture. The rise of ecotourism, leveraging the country’s rich biodiversity and commitment to environmental sustainability, has also emerged as a significant economic sector, complementing the growth in high-tech exports. By 2015, the composition of Costa Rica’s exports reflected this diversification. Medical instruments led the export sector by value, generating approximately US$2 billion. Bananas remained a key export, valued at US$1.24 billion, closely followed by tropical fruits, which accounted for US$1.22 billion. Integrated circuits, emblematic of the country’s growing electronics manufacturing base, contributed US$841 million, while orthopedic appliances added US$555 million to export revenues. This data illustrates the coexistence of traditional agricultural exports with newer, technology-driven products, highlighting the country’s economic transition. Despite these gains, total exports in 2015 amounted to US$12.6 billion, marking a decline from the US$18.9 billion recorded in 2010. The contraction in export value over this five-year period was influenced by various global economic factors, including fluctuations in commodity prices and shifts in international demand. Nonetheless, bananas and medical instruments continued to dominate the export landscape, underscoring their sustained importance to the Costa Rican economy. On the import side, Costa Rica’s total imports in 2015 reached US$15 billion, an increase from US$13.8 billion in 2010. The higher import levels relative to exports resulted in a trade deficit, reflecting the country’s reliance on imported goods and inputs necessary for its manufacturing and service industries. The trade imbalance underscored challenges in achieving export growth sufficient to offset the rising demand for foreign products and capital goods. Foreign direct investment (FDI) has played a pivotal role in shaping Costa Rica’s economic development, particularly in the manufacturing and service sectors. The country has attracted substantial investment from multinational corporations such as Intel Corporation, Procter & Gamble, Abbott Laboratories, and Baxter Healthcare. These companies established operations in Costa Rica to capitalize on the country’s skilled labor force, strategic location, and favorable investment climate. The presence of these global firms has facilitated technology transfer, job creation, and integration into international production networks. During the 1990s, the contribution of manufacturing and industry to Costa Rica’s gross domestic product (GDP) surpassed that of agriculture, signaling a structural shift in the economy. This transition was largely fueled by foreign investment concentrated in Free Trade Zones (FTZs), which offered companies significant incentives, including tax breaks and streamlined customs procedures. These zones were designed to attract export-oriented manufacturing and service firms by reducing operational costs and enhancing competitiveness. The FTZ program became a cornerstone of Costa Rica’s economic strategy, promoting industrial diversification and export expansion. Companies operating within the FTZs are mandated to export at least 50% of their production or services, ensuring that these zones remain focused on generating foreign exchange earnings and integrating with global markets. More than half of the investments in these zones originated from the United States, reflecting strong bilateral economic ties and the attractiveness of Costa Rica as a nearshoring destination for American firms. The FTZs have thus served as a conduit for U.S. capital and technology, contributing significantly to the country’s export capacity. By 2015, the FTZs supported over 82,000 direct jobs and an additional 43,000 indirect jobs, underscoring their importance as engines of employment. Direct employment within these zones grew by 5% compared to the previous year, indicating ongoing expansion and investor confidence. Wages in FTZs increased by 7% during the same period and were approximately 1.8 times higher than the average wages in the private sector outside these zones. This wage premium reflected the higher skill requirements and productivity levels associated with FTZ-based employment. The America Free Zone in Heredia stands out as a prominent industrial park housing numerous multinational corporations. Notable companies operating there include Dell, Hewlett-Packard (HP), Bayer, Bosch, DHL, IBM, and Okay Industries. These firms engage in a range of activities, from electronics assembly and software development to logistics and pharmaceutical manufacturing, contributing to the diversification and sophistication of Costa Rica’s industrial base. Intel Corporation’s presence in Costa Rica has been particularly influential. In 2006, Intel’s microprocessor manufacturing facility accounted for 20% of the country’s exports and contributed 4.9% to the national GDP. This facility symbolized the success of Costa Rica’s strategy to attract high-technology investment and served as a major source of skilled employment and export revenue. However, in 2014, Intel announced plans to cease manufacturing operations at the Costa Rican plant, resulting in the layoff of approximately 1,500 employees. Despite this reduction, the company retained at least 1,200 workers, repurposing the facility to function as a test and design center. By 2017, Intel employed around 2,000 people in Costa Rica, operating a facility responsible for assembling, testing, and distributing microprocessors, alongside a Global Innovation Center located in Heredia. This shift reflected Intel’s strategic realignment while maintaining a significant operational footprint in the country. The corporate services sector for foreign companies has emerged as the fastest-growing segment of Costa Rica’s economy. In 2016, this sector employed approximately 54,000 people, up from 52,400 in 2015, within a total national workforce of fewer than 342,000 individuals. This growth highlighted the increasing importance of business process outsourcing, financial services, and software development as sources of employment and economic output. Major multinational corporations such as Amazon.com have established substantial operations in Costa Rica, employing around 5,000 workers. Employees in this sector often earn wages roughly double the national average for service jobs, reflecting the specialized skills and higher productivity associated with corporate services. The corporate services sector generated approximately US$4.6 billion in revenue in 2016, nearly matching the revenue derived from tourism, another vital pillar of the Costa Rican economy. This parity underscored the sector’s growing economic significance and its role in diversifying the country’s sources of foreign exchange earnings. Foreign direct investment stock in Costa Rica was substantial, amounting to approximately 40% of GDP in 2013. The United States accounted for 64% of this investment, reaffirming its position as the primary source of foreign capital. Other significant investors included the United Kingdom and Spain, each contributing 6% of total FDI. This distribution reflected Costa Rica’s strong economic ties with Western countries and its attractiveness as an investment destination. In contrast, outward FDI from Costa Rica was modest, representing about 3% of GDP as of 2011. The majority of these outward investments were concentrated in Central America, which accounted for roughly 57% of Costa Rican investments abroad, indicating a regional focus in the country’s international economic engagement. Tourism has long been a vital component of Costa Rica’s economy, contributing significantly to foreign exchange earnings and employment. Visitor numbers increased steadily over the years, rising from 780,000 in 1996 to 1 million in 1999. By 2008, tourist arrivals had reached 2.089 million, generating US$2.144 billion in revenue. This growth was fueled by the country’s natural attractions, biodiversity, and commitment to sustainable tourism practices. By 2016, tourist arrivals had further expanded to 2.6 million, with total tourism expenditure reaching approximately US$3.4 billion. The sector supported around 110,000 direct jobs and 271,000 indirect jobs, highlighting its critical role in employment generation and economic diversification. Costa Rica’s energy sector is characterized by a notable absence of significant fossil fuel resources, aside from minor coal deposits. The country’s mountainous terrain and abundant rainfall have facilitated the development of hydroelectric power plants, enabling Costa Rica to achieve energy self-sufficiency, except for the importation of refined petroleum products. The reliance on renewable energy sources has positioned the country as a regional leader in sustainable energy production. In 2017, Costa Rica began exploring opportunities to export electricity to neighboring countries, leveraging its surplus renewable energy capacity. The country’s mild climate and prevailing trade winds reduce the need for heating or cooling in most areas, particularly in highland cities where approximately 90% of the population resides. This climatic advantage contributes to lower energy consumption for residential and commercial temperature regulation, enhancing overall energy efficiency. Renewable energy sources dominate Costa Rica’s electricity generation portfolio, accounting for 98.1% of total electricity production in 2016. This mix includes hydroelectric stations, geothermal plants, wind turbines, solar panels, and biomass plants. The extensive use of renewables reflects the country’s commitment to environmental sustainability and energy independence, setting a benchmark for clean energy development in the region.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:59.050860",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 25,
      "generated_content_length": 11341,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Infrastructure",
    "text": "Costa Rica's infrastructure has suffered from a lack of maintenance and new\ninvestment. The country has an extensive road system of more than 30,000\nkilometers, although much of it is in disrepair; this also applies to ports,\nrailways and water delivery systems. According to a 2016 U.S. government\nreport, investment from China which attempted to improve the infrastructure\nfound the \"projects stalled by bureaucratic and legal concerns\".\n\nMost parts of the country are accessible by road. The main highland cities in\nthe country's Central Valley are connected by paved all-weather roads with the\nAtlantic and Pacific coasts and by the Pan American Highway with Nicaragua and\nPanama, the neighboring countries to the North and the South. Costa Rica's\nports are struggling to keep pace with growing trade. They have insufficient\ncapacity, and their equipment is in poor condition. The railroad didn't\nfunction for several years, until recent government effort to reactivate it\nfor city transportation. An August 2016 OECD report provided this summary:\n\"The road network is extensive but of poor quality, railways are in disrepair\nand only slowly being reactivated after having been shut down in the 1990s,\nseaports quality and capacity are deficient. Internal transportation overly\nrelies on private road vehicles as the public transport system, especially\nrailways, is inadequate.\"\n\nIn a June 2017 interview, President Luis Guillermo Solís said that private\nsector investment would be required to solve the problems. \"Of course Costa\nRica’s infrastructure deficit is a challenge that outlasts any one government\nand I hope that we have created the foundations for future administrations to\ncontinue building. I have just enacted a law to facilitate Public Private\nPartnerships, which are the ideal way to develop projects that are too large\nfor the government to undertake. For example the new airport that we are\nbuilding to serve the capital city will cost $2 billion, so it will need\nprivate-sector involvement. There is also the potential for a ‘dry canal’\nlinking sea ports on our Atlantic and Caribbean Coasts that could need up to\n$16 billion of investment.\"\n\nThe government hopes to bring foreign investment, technology, and management\ninto the telecommunications and electrical power sectors, which are monopolies\nof the state. ICE (Instituto Costarricense de Electricidad) has the monopoly\non telecommunications, internet and electricity services. Some limited\ncompetition is allowed. In 2011, two new private companies began offering\ncellular phone service and others offer voice communication over internet\nconnections (VOIP) for overseas calls.\n\nAccording to transparency.org, Costa Rica had a reputation as one of the most\nstable, prosperous, and among the least corrupt in Latin America in 2007.\nHowever, in fall 2004, three former Costa Rican presidents, José María\nFigueres, Miguel Angel Rodríguez, and Rafael Angel Calderon, were investigated\non corruption charges related to the issuance of government contracts. After\nextensive legal proceedings Calderon and Rodriguez were sentenced; however,\nthe inquiry on Figueres was dismissed and he was not charged.\n\nMore recently, Costa Rica reached 40th place in 2015, with a score of 55 on\nthe Perception of Corruption scale; this is better than the global average.\nCountries with the lowest perceived corruption rated 90 on the scale. In late\nMay 2017, the country Costa Rica applied to become a member of the OECD Anti-\nBribery Convention, to be effective in July 2017.",
    "openai_summarised_points": [
      "• Costa Rica's infrastructure has suffered from a lack of maintenance and new investment, leading to widespread deterioration across multiple sectors.",
      "• The country has an extensive road system exceeding 30,000 kilometers; however, much of this infrastructure is in disrepair.",
      "• Infrastructure issues also affect ports, railways, and water delivery systems, all of which are in poor condition.",
      "• A 2016 U.S. government report indicated that Chinese investment aimed at improving infrastructure faced delays due to bureaucratic and legal concerns, resulting in stalled projects.",
      "• Most regions of Costa Rica are accessible by road, with the main highland cities in the Central Valley connected via paved all-weather roads to both the Atlantic and Pacific coasts.",
      "• The Pan American Highway links Costa Rica with Nicaragua and Panama, its neighboring countries to the North and South.",
      "• Costa Rica’s ports are struggling to keep pace with increasing trade volumes, suffering from insufficient capacity and outdated equipment.",
      "• The railway system was non-operational for several years until recent government efforts to reactivate it for urban transportation purposes.",
      "• An August 2016 OECD report summarized the infrastructure situation as follows: the road network is extensive but of poor quality; railways are in disrepair and only gradually being reactivated after shutdowns in the 1990s; seaports lack sufficient capacity and have poor quality infrastructure; internal transportation heavily depends on private road vehicles due to inadequate public transport, especially rail services.",
      "• In a June 2017 interview, President Luis Guillermo Solís emphasized the need for private sector investment to address infrastructure deficiencies.",
      "• President Solís noted that infrastructure challenges are long-term and require ongoing efforts across administrations; he enacted legislation to facilitate Public-Private Partnerships (PPPs) for large projects.",
      "• Examples of large infrastructure projects include a new $2 billion airport serving the capital city and a potential ‘dry canal’ linking Atlantic and Caribbean sea ports, which could require up to $16 billion in investment.",
      "• The Costa Rican government aims to attract foreign investment, technology, and management to the telecommunications and electrical power sectors, which are currently monopolized by the state.",
      "• The Instituto Costarricense de Electricidad (ICE) holds a monopoly over telecommunications, internet, and electricity services, though limited competition exists; in 2011, two private companies began offering cellular services, and VOIP providers offer overseas voice communication.",
      "• According to transparency.org, Costa Rica was regarded in 2007 as one of Latin America’s most stable, prosperous, and least corrupt countries.",
      "• In fall 2004, three former presidents—José María Figueres, Miguel Angel Rodríguez, and Rafael Angel Calderon—were investigated for corruption related to government contracts; Calderon and Rodríguez were sentenced after legal proceedings, while the inquiry into Figueres was dismissed.",
      "• By 2015, Costa Rica ranked 40th globally on the Perception of Corruption scale with a score of 55, indicating a perception of lower corruption than the global average; countries with the lowest perceived corruption scored 90 on the scale.",
      "• In late May 2017, Costa Rica applied to join the OECD Anti-Bribery Convention, with accession expected to take effect in July 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:19:19.968051",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3535,
      "bullet_points_count": 18
    },
    "generated_detailed_content": "Costa Rica’s infrastructure has experienced significant challenges due to a prolonged lack of maintenance and insufficient new investment, resulting in widespread deterioration across multiple sectors. This neglect has affected critical components of the country’s physical framework, including transportation networks, port facilities, railways, and water delivery systems. Despite possessing an extensive road system that exceeds 30,000 kilometers in length, much of this infrastructure remains in poor condition, undermining its reliability and efficiency. The deterioration is not limited to roads; ports and railways, essential for trade and mobility, also suffer from outdated equipment and inadequate capacity, while water delivery systems face operational difficulties, further complicating the country’s development prospects. The road network, while extensive, reflects these broader infrastructural deficiencies. Most regions of Costa Rica are accessible by road, with the main highland cities located in the Central Valley connected to both the Atlantic and Pacific coasts by paved, all-weather roads. This connectivity is vital for economic activities, including tourism and commerce. The Pan American Highway serves as a critical artery linking Costa Rica with its neighboring countries, Nicaragua to the north and Panama to the south, facilitating regional integration and trade. However, despite this extensive coverage, the overall quality of the road infrastructure remains substandard, with many routes requiring urgent repair and modernization to meet increasing traffic demands and safety standards. Ports in Costa Rica have struggled to keep pace with growing trade volumes, hampered by insufficient capacity and outdated infrastructure. The country’s seaports are vital gateways for imports and exports, yet they face challenges such as limited space for expansion, aging equipment, and operational inefficiencies that constrain their ability to handle larger ships and increased cargo throughput. These limitations impact Costa Rica’s competitiveness in global markets, as delays and higher costs can deter potential trade partners and investors. Similarly, the railway system, once a backbone of national transport, was non-operational for several years following a period of decline. Recent government initiatives have sought to reactivate the railways primarily for urban transportation purposes, aiming to alleviate road congestion and provide more sustainable transit options, though progress has been gradual and the system remains far from fully restored. A 2016 report by the United States government highlighted the complexities surrounding infrastructure development in Costa Rica, noting that Chinese investment aimed at improving infrastructure faced significant delays due to bureaucratic and legal concerns. These challenges resulted in stalled projects, reflecting broader issues within the country’s administrative and regulatory frameworks that hinder timely implementation of infrastructure improvements. Such delays have contributed to the persistence of infrastructural deficits and underscore the need for reforms to streamline processes and attract sustained investment. An August 2016 report by the Organisation for Economic Co-operation and Development (OECD) provided a comprehensive assessment of Costa Rica’s infrastructure situation. The OECD characterized the road network as extensive but of poor quality, emphasizing the need for substantial upgrades and maintenance. The railway system was described as being in disrepair, with efforts to reactivate it only gradually progressing after shutdowns that occurred in the 1990s. Seaports were noted to lack sufficient capacity and to suffer from poor quality infrastructure, limiting their ability to support the country’s trade ambitions. The report also highlighted that internal transportation heavily depended on private road vehicles due to inadequate public transport options, particularly the underdeveloped rail services, which constrained mobility and contributed to traffic congestion and environmental concerns. In response to these persistent infrastructure challenges, President Luis Guillermo Solís, in a June 2017 interview, emphasized the critical role of private sector investment in addressing the country’s infrastructural deficiencies. He acknowledged that the scope and scale of the problems required long-term, sustained efforts that would extend beyond the tenure of any single administration. To facilitate such efforts, President Solís enacted legislation aimed at promoting Public-Private Partnerships (PPPs) for large infrastructure projects, seeking to leverage private capital, expertise, and efficiency to complement public resources. This legislative framework was designed to attract investment and accelerate the development of key infrastructure assets. Among the large-scale infrastructure projects envisioned under this approach were a new $2 billion airport intended to serve the capital city, San José, and a potential ‘dry canal’ linking Atlantic and Caribbean sea ports. The airport project aimed to modernize and expand air transport capacity to accommodate growing passenger and cargo traffic, enhancing Costa Rica’s connectivity and economic competitiveness. The proposed dry canal, a multimodal transport corridor, could require an investment of up to $16 billion and would function as an alternative to the Panama Canal by facilitating the movement of goods between the two coasts via land transport. These ambitious projects exemplify the government’s strategic vision to transform the country’s infrastructure landscape through significant capital infusion and innovative partnerships. In addition to transportation infrastructure, the Costa Rican government has sought to attract foreign investment, technology, and management expertise to the telecommunications and electrical power sectors, which remain predominantly monopolized by the state. The Instituto Costarricense de Electricidad (ICE) holds a monopoly over telecommunications, internet, and electricity services, controlling the majority of these vital utilities. Although limited competition exists, such as the entry of two private companies offering cellular services since 2011 and the presence of Voice over Internet Protocol (VOIP) providers facilitating overseas voice communication, the market remains largely dominated by ICE. The government’s objective in opening these sectors to greater foreign participation is to enhance service quality, expand coverage, and introduce technological innovation, thereby supporting broader economic development goals. Costa Rica’s reputation for political stability, prosperity, and relatively low levels of corruption has been recognized internationally. According to transparency.org, in 2007 the country was regarded as one of Latin America’s most stable and least corrupt nations, fostering an environment conducive to investment and governance reforms. However, the country has not been immune to corruption scandals. In the fall of 2004, three former presidents—José María Figueres, Miguel Ángel Rodríguez, and Rafael Ángel Calderón—were investigated for corruption related to government contracts. Legal proceedings resulted in the sentencing of Calderón and Rodríguez, while the inquiry into Figueres was ultimately dismissed. These events underscored the challenges of maintaining transparency and accountability at the highest levels of government. By 2015, Costa Rica ranked 40th globally on the Perception of Corruption scale, with a score of 55. This score indicated a perception of lower corruption than the global average, though it also highlighted room for improvement. Countries with the lowest perceived corruption typically scored around 90 on this scale, illustrating the ongoing efforts required to strengthen institutional integrity. In a further demonstration of its commitment to combating corruption, Costa Rica applied in late May 2017 to join the OECD Anti-Bribery Convention, with accession expected to take effect in July 2017. This move signaled the country’s intention to align with international standards and best practices in anti-corruption measures, reinforcing its dedication to transparency and good governance as foundational elements of sustainable development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:32.614478",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 18,
      "generated_content_length": 8358,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Foreign trade",
    "text": "FTA Costa Rica has approved / is negotiating\n\nCosta Rica has sought to widen its economic and trade ties, both within and\noutside the region. Costa Rica signed a bilateral trade agreement with Mexico\nin 1994, which was later amended to cover a wider range of products. Costa\nRica joined other Central American countries, plus the Dominican Republic, in\nestablishing a Trade and Investment Council with the United States in March\n1998, which later became the Dominican Republic–Central America Free Trade\nAgreement. Costa Rica has bilateral free trade agreements with the following\ncountries and blocs which took effect on (see date):\n\n* Canada (November 1, 2002)\n* Caribbean Community (CARICOM)¨ (November 15, 2002)\n* Chile (February 15, 2002)\n* China (August 1, 2011).\n* Colombia (September 2016)\n* Dominican Republic (March 7, 2002)\n* El Salvador Customs union, (1963, re-launched on October 29, 1993)\n* European Free Trade Association (2013)\n* European Union (October 1, 2013)\n* Guatemala Customs union, (1963, re-launched on October 29, 1993)\n* Honduras Customs union, (1963, re-launched on October 29, 1993)\n* Mexico (January 1, 1995)\n* Nicaragua Customs union, (1963, re-launched on October 29, 1993)\n* Panama (July 31, 1973, renegotiated and expanded for January 1, 2009)\n* Peru (June 1, 2013)\n* United States (January 1, 2009, CAFTA-DR)\n* Singapore (April 6, 2010)\n* South Korea (March 18, 2019)\n\nThere are no significant trade barriers that would affect imports and the\ncountry has been lowering its tariffs in accordance with other Central\nAmerican countries. Costa Rica also is a member of the Cairns Group, an\norganization of agricultural exporting countries that are seeking access to\nmore markets to increase the exports of agricultural products. Opponents of\nfree agricultural trade have sometimes attempted to block imports of products\nalready grown in Costa Rica, including rice, potatoes, and onions. By 2015,\nCosta Rica's agricultural exports totalled US$2.7 billion.\n\nIn 2015, the top export destinations for all types of products were the United\nStates (US$4.29 billion), Guatemala ($587 million), the Netherlands ($537\nmillion), Panama ($535 million) and Nicaragua ($496 million). The top import\norigins were the United States ($6.06 billion), China ($1.92 billion), Mexico\n($1.14 billion), Japan ($410 million) and Guatemala ($409 million). The most\nsignificant products imported were Refined Petroleum (8.41% of the total\nimports) and Automobiles (4.68%). Total imports in 2015 were US$15 billion,\nsomewhat higher than the total exports of a US$12.6 billion, for a negative\ntrade balance of US$2.39 billion.",
    "openai_summarised_points": [
      "• Costa Rica has actively sought to expand its economic and trade relations both regionally and globally, engaging in multiple free trade agreements (FTAs) and negotiations.",
      "• In 1994, Costa Rica signed a bilateral trade agreement with Mexico, which was subsequently amended to include a broader range of products, enhancing bilateral trade relations.",
      "• In March 1998, Costa Rica, along with other Central American countries and the Dominican Republic, established a Trade and Investment Council with the United States, which later evolved into the Dominican Republic–Central America Free Trade Agreement (CAFTA-DR).",
      "• Costa Rica has entered into bilateral free trade agreements with numerous countries and blocs, with effective dates as follows:",
      "• Canada: November 1, 2002",
      "• Caribbean Community (CARICOM): November 15, 2002",
      "• Chile: February 15, 2002",
      "• China: August 1, 2011",
      "• Colombia: September 2016",
      "• Dominican Republic: March 7, 2002",
      "• El Salvador Customs Union: originally established in 1963, re-launched on October 29, 1993",
      "• European Free Trade Association (EFTA): 2013",
      "• European Union (EU): October 1, 2013",
      "• Guatemala Customs Union: originally 1963, re-launched on October 29, 1993",
      "• Honduras Customs Union: originally 1963, re-launched on October 29, 1993",
      "• Mexico: January 1, 1995",
      "• Nicaragua Customs Union: originally 1963, re-launched on October 29, 1993",
      "• Panama: July 31, 1973, renegotiated and expanded effective January 1, 2009",
      "• Peru: June 1, 2013",
      "• United States: January 1, 2009, under CAFTA-DR",
      "• Singapore: April 6, 2010",
      "• South Korea: March 18, 2019",
      "• Costa Rica has minimal trade barriers, with ongoing efforts to reduce tariffs in line with other Central American nations, facilitating smoother import and export processes.",
      "• The country is a member of the Cairns Group, an organization of agricultural exporting countries advocating for greater access to international markets to boost agricultural exports.",
      "• Domestic opponents of free agricultural trade have occasionally attempted to block imports of locally produced goods such as rice, potatoes, and onions.",
      "• By 2015, Costa Rica’s agricultural exports totaled approximately US$2.7 billion.",
      "• In 2015, the leading export destinations were:",
      "• United States: US$4.29 billion",
      "• Guatemala: US$587 million",
      "• Netherlands: US$537 million",
      "• Panama: US$535 million",
      "• Nicaragua: US$496 million",
      "• The primary sources of imports in 2015 were:",
      "• United States: US$6.06 billion",
      "• China: US$1.92 billion",
      "• Mexico: US$1.14 billion",
      "• Japan: US$410 million",
      "• Guatemala: US$409 million",
      "• The most significant imported products in 2015 were Refined Petroleum, accounting for 8.41% of total imports, and Automobiles, comprising 4.68%.",
      "• Total imports in 2015 amounted to approximately US$15 billion, exceeding exports of US$12.6 billion, resulting in a negative trade balance of US$2.39 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:19:31.846113",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2631,
      "bullet_points_count": 40
    },
    "generated_detailed_content": "Costa Rica has pursued an active strategy to broaden its economic and trade relationships both within the Central American region and on the global stage, engaging in a series of free trade agreements (FTAs) and ongoing negotiations to facilitate market access and enhance bilateral and multilateral commerce. This approach reflects the country's commitment to integrating its economy with international markets, thereby promoting export growth and attracting foreign investment. The expansion of trade ties has been a cornerstone of Costa Rica’s economic policy, aimed at diversifying export destinations and reducing dependency on any single market. A significant milestone in Costa Rica’s trade liberalization efforts occurred in 1994 when the country signed a bilateral trade agreement with Mexico. This initial agreement laid the foundation for stronger economic cooperation between the two nations, which was subsequently amended to encompass a broader spectrum of products. The expansion of the agreement allowed for increased bilateral trade flows, fostering closer commercial ties and providing Costa Rican exporters with improved access to the Mexican market. The modernization of this agreement reflected the evolving economic priorities of both countries and underscored Costa Rica’s commitment to regional trade integration. In March 1998, Costa Rica joined forces with other Central American countries and the Dominican Republic to establish a Trade and Investment Council in partnership with the United States. This council served as a platform for dialogue and cooperation on trade issues and ultimately evolved into the Dominican Republic–Central America Free Trade Agreement (CAFTA-DR). CAFTA-DR represented a landmark regional trade pact designed to eliminate tariffs, reduce trade barriers, and promote investment among the member countries. Costa Rica’s involvement in this agreement marked a critical step toward deeper economic integration with the United States, its largest trading partner, and reinforced the country’s role in regional economic frameworks. Over the years, Costa Rica has entered into numerous bilateral free trade agreements with various countries and regional blocs, each with specific effective dates marking their implementation. The agreement with Canada came into force on November 1, 2002, facilitating trade and investment flows between the two nations. Similarly, Costa Rica signed an FTA with the Caribbean Community (CARICOM), which became effective on November 15, 2002, thereby strengthening ties with Caribbean economies. The pact with Chile, effective February 15, 2002, opened new avenues for trade with South America, while the agreement with China, which took effect on August 1, 2011, marked a significant expansion into Asian markets. Colombia became a trade partner under an FTA that commenced in September 2016, further integrating Costa Rica into the Latin American economic landscape. Costa Rica’s trade relations also extend to the Dominican Republic, with an agreement effective from March 7, 2002, enhancing commercial exchanges within the Caribbean basin. The country’s commitment to regional integration is evident in its participation in customs unions with neighboring Central American countries. The El Salvador Customs Union, originally established in 1963, was re-launched on October 29, 1993, alongside similar re-launches of the Guatemala, Honduras, and Nicaragua Customs Unions on the same date, reflecting renewed efforts to promote regional economic cohesion. The agreement with the European Free Trade Association (EFTA) came into effect in 2013, opening trade channels with member states such as Switzerland, Norway, Iceland, and Liechtenstein. Likewise, the FTA with the European Union, effective October 1, 2013, provided Costa Rican exporters with preferential access to one of the world’s largest markets. Costa Rica’s longstanding trade relationship with Mexico was formalized on January 1, 1995, building upon earlier agreements and expanding market opportunities. The country’s trade ties with Panama date back to July 31, 1973, with a renegotiated and expanded agreement becoming effective on January 1, 2009, reflecting evolving economic conditions and the desire to deepen bilateral cooperation. The agreement with Peru, effective June 1, 2013, further diversified Costa Rica’s trade partnerships in South America. The United States-Costa Rica Free Trade Agreement, implemented on January 1, 2009, under the umbrella of CAFTA-DR, significantly reduced tariffs and trade barriers, facilitating increased bilateral trade and investment. Agreements with Singapore and South Korea, effective April 6, 2010, and March 18, 2019, respectively, marked Costa Rica’s strategic outreach to key Asian economies, enhancing its global trade network. Costa Rica maintains relatively low trade barriers, reflecting a policy orientation toward open markets and economic liberalization. The country has engaged in ongoing efforts to reduce tariffs in alignment with other Central American nations, thereby simplifying import and export procedures and fostering a more competitive trade environment. This commitment to tariff reduction has helped Costa Rica position itself as an attractive destination for foreign investment and as a reliable trading partner within the region and beyond. As a member of the Cairns Group, an international coalition of agricultural exporting countries, Costa Rica advocates for greater access to global markets and the reduction of trade-distorting subsidies and tariffs. The group’s efforts aim to create a fairer international trading system that benefits agricultural producers by expanding export opportunities. Despite this outward-looking stance, domestic opposition to free agricultural trade has occasionally surfaced, with some groups attempting to block imports of locally produced goods such as rice, potatoes, and onions. These protectionist tendencies reflect concerns about the impact of imports on domestic producers and the preservation of traditional agricultural sectors. By 2015, Costa Rica’s agricultural exports had reached approximately US$2.7 billion, underscoring the sector’s importance to the national economy and its role in foreign trade. The country’s export destinations in 2015 were led by the United States, which accounted for US$4.29 billion in exports, highlighting the significance of this market for Costa Rican products. Other major export destinations included Guatemala, with US$587 million; the Netherlands, with US$537 million; Panama, with US$535 million; and Nicaragua, with US$496 million. These figures illustrate Costa Rica’s diversified export portfolio and its ability to access markets across the Americas and Europe. On the import side, the United States was also the primary source of goods in 2015, supplying imports valued at US$6.06 billion. China followed as the second-largest source, with imports totaling US$1.92 billion, reflecting the growing economic ties between Costa Rica and the Asian giant. Mexico was the third-largest supplier, providing US$1.14 billion worth of goods, while Japan and Guatemala contributed US$410 million and US$409 million, respectively. The composition of imports in 2015 was dominated by refined petroleum, which accounted for 8.41% of total imports, underscoring the country’s dependence on energy products. Automobiles represented 4.68% of imports, reflecting demand for transportation equipment and vehicles. Overall, Costa Rica’s total imports in 2015 amounted to approximately US$15 billion, surpassing exports, which totaled US$12.6 billion. This resulted in a negative trade balance of US$2.39 billion, indicating that the country imported more goods and services than it exported during that year. The trade deficit highlights ongoing challenges in balancing trade flows, despite the country’s extensive network of free trade agreements and efforts to expand export markets.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:53.751349",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 40,
      "generated_content_length": 7980,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Foreign Direct Investment",
    "text": "The Costa Rican government has and is “actively courting FDI” in order to help\ndevelop its economy. Foreign Direct Investment (FDI) is a form of investment\nthat promotes development in key industries such as manufacturing, medicine,\nand tourism. FDI's influence provides a very lucrative opportunity for foreign\ninvestors which is what continues to attract such large investments year over\nyear. Over time FDI inflows in Costa Rica have increased, Net FDI inflow\naveraged forty four million dollars per year from 1970 to 1979 and just ten\nyears later this value rose to four hundred and sixteen million dollars. The\n2022 data show that Costa Rica received $3 billion in FDI which accounted for\n4.45% of their total GDP.\n\nGrowth in FDI is linked to rising tourist arrivals with the numbers rising\nfrom 2.1 million in 2011 to 3.1 million in 2019. Facilitation of FDI growth is\nseen as an essential role of the Costa Rican government. Throughout 2019 and\n2022, the government of Costa Rica was able to court investment for a total of\n16 new FDI projects with one of the more notable projects being a luxury hotel\nnamed One and Only Papagayo.",
    "openai_summarised_points": [
      "• The Costa Rican government has been actively courting Foreign Direct Investment (FDI) to support economic development across key sectors such as manufacturing, medicine, and tourism.",
      "• FDI is recognized as a lucrative opportunity for foreign investors, which has resulted in consistent large-scale investments annually.",
      "• From 1970 to 1979, the average net FDI inflow into Costa Rica was approximately forty-four million dollars per year.",
      "• By 1989, just ten years later, the average annual net FDI inflow had increased significantly to approximately four hundred and sixteen million dollars.",
      "• In 2022, Costa Rica received a total of 3 billion dollars in FDI, representing 4.45% of the country's total Gross Domestic Product (GDP).",
      "• Growth in FDI is correlated with an increase in tourist arrivals, which rose from 2.1 million visitors in 2011 to 3.1 million visitors in 2019.",
      "• The Costa Rican government considers the facilitation of FDI growth an essential role in its economic strategy.",
      "• During the years 2019 and 2022, the government successfully attracted investment for a total of 16 new FDI projects.",
      "• One of the notable FDI projects during this period was the development of the luxury hotel named One and Only Papagayo."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:19:36.557462",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1138,
      "bullet_points_count": 9
    },
    "generated_detailed_content": "The Costa Rican government has actively pursued Foreign Direct Investment (FDI) as a pivotal component of its economic development strategy, targeting key sectors such as manufacturing, medicine, and tourism. Recognizing the potential of FDI to stimulate growth, create employment opportunities, and enhance technological capabilities, policymakers have implemented a range of incentives and regulatory frameworks designed to attract and retain foreign investors. These efforts have included streamlined administrative procedures, tax incentives, and the establishment of free trade zones, all aimed at fostering an environment conducive to international capital inflows. The strategic focus on sectors like manufacturing and medicine reflects Costa Rica’s ambition to diversify its economy beyond traditional agricultural exports, while the emphasis on tourism capitalizes on the country’s rich biodiversity and natural attractions. FDI has been widely regarded as a lucrative opportunity for foreign investors, which has translated into consistent large-scale investments year after year. This sustained influx of capital has played a significant role in modernizing Costa Rica’s industrial base and expanding its service sectors. The country’s political stability, relatively high levels of education, and growing infrastructure have further enhanced its attractiveness as an investment destination. As a result, multinational corporations from North America, Europe, and Asia have increasingly established operations in Costa Rica, contributing to the country’s integration into global production chains and boosting export capacity. The positive perception of Costa Rica as a reliable and profitable investment location has reinforced a virtuous cycle of investment and economic growth. Historically, the trajectory of FDI inflows into Costa Rica reveals a marked upward trend over several decades. Between 1970 and 1979, the average net FDI inflow was approximately forty-four million dollars per year. This period was characterized by initial efforts to open the economy to foreign capital, with the government beginning to implement policies aimed at attracting investment, albeit on a relatively modest scale compared to later decades. The inflows during the 1970s laid the groundwork for more ambitious economic reforms and investment promotion initiatives that would follow. Despite global economic challenges during this era, Costa Rica managed to maintain a steady, if limited, level of foreign investment. By 1989, just ten years later, the average annual net FDI inflow had increased significantly to approximately four hundred and sixteen million dollars. This dramatic rise reflected the success of economic liberalization policies undertaken in the 1980s, including trade liberalization, deregulation, and the promotion of export-oriented industries. The government’s commitment to integrating Costa Rica into the global economy attracted a broader range of investors, particularly in sectors such as electronics manufacturing and medical devices, which became cornerstones of the country’s export portfolio. The substantial growth in FDI during this decade underscored the effectiveness of policy reforms and the increasing confidence of foreign investors in Costa Rica’s economic prospects. In more recent years, Costa Rica has continued to experience robust growth in FDI inflows. In 2022, the country received a total of 3 billion dollars in foreign direct investment, representing 4.45% of its total Gross Domestic Product (GDP). This level of investment underscores Costa Rica’s status as a competitive destination for international capital within the Central American region. The substantial share of GDP attributed to FDI highlights the integral role that foreign investment plays in the country’s economic structure, supporting job creation, infrastructure development, and technological advancement. The 2022 figures also reflect the resilience of Costa Rica’s investment climate despite global economic uncertainties and disruptions caused by the COVID-19 pandemic. The growth in FDI has been closely correlated with an increase in tourist arrivals, illustrating the interconnectedness of investment and tourism development in Costa Rica. Tourist arrivals rose from 2.1 million visitors in 2011 to 3.1 million visitors in 2019, representing a significant expansion of the tourism sector over less than a decade. This surge in visitors has attracted foreign investors interested in developing hospitality infrastructure, including hotels, resorts, and related services. The expansion of tourism has not only generated direct economic benefits but has also enhanced the country’s international profile, further encouraging investment in complementary sectors such as transportation and real estate. The government’s efforts to promote sustainable tourism have also appealed to investors focused on eco-friendly and socially responsible projects. The facilitation of FDI growth remains an essential role within Costa Rica’s broader economic strategy, as articulated by government officials and development agencies. Authorities have prioritized the creation of a favorable investment climate through ongoing reforms aimed at reducing bureaucratic hurdles, enhancing legal protections for investors, and improving infrastructure. Public-private partnerships and investment promotion agencies have been instrumental in identifying potential investors and facilitating their entry into the market. The government’s proactive stance includes targeted marketing campaigns, participation in international trade fairs, and bilateral agreements designed to stimulate cross-border investment flows. This comprehensive approach underscores the recognition that sustained FDI is critical to achieving long-term economic diversification and competitiveness. Between 2019 and 2022, the Costa Rican government successfully attracted investment for a total of 16 new FDI projects, reflecting continued momentum in foreign capital inflows despite global economic challenges. These projects spanned various sectors, including advanced manufacturing, technology, and tourism, demonstrating the country’s ability to appeal to a diverse range of investors. The successful attraction of these projects was facilitated by coordinated efforts between government agencies, local authorities, and private sector stakeholders, ensuring that investment opportunities were aligned with national development priorities. The influx of new projects during this period contributed to job creation, technology transfer, and increased export capacity, reinforcing Costa Rica’s position as a hub for foreign investment in the region. One of the most notable FDI projects during this period was the development of the luxury hotel named One and Only Papagayo. This high-profile investment exemplifies the intersection of tourism development and foreign capital inflows, highlighting Costa Rica’s appeal to upscale international investors seeking to capitalize on the country’s natural beauty and growing reputation as a premium travel destination. The One and Only Papagayo project involved significant capital expenditure and was expected to generate numerous employment opportunities, both during construction and operational phases. Its development also underscored the government’s commitment to promoting sustainable and high-quality tourism infrastructure, which aligns with broader economic goals of enhancing Costa Rica’s global competitiveness and diversifying its tourism offerings.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:37:48.701233",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 9,
      "generated_content_length": 7582,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Costa Rica",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Statistics",
    "text": "The following table shows the main economic indicators in 1980–2019 (with IMF\nstaff stimtates in 2020–2025). Inflation below 5% is in green.\n\nYear | GDP\n(in Bil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980 | 8.2 | 3,560.1 | 4.9 | 2,108.8 | 0.8% | 18.1% | 5.9% | n/a\n1981 | 8.8 | 3,696.2 | 2.6 | 1,111.4 | -2.3% | 36.8% | 8.8% | n/a\n1982 | 8.6 | 3,532.8 | 2.6 | 1,071.9 | -7.3% | 90.3% | 9.4% | n/a\n1983 | 9.2 | 3,669.0 | 3.2 | 1,257.4 | 2.9% | 32.5% | 9.2% | n/a\n1984 | 10.3 | 3,990.2 | 3.7 | 1,421.2 | 8.0% | 12.0% | 5.4% | n/a\n1985 | 10.7 | 4,024.5 | 3.9 | 1,478.4 | 0.7% | 15.1% | 6.8% | n/a\n1986 | 11.6 | 4,206.3 | 4.4 | 1,611.3 | 5.5% | 11.8% | 6.2% | n/a\n1987 | 12.4 | 4,391.3 | 4.6 | 1,612.6 | 4.8% | 16.8% | 5.6% | n/a\n1988 | 13.3 | 4,577.5 | 4.6 | 1,598.0 | 3.4% | 20.8% | 5.5% | n/a\n1989 | 14.6 | 4,898.1 | 5.3 | 1,763.5 | 5.7% | 16.5% | 3.8% | n/a\n1990 | 15.7 | 5,137.4 | 5.7 | 1,880.8 | 3.6% | 19.1% | 4.6% | n/a\n1991 | 16.6 | 5,307.6 | 7.2 | 2,305.4 | 2.3% | 20.2% | 5.5% | n/a\n1992 | 18.5 | 5,798.8 | 8.6 | 2,684.1 | 9.2% | 21.8% | 4.1% | n/a\n1993 | 20.3 | 6,195.0 | 9.6 | 2,926.9 | 7.1% | 9.8% | 4.1% | n/a\n1994 | 21.7 | 6,421.8 | 10.5 | 3,110.2 | 4.5% | 13.6% | 4.2% | n/a\n1995 | 23.0 | 6,637.5 | 11.6 | 3,336.7 | 4.2% | 23.2% | 5.2% | n/a\n1996 | 23.8 | 6,668.1 | 11.7 | 3,277.6 | 1.4% | 17.5% | 6.2% | 33.7%\n1997 | 25.5 | 6,974.7 | 12.6 | 3,450.9 | 5.5% | 13.3% | 5.7% | 30.6%\n1998 | 27.6 | 7,375.4 | 13.7 | 3,653.2 | 7.2% | 11.7% | 5.6% | 40.7%\n1999 | 29.2 | 7,610.4 | 14.3 | 3,715.4 | 4.2% | 10.0% | 6.0% | 39.0%\n2000 | 31.0 | 8,142.2 | 15.0 | 3,941.1 | 3.9% | 11.0% | 5.2% | 38.9%\n2001 | 32.8 | 8,304.2 | 16.0 | 4,041.9 | 3.5% | 11.3% | 6.1% | 39.6%\n2002 | 34.5 | 8,572.1 | 16.6 | 4,122.8 | 3.4% | 9.2% | 6.4% | 41.4%\n2003 | 36.7 | 8,975.9 | 17.3 | 4,227.8 | 4.3% | 9.4% | 6.7% | 40.6%\n2004 | 39.3 | 9,473.0 | 18.6 | 4,483.6 | 4.4% | 12.3% | 6.5% | 41.0%\n2005 | 42.2 | 10,005.8 | 20.0 | 4,756.3 | 4.0% | 13.8% | 6.6% | 37.3%\n2006 | 46.7 | 10,906.2 | 22.7 | 5,309.3 | 7.3% | 11.5% | 6.0% | 33.0%\n2007 | 51.9 | 11,948.7 | 26.9 | 6,194.0 | 8.2% | 9.4% | 4.6% | 27.0%\n2008 | 55.4 | 12,570.4 | 30.8 | 6,993.9 | 4.7% | 13.4% | 4.9% | 24.0%\n2009 | 55.2 | 12,357.3 | 30.7 | 6,879.3 | -0.9% | 7.8% | 7.8% | 26.0%\n2010 | 58.9 | 12,931.5 | 37.7 | 8,268.9 | 5.4% | 5.7% | 9.2% | 28.1%\n2011 | 62.8 | 13,605.9 | 42.8 | 9,270.6 | 4.4% | 4.9% | 10.5% | 29.5%\n2012 | 67.1 | 14,367.7 | 47.2 | 10,107.5 | 4.9% | 4.5% | 9.8% | 33.7%\n2013 | 71.2 | 15,034.6 | 50.9 | 10,764.5 | 2.5% | 5.2% | 8.3% | 35.1%\n2014 | 77.0 | 16,076.6 | 52.0 | 10,853.6 | 3.5% | 4.5% | 9.7% | 37.4%\n2015 | 82.9 | 17,079.8 | 56.4 | 11,635.2 | 3.7% | 0.8% | 9.6% | 39.8%\n2016 | 90.8 | 18,503.2 | 58.8 | 11,986.9 | 4.2% | 0.0% | 9.5% | 44.1%\n2017 | 97.9 | 19,711.7 | 60.5 | 12,185.3 | 4.2% | 1.6% | 9.3% | 47.1%\n2018 | 102.9 | 20,480.0 | 62.4 | 12,428.9 | 2.6% | 2.2% | 12.0% | 51.8%\n2019 | 107.1 | 21,093.9 | 64.1 | 12,623.2 | 2.3% | 2.1% | 12.4% | 56.7%\n2020 | 103.9 | 20,268.7 | 61.8 | 12,057.0 | -4.1% | 0.7% | 20.0% | 67.5%\n2021 | 111.9 | 21,592.5 | 61.5 | 11,860.2 | 3.9% | 1.3% | 16.3% | 71.2%\n2022 | 119.0 | 22,725.7 | 64.4 | 12,294.1 | 3.5% | 1.5% | 14.0% | 73.3%\n2023 | 125.6 | 23,739.7 | 68.2 | 12,883.9 | 3.1% | 1.8% | 12.0% | 73.7%\n2024 | 132.4 | 24,774.6 | 72.2 | 13,509.2 | 3.1% | 2.1% | 10.5% | 73.1%\n2025 | 139.7 | 25,852.6 | 76.4 | 14,140.2 | 3.2% | 2.5% | 9.5% | 71.6%\n2026 | 147.3 | 26,977.3 | 81.1 | 14,853.3 | 3.3% | 2.9% | 9.0% | 69.2%\nPoás Volcano Crater is one of Costa Rica's main tourist attractions.\n\n**GDP:** US$61.5 billion (2017 estimate)\n\n**GDP real growth rate:** 4.3% (2017 estimate)\n\n**GDP per capita:** purchasing power parity: $12,382 (2017 estimate)\n\n**GDP composition by sector:** _agriculture:_ 5.5% (2016 estimate) Bananas,\npineapples, coffee, beef, sugarcane, rice, corn, dairy products, vegetables,\ntimber, fruits and ornamental plants. _industry:_ 18.6% (2016 estimate)\nElectronic components, food processing, textiles and apparel, construction\nmaterials, cement, fertilizer. _services:_ 75.9% (2016 estimate) Hotels,\nrestaurants, tourist services, banks, call centers and insurance.\n\n**Government bond ratings:** (January 2017) Standard & Poor's: BB−; Moody's:\nBa2\n\n**Budget deficit:** 6.1 percent of the GDP\n\n**Population below poverty line:** 20.5% (2017)\n\n**Household income or consumption by percentage share:** _lowest 10%:_ 1.2%\n_highest 10%:_ 39.5% (2009 est.)\n\n**Inflation rate (consumer prices):** 2.6% (2017 estimate)\n\n**Labor force:** 2.295 million (2016) _Note: 15 and older, excluding\nNicaraguans living in the country_\n\n**Labor force by occupation:** agriculture 12.9%, industry 18.57%, services\n69.02% (2016)\n\n**Unemployment rate:** 8.1% (2017 estimate)\n\n**Budget:** US15.9 billion (2017 proposed) Note: 46% will require financing\n\n**Industries:** microprocessors, food processing, textiles and clothing,\nconstruction materials, fertilizer, plastic products\n\n**Industrial production growth rate:** 4.3% (2013)\n\n**Electricity production:** 9.473 billion kWh (2010)\n\n**Electricity production by source:** 98.1% from \"green sources\" (2016)\n\n**Agriculture products:** bananas, pineapples, other tropical fruits, coffee,\npalm oil, sugar, corn, rice, beans, potatoes, beef, timber\n\n**Exports:** US$12.6 billion (2015)\n\n**Major export commodities:** Medical Instruments ($2B), Bananas ($1.24B),\nTropical Fruits ($1.22B), Integrated Circuits ($841M) and Orthopedic\nAppliances ($555M).\n\n**Export partners (2016):** United States ($4.29B), Guatemala ($587M), the\nNetherlands ($537M), Panama ($535M), Nicaragua ($496M)\n\n**Imports:** US $15.1 billion (2015)\n\n**Major import commodities:** Refined Petroleum ($1.26B), Cars ($702M),\nPackaged Medicaments ($455M), Broadcasting Equipment ($374M) and Computers\n($281M).\n\n**Origin of imports (2016):** United States ($6.06B), China ($1.92B), Mexico\n($1.14B), Japan ($410M) and Guatemala ($409M).\n\n**External debt:** US$26.2 billion (January 2016)\n\n**Economic aid – recipient:** $107.1 million (1995)\n\n**Currency:** 1 Costa Rican colon (₡) = 100 centimos\n\n**Exchange rates:** Costa Rican colones (₡) per US$1 – 526.46 (March 27,\n2015), US$1 – 600 (late May 2017), US$1 – 563 (end of July 2017), US$1 – 677\n(May 2022)\n\n**Fiscal year:** January 1 – December 31",
    "openai_summarised_points": [
      "• The section provides a comprehensive overview of Costa Rica's main economic indicators from 1980 to 2019, with IMF staff estimates extending from 2020 to 2025, highlighting trends in GDP, inflation, unemployment, and debt.",
      "• A color-coding scheme indicates inflation rates below 5%, marked in green within the data table.",
      "• In 1980, Costa Rica's GDP measured US$8.2 billion (PPP), with a GDP per capita of US$3,560.1 (PPP), and a nominal GDP of US$4.9 billion, with a GDP per capita of US$2,108.8.",
      "• The GDP growth rate in 1980 was 0.8%, with an inflation rate of 18.1%, unemployment at 5.9%, and government debt unspecified.",
      "• Throughout the 1980s, the economy experienced fluctuations: for example, in 1982, GDP was US$8.6 billion (PPP), with a significant inflation spike of 90.3%, and unemployment at 9.4%.",
      "• The 1990s saw steady growth: in 1996, GDP was US$23.8 billion (PPP), with a GDP per capita of US$6,668.1 (PPP), and a GDP growth rate of 1.4%.",
      "• The late 1990s and early 2000s marked economic stabilization, with GDP reaching US$29.2 billion (2000), and GDP per capita US$8,142.2 (PPP).",
      "• The 2000s experienced consistent growth: by 2007, GDP was US$51.9 billion, with a GDP per capita of US$11,948.7, and a real GDP growth rate of 8.2%.",
      "• The global financial crisis of 2008-2009 saw GDP slightly decline in 2009 to US$55.2 billion, with a negative growth rate of -0.9%, but recovered thereafter.",
      "• From 2010 onwards, GDP steadily increased, reaching US$97.9 billion in 2018, with a GDP per capita of US$20,480.0 and a growth rate of 2.6%.",
      "• In 2019, GDP was US$107.1 billion, with a GDP per capita of US$21,093.9, and a growth rate of 2.3%.",
      "• The COVID-19 pandemic caused a contraction in 2020, with GDP dropping to US$103.9 billion (-4.1%), and unemployment rising to 20.0%.",
      "• Post-2020, the economy showed recovery: in 2021, GDP increased to US$111.9 billion, with a growth rate of 3.9%, and unemployment decreased to 16.3%.",
      "• The projected data for 2022-2026 indicates continued growth: GDP reaching US$147.3 billion in 2026, with GDP per capita approximately US$26,977.3, and inflation rates remaining below 3%.",
      "• The main tourist attraction is Poás Volcano Crater.",
      "• In 2017, GDP was estimated at US$61.5 billion, with a real growth rate of 4.3% and GDP per capita (PPP) of US$12,382.",
      "• The sectoral composition in 2016 was: agriculture 5.5%, industry 18.6%, and services 75.9%, with agriculture including bananas, pineapples, coffee, beef, sugarcane, rice, corn, dairy, timber, fruits, and ornamental plants.",
      "• The country’s government bond ratings as of January 2017 were BB− (Standard & Poor's) and Ba2 (Moody's).",
      "• The budget deficit stood at 6.1% of GDP, with 20.5% of the population below the poverty line in 2017.",
      "• Household income distribution in 2009 showed the lowest 10% holding 1.2% of income, while the highest 10% held 39.5%.",
      "• The inflation rate for consumer prices was estimated at 2.6% in 2017.",
      "• The labor force comprised approximately 2.295 million people in 2016, excluding Nicaraguans and those under 15.",
      "• Employment by occupation in 2016 was: agriculture 12.9%, industry 18.57%, services 69.02%.",
      "• The unemployment rate in 2017 was estimated at 8.1%.",
      "• The proposed 2017 government budget was US$15.9 billion, with 46% expected to require financing.",
      "• Key industries include microprocessors, food processing, textiles, construction materials, fertilizer, and plastic products.",
      "• Industrial production growth rate was 4.3% in 2013.",
      "• Electricity production in 2010 was 9.473 billion kWh, with 98.1% generated from renewable (\"green\") sources in 2016.",
      "• Major agricultural exports include bananas, pineapples, tropical fruits, coffee, palm oil, sugar, corn, rice, beans, potatoes, beef, and timber.",
      "• Export value in 2015 was US$12.6 billion, with top commodities being Medical Instruments (US$2B), Bananas (US$1.24B), Tropical Fruits (US$1.22B), Integrated Circuits (US$841M), and Orthopedic Appliances (US$555M).",
      "• Main export partners in 2016 were the United States (US$4.29B), Guatemala (US$587M), the Netherlands (US$537M), Panama (US$535M), and Nicaragua (US$496M).",
      "• Imports in 2015 totaled US$15.1 billion, with major commodities including Refined Petroleum (US$1.26B), Cars (US$702M), Packaged Medicaments (US$455M), Broadcasting Equipment (US$374M), and Computers (US$281M).",
      "• Primary sources of imports in 2016 were the United States (US$6.06B), China (US$1.92B), Mexico (US$1.14B), Japan (US$410M), and Guatemala (US$409M).",
      "• External debt as of January 2016 was US$26.2 billion.",
      "• In 1995, Costa Rica received US$107.1 million in foreign aid.",
      "• The national currency is the Costa Rican colon (₡), with 1 colon equal to 100 centimos.",
      "• Exchange rates have fluctuated: in March 2015, US$1 = 526.46 colones; late May 2017, US$1 = 600; end of July 2017, US$1 = 563; May 2022, US$1 = 677.",
      "• The fiscal year runs from January 1 to December 31."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:19:54.175558",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6426,
      "bullet_points_count": 38
    },
    "generated_detailed_content": "Costa Rica's economic indicators from 1980 through 2019 reveal a dynamic trajectory characterized by periods of volatility, growth, stabilization, and recovery, with International Monetary Fund (IMF) staff estimates extending projections through 2020 to 2025. These data encompass key measures including gross domestic product (GDP), inflation rates, unemployment levels, and government debt, providing a comprehensive overview of the nation's economic performance over nearly four decades. A color-coded scheme within the statistical tables highlights inflation rates below 5% in green, facilitating an at-a-glance identification of periods of relative price stability. In 1980, Costa Rica's economy was valued at a GDP of US$8.2 billion based on purchasing power parity (PPP), with a GDP per capita of US$3,560.1 (PPP). The nominal GDP for the same year stood at US$4.9 billion, translating to a per capita nominal GDP of US$2,108.8. The economy experienced modest growth with a GDP growth rate of 0.8%, but inflation was notably high at 18.1%, reflecting macroeconomic challenges. Unemployment was recorded at 5.9%, although government debt figures for that year were not specified. The early 1980s were marked by economic fluctuations; for instance, in 1982, GDP (PPP) increased slightly to US$8.6 billion, but the nation faced a severe inflation spike reaching 90.3%, and unemployment rose to 9.4%, indicating economic distress likely linked to external shocks and internal fiscal imbalances. The 1990s ushered in a period of steadier economic growth and relative stabilization. By 1996, Costa Rica's GDP (PPP) had expanded to US$23.8 billion, with GDP per capita rising to US$6,668.1 (PPP). The GDP growth rate during that year was 1.4%, reflecting moderate but positive economic momentum. This decade saw structural reforms and diversification efforts that contributed to economic resilience. Entering the late 1990s and early 2000s, the economy continued to stabilize, with GDP reaching US$29.2 billion in 2000 and GDP per capita (PPP) increasing to US$8,142.2. These figures denote a gradual but steady improvement in economic output and living standards. The first decade of the 21st century was characterized by consistent growth, culminating in significant economic expansion by 2007. That year, Costa Rica's GDP reached US$51.9 billion, with a GDP per capita of US$11,948.7. The real GDP growth rate was robust at 8.2%, reflecting strong domestic and international demand, increased investment, and growth in key sectors such as manufacturing and services. However, the global financial crisis of 2008-2009 impacted the economy, with GDP slightly declining to US$55.2 billion in 2009 and a negative growth rate of -0.9%. Despite this contraction, the economy demonstrated resilience and began recovering in subsequent years. From 2010 onwards, Costa Rica's GDP exhibited steady upward trends, reaching US$97.9 billion in 2018. The GDP per capita rose to US$20,480.0, and the growth rate stabilized at 2.6%, indicating sustained economic expansion and improved socioeconomic conditions. In 2019, GDP further increased to US$107.1 billion, with a GDP per capita of US$21,093.9 and a growth rate of 2.3%, underscoring continued positive economic performance. However, the onset of the COVID-19 pandemic in 2020 caused a significant economic contraction, with GDP falling to US$103.9 billion, representing a decline of 4.1%. Unemployment surged dramatically to 20.0%, reflecting widespread disruptions across sectors, particularly tourism and services. Following the pandemic-induced downturn, Costa Rica's economy showed signs of recovery in 2021. GDP rose to US$111.9 billion, with a growth rate of 3.9%, and unemployment decreased to 16.3%, indicating gradual restoration of economic activity and labor market conditions. Projections for the period 2022 to 2026 suggest continued growth, with GDP expected to reach US$147.3 billion by 2026. GDP per capita is anticipated to approach US$26,977.3, while inflation rates are projected to remain below 3%, signaling controlled price levels and macroeconomic stability. Tourism remains a vital component of Costa Rica's economy, with the Poás Volcano Crater standing out as a principal attraction, drawing significant numbers of international visitors and contributing to foreign exchange earnings. In 2017, the country's GDP was estimated at US$61.5 billion, accompanied by a real growth rate of 4.3%. The GDP per capita (PPP) for that year stood at US$12,382, reflecting ongoing improvements in living standards. The sectoral composition of the economy in 2016 revealed a dominant services sector accounting for 75.9% of GDP, followed by industry at 18.6%, and agriculture at 5.5%. The agricultural sector was diverse, encompassing the production of bananas, pineapples, coffee, beef, sugarcane, rice, corn, dairy products, timber, various fruits, and ornamental plants, highlighting the country's rich natural resources and export potential. Government bond ratings as of January 2017 were BB− according to Standard & Poor's and Ba2 per Moody's, indicating a speculative-grade creditworthiness with some risk factors. The budget deficit in 2017 stood at 6.1% of GDP, reflecting fiscal challenges amid efforts to balance public expenditures and revenues. Poverty remained a concern, with 20.5% of the population living below the poverty line that year. Income distribution data from 2009 illustrated significant inequality: the lowest 10% of the population held only 1.2% of total household income, whereas the highest 10% controlled 39.5%, underscoring disparities in wealth and income. Inflation for consumer prices was estimated at 2.6% in 2017, indicating relatively stable price levels consistent with the central bank's inflation targets. The labor force in 2016 comprised approximately 2.295 million individuals, excluding Nicaraguan migrants and persons under the age of 15, reflecting the active working-age population. Employment by occupation in the same year was distributed with 12.9% engaged in agriculture, 18.57% in industry, and a majority of 69.02% employed in services, demonstrating the economy's transition toward a service-oriented structure. The unemployment rate in 2017 was estimated at 8.1%, reflecting labor market conditions amid economic growth. The proposed government budget for 2017 was US$15.9 billion, with 46% of this amount anticipated to require external financing, highlighting fiscal constraints and the need for borrowing to support public expenditures. Key industries driving the economy included microprocessors, food processing, textiles, construction materials, fertilizer production, and plastic products, showcasing a diversified industrial base with both traditional and high-technology sectors. Industrial production growth was recorded at 4.3% in 2013, reflecting expansion in manufacturing and related activities. Costa Rica's electricity production in 2010 amounted to 9.473 billion kilowatt-hours (kWh), with an impressive 98.1% of electricity generated from renewable, or \"green,\" sources by 2016. This emphasis on sustainable energy underscores the country's commitment to environmental stewardship and energy security. Agricultural exports formed a significant component of foreign trade, including bananas, pineapples, tropical fruits, coffee, palm oil, sugar, corn, rice, beans, potatoes, beef, and timber, reflecting the country’s rich biodiversity and agricultural expertise. In 2015, the total value of exports was US$12.6 billion. The top export commodities included medical instruments valued at US$2 billion, bananas at US$1.24 billion, tropical fruits at US$1.22 billion, integrated circuits at US$841 million, and orthopedic appliances at US$555 million, highlighting a mix of traditional agricultural products and advanced manufacturing goods. Costa Rica's main export partners in 2016 were the United States, receiving US$4.29 billion worth of goods, followed by Guatemala (US$587 million), the Netherlands (US$537 million), Panama (US$535 million), and Nicaragua (US$496 million), illustrating strong trade ties within the Americas and Europe. Imports in 2015 totaled US$15.1 billion, with major commodities including refined petroleum products valued at US$1.26 billion, cars at US$702 million, packaged medicaments at US$455 million, broadcasting equipment at US$374 million, and computers at US$281 million. The primary sources of imports in 2016 were the United States (US$6.06 billion), China (US$1.92 billion), Mexico (US$1.14 billion), Japan (US$410 million), and Guatemala (US$409 million), reflecting diverse supply chains and international economic integration. External debt as of January 2016 was reported at US$26.2 billion, indicating the country's obligations to foreign creditors and the importance of debt management in fiscal policy. In 1995, Costa Rica received US$107.1 million in foreign aid, which contributed to development projects and economic stabilization efforts during that period. The national currency is the Costa Rican colon (₡), subdivided into 100 centimos. Exchange rates have experienced fluctuations over recent years; for example, in March 2015, one US dollar was equivalent to 526.46 colones. By late May 2017, the exchange rate had depreciated to 600 colones per US dollar, before appreciating to 563 colones by the end of July 2017. More recently, in May 2022, the exchange rate was approximately 677 colones per US dollar, reflecting ongoing currency market dynamics influenced by domestic and international economic factors. The fiscal year in Costa Rica runs from January 1 to December 31, aligning with the calendar year for budgetary and financial reporting purposes.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T14:38:12.752460",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 38,
      "generated_content_length": 9741,
      "generation_type": "detailed_expansion"
    }
  }
]