[
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Cape Verde** is a service-oriented economy that is focused on\ncommerce, trade, transport and public services. Cape Verde is a small\narchipelagic nation that lacks resources and has experienced severe droughts.\nAgriculture is made difficult by lack of rain and is restricted to only four\nislands for most of the year. Cape Verde's economy has been steadily growing\nsince the late 1990s, and it is now officially considered a country of average\ndevelopment, being only the second African country to have achieved such\ntransition, after Botswana in 1994. Cape Verde has significant cooperation\nwith Portugal at every level of the economy, which has led it to link its\ncurrency (the Cape Verdean escudo) first to the Portuguese escudo and, in\n1999, to the euro."
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Resources",
    "text": "About 75% of food is imported. Cape Verde annually runs a high trade deficit,\nfinanced by foreign aid and remittances from emigrants; remittances constitute\na supplement to GDP of more than 20%. Economic reforms, launched by the new\ndemocratic government in 1991, are aimed at developing the private sector and\nattracting foreign investment to diversify the economy. Since 1991, the\npolicies the government has pursued include an open welcome to foreign\ninvestors and a far-reaching privatization program.\n\nFish and shellfish are plentiful, and small quantities are exported. Cape\nVerde has cold storage and freezing facilities as well as fish processing\nplants in Mindelo, Praia, and on Sal. However, the fishing potential, mostly\nlobster and tuna, is not fully exploited.\n\nThe economy is service-oriented, with commerce, transport, and public services\naccounting for almost 70% of the GDP. Although nearly 35% of the population\nlives in rural areas, the share of agriculture in GDP in 2010 was only 9.2%\n(up from 8.9% in 1995); of the 1998 total, fishing accounts for 1.5%.\n\nThe Cape Verdean government established the top priorities for development as\nthe promotion of a market economy and of the private sector; the development\nof tourism, light manufacturing industries, and fisheries; and the development\nof transport, communications, and energy facilities. In 1994-95 Cape Verde\nreceived a total of about U.S.$50 million in foreign investments, of which 50%\nwas in industry, 19% in tourism, and 31% in fisheries and services. Prospects\nfor 2000 depend heavily on the maintenance of aid flows, remittances, and the\nmomentum of the government's development program."
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mineral industry",
    "text": "Mining is an insignificant contributor to the country's economy. Most of the\ncountry's mineral requirements are imported. As of 2007, production of mineral\ncommodities was limited to clay on the islands of Boa Vista, Sal, and São\nVicente; gypsum and iron ore on the island of Maio; limestone on the islands\nof Boa Vista, Sal, and Santo Antão; pozzolana on the island of Santo Antão;\nand salt on the islands of Maio and Sal. Cape Verde was not a natural gas or\npetroleum producer as of 2007."
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Transportation",
    "text": "Shipyard at Mindelo\n\nCape Verde's strategic location at the crossroads of mid-Atlantic air and sea\nlanes has been enhanced by significant improvements at Mindelo's harbour\n(Porto Grande) and at Sal's international airport. Ship repair facilities at\nMindelo were opened in 1983, and the harbours at Mindelo and Praia were\nrecently renovated. The major ports are Mindelo and Praia, but all other\nislands have small port facilities, some of which are to be expanded in the\nnear future. In addition to the international airport on Sal, airports are\nlocated on all of the inhabited islands except for the smallest island, Brava,\nwhich was built, but found to be too dangerous so it was shut down after a few\nfailed attempted landings. The archipelago has 3,050 kilometers (1,830 mi.) of\nroads, of which 1,010 kilometers (606 mi.) are paved. The new Praia\nInternational Airport is currently operative."
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "International recognition",
    "text": "Cape Verde is considered a developing country, and is included on the list of\nthe United Nations Small Island Developing States.\n\nIn 2007 the United Nations graduated Cape Verde from the category of Least\nDeveloped Countries, only the second time this has happened to a country.\n\nOn December 18, 2007, the General Council of the World Trade Organization\napproved a package for the accession of Cape Verde to the WTO. Accession was\neffective on July 23, 2008, 30 days after ratification by Cape Verde, which\ntook place on 23 June. The package requires Cape Verde to adapt some of its\neconomic regulation. In particular, it will need to introduce a new Customs\nCode, and to introduce copyright and patent laws complying with the Agreement\non Trade-Related Aspects of Intellectual Property Rights. According to the\nWorld Intellectual Property Organization (WIPO), Cape Verde have a law on\ncopyrights (Law No. 101/III/90, December 1990) and an Industrial Property Code\n(Legislative Decree No. 4/2007 of August 20, 2007). Pascal Lamy, director-\ngeneral of the WTO said, \"I am very pleased to welcome Cape Verde as a new\nmember. This new membership will strengthen multilateral trading system. Being\npart of the WTO will enable Cape Verde to continue its integration into the\nworld economy.\""
  },
  {
    "chapter_name": "Economy of Cape Verde",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 0.23  | 798  | 0.16  | 5.3%  | 15.1%  | ...\n1985  | 0.41  | 1,287  | 0.15  | 8.6%  | 5.9%  | ...\n1990  | 0.69  | 1,633  | 0.34  | 0.7%  | 11.1%  | ...\n1995  | 0.84  | 2,106  | 0.54  | 7.5%  | 8.4%  | ...\n2000  | 1.37  | 3,089  | 0.61  | 7.3%  | −2,4 %  | 83%\n2005  | 2.05  | 4,278  | 1.12  | 5.8%  | 0,4 %  | 85%\n2006  | 2.30  | 4,778  | 1.26  | 9.1%  | 4,8 %  | 77%\n2007  | 2.58  | 5,338  | 1.65  | 9.2%  | 4,4 %  | 65%\n2008  | 2.81  | 5,793  | 1.96  | 6.7%  | 6.8%  | 57%\n2009  | 2.79  | 5,750  | 1.85  | −1.3 %  | 1.0%  | 65%\n2010  | 2.87  | 5,883  | 1.83  | 1.5%  | 2.1%  | 72%\n2011  | 3.04  | 6,205  | 2.05  | 4.0%  | 4.5%  | 79%\n2012  | 3.13  | 6,195  | 1.91  | 1.1%  | 2.5%  | 91%\n2013  | 3.21  | 6,268  | 2.03  | 0.8%  | 1.5%  | 102%\n2014  | 3.29  | 6,342  | 2.04  | 0.6%  | −0.2 %  | 116%\n2015  | 3.36  | 6,396  | 1.75  | 1.0%  | 0.1%  | 126%\n2016  | 3.53  | 6,643  | 1.86  | 3.8%  | −1.4 %  | 129%\n2017  | 3.96  | 6,944  | 1.97  | 4.0%  | 0.8%  | 126%"
  }
]