[
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article was **imported from the CIA's _World Factbook_**. Please help\nrewrite this article.  \n---|---  \nThe St. Kitts 'Sugar Train' in 1912 used to transport sugarcane\n\nThe **economy of Saint Kitts and Nevis** has traditionally depended on the\ngrowing and processing of sugar cane; decreasing world prices have hurt the\nindustry in recent years. Tourism, export-oriented manufacturing, and offshore\nbanking activity have assumed larger roles in Saint Kitts and Nevis. Most food\nis imported. The government has undertaken a program designed to revitalize\nthe faltering sugar sector. It is also working to improve revenue collection\nin order to better fund social programs. In 1997, some leaders in Nevis were\nurging separation from Saint Kitts on the basis that Nevis was paying far more\nin taxes than it was receiving in government services, but the vote on\nsecession failed in August 1998. In late September 1998, Hurricane Georges\ncaused approximately $445 million in damages and limited GDP growth for the\nyear.\n\nThe economy of St. Kitts and Nevis experienced strong growth for most of the\n1990s but hurricanes in 1998 and 1999 contributed to a sharp slowdown. Real\neconomic growth was 0.75% in 2002 after a decline of 4.3% in 2001. The economy\nexperienced a mixed performance during 2002, with some sectors experiencing\npositive growth while others experienced varying levels of decline. The\nconstruction sector recorded a 4.51% decline, manufacturing and hotels and\nrestaurants also recorded significant declines of 4.01 and 9.89% respectively,\nand sugar production fell by 5.1%. Significant new investment in tourism,\nincluding a 648-room Marriott hotel and convention center that opened in\nDecember 2002, as well as continued government efforts to diversify the\neconomy, are expected to improve economic performance. Consumer prices have\nrisen marginally over the past few years. The inflation rate was 3–4% for most\nof the 1990s.\n\nSt. Kitts and Nevis is a member of the Eastern Caribbean Currency Union (ECCU)\nThe Eastern Caribbean Central Bank (ECCB) issues a common currency (the East\nCaribbean dollar) for all members of the ECCU. The ECCB also manages monetary\npolicy, and regulates and supervises commercial banking activities in its\nmember countries. There is an extensive parallel economy denominated in US$,\nwhich is the de facto currency for many business transactions.\n\nSt. Kitts is a member of the Eastern Caribbean Telecommunications (ECTEL)\nauthority, which is developing the regulations to liberalize the\ntelecommunications sector in the region by 2004."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Tourism",
    "text": "According to the CIA World Factbook the main industry is tourism. Tourists,\nmainly Americans, come to the island via cruise ships (via Port Zante in\nBasseterre), air travel (via Robert L Bradshaw International Airport), and the\nprivate airport and private dock (for private yachts).\n\nThe tourism industry is unique in that it relies on both long term and short\nterm visitors. Short term visitors are generally Americans, Canadians, and\nother CARICOM countries who come via cruise ship for the day or via Robert L\nBradshaw airport for short term stay. Long term visitors are mostly Americans\nand Canadians that are staying for an average of 2.5-3 years on the island for\nvet school or medical school. The vet school on the island is Ross University\nSchool of Veterinary Medicine.\n\nThe tourism sector was badly hit by the effects of the hurricanes in 1998 and\n1999. The country had just started to rebuild after Georges in 1998 when Lenny\ncreated substantial damage in 1999. The Port Zante complex, where the pier and\nterminal buildings are located, suffered serious damage. In Nevis, the only\nlarge hotel was forced to close for 6 months, resulting in lay-offs of staff\n(although many were employed to re-landscape devastated gardens) and decreased\ngovernment revenue. Overall visitor arrivals, both of those staying over and\nthose on cruise ship calls, fell about 15 percent in 1999, with a resulting\ndecrease in visitor expenditure from the 1998 figure of US$75.7 million.\n\nA unique point of interest is that the island of St. Kitts possesses the only\nremaining active railway in the West Indies. This was built to move sugarcane\naround, and part of the railway remains in use for tourist tours.\n\nSt. Kitts is also home to Brimstone Hill Fortress, a UNESCO world heritage\nsite"
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Agriculture",
    "text": "Of the islands' total land area, about 39% is devoted to crops. The principal\nagricultural product of St. Kitts is sugarcane; peanuts are now the second\ncrop. On Nevis, sea island cotton and coconuts are the major commodities.\nSweet potatoes, onions, tomatoes, cabbages, carrots, and breadfruit are grown\nfor local consumption on both islands, mostly by individual smallholders. In\n2001, agricultural products accounted for about 18.5% of total imports by\nvalue and 11.2% of exports; the government has embarked on a program to\nsubstitute for food imports.\n\nSugar estate lands were nationalized in 1975, and the sugar factory was\npurchased by the government the following year. The output of raw sugar\nslumped between 1986 and 1989, and as a result the government entered into a\nmanagement agreement with Booke and Tate of Great Britain in August 1991; a\nWorld Bank loan of US$1.9 million was utilized to provide financial stability.\nSugar production in 1999 was estimated at 197,000 tons. Faced with a sugar\nindustry that was finding it increasingly difficult to earn a profit, the\nGovernment of St. Kitts and Nevis embarked on a program to diversify the\nagricultural sector and stimulate the development of other sectors of the\neconomy, particularly tourism. In July 2005, sugar production ceased."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Animal husbandry",
    "text": "Pasture areas are small, covering some 2.7% of the islands. Pangola and\nBermuda grasses provide the bulk of the fodder. Estimates of livestock in 2001\nwere sheep, 14,000; goats, 14,400; cattle, 4,300 head; and pigs, 4,000."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "Fishing",
    "text": "Fishing is a traditional occupation that has not expanded to any great extent;\nthe catch in 2000 was 257 tons (down from 620 tons in 1990). Some exports\n(primarily lobsters) are made to the Netherlands Antilles and Puerto Rico;\nfisheries exports totaled US$245,000 in 2000. Fish is caught by traditional\nmethods such as beach-seining, pot and trap fishing & hand-lining. The catch\nis not enough to satisfy local demand for fish. Large quantities of dried,\nsalted and smoked fish, as well as frozen are imported from Canada and the\nUnited States."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "Forestry",
    "text": "Both islands have small stands of virgin tropical forest, with palms,\npoincianas, and palmettos. About 11% of the land area consists of forests.\nImports of forest products nearly reached US$1.8 million in 2000."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "Mining",
    "text": "The mining sector played a minor role in St. Kitts and Nevis. No commercially\nvaluable mineral deposits have been found on Saint Kitts. Hence mining and\nquarrying activities are limited to earthen materials. Presently, there is\nonly one quarry on St. Kitts and multiple quarries on Nevis. Raking of salt,\nthe country's fourth-leading industry, was done from time to time. Local\nquarrying of some materials was used to supplement the construction industry.\nIn 2000, output for sand and gravel was 214,700 tons, up from 50,389 in 1996;\ncrushed stone output was 121,226 tons."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Secondary industries",
    "text": "Industry accounted for 26% of GDP in 2001. The principal manufacturing plant\nand largest industrial employer is the St. Kitts Sugar Manufacturing Corp., a\ngovernment enterprise; it grinds and processes sugarcane for export. The Carib\nbrewery on St. Kitts makes beer for local consumption. Cotton is ginned and\nbaled on Nevis. Electronic plants produce switches, calculators, car radios,\nand pocket radios. Other industries are clothing and shoe manufacturing. These\nprovide a much-needed alternative to agricultural employment, particularly for\nwomen.\n\nThe manufacturing suffered a decline in 1998 due to Hurricane Georges. As a\nresult of diversification and expansion, St. Kitts and Nevis has transformed\nsmall electronics plants into the largest electronics assembly industry in the\nEastern Caribbean. Its apparel assembly industry has also become very\nsuccessful in recent years. Garment manufacturing has expanded since the\nmid-1990s and now accounts for a large share of export earnings. Upgrading the\nPort Zante harbor complex in Basseterre enables large container ships to call,\nfurther enhancing St. Kitts' attractiveness as an offshore manufacturing base.\nManufactured exports were valued at US$20 million in 1998 and 1999, suggesting\nthat this sector was the least affected by hurricane damage.\n\nThere were four major industrial sites in St. Kitts and Nevis in 2000: C. A.\nPaul Southwell Industrial Park, Bourkes Industrial Estate, Canada Industrial\nEstate, and Prospect Industrial Estate. Port Zante is the main seaport."
  },
  {
    "chapter_name": "Economy of Saint Kitts and Nevis",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Statistics",
    "text": "purchasing power parity \\- $726 million (2006 est.)\n\n**GDP - real growth rate:** 6% (2007 est.)\n\n**GDP - per capita:** purchasing power parity - $8,200 (2005 est.)\n\n**GDP - composition by sector:** _agriculture:_ 3.5% _industry:_ 25.8%\n_services:_ 70.7%(2001)\n\n**Inflation rate (consumer prices):** 8.7% (2005 est.)\n\n**Labor force:** 18,172 (June 1995)\n\n**Unemployment rate:** 4.5% (1997)\n\n**Budget:** _revenues:_ $64.1 million\n\n_expenditures:_ $73.3 million, including capital expenditures of $10.4 million\n(1997 est.)\n\n**Industries:** sugar processing, tourism, cotton, salt, copra, clothing,\nfootwear, beverages\n\n**Electricity - production:** 125 million kWh (2005)\n\n**Electricity - production by source:** _fossil fuel:_ 100% _hydro:_ 0%\n_nuclear:_ 0% _other:_ 0% (1998)\n\n**Electricity - consumption:** 116.3 million kWh (2005)\n\n**Electricity - exports:** 0 kWh (2005)\n\n**Electricity - imports:** 0 kWh (2005)\n\n**Agriculture - products:** sugarcane, rice, yams, vegetables, bananas; fish\n\n**Exports:** $42 million (1998)\n\n**Exports - commodities:** machinery, food, electronics, beverages, tobacco\n\n**Exports - partners:** US 61.9%, Canada 9.4%, Netherlands 6.6%, Azerbaijan 5%\n(2006)\n\n**Imports:** $383 million (2006)\n\n**Imports - commodities:** machinery, manufactures, food, fuels\n\n**Imports - partners:** US 49.5%, Trinidad and Tobago 13.3%, UK 4.5% (2006)\n\n**Debt - external:** $314 million (2004)\n\n**Economic aid - recipient:** $3.52 million (2005)\n\n**Currency:** 1 East Caribbean dollar (EC$) = 100 cents\n\n**Exchange rates:** East Caribbean dollars per US dollar - 2.7 (2007), 2.7\n(2006), 2.7 (2005), 2.7 (2004), 2.7 (2003)\n\n**Fiscal year:** calendar year"
  }
]