[
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Sudan\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( May 2013)__(Learn how and when to remove this message)_  \n---|---  \n  \nThe **economy ofSudan** is largely based on agriculture and oil exports, with\nadditional revenue coming from mining and manufacturing. GDP growth registered\nmore than 10% per year in 2006 and 2007. Sudan had $30.873 billion by gross\ndomestic product as of 2019, and has been working with the International\nMonetary Fund (IMF) to implement macroeconomic reforms, including a managed\nfloat of the exchange rate. Sudan began exporting crude oil in the last\nquarter of 1999.\n\nAgricultural production remains important, because it employs 80% of the work\nforce and contributes a third of the GDP. The War in Darfur, the aftermath of\ntwo decades of war in the Second Sudanese Civil War (1983–2005) in the south,\nthe lack of basic infrastructure in large areas, and a reliance by much of the\npopulation on subsistence agriculture ensure much of the population will\nremain at or below the poverty line for years. The problem remains, despite\nrapid rises in average per capita income. In January 2007, the government\nintroduced a new Sudanese pound, at an initial exchange rate of US$1 = £S.2\\.\nSudan is still a least developed country according to United Nations.",
    "openai_summarised_points": [
      "• The economy of Sudan is primarily based on agriculture and oil exports, with additional revenue generated from mining and manufacturing sectors.",
      "• Sudan experienced significant GDP growth, registering more than 10% per year in 2006 and 2007.",
      "• As of 2019, Sudan's gross domestic product (GDP) was valued at $30.873 billion.",
      "• Sudan has been collaborating with the International Monetary Fund (IMF) to implement macroeconomic reforms, including adopting a managed float exchange rate system.",
      "• Sudan began exporting crude oil in the last quarter of 1999, marking a significant development in its economy.",
      "• Agricultural production remains a crucial component of Sudan’s economy, employing approximately 80% of the workforce and contributing about one-third of the GDP.",
      "• Ongoing conflicts, including the War in Darfur and the aftermath of the Second Sudanese Civil War (1983–2005) in the south, have severely impacted economic stability and development.",
      "• Large areas of Sudan suffer from a lack of basic infrastructure, and a significant portion of the population relies on subsistence agriculture, contributing to persistent poverty levels.",
      "• Despite rapid increases in average per capita income, a substantial portion of the population remains at or below the poverty line.",
      "• In January 2007, the Sudanese government introduced a new Sudanese pound, setting the initial exchange rate at US$1 = £S.2.",
      "• According to the United Nations, Sudan continues to be classified as a least developed country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:33.764695",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1515,
      "bullet_points_count": 11
    },
    "generated_detailed_content": "The economy of Sudan has historically been anchored by agriculture and oil exports, complemented by contributions from the mining and manufacturing sectors. Agriculture has played a foundational role, employing approximately 80% of the country’s workforce and accounting for about one-third of the gross domestic product (GDP). This sector primarily consists of subsistence farming, which sustains a significant portion of the population, especially in rural areas. Meanwhile, the discovery and exploitation of oil resources marked a transformative phase in Sudan’s economic landscape, with crude oil exports commencing in the last quarter of 1999. This development not only diversified the country's revenue streams but also positioned oil as a critical driver of economic growth in subsequent years. Sudan experienced remarkable GDP growth during the mid-2000s, with annual increases exceeding 10% in both 2006 and 2007. This rapid expansion was largely fueled by the burgeoning oil sector, which attracted foreign investment and generated substantial export revenues. The surge in oil production and exports helped to accelerate economic activity, improve government revenues, and stimulate related industries such as construction and services. However, despite this impressive growth, the economy remained vulnerable to external shocks and internal challenges, including political instability and infrastructural deficits. By 2019, Sudan’s GDP was valued at approximately $30.873 billion, reflecting the cumulative effects of both its traditional economic base and the oil sector’s contributions. This figure, while indicative of growth, also underscored the ongoing struggles faced by the country in achieving broad-based economic development. The economy continued to grapple with structural weaknesses, including a heavy reliance on a limited number of sectors and the persistence of poverty among large segments of the population. In an effort to stabilize and modernize the economy, Sudan engaged in collaborative efforts with the International Monetary Fund (IMF) to implement a series of macroeconomic reforms. Central to these reforms was the adoption of a managed float exchange rate system, which aimed to enhance the flexibility and responsiveness of the Sudanese pound in the foreign exchange market. This policy shift was intended to improve the competitiveness of Sudanese exports, attract foreign investment, and reduce distortions caused by previous fixed or heavily managed exchange rate regimes. The cooperation with the IMF also included measures to strengthen fiscal discipline, improve monetary policy frameworks, and promote transparency in economic management. The initiation of crude oil exports in late 1999 represented a watershed moment for Sudan’s economy. Prior to this period, the country’s economic activities were predominantly agricultural, with limited industrialization and export diversification. The discovery of significant oil reserves in the southern and central regions of Sudan, coupled with the construction of pipelines and export facilities, enabled the country to tap into global energy markets. Oil revenues rapidly became a major source of foreign exchange and government income, facilitating investments in infrastructure and social services. However, the oil sector’s prominence also introduced new challenges, including economic dependence on volatile global oil prices and tensions related to resource control, particularly in regions affected by civil conflict. Agricultural production remained a vital pillar of Sudan’s economy despite the growing importance of oil. The sector’s dominance in employment underscored its role as a primary livelihood source for the majority of Sudanese citizens. Key agricultural products included sorghum, millet, wheat, cotton, and gum arabic, which were cultivated across diverse agro-ecological zones. Yet, the sector faced numerous obstacles, such as limited access to modern inputs, inadequate irrigation infrastructure, and vulnerability to climatic variability. These factors constrained productivity and contributed to food insecurity in certain regions. Moreover, the predominance of subsistence farming meant that much of the agricultural output was consumed domestically, limiting the potential for export earnings and broader economic transformation. The economic development of Sudan has been profoundly affected by ongoing conflicts, notably the War in Darfur and the protracted aftermath of the Second Sudanese Civil War, which lasted from 1983 to 2005. These conflicts inflicted widespread human suffering and disrupted economic activities, particularly in the southern and western regions. Infrastructure such as roads, schools, and health facilities was damaged or destroyed, hampering efforts to improve living standards and attract investment. The instability also led to displacement of populations, loss of labor force, and interruptions in agricultural production. The cumulative impact of these conflicts undermined economic stability and complicated the implementation of development policies. Large swathes of Sudan have suffered from a chronic lack of basic infrastructure, including transportation networks, electricity supply, and water systems. This infrastructural deficit has constrained economic growth by limiting access to markets, reducing productivity, and increasing the cost of doing business. Additionally, a significant portion of the population has relied on subsistence agriculture for survival, which has perpetuated cycles of poverty and vulnerability to environmental shocks. The limited availability of social services and economic opportunities in rural areas has contributed to persistent poverty levels, despite overall economic growth in certain sectors. Although Sudan experienced rapid increases in average per capita income during periods of economic expansion, these gains did not translate into widespread poverty alleviation. A substantial segment of the population continued to live at or below the poverty line, reflecting deep inequalities and uneven distribution of wealth. Factors such as regional disparities, limited access to education and healthcare, and ongoing conflict exacerbated socioeconomic divides. The persistence of poverty underscored the challenges faced by policymakers in ensuring inclusive growth and improving the quality of life for all citizens. In January 2007, the Sudanese government introduced a new currency, the Sudanese pound, as part of broader economic reforms aimed at stabilizing the economy and restoring confidence in the monetary system. The initial exchange rate was set at US$1 to £S.2, marking a recalibration of the national currency following periods of inflation and currency depreciation. This monetary reform sought to simplify transactions, facilitate trade, and provide a more stable medium of exchange. The introduction of the new pound was accompanied by efforts to enhance fiscal management and control inflationary pressures, which had undermined economic stability in previous years. Despite these economic developments and reform initiatives, Sudan remained classified by the United Nations as a least developed country. This designation reflected ongoing challenges such as low income levels, limited human capital development, vulnerability to economic and environmental shocks, and inadequate infrastructure. The classification underscored the need for sustained international support and domestic policy efforts to address structural constraints and promote sustainable development. Sudan’s status as a least developed country highlighted the complexities of its economic trajectory and the multifaceted nature of its development challenges.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:43.997971",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 11,
      "generated_content_length": 7750,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Current GDP per capita of Sudan grew 46% in the 1960s, reaching a peak growth\nof 170% in the 1970s. But this proved unsustainable and growth consequently\nscaled back to 34% in the 1980s. Finally, it shrank by 26% in the 1990s.\n\nUntil the early 1970s Sudan's agricultural output was mostly dedicated to\ninternal consumption. In 1972 the Sudanese government became more pro-Western,\nand made plans to export food and cash crops. However, commodity prices\ndeclined throughout the 1970s causing economic problems for Sudan. At the same\ntime, debt servicing costs, from the money spent mechanizing agriculture,\nrose. In 1978 the International Monetary Fund (IMF) negotiated a Structural\nAdjustment Program with the government. This further promoted the mechanized\nexport agriculture sector. This caused great economic problems for the\npastoralists of Sudan.\n\nDuring the late 1970s and to 1980s, the IMF, World Bank, and key donors worked\nclosely to promote reforms to counter the effect of inefficient economic\npolicies and practices. By 1984, a combination of factors, including drought,\ninflation, and confused application of Islamic law, reduced donor\ndisbursements and capital flight led to a serious foreign-exchange crisis and\nincreased shortages of imported inputs and commodities. More significantly,\nthe 1989 revolution caused many donors in Europe, the U.S., and Canada to\nsuspend official development assistance, but not humanitarian aid.\n\nHowever, as Sudan became the world's largest debtor to the World Bank and\nInternational Monetary Fund by 1993, its relationship with the international\nfinancial institutions soured in the mid-1990s and has yet to be fully\nrehabilitated. The government fell out of compliance with an IMF standby\nprogram and accumulated substantial arrearages on repurchase obligations. A\n4-year economic reform plan was announced in 1988 but was not pursued.\n\nAn economic reform plan was announced in 1989 and began implementing a 3-year\neconomic restructuring program designed to reduce the public sector deficit,\nend subsidies, privatize state enterprises, and encourage new foreign and\ndomestic investment. In 1993, the IMF suspended Sudan's voting rights and the\nWorld Bank suspended Sudan's right to make withdrawals under effective and\nfully disbursed loans and credits. Lome Funds and EU agricultural credits,\ntotaling more than one billion euros, also were suspended.",
    "openai_summarised_points": [
      "• Sudan's GDP per capita experienced significant fluctuations from the 1960s to the 1990s, growing by 46% in the 1960s and reaching a peak growth of 170% in the 1970s, but this growth was unsustainable, declining to 34% in the 1980s and shrinking by 26% in the 1990s.",
      "• Until the early 1970s, Sudan's agricultural output was primarily focused on internal consumption, with limited emphasis on exports.",
      "• In 1972, the Sudanese government adopted a more pro-Western stance and initiated plans to export food and cash crops to boost the economy.",
      "• Throughout the 1970s, declining commodity prices created economic difficulties for Sudan, compounded by rising debt servicing costs due to investments in mechanizing agriculture.",
      "• In 1978, the International Monetary Fund (IMF) negotiated a Structural Adjustment Program with Sudan’s government, which further promoted mechanized export agriculture but caused significant economic hardship for Sudanese pastoralists.",
      "• During the late 1970s and 1980s, the IMF, World Bank, and major donors collaborated to implement reforms aimed at addressing inefficient economic policies and practices in Sudan.",
      "• By 1984, a combination of drought, inflation, and the confused application of Islamic law led to reduced donor disbursements, capital flight, a severe foreign-exchange crisis, and increased shortages of imported inputs and commodities.",
      "• The 1989 revolution in Sudan resulted in many donors from Europe, the United States, and Canada suspending official development assistance, although humanitarian aid continued.",
      "• By 1993, Sudan had become the world's largest debtor to the World Bank and IMF, leading to a deteriorated relationship with these international financial institutions that remains unresolved.",
      "• Sudan’s government fell out of compliance with an IMF standby program in the mid-1990s and accumulated substantial arrears on repurchase obligations.",
      "• Although a 4-year economic reform plan was announced in 1988, it was not pursued effectively.",
      "• In 1989, Sudan announced and began implementing a 3-year economic restructuring program aimed at reducing the public sector deficit, ending subsidies, privatizing state enterprises, and encouraging both foreign and domestic investment.",
      "• In 1993, the IMF suspended Sudan’s voting rights, and the World Bank suspended Sudan’s ability to make withdrawals under effective and fully disbursed loans and credits.",
      "• Additionally, Lome Funds and European Union agricultural credits, totaling over one billion euros, were suspended as part of the international response to Sudan’s economic and political situation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:42.369510",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2404,
      "bullet_points_count": 14
    },
    "generated_detailed_content": "Sudan's economic trajectory from the 1960s through the 1990s was marked by considerable volatility, particularly in terms of its gross domestic product (GDP) per capita. During the 1960s, the country experienced a moderate growth rate of approximately 46%, reflecting a period of gradual economic expansion. This growth accelerated dramatically in the 1970s, with GDP per capita increasing by an impressive 170%, reaching a peak that underscored the optimism and developmental ambitions of the era. However, this rapid expansion proved unsustainable, as the 1980s saw a sharp deceleration in growth to just 34%. The economic situation deteriorated further in the 1990s, with GDP per capita actually contracting by 26%, signaling a period of economic crisis and regression that would have profound implications for the country's development. Prior to the early 1970s, Sudan's agricultural sector was predominantly oriented towards meeting domestic food needs, with limited emphasis placed on export production. The agricultural output during this period was largely subsistence-based, supporting the internal consumption requirements of a growing population but contributing minimally to foreign exchange earnings. This inward focus reflected both the economic policies of the time and the structure of Sudanese agriculture, which was characterized by smallholder farming and traditional practices that were not geared towards large-scale commercial export. A significant shift occurred in 1972 when the Sudanese government adopted a more pro-Western foreign policy stance, which was accompanied by new economic strategies aimed at integrating the country more fully into the global economy. This policy reorientation included plans to expand the production and export of food and cash crops, with the objective of boosting economic growth through increased foreign exchange earnings. The government sought to transform Sudan into a net exporter of agricultural commodities, thereby diversifying the economy and reducing reliance on external aid and imports. Despite these ambitions, the 1970s were marked by economic challenges stemming from declining global commodity prices, which adversely affected Sudan's export revenues. The fall in prices for key agricultural products reduced the profitability of Sudan's export sector and strained government finances. Compounding these difficulties were rising debt servicing costs, which escalated as the government invested heavily in mechanizing agriculture. These mechanization efforts, intended to increase productivity and export capacity, required substantial capital inputs and led to increased borrowing, thereby exacerbating the country’s external debt burden. In response to the mounting economic pressures, the International Monetary Fund (IMF) negotiated a Structural Adjustment Program (SAP) with the Sudanese government in 1978. This program sought to promote mechanized export agriculture as a means of revitalizing the economy and improving balance of payments. However, the implementation of the SAP had significant adverse effects on Sudanese pastoralists, who constituted a substantial portion of the rural population. The emphasis on mechanized farming and export crops disrupted traditional pastoral livelihoods, leading to economic hardship and social dislocation among these communities. Throughout the late 1970s and into the 1980s, the IMF, the World Bank, and major international donors collaborated closely with the Sudanese government to implement a series of reforms aimed at addressing what were perceived as inefficient economic policies and practices. These reforms focused on liberalizing the economy, improving fiscal management, and encouraging private sector development. Despite these efforts, the reforms often encountered resistance and were complicated by Sudan’s complex political and social dynamics, limiting their overall effectiveness. By 1984, Sudan faced a confluence of severe challenges that compounded its economic difficulties. A prolonged drought severely impacted agricultural production, leading to food shortages and increased inflation. At the same time, the government's confused and inconsistent application of Islamic law created uncertainty and undermined investor confidence. These factors contributed to a reduction in donor disbursements, as international aid agencies became increasingly reluctant to provide funds amid the deteriorating situation. Capital flight intensified as both domestic and foreign investors sought to protect their assets, precipitating a severe foreign-exchange crisis. This crisis resulted in acute shortages of imported inputs and essential commodities, further exacerbating economic instability. The political upheaval of 1989, which culminated in a revolution that brought a new regime to power, had profound implications for Sudan's international economic relations. In the aftermath of the revolution, many donors from Europe, the United States, and Canada suspended official development assistance to Sudan, reflecting concerns over governance and human rights issues. Despite the suspension of official aid programs, humanitarian assistance continued, aimed at addressing urgent needs arising from ongoing conflicts and economic hardship. By 1993, Sudan had become the largest debtor to the World Bank and the IMF globally, a status that underscored the severity of its economic crisis. The accumulation of debt and the government's failure to meet repayment obligations led to a significant deterioration in its relationship with these key international financial institutions. This strained relationship has remained unresolved, limiting Sudan’s access to concessional financing and technical assistance critical for economic recovery and development. The mid-1990s saw Sudan fall out of compliance with an IMF standby program, further complicating its financial situation. The government accumulated substantial arrears on repurchase obligations, reflecting its inability to meet scheduled repayments on loans and credits. This non-compliance not only damaged Sudan’s credibility with international lenders but also restricted its access to new financial resources, thereby constraining economic policy options. Although a four-year economic reform plan was announced in 1988, it was not pursued with the necessary rigor or consistency. The plan’s lack of effective implementation meant that many of the intended structural adjustments and fiscal discipline measures failed to materialize, leaving the economy vulnerable to continued instability and inefficiency. In 1989, the Sudanese government announced and began implementing a three-year economic restructuring program designed to address the public sector deficit and stimulate economic growth. This program aimed to reduce government spending by ending subsidies, privatize state-owned enterprises, and encourage both foreign and domestic investment. These measures were intended to foster a more market-oriented economy and improve fiscal sustainability. However, the political and economic context limited the program’s success, as ongoing conflict and governance challenges hindered reform efforts. The deteriorating relationship between Sudan and international financial institutions culminated in 1993 when the IMF suspended Sudan’s voting rights, signaling a serious breakdown in cooperation. Concurrently, the World Bank suspended Sudan’s ability to make withdrawals under effective and fully disbursed loans and credits, effectively cutting off access to critical development financing. These actions reflected the institutions’ dissatisfaction with Sudan’s economic management and compliance with agreed programs. In addition to the IMF and World Bank sanctions, other international financial mechanisms were also affected. The suspension of Lome Funds and European Union agricultural credits, which together amounted to over one billion euros, represented a significant loss of financial support. These funds had been crucial for agricultural development and rural livelihoods, and their suspension further constrained Sudan’s economic recovery efforts. The international response to Sudan’s economic and political situation during this period thus involved a broad withdrawal of financial assistance, reflecting widespread concern over governance, human rights, and economic mismanagement.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:42.881554",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 14,
      "generated_content_length": 8401,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "A Sudanese farmer\n\nPrimary resources are agricultural, including cotton, peanuts, gum arabic, and\nsesame seeds. Although the country is trying to diversify its cash crops,\ncotton and peanuts remain its major agricultural exports. Grain sorghum (dura)\nis the principal food crop, and wheat is grown for domestic consumption.\nSesame seeds and peanuts are cultivated for domestic consumption and\nincreasingly for export.\n\nThree main agricultural sub-sectors are active in Sudan: pastoral livestock,\ncropping and fish production. Livestock production has vast potential, and\nmany animals, particularly cows, sheep, and camels, are exported to Saudi\nArabia and other Arab countries. However, Sudan remains a net importer of\nfood. Problems of investment finance, production and transportation remain the\ngreatest constraints to a more dynamic agricultural economy. A major problem\nwhich has been growing for decades is the continual loss of open lands\npreviously used for animal grazing to mechanized drylands and irrigated\nfarming.\n\nSudan has 84 million hectares of arable land and less than 20% is cultivated.\nMajor agricultural projects such as the Gezera Scheme in Gezira state are\nunderway in order to make Sudan food self-sufficient. Sudan is one of the\nworld's potential breadbaskets and Sudan is nicknamed as the Arab world food\nbasket as it accounts for 45% of arable land in the Arab world. In 1998 there\nwas an estimated 16.9 million ha (42 million acres) of arable land and\napproximately 1.9 million ha (4.7 million acres) set aside for irrigation,\nprimarily in the north of the country along the banks of the Nile and other\nrivers.\n\nCash crops (as of 1999) grown under irrigation in these areas include cotton\nand cottonseed, which is of primary importance to the economy with 172,000\ntons and 131,000 tons produced annually respectively, sesame (220,000 tons),\nsugarcane (5,950,000 tons), peanuts (980,000 tons), dates (176,000 tons),\ncitrus fruits, yams (136,000 tons), tomatoes (240,000 tons), mangoes, coffee,\nand tobacco. The main subsistence crops produced in Sudan are sorghum\n(3,045,000 tons), millet (1,499,000 tons), wheat (168,000 tons), cowpeas,\nbeans, pulses, corn (65,000), and barley. Cotton is the principal export crop\nand an integral part of the country's economy and Sudan is the world's third\nlargest producer of sesame after India and China.",
    "openai_summarised_points": [
      "• Sudan’s primary agricultural resources include cotton, peanuts, gum arabic, and sesame seeds, with cotton and peanuts remaining the major agricultural exports despite efforts to diversify cash crops.",
      "• Grain sorghum (dura) is Sudan’s principal food crop, while wheat is cultivated primarily for domestic consumption; sesame seeds and peanuts are grown both for domestic use and increasing export markets.",
      "• Sudan’s agriculture is divided into three main sub-sectors: pastoral livestock, cropping, and fish production, with livestock production having vast potential, particularly in the export of cows, sheep, and camels to Saudi Arabia and other Arab countries.",
      "• Despite its agricultural potential, Sudan remains a net importer of food due to challenges in investment finance, production, and transportation, which constrain the development of a more dynamic agricultural economy.",
      "• A significant long-term issue is the continual loss of open lands previously used for animal grazing, which are increasingly converted to mechanized drylands and irrigated farming.",
      "• Sudan possesses 84 million hectares of arable land, of which less than 20% is currently cultivated, highlighting significant untapped agricultural potential.",
      "• Major agricultural projects, such as the Gezera Scheme in Gezira state, aim to enhance food self-sufficiency in Sudan.",
      "• Sudan is considered one of the world’s potential breadbaskets and is nicknamed the “Arab world food basket” because it accounts for 45% of the arable land in the Arab world.",
      "• In 1998, Sudan had an estimated 16.9 million hectares (42 million acres) of arable land, with approximately 1.9 million hectares (4.7 million acres) designated for irrigation, primarily along the Nile and other rivers in the north.",
      "• As of 1999, cash crops grown under irrigation in Sudan included cotton (172,000 tons), cottonseed (131,000 tons), sesame (220,000 tons), sugarcane (5,950,000 tons), peanuts (980,000 tons), dates (176,000 tons), citrus fruits, yams (136,000 tons), tomatoes (240,000 tons), mangoes, coffee, and tobacco.",
      "• The main subsistence crops produced in Sudan are sorghum (3,045,000 tons), millet (1,499,000 tons), wheat (168,000 tons), cowpeas, beans, pulses, corn (65,000 tons), and barley.",
      "• Cotton is Sudan’s principal export crop and a vital component of the national economy.",
      "• Sudan ranks as the world’s third largest producer of sesame seeds, following India and China."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:32.228186",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2369,
      "bullet_points_count": 13
    },
    "generated_detailed_content": "Sudan’s agricultural sector is characterized by a diverse array of primary resources, among which cotton, peanuts, gum arabic, and sesame seeds stand out as the most significant. Cotton and peanuts have historically dominated Sudan’s agricultural exports, maintaining their status as the country’s major cash crops despite ongoing efforts to diversify the portfolio of exportable agricultural products. These crops have long been integral to Sudan’s economy, providing substantial foreign exchange earnings and employment opportunities. Gum arabic, derived from the acacia tree, also plays a crucial role, particularly in international markets where it is valued as a natural stabilizer in food and pharmaceutical industries. Sesame seeds, while cultivated for both domestic consumption and export, have seen increasing demand on global markets, contributing to the gradual expansion of Sudan’s agricultural export base. Grain sorghum, locally known as dura, holds the position of Sudan’s principal food crop, reflecting its adaptability to the country’s climatic conditions and its importance in the daily diet of the population. Sorghum’s resilience to drought and poor soils makes it a staple in many regions, supporting food security for millions. Wheat cultivation, by contrast, is primarily geared toward domestic consumption, with production concentrated in areas where irrigation and more favorable climatic conditions allow for its growth. Sesame seeds and peanuts serve dual purposes; they are grown not only for local use but also to meet the increasing demands of export markets, which have expanded due to rising global interest in these commodities. This dual role underscores the balance Sudan seeks between ensuring food availability for its population and generating export revenues. Sudan’s agricultural economy is broadly divided into three main sub-sectors: pastoral livestock, cropping, and fish production. Among these, livestock production possesses vast potential, particularly in the export of live animals such as cows, sheep, and camels to Saudi Arabia and other Arab countries. The pastoral sector benefits from Sudan’s extensive rangelands and traditional animal husbandry practices, which have supported large herds for centuries. Livestock exports have become a significant source of foreign exchange, with demand driven by cultural and economic ties to the Arabian Peninsula. Fish production, while less prominent compared to cropping and livestock, contributes to local diets and rural livelihoods, especially in areas adjacent to the Nile and its tributaries. Despite its considerable agricultural potential, Sudan has remained a net importer of food, a situation attributed to multiple challenges that hinder the development of a more dynamic agricultural economy. Key constraints include limited investment finance, which restricts access to modern inputs and technologies necessary for increased productivity. Production challenges, such as variable rainfall, pest infestations, and inadequate infrastructure, further limit output. Transportation difficulties, including poor road networks and logistical bottlenecks, impede the efficient movement of goods from production areas to markets, both domestic and international. These factors combined have prevented Sudan from fully capitalizing on its agricultural endowments and achieving food self-sufficiency. A significant long-term issue affecting Sudan’s agricultural landscape is the continual loss of open lands previously used for animal grazing. These rangelands are increasingly being converted into mechanized drylands and irrigated farming plots, driven by the demand for higher crop production and economic development. This transformation has led to tensions between pastoralist communities and agriculturalists, as the reduction of grazing areas threatens traditional livestock-rearing practices. The shift toward mechanized and irrigated agriculture reflects broader trends in land use change, with implications for biodiversity, soil health, and the sustainability of pastoral livelihoods. Sudan possesses an estimated 84 million hectares of arable land, a vast resource that underscores the country’s significant untapped agricultural potential. However, less than 20% of this land is currently under cultivation, indicating a substantial gap between available land and actual agricultural use. This underutilization results from a combination of factors, including limited access to water for irrigation, insufficient capital for investment in farming infrastructure, and socio-political challenges that affect land tenure and rural development. The large expanse of uncultivated arable land presents opportunities for future expansion of agricultural activities, provided that these constraints can be addressed. Among the major agricultural initiatives aimed at enhancing food self-sufficiency in Sudan is the Gezera Scheme, located in Gezira state. This large-scale irrigation project, established in the early 20th century, has been central to Sudan’s efforts to increase crop production, particularly of cotton and food grains. The scheme utilizes water from the Blue Nile to irrigate extensive tracts of land, enabling multiple cropping cycles and higher yields than rainfed agriculture. The Gezera Scheme has served as a model for irrigation-based agriculture in Sudan, contributing significantly to national food security and export earnings, while also providing employment to thousands of rural inhabitants. Sudan’s agricultural potential has earned it the reputation of being one of the world’s potential breadbaskets, a status reflected in its nickname as the “Arab world food basket.” This designation arises from the fact that Sudan accounts for approximately 45% of the arable land in the Arab world, positioning it as a key player in regional food production. The country’s vast cultivable land, coupled with its diverse agro-ecological zones, enables the production of a wide range of crops that can support both domestic consumption and export markets. This potential, if fully realized, could contribute to regional food security and economic development. In 1998, Sudan was estimated to have approximately 16.9 million hectares (42 million acres) of arable land, with about 1.9 million hectares (4.7 million acres) designated for irrigation. The irrigated lands are primarily located along the Nile River and its tributaries in the northern part of the country, where water availability supports intensive agriculture. This irrigation infrastructure enables the cultivation of high-value cash crops and staple foods, mitigating the risks associated with erratic rainfall in other parts of Sudan. The development and maintenance of irrigation systems remain critical to enhancing agricultural productivity and ensuring stable food supplies. As of 1999, cash crops grown under irrigation in Sudan included a variety of economically important species. Cotton production reached 172,000 tons, with cottonseed output at 131,000 tons, reflecting the crop’s continued dominance in the export sector. Sesame production amounted to 220,000 tons, underscoring Sudan’s position as a leading global producer. Sugarcane was produced at a scale of approximately 5,950,000 tons, supporting both sugar processing industries and local consumption. Peanut production totaled 980,000 tons, while dates contributed 176,000 tons, and citrus fruits, yams (136,000 tons), tomatoes (240,000 tons), mangoes, coffee, and tobacco were also cultivated under irrigation. This diverse range of crops illustrates the multifaceted nature of Sudan’s irrigated agriculture and its contribution to both economic and nutritional needs. The main subsistence crops produced in Sudan reflect the dietary preferences and agricultural practices of the population. Sorghum was the most widely produced, with output reaching 3,045,000 tons, followed by millet at 1,499,000 tons. Wheat production stood at 168,000 tons, primarily for local consumption. Other important subsistence crops included cowpeas, beans, pulses, corn (65,000 tons), and barley. These crops form the backbone of food security in rural communities, providing essential calories and nutrients. Their cultivation is often rainfed, relying on seasonal rainfall patterns, which makes them vulnerable to climatic variability. Cotton remains Sudan’s principal export crop and a vital component of the national economy. The crop’s significance is reflected not only in its contribution to export earnings but also in its role in employment and industrial development, particularly in the textile sector. Sudan’s cotton industry has historically been linked to global markets, with production geared toward meeting international quality standards. The crop’s cultivation is concentrated in irrigated areas, where yields are higher and more reliable, supporting the country’s position as a major cotton exporter. In the global context, Sudan ranks as the world’s third largest producer of sesame seeds, following India and China. This ranking highlights Sudan’s competitive advantage in sesame cultivation, driven by favorable agro-climatic conditions and established farming practices. Sesame seeds are a valuable export commodity, sought after for their oil content and culinary uses worldwide. The crop’s production contributes significantly to rural incomes and export revenues, reinforcing its importance within Sudan’s agricultural economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:48.202871",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 13,
      "generated_content_length": 9489,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Industry",
    "text": "Sudan's rapid industrial development consists of agricultural processing,\nelectronics assembly, plastics manufacturing, furniture, tanning, sugar\nproduction, meat processing and various light industries located in any of the\n10 Industrial areas in Khartoum. Due to the many countries depending on Sudan\nfor medicines and medical services, Sudan is now concentrating on becoming a\nhub for the medical industry in East Africa, providing facilities and\nconcessions for medical investments and succeeding in covering about 70% of\nneeds and exporting to many neighboring nations. In recent years, the Giad\nIndustrial Complex in Al Jazirah state introduced the assembly of small autos\nand trucks, and some heavy military equipment such as armored personnel\ncarriers and the “Bashir” and \"Zubair\" main battle tanks as well as handguns,\nlight and heavy machine guns and howitzers and, recently, drone production.\nSudan is reputed to have great mineral resources, and exploration has started\nextensively for gold, of which is produced nearly 30 tons annually providing a\ngreat boost to the foreign exchange reserves of the nation, with the\nparticipation of many investment companies from all over the world. Quantities\nof asbestos, chromium, mica, kaolin and copper are now exploited commercially,\nespecially for export to China.",
    "openai_summarised_points": [
      "• Sudan's rapid industrial development encompasses a diverse range of sectors including agricultural processing, electronics assembly, plastics manufacturing, furniture production, tanning, sugar production, meat processing, and various light industries, all primarily located within the 10 designated Industrial areas in Khartoum.",
      "• Sudan is strategically focusing on becoming a regional hub for the medical industry in East Africa, motivated by the reliance of many countries on Sudan for medicines and medical services; the country provides facilities and concessions to attract medical investments and currently meets approximately 70% of domestic medical needs while exporting medical products to numerous neighboring nations.",
      "• The Giad Industrial Complex, situated in Al Jazirah state, has recently expanded its manufacturing capabilities to include the assembly of small automobiles and trucks, as well as the production of heavy military equipment such as armored personnel carriers, the “Bashir” and \"Zubair\" main battle tanks, handguns, light and heavy machine guns, howitzers, and more recently, drones.",
      "• Sudan is recognized for its substantial mineral wealth, with extensive exploration efforts underway, particularly for gold, which is produced at nearly 30 tons annually; this gold production significantly contributes to the nation’s foreign exchange reserves and involves investment companies from around the world.",
      "• In addition to gold, Sudan commercially exploits quantities of asbestos, chromium, mica, kaolin, and copper, with a significant portion of these minerals being exported, especially to China."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:30.993249",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1320,
      "bullet_points_count": 5
    },
    "generated_detailed_content": "Sudan’s industrial sector has experienced rapid development characterized by a diverse array of manufacturing activities spanning multiple industries. Key among these are agricultural processing facilities that transform raw agricultural products into finished goods, supporting the country’s agrarian economy and adding value to its primary commodities. Complementing this are electronics assembly plants that cater to both domestic demand and regional markets, reflecting an ongoing effort to diversify industrial output beyond traditional sectors. The plastics manufacturing industry has also seen significant growth, producing a wide range of consumer and industrial plastic products that serve various sectors across Sudan. Furniture production, another notable industry, combines traditional craftsmanship with modern manufacturing techniques to supply both local and regional markets. The tanning industry processes Sudan’s abundant livestock hides into leather goods, which are important both economically and culturally. Sugar production facilities contribute to meeting domestic consumption needs while also supporting export potential. Meat processing plants further enhance the value chain of Sudan’s livestock sector by providing processed meat products for local consumption and export. These varied industries are primarily concentrated within ten designated Industrial areas located in Khartoum, the nation’s capital, which serve as hubs for manufacturing activities due to their strategic location, infrastructure, and access to markets. Sudan has strategically positioned itself to become a regional hub for the medical industry within East Africa, driven by the significant reliance of neighboring countries on Sudan for medicines and medical services. This strategic focus is underscored by the government’s provision of facilities and concessions designed to attract medical investments, including tax incentives, streamlined regulatory processes, and infrastructure support to encourage both domestic and foreign enterprises to establish production and distribution centers. Currently, Sudan meets approximately 70% of its domestic medical needs through local production, a figure that highlights the country’s considerable capacity in pharmaceutical manufacturing and medical supplies. Beyond fulfilling internal demand, Sudan exports a variety of medical products to numerous neighboring nations, thereby playing a critical role in regional healthcare supply chains. This export activity not only strengthens Sudan’s economic ties with its neighbors but also enhances the country’s reputation as a reliable source of medical goods and services in East Africa. The Giad Industrial Complex, located in Al Jazirah state, represents a significant pillar of Sudan’s industrial and defense manufacturing capabilities. In recent years, the complex has expanded its manufacturing portfolio to include the assembly of small automobiles and trucks, marking a notable diversification into the automotive sector. This expansion reflects broader national ambitions to develop indigenous manufacturing capacities and reduce reliance on imports. In addition to civilian vehicles, the Giad Industrial Complex has developed a robust military production line that includes heavy military equipment such as armored personnel carriers designed for troop transport and battlefield protection. The complex produces main battle tanks named “Bashir” and “Zubair,” which are indigenous designs tailored to meet the specific requirements of Sudan’s armed forces. Furthermore, the facility manufactures a range of small arms and artillery, including handguns, light and heavy machine guns, and howitzers, thereby providing comprehensive support to national defense needs. More recently, the complex has ventured into the production of drones, signaling an adaptation to modern warfare technologies and an effort to enhance Sudan’s military capabilities with unmanned aerial systems. This combination of civilian and military manufacturing underscores the strategic importance of the Giad Industrial Complex within Sudan’s industrial landscape. Sudan’s mineral wealth is substantial and forms a critical component of the country’s economy, with ongoing exploration and development efforts aimed at maximizing resource extraction and export potential. Gold mining is particularly prominent, with annual production reaching nearly 30 tons, making it one of the country’s most valuable mineral outputs. This level of gold production significantly contributes to Sudan’s foreign exchange reserves, providing a vital source of revenue that supports economic stability and development initiatives. The gold mining sector attracts investment companies from around the world, reflecting international confidence in Sudan’s mineral resources and the potential for profitable extraction. These companies engage in both artisanal and industrial-scale mining operations, often in partnership with the government or local entities, to exploit gold deposits across various regions of the country. In addition to gold, Sudan commercially exploits a variety of other minerals including asbestos, chromium, mica, kaolin, and copper. Each of these minerals has distinct industrial applications and contributes to diversifying Sudan’s mineral export portfolio. Asbestos, despite global concerns over its health impacts, remains a mineral extracted for specific industrial uses. Chromium and mica are important for manufacturing and industrial processes, with chromium playing a key role in metal alloys and mica valued for its insulating properties in electronics. Kaolin, a type of clay mineral, is utilized in ceramics, paper production, and other industries. Copper extraction supports both domestic industrial needs and export markets. A significant portion of these minerals is exported, with China being a major destination for Sudanese mineral exports. This trade relationship underscores the importance of mineral resources in Sudan’s international economic engagements and highlights the country’s role as a supplier of raw materials to global markets. The development of these mineral sectors continues to be a priority for Sudan as it seeks to leverage its natural resources for economic growth and diversification.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:41.651455",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 5,
      "generated_content_length": 6303,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Petroleum",
    "text": "Extensive petroleum exploration first began in Sudan in the mid-1970s.\nSignificant finds were made in the Upper Nile region and commercial quantities\nof oil began to be exported in October 2000, reducing Sudan's outflow of\nforeign exchange for imported petroleum products. Today, oil is an important\nexport industry in Sudan. Estimates suggest that oil accounts for between 70%\nand 90% of Sudan's total exports. The primary importers of Sudanese oil are\nJapan, China, South Korea, Indonesia, and India.\n\nMost of Sudan's oil reserves are located in the Muglad and Melut rift basins\nin the south of the country. Oil fields in the south, such as those at Heglig\nand in the South Sudanese state of Unity, formerly part of Sudanese territory,\nare linked to the country's refineries via pipelines. The two largest oil\npipelines are the Greater Nile Oil Pipeline, which travels 1,600 kilometres\nfrom the Unity oil field to Port Sudan on the Red Sea via Khartoum, and the\nPetroDar pipeline, which extends 1,380 kilometres from the Palogue oil field\nin the Melut Basin to Port Sudan.\n\nCrude oil from the Muglad Basin is known as \"Nile Blend\" and is refined at the\nKhartoum crude oil refinery. In 2006, the China National Petroleum Corporation\nupgraded the Khartoum refinery, doubling its capacity to 100,000 barrels per\nday (16,000 m3/d). Oil from the Melud Basin is known as \"Dar Blend\" and is\nrefined at the Port Sudan Refinery, which has a capacity of 21,700 barrels per\nday (3,450 m3/d). In 2005, the Sudanese government contracted Petronas to\nbuild a new refinery at Port Sudan.",
    "openai_summarised_points": [
      "• Extensive petroleum exploration in Sudan commenced in the mid-1970s, marking the beginning of significant oil development in the country.",
      "• Major oil discoveries were made in the Upper Nile region, leading to the commencement of commercial oil exports in October 2000, which helped reduce Sudan's foreign exchange outflow previously spent on imported petroleum products.",
      "• Oil has become a crucial export industry for Sudan, with estimates indicating that petroleum accounts for between 70% and 90% of the country’s total exports.",
      "• The principal importers of Sudanese oil include Japan, China, South Korea, Indonesia, and India, highlighting Sudan’s integration into the global oil market.",
      "• The majority of Sudan’s oil reserves are situated in the Muglad and Melut rift basins, located in the southern part of the country.",
      "• Key oil fields in the south, such as those at Heglig and in the South Sudanese state of Unity (formerly part of Sudan), are connected to national refineries through extensive pipeline infrastructure.",
      "• The Greater Nile Oil Pipeline, Sudan’s largest pipeline, spans 1,600 kilometres, transporting oil from the Unity oil field to Port Sudan on the Red Sea via Khartoum.",
      "• The PetroDar pipeline extends 1,380 kilometres from the Palogue oil field in the Melut Basin to Port Sudan, serving as a critical conduit for oil transport.",
      "• Crude oil extracted from the Muglad Basin is referred to as \"Nile Blend\" and is processed at the Khartoum crude oil refinery.",
      "• In 2006, the China National Petroleum Corporation (CNPC) upgraded the Khartoum refinery, doubling its refining capacity to 100,000 barrels per day (16,000 m³/d).",
      "• Oil from the Melut Basin is known as \"Dar Blend\" and is refined at the Port Sudan Refinery, which has a refining capacity of 21,700 barrels per day (3,450 m³/d).",
      "• In 2005, the Sudanese government awarded a contract to Petronas, the Malaysian national oil company, to construct a new refinery at Port Sudan, aiming to expand refining capacity and infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:32.737298",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1574,
      "bullet_points_count": 12
    },
    "generated_detailed_content": "Extensive petroleum exploration in Sudan began in the mid-1970s, marking a pivotal moment in the country’s economic development. Prior to this period, Sudan’s economy was primarily agrarian, with limited industrial activity and minimal involvement in the global energy market. The initiation of systematic geological surveys and exploratory drilling during this era was driven by growing international interest in the region’s hydrocarbon potential, as well as Sudan’s strategic location in Northeast Africa. These early exploration efforts laid the groundwork for the discovery of commercially viable oil reserves, which would later transform Sudan’s economic landscape. Significant oil discoveries were made in the Upper Nile region, an area that encompasses parts of what is now South Sudan. These discoveries culminated in the commencement of commercial oil exports in October 2000. The start of oil exports represented a major milestone for Sudan, as it allowed the country to reduce its reliance on imported petroleum products, which had previously imposed a substantial burden on foreign exchange reserves. By producing and exporting its own crude oil, Sudan was able to retain a greater share of its national income and redirect resources toward other sectors of the economy. The export of petroleum thus became a key driver of economic growth and fiscal stability during the early 21st century. Petroleum quickly emerged as a cornerstone of Sudan’s export economy, with estimates indicating that oil accounted for between 70% and 90% of the country’s total exports. This dominant share underscored the sector’s critical importance in generating foreign currency earnings and financing government expenditures. The rapid expansion of oil production and export capacity attracted significant foreign investment and fostered the development of related industries, including refining, pipeline construction, and petrochemical processing. However, this heavy dependence on oil exports also exposed Sudan to fluctuations in global oil prices and underscored the need for economic diversification to mitigate vulnerability to external shocks. Sudan’s integration into the global oil market was further evidenced by the composition of its principal oil importers. Key destinations for Sudanese crude included Japan, China, South Korea, Indonesia, and India, reflecting a broad geographic distribution across Asia’s major energy-consuming nations. These countries were attracted by Sudan’s relatively untapped reserves and the competitive pricing of its crude oil. The export relationships established with these diverse markets not only provided Sudan with steady demand but also positioned the country as a notable player in the international petroleum trade. This network of trade partners facilitated technology transfer, investment inflows, and diplomatic engagement centered on energy cooperation. The majority of Sudan’s oil reserves were concentrated in the Muglad and Melut rift basins, both situated in the southern part of the country. These rift basins are geological depressions formed by tectonic activity, which created favorable conditions for the accumulation of hydrocarbons over millions of years. The Muglad Basin, located in southwestern Sudan, and the Melut Basin, extending into the southeastern region, became focal points for exploration and production activities. The geological characteristics of these basins, including their sedimentary formations and reservoir properties, contributed to the commercial viability of oil extraction and shaped the development strategies employed by national and international oil companies operating in Sudan. Among the key oil fields in the south were those at Heglig and within the South Sudanese state of Unity, an area that was formerly part of Sudan prior to South Sudan’s independence in 2011. These fields were integral components of Sudan’s oil production infrastructure and were connected to national refineries through an extensive network of pipelines. The Heglig oil field, located near the border with South Sudan, was one of the largest and most productive fields in the region. Similarly, the Unity state fields contributed significantly to overall output. The pipeline infrastructure linking these fields to refineries and export terminals was essential for transporting crude oil efficiently and minimizing logistical bottlenecks, thereby ensuring a steady flow of petroleum to domestic and international markets. The Greater Nile Oil Pipeline represented Sudan’s largest and most strategic pipeline, stretching approximately 1,600 kilometres. This pipeline transported crude oil from the Unity oil field in the south to Port Sudan on the Red Sea, passing through the capital city of Khartoum. The pipeline’s extensive reach enabled the movement of oil across diverse terrains and administrative regions, facilitating export operations and enhancing Sudan’s capacity to supply international customers. By connecting production sites directly to a deep-water port, the Greater Nile Oil Pipeline played a crucial role in integrating Sudan’s oil sector with global maritime trade routes, thereby increasing the country’s competitiveness as an oil exporter. Another critical conduit for oil transport was the PetroDar pipeline, which extended roughly 1,380 kilometres from the Palogue oil field in the Melut Basin to Port Sudan. This pipeline was constructed as part of the PetroDar consortium’s efforts to develop oil infrastructure and expand Sudan’s export capabilities. The PetroDar pipeline complemented the Greater Nile Oil Pipeline by providing an alternative route for crude oil transportation, enhancing the resilience and flexibility of Sudan’s oil export system. Its establishment underscored the importance of infrastructure investment in maximizing the economic benefits derived from the country’s hydrocarbon resources. Crude oil extracted from the Muglad Basin was commonly referred to as \"Nile Blend,\" a designation that distinguished it from other Sudanese crude types based on its specific chemical and physical characteristics. Nile Blend crude was processed at the Khartoum crude oil refinery, which served as a central hub for refining operations in the country’s northern region. The refinery played a vital role in converting raw petroleum into usable products such as gasoline, diesel, and kerosene, thereby supporting domestic energy needs and reducing dependence on imported refined fuels. The processing of Nile Blend at Khartoum also facilitated the development of local industries and contributed to job creation within the refinery sector. In 2006, the China National Petroleum Corporation (CNPC) undertook a significant upgrade of the Khartoum refinery, effectively doubling its refining capacity to 100,000 barrels per day (16,000 cubic meters per day). This expansion was part of broader efforts to enhance Sudan’s refining infrastructure and increase the value added from its crude oil production. By boosting refining capacity, the CNPC upgrade enabled Sudan to process a larger proportion of its crude domestically, reducing the need to export unrefined oil and import refined petroleum products. The modernization of the Khartoum refinery also incorporated advanced technologies aimed at improving efficiency, product quality, and environmental performance, reflecting the growing sophistication of Sudan’s oil sector. Oil produced in the Melut Basin was known as \"Dar Blend,\" a distinct crude type that differed from Nile Blend in its composition and refining requirements. Dar Blend crude was refined at the Port Sudan Refinery, which had a refining capacity of 21,700 barrels per day (3,450 cubic meters per day). This refinery was strategically located near the Red Sea coast, enabling efficient processing and export of petroleum products. The Port Sudan Refinery played a complementary role to the Khartoum facility by handling crude from the southeastern oil fields, thereby supporting regional economic development and contributing to the overall stability of Sudan’s energy supply chain. In 2005, the Sudanese government awarded a contract to Petronas, the Malaysian national oil company, to construct a new refinery at Port Sudan. This initiative aimed to expand the country’s refining capacity and upgrade its petroleum infrastructure to meet growing domestic and export demands. The new refinery project was envisioned as a means to enhance Sudan’s self-sufficiency in refined petroleum products, reduce fuel imports, and generate additional revenue through the export of higher-value refined products. Petronas’s involvement brought technical expertise and investment capital to the project, reflecting the increasing role of international partnerships in the development of Sudan’s oil industry. The construction of the new refinery was also aligned with broader national strategies to diversify the economy and strengthen the industrial base.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:47.280168",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 12,
      "generated_content_length": 8969,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Mining",
    "text": "The mining industry contributed little to GDP until the discovery of\ncommercially exploitable quantities of petroleum in the late 1970s offered\nhope that the sector would play an increased role in the economy in the\nfuture. Nonhydrocarbon minerals of actual or potential commercial value\ninclude gold, chrome, copper, iron ore, manganese, asbestos, gypsum, mica,\nlimestone, marble, uranium, silver, lead, talc, tungsten, zinc, and diamonds.",
    "openai_summarised_points": [
      "• The mining industry in Sudan contributed minimally to the country's GDP until the late 1970s.",
      "• The discovery of commercially exploitable quantities of petroleum in the late 1970s raised expectations that the mining sector would assume a more significant role in Sudan's economy.",
      "• Sudan possesses a variety of nonhydrocarbon minerals with actual or potential commercial value.",
      "• These nonhydrocarbon minerals include gold, chrome, copper, iron ore, manganese, asbestos, gypsum, mica, limestone, marble, uranium, silver, lead, talc, tungsten, zinc, and diamonds."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:28.436943",
      "openai_model": "gpt-4.1-mini",
      "content_length": 440,
      "bullet_points_count": 4
    },
    "generated_detailed_content": "Until the late 1970s, the mining industry in Sudan played a relatively minor role in the nation's economy, contributing only a small fraction to the gross domestic product (GDP). The sector remained underdeveloped due to limited exploration activities, inadequate infrastructure, and a focus on agriculture and other primary industries. Mining operations were largely artisanal or small-scale, and the extraction of minerals did not significantly impact the overall economic landscape. This situation began to change with the discovery of commercially exploitable quantities of petroleum in the late 1970s, which marked a turning point for the mining sector. The identification of substantial hydrocarbon reserves raised expectations that the mining industry would assume a more prominent and strategic role in Sudan's economic development, potentially diversifying the country's revenue sources and reducing reliance on traditional sectors. Sudan's mineral wealth extends beyond petroleum, encompassing a wide variety of nonhydrocarbon minerals that possess either actual or potential commercial value. These mineral resources are distributed across different regions of the country, reflecting Sudan's complex geology and diverse mineralization patterns. The presence of such a broad spectrum of minerals has attracted interest from both domestic and international investors, seeking to capitalize on the untapped opportunities within the mining sector. However, the development of these resources has faced challenges related to political instability, infrastructure deficits, and regulatory uncertainties, which have constrained the full realization of their economic potential. Among the nonhydrocarbon minerals found in Sudan, gold stands out as one of the most significant and commercially viable resources. The country has experienced a surge in gold mining activities, particularly in the northeastern and eastern regions, where artisanal and small-scale mining operations have flourished alongside more formalized ventures. In addition to gold, Sudan is endowed with substantial deposits of chrome, which is used primarily in the production of stainless steel and other alloys. Chrome mining has been concentrated in specific areas with favorable geological conditions, contributing to both domestic industrial needs and export revenues. Copper and iron ore are also important components of Sudan's mineral portfolio. Copper deposits occur in various parts of the country, offering prospects for both mining and smelting activities, while iron ore reserves have attracted interest due to their potential to support the development of steel manufacturing industries. Manganese, another strategic mineral, is present in economically significant quantities and is valued for its use in steel production and battery technologies. The extraction and processing of these minerals require substantial investment and technological capabilities, which have been gradually developing in Sudan's mining sector. Other minerals with commercial utility include asbestos, gypsum, mica, limestone, and marble. Asbestos, historically used in construction and manufacturing, has seen declining demand globally due to health concerns, but it remains part of Sudan's mineral resources. Gypsum and limestone are widely used in the cement and construction industries, supporting domestic infrastructure development and industrial activities. Marble, known for its aesthetic and architectural applications, is quarried in several locations, contributing to local economies and export markets. Mica, valued for its insulating properties in electrical and electronic applications, is also found in Sudan, although its extraction has been limited by market and technical factors. Sudan's mineral wealth further encompasses uranium, silver, lead, talc, tungsten, zinc, and diamonds, each offering distinct economic opportunities. Uranium deposits have attracted attention due to their potential use in nuclear energy and related industries, although exploration and development have been cautious given geopolitical considerations. Silver and lead occur in conjunction with other base metals, providing additional value in polymetallic mining operations. Talc, used in ceramics, paper, and cosmetics, is another mineral resource with commercial prospects. Tungsten and zinc are critical for various industrial applications, including alloy production and galvanization, and their presence in Sudan adds to the diversity of the country's mineral endowment. Diamonds, though less extensively exploited, represent a high-value mineral with potential for both industrial use and gemstone markets. Overall, the mining sector in Sudan encompasses a broad array of mineral resources that, if effectively developed, could significantly enhance the country's economic diversification and growth. The transition from a marginal contributor to a more central role in the national economy hinges on addressing infrastructural, regulatory, and investment challenges, as well as fostering sustainable and environmentally responsible mining practices. The late 20th century discoveries, particularly of petroleum, catalyzed a reappraisal of the sector's importance, setting the stage for ongoing efforts to harness Sudan's mineral wealth for broader economic development.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:49.628929",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 4,
      "generated_content_length": 5339,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Employment",
    "text": "| **This section has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This section **relies largely or entirely on asingle source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources.\n_Find sources:_ \"Economy of Sudan\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( February 2025)_\n---|---\n| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( February 2025)_\n---|---\n\n_(Learn how and when to remove this message)_\n\nThe size of Sudan's labor force is difficult to determine because of the\nvarious definitions of participation in economic activity and the absence of\naccurate data from official sources. In rural areas, large numbers of women\nand girls engage in traditional productive occupations, but many probably are\nnot included in calculations of the active workforce.\n\nMore than 7.9 million people were employed in Sudan in 1989, according to an\nInternational Labour Organisation (ILO) estimate. In the early 1990s, the\nemployment scene was exacerbated by the 1991 Persian Gulf War, which resulted\nin the return home of thousands of Sudanese workers who had been based in\nKuwait and Iraq, leaving many of their possessions behind. Sudan's support of\nIraq was also a factor in the departure of thousands of Sudanese workers from\nSaudi Arabia. By 2000, the total labor force of Sudan had grown to an\nestimated 12 million, of which the government counted 9.6 million as actively\nemployed. Approximately 30 percent of the workforce was female.",
    "openai_summarised_points": [
      "• The precise size of Sudan's labor force is challenging to ascertain due to varying definitions of economic activity participation and the lack of accurate official data.",
      "• In rural Sudan, a significant number of women and girls participate in traditional productive roles, though many are likely excluded from official workforce statistics.",
      "• According to an International Labour Organisation (ILO) estimate, more than 7.9 million people were employed in Sudan in 1989.",
      "• The employment situation in Sudan during the early 1990s was negatively impacted by the 1991 Persian Gulf War, which caused thousands of Sudanese workers based in Kuwait and Iraq to return home abruptly, often leaving their possessions behind.",
      "• Sudan’s political support of Iraq during the Gulf War contributed to the departure of thousands of Sudanese workers from Saudi Arabia.",
      "• By the year 2000, Sudan’s total labor force was estimated to have grown to approximately 12 million individuals.",
      "• Of the estimated 12 million labor force in 2000, the Sudanese government reported that 9.6 million were actively employed.",
      "• Women constituted about 30 percent of Sudan’s workforce around the year 2000."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:34.477325",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1717,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Determining the precise size of Sudan's labor force has historically presented considerable challenges due to several factors, including differing definitions of what constitutes participation in economic activity and the absence of comprehensive, accurate official data. Various surveys and reports have employed inconsistent criteria to measure labor force participation, complicating efforts to establish a definitive figure. Moreover, the informal nature of much economic activity in Sudan, particularly in rural areas, further obscured accurate labor force assessments. This lack of reliable data has impeded policymakers’ ability to precisely gauge employment trends and design targeted interventions. In rural regions of Sudan, a substantial proportion of women and girls engaged in traditional productive roles, which often went unrecognized in formal employment statistics. These roles included subsistence farming, livestock rearing, food processing, and household-based crafts, activities integral to the rural economy but frequently excluded from official labor force counts. Cultural norms and socioeconomic structures contributed to the underreporting of female labor participation, as much of the work performed by women was unpaid or considered an extension of domestic responsibilities rather than formal employment. Consequently, official workforce data tended to underestimate the true extent of female economic contribution, masking the vital role women played in sustaining rural livelihoods. According to an estimate by the International Labour Organisation (ILO), more than 7.9 million people were employed in Sudan in 1989. This figure reflected the combined employment across various sectors, including agriculture, industry, and services, and underscored the predominance of agriculture as the primary source of livelihood for a majority of the population. At that time, the Sudanese economy was characterized by a large informal sector and widespread subsistence farming, which absorbed a significant portion of the labor force. The ILO’s estimate provided a crucial benchmark for understanding employment levels during a period marked by economic and political challenges. The employment situation in Sudan during the early 1990s experienced significant disruption as a result of the 1991 Persian Gulf War. The conflict precipitated the abrupt return of thousands of Sudanese workers who had been employed in Kuwait and Iraq, many of whom left behind their possessions and savings. These migrant workers had constituted a vital source of remittances for their families and communities back home, and their sudden repatriation created economic hardships both for the individuals involved and for the broader Sudanese economy. The loss of overseas employment opportunities exacerbated domestic unemployment and strained social support systems, as returning migrants struggled to reintegrate into a labor market already under pressure. Sudan’s political stance during the Gulf War further influenced the dynamics of its labor migration patterns. The government’s support of Iraq during the conflict led to the departure of thousands of Sudanese workers from Saudi Arabia, a key destination for migrant labor in the region. Saudi authorities, aligned with the coalition opposing Iraq, imposed restrictions and expulsions on Sudanese expatriates, reducing the flow of remittances and limiting employment prospects abroad. This political dimension of the Gulf War thus had direct repercussions on Sudan’s labor force, highlighting the interconnectedness of international relations and domestic employment conditions. By the year 2000, Sudan’s total labor force was estimated to have grown to approximately 12 million individuals, reflecting demographic growth and increased labor market participation. This expansion was driven by population increases as well as shifts in economic activity, including urbanization and diversification of the economy. The larger labor force presented both opportunities and challenges, as the economy needed to generate sufficient employment to absorb the growing number of job seekers. The government faced mounting pressure to create jobs and improve labor market conditions amid ongoing political instability and economic constraints. Of the estimated 12 million individuals constituting Sudan’s labor force in 2000, the Sudanese government reported that 9.6 million were actively employed. This employment figure indicated a substantial level of labor utilization, though it also implied the presence of underemployment and unemployment within the population. The gap between the total labor force and those employed underscored persistent challenges in achieving full employment, particularly given the country’s reliance on agriculture and the informal sector, where job security and income stability were limited. The government’s employment statistics provided a framework for assessing labor market performance and identifying sectors requiring policy attention. Women accounted for about 30 percent of Sudan’s workforce around the year 2000, reflecting gradual progress in female labor force participation despite enduring social and cultural barriers. This proportion highlighted the significant yet often underappreciated role of women in the economy, spanning agriculture, services, and increasingly, formal employment sectors. Efforts to enhance gender equality in employment faced obstacles such as limited access to education, traditional gender roles, and legal restrictions. Nonetheless, the presence of women in nearly one-third of the workforce signaled their vital contribution to Sudan’s economic activities and the potential for further integration into the labor market.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:56.291071",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 5749,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Unemployment",
    "text": "Unemployment figures were affected by the severe drought that spread\nthroughout Sudan in the 1980s. In 1983–84, for example, several million people\nmigrated from the worst-hit areas in both Western and Eastern Sudan to\nKhartoum and other urban areas along the Nile. Many remained in these areas\nonce the drought had eased, living in shantytowns and contributing to\nunemployment, underemployment, or employment in the informal sector in the\ncities. In addition, more than 2 million people from the South migrated to the\nNorth over the years, as a result of the civil war and famines in these areas.\nIn 2009 the government estimated unemployment at about 20 percent, perhaps not\nan accurate figure, because a large proportion of Sudanese engaged in small-\nscale and subsistence agriculture.",
    "openai_summarised_points": [
      "• The severe drought that affected Sudan throughout the 1980s significantly influenced unemployment figures in the country.",
      "• During 1983–84, several million people migrated from the most severely affected regions in both Western and Eastern Sudan to urban centers such as Khartoum and other areas along the Nile River.",
      "• Many migrants remained in these urban areas even after the drought conditions improved, residing in shantytowns and thereby contributing to increased unemployment, underemployment, or employment within the informal sector in these cities.",
      "• Over the years, more than 2 million people from Southern Sudan migrated to the North, driven by the civil war and famines affecting the southern regions.",
      "• In 2009, the Sudanese government estimated the national unemployment rate to be approximately 20 percent.",
      "• This 20 percent unemployment figure may not be entirely accurate due to the substantial proportion of the Sudanese population engaged in small-scale and subsistence agriculture, which is not always captured in formal employment statistics."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:35.411072",
      "openai_model": "gpt-4.1-mini",
      "content_length": 788,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "The severe drought that afflicted Sudan throughout the 1980s had a profound impact on the country’s unemployment landscape, exacerbating existing economic challenges and reshaping demographic patterns. This prolonged period of drought led to widespread crop failures and livestock losses, severely undermining the livelihoods of rural populations who were heavily dependent on agriculture and pastoralism. As a direct consequence, many individuals found themselves unable to sustain their traditional means of living, which in turn triggered significant population displacements and heightened unemployment pressures in urban centers. The environmental catastrophe thus acted as a catalyst, intensifying economic distress and contributing to a surge in labor market vulnerabilities across Sudan. Between 1983 and 1984, the drought’s most acute phase prompted the migration of several million people from the hardest-hit regions in both Western and Eastern Sudan. These migrants sought refuge and new opportunities in urban areas, particularly in Khartoum, the capital city, as well as other settlements along the Nile River. The influx of rural populations into these cities was driven by the collapse of agricultural productivity and the search for alternative sources of income. This demographic shift not only altered the urban population dynamics but also placed considerable strain on the cities’ infrastructure and labor markets. The sudden increase in urban dwellers challenged the capacity of local economies to absorb new workers, thereby amplifying the rates of unemployment and underemployment. Many of the migrants who relocated to urban centers during and after the drought remained in these areas even after environmental conditions improved. However, their settlement was often informal, with large numbers residing in shantytowns or peripheral neighborhoods lacking adequate services and formal employment opportunities. The persistence of these informal settlements reflected the limited capacity of Sudan’s urban economies to generate sufficient formal jobs, compelling many migrants to engage in underemployment or to seek livelihoods within the informal sector. This sector, characterized by unregulated and often precarious work arrangements, became a critical component of urban employment, though it typically offered low wages and minimal job security. The growth of shantytowns and informal employment thus became emblematic of the broader challenges facing Sudan’s urban labor markets in the aftermath of the drought. In addition to drought-induced migration, Sudan’s internal conflicts further influenced population movements and labor market conditions. Over the years, more than two million people from Southern Sudan migrated to the northern regions of the country. This large-scale displacement was primarily driven by the prolonged civil war and recurrent famines that devastated the southern areas. The southern migrants, fleeing violence and food insecurity, sought safety and economic opportunities in the North, where urban centers and agricultural lands offered relatively better prospects. However, this influx added to the demographic pressures in northern cities and rural areas, complicating efforts to address unemployment and social integration. The southern migration thus represented a significant dimension of Sudan’s internal displacement crisis, with far-reaching implications for the country’s socio-economic stability. By 2009, the Sudanese government estimated the national unemployment rate to be approximately 20 percent. This figure reflected the ongoing difficulties faced by the labor market in absorbing the growing population and providing adequate employment opportunities. High unemployment rates were symptomatic of structural economic issues, including limited industrial development, reliance on subsistence agriculture, and the challenges of transitioning to a diversified economy. Furthermore, the unemployment rate underscored the persistent gap between labor supply and demand, particularly in urban areas where job creation lagged behind population growth. The government’s estimate thus highlighted the critical need for policy interventions aimed at stimulating economic growth and expanding employment opportunities across various sectors. However, the reported 20 percent unemployment rate may not fully capture the complexities of Sudan’s labor market due to the substantial proportion of the population engaged in small-scale and subsistence agriculture. A large segment of Sudanese households relied on family farming and informal agricultural activities that often fell outside the scope of formal employment statistics. These subsistence activities, while not generating significant monetary income, provided essential livelihoods and food security for millions of people. Consequently, official unemployment figures tended to underestimate the extent of underemployment and disguised unemployment prevalent in rural areas. The informal nature of much agricultural work, combined with limited data collection mechanisms, posed significant challenges to accurately assessing the true scale of unemployment and labor market distress in Sudan. Overall, the interplay of environmental shocks, internal displacement, and structural economic constraints shaped the evolution of unemployment in Sudan over several decades. The drought of the 1980s acted as a pivotal event that triggered mass migration and urbanization, while ongoing conflicts and socio-political instability further complicated labor market dynamics. Despite government efforts to monitor and address unemployment, the reliance on subsistence agriculture and informal economic activities meant that official statistics only partially reflected the realities faced by the Sudanese workforce. These factors collectively underscored the multifaceted nature of unemployment in Sudan and the need for comprehensive strategies to promote sustainable economic development and inclusive employment growth.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:59.416347",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 6036,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Labor force by sector",
    "text": "Agriculture was formerly the predominant activity in Sudan, although its share\nof the labor force gradually declined as other sectors of economic activity\nexpanded. In the 1955–56 census, almost 86 percent of those then considered as\npart of the workforce were involved in agriculture, livestock raising,\nforestry, fisheries, or hunting. The ILO estimated that by 1998, the figure\nhad declined to 70–80 percent. By 2008 the government claimed that the\npercentage was significantly lower. The services sector, which included a\ngovernment workforce that grew about 10 percent a year in the 1970s, emerged\nas the second largest area of activity, encompassing an estimated 13–22\npercent of those economically active in 1998, compared with 4.6 percent in\n1955–56. The industry sector, including manufacturing, mining, electric power,\nand construction, accounted for 7–9 percent during 1998, compared to 5.6\npercent in 1955–56. The proportions of the labor force in each of these\nsectors undoubtedly changed after the estimates were made in 1998, as the\nrelative importance of these sectors altered in the succeeding years. It was\ndifficult to determine the extent of the changes, however, as despite the oil\nsector's great importance, it did not directly employ many people. Its impact\non employment occurred as a result of the increased spending allowed to the\ngovernment, which created new jobs, often in the public sector.",
    "openai_summarised_points": [
      "• Agriculture was historically the predominant economic activity in Sudan, with its share of the labor force gradually declining as other sectors expanded over time.",
      "• In the 1955–56 census, approximately 86 percent of the workforce were engaged in agriculture, livestock raising, forestry, fisheries, or hunting.",
      "• The International Labour Organization (ILO) estimated that by 1998, the proportion of the labor force involved in agriculture and related activities had decreased to between 70 and 80 percent.",
      "• By 2008, the Sudanese government claimed that the percentage of the labor force engaged in agriculture and related sectors was significantly lower than the 1998 estimates.",
      "• The services sector, which included a government workforce that grew at an annual rate of about 10 percent during the 1970s, became the second largest area of economic activity.",
      "• In 1998, the services sector encompassed an estimated 13 to 22 percent of those economically active, a substantial increase from 4.6 percent recorded in the 1955–56 census.",
      "• The industry sector, comprising manufacturing, mining, electric power, and construction, accounted for between 7 and 9 percent of the labor force in 1998, compared to 5.6 percent in 1955–56.",
      "• The proportions of the labor force engaged in agriculture, services, and industry sectors likely changed after 1998, reflecting shifts in the relative importance of these sectors in subsequent years.",
      "• Precise determination of labor force changes post-1998 was challenging due to the oil sector’s significant economic role but limited direct employment impact.",
      "• The oil sector influenced employment indirectly by increasing government revenue, which in turn funded the creation of new jobs, predominantly in the public sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:39.440186",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1420,
      "bullet_points_count": 10
    },
    "generated_detailed_content": "Agriculture historically dominated Sudan's economy, serving as the primary source of employment for the majority of the population. Over time, however, the share of the labor force engaged in agricultural activities gradually declined as other economic sectors expanded and diversified. This shift reflected broader structural changes within the economy, including urbanization, industrialization, and the growth of government services. In the 1955–56 national census, approximately 86 percent of Sudan’s workforce was involved in agriculture, livestock raising, forestry, fisheries, or hunting, underscoring the sector’s overwhelming predominance during the mid-20th century. These activities formed the backbone of rural livelihoods and were central to Sudan’s subsistence economy, with the vast majority of the population relying on traditional farming and pastoralism. By the late 1990s, the International Labour Organization (ILO) estimated that the proportion of the labor force engaged in agriculture and related activities had decreased to between 70 and 80 percent. This decline, while still indicating a dominant agricultural sector, highlighted the gradual diversification of Sudan’s economic base. The reduction in agricultural employment was influenced by several factors, including population growth, migration to urban areas, and the development of other sectors such as services and industry. The ILO’s estimates reflected the ongoing transition in Sudan’s labor market, where a growing segment of the workforce sought employment opportunities outside of traditional agriculture, particularly in urban centers and emerging industrial zones. By 2008, the Sudanese government asserted that the percentage of the labor force engaged in agriculture and related sectors was significantly lower than the estimates provided in 1998. This claim suggested a continuation of the trend toward economic diversification and a further decline in agricultural employment as a share of total labor. The government’s position was likely based on more recent data and reflected the impact of policy initiatives aimed at industrial development, infrastructure expansion, and the growth of the services sector. These changes were also influenced by the country’s evolving economic landscape, including the increasing importance of oil production and related government revenues, which contributed to shifts in employment patterns. The services sector emerged as the second largest area of economic activity in Sudan, growing notably over the decades following independence. This sector encompassed a wide range of activities, including government administration, education, health services, retail, and transportation. During the 1970s, the government workforce expanded at an annual rate of about 10 percent, reflecting the state’s increasing role in the economy and public service provision. This rapid growth in government employment was part of broader efforts to modernize the country’s administrative structures and improve social services. By 1998, the services sector accounted for an estimated 13 to 22 percent of those economically active, marking a substantial increase from the 4.6 percent recorded in the 1955–56 census. This expansion underscored the sector’s rising importance as a source of employment and economic activity, particularly in urban areas. The industrial sector, which included manufacturing, mining, electric power generation, and construction, also experienced growth, albeit at a more modest pace compared to services. In 1955–56, industry accounted for 5.6 percent of the labor force, reflecting the nascent stage of industrial development in Sudan at the time. By 1998, this proportion had increased to between 7 and 9 percent, indicating gradual industrialization and diversification of the economy. The expansion of manufacturing and mining activities, alongside infrastructure projects such as power generation and construction, contributed to the creation of new employment opportunities outside the traditional agricultural sector. This growth was driven by government initiatives to promote industrial development and attract investment, as well as by the exploitation of natural resources. Following 1998, the proportions of the labor force engaged in agriculture, services, and industry likely continued to evolve, mirroring shifts in the relative importance of these sectors within Sudan’s economy. However, precise determination of labor force changes during this period proved challenging due to the complex dynamics introduced by the oil sector. While oil production became a significant contributor to Sudan’s economic output and government revenues, its direct impact on employment was limited. The oil industry, characterized by capital-intensive extraction and production processes, generated relatively few jobs compared to its contribution to GDP. Consequently, traditional labor statistics did not fully capture the sector’s economic influence. Despite its limited direct employment, the oil sector influenced the labor market indirectly by substantially increasing government revenue. This influx of financial resources enabled the government to fund the creation of new jobs, predominantly within the public sector. The expansion of public employment included positions in administration, infrastructure development, education, and health services, which absorbed a portion of the labor force transitioning away from agriculture. The government’s ability to finance these jobs was closely tied to oil revenues, which became a critical component of Sudan’s fiscal capacity. Thus, while the oil sector did not directly employ large numbers of workers, its economic significance shaped employment patterns by facilitating public sector growth and altering the composition of the labor force. Overall, the labor force in Sudan underwent significant structural changes over the latter half of the 20th century and into the early 21st century. The dominance of agriculture gradually diminished as services and industry expanded, reflecting broader economic development trends and policy priorities. The emergence of the oil sector further complicated the labor market landscape by introducing new sources of revenue that supported public sector employment growth, even as direct oil-related jobs remained relatively scarce. These dynamics contributed to an increasingly diversified economy and a labor force distributed across multiple sectors, marking a departure from the historical reliance on agriculture as the primary source of livelihood.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:29:59.152772",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 10,
      "generated_content_length": 6591,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Child labor",
    "text": "The minimum working age in the early 2000s was 18 in theory; however, the law\nwas not enforced, and some 27 percent of Sudanese children aged 10 to 14 were\nestimated to be in the labor force. For example, children as young as 11 or 12\nyears of age worked in a number of factories outside the capital that produced\nedible oils. Child labor was widespread in the informal economy, and children\ntraditionally worked on the family farm from a young age. Sudan did not adhere\nto ILO Convention no. 182, the Worst Forms of Child Labor. The Child Act of\n2010, among other laws, governed hours and working conditions of young people,\nbut the law was not effectively enforced, particularly in the informal sector,\nwhere enforcement was especially difficult.",
    "openai_summarised_points": [
      "• In the early 2000s, the minimum legal working age in Sudan was set at 18 years; however, this law was not effectively enforced across the country.",
      "• Approximately 27 percent of Sudanese children aged between 10 and 14 years were estimated to be engaged in the labor force during this period.",
      "• Children as young as 11 or 12 years old were employed in various factories located outside the capital city, specifically in facilities producing edible oils.",
      "• Child labor was prevalent in Sudan’s informal economy, where regulatory oversight was minimal or absent.",
      "• It was customary for children to begin working on family farms from a very young age, reflecting traditional labor practices.",
      "• Sudan was not a signatory to or did not comply with the International Labour Organization (ILO) Convention No. 182, which addresses the Worst Forms of Child Labor.",
      "• The Child Act of 2010, along with other legislative measures, established regulations governing the working hours and conditions for young workers in Sudan.",
      "• Despite the existence of these laws, enforcement was largely ineffective, particularly within the informal sector, where monitoring and regulation posed significant challenges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:37.149433",
      "openai_model": "gpt-4.1-mini",
      "content_length": 748,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "In the early 2000s, Sudan established the minimum legal working age at 18 years, reflecting an attempt to align national labor laws with international standards aimed at protecting children from premature entry into the workforce. Despite this legislative framework, enforcement of the minimum age requirement was inconsistent and largely ineffective throughout much of the country. Structural challenges, including limited governmental capacity, insufficient labor inspection mechanisms, and widespread economic hardship, contributed to the gap between legal provisions and actual practice. Consequently, many children continued to engage in labor activities well below the stipulated minimum age, particularly in regions where poverty and lack of educational opportunities compelled families to rely on additional income generated by their children. During this period, it was estimated that approximately 27 percent of Sudanese children aged between 10 and 14 years were actively involved in the labor force. This significant proportion underscored the pervasive nature of child labor within the country, highlighting the socioeconomic factors that drove children into work rather than school. The engagement of such a large segment of young children in labor activities not only impeded their educational attainment but also exposed them to hazardous working conditions and exploitation. The prevalence of child labor in this age group reflected both the inadequacies of social protection systems and the economic necessity faced by many families, particularly in rural and marginalized communities. Children as young as 11 or 12 years old were employed in various industrial settings, including factories located outside the capital city of Khartoum. Notably, some of these factories specialized in the production of edible oils, where young workers were involved in labor-intensive processes. The employment of pre-adolescent children in such manufacturing environments raised concerns about occupational safety, health risks, and the violation of child labor laws. These factories often operated with minimal oversight, allowing the exploitation of young laborers to persist unchecked. The involvement of children in industrial work outside urban centers also illustrated the geographic spread of child labor beyond traditional agricultural settings into more formalized, albeit poorly regulated, sectors. Child labor in Sudan was particularly prevalent within the informal economy, a sector characterized by small-scale, unregistered enterprises and activities that typically escaped formal regulatory scrutiny. In this informal context, the absence of effective labor inspections and enforcement mechanisms allowed child labor to flourish. Informal economic activities, such as street vending, domestic work, artisanal mining, and small-scale agriculture, frequently relied on child labor due to low costs and the flexibility of employing young workers without adhering to legal standards. The informal economy’s dominance in Sudan’s overall economic structure thus posed significant barriers to the eradication of child labor, as government authorities struggled to monitor and regulate these dispersed and often transient work environments. Traditional labor practices also played a crucial role in the persistence of child labor in Sudan. It was customary for children to begin contributing to work on family farms from a very young age, often as part of their socialization and familial responsibilities. This early involvement in agricultural labor was deeply embedded in rural communities, where subsistence farming constituted the primary livelihood. Children’s participation in farm work was seen not only as an economic necessity but also as a means of acquiring practical skills and contributing to the household economy. However, this customary practice frequently conflicted with international norms regarding child rights and protection, as it exposed children to long hours of physically demanding labor that could interfere with their education and development. Sudan’s position regarding international conventions on child labor further complicated efforts to address the issue. The country was not a signatory to, nor did it comply with, the International Labour Organization (ILO) Convention No. 182, which specifically targets the elimination of the worst forms of child labor. This convention, adopted in 1999, obligates ratifying states to take immediate and effective measures to prohibit and eliminate the worst forms of child labor, including slavery, trafficking, forced labor, and hazardous work. Sudan’s non-ratification and non-compliance signaled a lack of formal commitment to international standards, thereby limiting external pressure and support for comprehensive reforms aimed at eradicating exploitative child labor practices. The absence of adherence to ILO Convention No. 182 also hindered Sudan’s access to international technical assistance and funding dedicated to combating child labor. In response to growing domestic and international concerns, Sudan enacted the Child Act of 2010, which, along with other legislative measures, sought to regulate the working hours and conditions for young workers. This legal framework aimed to provide clearer protections for children by establishing age-specific restrictions on labor participation, limiting working hours, and setting safety standards to prevent exploitation and harm. The Child Act represented a significant step toward aligning national laws with global child protection norms and demonstrated a legislative acknowledgment of the need to safeguard children’s rights within the labor market. Complementary regulations under this act addressed issues such as compulsory education and prohibited the employment of children in hazardous occupations, thereby attempting to mitigate the adverse effects of child labor on health and development. Despite the introduction of these laws, enforcement remained largely ineffective, particularly within the informal sector where most child labor occurred. The challenges of monitoring and regulating informal economic activities were compounded by limited resources, inadequate institutional capacity, and the widespread acceptance of child labor as a socioeconomic reality. Enforcement agencies faced difficulties in identifying violations, prosecuting offenders, and implementing corrective measures, especially in rural and conflict-affected areas. Additionally, cultural norms and economic imperatives often undermined legal provisions, as families prioritized immediate income over compliance with labor regulations. Consequently, while the Child Act of 2010 and related legislation provided a legal basis for child labor regulation, the practical impact of these laws was constrained by systemic obstacles and the entrenched nature of child labor in Sudan’s economy.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:06.943248",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 6918,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Forced labor",
    "text": "The 1998 constitution prohibited forced and bonded labor, although it did not\nspecifically prohibit trafficking in persons. Nevertheless, there were\ncredible reports that slavery persisted, particularly affecting women and\nchildren, and that the seizure and sale of women as domestic servants\ncontinued. All sides in the Sudanese conflict also conscripted men and boys\nforcibly into their fighting forces. In May 1998, the government formed the\nCommittee for the Eradication of the Abduction of Women and Children, which\nresulted in the identification and release of several hundred abductees, but\nthe government did not police the laws on forced and bonded labor effectively.\nIn November 2001, the government announced the establishment of special\ncivilian tribunals in the border regions separating the South and the North of\nthe country to prosecute persons involved in the abduction, transport,\nholding, and selling or exchanging of women and children from war zones. Even\nso, as late as 2010, the Committee surmised that possibly 10,000 or more\nabductees from groups such as the Misiriyyah and Rizayqat as well as South\nSudanese were engaged in some form of forced labor in the border regions.",
    "openai_summarised_points": [
      "• The 1998 constitution of Sudan prohibited forced and bonded labor but did not explicitly prohibit trafficking in persons.",
      "• Despite constitutional prohibitions, credible reports indicated that slavery persisted in Sudan, particularly affecting women and children.",
      "• The seizure and sale of women as domestic servants continued during this period.",
      "• All parties involved in the Sudanese conflict forcibly conscripted men and boys into their fighting forces.",
      "• In May 1998, the Sudanese government established the Committee for the Eradication of the Abduction of Women and Children, which led to the identification and release of several hundred abductees.",
      "• The Sudanese government did not effectively enforce laws against forced and bonded labor despite the committee’s efforts.",
      "• In November 2001, the government announced the creation of special civilian tribunals in the border regions between South and North Sudan to prosecute individuals involved in the abduction, transport, holding, selling, or exchanging of women and children from war zones.",
      "• As late as 2010, the Committee estimated that possibly 10,000 or more abductees, including members of the Misiriyyah and Rizayqat groups as well as South Sudanese, were subjected to some form of forced labor in the border regions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:41.854388",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1198,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "The 1998 constitution of Sudan explicitly prohibited forced and bonded labor, reflecting an official stance against these exploitative practices. However, this constitutional framework did not extend to an explicit prohibition of trafficking in persons, leaving a significant legal gap in addressing the full spectrum of human rights abuses related to forced servitude and exploitation. This omission allowed various forms of coercive labor and human trafficking to persist under the radar of formal legal protections. Despite the constitutional prohibitions against forced and bonded labor, credible reports during this period consistently indicated that slavery and related practices continued to be a pervasive problem within Sudan, disproportionately affecting vulnerable populations such as women and children. These reports documented ongoing abuses that contradicted the government’s stated legal commitments, highlighting a disconnect between formal legal norms and actual enforcement on the ground. One of the most egregious manifestations of these abuses was the continued seizure and sale of women as domestic servants. Women were frequently abducted or coerced into servitude, often sold or exchanged in markets or through informal networks, effectively maintaining a system of human chattel despite legal prohibitions. This practice not only violated the rights of the women involved but also perpetuated cycles of exploitation and gender-based violence. The use of women as domestic servants under conditions tantamount to slavery underscored the broader challenges in eradicating forced labor and trafficking in Sudan during this era. Compounding these abuses, all parties involved in the protracted Sudanese conflict forcibly conscripted men and boys into their fighting forces. This widespread practice of forced conscription further entrenched human rights violations, as children and adults alike were compelled to participate in armed conflict against their will. The recruitment of child soldiers and the forced enlistment of males into militias and government forces contributed to the destabilization of communities and exacerbated the humanitarian crisis within the country. In response to mounting domestic and international pressure, the Sudanese government took steps to address some aspects of these abuses. In May 1998, it established the Committee for the Eradication of the Abduction of Women and Children, a body tasked with identifying and facilitating the release of individuals who had been abducted during the conflict. This committee succeeded in locating and freeing several hundred abductees, signaling a degree of official recognition of the problem and a willingness to intervene in certain cases. Despite these efforts, the government did not effectively enforce laws against forced and bonded labor more broadly. The committee’s activities, while notable, were limited in scope and did not translate into comprehensive legal or institutional reforms to dismantle the systemic nature of forced labor and trafficking. Enforcement mechanisms remained weak, and many perpetrators operated with impunity, undermining the committee’s impact and the government’s broader commitment to eradicating these abuses. Further attempts to strengthen legal responses came in November 2001, when the Sudanese government announced the creation of special civilian tribunals in the border regions between South and North Sudan. These tribunals were designed specifically to prosecute individuals involved in the abduction, transport, holding, selling, or exchanging of women and children originating from war zones. The establishment of these tribunals represented an effort to provide a judicial avenue for addressing crimes related to human trafficking and forced servitude. However, the effectiveness of these tribunals was constrained by ongoing conflict, limited resources, and challenges in securing convictions, which collectively hindered their ability to serve as a robust deterrent against such crimes. Despite these institutional developments, the persistence of forced labor and abduction remained a significant concern well into the following decade. As late as 2010, the Committee for the Eradication of the Abduction of Women and Children estimated that possibly 10,000 or more abductees continued to be subjected to some form of forced labor in the border regions between South and North Sudan. These abductees included members of various ethnic and tribal groups, such as the Misiriyyah and Rizayqat, as well as South Sudanese individuals, reflecting the widespread and cross-cutting nature of the problem. The continued exploitation of these groups underscored the enduring legacy of conflict-related human rights abuses and the difficulties in fully eradicating forced labor practices in a context marked by political instability and weak governance. The scale of these abuses, as indicated by the Committee’s estimates, highlighted the ongoing humanitarian challenges faced by Sudan and the critical need for sustained efforts to protect vulnerable populations from trafficking, abduction, and forced labor.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:04.111300",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 5151,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Infrastructure",
    "text": "Highway in El-Obeid"
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Transport",
    "text": "The post office in Port Sudan.\n\nTwo trans-African automobile routes pass through Sudan: the Cairo-Cape Town\nHighway from north to south and the N'Djamena-Djibouti Highway from west to\neast.\n\nSudan has 4,725 kilometers of narrow-gauge, single-track railroads that serve\nthe northern and central portions of the country. The main line runs from Wadi\nHalfa on the Egyptian border to Khartoum and southwest to Al Ubayyid via\nSannar and Kusti, with extensions to Nyala in Southern Darfur and Wau in Bahr\nal Ghazal.\n\nOther lines connect Atbarah and Sannar with Port Sudan, and Sannar with Ad\nDamazin. A 1,400-kilometer line serves the al Gezira cotton-growing region. A\nmodest effort to upgrade rail transport is currently underway to reverse\ndecades of neglect and declining efficiency. Service on some lines may be\ninterrupted during the rainy season.",
    "openai_summarised_points": [
      "• Sudan is traversed by two major trans-African automobile routes: the Cairo-Cape Town Highway, which runs from north to south, and the N'Djamena-Djibouti Highway, which runs from west to east.",
      "• The country possesses 4,725 kilometers of narrow-gauge, single-track railroads primarily serving the northern and central regions of Sudan.",
      "• The principal railway line extends from Wadi Halfa, located on the Egyptian border, to Khartoum, and continues southwest to Al Ubayyid, passing through Sannar and Kusti, with further extensions reaching Nyala in Southern Darfur and Wau in Bahr al Ghazal.",
      "• Additional railway connections include lines linking Atbarah and Sannar with the port city of Port Sudan, as well as a line connecting Sannar with Ad Damazin.",
      "• A significant 1,400-kilometer railway line services the al Gezira region, which is notable for its cotton-growing industry.",
      "• There is an ongoing, albeit modest, initiative to upgrade Sudan’s rail transport infrastructure aimed at reversing the effects of decades of neglect and declining operational efficiency.",
      "• Rail service on certain lines is subject to potential interruptions during the rainy season, affecting reliability and continuity of transport.",
      "• The post office in Port Sudan is mentioned, indicating the presence of postal infrastructure in this key port city."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:37.150526",
      "openai_model": "gpt-4.1-mini",
      "content_length": 847,
      "bullet_points_count": 8
    },
    "generated_detailed_content": "Sudan is intersected by two major trans-African automobile routes that play a crucial role in regional connectivity and trade. The first, the Cairo-Cape Town Highway, runs longitudinally from north to south, linking Egypt in the north with South Africa in the south, and passing through Sudan’s territory as a vital corridor for vehicular traffic across the continent. This highway facilitates the movement of goods and people, contributing significantly to Sudan’s integration within the broader African transport network. The second major route, the N'Djamena-Djibouti Highway, traverses the country from west to east, connecting Chad’s capital, N'Djamena, to the port city of Djibouti on the Red Sea. This east-west axis enhances Sudan’s accessibility to maritime trade routes and serves as an essential link for landlocked neighboring countries seeking access to international markets. Sudan’s rail transport infrastructure comprises approximately 4,725 kilometers of narrow-gauge, single-track railroads that primarily serve the northern and central regions of the country. These rail lines have historically been the backbone of Sudan’s freight and passenger transport, supporting economic activities such as agriculture, mining, and trade. The narrow-gauge specification, while limiting in terms of speed and capacity compared to standard-gauge systems, was chosen during the colonial period and continues to define the country’s rail network. The single-track nature of most lines necessitates careful scheduling and passing loops to manage train traffic, which can constrain operational efficiency, especially during peak periods. The principal railway artery extends from Wadi Halfa, a town situated on the border with Egypt, southward to Khartoum, the national capital located at the confluence of the Blue and White Nile rivers. From Khartoum, the line continues southwest to Al Ubayyid, passing through key urban centers such as Sannar and Kusti. This main line serves as a critical conduit for the movement of goods and passengers within Sudan, linking agricultural and industrial hubs to the capital and beyond. Further extensions of the railway reach Nyala in Southern Darfur and Wau in Bahr al Ghazal, thereby connecting more remote and less accessible regions to the national rail network. These extensions have strategic importance for regional development and integration, although the infrastructure in these areas often faces challenges related to maintenance and service reliability. Additional railway connections complement the main line, including routes linking Atbarah and Sannar with Port Sudan, the country’s principal seaport on the Red Sea. These lines are vital for facilitating the export and import of commodities, enabling the efficient transfer of goods between inland production areas and maritime shipping routes. Another important rail link connects Sannar with Ad Damazin, enhancing access to the southeastern parts of Sudan and supporting the transportation needs of agricultural and industrial sectors in that region. The integration of these feeder lines with the main railway network ensures a degree of cohesion in Sudan’s rail transport system, although disparities in infrastructure quality and service frequency persist. A notable component of Sudan’s rail infrastructure is the approximately 1,400-kilometer railway line servicing the al Gezira region, an area renowned for its extensive cotton-growing industry. This railway line plays a pivotal role in supporting the agricultural economy by enabling the efficient transport of cotton and other crops to processing centers and export terminals. The Gezira Scheme, one of the largest irrigation projects in Africa, underpins the region’s agricultural productivity, and the railway infrastructure is integral to sustaining the flow of goods generated by this scheme. The presence of this dedicated rail line underscores the historical and ongoing importance of agriculture to Sudan’s economic landscape. In recent years, there has been a modest but ongoing initiative to upgrade Sudan’s rail transport infrastructure, aiming to reverse the detrimental effects of decades of neglect and declining operational efficiency. These efforts include rehabilitation of tracks, modernization of signaling systems, and procurement of new rolling stock to improve service reliability and capacity. The upgrades are intended to enhance the competitiveness of rail transport relative to road haulage, reduce transit times, and support economic growth by facilitating smoother domestic and cross-border trade. Despite these initiatives, progress has been gradual, constrained by financial limitations, political instability, and logistical challenges inherent in maintaining and expanding infrastructure across a vast and diverse territory. Rail service in Sudan is subject to seasonal interruptions, particularly during the rainy season, which affects the reliability and continuity of transport on certain lines. Heavy rains can cause flooding and damage to tracks, leading to delays or temporary suspension of services. These disruptions pose significant challenges for the timely movement of goods and passengers, especially in regions where alternative transport options are limited. The vulnerability of rail infrastructure to weather-related impacts highlights the need for improved maintenance regimes and investment in resilient construction techniques to mitigate seasonal risks. The presence of postal infrastructure in Sudan is exemplified by the post office in Port Sudan, indicating the integration of communication services within this key port city. As a major hub for maritime trade and logistics, Port Sudan’s postal facilities support both domestic and international correspondence and parcel delivery, complementing the city’s role as a gateway for goods entering and leaving the country. The postal system in Port Sudan forms part of the broader network of communication and transport services that underpin economic activity and social connectivity in Sudan.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:06.017987",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 8,
      "generated_content_length": 6065,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Energy",
    "text": "The chief sources of energy in 2010 were wood and charcoal, hydroelectric\npower, and oil.\n\nSudan is seeking to expand its installed capacity of electricity generation of\naround 300 MW;of which 180 MW is hydroelectric and the rest thermal. European\ninvestors, considering the continuing U.S. economic, trade, and financial\nsanctions regime, are the most likely providers of technology for this\npurpose.\n\nMore than 70% of Sudan's hydropower comes from the Roseires Dam on the Blue\nNile grid. Various projects are proposed to expand hydro-power, thermal\ngeneration, and other sources of energy, but so far the government has had\ndifficulty arranging sufficient financing. A new dam which is being\nestablished in Merowe which has been opened in 2008 and generates 125 MW of\nelectricity.",
    "openai_summarised_points": [
      "• In 2010, the primary sources of energy in Sudan were wood and charcoal, hydroelectric power, and oil.",
      "• Sudan aimed to expand its installed electricity generation capacity, which was approximately 300 MW at the time, with 180 MW derived from hydroelectric sources and the remainder from thermal power.",
      "• Due to ongoing U.S. economic, trade, and financial sanctions, European investors were considered the most probable providers of technology and investment for Sudan’s electricity generation expansion.",
      "• Over 70% of Sudan’s hydropower was generated by the Roseires Dam, located on the Blue Nile grid, making it the dominant source of hydroelectric power in the country.",
      "• The Sudanese government proposed various projects to increase capacity in hydropower, thermal generation, and alternative energy sources, but faced significant challenges in securing adequate financing for these initiatives.",
      "• The Merowe Dam, a new hydroelectric project, was completed and opened in 2008, contributing 125 MW of electricity to Sudan’s power grid."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:39.456022",
      "openai_model": "gpt-4.1-mini",
      "content_length": 782,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "In 2010, Sudan's energy landscape was characterized by a reliance on a combination of traditional biomass fuels, hydroelectric power, and oil. Wood and charcoal remained the primary sources of energy for the majority of the population, particularly in rural areas where access to modern energy infrastructure was limited. These biomass fuels were predominantly used for cooking and heating, reflecting the country's dependence on natural resources for everyday energy needs. Alongside biomass, hydroelectric power constituted a significant share of Sudan’s electricity generation, harnessing the country’s abundant river systems, especially the Nile and its tributaries. Oil also played an important role in the energy sector, both as a source of fuel and as an export commodity, although its contribution to domestic electricity generation was relatively modest compared to hydroelectric and thermal sources. At that time, Sudan’s installed electricity generation capacity was approximately 300 megawatts (MW), a figure that underscored the country’s limited ability to meet growing energy demand. Of this total capacity, about 180 MW was derived from hydroelectric power plants, highlighting the importance of renewable energy sources in the national grid. The remaining capacity came from thermal power stations, which primarily utilized fossil fuels such as diesel and heavy fuel oil. These thermal plants were essential for supplementing hydroelectric generation, especially during periods of low water flow or increased electricity consumption. The relatively small overall capacity reflected the challenges Sudan faced in expanding its energy infrastructure to support industrial growth, urbanization, and rural electrification. Efforts to increase electricity generation capacity were complicated by Sudan’s geopolitical situation, particularly the economic, trade, and financial sanctions imposed by the United States. These sanctions restricted Sudan’s access to American technology, financing, and investment, thereby limiting opportunities for collaboration with U.S.-based companies. Consequently, European investors emerged as the most probable sources of technology transfer and capital investment for Sudan’s energy sector expansion. European firms and financial institutions were seen as more willing or able to engage with Sudan despite the sanctions, offering potential partnerships for the development of new power plants and the modernization of existing infrastructure. This dynamic shaped the strategic approach of the Sudanese government as it sought to attract foreign investment and technical expertise to bolster its electricity generation capacity. Hydropower played a central role in Sudan’s electricity generation, with over 70 percent of the country’s hydropower output coming from the Roseires Dam. Situated on the Blue Nile grid, the Roseires Dam was the dominant source of hydroelectric power in Sudan, contributing significantly to the stability and reliability of the national grid. The dam’s reservoir and associated infrastructure allowed for the regulation of water flow, which was critical for maintaining consistent power generation throughout the year, particularly during dry seasons. The prominence of the Roseires Dam underscored the strategic importance of the Blue Nile basin in Sudan’s energy planning and highlighted the country’s dependence on a limited number of large-scale hydroelectric facilities. In response to the growing energy demand and the limitations of existing infrastructure, the Sudanese government proposed a series of projects aimed at increasing electricity generation capacity across multiple sources. These initiatives included expanding hydropower facilities, developing additional thermal power plants, and exploring alternative energy sources such as solar and wind power. The government recognized the need to diversify the energy mix to enhance energy security, reduce reliance on biomass, and support economic development. However, these ambitious plans faced significant obstacles, particularly in securing adequate financing. The combination of international sanctions, limited domestic capital, and perceived investment risks made it challenging to attract the necessary funding from both public and private sectors. As a result, many proposed projects experienced delays or remained in the planning stages, constraining Sudan’s ability to rapidly expand its energy infrastructure. One of the most notable developments in Sudan’s hydropower sector during this period was the completion and commissioning of the Merowe Dam in 2008. This large-scale hydroelectric project added 125 MW of electricity to Sudan’s power grid, representing a substantial increase in generation capacity. Located on the Nile River near the town of Merowe, the dam was designed to harness the river’s flow to produce renewable energy, contributing to the country’s efforts to reduce dependence on fossil fuels and traditional biomass. The Merowe Dam was also intended to support broader economic development objectives by providing a more reliable and sustainable electricity supply to urban and rural areas alike. Its completion marked a significant milestone in Sudan’s energy sector, demonstrating the government’s commitment to expanding hydropower capacity despite the financial and logistical challenges involved.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:10.212221",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 5374,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Currency and banking",
    "text": "| **This section is empty.** You can help by adding to it. _( March 2020)_\n---|---",
    "openai_summarised_points": [
      "• The \"Currency and banking\" section of the \"Economy of Sudan\" chapter on Wikipedia is currently empty as of March 2020.",
      "• There is an invitation for contributors to add content to this section to enhance the article's completeness and provide detailed information on Sudan's currency and banking system."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:39.463793",
      "openai_model": "gpt-4.1-mini",
      "content_length": 82,
      "bullet_points_count": 2
    },
    "generated_detailed_content": "As of March 2020, the section dedicated to currency and banking within the broader discussion of Sudan's economy remained undeveloped, lacking substantive content to inform readers about the nation’s monetary system and financial institutions. This absence highlighted a significant gap in the comprehensive coverage of Sudan’s economic framework, particularly considering the critical role that currency and banking play in shaping the country’s fiscal stability and development prospects. Sudan’s currency, the Sudanese pound, has undergone various transformations and revaluations throughout the country’s recent history, reflecting the economic challenges and policy shifts experienced over decades. The banking sector, encompassing both state-owned and private institutions, functions within a regulatory environment influenced by Sudan’s unique socio-political context and its efforts to modernize financial services while navigating international sanctions and economic reforms. The Sudanese pound (SDG) serves as the official currency, having replaced the Sudanese dinar in 2007 following a period of hyperinflation and economic instability. The Central Bank of Sudan (CBS) acts as the primary monetary authority, responsible for issuing currency, regulating the banking industry, and implementing monetary policy aimed at controlling inflation and stabilizing the economy. The banking system includes a mix of commercial banks, Islamic banks, and specialized financial institutions, reflecting Sudan’s predominantly Islamic financial framework. Islamic banking principles, which prohibit interest (riba) and promote profit-sharing arrangements, have a significant influence on the structure and operation of Sudanese banks, aligning financial practices with religious and cultural norms. Sudan’s banking sector has faced numerous challenges, including limited access to international financial markets due to sanctions imposed by the United States and other entities, which have constrained foreign investment and complicated international transactions. Additionally, the sector has contended with issues such as liquidity shortages, non-performing loans, and the need for modernization to improve efficiency and customer service. Despite these obstacles, efforts have been made to expand financial inclusion, promote digital banking technologies, and strengthen regulatory frameworks to enhance transparency and resilience. The government and Central Bank have periodically introduced reforms aimed at liberalizing the financial sector, encouraging private sector participation, and integrating Sudan’s banking system more fully into the global economy. Given the complexity and significance of Sudan’s currency and banking system, the lack of detailed information in this section represents an opportunity for contributors to enrich the article by providing comprehensive historical context, current institutional frameworks, and analyses of ongoing reforms. Detailed coverage would ideally include the evolution of the Sudanese pound, the role and structure of the Central Bank of Sudan, the composition and regulation of the banking sector, the impact of Islamic finance, and the challenges and prospects facing Sudan’s monetary and financial institutions. By incorporating such information, the article would offer readers a nuanced understanding of how currency and banking underpin Sudan’s economic landscape and influence its development trajectory.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:07.016964",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 2,
      "generated_content_length": 3466,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Trade, sanctions, and foreign aid",
    "text": "On 3 November 1997, the U.S. government imposed a trade embargo against Sudan\nand a total asset freeze against the Government of Sudan under Executive Order\n13067\\. The U.S. believed the Government of Sudan gave support to\ninternational terrorism, destabilized neighboring governments, and permitted\nhuman rights violations. A consequence of the embargo is that U.S.\ncorporations cannot invest in the Sudan oil industry, so companies in China,\nMalaysia and India are the major investors.\n\nHistorically, the United States, the United Kingdom, the Netherlands, Italy,\nGermany, Saudi Arabia, Kuwait, and other Organization of Petroleum Exporting\nCountries (OPEC) nations traditionally have supplied most of Sudan's economic\nassistance. Sudan's role as an economic link between Arab and African\ncountries is reflected by the presence in Khartoum of the Arab Bank for\nAfrican development. The World Bank had been the largest source of development\nloans.",
    "openai_summarised_points": [
      "• On 3 November 1997, the U.S. government imposed a trade embargo against Sudan and enacted a total asset freeze against the Government of Sudan under Executive Order 13067.",
      "• The U.S. government justified the embargo by asserting that the Government of Sudan supported international terrorism, destabilized neighboring governments, and permitted human rights violations.",
      "• As a direct consequence of the embargo, U.S. corporations are prohibited from investing in Sudan's oil industry, resulting in major investments coming from companies based in China, Malaysia, and India.",
      "• Historically, Sudan has received most of its economic assistance from the United States, the United Kingdom, the Netherlands, Italy, Germany, Saudi Arabia, Kuwait, and other member nations of the Organization of Petroleum Exporting Countries (OPEC).",
      "• Sudan’s strategic economic position as a link between Arab and African countries is exemplified by the presence of the Arab Bank for African Development in Khartoum.",
      "• The World Bank has traditionally been the largest source of development loans for Sudan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:04:42.481647",
      "openai_model": "gpt-4.1-mini",
      "content_length": 948,
      "bullet_points_count": 6
    },
    "generated_detailed_content": "On 3 November 1997, the United States government imposed a comprehensive trade embargo against Sudan and enacted a total asset freeze targeting the Government of Sudan through Executive Order 13067. This executive order effectively prohibited all U.S. persons and entities from engaging in trade or financial transactions with Sudan, marking a significant escalation in the economic restrictions placed on the country. The embargo aimed to isolate Sudan economically and politically by cutting off access to U.S. capital markets and preventing American companies from conducting business within Sudan’s borders. This measure reflected the U.S. administration’s broader strategy of using economic sanctions as a tool to influence foreign governments deemed to be acting contrary to American interests and international norms. The U.S. government justified the imposition of the embargo by asserting that the Government of Sudan was actively supporting international terrorism, thereby posing a threat not only to regional stability but also to global security. Additionally, the U.S. accused Sudan of destabilizing neighboring governments, particularly through alleged support for insurgent groups and militias operating across borders in East Africa. Human rights violations within Sudan further compounded the rationale for sanctions, as reports of government-sponsored abuses, including repression of political dissent and violations of civil liberties, drew international condemnation. These factors combined to create a narrative that Sudan’s ruling authorities were undermining peace and security both domestically and regionally, prompting the U.S. to adopt stringent economic measures as a form of pressure. As a direct consequence of the U.S. trade embargo, American corporations found themselves legally barred from investing in Sudan’s burgeoning oil industry, which had become a critical sector of the country’s economy. This prohibition significantly altered the landscape of foreign investment in Sudan, as U.S. companies, which might otherwise have been major players in the oil sector, were excluded from participation. In the absence of American involvement, substantial investments in Sudan’s oil infrastructure and exploration activities were made instead by companies based in China, Malaysia, and India. These nations, often pursuing their own strategic and economic interests, filled the void left by U.S. firms, thereby strengthening Sudan’s economic ties with emerging Asian powers. This shift not only influenced the development trajectory of Sudan’s oil industry but also had broader geopolitical implications, as it aligned Sudan more closely with countries that were less constrained by Western sanctions. Historically, Sudan’s economic assistance has come from a diverse array of international donors, reflecting its complex geopolitical position and the varied interests of foreign governments in the region. The United States, despite imposing sanctions, had previously been one of the largest providers of economic aid to Sudan, alongside European countries such as the United Kingdom, the Netherlands, Italy, and Germany. These Western nations contributed development assistance aimed at supporting economic growth, infrastructure development, and humanitarian relief efforts. In addition to Western donors, Sudan also received significant financial support from members of the Organization of Petroleum Exporting Countries (OPEC), including Saudi Arabia and Kuwait. These oil-rich states extended aid as part of broader efforts to maintain influence in Africa and to foster economic partnerships with countries situated at strategic crossroads between the Arab world and sub-Saharan Africa. The combination of Western and OPEC assistance underscored Sudan’s role as a focal point of competing international interests. Sudan’s strategic economic position is further exemplified by its function as a vital link between Arab and African countries, a role that has been institutionalized through the presence of regional financial institutions in its capital. Notably, the Arab Bank for African Development is headquartered in Khartoum, symbolizing Sudan’s bridging role between the Arab League and African Union member states. This institution facilitates financial cooperation and development projects that span both regions, highlighting Sudan’s importance as a conduit for economic integration and collaboration. The bank’s location in Khartoum reflects the city’s status as a hub for diplomatic and economic exchanges, reinforcing Sudan’s potential to serve as a gateway for trade and investment flows between the two continents. This strategic positioning has contributed to Sudan’s appeal as a partner for regional development initiatives and cross-border economic ventures. The World Bank has traditionally been the largest source of development loans for Sudan, providing critical financial resources to support the country’s economic growth and structural reforms. Through various loan programs and technical assistance projects, the World Bank has sought to address Sudan’s development challenges, including infrastructure deficits, poverty reduction, and institutional capacity building. The bank’s involvement has often been pivotal in mobilizing additional donor funding and in coordinating international efforts to promote sustainable development within Sudan. Despite political and economic difficulties, the World Bank’s engagement has underscored the international community’s recognition of Sudan’s development potential and the importance of fostering economic stability in the region. The bank’s role as a principal financier has also meant that Sudan’s economic policies and reform agendas have frequently been influenced by the conditions and priorities set forth by this multilateral institution.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:30:18.404593",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 6,
      "generated_content_length": 5849,
      "generation_type": "detailed_expansion"
    }
  },
  {
    "chapter_name": "Economy of Sudan",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Macro-economic trend",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in bn. US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in bn. US$ nominal)  | GDP growth\n(real)  | Inflation, CPI\n| Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 20.6  | 1,103  | 9.1  | 2.5%  | 26.5%  | ...\n1985  | 27.2  | 1,241  | 5.5  | −0.6%  | 45.6%  | ...\n1990  | 39.6  | 1,538  | 2.2  | 0.8%  | −0.9%  | ...\n1995  | 58.5  | 2,092  | 6.7  | 8.9%  | 68.4%  | 239%\n2000  | 86.9  | 2,794  | 13.1  | 8.4%  | 7.1%  | 143%\n2005  | 135.1  | 3,828  | 35.2  | 5.6%  | 8.5%  | 75%\n2006  | 148.4  | 4,098  | 45.3  | 6.5%  | 7.2%  | 64%\n2007  | 161.2  | 4,337  | 59.4  | 5.7%  | 14.8%  | 54%\n2008  | 170.6  | 4,475  | 64.8  | 3.8%  | 14.3%  | 56%\n2009  | 166.9  | 4,267  | 54.8  | −2.8%  | 11.3%  | 71%\n2010  | 175.4  | 4,371  | 65.7  | 3.9%  | 13.0%  | 75%\n2011  | 173.3  | 5,306  | 66.4  | −3.2%  | 18.1%  | 78%\n2012  | 146.5  | 4,180  | 48.9  | −17.0%  | 35.6%  | 118%\n2013  | 151.9  | 4,201  | 52.9  | 2.0%  | 36.5%  | 106%\n2014  | 161.8  | 4,338  | 60.7  | 4.7%  | 36.9%  | 84%\n2015  | 171.3  | 4,456  | 64.5  | 4.9%  | 16.9%  | 93%\n2016  | 181.0  | 4,572  | 64.9  | 4.7%  | 17.8%  | 110%\n2017  | 185.7  | 4,553  | 48.9  | 0.8%  | 32.4%  | 150%\n2018  | 192.3  | 4,580  | 33.6  | −2.3%  | 63.3%  | 210%\n2019  | 183.6  | 4,248  | 31.5  | −2.5%  | 51.0%  | 217%\n2020  | 197.6  | 4,455  | 35.2  | −3.6%  | 163.3%  | 278%\n2021  | 171.1  | 3,761  | 35.1  | 0.5%  | 359.1%  | 190%\n2022  | 178.7  | 3,829  | 33.5  | −2.5%  | 138.8%  | 187%\n2023  | 151.3  | 3,158  | 38.1  | −18.3%  | 77.2%  | 252%\n2024  | 123.5  | 2,513  | 29.8  | −20.3%  | 200.1%  | 344%",
    "openai_summarised_points": [
      "• In 1980, Sudan's GDP measured at 20.6 billion US$ PPP with a GDP per capita of 1,103 US$ PPP, nominal GDP of 9.1 billion US$, real GDP growth of 2.5%, and inflation rate of 26.5%; government debt data was not provided.",
      "• By 1985, GDP increased to 27.2 billion US$ PPP, GDP per capita rose to 1,241 US$ PPP, nominal GDP decreased to 5.5 billion US$, real GDP growth was negative at −0.6%, inflation surged to 45.6%, with government debt data unavailable.",
      "• In 1990, Sudan's GDP reached 39.6 billion US$ PPP, GDP per capita was 1,538 US$ PPP, nominal GDP dropped to 2.2 billion US$, real GDP growth slightly positive at 0.8%, inflation was negative at −0.9%, and government debt figures were not recorded.",
      "• The year 1995 saw GDP at 58.5 billion US$ PPP, GDP per capita at 2,092 US$ PPP, nominal GDP at 6.7 billion US$, real GDP growth at 8.9%, inflation at 68.4%, and government debt at a high 239% of GDP.",
      "• In 2000, GDP rose to 86.9 billion US$ PPP, GDP per capita to 2,794 US$ PPP, nominal GDP to 13.1 billion US$, real GDP growth at 8.4%, inflation dropped significantly to 7.1%, and government debt decreased to 143% of GDP.",
      "• By 2005, GDP expanded to 135.1 billion US$ PPP, GDP per capita increased to 3,828 US$ PPP, nominal GDP surged to 35.2 billion US$, real GDP growth was 5.6%, inflation at 8.5%, and government debt further declined to 75% of GDP.",
      "• In 2006, GDP reached 148.4 billion US$ PPP, GDP per capita was 4,098 US$ PPP, nominal GDP jumped to 45.3 billion US$, real GDP growth increased to 6.5%, inflation decreased to 7.2%, and government debt dropped to 64% of GDP.",
      "• The year 2007 recorded GDP at 161.2 billion US$ PPP, GDP per capita at 4,337 US$ PPP, nominal GDP at 59.4 billion US$, real GDP growth at 5.7%, inflation rose to 14.8%, and government debt declined to 54% of GDP.",
      "• In 2008, GDP was 170.6 billion US$ PPP, GDP per capita 4,475 US$ PPP, nominal GDP 64.8 billion US$, real GDP growth slowed to 3.8%, inflation slightly decreased to 14.3%, and government debt slightly increased to 56% of GDP.",
      "• Sudan's GDP in 2009 was 166.9 billion US$ PPP, GDP per capita dropped to 4,267 US$ PPP, nominal GDP declined to 54.8 billion US$, real GDP growth was negative at −2.8%, inflation fell to 11.3%, and government debt rose to 71% of GDP.",
      "• In 2010, GDP increased to 175.4 billion US$ PPP, GDP per capita rose to 4,371 US$ PPP, nominal GDP climbed to 65.7 billion US$, real GDP growth rebounded to 3.9%, inflation increased to 13.0%, and government debt rose to 75% of GDP.",
      "• The year 2011 saw GDP slightly decline to 173.3 billion US$ PPP, GDP per capita increased significantly to 5,306 US$ PPP, nominal GDP marginally increased to 66.4 billion US$, real GDP growth was negative at −3.2%, inflation rose to 18.1%, and government debt increased to 78% of GDP.",
      "• In 2012, GDP sharply decreased to 146.5 billion US$ PPP, GDP per capita dropped to 4,180 US$ PPP, nominal GDP fell to 48.9 billion US$, real GDP growth plummeted to −17.0%, inflation surged to 35.6%, and government debt escalated to 118% of GDP.",
      "• Sudan's GDP in 2013 slightly recovered to 151.9 billion US$ PPP, GDP per capita stabilized at 4,201 US$ PPP, nominal GDP increased to 52.9 billion US$, real GDP growth was positive at 2.0%, inflation marginally increased to 36.5%, and government debt decreased to 106% of GDP.",
      "• In 2014, GDP rose to 161.8 billion US$ PPP, GDP per capita increased to 4,338 US$ PPP, nominal GDP grew to 60.7 billion US$, real GDP growth improved to 4.7%, inflation remained high at 36.9%, and government debt reduced to 84% of GDP.",
      "• The year 2015 recorded GDP at 171.3 billion US$ PPP, GDP per capita at 4,456 US$ PPP, nominal GDP at 64.5 billion US$, real GDP growth at 4.9%, inflation significantly dropped to 16.9%, and government debt increased to 93% of GDP.",
      "• In 2016, GDP increased to 181.0 billion US$ PPP, GDP per capita rose to 4,572 US$ PPP, nominal GDP slightly increased to 64.9 billion US$, real GDP growth was 4.7%, inflation rose slightly to 17.8%, and government debt surged to 110% of GDP.",
      "• Sudan's GDP in 2017 was 185.7 billion US$ PPP, GDP per capita slightly decreased to 4,553 US$ PPP, nominal GDP dropped to 48.9 billion US$, real GDP growth slowed to 0.8%, inflation increased sharply to 32.4%, and government debt rose significantly to 150% of GDP.",
      "• In 2018, GDP grew to 192.3 billion US$ PPP, GDP per capita marginally increased to 4,580 US$ PPP, nominal GDP declined to 33.6 billion US$, real GDP growth was negative at −2.3%, inflation surged to 63.3%, and government debt escalated to 210% of GDP.",
      "• The year 2019 saw GDP decrease to 183.6 billion US$ PPP, GDP per capita dropped to 4,248 US$ PPP, nominal GDP slightly decreased to 31.5 billion US$, real GDP growth was negative at −2.5%, inflation decreased to 51.0%, and government debt further increased to 217% of GDP.",
      "• In 2020, GDP rose to 197.6 billion US$ PPP, GDP per capita increased to 4,455 US$ PPP, nominal GDP increased to 35.2 billion US$, real GDP growth declined to −3.6%, inflation soared dramatically to 163.3%, and government debt peaked at 278% of GDP.",
      "• Sudan's GDP in 2021 fell sharply to 171.1 billion US$ PPP, GDP per capita dropped to 3,761 US$ PPP, nominal GDP remained stable at 35.1 billion US$, real GDP growth was marginally positive at 0.5%, inflation surged to an extreme 359.1%, and government debt decreased to 190% of GDP.",
      "• In 2022, GDP slightly recovered to 178.7 billion US$ PPP, GDP per capita rose to 3,829 US$ PPP, nominal GDP declined to 33.5 billion US$, real GDP growth was negative at −2.5%, inflation decreased to 138.8%, and government debt slightly decreased to 187% of GDP.",
      "• The year 2023 experienced a significant GDP decline to 151.3 billion US$ PPP, GDP per capita dropped to 3,158 US$ PPP, nominal GDP increased to 38.1 billion US$, real GDP growth plummeted to −18.3%, inflation decreased to 77.2%, and government debt surged to 252% of GDP.",
      "• In 2024, Sudan's GDP further contracted to 123.5 billion US$ PPP, GDP per capita decreased to 2,513 US$ PPP, nominal GDP declined to 29.8 billion US$, real GDP growth worsened to −20.3%, inflation rose sharply to 200.1%, and government debt reached a peak of 344% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:05:13.834663",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1655,
      "bullet_points_count": 25
    },
    "generated_detailed_content": "In 1980, Sudan's economy was characterized by a gross domestic product (GDP) measured at 20.6 billion US dollars in purchasing power parity (PPP) terms, reflecting the overall size of the economy adjusted for relative price levels. The GDP per capita stood at 1,103 US dollars PPP, indicating the average economic output per person when adjusted for cost of living differences. The nominal GDP, which measures the market value of all final goods and services produced within the country at current prices, was reported at 9.1 billion US dollars. During this period, Sudan experienced a real GDP growth rate of 2.5%, signifying a moderate expansion in economic activity after adjusting for inflation. However, inflation was relatively high at 26.5%, indicating a substantial increase in general price levels within the economy. Data on government debt for this year was not provided, leaving an incomplete picture of fiscal sustainability. By 1985, Sudan's GDP had increased to 27.2 billion US dollars PPP, evidencing growth in the country's economic capacity over the five-year period. Correspondingly, GDP per capita rose to 1,241 US dollars PPP, suggesting a modest improvement in average economic well-being. Contrastingly, nominal GDP decreased significantly to 5.5 billion US dollars, a divergence that may reflect currency depreciation or price level changes. The real GDP growth rate turned negative at −0.6%, signaling a contraction in the economy after adjusting for inflation. Inflation surged sharply to 45.6%, indicating accelerating price increases and potential macroeconomic instability. Government debt data remained unavailable, hindering a full assessment of fiscal conditions during this period. In 1990, Sudan's GDP reached 39.6 billion US dollars PPP, marking continued expansion in the economy's size. The GDP per capita increased to 1,538 US dollars PPP, reflecting improved average income levels when adjusted for purchasing power. Nominal GDP, however, dropped further to 2.2 billion US dollars, continuing the trend of declining market-value output at current prices. Real GDP growth was slightly positive at 0.8%, indicating a marginal economic recovery. Inflation was recorded as negative at −0.9%, suggesting a brief period of deflation or price level stabilization. Government debt figures for this year were not recorded, leaving a gap in understanding the fiscal pressures faced by the government. By 1995, Sudan's GDP had expanded substantially to 58.5 billion US dollars PPP, demonstrating significant growth in economic capacity. The GDP per capita rose to 2,092 US dollars PPP, indicating enhanced average purchasing power among the population. Nominal GDP increased to 6.7 billion US dollars, reflecting a rebound in market-value output. Real GDP growth surged to 8.9%, signaling robust economic expansion during this period. Inflation, however, escalated dramatically to 68.4%, pointing to severe price instability and potential challenges in monetary policy management. Government debt reached an alarming high of 239% of GDP, indicating a critical level of indebtedness that could threaten fiscal sustainability and economic stability. In 2000, Sudan's GDP further rose to 86.9 billion US dollars PPP, continuing the trend of economic growth. The GDP per capita increased to 2,794 US dollars PPP, reflecting improved average living standards when adjusted for purchasing power. Nominal GDP more than doubled to 13.1 billion US dollars, signaling a significant increase in the economy's market value output. Real GDP growth remained strong at 8.4%, suggesting sustained economic expansion. Inflation dropped significantly to 7.1%, indicating improved price stability compared to the previous decade. Government debt decreased to 143% of GDP, reflecting some progress in fiscal consolidation and debt management efforts. By 2005, Sudan's GDP had expanded to 135.1 billion US dollars PPP, marking a substantial increase in overall economic output. The GDP per capita rose to 3,828 US dollars PPP, suggesting notable gains in average economic well-being. Nominal GDP surged to 35.2 billion US dollars, reflecting rapid growth in the market value of goods and services produced. Real GDP growth was recorded at 5.6%, indicating continued economic expansion, albeit at a slower pace compared to the late 1990s and early 2000s. Inflation remained moderate at 8.5%, suggesting relative price stability. Government debt further declined to 75% of GDP, representing a significant improvement in the country's fiscal position. In 2006, Sudan's GDP reached 148.4 billion US dollars PPP, continuing the upward trajectory in economic output. The GDP per capita increased to 4,098 US dollars PPP, reflecting ongoing improvements in average income levels. Nominal GDP jumped to 45.3 billion US dollars, indicating a substantial rise in the economy's market value. Real GDP growth accelerated to 6.5%, demonstrating robust economic performance. Inflation decreased slightly to 7.2%, maintaining a relatively stable price environment. Government debt dropped further to 64% of GDP, signaling continued fiscal consolidation. The year 2007 saw Sudan's GDP rise to 161.2 billion US dollars PPP, with GDP per capita reaching 4,337 US dollars PPP, indicating steady growth in economic output and average income. Nominal GDP increased significantly to 59.4 billion US dollars, reflecting robust market value expansion. Real GDP growth was recorded at 5.7%, showing sustained economic momentum. Inflation, however, rose to 14.8%, suggesting emerging inflationary pressures. Government debt declined to 54% of GDP, continuing the trend of improving fiscal health. In 2008, Sudan's GDP was 170.6 billion US dollars PPP, with GDP per capita at 4,475 US dollars PPP, indicating continued growth in economic capacity and average living standards. Nominal GDP reached 64.8 billion US dollars, reflecting a further increase in market value output. Real GDP growth slowed to 3.8%, signaling a deceleration in economic expansion. Inflation slightly decreased to 14.3%, though it remained elevated. Government debt experienced a slight increase to 56% of GDP, indicating a modest reversal in fiscal consolidation. Sudan's GDP in 2009 was 166.9 billion US dollars PPP, marking a slight contraction from the previous year. GDP per capita dropped to 4,267 US dollars PPP, reflecting a decline in average economic output per person. Nominal GDP declined to 54.8 billion US dollars, indicating a reduction in market value output. Real GDP growth was negative at −2.8%, signaling an economic contraction. Inflation fell to 11.3%, suggesting some easing of price pressures. Government debt rose to 71% of GDP, reflecting increased fiscal strain. In 2010, Sudan's GDP increased to 175.4 billion US dollars PPP, with GDP per capita rising to 4,371 US dollars PPP, indicating recovery in economic output and average income. Nominal GDP climbed to 65.7 billion US dollars, reflecting growth in market value output. Real GDP growth rebounded to 3.9%, signaling renewed economic expansion. Inflation increased to 13.0%, indicating rising price levels. Government debt rose to 75% of GDP, suggesting growing fiscal challenges. The year 2011 saw Sudan's GDP slightly decline to 173.3 billion US dollars PPP, while GDP per capita increased significantly to 5,306 US dollars PPP, a divergence that may reflect changes in population or income distribution. Nominal GDP marginally increased to 66.4 billion US dollars, indicating relative stability in market value output. Real GDP growth was negative at −3.2%, signaling economic contraction. Inflation rose to 18.1%, pointing to increasing price pressures. Government debt increased to 78% of GDP, reflecting worsening fiscal conditions. In 2012, Sudan experienced a sharp decrease in GDP to 146.5 billion US dollars PPP, marking a significant contraction in economic output. GDP per capita dropped to 4,180 US dollars PPP, indicating a decline in average economic well-being. Nominal GDP fell substantially to 48.9 billion US dollars, reflecting a marked reduction in market value output. Real GDP growth plummeted to −17.0%, indicating a severe economic downturn. Inflation surged to 35.6%, suggesting rampant price increases and macroeconomic instability. Government debt escalated dramatically to 118% of GDP, highlighting critical fiscal distress. Sudan's GDP in 2013 showed a slight recovery to 151.9 billion US dollars PPP, with GDP per capita stabilizing at 4,201 US dollars PPP, reflecting modest improvements in economic conditions. Nominal GDP increased to 52.9 billion US dollars, signaling a partial rebound in market value output. Real GDP growth was positive at 2.0%, indicating a return to economic expansion. Inflation marginally increased to 36.5%, maintaining high price levels. Government debt decreased to 106% of GDP, suggesting some fiscal stabilization. In 2014, GDP rose further to 161.8 billion US dollars PPP, with GDP per capita increasing to 4,338 US dollars PPP, indicating continued economic growth and improved average income. Nominal GDP grew to 60.7 billion US dollars, reflecting expanding market value output. Real GDP growth improved to 4.7%, signaling strengthening economic activity. Inflation remained high at 36.9%, pointing to persistent inflationary pressures. Government debt reduced to 84% of GDP, demonstrating progress in fiscal management. The year 2015 recorded Sudan's GDP at 171.3 billion US dollars PPP, with GDP per capita at 4,456 US dollars PPP, indicating ongoing economic expansion and rising average income. Nominal GDP was 64.5 billion US dollars, reflecting further growth in market value output. Real GDP growth stood at 4.9%, maintaining solid economic performance. Inflation significantly dropped to 16.9%, suggesting improved price stability. Government debt increased to 93% of GDP, indicating a reversal in fiscal consolidation. In 2016, Sudan's GDP increased to 181.0 billion US dollars PPP, with GDP per capita rising to 4,572 US dollars PPP, reflecting continued economic growth. Nominal GDP slightly increased to 64.9 billion US dollars, indicating stable market value output. Real GDP growth was 4.7%, maintaining steady expansion. Inflation rose slightly to 17.8%, signaling moderate price pressures. Government debt surged to 110% of GDP, highlighting growing fiscal challenges. Sudan's GDP in 2017 was 185.7 billion US dollars PPP, with GDP per capita slightly decreasing to 4,553 US dollars PPP, indicating a marginal decline in average economic output per person. Nominal GDP dropped to 48.9 billion US dollars, reflecting a significant contraction in market value output. Real GDP growth slowed sharply to 0.8%, signaling a near stagnation in economic activity. Inflation increased sharply to 32.4%, indicating mounting inflationary pressures. Government debt rose significantly to 150% of GDP, underscoring worsening fiscal conditions. In 2018, GDP grew to 192.3 billion US dollars PPP, with GDP per capita marginally increasing to 4,580 US dollars PPP, suggesting slight improvements in economic output and average income. Nominal GDP declined to 33.6 billion US dollars, reflecting a substantial reduction in market value output. Real GDP growth was negative at −2.3%, indicating economic contraction. Inflation surged dramatically to 63.3%, pointing to severe price instability. Government debt escalated to 210% of GDP, highlighting critical fiscal distress. The year 2019 saw Sudan's GDP decrease to 183.6 billion US dollars PPP, with GDP per capita dropping to 4,248 US dollars PPP, reflecting declining economic output and average income. Nominal GDP slightly decreased to 31.5 billion US dollars, indicating continued contraction in market value output. Real GDP growth was negative at −2.5%, signaling ongoing economic decline. Inflation decreased to 51.0%, though remaining extremely high. Government debt further increased to 217% of GDP, exacerbating fiscal challenges. In 2020, Sudan's GDP rose to 197.6 billion US dollars PPP, with GDP per capita increasing to 4,455 US dollars PPP, indicating a temporary rebound in economic output and average income. Nominal GDP increased to 35.2 billion US dollars, reflecting some recovery in market value output. Real GDP growth declined to −3.6%, signaling continued economic contraction. Inflation soared dramatically to 163.3%, indicating hyperinflationary conditions. Government debt peaked at 278% of GDP, representing an unsustainable fiscal burden. Sudan's GDP in 2021 fell sharply to 171.1 billion US dollars PPP, with GDP per capita dropping to 3,761 US dollars PPP, reflecting a significant decline in economic output and average income. Nominal GDP remained stable at 35.1 billion US dollars, indicating stagnation in market value output. Real GDP growth was marginally positive at 0.5%, signaling a slight economic recovery. Inflation surged to an extreme 359.1%, marking a period of hyperinflation. Government debt decreased to 190% of GDP, showing some fiscal adjustment despite ongoing economic challenges. In 2022, GDP slightly recovered to 178.7 billion US dollars PPP, with GDP per capita rising to 3,829 US dollars PPP, suggesting modest improvements in economic output and average income. Nominal GDP declined to 33.5 billion US dollars, reflecting a contraction in market value output. Real GDP growth was negative at −2.5%, indicating economic contraction. Inflation decreased to 138.8%, though remaining at very high levels. Government debt slightly decreased to 187% of GDP, continuing a trend of gradual fiscal adjustment. The year 2023 experienced a significant GDP decline to 151.3 billion US dollars PPP, with GDP per capita dropping to 3,158 US dollars PPP, reflecting a sharp contraction in economic output and average income. Nominal GDP increased to 38.1 billion US dollars, indicating a complex dynamic between price levels and output values. Real GDP growth plummeted to −18.3%, marking a severe economic downturn. Inflation decreased to 77.2%, signaling some easing of hyperinflationary pressures. Government debt surged to 252% of GDP, highlighting escalating fiscal distress. In 2024, Sudan's GDP further contracted to 123.5 billion US dollars PPP, with GDP per capita decreasing to 2,513 US dollars PPP, indicating continued economic decline and deteriorating average income. Nominal GDP declined to 29.8 billion US dollars, reflecting a reduction in market value output. Real GDP growth worsened to −20.3%, signaling a deepening recession. Inflation rose sharply to 200.1%, indicating renewed and severe inflationary pressures. Government debt reached a peak of 344% of GDP, underscoring an unprecedented level of fiscal imbalance and economic crisis.",
    "content_generation_metadata": {
      "generated_timestamp": "2025-08-01T17:31:09.975631",
      "openai_model": "gpt-4.1-mini",
      "source_bullet_points": 25,
      "generated_content_length": 14759,
      "generation_type": "detailed_expansion"
    }
  }
]