[
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Paraguay\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( November 2024)__(Learn how and when to remove\nthis message)_  \n---|---  \n  \nThe **economy ofParaguay** is a market economy that is highly dependent on\nagriculture products. In recent years, Paraguay's economy has grown as a\nresult of increased agricultural exports, especially soybeans. Paraguay has\nthe economic advantages of a young population and vast hydroelectric power.\nIts disadvantages include the few available mineral resources, and political\ninstability. The government welcomes foreign investment.\n\nAgriculture represents 30% of its GDP. According to official figures, 5% of\nlandowners own 90% of the land.",
    "openai_summarised_points": [
      "• The economy of Paraguay is characterized as a market economy with a strong dependence on agricultural products.",
      "• In recent years, Paraguay's economic growth has been driven primarily by increased agricultural exports, with soybeans being a particularly significant export commodity.",
      "• Paraguay benefits economically from having a young population, which can contribute to labor force growth and economic dynamism.",
      "• The country possesses vast hydroelectric power resources, which constitute a notable economic advantage.",
      "• Paraguay faces economic disadvantages including limited mineral resources and ongoing political instability, which can hinder sustained economic development.",
      "• The Paraguayan government maintains a policy that is welcoming to foreign investment, aiming to attract external capital inflows.",
      "• Agriculture accounts for approximately 30% of Paraguay’s Gross Domestic Product (GDP), underscoring its central role in the national economy.",
      "• Land ownership in Paraguay is highly concentrated, with official statistics indicating that 5% of landowners control 90% of the land, reflecting significant land distribution inequality."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:51.141137",
      "openai_model": "gpt-4.1-mini",
      "content_length": 910,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( November 2024)__(Learn how and when to remove this message)_\n---|---\n\nParaguay is a middle-income country that changed rapidly in the 1970s and\n1980s as a result of hydroelectric development, agricultural colonization,\nconstruction, and cash crop exports. Nevertheless, the country's gross\ndomestic product (GDP) in 1986 was approximately US$3.4 billion, or roughly\nUS$1,000 per capita, ranking Paraguay only ahead of Bolivia among countries of\nSouth America. Paraguay was the most agricultural economy of South America,\nand that sector influenced the performance of virtually every other sector of\nthe economy. The over dependence on agricultural economy and low tax\ncollections deteriorated the already wide gap wealth distribution. The extreme\npoverty increased from 16% to 20% during 2001 to 2012, even as the economy\ngrew. By 2013, it has a human development index of 0.669 which is even lower\nthan Bolivia.\n\nThe Paraguayan economic miracle of the 1970s came to a halt in 1982 because of\nthe completion of construction at Itaipú, lower commodity prices for cotton\nand soybeans, and a global recession. The economy recovered in 1984 and 1985,\nstagnated in 1986, and continued to expand in 1987 and 1988. Despite its rapid\ngrowth, the Paraguayan economy became increasingly dependent on soybeans and\ncotton for exports and overall economic dynamism. These two crops, however,\nremained subject to external price fluctuations and local weather conditions,\nboth of which varied considerably.\n\nEconomic growth in the post-World War II period occurred in the context of\npolitical stability characterized by authoritarian rule and patronage\npolitics. Government economic policies deviated little from 1954 to the late\n1980s, consistently favoring a strong private-enterprise economy with a large\nrole for foreign investment. Unlike most other Latin American economies, in\nParaguay import tariffs were generally low, fiscal deficits manageable, and\nexchange rates not overvalued. These trends faltered in the 1980s as the\ngovernment took a more active part in industry, deficits rose, and the\nnational currency was generally overvalued and devalued numerous times.\nThroughout the post-World War II era, Paraguay had no personal income tax, and\ngovernment revenues as a percentage of GDP were among the lowest in the world.\n\nDespite the sustained economic growth that marked the postwar period, the\ndistribution of economic benefits was highly inequitable. Although GDP\nexpanded rapidly in the 1970s, most economists estimated that income\ndistribution worsened during the decade. Government spending on social\nservices was particularly lacking. Paraguay's poverty was mostly a rural\nphenomenon, which increasingly involved competition for land in the eastern\nregion near the Brazilian border, especially in the departments\n(administrative divisions) of Alto Paraná, Canendiyú, and Caaguazú.\nNonetheless, land tenure was not generally the acute social problem it was in\nmany developing countries.\n\nAlthough Paraguay faced significant obstacles to future economic development,\nit displayed extraordinary potential. Paraguay contained little oil and no\nprecious metals or sea coasts, but the country was self-sufficient in many\nareas and was endowed with fertile land, dense forests, and swift rivers. The\nprocess of opening up the eastern border region to economic activity and\ncontinued agricultural expansion was expected to effect rapid changes in once-\nisolated Paraguay. Likewise, the development of a series of hydroelectric\nplants along the Río Paraná linked Paraguay to its neighbors and provided it\naccess to cherished energy resources and badly needed export revenues.\nFinally, road construction united different departments of Paraguay and\nprovided the country its first access to the Atlantic Ocean via Brazil. These\nprocesses of infrastructure development, hydroelectric expansion, agricultural\ncolonization, and a cash crop explosion allowed Paraguay by the late 1980s to\nbegin to tap its potential"
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "History of economic advancement",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( November 2024)__(Learn how and when to remove this message)_\n---|---\n\nUntil the Spanish established Asunción in 1537, economic activity in Paraguay\nwas limited to the subsistence agriculture of the Guaraní Indians. The\nSpanish, however, found little of economic interest in their colony, which had\nno precious metals and no sea coasts. The typical feudal Spanish economic\nsystem did not dominate colonial Paraguay, although the encomienda system was\nestablished. Economic relations were distinguished by the reducciones\n(reductions or townships) that were established by Jesuit missionaries from\nthe early seventeenth century until the 1760s. The incorporation of Indians\ninto these Jesuit agricultural communes laid the foundation for an\nagriculture-based economy that survived in the late twentieth century.\n\nThree years after Paraguay overthrew Spanish authority and gained its\nindependence, the country's economy was controlled by the autarkic policies of\nJosé Gaspar Rodríguez de Francia (1814–40), who closed the young nation's\nborders to virtually all international trade. Landlocked, isolated, and\nunderpopulated, Paraguay structured its economy around a centrally\nadministered agricultural sector, extensive cattle grazing, and inefficient\nshipbuilding and textile industries. After the demise of de Francia,\ngovernment policies focused on expanding international trade and stimulating\neconomic development. The government built several roads and authorized\nBritish construction of a railroad.\n\nThe War of the Triple Alliance (1865–70) fundamentally changed the Paraguayan\neconomy. Economic resources were employed in and destroyed by the war effort.\nParaguay was occupied by its enemies in 1870; the countryside was in virtual\nruin, the labor force was decimated, peasants were pushed into the environs of\nAsunción from the east and south, and the modernization of the preceding three\ndecades was undone. Sleepy, self-sufficient Paraguay, whose advances in\nagriculture and quality of life had been the envy of many in the Southern\nCone, became the most backward nation in that subregion.\n\nTo pay its substantial war debt, Paraguay sold large tracts of land to\nforeigners, mostly Argentines. These large land sales established the base of\nthe present-day land tenure system, which is characterized by a skewed\ndistribution of land. Unlike most of its neighbors, however, Paraguay's\neconomy was controlled not by a traditional, landed elite, but by foreign\ncompanies. Many Paraguayans grew crops and worked as wage laborers on\nlatifundios (large landholdings) typically owned by foreigners.\n\nThe late 1800s and the early 1900s saw a slow rebuilding of ports, roads, the\nrailroad, farms, cattle stock, and the labor force. The country was slowly\nbeing repopulated by former Brazilian soldiers who had fought in the War of\nthe Triple Alliance, and Paraguay's government encouraged European\nimmigration. Although few in number, British, German, Italian, and Spanish\ninvestors and farmers helped modernize the country. Argentine, Brazilian, and\nBritish companies in the late 1800s purchased some of Paraguay's best land and\nstarted the first large-scale production of agricultural goods for export. One\nArgentine company, whose owner had purchased 15 percent of the immense Chaco\nregion, processed massive quantities of tannin, which were extracted from the\nbark of the Chaco's ubiquitous quebracho (break-axe) hardwood. Large\nquantities of the extract were used by the region's thriving hide industry.\nAnother focus of large-scale agro-processing was the yerba maté bush, whose\nleaves produced the potent tea that is the national beverage. Tobacco farming\nalso flourished. Beginning in 1904, foreign investment increased as a\nsuccession of Liberal Party (Partido Liberal) administrations in Paraguay\nmaintained a staunch laissez-faire policy.\n\nThe period of steady economic recovery came to an abrupt halt in 1932 as the\ncountry entered another devastating war. This time Paraguay fought Bolivia\nover possession of the Chaco and rumors of oil deposits. The war ended in 1935\nafter extensive human losses on both sides, and war veterans led the push for\ngeneral social reform. During the 1930s and 1940s, the state passed labor\nlaws, implemented agrarian reform, and assumed a role in modernization,\ninfluenced in part by the leadership of Juan Perón in Argentina and Getúlio\nVargas in Brazil. The 1940 constitution, for example, rejected the laissez-\nfaire approach of previous Liberal governments. Reformist policies, however,\ndid not enjoy a consensus, and by 1947 the country had entered into a civil\nwar, which in turn initiated a period of economic chaos that lasted until the\nmid-1950s. During this period, Paraguay experienced the worst inflation in all\nof Latin America, averaging over 100 percent annually in the 1950s.\n\nAfter centuries of isolation, two devastating regional wars, and a civil war,\nin 1954 Paraguay entered a period of prolonged political and economic\nstability under the authoritarian rule of Alfredo Stroessner. Stroessner's\neconomic policies took a middle course between social reform, desarrollismo,\nand laissez-faire, all in the context of patronage politics. Relative to\nprevious governments, Stroessner took a fairly active role in the economy but\nreserved productive activities for the local and foreign private sectors. The\nnew government's primary economic task was to arrest the country's rampant and\nspiraling price instability. In 1955 Stroessner fired the country's finance\nminister, who was unwilling to implement reforms, and in 1956 accepted an\nInternational Monetary Fund (IMF) stabilization plan that abolished export\nduties, lowered import tariffs, restricted credit, devalued the currency, and\nimplemented strict austerity measures. Although the sacrifice was high, the\nplan helped bring economic stability to Paraguay. Labor unions retaliated with\na major strike in 1958, but the new government, now firmly established,\nquelled the uprising and forced many labor leaders into exile; most of them\nremained there in the late 1980s.\n\nBy the 1960s, the economy was on a path of modest but steady economic growth.\nReal GDP growth during the 1960s averaged 4.2 percent a year, under the Latin\nAmerican average of 5.7 percent but well ahead of the chaotic economy of the\ntwo previous decades. As part of the United States-sponsored Alliance for\nProgress, the government was encouraged to expand its planning apparatus for\neconomic development. With assistance from the Organization of American States\n(OAS), the Inter-American Development Bank (IDB), and the United Nations\nEconomic Commission for Latin America (ECLA), in 1962 Paraguay established the\nTechnical Planning Secretariat (Secretaría Técnica de Planificación—STP), the\nmajor economic planning arm of the government. By 1965 the country had its\nfirst National Economic Plan, a two-year plan for 1965–66. This was followed\nby another two-year plan (1967–68) and then a series of five-year plans. Five-\nyear plans—only general policy statements—were not typically adhered to or\nachieved and played a minimal role in Paraguay's economic growth and\ndevelopment. Compared with most Latin American countries, Paraguay had a small\npublic sector. Free enterprise dominated the economy, export promotion was\nfavored over import substitution, agriculture continued to dominate industry,\nand the economy remained generally open to international trade and market\nmechanisms.\n\nIn an economic sense, the 1970s constituted Paraguay's miracle decade. Real\nGDP grew at over 8 percent a year and exceeded 10 percent from 1976 to 1981—a\nfaster growth rate than in any other economy in Latin America. Four coinciding\ndevelopments accounted for Paraguay's rapid growth in the 1970s. The first was\nthe completion of the road from Asunción to Puerto Presidente Stroessner and\nto Brazilian seaports on the Atlantic, ending traditional dependence on access\nthrough Argentina and opening the east to many for the first time. The second\nwas the signing of the Treaty of Itaipú with Brazil in 1973. Beyond the\nobvious economic benefits of such a massive project, Itaipú helped to create a\nnew mood of optimism in Paraguay about what a small, isolated country could\nattain. The third event was land colonization, which resulted from the\navailability of land, the existence of economic opportunity, the increased\nprice of crops, and the newly gained accessibility of the eastern border\nregion. Finally, the skyrocketing price of soybeans and cotton led farmers to\nquadruple the number of hectares planted with these two crops. As the 1970s\nprogressed, soybeans and cotton came to dominate the country's employment,\nproduction, and exports.\n\nThese developments shared responsibility for establishing thriving economic\nrelations between Paraguay and the world's sixth largest economy, Brazil.\nContraband trade became the dominant economic force on the border between the\ntwo countries, with Puerto Presidente Stroessner serving as the hub of such\nsmuggling activities. Observers contended that contraband was accepted by many\nParaguayan government officials, some of whom were reputed to have benefited\nhandsomely. Many urban dwellers' shelves were stocked with contraband luxury\nitems.\n\nThe Paraguayan government's emphasis on industrial activity increased\nnoticeably in the 1970s. One of the most important components of the new\nindustrial push was Law 550, also referred to as Law 550/75 or the Investment\nPromotion Law for Social and Economic Development. Law 550 opened Paraguay's\ndoors even further to foreign investors by providing income-tax breaks, duty-\nfree capital imports, and additional incentives for companies that invested in\npriority areas, especially the Chaco. Law 550 was successful. Investments by\ncompanies in the United States, Europe, and Japan comprised, according to some\nestimates, roughly a quarter of new investment. Industrial policies also\nencouraged the planning of more state-owned enterprises, including ones\ninvolved in producing ethanol, cement, and steel.\n\nMuch of Paraguay's rural population, however, missed out on the economic\ndevelopment. Back roads remained inadequate, preventing peasants from bringing\nproduce to markets. Social services, such as schools and clinics, were\nseverely lacking. Few people in the countryside had access to potable water,\nelectricity, bank credit, or public transportation. As in other economies that\nunderwent rapid growth, income distribution was believed to have worsened in\nParaguay during the 1970s in both relative and absolute terms. By far the\ngreatest problem that the rural population faced, however, was competition for\nland. Multinational agribusinesses, Brazilian settlers, and waves of\nParaguayan colonists rapidly increased the competition for land in the eastern\nborder region. Those peasants who lacked proper titles to the lands they\noccupied were pushed to more marginal areas; as a result, an increasing number\nof rural clashes occurred, including some with the government."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "In 2018, Paraguay was the 6th largest producer of soy in the world, with 11\nmillion tons produced (behind the US, Brazil, Argentina, China and India). In\nthe same year, the country produced 5.3 million tons of maize, and 6.1 million\ntons of sugarcane, ranking 21st in the world in both; this year, the country\nalso produced 3.3 million tons of cassava, 892 thousand tons of rice, 722\nthousand tons of wheat, 223 thousand tons of orange, 116 thousand tons of\nyerba mate, 107 thousand tons of sorghum, in addition to smaller productions\nof other agricultural products.",
    "openai_summarised_points": [
      "• In 2018, Paraguay ranked as the 6th largest producer of soy globally, producing 11 million tons, following the United States, Brazil, Argentina, China, and India.",
      "• The country produced 5.3 million tons of maize in 2018, placing it 21st worldwide in maize production.",
      "• Paraguay also produced 6.1 million tons of sugarcane in 2018, ranking 21st in the world for sugarcane production.",
      "• In the same year, Paraguay produced 3.3 million tons of cassava, contributing significantly to its agricultural output.",
      "• Rice production in Paraguay reached 892 thousand tons in 2018.",
      "• Wheat production was recorded at 722 thousand tons in 2018.",
      "• Paraguay produced 223 thousand tons of oranges in 2018.",
      "• Yerba mate production amounted to 116 thousand tons in 2018, reflecting its importance as a traditional crop.",
      "• Sorghum production totaled 107 thousand tons in 2018.",
      "• In addition to these major crops, Paraguay produced smaller quantities of various other agricultural products in 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:51.451043",
      "openai_model": "gpt-4.1-mini",
      "content_length": 566,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Industry",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( November 2024)__(Learn how and when to remove this message)_\n---|---\n\nIndustry, especially the manufacturing sector, historically was linked to\nagricultural processing until the 1970s, when the construction of\nhydroelectric plants and new industrial incentives began to broaden the\nindustrial base. Industry was composed principally of manufacturing and\nconstruction. Paraguay had no real mining sector, but the manufacture of\nconstruction materials included limited mining activity. Manufacturing and\nconstruction in the economy in the late 1980s remained dependent on\ndevelopments in other sectors, such as agriculture and energy, for their\ngrowth. Although industry was becoming more visible in Paraguay in the 1980s,\nindustry's share of GDP actually declined in the 1970s and 1980s because of\nmore rapid growth in agriculture.",
    "openai_summarised_points": [
      "• Historically, Paraguay's industry, particularly the manufacturing sector, was closely linked to agricultural processing until the 1970s.",
      "• The construction of hydroelectric plants and the introduction of new industrial incentives in the 1970s began to diversify and broaden Paraguay's industrial base.",
      "• Paraguay's industry primarily consisted of manufacturing and construction activities during this period.",
      "• The country lacked a significant mining sector; however, the manufacture of construction materials involved limited mining operations.",
      "• In the late 1980s, manufacturing and construction sectors remained dependent on developments in other sectors, notably agriculture and energy, for their growth and expansion.",
      "• Despite the increasing visibility of industry in Paraguay during the 1980s, the industrial sector’s share of the Gross Domestic Product (GDP) declined throughout the 1970s and 1980s.",
      "• The decline in industry’s GDP share was due to the more rapid growth of the agricultural sector compared to industrial growth during these decades."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:50.322601",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1002,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Manufacturing",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( November 2024)__(Learn how and when to remove this message)_\n---|---\n\nManufacturing accounted for 16.3 percent of GDP in 1986 and employed roughly\n13 percent of the labor force, making Paraguay one of the least industrialized\nnations in Latin America. Manufactured exports, by most definitions, accounted\nfor less than 5 percent of total exports; when semiprocessed agricultural\nproducts were included, however, that figure reached 77 percent. The growth of\nthe country's manufacturing industries was hampered by numerous structural\nobstacles. These included a small internal market, limited physical\ninfrastructure, costly access to seaports, a historical lack of energy\nproduction, and the openness of Paraguay's economy to the more industrialized\neconomies of Brazil and Argentina. Another significant factor was the ubiquity\nand profitability of smuggling operations, which encouraged importing and\nreexporting rather than production.\n\nParaguay's earliest manufacturing industries processed hides and leather from\nits abundant cattle and tannin from quebracho trees. Small-scale\nmanufacturing, especially textiles, flourished under the Francia dictatorship,\nwhen the nation's borders were closed. The War of the Triple Alliance,\nhowever, devastated what little industry and infrastructure the country had,\ncausing Paraguay to enter the twentieth century as an almost completely\nagricultural society. Land sales to foreigners stimulated increased\nagricultural processing in the early twentieth century, including meat packing\nand the processing of flour, oilseeds, sugar, beer, and pectin extract. After\nthe early 1900s, small-scale manufacturing in all subsectors grew at a slow,\nbut steady pace, with some of the fastest growth occurring because of the\nshortages during World War II.\n\nThe government's role in promoting industry increased in the postwar era, and\nin 1955 the Stroessner government undertook the country's first industrial\ncensus. Over the next twenty years, the government enacted a number of\nindustrial incentive measures, the most important of which was Law 550. Law\n550 promoted exportoriented industries or those that would save foreign\nexchange. It also provided liberal fiscal incentives for companies to develop\nspecific areas of the country, especially the departments of Alto Paraguay,\nNueva Asunción, Chaco, and Boquerón. Incentives for business were related\nmostly to import-duty exemptions, but they included a variety of tax breaks\nand placed no restrictions on foreign ownership. Approximately one-fourth of\nall new manufacturing investment from 1975 to 1985 was registered under Law\n550. Most foreign investments originated from Brazil, West Germany, the United\nStates, Portugal, and Argentina in that order of importance. The dynamic\nprocesses of agricultural colonization and hydroelectric development, combined\nwith such attractive industrial incentives, caused manufacturing to grow at an\nunprecedented rate in the late 1970s and early 1980s.\n\nUnlike many other Latin American governments, which followed an import-\nsubstitution industrial policy, the Paraguayan government had played a\nminimalist role in the economy through most of the postwar era, curtailing\nimport tariffs and maintaining a realistic exchange rate. In the 1980s,\nhowever, Paraguay's exchange rate became overvalued and several state-owned\nheavy industry plants became operational.\n\nIn the late 1980s, the major subsectors of manufacturing were food, beverages,\nand tobacco; textiles, clothing, leather, and shoes; wood and related\nproducts; and chemicals, petroleum, and plastics. Despite some increases in\nheavy industry in the economy during the 1970s and 1980s, Paraguayan industry\nwas generally small-scale. Manufacturing production remained focused on\nconsumer goods, and capital goods comprised under 5 percent of industrial\noutput. In fact, in the 1980s Paraguay did not contain even one of Latin\nAmerica's 1,000 largest companies, at least some of which were found in most\nother countries in the region. Virtually every subsector of Paraguay's\nmanufacturing was characterized by numerous small- to medium-sized firms and a\nfew large firms, which often were foreign owned. Most companies operated well\nbelow their capacity.\n\nThe food, beverages, and tobacco subsector has been the core manufacturing\nactivity throughout Paraguay's history. In the late 1980s, this subsector\ncontinued to dominate, accounting for about 45 percent of industrial activity,\ndepending on agricultural output in a given year. Agro-processing involved a\nlarge number of small, inefficient, and often family-run firms as well as a\nsmall number of large, efficient, and usually foreign-owned firms. The larger\nfirms produced only the most lucrative items, such as oilseeds, meats, and\nvarious beverages, often for export. Some of the most common small-scale\nproducers manufactured milled items, baked goods, sugar and molasses, dairy\nproducts, candy, manioc flour, vinegar, coffee, and tobacco. Along with raw\nagricultural produce, processed and semiprocessed food generated nearly all of\nthe country's exports in the late 1980s. But, as with other manufacturing\nsubsectors, the profitability of the food subsector often was impaired by\ncontraband items from Brazil and Argentina, such as flour, meat, or dairy\nproducts. Paraguayan goods crossed borders unofficially, as well, thus\nlowering official exports.\n\nThe second most important manufacturing activity also relied on agricultural\ninputs for its base. Utilizing Paraguay's rich endowment of hardwood trees,\nthe wood subsector represented about 15 percent of all industrial activity and\ncontributed over 8 percent of exports in the 1980s. The most voluminous wood\nexport was lumber, which was produced by hundreds of small sawmills throughout\nthe central and eastern border regions. In addition to saw wood, mills also\nproduced a variety of milled wood, plywood, chipboard, and parquet flooring.\nAlthough the country cut and processed only a fraction of its hundreds of\nspecies, Paraguayan wood was known for its quality. The country also contained\nseveral small paper companies and one large paper and cardboard factory\nlocated at Villeta.\n\nTextiles, clothing, leather, and shoes comprised the third largest\nmanufacturing subsector. These industries were traditional, grounded in the\nnation's abundance of inputs like cotton fibers, cattle hides, and tannin\nextract. The subsector accounted for about 10 percent of all manufacturing.\nThe textile industry performed spinning, weaving, and dyeing operations and\nproduced finished fabrics that amounted to over 100 million tons in 1986. Most\nfabrics were derived from cotton fibers, but a growing number of synthetic and\nwool fibers also were produced. Textile production provided inputs to\napproximately sixty clothing firms that operated under capacity and were\ngenerally inefficient. As with so many other manufacturers, clothing companies\nmet stiff competition from widespread unregistered imports, which often\noriginated in Asia and typically entered across the Brazilian border. The\nleather industry was characterized by 200 or so small tanneries dotting the\nParaguayan countryside. In addition, many medium and two large tanneries\nfashioned leather goods. The leather industry operated at only about 40\npercent of capacity, however. The shoe industry comprised a few hundred small\nworkshops and a dozen or so mediumsized firms, which produced some 5 million\npairs of leather and synthetic shoes a year.\n\nThe processing of petroleum, chemicals, and plastics repeated an increasing\nactivity. In the late 1980s, this subsector represented less than 5 percent of\nindustrial activity, but its share of manufacturing output was expanding\nbecause of the growth of heavy industry in Paraguay, especially industry\nrelated to the energy sector. The country also produced fertilizers,\nindustrial gases, tanning chemicals, varnishes, and detergents. In 1987 a\ngroup of Japanese investors was considering the construction of a new\nfertilizer plant with a 70,000-ton capacity per year. Since the early 1980s,\nethanol was being produced in large quantities, and the government was\nconsidering producing methanol. Also processed were paints, soaps, candles,\nperfumes, and pharmaceuticals. One of Paraguay's fastest growing industries\nwas the new, relatively modern plastics subsector, which supplied a wide\nvariety of goods to the local market."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Structure of the economy",
    "text": "Soybeans and silos on a farm in rural Paraguay\n\nThe most important component of the Paraguayan economy is the farming sector,\nwhich contributed 27% to GDP in 2006. The participation of commerce was 20.2%,\nand that of other services, including government, 38.4%. Industry's part\n(including mining and construction) was about 20%.\n\nAfter years of economic crisis, between 1999 and 2002, the Paraguayan economy\ngrew at between 2.9 and 4.1% per year from 2003 to 2006. For 2007, the\nestimated growth is about 6.4%. Inflation in 2007 reached 6.0%.\n\nMost enterprises are small, micro and individual ones, including subsistence\njobs like street vendors. Only 4% of the Paraguayan labor force works in\ncompanies with more than 50 employees.\n\nIn June 2007 external foreign exchange reserves amounted to US$2153 million,\nand the foreign official debt US$2154 million, close to parity. The fiscal\nsurplus is provisionally reported as 0.5% of GDP in 2006 and 2007. Paraguay's\neconomy (GDP) grew 5.8% in 2008, fastest growing sector being agriculture with\n10.5% growth.\n\nCattle on cleared land in the Chaco Commerce in Ciudad del Este, on the border\nwith Brazil\n\nAgriculture accounts for about 20 percent of Paraguay's annual gross domestic\nproduct (25 percent in 2004) and virtually all of the country's export\nearnings. It is Paraguay's largest and most consistent source of employment,\nemploying about 45 percent of the working population. In addition to those\nengaged in the formal agricultural sector, thousands of Paraguayan families\nsurvive through subsistence farming.\n\nParaguay produces enough basic food to be largely self-sufficient. Corn,\ncassava, and wheat are the main food crops for local consumption. The global\nsurge in grain prices 2007/2008 was a major impulse for the agricultural\nsector. Wheat cultivation expanded, so did rice. Most significant was the\nincrease of soy production. In 2004 Paraguay had about 1.6 million hectares\ndedicated to genetically modified (GM) crops. Export value of soy and its\nderivates increased from US$1,25 billion in 2007 to US$2,54billion in 2008\n\nParaguay's eastern plains as well as the Chaco support the country's dairy and\nranching industry. Behind soybeans, beef exports make up a significant part of\nParaguay's agriculture sector. Additionally, Paraguay produces an adequate\nsupply of beef, pork, and dairy products to meet domestic needs. The discovery\nof cases of foot-and-mouth disease in 2002 and 2003 led to a ban on Paraguayan\nbeef in many countries. However, in 2004 Paraguay's meat production and\nexports rebounded. As a result of rising international prices and the recovery\nof important markets like Chile or Russia, Paraguay's meat exports rose to\nUS$143 million in 2004. They reached US$353 million in 2007 and US$597 million\nin 2008. Presently, Paraguay has a national herd numbering between 9 and 10\nmillion head of cattle.\n\nParaguay's forests adequately meet domestic needs for lumber and fuelwood.\nHowever, logging for export, both legally and illegally, has thinned\nParaguay's once abundant forests, resulting in a ban on the export of logs\nsince the 1970s. More than 90% of the native rainforest of Paraguay's eastern\nhalf have been lost between 1975 and 2008. In the western half, the Chaco,\nvirgin forest is lost to cattle ranching at an annual rate of more than\n200.000 hectare (2008). Sustainable wood cultivation is now on the increase.\n\nThe fishing industry in Paraguay exists almost solely to meet domestic demand."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Mining and minerals",
    "text": "Unlike many South American countries, Paraguay has few mineral resources and\nvery little history of mining success. Foreign companies have explored\nParaguay in recent years, searching for overlooked mineral deposits. Small\nextraction projects exist, seeking lime, clay, and the raw materials necessary\nto make cement, but the country's iron and steel manufacturers must import raw\nmaterials from neighboring countries.\n\nIn 2010 CIC Resources Inc., the same company that discovered the copper\ndeposits in Chile, claims to have discovered 21 billion metric tons of\ntitanium, which could be the biggest titanium deposit in the world, in Alto\nParana near frontier with Brazil.",
    "openai_summarised_points": [
      "• Paraguay, unlike many South American countries, possesses few mineral resources and has a very limited history of successful mining activities.",
      "• In recent years, foreign companies have conducted exploration efforts in Paraguay, aiming to identify previously overlooked mineral deposits.",
      "• Existing mining operations in Paraguay are small-scale and focus primarily on extracting lime, clay, and raw materials essential for cement production.",
      "• Paraguay’s iron and steel manufacturing industries rely on importing raw materials from neighboring countries due to insufficient domestic mineral resources.",
      "• In 2010, CIC Resources Inc., the company credited with discovering copper deposits in Chile, announced the discovery of 21 billion metric tons of titanium in Alto Paraná, near the border with Brazil.",
      "• This titanium deposit discovered by CIC Resources Inc. in Alto Paraná is potentially the largest titanium deposit in the world."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:54.111147",
      "openai_model": "gpt-4.1-mini",
      "content_length": 672,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Industry and manufacturing",
    "text": "The industrial sector produces about 25 percent of Paraguay's gross domestic\nproduct (GDP) and employs about 31 percent of the labor force. Output grew by\n2.9 percent in 2004, after five years of declining production. Traditionally\nan agricultural economy, Paraguay is showing some signs of long-term\nindustrial growth. The pharmaceutical industry is quickly supplanting foreign\nsuppliers in meeting the country's drug needs. Paraguayan companies now meet\n70 percent of domestic consumption and also have begun exporting drugs. Strong\ngrowth also is evident in the production of edible oils, garments, organic\nsugar, meat processing, and steel. Nevertheless, capital for further\ninvestment in the industrial sector of the economy is scarce. Following the\nrevelation of widespread financial corruption in the 1990s, the government is\nstill working to improve credit options for Paraguayan businesses.\n\nIn 2003 manufacturing made up 13.6 percent of the GDP, and the sector employed\nabout 11 percent of the working population in 2000. Paraguay's primary\nmanufacturing focus is on food and beverages. Wood products, paper products,\nhides and furs, and non-metallic mineral products also contribute to\nmanufacturing totals. Steady growth in the manufacturing GDP during the 1990s\n(1.2 percent annually) laid the foundation for 2002 and 2003, when the annual\ngrowth rate rose to 2.5 percent.",
    "openai_summarised_points": [
      "• The industrial sector in Paraguay accounts for approximately 25 percent of the country's gross domestic product (GDP) and employs about 31 percent of the labor force.",
      "• In 2004, industrial output in Paraguay grew by 2.9 percent, marking a recovery after five consecutive years of declining production.",
      "• Historically an agricultural economy, Paraguay is demonstrating signs of sustained long-term industrial growth.",
      "• The pharmaceutical industry in Paraguay is rapidly replacing foreign suppliers by meeting 70 percent of the domestic drug consumption and has also begun exporting pharmaceutical products.",
      "• Other sectors showing strong industrial growth include the production of edible oils, garments, organic sugar, meat processing, and steel manufacturing.",
      "• Despite growth, capital investment for further industrial expansion remains limited due to financial constraints.",
      "• The Paraguayan government is actively working to improve credit options for businesses following the exposure of widespread financial corruption during the 1990s.",
      "• In 2003, manufacturing contributed 13.6 percent to Paraguay’s GDP and employed about 11 percent of the workforce as of 2000.",
      "• Paraguay’s manufacturing sector primarily focuses on food and beverage production.",
      "• Additional manufacturing outputs include wood products, paper products, hides and furs, and non-metallic mineral products.",
      "• During the 1990s, the manufacturing sector experienced steady GDP growth at an average annual rate of 1.2 percent.",
      "• This steady growth laid the foundation for increased manufacturing growth rates of 2.5 percent annually in 2002 and 2003."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:58.002340",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1385,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6.3",
    "section_name": "Energy",
    "text": "The Itaipú Dam; a hydroelectric dam on the Paraná River\n\nParaguay relies almost solely on hydroelectric power to meet its energy needs.\nThe Itaipú Dam, completed in 1984, has the world's second largest power-\ngenerating capacity: 13.3 gigawatts. The dam is located on the Paraguay River,\nand Paraguay and Brazil evenly share the ownership, operation, and electricity\ngenerated. Additionally, Paraguay co-owns another major hydropower plant,\nYacyretá, with Argentina. Paraguay uses only a small portion of the energy it\ngenerates through Itaipú and Yacyretá. In 2002 Paraguay generated more than 48\nbillion kilowatt-hours of energy. It consumed only 2.5 billion kilowatt-hours\nwhile exporting 45.9 billion kilowatt-hours. Paraguay will have even more\nhydroelectricity to export when planned new turbines are installed at Itaipú\nand the Yacyretá dam is fully completed. In 2007 electricity production rose\nto 70 TWh, and exports reached 64 TWh which put Paraguay in second place\nworldwide as an exporter of electrical power (And in the first place as a net\nexporter since France, the Number one exporter in the World with 67 TWh, also\nimports 10 TWh, while Paraguay does not import any).\n\nParaguay has no oil reserves; it relies on imported oil to meet its limited\nneed for oil-produced energy. The Paraguayan government owns Petróleos\nParaguayos, which is responsible for all distribution of oil products. The\nstate accepts bids from international oil companies, selecting a few companies\nannually to meet the country's demand. Presently, Paraguay does not produce or\nconsume natural gas, but consumes LPG imported mainly from Argentina."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6.4",
    "section_name": "Services",
    "text": "The services sector made up nearly 50 percent of Paraguay's gross domestic\nproduct in 2004 and employed about 19 percent of Paraguay's working\npopulation. The importation of goods, especially from Argentina and Brazil,\nfor sale and illegal reexportation creates service industry jobs. The services\nsector had a moderate growth rate of 0.9 percent from 1990 to 2003. The sector\ndecreased by 7.8 percent in 2002, before rebounding in 2003 with a 1.6 percent\ngrowth rate. Instability in the economy and a large black market have hampered\ndevelopment of the formal services sector in Paraguay."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "6.5",
    "section_name": "Tourism",
    "text": "Tourism\n\nParaguay has a small tourism industry. Total tourism receipts declined\nannually from 2000 through 2002. In 2003 Paraguay's hotel occupancy rate was\n38 percent. It increased by 15 percent in 2004. Small gains in tourism have\ncome from business rather than leisure travellers. For many years, Paraguay\nserved as a central market for trafficable, duty-free goods. However,\ncrackdowns by the governments of Brazil and Argentina have stemmed the flow of\nshoppers travelling to Paraguay looking for trafficable items."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Banking and finance",
    "text": "Paraguay's banking and financial services industry is still recovering from\nthe liquidity crisis of 1995, when news of widespread corruption resulted in\nthe closure of several significant banks. Reform efforts spurred by the\nInternational Monetary Fund (IMF) and World Bank helped restore some\ncredibility to Paraguay's banking industry. Still, a paucity of credit options\nhinders the overall economy. Paraguay has a long history as a money-laundering\ncenter. The government has taken steps to curb the problem, but enforcement of\nanti-laundering legislation remains inconsistent.\n\nForeign companies either partially or wholly own most banks and financial\ninstitutions in Paraguay. Paraguayan banks hold less than 10 percent of\ndeposits. Of the 16 banks operating in Paraguay in 2003, 50 percent were\nwholly foreign-owned and 25 percent were partially owned by foreign companies.\nParaguay's Central Bank exists to stabilize the financial sector, making sure\nthat another run on banks, such as the one that occurred in 1995, does not\nrecur. The Superintendencia de Bancos regulates the banking system, monitoring\nthe percentage of non-performing loans in the banking system. Bank deposits\nrose significantly in 2004, along with the percentage of local currency in\ntotal deposits. Local currency deposits increased by 26 percent in 2004, a\nsign that Paraguayans are gaining confidence in the stability of Paraguayan\ncurrency. In another promising development, interest rates dropped\ndramatically in 2004, from 50 percent in 2003 to 27 percent in 2004.\n\nParaguay's stock market, the Bolsa de Valores y Productos de Asunción, began\ntrading in October 1993. The tradition of family-owned companies and economic\ninstability kept investment low throughout the 1990s. The value of shares on\nthe Asunción stock exchange rose by 390 percent in 2004, reaching US$17.5\nmillion."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Labor",
    "text": "Paraguay's formal labour force was estimated to total about 2.7 million\nworkers in 2004. About 45 percent worked in the agricultural sector, 31\npercent in the industrial sector, and 19 percent in the services sector.\nUnemployment was estimated at 15 percent. Paraguay's constitution guarantees\nthe right of workers to unionize and bargain collectively. About 15 percent of\nworkers are members of one of Paraguay's 1,600 unions. Strikes are legal and\nnot uncommon.\n\nThe 2001 census found that 5 percent of Paraguay's workforce was under the age\nof 14. Although Paraguay ratified the International Labour Organization's\nMinimum Age Convention in 2004, child labour continues to be prevalent. Nearly\n14 percent of children between the ages of 5 and 17 are employed, many in poor\nconditions and for negligible pay. The government has mandated a minimum wage\nof approximately US$158 per month for private-sector employees. Government\nemployees have no minimum wage. The standard workweek is 48 hours. In 2004\nParaguay's unemployment rate stood at 15 percent."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Currency, exchange rate, and inflation",
    "text": "Paraguay's currency is the guarani (PYG). In mid-October 2005, US$1 equaled\nabout PYG6155.\n\nPrice inflation fell dramatically between 2003 and 2004, from 14.2 percent to\na 30-year low of 4.3 percent. President's Duarte's economic reforms and\nausterity programs have produced results more rapidly than many expected. As\nof 2005, experts forecast that the inflation rate in Paraguay likely would\nrise in coming years but has remained below 10 percent."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Foreign economic relations",
    "text": "Paraguay's main export goods 2007-2008 Source: Paraguay Ministry of Industry\nand Commerce / REDIEX\n\nParaguay is a member of the Common Market of the South (Mercado Común del Sur\nor Mercosur). Most of Paraguay's trade takes place with Uruguay, Brazil and\nArgentina. In 2002 Paraguay conducted more than US$400 million in trade with\nArgentina and nearly US$800 million with Brazil. Paraguay is also a member of\nthe Inter-American Development Bank, Latin American Integration Association,\nand Latin American Economic System and a signatory to the agreement creating\nthe South American Community of Nations. In 2004 Paraguay signed an energy\ncooperation agreement with Venezuela to purchase oil and petroleum. Venezuela\nagreed to concessional financing that allowed Paraguay to pay over a 15-year\nperiod at a nominal interest rate.\n\nImports totaled US$3.3 billion in 2004. Principal import commodities included\nautomobiles, chemical products, consumer goods, tobacco, petroleum, and\nmachinery. Brazil was the leading source of imports to Paraguay (24.3\npercent), followed by the United States (22.3 percent), Argentina (16.2\npercent), China (9.9 percent), and Hong Kong (5 percent). Experts note that\nimport statistics are difficult to confirm for Paraguay because as much as\nhalf of all imports are illegally re-exported to Argentina or Brazil. Imports\nfrom Mercosur countries continue to rise, up to 57 percent in 2003.\n\nParaguay's export revenues totaled about US$2.9 billion in 2004. Agricultural\ncommodities continue to drive Paraguay's export totals. Soybeans are\nparticularly vital, accounting for 35 percent of total export revenues in\n2003. Other agricultural cash crops include cotton, sugarcane, cassava,\nsunflowers, wheat, and corn. Other significant exports include feed, meat,\nedible oils, electricity, wood, and leather. Even as Paraguayan export revenue\nhas fluctuated, Brazil remained Paraguay's principal export destination (27.8\npercent in 2004), followed by Uruguay (15.9 percent), Italy (7.1 percent),\nSwitzerland (5.6 percent), Argentina (4.3 percent), and the Netherlands (4.2\npercent). In 2003 nearly 60 percent of Paraguayan exports went to Mercosur\ncountries.\n\nParaguay had a negative trade balance of about US$400 million in 2004. Higher\nearnings from soybeans and cotton could not offset the surge in imported\nconsumer goods and petroleum products.\n\nAfter years of negative balances, Paraguay achieved a positive balance of\npayments totaling US$234 million in 2003. In 2004, however, the current\naccount had an estimated deficit of US$35.1 million.\n\nParaguay has a sustainable debt level according to the International Monetary\nFund (IMF). External debt totaled about US$3.4 billion in 2004, low compared\nto most Latin American countries. Continued reductions in Paraguay's debt to\ngross domestic product ratio are expected in coming years. Paraguay paid\nUS$412 million in debt service to the IMF in 2004.\n\nForeign investment in Paraguay nearly disappeared in 2002. After direct\nforeign investment of US$84 million in 2001, only US$9 million in investment\ncame from abroad in 2002. This drop was largely the result of the financial\ncrisis in Argentina and the banking collapse in Paraguay. Direct foreign\ninvestment rebounded in 2003, reaching US$90.8 million for the year.\n\nParaguay has depended on the International Monetary Fund (IMF) and World Bank\nfor economic development assistance. The World Bank has promised Paraguay\nassistance totaling US$325 million between 2003 and 2007. Projects currently\nunderway in Paraguay aim to improve education, transportation, and rural\ndevelopment."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Transport",
    "text": "The Paraguayan road network includes almost 4,500 kilometers of paved roads\nand nearly 60,000 kilometers of secondary roads.[_citation needed_] The\ndensity of the road network is higher in the oriental region, and lower in the\nChaco area. However, in 2007 a paved connection to the Bolivian border was\ncompleted across the Chaco region.\n\nThe Paraguay-Paraná waterway constitutes an essential route for the transport\nof exported and imported goods.\n\nThe railway which connects Asunción to Encarnación actually does not operate,\nbut there is still a connection between Encarnación and Posadas (Argentina)\nfor the transport of agricultural goods.\n\nParaguay has two international airports, Silvio Pettirossi International\nAirport, in Asunción, and Guarani International Airport, in Ciudad del Este,\nand several secondary airports in other parts of the country."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Media and communications",
    "text": "There are five national newspapers and a larger number of local publications.\nThere are five Paraguayan TV stations. Additionally, essential international\nstations can be received by cable in the main urban areas.\n\nThe fixed line network is controlled by the state-owned COPACO Company. The\ncell phone network is open to private operators. There are four competing\nmobile phone operators in Paraguay. During the last few years mobile phone\ncoverage of the population has been far more extensive than fixed line\ncoverage."
  },
  {
    "chapter_name": "Economy of Paraguay",
    "chapter_id": "1",
    "section_number": "13",
    "section_name": "Statistics",
    "text": "The following table shows the main economic indicators in 1980–2019 (with FMI\nestimates for 2020-2026).\n\nYear | GDP\n(in Bil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980 | 11.1 | 3,536.7 | 4.1 | 1,299.7 | 11.7% | 22.5% | n/a | n/a\n1981 | 13.3 | 4,103.4 | 5.2 | 1,608.5 | 9.2% | 13.8% | n/a | n/a\n1982 | 13.9 | 4,171.1 | 5.5 | 1,636.5 | -1.4% | 5.4% | n/a | n/a\n1983 | 14.0 | 4,080.4 | 6.1 | 1,763.0 | -3.0% | 12.8% | 8.3% | n/a\n1984 | 15.0 | 4,220.3 | 4.9 | 1,390.9 | 2.8% | 20.9% | 7.3% | n/a\n1985 | 16.0 | 4,390.9 | 4.2 | 1,154.1 | 3.9% | 24.8% | 5.1% | n/a\n1986 | 16.4 | 4,352.9 | 5.0 | 1,335.8 | 0.3% | 31.7% | 6.1% | n/a\n1987 | 17.5 | 4,499.5 | 4.2 | 1,084.7 | 4.1% | 21.7% | 5.5% | n/a\n1988 | 19.2 | 4,780.5 | 5.6 | 1,392.4 | 5.9% | 22.6% | 4.7% | n/a\n1989 | 21.1 | 5,095.2 | 4.0 | 977.8 | 5.8% | 25.6% | 6.1% | n/a\n1990 | 22.8 | 5,503.7 | 4.9 | 1,185.3 | 4.1% | 38.2% | 6.6% | 67.0%\n1991 | 24.4 | 5,529.7 | 7.0 | 1,585.2 | 3.5% | 24.3% | 5.1% | 49.4%\n1992 | 25.3 | 5,636.6 | 7.2 | 1,592.1 | 1.7% | 15.1% | 5.3% | 34.4%\n1993 | 27.2 | 5,933.9 | 7.2 | 1,580.2 | 4.9% | 18.3% | 5.1% | 26.6%\n1994 | 29.3 | 6,255.3 | 7.9 | 1,681.4 | 5.3% | 20.6% | 4.4% | 18.7%\n1995 | 31.9 | 6,685.7 | 9.1 | 1,897.1 | 6.8% | 13.4% | 3.3% | 17.6%\n1996 | 33.0 | 6,777.0 | 9.8 | 2,008.2 | 1.6% | 9.8% | 8.2% | 16.8%\n1997 | 35.0 | 7,042.6 | 10.0 | 2,003.6 | 4.2% | 7.0% | 5.0% | 18.0%\n1998 | 35.4 | 6,984.2 | 9.3 | 1,824.6 | 0.1% | 11.6% | 5.8% | 22.1%\n1999 | 35.5 | 6,848.5 | 8.8 | 1,706.4 | -1.4% | 6.8% | 6.8% | 32.0%\n2000 | 35.4 | 6,702.7 | 8.9 | 1,675.8 | -2.3% | 9.0% | 7.3% | 33.6%\n2001 | 35.9 | 6,665.8 | 8.5 | 1,577.7 | -0.8% | 7.3% | 7.6% | 40.3%\n2002 | 36.5 | 6,646.9 | 7.2 | 1,312.1 | 0.0% | 10.5% | 10.8% | 54.5%\n2003 | 38.7 | 6,937.8 | 7.7 | 1,377.5 | 4.3% | 14.2% | 8.1% | 40.3%\n2004 | 41.4 | 7,285.2 | 9.6 | 1,693.9 | 4.1% | 4.3% | 7.3% | 30.3%\n2005 | 43.6 | 7,542.5 | 10.7 | 1,857.8 | 2.1% | 6.8% | 5.8% | 24.1%\n2006 | 47.1 | 8,009.1 | 13.4 | 2,285.1 | 4.8% | 9.6% | 6.7% | 18.2%\n2007 | 51.0 | 8,528.9 | 17.9 | 2,988.7 | 5.4% | 8.1% | 5.6% | 14.9%\n2008 | 55.3 | 9,099.8 | 24.6 | 4,047.7 | 6.4% | 10.2% | 5.7% | 14.5%\n2009 | 55.5 | 9,001.7 | 22.3 | 3,621.7 | -0.3% | 2.6% | 6.4% | 13.7%\n2010 | 62.4 | 9,964.5 | 27.1 | 4,326.2 | 11.1% | 4.7% | 5.7% | 12.1%\n2011 | 66.4 | 10,442.6 | 33.7 | 5,295.4 | 4.2% | 8.3% | 5.6% | 10.3%\n2012 | 64.4 | 9,960.8 | 33.3 | 5,155.2 | -0.5% | 3.7% | 4.6% | 12.3%\n2013 | 72.2 | 11,004.3 | 38.7 | 5,905.7 | 8.4% | 2.7% | 5.0% | 13.5%\n2014 | 75.4 | 11,326.6 | 40.3 | 6,050.1 | 4.9% | 5.0% | 6.0% | 15.6%\n2015 | 76.7 | 11,357.7 | 36.2 | 5,353.1 | 3.1% | 3.1% | 5.4% | 18.6%\n2016 | 81.5 | 11,895.4 | 36.1 | 5,259.9 | 4.3% | 4.1% | 6.0% | 19.4%\n2017 | 86.5 | 12,437.5 | 39.0 | 5,609.8 | 5.0% | 3.6% | 6.1% | 19.8%\n2018 | 91.5 | 12,978.2 | 40.4 | 5,725.9 | 3.4% | 4.0% | 6.2% | 22.2%\n2019 | 93.1 | 13,021.8 | 38.1 | 5,333.0 | 0.0% | 2.8% | 6.1% | 25.6%\n2020 | 93.4 | 12,881.0 | 35.9 | 4,946.5 | -0.9% | 1.8% | 6.6% | 34.8%\n2021 | 98.9 | 13,454.2 | 37.8 | 5,145.6 | 4.0% | 2.7% | 6.1% | 35.7%\n2022 | 105.2 | 14,115.9 | 40.2 | 5,391.0 | 4.0% | 3.2% | 5.9% | 36.5%\n2023 | 111.9 | 14,811.6 | 43.0 | 5,685.5 | 4.0% | 3.2% | 5.9% | 36.4%\n2024 | 118.2 | 15,441.5 | 45.4 | 5,935.3 | 3.5% | 3.2% | 5.9% | 36.2%\n2025 | 124.8 | 16,078.0 | 47.9 | 6,178.1 | 3.5% | 3.2% | 5.9% | 35.8%\n2026 | 131.6 | 16,726.1 | 50.6 | 6,430.6 | 3.5% | 3.2% | 5.9% | 35.2%\n\n**GDP - composition by sector:**\n\n* _Agriculture:_ 11.4%\n* _Industry:_ 33.5%\n* _Services:_ 47.5%\n* _Taxes:_ 7.6% (2022)\n\n**Labor force:** 3.428 million (2017 est.)\n\n**Labor force - by occupation:**\n\n* _agriculture:_ 26.5%\n* _industry:_ 18.5%\n* _services:_ 55% (2008 est.)\n\n**Unemployment rate:** 6.5% (2017 est.)\n\n**Population below poverty line:** 22.2% (2015 est.)\n\n**Household income or consumption by percentage share:**\n\n* _lowest 10%:_ 1.5%\n* _highest 10%:_ 37.6% (2015)\n\n**Distribution of family income - Gini index:** 51.7 (2015)\n\n**Inflation rate (consumer prices):** 3.6% (2017 est.)\n\n**Investment (gross fixed):** 21.2% of GDP (2005 est.)\n\n**Budget:**\n\n* _revenues:_ $5.366 billion\n* _expenditures:_ $5.876 billion, including capital expenditures of $700 million (2017 est.)\n\n**Public debt:** 25.6% of GDP (2017 est.)\n\n**Agriculture - products:** cotton, sugarcane, soybeans, corn, wheat, tobacco,\ncassava (tapioca), fruits, vegetables; beef, pork, eggs, milk; timber\n\n**Industries:** sugar, cement, textiles, beverages, wood products, steel,\nmetallurgic, electric power\n\n**Industrial production growth rate:** 6% (2017 est.)\n\n**Electricity:**\n\n* _production:_ 51.29 billion kWh (2003)\n* _consumption:_ 3.528 billion kWh (2003)\n* _exports:_ 44.17 billion kWh (2003)\n* _imports:_ 0 kWh (2003)\n\n**Electricity - production by source:**\n\n* _fossil_ fuel: 0%\n* _hydro:_ 99.9%\n* _nuclear:_ 0%\n* _other:_ 0.1% (2001)\n\n**Oil:**\n\n* _production:_ 0 bbl/d (0 m3/d) (2003 est.)\n* _consumption:_ 25,000 bbl/d (4,000 m3/d) (2003 est.)\n* _exports:_ NA (2001)\n* _imports:_ NA (2001)\n\n**Current account balance:** $543 million (2017 est.)\n\n**Exports:** $11.53 billion f.o.b. (2017 est.)\n\n**Exports - partners:** Brazil 31.9%, Argentina 15.9%, Chile 6.9%, Russia 5.9%\n(2017)\n\n**Imports:** $10.37 billion f.o.b. (2017 est.)\n\n**Imports - partners:** China 31.3%, Brazil 23.4%, Argentina 12.9%, US 7.4%\n(2017)\n\n**Reserves of foreign exchange and gold:** $7.504 billion (2017 est.)\n\n**Debt - external:** $17.35 billion (2017 est.)\n\n**Economic aid - recipient:** NA\n\n**Currency:** 1 guarani (G) = 100 centimos\n\n**Exchange rates:** guarani (G) per US$ - 5,628.1 (2017) 4,555.00 (2011),\n6,158.47 (2005), 5,974.6 (2004), 6,424.34 (2003), 5,716.26 (2002), 4,105.92\n(2001), 3,332.0 (January 2000), 3,119.1 (1999), 2,726.5 (1998), 2,177.9\n(1997), 2,056.8 (1996), 1,963.0 (1995); note - since early 1998, the exchange\nrate has operated as a managed float; prior to that, the exchange rate was\ndetermined freely in the market\n\n**Fiscal year:** calendar year"
  }
]