[
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Ethiopia** is a mixed and transition economy with a large\npublic sector. The government of Ethiopia is in the process of privatizing\nmany of the state-owned businesses and moving toward a market economy. The\nbanking, telecommunication and transportation sectors of the economy are\ndominated by government-owned companies.\n\nEthiopia has one of the fastest-growing economies in the world and is Africa's\nsecond most populous country. Many properties owned by the government during\nthe previous regime have now been privatized or are in the process of\nprivatization and the liberalization of its financial sector in the near\nfuture. However, certain sectors such as telecommunications, financial and\ninsurance services, air and land transportation services, and retail, are\nconsidered to be strategic sectors and are expected to remain under state\ncontrol for the foreseeable future.\n\nAlmost 50% of Ethiopia's population is under the age of 18. Even though\neducation enrollment at primary and tertiary level has increased\nsignificantly, job creation has not caught up with the increased number of\nsecondary and postsecondary educational graduates. The country must create\nhundreds of thousands of jobs every year just to keep up with population\ngrowth.\n\nIn 2023, Ethiopia reached an estimated GDP of 156.1 billion nominal dollars\nand an estimated PPP of 393.85 billion dollars. This mostly comes from a\nservices-based economy with agriculture. In the latest data from 2019\nEthiopia's top trading partners globally included China, the United States,\nUAE, France, the United Kingdom, South Korea, Saudi Arabia, Germany, Japan,\nSwitzerland, the Netherlands, Belgium, Turkey, India, and Egypt. In 2021,\nagriculture made up 37.5% of the country's economic output, while services\n36.25% and industry made up 21.85% of the economy. Ethiopia's economy is\nranked 159th place out of 190 countries in 'Ease of doing business'. Ethiopia\nis also a part of African Continental Free Trade Area, Common Market for\nEastern and Southern Africa, Intergovernmental Authority on Development, and\nthe G24, and has observer status at the World Trade Organization. Ethiopia\njoined the BRICS economic alliance in January 2024.\n\nWhile Ethiopia does not currently have a stock exchange, it did have one in\nthe past during the reign of Emperor Haile Selassie I, called an 'ākisīyoni\ngebeya.' It now has a commodity exchange in Addis Ababa called the Ethiopia\nCommodity Exchange, established in 2008.\n\nThe Ethiopian economy has a large foreign debt, with an overall external debt\nof 28 billion US dollars. China owns over 13 billion dollars of its debt. Its\ndebt to GDP ratio is smaller than similar and neighboring countries. Ethiopia\ncurrently has 2.4 billion dollars of foreign reserves, representing a decline\ncompared to previous years.\n\nEthiopia expects to reach a national middle-income status by 2025. Despite\nthis, based on the most recent data from 2019, 68.7% of the population\ncontinues to be affected by multidimensional poverty and an additional 18.4%\nvulnerable to it.",
    "openai_summarised_points": [
      "• The economy of Ethiopia is characterized as a mixed and transition economy with a significant public sector presence.",
      "• The Ethiopian government is actively engaged in privatizing many state-owned enterprises and shifting towards a market-oriented economy.",
      "• Key sectors such as banking, telecommunication, and transportation are predominantly controlled by government-owned companies.",
      "• Ethiopia boasts one of the fastest-growing economies globally and is the second most populous country in Africa.",
      "• Many properties previously owned by the government have been privatized or are undergoing privatization, alongside ongoing liberalization of the financial sector.",
      "• Certain strategic sectors—including telecommunications, financial and insurance services, air and land transportation, and retail—are expected to remain under state control for the foreseeable future.",
      "• Approximately 50% of Ethiopia’s population is under the age of 18, indicating a youthful demographic profile.",
      "• Despite significant increases in primary and tertiary education enrollment, job creation has not kept pace with the rising number of secondary and post-secondary graduates.",
      "• Ethiopia must generate hundreds of thousands of new jobs annually to match its population growth.",
      "• In 2023, Ethiopia’s nominal Gross Domestic Product (GDP) was estimated at 156.1 billion US dollars, with a Purchasing Power Parity (PPP) valuation of approximately 393.85 billion dollars.",
      "• The economy is predominantly service-oriented, with agriculture also playing a crucial role.",
      "• As of 2019, Ethiopia’s main trading partners included China, the United States, UAE, France, the United Kingdom, South Korea, Saudi Arabia, Germany, Japan, Switzerland, the Netherlands, Belgium, Turkey, India, and Egypt.",
      "• In 2021, agriculture contributed 37.5% to Ethiopia’s economic output, services accounted for 36.25%, and industry made up 21.85%.",
      "• Ethiopia ranks 159th out of 190 countries in the 'Ease of doing business' index.",
      "• The country is a member of several regional and international trade organizations, including the African Continental Free Trade Area, Common Market for Eastern and Southern Africa, Intergovernmental Authority on Development, and G24; it also holds observer status at the World Trade Organization.",
      "• Ethiopia joined the BRICS economic alliance in January 2024.",
      "• Historically, Ethiopia had a stock exchange during Emperor Haile Selassie I’s reign called an 'ākisīyoni gebeya,' but currently, it does not have an active stock exchange.",
      "• The country operates the Ethiopia Commodity Exchange, established in 2008, located in Addis Ababa.",
      "• Ethiopia has a substantial external debt totaling approximately 28 billion US dollars, with over 13 billion dollars owed to China.",
      "• The country's debt-to-GDP ratio is lower than that of similar and neighboring nations.",
      "• Ethiopia’s foreign exchange reserves stand at about 2.4 billion US dollars, reflecting a decline compared to previous years.",
      "• The government aims for Ethiopia to attain middle-income status by 2025.",
      "• Despite economic growth, as of 2019, 68.7% of the population was affected by multidimensional poverty, with an additional 18.4% vulnerable to it."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:14.262992",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3068,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Development of GDP per capita\n\nEthiopia's resources have enabled the country—unlike most sub-Saharan African\ncountries—to maintain contacts with the outside world for centuries. Since\nancient times, Ethiopian traders exchanged gold, ivory, musk, and wild animal\nskins for salt and luxury goods, such as silk and velvet. By the late\nnineteenth century, coffee had become one of Ethiopia's more important cash\ncrops. At that time, most trade flowed along two major trade routes, both of\nwhich terminated in the far southwest in the Kefa-Jima region. From there, one\nroute went north to Mitsiwa via Gonder and Adwa, the other along the Awash\nRiver valley to Harer and then on to Berbera or Zeila on the Red Sea.\n\nEthiopia lost its status as a great trading state after the fall of Axum. Most\nEthiopians came to despise traders, preferring instead to emulate the\ncountry's legendary warriors and priests. After establishing a foothold in the\ncountry, Greek, Armenian, and Arab traders became the economic intermediaries\nbetween Ethiopia and the outside world. Arabs also settled in the interior and\neventually dominated all commercial activity except petty trade.\n\nWhen their occupation of Ethiopia ended in 1941, the Italians left behind them\na country whose economic structure was much as it had been for centuries.\nThere had been some improvements in communications, particularly in the area\nof road building, and attempts had been made to establish a few small\nindustries and to introduce commercial farming, particularly in Eritrea, which\nItaly had occupied since 1890. But these changes were limited. With only a\nsmall proportion of the population participating in the monetized economy,\ntrade consisted mostly of barter. Wage labor was limited, economic units were\nlargely self-sufficient, foreign trade was negligible, and the market for\nmanufactured goods was extremely small.\n\nDuring the late 1940s and 1950s, much of the economy remained unchanged. The\ngovernment focused its development efforts on expansion of the bureaucratic\nstructure and ancillary services. Most farmers cultivated small plots of land\nor herded cattle. Traditional and primitive farming methods provided the\npopulation with a subsistence standard of living. In addition, many nomadic\npeoples raised livestock and moved seasonally in drier areas. The agricultural\nsector grew slightly, and the industrial sector represented a small part of\nthe total economy.\n\nBy the early 1950s, Emperor Haile Selassie I (reigned 1930–74) had renewed\ncalls for a transition from a subsistence economy to an agro-industrial\neconomy. To accomplish this task, Ethiopia needed infrastructure to develop\nresources, a material base to improve living conditions, and better health,\neducation, communications, and other services. A key element of the emperor's\nnew economic policy was the adoption of centrally administered development\nplans.\n\nThe First Five-Year Plan (1957–1961) sought to develop strong infrastructure,\nparticularly in transportation, construction, and communications, to link\nisolated regions. The Second Five-Year Plan (1962–1967) signaled the start of\na 20-year program to change Ethiopia's predominantly agricultural economy to\nan agro-industrial one. The Third Five-Year Plan (1968–1973) also sought to\nfacilitate Ethiopia's economic well-being by raising manufacturing and agro-\nindustrial performance. However, unlike its predecessors, the third plan\nexpressed the government's willingness to expand educational opportunities and\nto improve peasant agriculture.\n\nDuring the First Five-Year Plan, the gross national product (GNP) increased at\na 3.2 percent annual rate as opposed to the projected figure of 3.7 percent,\nand growth in economic sectors such as agriculture, manufacturing, and mining\nfailed to meet the national plan's targets. The Planning Commission never\nassessed the performance of the Second Five-Year Plan and Third Five-Year\nPlan, largely because of a shortage of qualified personnel. However, according\nto data from the Ethiopian government's Central Statistical Authority, during\nthe 1960/61 to 1973/74 period the economy achieved sustained economic growth.\nBetween 1960 and 1970, Ethiopia enjoyed an annual 4.4 percent average growth\nrate in per capita gross domestic product (GDP). Relative to its neighbors,\nEthiopia's economic performance was mixed.\n\nBy the early 1970s, Ethiopia's economy not only had started to grow but also\nhad begun to diversify into areas such as manufacturing and services. However,\nthese changes failed to improve the lives of most Ethiopians. About four-\nfifths of the population were subsistence farmers who lived in poverty because\nthey used most of their meager production to pay taxes, rents, debt payments,\nand bribes.\n\nThe 1974 revolution resulted in the nationalization and restructuring of the\nEthiopian economy. After the revolution, the country's economy can be viewed\nas having gone through four phases. Internal political upheaval, armed\nconflict, and radical institutional reform marked the 1974-78 period of the\nrevolution. There was little economic growth; instead, the government's\nnationalization measures and the highly unstable political climate caused\neconomic dislocation in sectors such as agriculture and manufacturing. As a\nresult of these problems, GDP increased at an average annual rate of only 0.4\npercent.\n\nIn the second phase (1978–1980), the economy began to recover as the\ngovernment consolidated power and implemented institutional reforms. More\nimportant, security conditions improved as internal and external threats\nsubsided. GDP grew at an average annual rate of 5.7 percent.\n\nIn the third phase (1980–1985), the economy experienced a setback. Except for\nEthiopian fiscal year (EFY) 1982/83, the growth of GDP declined. Manufacturing\ntook a downturn as well, and agriculture reached a crisis stage, particularly\ndue to drought that lead to widespread famine.\n\nIn the fourth period (1985–1990), the economy continued to stagnate. GDP and\nthe manufacturing sector also grew during this period, GDP increasing at an\naverage annual rate of 5 percent. However, the lingering effects of the\n1984-85 drought undercut these achievements and contributed to the economy's\noverall stag.\n\nSince 1991, the Ethiopian government has embarked on a program of economic\nreform, including privatization of state enterprises and rationalization of\ngovernment regulation. While the process is still ongoing, the reforms have\nattracted foreign direct investment.\n\nIn 2015, Ethiopia has 2,700 millionaires, a number that has more than doubled\nsince 2007. Their fortunes are mainly built-in niches of economic rents\n(banks, mines, etc.) without investing in structural and strategic sectors\n(industrial production, infrastructure, etc.) and should in no way promote\neconomic development or represent a source of competition for Western\nmultinationals.\n\nThe Ethiopian government is stepping up its efforts to attract foreign\ninvestors, particularly in the textile sector. They can now import their\nmachines without customs duties, benefit from a tax exemption for ten years,\npay rents much lower than market prices, and use very inexpensive water and\nelectricity. Major brands have established themselves in the country, such as\nDecathlon, H&M, and Huajian. These companies also benefit from a cheap labor\nforce, with a monthly salary of around 35 euros. Finally, trade agreements\nbetween Ethiopia and the European Union allow them to export duty-free.",
    "openai_summarised_points": [
      "• Ethiopia's resources have historically enabled the country to maintain long-standing contacts with the outside world, unlike most sub-Saharan African nations.",
      "• Since ancient times, Ethiopian traders exchanged gold, ivory, musk, and wild animal skins for salt and luxury goods such as silk and velvet.",
      "• By the late nineteenth century, coffee had become one of Ethiopia's significant cash crops.",
      "• During this period, most trade was conducted along two major routes terminating in the Kefa-Jima region in the southwest: one route went north to Mitsiwa via Gonder and Adwa, and the other along the Awash River valley to Harer, then to Berbera or Zeila on the Red Sea.",
      "• Ethiopia lost its status as a great trading empire after the fall of Axum.",
      "• Post-Axum, Ethiopians increasingly despised traders, preferring to emulate legendary warriors and priests.",
      "• Greek, Armenian, and Arab traders established a foothold in Ethiopia, becoming the primary economic intermediaries between Ethiopia and the outside world; Arabs settled internally and dominated all commercial activity except petty trade.",
      "• Italian occupation ended in 1941, leaving Ethiopia's economic structure largely unchanged from centuries prior, with limited improvements in communications, some small industries, and commercial farming, especially in Eritrea (occupied since 1890).",
      "• The economy was predominantly barter-based with only a small proportion of the population participating in the monetized economy; trade was negligible, wage labor limited, and markets for manufactured goods very small.",
      "• During the late 1940s and 1950s, Ethiopia's economy remained largely unchanged; government efforts focused on expanding bureaucracy and ancillary services.",
      "• Most farmers practiced small-scale cultivation or cattle herding, using traditional methods that provided subsistence living; nomadic peoples raised livestock and moved seasonally in arid regions.",
      "• The agricultural sector experienced slight growth; the industrial sector was minimal.",
      "• By the early 1950s, Emperor Haile Selassie I (reigned 1930–1974) promoted a transition from subsistence to an agro-industrial economy, emphasizing infrastructure development, resource utilization, improved living conditions, health, education, and communication services.",
      "• A key element of Emperor Selassie's economic policy was the adoption of centrally planned development programs.",
      "• The First Five-Year Plan (1957–1961) aimed to develop infrastructure—transportation, construction, and communications—to connect isolated regions; it achieved a 3.2% annual GNP growth, slightly below the projected 3.7%, with sectors like agriculture, manufacturing, and mining failing to meet targets.",
      "• The Second Five-Year Plan (1962–1967) initiated a 20-year program to transform Ethiopia's economy into an agro-industrial one; the Planning Commission did not assess its performance due to personnel shortages.",
      "• The Third Five-Year Plan (1968–1973) aimed to enhance manufacturing and agro-industrial performance, while also expanding educational opportunities and improving peasant agriculture.",
      "• From 1960/61 to 1973/74, Ethiopia experienced sustained economic growth, with an average annual per capita GDP growth rate of 4.4% between 1960 and 1970.",
      "• Relative to neighboring countries, Ethiopia's economic performance was mixed during this period.",
      "• By the early 1970s, Ethiopia's economy had begun diversifying into manufacturing and services, but most of the population remained impoverished subsistence farmers, using their production mainly to pay taxes, rents, debts, and bribes.",
      "• The 1974 revolution led to the nationalization and restructuring of Ethiopia's economy.",
      "• The revolutionary period (1974–1978) was marked by political upheaval, armed conflict, and radical institutional reforms, resulting in minimal economic growth; GDP grew at an average annual rate of only 0.4%.",
      "• During 1978–1980, the economy began recovering as the government consolidated power and implemented reforms, with GDP growth averaging 5.7% annually.",
      "• The period 1980–1985 saw a setback; GDP growth declined except in 1982/83, manufacturing contracted, and agriculture faced a crisis due to drought and famine.",
      "• From 1985–1990, the economy stagnated with GDP growth averaging 5% annually; drought effects from 1984–85 hampered overall economic progress.",
      "• Since 1991, Ethiopia has implemented economic reforms including privatization of state enterprises and deregulation, which have attracted foreign direct investment.",
      "• As of 2015, Ethiopia had 2,700 millionaires, more than doubling since 2007; their wealth is primarily derived from economic rents in sectors like banking and mining, not from investments in strategic or industrial sectors.",
      "• The Ethiopian government is actively promoting foreign investment, especially in textiles, offering incentives such as duty-free import of machines, ten-year tax exemptions, low rent prices, and inexpensive water and electricity.",
      "• Major international brands such as Decathlon, H&M, and Huajian have established operations in Ethiopia, benefiting from cheap labor with monthly wages around 35 euros.",
      "• Trade agreements between Ethiopia and the European Union enable duty-free exports for Ethiopian products."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:22.353167",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 7496,
      "bullet_points_count": 30
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture, forestry and fishing",
    "text": "Coffee sorting process is huge since Ethiopia exports over a billion dollars'\nworth of coffee globally Map of economic activities in Ethiopia and Eritrea\n(1976)\n\nAs of 2023[update], agriculture accounts for almost 36% of GDP, 81 percent of\nexports, and 73 percent of the labour force. Many other economic activities\ndepend on agriculture, including marketing, processing, and export of\nagricultural products. Production is overwhelmingly of a subsistence nature,\nand a large part of commodity exports are provided by the small agricultural\ncash-crop sector. Principal crops include coffee, pulses (e.g., beans),\noilseeds, cereals, potatoes, sugarcane, and vegetables. Exports are almost\nentirely agricultural commodities, with coffee as the largest foreign exchange\nearner, and its flower industry becoming a new source of revenue: for\n2005/2006 (the latest year available) Ethiopia's coffee exports represented\n0.9% of the world exports, and oilseeds and flowers each representing 0.5%.\nEthiopia is Africa's second biggest maize producer. In 2000, Ethiopia's\nlivestock contributed to 19% of total GDP.\n\nAs of 2008[update], some countries that import most of their food, such as\nSaudi Arabia, have begun planning the purchase and development of large tracts\nof arable land in developing countries such as Ethiopia. This land grabbing\nhas raised fears of food being exported to more prosperous countries while the\nlocal population faces its own shortage.\n\nForest products are mainly logs used in construction. The silvicutural\nproducts are used in construction and manufacturing, and as energy sources.\nEthiopia's fisheries are entirely fresh water, as it has no marine coastline.\nAlthough total production has been continuously increasing since 2007, the\nfishing industry is a very small part of the economy. Fishing is predominantly\nartisanal. In 2014, nearly 45,000 fishermen were employed in the sector with\nonly 30% of them employed full-time.\n\nIn 2018, Ethiopia produced the following goods:\n\n* 7.3 million tons of maize (17th largest producer in the world)\n* 4.9 million tons of sorghum (4th largest producer in the world)\n* 4.2 million tons of wheat\n* 2.1 million tons of barley (17th largest producer in the world)\n* 1.8 million tons of sweet potato (5th largest producer in the world)\n* 1.4 million tons of sugar cane\n* 1.3 million tons of yam (5th largest producer in the world)\n* 988 thousand tons of broad bean\n* 982 thousand tons of millet\n* 743 thousand tons of potato\n* 599 thousand tons of vegetable\n* 515 thousand tons of chick pea (6th largest producer in the world)\n* 508 thousand tons of banana\n* 470 thousand tons of coffee (6th largest producer in the world)\n* 446 thousand tons of cabbage\n* 374 thousand tons of pea (20th largest producer in the world)\n* 322 thousand tons of onion\n* 301 thousand tons of sesame seed (7th largest producer in the world)\n* 294 thousand tons of bell pepper\n* 172 thousand tons of lentil (11th largest producer in the world)\n* 144 thousand tons of rice\n* 143 thousand tons of peanut\n* 140 thousand tons of cotton\n* 124 thousand tons of garlic\n* 102 thousand tons of mango (including mangosteen and guava)\n* 101 thousand tons of linseed (7th largest producer in the world)",
    "openai_summarised_points": [
      "• The coffee sorting process in Ethiopia is extensive and significant, as the country exports over a billion dollars' worth of coffee globally, making coffee a major commodity in its export economy.",
      "• The map of economic activities in Ethiopia and Eritrea was created in 1976, illustrating the distribution of various sectors within these countries.",
      "• As of 2023, agriculture accounts for approximately 36% of Ethiopia's Gross Domestic Product (GDP), highlighting its central role in the national economy.",
      "• Agriculture constitutes about 81% of Ethiopia's total exports, underscoring its importance in foreign trade.",
      "• Approximately 73% of Ethiopia's labor force is employed in agriculture, indicating its dominance as a source of employment.",
      "• The majority of agricultural production is of a subsistence nature, with a significant portion of exports coming from small-scale agricultural cash-crop farming.",
      "• Principal crops produced in Ethiopia include coffee, pulses (such as beans), oilseeds, cereals, potatoes, sugarcane, and vegetables.",
      "• Ethiopia's exports are predominantly agricultural commodities, with coffee serving as the largest foreign exchange earner.",
      "• The country's flower industry has emerged as a new source of revenue, especially notable during the 2005/2006 period, which is the latest available data.",
      "• In 2005/2006, Ethiopia's coffee exports accounted for 0.9% of the world's total coffee exports.",
      "• During the same period, oilseeds and flowers each represented 0.5% of global exports.",
      "• Ethiopia is the second-largest maize producer in Africa.",
      "• In 2000, livestock contributed approximately 19% to Ethiopia's total GDP, emphasizing the sector's economic significance.",
      "• As of 2008, countries such as Saudi Arabia, which import large quantities of food, began planning to purchase and develop extensive tracts of arable land in Ethiopia, raising concerns about land grabbing and food security.",
      "• This land acquisition has sparked fears that food might be exported to wealthier nations while Ethiopia's local population faces shortages.",
      "• Forest products in Ethiopia mainly consist of logs used in construction, with silvicultural products serving roles in construction, manufacturing, and as energy sources.",
      "• Ethiopia's fisheries are exclusively freshwater, as the country has no access to marine coastlines.",
      "• Although fish production has been steadily increasing since 2007, the fishing industry remains a small sector within the economy.",
      "• Fishing in Ethiopia is predominantly artisanal, employing nearly 45,000 fishermen in 2014, with only about 30% working full-time.",
      "• In 2018, Ethiopia produced the following key agricultural goods:",
      "• 7.3 million tons of maize, ranking 17th globally.",
      "• 4.9 million tons of sorghum, ranking 4th globally.",
      "• 4.2 million tons of wheat.",
      "• 2.1 million tons of barley, ranking 17th globally.",
      "• 1.8 million tons of sweet potato, ranking 5th globally.",
      "• 1.4 million tons of sugar cane.",
      "• 1.3 million tons of yam, ranking 5th globally.",
      "• 988 thousand tons of broad beans.",
      "• 982 thousand tons of millet.",
      "• 743 thousand tons of potatoes.",
      "• 599 thousand tons of vegetables.",
      "• 515 thousand tons of chickpeas, ranking 6th globally.",
      "• 508 thousand tons of bananas.",
      "• 470 thousand tons of coffee, ranking 6th globally.",
      "• 446 thousand tons of cabbage.",
      "• 374 thousand tons of peas, ranking 20th globally.",
      "• 322 thousand tons of onions.",
      "• 301 thousand tons of sesame seeds, ranking 7th globally.",
      "• 294 thousand tons of bell peppers.",
      "• 172 thousand tons of lentils, ranking 11th globally.",
      "• 144 thousand tons of rice.",
      "• 143 thousand tons of peanuts.",
      "• 140 thousand tons of cotton.",
      "• 124 thousand tons of garlic.",
      "• 102 thousand tons of mangoes, including mangosteen and guava.",
      "• 101 thousand tons of linseed, ranking 7th globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:35.460907",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3224,
      "bullet_points_count": 46
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Textile industry",
    "text": "Employees of Ethiopian garment factories, who work for brands such as Guess,\nH&M or Calvin Klein, receive a monthly salary of 26 dollars per month. These\nvery low wages have led to low productivity, frequent strikes and high\nturnover. Some factories have replaced all their employees on average every 12\nmonths, according to a 2019 report of the Stern Centre for Business and Human\nRights at New York University.",
    "openai_summarised_points": [
      "• Employees of Ethiopian garment factories working for international brands such as Guess, H&M, and Calvin Klein receive a monthly salary of only 26 US dollars.",
      "• The extremely low wages paid to these workers have resulted in low productivity levels within the industry.",
      "• The low wages and working conditions have contributed to frequent strikes among factory employees.",
      "• High employee turnover is a significant issue in the Ethiopian textile industry, with some factories replacing all their employees on average every 12 months.",
      "• These findings are based on a 2019 report from the Stern Centre for Business and Human Rights at New York University."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:37.403935",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 412,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Minerals and mining",
    "text": "Microcline from the Kenticha mine, Oromia Region, Ethiopia.\n\nMining is important to the economy of Ethiopia as a diversification from\nagriculture. Currently, mining comprises only 1% of GDP. Gold, gemstones\n(diamonds and sapphires), and industrial minerals are important commodities\nfor the country's export-oriented growth strategy.\n\nThe country has deposits of coal, opal, gemstones, kaolin, iron ore, soda ash,\nand tantalum, but only gold is mined in significant quantities. In Salt\nextraction from salt beds in the Afar Depression, as well as from salt springs\nin Dire and Afder districts in the south, is only of internal importance and\nonly a negligible amount is exported.\n\nTantalum mining has also been profitable. It was reported that in the late\n1980s, the mineral industry lacked importance given that it contributed less\nthan 0.2 percent of Ethiopia's GDP. Mining for gold is a key development\nsector in the country. Gold export, which was just US$5 million in 2001, has\nrecorded a large increase to US$602 million in 2012. 2001 gold production\namounted to some 3.4 tons.",
    "openai_summarised_points": [
      "• Mining is a significant sector in Ethiopia's economy, serving as a diversification from the dominant agricultural industry.",
      "• Currently, the mining sector contributes approximately 1% to Ethiopia's Gross Domestic Product (GDP).",
      "• Key mineral commodities for Ethiopia's export-oriented growth strategy include gold, gemstones (such as diamonds and sapphires), and industrial minerals.",
      "• Ethiopia possesses deposits of various minerals, including coal, opal, gemstones, kaolin, iron ore, soda ash, and tantalum; however, only gold is mined in substantial quantities.",
      "• Salt extraction occurs from salt beds in the Afar Depression and from salt springs in the Dire and Afder districts in the south, but this activity is primarily for internal consumption, with only negligible amounts exported.",
      "• Tantalum mining has proven profitable in Ethiopia; however, in the late 1980s, the mineral industry was relatively insignificant, contributing less than 0.2% to the national GDP.",
      "• Gold mining is considered a key development sector for Ethiopia, with significant growth in gold exports over the years.",
      "• Gold exports increased dramatically from US$5 million in 2001 to US$602 million in 2012.",
      "• Gold production in 2001 was approximately 3.4 tons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:40.681359",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1083,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Energy",
    "text": "Waterpower and forests are Ethiopia's main energy sources. The country derives\nabout 90 percent of its electricity needs from hydropower, which means that\nelectricity generation, as with agriculture, is dependent on abundant\nrainfall. Present installed capacity is rated at about 2000 megawatts, with\nplanned expansion to 10,000 megawatts. In general, Ethiopians rely on forests\nfor nearly all of their energy and construction needs; the result has been\ndeforestation of much of the highlands during the last three decades. Ethiopia\nhas set out plans to invest $40 billion to 71 energy projects by 2030\n\nEthiopian Prime Minister Ahmed with Indian counterpart Prime Minister Narendra\nModi meeting for Ethiopia's admission to the alliance\n\nLess than one-half of Ethiopia's towns and cities are connected to the\nnational grid. Petroleum requirements are met via imports of refined products,\nalthough some oil is being hauled overland from Sudan. Oil exploration in\nEthiopia has been underway for decades, ever since Emperor Haile Selassie I\ngranted a 50-year concession to SOCONY-Vacuum in September 1945.\n\nRecent oil and gas discoveries across East Africa have seen the region emerge\nas a new player in the global oil and gas industry. As exciting as the huge\ngas fields of East Africa are, however, the strong decline in oil prices and\nexpectations for an L-shaped recovery with low prices over the coming years\nare increasingly challenging the economic viability of the industry in this\nregion. The reserves are estimated at 4 trillion cubic feet (110×10~~^~~ 9\nm3), while exploration for gas and oil is underway in the Gambela Region\nbordering South Sudan. The discoveries were expected to drive billions of\ndollars in annual investment to the region over the next decade. According to\nBMI estimates, the findings in the last few years are more than that of any\nother region in the world, and the discoveries are expected to continue for\nthe next few years. However, falling global oil prices are threatening the\ncommercial viability of many of these gas prospects.",
    "openai_summarised_points": [
      "• Waterpower and forests are Ethiopia's primary energy sources, with hydropower accounting for approximately 90 percent of the country's electricity needs.",
      "• Ethiopia's electricity generation is heavily dependent on abundant rainfall, similar to its agricultural sector.",
      "• The current installed electricity capacity in Ethiopia is about 2,000 megawatts, with plans to expand this capacity to 10,000 megawatts.",
      "• Ethiopians rely on forests for nearly all of their energy and construction needs, leading to significant deforestation of the highlands over the past three decades.",
      "• Ethiopia has outlined plans to invest a total of $40 billion in 71 energy projects by the year 2030.",
      "• Less than 50 percent of Ethiopian towns and cities are connected to the national electricity grid.",
      "• Petroleum needs in Ethiopia are met through imports of refined products, with some oil transported overland from Sudan.",
      "• Oil exploration in Ethiopia has been ongoing for decades, beginning with Emperor Haile Selassie I granting a 50-year concession to SOCONY-Vacuum in September 1945.",
      "• Recent oil and gas discoveries across East Africa have positioned the region as a new player in the global oil and gas industry.",
      "• Despite the large gas fields in East Africa, declining oil prices and expectations of an L-shaped economic recovery with sustained low prices pose challenges to the industry's economic viability in the region.",
      "• Ethiopia's oil and gas reserves are estimated at 4 trillion cubic feet (approximately 110 billion cubic meters).",
      "• Exploration for gas and oil is currently underway in the Gambela Region, bordering South Sudan.",
      "• The recent discoveries in Ethiopia are expected to attract billions of dollars in annual investment over the next decade.",
      "• According to BMI estimates, Ethiopia's recent oil and gas findings surpass those of any other region globally, with exploration expected to continue for several more years.",
      "• Falling global oil prices threaten the commercial viability of many of Ethiopia's gas prospects and regional oil projects."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:45.289621",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2066,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Manufacturing",
    "text": "A program to privatize state-owned enterprises has been underway since the\nlate 1990s. There has been a large growth of manufacturing in Ethiopia.\nSeveral industrial parks have been built with a focus on textiles.",
    "openai_summarised_points": [
      "• Since the late 1990s, Ethiopia has been implementing a program aimed at privatizing state-owned enterprises within its manufacturing sector.",
      "• The manufacturing industry in Ethiopia has experienced significant growth over recent years.",
      "• The country has established several industrial parks as part of its industrial development strategy.",
      "• These industrial parks primarily focus on the textiles sector, indicating a targeted effort to develop textile manufacturing capabilities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:46.970663",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 213,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Transport",
    "text": "Prior to the outbreak of the 1998–2000 Eritrean–Ethiopian War, landlocked\nEthiopia mainly relied on the seaports of Asseb and Massawa in Eritrea for\ninternational trade.\n\nAs of 2005[update], Ethiopia uses the ports of Djibouti, connected to Addis\nAbaba by the Addis Ababa – Djibouti Railway, and to a lesser extent Port Sudan\nin Sudan. In May 2005, the Ethiopian government began negotiations to use the\nport of Berbera in Somaliland.\n\nBy 2030, the government expects a $74 billion investment in transportation.",
    "openai_summarised_points": [
      "• Prior to the outbreak of the 1998–2000 Eritrean–Ethiopian War, Ethiopia, being landlocked, primarily relied on the seaports of Asseb and Massawa in Eritrea for its international trade activities.",
      "• As of 2005, Ethiopia's main ports of use include the port of Djibouti, which is connected to Addis Ababa via the Addis Ababa – Djibouti Railway, facilitating freight and passenger movement.",
      "• In addition to Djibouti, Ethiopia also utilized the port of Port Sudan in Sudan to a lesser extent for its maritime trade needs.",
      "• In May 2005, the Ethiopian government initiated negotiations to gain access to the port of Berbera in Somaliland, aiming to diversify and enhance its port access options.",
      "• The Ethiopian government has set a target to invest approximately $74 billion in transportation infrastructure by the year 2030, reflecting a significant long-term development plan for the sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:50.982227",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 511,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.6.1",
    "section_name": "Road",
    "text": "As of 2016, there are 113,066 kilometres (70,256 mi) all-weather roads.",
    "openai_summarised_points": [
      "• As of 2016, Ethiopia has a total of 113,066 kilometers (70,256 miles) of all-weather roads."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:52.901903",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 71,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.6.2",
    "section_name": "Air",
    "text": "Ethiopian Airlines is Africa's largest and most profitable airline. It serves\n132 destinations with a fleet of 141 aircraft.",
    "openai_summarised_points": [
      "• Ethiopian Airlines is recognized as Africa's largest airline in terms of fleet size and profitability.",
      "• The airline operates a route network that includes 132 destinations worldwide.",
      "• Ethiopian Airlines maintains a fleet comprising 141 aircraft."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:55.437077",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 124,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.6.3",
    "section_name": "Rail",
    "text": "The Ethiopian railway network has been rapidly expanding. In 2015, the first\nlight rail in Africa was opening in Addis Ababa. In 2017, the electric Addis\nAbaba-Djibouti railway began operations. Presently, two other electric\nrailways are under construction: Awash-Woldiya and Woldiya-Mekelle.",
    "openai_summarised_points": [
      "• The Ethiopian railway network has experienced rapid expansion in recent years.",
      "• In 2015, Addis Ababa became the site of Africa’s first light rail system, marking a significant development in the continent’s urban transportation infrastructure.",
      "• In 2017, the electric Addis Ababa-Djibouti railway commenced operations, establishing a major rail link between Ethiopia and Djibouti.",
      "• Currently, two additional electric railway projects are under construction: the Awash-Woldiya railway and the Woldiya-Mekelle railway, both aimed at enhancing regional connectivity and economic integration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:57.313184",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 292,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Telecommunications and technology",
    "text": "Telecommunications were historically provided by a state-owned monopoly, Ethio\nTelecom, formerly the Ethiopian Telecommunications Corporation. However, on\nOctober, 2022, Safaricom Telecommunications Ethiopia launched its\ntelecommunications services, becoming the first private operator in the\ncountry.\n\nEthiopian shipment cargo ship, docked in Djibouti\n\nIn 2020, ministers set out a national transformation strategy called Digital\nEthiopia 2025. Its aim is to prepare the country for the development of an\neconomy based on digital technology.",
    "openai_summarised_points": [
      "• Historically, telecommunications in Ethiopia were provided by a state-owned monopoly, Ethio Telecom, which was formerly known as the Ethiopian Telecommunications Corporation.",
      "• In October 2022, Safaricom Telecommunications Ethiopia launched its telecommunications services, marking the entry of the first private operator into the Ethiopian telecommunications sector.",
      "• The introduction of Safaricom Telecommunications Ethiopia represented a significant shift from the previously sole state-controlled telecommunications industry.",
      "• An Ethiopian cargo ship is mentioned as docked in Djibouti, indicating Ethiopia’s reliance on Djibouti for maritime logistics and trade routes.",
      "• In 2020, Ethiopian government ministers outlined a national transformation strategy named Digital Ethiopia 2025.",
      "• The primary goal of Digital Ethiopia 2025 is to prepare the country for the development of an economy increasingly based on digital technology."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:00.137400",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 542,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Tourism",
    "text": "The services sector consists almost entirely of tourism, with additional\neconomic opportunity in wholesale and retail trade, transportation, and\ncommunications. Developed in the 1960s, tourism declined greatly during the\nlate 1970s and the 1980s under the military government. Recovery began in the\n1990s, but growth has been constrained by the lack of suitable hotels and\nother infrastructure, the impact of drought, the 1998–2000 war with Eritrea,\nand the specter of terrorism. In 2002 more than 156,000 tourists entered the\ncountry, many of them Ethiopians visiting from abroad, spending more than\nUS$77 million. In 2008, the number of tourists entering the country had\nincreased to 330,000. A decade later, in 2019, Ethiopia registered a record of\n812,000 tourists visiting the country, bringing a revenue of $3.55 bn (4.2\npercent of the gross national product).",
    "openai_summarised_points": [
      "• The services sector in Ethiopia is predominantly composed of tourism, with additional contributions from wholesale and retail trade, transportation, and communications.",
      "• Tourism development in Ethiopia began in the 1960s but experienced a significant decline during the late 1970s and the 1980s under the military government.",
      "• The tourism industry in Ethiopia started to recover in the 1990s; however, growth has been limited by several factors including the lack of suitable hotels and infrastructure, the impact of drought, the 1998–2000 war with Eritrea, and concerns over terrorism.",
      "• In 2002, Ethiopia received over 156,000 tourists, many of whom were Ethiopians visiting from abroad, with total tourist expenditure exceeding US$77 million.",
      "• By 2008, the number of tourists entering Ethiopia increased to approximately 330,000.",
      "• In 2019, Ethiopia recorded a peak of 812,000 tourists visiting the country, generating a tourism revenue of $3.55 billion, which accounted for 4.2 percent of the gross national product."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:04.239746",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 866,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Macroeconomic trends",
    "text": "Share of world GDP (PPP)\n---\nYear  | Share\n1980 | 0.08%\n1990 | 0.07%\n2000  | 0.07%\n2010  | 0.10%\n2017 | 0.16%\n\nThe following table displays the trend of Ethiopia's gross domestic product at\nmarket prices, according to estimates by the International Monetary Fund with\nfigures in millions of Ethiopian Birr.\n\nYear | Gross Domestic Product | GDP (USD) | US Dollar\n---|---|---|---\n| Birr (millions) | per capita | Exchange\n1980 | 14,665 | 190 | 2.06 Birr\n1990 | 25,011 | 257 | 2.06 Birr\n1995 | 47,560 | 148 | 5.88 Birr\n2000 | 64,398 | 124 | 8.15 Birr\n2005 | 106,473 | 169 | 8.65 Birr\n2006 | 131,672 | 202 | 8.39 Birr\n2007 | 171,834 | 253 | 8.93 Birr\n2008 | 245,973 | 333 | 9.67 Birr\n2009 | 386,215 | 398 | 12.39 Birr\n2010 | 427,026 | 361 | 13.33 Birr\n2017  | 1,832,786  | 823  |\n2020  | 3,374,349  | 969  |\n2023  | 8,499,779  | 1,473  |\n\nThe current GDP (USD) per capita of Ethiopia shrank by 43% in the 1990s. The\neconomy saw continuous real GDP growth of at least 5% since 2004.\n\nThe following table shows the main economic indicators in 1980–2023. Inflation\nbelow 5% is in green.\n\nYear  | GDP\n(in bn. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---\n1980  | 10.5  | 324  | 7.4  | 4.0%  | 12.4%  | n/a\n1981  | 11.5  | 346  | 7.6  | n/a  | 1.9%  | n/a\n1982  | 12.3  | 360  | 8.0  | 1.0%  | 7.7%  | n/a\n1983  | 13.8  | 391  | 8.9  | 7.8%  | 3.6%  | n/a\n1984  | 14.0  | 384  | 8.4  | −2.3%  | −0.3%  | n/a\n1985  | 12.8  | 339  | 9.8  | −11.4%  | 18.4%  | n/a\n1986  | 14.3  | 368  | 10.2  | 9.7%  | 5.6%  | n/a\n1987  | 16.7  | 416  | 10.9  | 13.9%  | −9.1%  | n/a\n1988  | 17.4  | 419  | 11.3  | 0.6%  | 2.2%  | n/a\n1989  | 18.0  | 420  | 11.9  | −0.5%  | 9.6%  | n/a\n1990  | 19.1  | 432  | 12.6  | 2.6%  | 5.2%  | n/a\n1991  | 18.3  | 401  | 13.9  | −7.2%  | 20.9%  | n/a\n1992  | 17.1  | 361  | 14.7  | −8.9%  | 21.0%  | 75.3%\n1993  | 19.8  | 404  | 9.1  | 13.4%  | 10.0%  | 120.8%\n1994  | 20.9  | 414  | 8.1  | 3.5%  | 1.2%  | 132.9%\n1995  | 22.7  | 435  | 7.9  | 6.1%  | 13.4%  | 125.6%\n1996  | 26.2  | 488  | 8.8  | 13.5%  | 0.9%  | 113.8%\n1997  | 27.5  | 496  | 8.6  | 2.8%  | −7.2%  | 68.8%\n1998  | 26.6  | 468  | 7.8  | −4.2%  | 3.6%  | 76.5%\n1999  | 28.7  | 491  | 7.5  | 6.3%  | 7.9%  | 83.8%\n2000  | 32.2  | 537  | 8.2  | 9.8%  | 0.7%  | 80.2%\n2001  | 35.4  | 574  | 8.1  | 7.4%  | −8.2%  | 81.9%\n2002  | 36.5  | 578  | 7.8  | 1.6%  | 1.7%  | 95.3%\n2003  | 36.4  | 562  | 8.6  | −2.1%  | 17.8%  | 92.6%\n2004  | 41.8  | 628  | 10.1  | 11.7%  | 3.2%  | 96.5%\n2005  | 48.5  | 711  | 12.4  | 12.6%  | 11.7%  | 70.1%\n2006  | 55.8  | 797  | 15.3  | 11.5%  | 13.6%  | 57.9%\n2007  | 64.1  | 884  | 19.3  | 11.8%  | 17.2%  | 31.4%\n2008  | 72.6  | 969  | 26.3  | 11.2%  | 44.4%  | 27.4%\n2009  | 80.4  | 1,046  | 28.7  | 10.0%  | 8.5%  | 26.0%\n2010  | 90.0  | 1,141  | 26.9  | 10.6%  | 8.1%  | 35.3%\n2011  | 102.3  | 1,267  | 30.5  | 11.4%  | 33.2%  | 39.5%\n2012  | 112.5  | 1,361  | 42.2  | 8.7%  | 24.1%  | 34.2%\n2013  | 122.4  | 1,444  | 46.5  | 9.9%  | 8.1%  | 38.5%\n2014  | 148.5  | 1,707  | 54.2  | 10.3%  | 7.4%  | 39.6%\n2015  | 167.1  | 1,876  | 63.1  | 10.4%  | 10.1%  | 45.8%\n2016  | 194.7  | 2,134  | 72.1  | 8.0%  | 7.3%  | 49.2%\n2017  | 215.1  | 2,303  | 76.8  | 10.2%  | 10.6%  | 51.4%\n2018  | 237.2  | 2,484  | 80.2  | 7.7%  | 13.8%  | 54.7%\n2019  | 263.3  | 2,698  | 92.6  | 9.0%  | 15.8%  | 51.8%\n2020  | 282.9  | 2,838  | 96.6  | 6.1%  | 20.4%  | 50.3%\n2021  | 314.1  | 3,083  | 99.3  | 6.3%  | 26.8%  | 50.5%\n2022  | 357.5  | 3,435  | 120.4  | 6.4%  | 33.9%  | 43.9%\n2023  | 393.3  | 3,719  | 155.8  | 6.1%  | 29.1%  | 36.1%\n\nEthiopia's economy experienced strong, broad-based growth averaging 9.4% a\nyear from 2010/11 to 2019/20. Ethiopia's real gross domestic product (GDP)\ngrowth slowed down to 6.1% in 2019/20 due to the COVID-19 pandemic. Industry,\nmainly construction, and services accounted for most of the growth.\nAgriculture was not affected by the COVID-19 pandemic and its contribution to\ngrowth slightly improved in 2019/20 compared to the previous year. Private\nconsumption and public investment explain demand-side growth, the latter\nassuming an increasingly important role.",
    "openai_summarised_points": [
      "• Ethiopia's share of global GDP based on Purchasing Power Parity (PPP) was 0.08% in 1980, decreased slightly to 0.07% in 1990 and 2000, then increased to 0.10% in 2010, and further rose to 0.16% in 2017, indicating gradual growth in Ethiopia's relative economic size on the world stage.",
      "• According to estimates by the International Monetary Fund (IMF), Ethiopia's gross domestic product (GDP) at market prices in millions of Ethiopian Birr showed a consistent upward trend from 14,665 million Birr in 1980 to 8,499,779 million Birr in 2023.",
      "• In 1980, Ethiopia's GDP was 14,665 million Birr, equivalent to 190 USD per capita, with an exchange rate of 2.06 Birr per USD; by 1990, GDP increased to 25,011 million Birr, with per capita income rising to 257 USD, maintaining the same exchange rate of 2.06 Birr per USD.",
      "• Between 1995 and 2000, Ethiopia's GDP grew from 47,560 million Birr (148 USD per capita) to 64,398 million Birr (124 USD per capita), with the exchange rate changing from 5.88 Birr to 8.15 Birr per USD, reflecting currency devaluation.",
      "• From 2000 onwards, Ethiopia experienced substantial economic growth: GDP increased from 64,398 million Birr (124 USD per capita) in 2000 to 171,834 million Birr (253 USD per capita) in 2007, and further to 245,973 million Birr (333 USD per capita) in 2008, with the exchange rate rising to 9.67 Birr per USD.",
      "• The GDP in 2009 was 386,215 million Birr, with a per capita income of 398 USD, and an exchange rate of 12.39 Birr per USD; in 2010, GDP reached 427,026 million Birr, with per capita income decreasing slightly to 361 USD, and the exchange rate increasing to 13.33 Birr per USD.",
      "• Ethiopia's GDP continued to grow rapidly, reaching 1,832,786 million Birr (823 USD per capita) in 2017, 3,374,349 million Birr (969 USD per capita) in 2020, and 8,499,779 million Birr (1,473 USD per capita) in 2023, demonstrating significant economic expansion.",
      "• The current GDP per capita in USD experienced a 43% decline during the 1990s, indicating a period of economic hardship or stagnation, but since 2004, Ethiopia has maintained continuous real GDP growth of at least 5% annually.",
      "• The main economic indicators from 1980 to 2023 show Ethiopia's GDP in PPP terms increased from 10.5 billion USD in 1980 to 215.1 billion USD in 2017, reaching 393.3 billion USD in 2023, with GDP per capita rising from 324 USD to 2,303 USD in 2017 and 3,719 USD in 2023.",
      "• Ethiopia's nominal GDP grew from 7.4 billion USD in 1980 to 92.6 billion USD in 2019, and further to 155.8 billion USD in 2023, reflecting rapid economic expansion.",
      "• The annual real GDP growth rate was 4.0% in 1980, fluctuated in the following years, reaching a peak of 13.9% in 1987, then declined during the late 1980s and early 1990s, with negative growth in some years such as 1984 (−2.3%) and 1985 (−11.4%).",
      "• From 2004 onward, Ethiopia experienced sustained high growth rates, with GDP growth reaching 11.7% in 2004, 11.8% in 2007, and peaking at 11.2% in 2008, then stabilizing around 6–10% in subsequent years, including 6.1% in 2020 due to the COVID-19 pandemic.",
      "• Inflation rates in Ethiopia varied significantly over the years, with periods of high inflation such as 1985 (−11.4%) and 1987 (13.9%), and relatively low inflation below 5% in recent years, notably 4.0% in 1980, 1.0% in 1982, and below 5% from 2018 onward.",
      "• Ethiopia's government debt as a percentage of GDP fluctuated, reaching 75.3% in 1992, decreasing to 68.8% in 1997, then rising again to 120.8% in 1993, and stabilizing around 36.1% in 2023, indicating varying levels of fiscal sustainability.",
      "• Between 2010 and 2023, Ethiopia's economy experienced strong, broad-based growth averaging approximately 9.4% annually from 2010/11 to 2019/20, with a slowdown to 6.1% in 2019/20 due to the COVID-19 pandemic.",
      "• The COVID-19 pandemic impacted Ethiopia's growth, with real GDP growth slowing from over 10% in previous years to 6.1% in 2019/20, primarily driven by growth in industry (notably construction) and services sectors.",
      "• Agriculture in Ethiopia was resilient during the COVID-19 pandemic, with its contribution to overall growth slightly improving in 2019/20 compared to the previous year.",
      "• Demand-side growth was mainly fueled by private consumption and public investment, with public investment assuming an increasingly significant role in driving economic expansion during this period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:12.455160",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4226,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Poverty",
    "text": "Share of population in extreme poverty over time The African country of\nEthiopia has made strides towards alleviating poverty since 2000 when it was\nassessed that their poverty rate was one of the greatest among all other\ncountries. The country has made great strides in different areas of the\nMillennium Development Goals including eradicating various diseases and\ndecreasing the rate of child mortality. Despite these improvements, poverty is\nstill extremely high within the country. Based on the most recent data from\n2019, 68.7% of the population is affected by multidimensional poverty and an\nadditional 18.4% vulnerable to it. One of the leading factors in driving down\npoverty was the expansion of the agricultural sector. Poor farmers have been\nable to set higher food prices to increase their sales and revenue, but this\nexpansion has come at a cost to the poorest citizens of the country, as they\ncould not afford the higher priced food. One of the biggest challenges to\nalleviating this issue is changing the structure of Ethiopia's economy from an\nagricultural-based economy to a more industry-based economy. The current\nstrategy for addressing poverty in Ethiopia is by building on existing\ngovernment systems and development programs that are already in place within\nthe country.",
    "openai_summarised_points": [
      "• Since 2000, Ethiopia has made significant progress in reducing poverty, which was previously among the highest in the world.",
      "• The country has achieved notable improvements in various Millennium Development Goals, including the eradication of certain diseases and reductions in child mortality rates.",
      "• Despite these advancements, poverty remains a critical issue in Ethiopia.",
      "• As of 2019, 68.7% of the Ethiopian population is affected by multidimensional poverty, which considers factors beyond income such as health, education, and living standards.",
      "• An additional 18.4% of the population is classified as vulnerable to multidimensional poverty, indicating they are at risk of falling into poverty without intervention.",
      "• A key factor in poverty reduction has been the expansion of Ethiopia’s agricultural sector, which has allowed poor farmers to increase food prices, thereby boosting their sales and revenue.",
      "• However, this agricultural growth has negatively impacted the poorest citizens, as they are unable to afford the higher-priced food resulting from increased agricultural output.",
      "• One of the primary challenges in alleviating poverty is transforming Ethiopia’s economy from being predominantly agricultural-based to a more industrialized economy.",
      "• The current strategy for poverty alleviation involves leveraging existing government systems and development programs already established within Ethiopia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:15.600309",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1293,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "External trade",
    "text": "Ethiopian exports in 2006\n\nUntil 2013, the major agricultural export crop was coffee, providing about\n26.4% of Ethiopia's foreign exchange earnings. In the beginning of 2014,\noilseeds exports have been more important. Coffee is critical to the Ethiopian\neconomy. More than 15 million people (25% of the population) derive their\nlivelihood from the coffee sector. Other exports include live animals, leather\nand leather products, chemicals, gold, pulses, oilseeds, flowers, fruits and\nvegetables and khat (or _qat_), a leafy shrub which has psychotropic qualities\nwhen chewed. Cross-border trade by pastoralists is often informal and beyond\nstate control and regulation. In East Africa, over 95% of cross-border trade\nis through unofficial channels and the unofficial trade of live cattle,\ncamels, sheep and goats from Ethiopia sold to Somalia, Kenya and Djibouti\ngenerates an estimated total value of between US$250 and US$300 million\nannually (100 times more than the official figure). This trade helps lower\nfood prices, increase food security, relieve border tensions and promote\nregional integration. However, there are also risks as the unregulated and\nundocumented nature of this trade runs risks, such as allowing disease to\nspread more easily throughout the region. Furthermore, the government of\nEthiopia is purportedly unhappy with lost tax revenue and foreign exchange\nrevenues. Recent initiatives have sought to document and regulate this trade.\n\nDependent on a few vulnerable crops for its foreign exchange earnings and\nreliant on imported oil, Ethiopia lacks sufficient foreign exchange. The\nfinancially conservative government has taken measures to solve this problem,\nincluding stringent import controls and sharply reduced subsidies on retail\ngasoline prices. Nevertheless, the largely subsistence economy is incapable of\nsupporting high military expenditures, drought relief, an ambitious\ndevelopment plan, and indispensable imports such as oil; it therefore depends\non foreign assistance.\n\nIn December 1999, Ethiopia signed a $1.4 billion joint venture deal with the\nMalaysian oil company, Petronas, to develop a huge natural gas field in the\nSomali Region. By the year 2010, however, implementation failed to progress\nand Petronas lost its license to develop the field, which is now being\ninvested in by Chinese company, Poly-GCL Petroleum.[_which?_] Ethiopia has\nalready begun exporting electricity to Kenya, South Sudan and Djibouti.\nEarning from this has generated US$300 million annually. After the completion\nof the Grand Ethiopian Renaissance Dam (GERD) total generation of exports to\nneighboring countries is expected to bring in US$1 billion annually to the\neconomy.\n\nThe dam, which was completed in 2023, is the largest hydroelectric power plant\nin Africa as well as among the 20 largest in the world.",
    "openai_summarised_points": [
      "• Until 2013, coffee was Ethiopia's major agricultural export crop, accounting for approximately 26.4% of the country's foreign exchange earnings.",
      "• At the beginning of 2014, oilseeds exports became more significant in Ethiopia’s export profile.",
      "• Coffee remains critical to the Ethiopian economy, with over 15 million people, representing about 25% of the population, deriving their livelihoods from the coffee sector.",
      "• Other notable Ethiopian exports include live animals, leather and leather products, chemicals, gold, pulses, oilseeds, flowers, fruits, vegetables, and khat (or _qat_), a leafy shrub with psychotropic effects when chewed.",
      "• Cross-border trade by Ethiopian pastoralists is predominantly informal, often occurring outside state control and regulation.",
      "• In East Africa, over 95% of cross-border trade occurs through unofficial channels, with the unregulated trade of live cattle, camels, sheep, and goats from Ethiopia to Somalia, Kenya, and Djibouti valued at an estimated US$250 to US$300 million annually, which is approximately 100 times the official figures.",
      "• This informal trade helps lower food prices, enhance food security, reduce border tensions, and promote regional integration, but it also poses risks such as facilitating the spread of diseases due to its unregulated nature.",
      "• The Ethiopian government is reportedly dissatisfied with the loss of tax revenue and foreign exchange earnings resulting from unregulated cross-border trade, prompting recent efforts to document and regulate these activities.",
      "• Ethiopia's economy is heavily dependent on a few vulnerable crops for foreign exchange and relies on imported oil, leading to a shortage of foreign currency reserves.",
      "• The government has implemented measures such as strict import controls and significant reductions in subsidies on retail gasoline to address foreign exchange shortages.",
      "• Despite these measures, Ethiopia's largely subsistence economy struggles to support high military expenditures, drought relief, ambitious development projects, and essential imports like oil, necessitating foreign aid.",
      "• In December 1999, Ethiopia signed a $1.4 billion joint venture agreement with Malaysian oil company Petronas to develop a large natural gas field in the Somali Region; however, by 2010, implementation stalled, and Petronas lost its license, with Chinese company Poly-GCL Petroleum now involved in the development.",
      "• Ethiopia has begun exporting electricity to neighboring countries including Kenya, South Sudan, and Djibouti, generating approximately US$300 million annually from these exports.",
      "• The completion of the Grand Ethiopian Renaissance Dam (GERD) in 2023 is expected to significantly boost Ethiopia’s electricity exports, with total annual revenue projected to reach US$1 billion after full operational capacity.",
      "• The GERD is the largest hydroelectric power plant in Africa and ranks among the 20 largest hydroelectric plants worldwide."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:21.129117",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2830,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Ethiopia",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Trade statistics",
    "text": "Year  | Goods exports\n(million US$) | Goods imports\n(in million US$) | Net trade\n(in million US$)\n---|---|---|---\n2023  | $3,470  | $15,318  | −$11,849\n2020  | $3,253  | $11,762  | −$8,509\n2015  | $2,920  | $14,977  | −$12,057\n2010  | $2,480  | $7,365  | −$4,885\n2005  | $917  | $3,701  | −$2,784\n2000  | $486  | $1,131  | −$645\n1990  | $292  | $912  | −$620\n1980  | $419  | $650  | −$230",
    "openai_summarised_points": [
      "• In 2023, Ethiopia's goods exports were valued at approximately $3,470 million US dollars, while goods imports reached approximately $15,318 million US dollars, resulting in a net trade deficit of about $11,849 million US dollars.",
      "• In 2020, Ethiopia exported goods worth approximately $3,253 million US dollars and imported goods worth approximately $11,762 million US dollars, leading to a net trade deficit of approximately $8,509 million US dollars.",
      "• In 2015, Ethiopia's goods exports totaled approximately $2,920 million US dollars, with imports amounting to approximately $14,977 million US dollars, resulting in a net trade deficit of approximately $12,057 million US dollars.",
      "• In 2010, Ethiopia exported goods valued at approximately $2,480 million US dollars and imported goods worth approximately $7,365 million US dollars, with a net trade deficit of approximately $4,885 million US dollars.",
      "• In 2005, Ethiopia's goods exports were approximately $917 million US dollars, while imports were approximately $3,701 million US dollars, leading to a net trade deficit of approximately $2,784 million US dollars.",
      "• In 2000, Ethiopia exported goods worth approximately $486 million US dollars and imported goods worth approximately $1,131 million US dollars, resulting in a net trade deficit of approximately $645 million US dollars.",
      "• In 1990, Ethiopia's goods exports were approximately $292 million US dollars, with imports totaling approximately $912 million US dollars, leading to a net trade deficit of approximately $620 million US dollars.",
      "• In 1980, Ethiopia exported goods valued at approximately $419 million US dollars and imported goods worth approximately $650 million US dollars, resulting in a net trade deficit of approximately $230 million US dollars."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:02:28.610027",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 388,
      "bullet_points_count": 8
    }
  }
]