[
  {
    "chapter_name": "Economy of Burkina Faso",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( November 2024)_  \n---|---  \n  \nThe **economy of Burkina Faso** is based primarily on subsistence farming and\nlivestock raising. Burkina Faso has an average income purchasing-power-parity\nper capita of $1,900 and nominal per capita of $790 in 2014. More than 80% of\nthe population relies on subsistence agriculture with only a small fraction\ndirectly involved in industry and services. Highly variable rainfall, poor\nsoils, lack of adequate communications and other infrastructure, a low\nliteracy rate, and a stagnant economy are all longstanding problems of this\nlandlocked country. The export economy also remained subject to fluctuations\nin world prices.\n\nThe country has a high population density, few natural resources, and a\nfragile soil. Industry remains dominated by unprofitable government-controlled\ncorporations.[_citation needed_] Following the African franc currency\ndevaluation in January 1994 the government updated its development program in\nconjunction with international agencies, and exports and economic growth have\nincreased. Maintenance of its macroeconomic progress depends on continued low\ninflation, reduction in the trade deficit, and reforms designed to encourage\nprivate investment.\n\nThe Burkinabé financial system represents 30% of the country's GDP and is\ndominated by the banking sector, which accounts for 90% of total financial\nsystem assets. Eleven banks and five non-bank financial institutions operate\nin the country.\n\nThe banking sector is highly concentrated, with the three largest banks\nholding nearly 60% of total financial sector assets. Banks are generally\nadequately capitalized, but remain vulnerable due to their overexposure to the\ncotton sector, the prices of which are subject to significant oscillations.\n\nA December 2018 report from the World Bank indicates that cotton had become\nthe most important cash crop, while gold exports were increasing in recent\nyears. In 2017, economic growth increased to 6.4% in 2017 (vs. 5.9% in 2016)\nprimarily due to gold production and increased investment in infrastructure.\nThe increase in consumption linked to growth of the wage bill also supported\neconomic growth. Inflation remained low, 0.4% that year but the public deficit\ngrew to 7.7% of GDP (vs. 3.5% in 2016). The government was continuing to get\nfinancial aid and loans to finance the debt. To finance the public deficit,\nthe Government combined concessional aid and borrowing on the regional market.\nThe World Bank said that the economic outlook remained favorable in the short\nand medium term, although that could be negatively impacted. Risks included\nhigh oil prices (imports), lower prices of gold and cotton (exports) as well\nas terrorist threat and labour strikes."
  },
  {
    "chapter_name": "Economy of Burkina Faso",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "Gross Domestic Product of Burkina Faso at market prices estimated by the International Monetary Fund with figures in millions of CFA Francs.  Year | Gross Domestic Product | US Dollar Exchange | Inflation Index (2000=100)\n---|---|---|---\n1980 | 412,240 | 211.29 CFA Francs | 45\n1985 | 642,387 | 449.22 CFA Francs | 67\n1990 | 848,910 | 272.26 CFA Francs | 65\n1995 | 1,330,159 | 499.12 CFA Francs | 88\n2000 | 1,861,522 | 711.86 CFA Francs | 100\n2005 | 3,027,196 | 526.56 CFA Francs | 115\n\nFor purchasing power parity comparisons, the US Dollar is exchanged at 470.70\nCFA Francs only. Mean wages were $0.56 per man-hour in 2009.\n\nBurkinabé exports in 2006\n\nCurrent GDP per capita of Burkina Faso grew 13% in the Sixties reaching a peak\ngrowth of 237% in the Seventies. But this proved unsustainable and growth\nconsequently scaled back to 23% in the Eighties. Finally, it shrank by 37% in\nthe Nineties. Average wages in 2007 hover around 2 to 3 dollars per day.\n\nAlthough disadvantaged by an extremely resource-deprived domestic economy,\nBurkina Faso remains committed to the structural adjustment program it\nlaunched in 1991. It has largely recovered from the devaluation of the CFA in\nJanuary 1994, with a 1996 growth rate of 5.9%.\n\nMany Burkinabé migrate to neighbouring countries for work, and their\nremittances provide a substantial contribution to the balance of payments.\nBurkina Faso is attempting to improve the economy by developing its mineral\nresources, improving its infrastructure, making its agricultural and livestock\nsectors more productive and competitive, and stabilizing the supplies and\nprices of cereals.\n\nThe agricultural economy remains highly vulnerable to fluctuations in\nrainfall. The Mossi Plateau in north central Burkina Faso faces encroachment\nfrom the Sahara. The resultant southward migration means heightened\ncompetition for control of very limited water resources south of the Mossi\nPlateau. Most of the population ekes out a living as subsistence farmers,\nliving with problems of climate, soil erosion, and rudimentary technology. The\nstaple crops are pearl millet, sorghum, maize, and rice. The cash crops are\ncotton, groundnuts, karite (shea nuts), and sesame. Livestock, once a major\nexport, has declined.\n\nA 2018 report by the African Development Bank Group discussed a macroeconomic\nevolution: \"higher investment and continued spending on social services and\nsecurity that will add to the budget deficit\". This group's prediction for\n2018 indicated that the budget deficit would be reduced to 4.8% of GDP in 2018\nand to 2.9% in 2019. Public debt associated with the National Economic and\nSocial Development Plan was estimated at 36.9% of GDP in 2017."
  },
  {
    "chapter_name": "Economy of Burkina Faso",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture",
    "text": "Burkina Faso produced in 2018:\n\n* 1.9 million tons of sorghum;\n* 1.7 million tons of maize;\n* 1.1 million tons of millet;\n* 630 thousand tons of cowpea (3rd largest producer in the world, preceded only by Niger and Nigeria);\n* 490 thousand tons of sugar cane;\n* 482 thousand tons of cotton;\n* 329 thousand tons of peanut;\n* 253 thousand tons of sesame seed (8th largest producer in the world);\n* 240 thousand tons of vegetable;\n* 160 thousand tons of rice;\n* 103 thousand tons of cashew nuts (12th largest producer in the world);\n\nIn addition to smaller productions of other agricultural products."
  },
  {
    "chapter_name": "Economy of Burkina Faso",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "External trade",
    "text": "Industry, still in an embryonic stage, is located primarily in Bobo-Dioulasso,\nOuagadougou, Banfora, and Koudougou. Manufacturing is limited to food\nprocessing, textiles, and other import substitution heavily protected by\ntariffs. Some factories are privately owned, and others are set to be\nprivatized. Burkina Faso's exploitable natural resources are limited, although\na manganese ore deposit is located in the remote northeast. Gold mining has\nincreased greatly since the mid-1980s and, along with cotton, is a leading\nexport moneyearner. However, both gold and cotton are listed as goods produced\nmostly by child labor and forced labor according to a recent U.S. Department\nof Labor report."
  },
  {
    "chapter_name": "Economy of Burkina Faso",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Child labour",
    "text": "According to the United States Department of Labor in 2012, 37.8% of children\nin Burkina Faso aged 5-14 were working, while another 13.6% were both going to\nschool and working.\n\nChildren working in granite quarries and gold mines were working 6 to 7 days a\nweek for up to 14 hours per day. So-called \"payment\" is in the form of food to\neat and a place to sleep. Since that time, the government has adopted a\nNational Action Plan, and in collaboration with Interpol, have since have\nrescued many children from child trafficking.\n\nBy 2023, the percentage of children working in Burkina Faso had dropped\nslightly to 35.7%, according to the United States' Department of Labor.\n\nChristian Children's Fund of Canada (CCFC) has partnered with EDUCO, a fellow\nmember of the ChildFund Alliance, to implement a European Union-funded project\nin north Burkina to prevent children from working in mines."
  }
]