[
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The United Arab Emirates is a high-income developing market economy. The UAE's\neconomy is the 3rd largest in the Middle East (after Turkey and Saudi Arabia\n), with a gross domestic product (GDP) of US$415 billion (AED 1.83 trillion)\nin 2021-2023.\n\nThe UAE economy is heavily reliant on revenues from petroleum and natural gas,\nespecially in Abu Dhabi. In 2009, more than 85% of the UAE's economy was based\non the oil exports. In 2011, oil exports accounted for 77% of the UAE's state\nbudget. In recent years, there has been some economic diversification,\nparticularly in Dubai. Abu Dhabi and other UAE emirates have remained\nrelatively conservative in their approach to diversification. Dubai has far\nsmaller oil reserves than its counterparts.\n\nTourism is one of the biggest non-oil sources of revenue in the UAE. A massive\nconstruction boom, an expanding manufacturing base, and a thriving services\nsector are helping the country to diversify its economy. In 2007, there was US\n$350 billion worth of active construction projects.\n\nThe UAE is a member of the World Trade Organization and OPEC.",
    "openai_summarised_points": [
      "• The United Arab Emirates (UAE) is classified as a high-income developing market economy.",
      "• The UAE's economy ranks as the 3rd largest in the Middle East, following Turkey and Saudi Arabia.",
      "• The gross domestic product (GDP) of the UAE was US$415 billion (AED 1.83 trillion) during the period 2021-2023.",
      "• The UAE economy is heavily dependent on revenues from petroleum and natural gas, with Abu Dhabi being the primary center for these resources.",
      "• In 2009, over 85% of the UAE's economy was based on oil exports, indicating a strong reliance on the petroleum sector.",
      "• By 2011, oil exports accounted for 77% of the UAE’s state budget, underscoring the fiscal importance of hydrocarbons.",
      "• Economic diversification efforts have increased in recent years, particularly in Dubai, which has smaller oil reserves compared to other emirates.",
      "• Abu Dhabi and other emirates have maintained a relatively conservative approach to economic diversification compared to Dubai.",
      "• Tourism is one of the largest non-oil revenue sources in the UAE, contributing significantly to economic diversification.",
      "• The UAE has experienced a massive construction boom, supported by an expanding manufacturing base and a thriving services sector, aiding economic diversification.",
      "• In 2007, the UAE had US$350 billion worth of active construction projects, reflecting rapid infrastructure and development growth.",
      "• The UAE is a member of the World Trade Organization (WTO), facilitating its integration into the global trading system.",
      "• The UAE is also a member of the Organization of the Petroleum Exporting Countries (OPEC), aligning it with other major oil-producing nations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:22.439093",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1094,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic overview",
    "text": "UAE has the second-largest economy in the Arab world (after Saudi Arabia),\nwith a gross domestic product (GDP) of US$414 billion (AED 1.52 trillion) in\n2018. A third of the GDP is from oil revenues. The economy was expected to\ngrow 4–4.5% in 2013, compared to 2.3–3.5% over the previous five years. Since\nindependence in 1971, UAE's economy has grown by nearly 231 times to AED1.45\ntrillion in 2013. The non-oil trade has grown to AED1.2 trillion, a growth of\naround 28 times from 1981 to 2012.\n\nThe UAE's economy is one of the most open worldwide, and its economic history\ngoes back to the times when ships sailed to India, along the Swahili coast, as\nfar south as Mozambique.\n\nThe UAE economy has been ‘inspected’ by international economic institutions on\na regular basis, generally receiving good reports on economic developments.\nInternational Monetary Fund (IMF) expected UAE's economic growth to increase\nto 4.5% in 2015, compared to 4.3% in 2014. The IMF ascribed UAE's potentially\nstrong economic growth in World Economic Outlook Report to the increased\ncontribution of non-petroleum sectors, which registered a growth average of\nmore than 6% in 2014 and 2015. Such contribution includes banking, tourism,\ncommerce and real estate. Increase of Emirati purchasing power and\ngovernmental expenditures in infrastructure projects have considerably\nincreased.[_citation needed_]\n\nInternationally, UAE is ranked among the top 20 for global service business,\naccording to AT Kearney, the top 30 on the WEF \"most-networked countries\" and\nin the top quarter as a least corrupt country per the TI's corruption index.\n\nThe government of the United Arab Emirates announced a broad restructuring and\nmerger of more than 50% of its federal agencies, including ministries and\ndepartments, in an attempt to deal with and recover from the economic shocks\nfollowing months-long coronavirus lockdown.",
    "openai_summarised_points": [
      "• The United Arab Emirates (UAE) possesses the second-largest economy in the Arab world, following Saudi Arabia, with a gross domestic product (GDP) valued at US$414 billion (AED 1.52 trillion) in 2018.",
      "• Approximately one-third of the UAE's GDP is derived from oil revenues, indicating a significant but not exclusive reliance on petroleum resources.",
      "• Economic growth in the UAE was projected to be between 4% and 4.5% in 2013, an increase compared to the growth range of 2.3% to 3.5% experienced over the preceding five years.",
      "• Since gaining independence in 1971, the UAE's economy expanded nearly 231 times, reaching AED 1.45 trillion by 2013, demonstrating rapid and sustained economic development.",
      "• Non-oil trade in the UAE grew substantially to AED 1.2 trillion by 2012, representing an approximate 28-fold increase from 1981, highlighting diversification efforts beyond the oil sector.",
      "• The UAE's economy is recognized as one of the most open globally, with historical economic activity dating back to maritime trade routes connecting to India, the Swahili coast, and as far south as Mozambique.",
      "• International economic institutions, including the International Monetary Fund (IMF), have regularly reviewed the UAE's economy, generally issuing positive assessments regarding its economic progress.",
      "• The IMF forecasted an increase in UAE's economic growth to 4.5% in 2015, up from 4.3% in 2014, attributing this growth to the expanding contributions of non-petroleum sectors.",
      "• Non-petroleum sectors such as banking, tourism, commerce, and real estate registered average growth rates exceeding 6% during 2014 and 2015, reflecting diversification and economic resilience.",
      "• Growth in Emirati purchasing power alongside increased governmental expenditure on infrastructure projects significantly contributed to the UAE's economic expansion during this period.",
      "• Globally, the UAE ranks within the top 20 countries for global service business according to AT Kearney, within the top 30 most-networked countries per the World Economic Forum (WEF), and in the top quarter of least corrupt countries based on Transparency International's (TI) corruption index.",
      "• In response to economic shocks caused by prolonged coronavirus lockdowns, the UAE government announced a comprehensive restructuring and merger of over 50% of its federal agencies, including ministries and departments, aiming to enhance recovery and economic management."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:24.124085",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1889,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Historical background",
    "text": "Before independence from the United Kingdom and unification in 1971, each\nemirate was responsible for its own economy. At the time, pearl diving,\nseafaring and fishing were together the mainstay of the economy, until the\ndevelopment of Japanese cultured pearls and the discovery of commercial\nquantities of oil. Previous UAE President Zayed Bin Sultan Al Nahyan is\ncredited with bringing the country forward into the 20th century and using the\nrevenue from oil exports to fund all the necessary development. Likewise,\nformer UAE vice-president Rashid bin Saeed Al Maktoum had a bold vision for\nthe Emirate of Dubai and foresaw the future in not petroleum alone, but also\nother industries.\n\nIn the 1980s, Dubai's diversification centred around trade and the creation of\nshipping and logistics centres, notably Port Rashid and the port and Free Zone\nof Jebel Ali as well as Dubai International Airport, leading to a number of\nmajor global plays in shipping, transportation and logistics (DP World,\nEmirates, DNATA).",
    "openai_summarised_points": [
      "• Prior to the United Arab Emirates' independence from the United Kingdom and its unification in 1971, each emirate managed its own economy independently.",
      "• The primary economic activities before unification were pearl diving, seafaring, and fishing, which collectively formed the mainstay of the economy.",
      "• The traditional pearl diving industry declined due to the development of Japanese cultured pearls and the discovery of commercially viable oil reserves.",
      "• Sheikh Zayed Bin Sultan Al Nahyan, the former President of the UAE, is credited with modernizing the country in the 20th century by utilizing oil export revenues to finance essential national development projects.",
      "• Rashid bin Saeed Al Maktoum, the former Vice-President of the UAE, envisioned economic growth beyond petroleum, emphasizing diversification into various other industries for the Emirate of Dubai.",
      "• During the 1980s, Dubai’s economic diversification focused on trade and the establishment of major shipping and logistics hubs, including Port Rashid, the port and Free Zone of Jebel Ali, and Dubai International Airport.",
      "• This strategic development led to the emergence of significant global companies in shipping, transportation, and logistics, such as DP World, Emirates airline, and DNATA."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:20.022650",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1013,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "2008-present",
    "text": "The emergence of Dubai's lively real estate market was briefly stopped by the\n2008 financial crisis, when Dubai was bailed out by Abu Dhabi. The recovery\nfrom the overheated market led to tighter regulation and oversight and a more\nrealistic market for real estate throughout the UAE with many 'on hold'\nprojects restarting. Although the market continues to expand, current market\nconditions for developers have been characterised as 'tough'.\n\nAs a result of the COVID-19 pandemic in the United Arab Emirates, the UAE’s\neconomy shrank by 6.1% in 2020. The country’s account balance dropped to six\nper cent of GDP in 2020 from 8.5 per cent in 2019 due to the underperformance\nof both hydrocarbon and non-hydrocarbon exports mitigated by lower imports.\n\nIn late 2021, the authority announced that UAE’s banking assets are expected\nto grow by between 8 per cent and 10 per cent in 2022 as the second-biggest\nArab economy continues to recover from the covid-19 pandemic. It was also\nannounced the UAE’s economy might grow at a faster than projected rate,\nreaching 4.6% in 2022.",
    "openai_summarised_points": [
      "• The 2008 financial crisis temporarily halted the rapid growth of Dubai's real estate market, necessitating a bailout from Abu Dhabi to stabilize the situation.",
      "• Following the crisis, the recovery phase involved implementing tighter regulation and oversight across the UAE’s real estate sector, resulting in a more realistic and sustainable market environment.",
      "• Numerous real estate projects that had been put 'on hold' during the crisis were restarted as the market stabilized and expanded.",
      "• Despite ongoing expansion, current market conditions for real estate developers in the UAE have been described as 'tough,' indicating challenges remain in the sector.",
      "• The COVID-19 pandemic caused a significant contraction in the UAE’s economy, with a 6.1% shrinkage recorded in 2020.",
      "• The country’s account balance declined from 8.5% of GDP in 2019 to 6% of GDP in 2020, reflecting reduced performance in both hydrocarbon and non-hydrocarbon exports.",
      "• This decline in exports was partially offset by a reduction in imports, which helped mitigate the overall economic impact.",
      "• In late 2021, UAE authorities projected that banking assets would grow by between 8% and 10% in 2022, signaling recovery momentum in the financial sector.",
      "• The UAE, recognized as the second-biggest Arab economy, was expected to experience economic growth surpassing earlier projections, with a forecasted GDP growth rate of 4.6% in 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:22.276337",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1073,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2024 (with IMF\nestimates between 2022-2028).\n\nYear  | GDP (Bil. US$ nomina) | GDP per capita (US$ nominal) | GDP (Bil. US$, PPP) | GDP per capita (US$, PPP) | GDP growth (real) | Inflation rate  | Government debt (% of GDP)\n---|---|---|---|---|---|---|---\n1980  | 41.7  | 41,312  | 89.3  | 88,437  | -1.8%  | 10.1%  | n/a\n1985  | 38.5  | 27,913  | 111.5  | 80,817  | -2.5%  | 3.5%  | n/a\n1990  | 50.7  | 27,485  | 154.1  | 83,542  | 23.6%  | 0.6%  | n/a\n1995  | 63.4  | 26,309  | 210.5  | 87,310  | 6.6%  | 4.3%  | n/a\n2000  | 103.0  | 34,386  | 307.9  | 102,795  | 12.3%  | 1.3%  | 3.1%\n2005  | 180.6  | 43,984  | 448.3  | 109,162  | 4.9%  | 6.2%  | 4.5%\n2006  | 222.1  | 44,314  | 507.5  | 101,258  | 9.8%  | 9.3%  | 5.1%\n2007  | 257.9  | 41,467  | 537.9  | 86,492  | 3.2%  | 11.1%  | 8.9%\n2008  | 315.5  | 39,073  | 565.8  | 70,075  | 3.2%  | 12.3%  | 8.9%\n2009  | 253.5  | 30,920  | 539.4  | 65,781  | -5.2%  | -4.7%  | 21.1%\n2010  | 300.2  | 36,325  | 574.8  | 69,555  | 5.3%  | 0.9%  | 18.8%\n2011  | 360.8  | 42,987  | 623.1  | 74,235  | 6.2%  | 0.9%  | 20.9%\n2012  | 384.6  | 45,108  | 648.6  | 76,070  | 1.8%  | 0.7%  | 20.7%\n2013  | 400.2  | 46,207  | 664.1  | 76,671  | 5.1%  | 1.1%  | 15.6%\n2014  | 414.1  | 47,064  | 696.8  | 79,192  | 4.2%  | 2.3%  | 13.8%\n2015  | 370.3  | 41,423  | 621.6  | 69,534  | 6.8%  | 4.1%  | 16.1%\n2016  | 369.3  | 40,483  | 619.3  | 67,896  | 5.6%  | 1.6%  | 19.3%\n2017  | 390.5  | 41,972  | 645.5  | 69,377  | 0.7%  | 2.0%  | 21.9%\n2018  | 427.0  | 45,592  | 669.0  | 71,419  | 1.3%  | 3.1%  | 21.3%\n2019  | 418.0  | 43,982  | 687.7  | 72,365  | 1.1%  | -1.9%  | 26.8%\n2020  | 349.5  | 37,649  | 662.3  | 71,347  | -5.0%  | -2.1%  | 41.1%\n2021  | 415.2  | 43,439  | 722.8  | 75,624  | 4.4%  | -0.1%  | 35.9%\n2022  | 507.1  | 52,625  | 834.4  | 86,601  | 7.9%  | 4.8%  | 31.1%\n2023e  | 504.2  | 51,909  | 894.3  | 92,074  | 3.4%  | 1.6%  | 30.9%\n2024e  | 527.8  | 53,916  | 948.0  | 96,846  | 3.5%  | 2.1%  | 30.3%\n2025f  | 550.2  | 55,781  | 1005.0  | 101,885  | 4.2%  | 2.0%  | 30.3%\n2026f  | 577.8  | 58,139  | 1067.7  | 107,437  | 4.3%  | 2.0%  | 30.1%\n2027f  | 609.5  | 60,895  | 1135.3  | 113,431  | 4.4%  | 2.0%  | 29.7%\n2028f  | 645.3  | 64,038  | 1208.3  | 119,905  | 4.5%  | 2.0%  | 29.3%"
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "External trade",
    "text": "Emirati exports in 2006\n\nWith imports totaling $273.5 billion in 2012, UAE passed Saudi Arabia as the\nlargest consumer market in the region. Exports totaled $314 billion, making\nUAE the second largest exporter in the region.\n\nUAE and India are each other's main trading partners, with the latter having\nmany of its citizens working and living in the former. The trade totals over\n$75 billion (AED275.25 billion).\n\nIn 2021, the main export partners of the UAE were India (14.2%), Japan (8.3%),\nChina (mainland) (7.7%), Saudi Arabia (7.5%), Iraq (4.8%), Singapore (4.0%),\nthe European Union (4.0%), Oman (3.8%), Hong Kong (3.4%), and Thailand (3.0%).\n\nThe main import partners in 2012 were China (17.3%), the European Union\n(12.1%), India (9.4%), the United States (5.5%), Saudi Arabia (5.2%), the\nUnited Kingdom (2.8%), Mali (2.7%), Japan (2.6%), Turkey (2.1%), and Vietnam\n(2.0%).",
    "openai_summarised_points": [
      "• In 2012, the United Arab Emirates (UAE) recorded imports totaling $273.5 billion, surpassing Saudi Arabia to become the largest consumer market in the region.",
      "• During the same year, UAE exports amounted to $314 billion, positioning the country as the second largest exporter within the region.",
      "• The UAE and India maintain a significant bilateral trade relationship, with trade volumes exceeding $75 billion (AED 275.25 billion), supported by a large Indian expatriate community living and working in the UAE.",
      "• In 2021, the UAE's primary export partners were India (14.2%), Japan (8.3%), China (mainland) (7.7%), Saudi Arabia (7.5%), Iraq (4.8%), Singapore (4.0%), the European Union (4.0%), Oman (3.8%), Hong Kong (3.4%), and Thailand (3.0%).",
      "• The main import partners of the UAE in 2012 included China (17.3%), the European Union (12.1%), India (9.4%), the United States (5.5%), Saudi Arabia (5.2%), the United Kingdom (2.8%), Mali (2.7%), Japan (2.6%), Turkey (2.1%), and Vietnam (2.0%)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:20.154925",
      "openai_model": "gpt-4.1-mini",
      "content_length": 880,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Diversification of the UAE's economy",
    "text": "Although the UAE has the most diversified economy in the GCC, the UAE's\neconomy remains extremely reliant on oil. With the exception of Dubai, most of\nthe UAE is dependent on oil revenues. Petroleum and natural gas continue to\nplay a central role in the economy, especially in Abu Dhabi. More than 85% of\nthe UAE's economy was based on the oil exports in 2009. While Abu Dhabi and\nother UAE emirates have remained relatively conservative in their approach to\ndiversification, Dubai, which has far smaller oil reserves, was bolder in its\ndiversification policy. In 2011, oil exports accounted for 77% of the UAE's\nstate budget.\n\nDubai suffered from a significant economic crisis in 2007–2010 and was bailed\nout by Abu Dhabi's oil wealth. Dubai's current [when?] prosperity has been\nattributed to Abu Dhabi's petrodollars. In 2014, Dubai owed a total of $142\nbillion in debt. The UAE government has worked towards reducing the economy's\ndependence on oil exports by 2030. Various projects are underway to help\nachieve this, the most recent being the Khalifa Port, opened in the Emirate of\nAbu Dhabi at the end of 2012. The UAE also won the right to host the World\nExpo 2020, which is believed to have a positive effect on future growth,\nalthough there are some skeptics which mention the opposite.\n\nOver the decades, the Emirate of Dubai has started to look for additional\nsources of revenue. High-class tourism and international finance continue to\nbe developed. In line with this initiative, the Dubai International Financial\nCentre was announced, offering 55.5% foreign ownership, no withholding tax,\nfreehold land and office space and a tailor-made financial regulatory system\nwith laws taken from best practice in other leading financial centers, like\nNew York, London, Zürich and Singapore.[_citation needed_] A new stock market\nfor regional companies and other initiatives was announced in DIFC. Dubai has\nalso developed Internet and Media free zones, offering 100% foreign ownership,\nno tax office space for the world's leading ICT and media companies, with the\nlatest communications infrastructure to service them. Many of the world's\nleading companies have now set up branch offices, and even changed\nheadquarters to, there. Recent [when?] liberalization in the property market\nallowing non-citizens to buy freehold land has resulted in a major boom in the\nconstruction and real estate sectors, with several signature developments,\nsuch as the 2 Palm Islands, the World (archipelago), Dubai Marina, Jumeirah\nLake Towers, and a number of other developments, offering villas and high rise\napartments and office space. Emirates (part of the Emirates Group) was formed\nby the Dubai Government in the 1980s and is presently [when?] one of the few\nairlines to witness strong levels of growth. Emirates is also the largest\noperator of the Airbus A380 aircraft. As of 2001[update], budgeted government\nrevenues were about AED 29.7 billion, and expenditures were about AED 22.9\nbillion. In addition, to finding new ways of sustaining the national economy,\nthe UAE has also made progress in installing new, sustainable methods of\ngenerating electricity. This is evidenced by various solar energy initiatives\nat Masdar City and by other renewable energy developments in parts of the\ncountry.\n\nIn addition, the UAE is starting to see the emergence of local manufacturing\nas new source of economic development, examples of significant government-led\ninvestments, such as Strata in the aerospace industry, under Mubadala, are\nsuccessful, while there are also small scale entrepreneurial ventures picking\nup, such as Zarooq Motors in the automotive industry.\n\nIn August 2020, the Barakah nuclear power plant, the first nuclear power plant\nin the Arab world, became operational.\n\nIn its hard push for economic diversification, the UAE had been increasing its\npresence in Africa. One of the areas of interest had been clean energy, for\nwhich Abu Dhabi’s Masdar built infrastructure, including five wind farms in\nSouth Africa, a battery energy storage system in Senegal and solar power\nfacilities in Mauritania. Emirati companies were also investing in fossil\nfuels, where ADNOC purchased 10% stakes in Mozambique’s Rovuma gas basin.\nUAE’s e& also established a foothold in around 12 countries across Africa. The\nEmirati companies also entered the mining sector, where Tahnoun bin Zayed’s\nInternational Holding Company expressed investment interests in mines in\nKenya, Tanzania and Angola. However, certain investments had also been\ncontroversial. Tanzanian authorities were alleged of forcing several Maasai\noff their land for a safari and hunting project of an Emirati firm. A Dubai-\nbased firm, Blue Carbon, signed preliminary agreements in Liberia, Tanzania,\nKenya, Zambia and Zimbabwe, aiming to generate carbon credits. However, it was\naccused of attempting to acquire millions of hectares of African forests in a\ngreenwashing attempt. Meanwhile, DP World also invested around $3bn in Africa,\nand operates ports from Mozambique in the south to Algeria in the north and\nAngola on the Atlantic. The Emirates had also been alleged of controversial\nactions in the war zones in Africa, including in Libya and Sudan.\n\nThe UAE targeted another major milestone in its diversification plans, as it\ngranted a “Commercial Gaming Facility Operator” license to Wynn Resorts in\nOctober 2024. Wynn is developing a $3.9 billion integrated resort, Wynn Al\nMarjan Island, in Ras Al Khaimah, which will also include a 224,000 sq. ft.\ncasino component. Set to open in 2027, the project aims at targeting foreign\ntourists and boosting tourism. Although the UAE established the General\nCommercial Gaming Regulatory Authority (GCGRA) in September 2023, it has no\nlaws that legalize gambling or its tools and machines. Gambling remains a\ncultural taboo and illegal for local citizens. Despite the casino facility\nbeing constructed in the Emirates, project operators and insiders avoided\ntalking publicly about it.",
    "openai_summarised_points": [
      "• The United Arab Emirates (UAE) possesses the most diversified economy within the Gulf Cooperation Council (GCC), yet remains heavily reliant on oil revenues, with most emirates except Dubai dependent on petroleum and natural gas, particularly Abu Dhabi.",
      "• In 2009, over 85% of the UAE's economy was based on oil exports, underscoring the central role of hydrocarbons in the national economy.",
      "• By 2011, oil exports accounted for 77% of the UAE's state budget, reflecting continued fiscal dependence on oil revenues.",
      "• Abu Dhabi and other emirates have adopted relatively conservative approaches to economic diversification, whereas Dubai, possessing far smaller oil reserves, has pursued a bolder diversification strategy.",
      "• Dubai experienced a significant economic crisis between 2007 and 2010 and required financial support from Abu Dhabi's oil wealth to recover; Dubai's subsequent prosperity has been attributed to these \"petrodollars.\"",
      "• As of 2014, Dubai's total debt amounted to $142 billion.",
      "• The UAE government has targeted reducing the economy's dependence on oil exports by the year 2030, implementing various projects to facilitate this transition.",
      "• One notable infrastructure project is the Khalifa Port in Abu Dhabi, which opened at the end of 2012 to support economic diversification efforts.",
      "• The UAE secured the right to host the World Expo 2020, an event anticipated to positively influence future economic growth, although some skepticism exists regarding its impact.",
      "• Dubai has actively sought alternative revenue sources over several decades, focusing on high-class tourism and international finance as key sectors for diversification.",
      "• The Dubai International Financial Centre (DIFC) was established, offering 55.5% foreign ownership, exemption from withholding tax, freehold land and office space, and a bespoke financial regulatory framework modeled on best practices from leading global financial centers such as New York, London, Zürich, and Singapore.",
      "• DIFC initiatives include the creation of a new stock market for regional companies and other financial sector developments.",
      "• Dubai has also developed Internet and Media free zones, providing 100% foreign ownership, tax-free office space, and advanced communications infrastructure to attract leading ICT and media companies worldwide.",
      "• Numerous global companies have established branch offices or relocated headquarters to Dubai due to these favorable conditions.",
      "• Recent liberalization of the property market, allowing non-citizens to purchase freehold land, has triggered a major boom in construction and real estate, exemplified by signature developments such as the two Palm Islands, the World archipelago, Dubai Marina, and Jumeirah Lake Towers, offering villas, high-rise apartments, and office space.",
      "• Emirates airline, formed by the Dubai government in the 1980s and part of the Emirates Group, has experienced strong growth and is the largest operator of the Airbus A380 aircraft.",
      "• As of 2001, the UAE's budgeted government revenues were approximately AED 29.7 billion, with expenditures around AED 22.9 billion.",
      "• The UAE has made progress in adopting sustainable electricity generation methods, demonstrated by solar energy initiatives at Masdar City and other renewable energy projects across the country.",
      "• Local manufacturing is emerging as a new economic development source, with significant government-led investments such as Strata in the aerospace sector under Mubadala, alongside smaller entrepreneurial ventures like Zarooq Motors in the automotive industry.",
      "• In August 2020, the Barakah nuclear power plant became operational, marking the first nuclear power plant in the Arab world.",
      "• As part of its economic diversification strategy, the UAE has increased its presence in Africa, focusing on clean energy projects including five wind farms in South Africa, a battery energy storage system in Senegal, and solar power facilities in Mauritania, developed by Abu Dhabi’s Masdar.",
      "• Emirati companies have also invested in African fossil fuel sectors, with Abu Dhabi National Oil Company (ADNOC) acquiring a 10% stake in Mozambique’s Rovuma gas basin.",
      "• UAE telecommunications company e& has established operations in approximately 12 African countries.",
      "• Emirati investments have extended into African mining, with Tahnoun bin Zayed’s International Holding Company expressing interest in mines located in Kenya, Tanzania, and Angola.",
      "• Some Emirati investments in Africa have been controversial, including allegations that Tanzanian authorities displaced Maasai communities for a safari and hunting project linked to an Emirati firm.",
      "• Dubai-based company Blue Carbon signed preliminary agreements in Liberia, Tanzania, Kenya, Zambia, and Zimbabwe to generate carbon credits but faced accusations of attempting to acquire millions of hectares of African forests as part of a greenwashing effort.",
      "• DP World has invested approximately $3 billion in Africa, operating ports from Mozambique in the south to Algeria in the north and Angola on the Atlantic coast.",
      "• The UAE has faced allegations of controversial involvement in African conflict zones, including Libya and Sudan.",
      "• In October 2024, the UAE granted a “Commercial Gaming Facility Operator” license to Wynn Resorts, which is developing a $3.9 billion integrated resort named Wynn Al Marjan Island in Ras Al Khaimah, featuring a 224,000 square foot casino component.",
      "• The Wynn Al Marjan Island project, scheduled to open in 2027, aims to attract foreign tourists and bolster the tourism sector.",
      "• The UAE established the General Commercial Gaming Regulatory Authority (GCGRA) in September 2023; however, no laws currently legalize gambling or related devices, and gambling remains culturally taboo and illegal for UAE citizens.",
      "• Despite the casino being constructed within the Emirates, project operators and insiders have refrained from public discussion about the facility."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:31.198459",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5985,
      "bullet_points_count": 32
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Foreign trade",
    "text": "Concerning foreign trade, UAE's market is one of the world's most dynamic\nmarkets worldwide, placed among the 16 largest exporters and 20 largest\nimporters of commodities. The top five of the Main Partner Countries of the\nUAE in 2014 are Iran (3.0%), India (2.9%), Saudi Arabia (1.5%), Oman (1.4%)\nand Switzerland (1.2%). As for the top five of UAE suppliers are China (7.4%),\nUnited States (6.4%), India (5.8%), Germany (3.9%) and Japan (3.5%).\n\nUAE's Foreign Trade Indicators  Indicator  | 2010  | 2011  | 2012  | 2013  | 2014\n---|---|---|---|---|---\n**Imports of Goods** _(million USD)_ | 165,000  | 203,000  | 226,000  | 251,000  | 262,000\n**Exports of Goods** _(million USD)_ | 214,000  | 302,000  | 349,000  | 379,000  | 360,000\n**Imports of Services** _(million USD)_ | 41,337  | 55,702  | 62,301  | 66,413  | 70,279\n**Exports of Services** _(million USD)_ | 11,028  | 12,063  | 15,276  | 17,345  | 19,769\n**Imports of Goods and Services** _(Annual % Change)_ | 2.1  | 18.8  | 5.2  | 6.5  | 6.1\n**Exports of Goods and Services** _(Annual % Change)_ | 2.5  | 20.7  | 17.0  | 4.5  | 8.2\n**Imports of Goods and Services** _(in % of GDP)_ | 72.2  | 72.3  | 75.3  | 76.8  | 77.9\n**Exports of Goods and Services** _(in % of GDP)_ | 78.8  | 90.3  | 100.6  | 101.3  | 98.0\n\nIn 2014, the United Arab Emirates managed to export 380.4bn dominated by four\nproducts which are [1] (19.8%) Diamonds, whether or not worked, but not\nmounted... (3.4%) Gold in UAE(3.2%) incl. gold plated with platinum,\nunwrought...Articles of jewellery and parts thereof, of...(2.8%). In the same\nyear, the United Arab Emirates imported 298.6 bn dominated by five countries\nwhich are China (7.4%), United States (6.4%), India (5.8%), Germany (3.9%),\nJapan (3.5%).\n\nOn one hand, the United Arab Emirates managed in 2013 to export 17 bn USD\nservices exported in 2013 dominated by travel (67.13%), transportation\n(28.13%), Government services (4.74%). On the other hand, it imported 63.9 bn\nUSD of services imported services dominated by transportation (70.68%), travel\n(27.70%) and government services (1.62%).\n\nIn September 2021, the UAE announced its plans to aggravate its trade ties\nwith other economies, particularly in Asia and Africa. The country indicated\nthat it was looking for inward foreign investments of around $150 billion in\nthe next nine years, that is, by 2030. The Emirates aimed to be one of the\nworld’s ten biggest investment nations. However, it had to face strong\ncompetition from its neighbor, Saudi Arabia, creating a broader gap in the\nonce-assumed alliance between the two countries. The Emirati minister of state\nfor foreign trade said, \"Let the Saudis increase the competition. It means the\npie is going to be bigger and having a bigger pie means that the UAE share out\nof this pie is going to be bigger.\"\n\nThe EU identified that the Emirati firms were involved in direct trade of\nweapon components to Russia. The EU sanctions targeted two UAE-based\ncompanies, I Jet Global and Success Aviation Services, which were exporting\ndual-use goods. The EU warned that countries that will be used for Russia’s\nbenefit could face a total ban on imports from the EU military and high tech\nkit. Besides, a trade war with UAE was expected, if it continued trade with\nRussia.\n\nThe United Arab Emirates has introduced significant changes to its regulations\nconcerning the promotion and distribution of foreign investment funds within\nthe country. As part of these changes, encapsulated in several decisions by\nthe Securities and Commodities Authority, is that foreign-owned funds can no\nlonger directly advertise or distribute units publicly in the UAE. Instead,\nthese activities are confined to private distribution aimed at Professional\nInvestors and/or Market Counterparties. This shift signifies a strategic move\nto tighten the circumstances under which foreign funds can interact with UAE-\nbased investors, particularly Retail Customers and Professional Investors,\nunderscoring a push towards a more regulated investment environment.\n\nThese regulatory updates have also led to changes in the distribution to\nProfessional Investors, as they are now no longer exempt under the Securities\nand Commodities Authority Rulebook. Only firms licensed by the SCA to conduct\nthe regulated activity of \"Promotion\" are now permitted to promote such funds,\nand only on a private placement basis. Furthermore, the promotion or\ndistribution of foreign funds to retail investors is outright prohibited,\nalthough reverse solicitation from retail investors is not prohibited in\nitself. All foreign funds to be distributed in the UAE must be registered with\nthe SCA, barring those that can prove documented reverse solicitation.\n\nThree Emirati companies were found involved in trade of Iranian petroleum or\npetrochemical products, and were sanctioned by the US State Department in June\n2024. One of the companies was Sea Route Ship Management FZE, which engaged in\ntransport of Iranian petrochemical products as the commercial manager of the\nvessel ASTRA. The other two firms, Almanac Ship Management LLC and Al Anchor\nShip Management FZE were involved in transport of Iranian petroleum products\nas the commercial manager of the vessels BERENICE PRIDE and PARINE\nrespectively.\n\nIn July 2024, Samco Petroleum Energy FZE, located in Hamriyah Free Zone, was\nput up for sale for $17.7 million, with a promise to provide a turnkey oil\ntrading operation. The sale emerged amidst the US sanctions imposed on several\noil traders in the UAE's free trade zones, particularly Hamriyah, for\ncontinuing business with Iran and Russia. In November 2023, OFAC sanctioned a\ndozen companies in various UAE’s free zones for facilitating the sale of\nIranian products in third countries through Sepehr Energy, which is affiliated\nwith Iran's Armed Forces General Staff. In March 2023, more companies\noperating in the UAE were sanctioned for exporting petrochemical products from\nIran’s Persian Gulf Petrochemical Industries to India and Southeast Asia. The\nEmirati authorities were also pushed to halt Russian imports and exports via\nDubai.\n\nIn September 2024, the UAE and Australia agreed on a free trade deal, which\nwas expected to increase investment in Australia’s significant mineral and\nclean energy sectors. The deal was to eliminate tariffs on imports of over 99%\nof Australian goods. However, Australian unions criticized the deal,\nhighlighting the UAE's poor human rights and labor record, including modern\nslavery under the kafala system. Michele O'Neil also expressed concerns\nregarding the exploitation of migrant workers in the UAE, calling it one of\nthe most repressive regimes with which Australia has entered into a bilateral\ntrade deal."
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Human Resources and Employment",
    "text": "Many buildings were built primarily by workers from South Asia and East Asia.\nThis is generally because the current generation of UAE locals prefer\ngovernmental jobs and not private sector employment. On 17 June 2008, there\nwere about 7,500 skilled workers employed at the Burj Khalifa construction\nsite. Press reports indicated in 2006 that skilled carpenters at the site\nearned £4.34 a day, and labourers earned £2.84. According to a BBC\ninvestigation and a Human Rights Watch report, the workers were housed in\nabysmal conditions, and worked long hours for low pay. During construction,\nonly one construction-related death was reported. However, workplace injuries\nand fatalities in the UAE are \"poorly documented\", according to Human Rights\nWatch.\n\nIn March 2006 about 2,500 workers, upset over buses that were delayed for the\nend of their shifts, protested and triggered a riot, damaging cars, offices,\ncomputers and construction equipment. A Dubai Interior Ministry official said\nthe rioters caused almost £500,000 in damage. Most of the workers involved in\nthe riot returned the following day but refused to work. Workers at Dubai\nairport also protested.",
    "openai_summarised_points": [
      "• Many buildings in the United Arab Emirates were constructed primarily by workers from South Asia and East Asia, reflecting the preference of the current generation of UAE nationals for governmental jobs over private sector employment.",
      "• On 17 June 2008, approximately 7,500 skilled workers were employed at the Burj Khalifa construction site.",
      "• Press reports from 2006 indicated that skilled carpenters at the Burj Khalifa site earned £4.34 per day, while laborers earned £2.84 per day.",
      "• A BBC investigation and a Human Rights Watch report highlighted that these workers were housed in abysmal conditions and endured long working hours for low pay.",
      "• During the construction of the Burj Khalifa, only one construction-related death was officially reported; however, Human Rights Watch noted that workplace injuries and fatalities in the UAE are \"poorly documented.\"",
      "• In March 2006, about 2,500 workers protested due to delays in buses at the end of their shifts, which escalated into a riot causing damage to cars, offices, computers, and construction equipment.",
      "• A Dubai Interior Ministry official estimated that the riot caused nearly £500,000 in damages.",
      "• Most workers involved in the March 2006 riot returned to the site the following day but refused to work.",
      "• Workers at Dubai airport also engaged in protests during this period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:27.308715",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1161,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Emiratisation",
    "text": "Two blue-collar workers posing for a picture with Burj Khalifa on the\nbackground\n\nEmiratisation is an initiative by the government of the UAE to employ more UAE\nNationals in a meaningful and efficient manner in the public and private\nsectors. While the program has been in place for more than a decade and\nresults can be seen in the public sector, the private sector is still lagging\nbehind with citizens only representing 0.34% of the private sector workforce.\n\nWhile there is general agreement over the importance of Emiratisation for\nsocial, economic and political reasons, there is also some contention as to\nthe impact of localization on organizational efficiency. It is yet unknown\nwhether, and the extent to which, employment of nationals generates returns\nfor MNEs operating in the Middle East. Recent research cautions that\nlocalization is not always advantageous for firms operating in the region, and\nits effectiveness depends on a number of contingent factors.\n\nIn December 2009 however, a positive impact of UAE citizens in the workplace\nwas identified in a newspaper article citing a yet unpublished study, this\nadvantage being the use of networks within the evolving power structures.\n\nOverall, however, uptake in the private sector remains low regardless of\nsignificant investments in education, which have reached record levels with\neducation now accounting for 22.5% – or $2.6 billion – of the overall budget\nplanned for 2010. Multiple governmental initiatives are actively promoting\nEmiratisation by training anyone from high school dropouts to graduates in a\nmultitude of skills needed for the – essentially Western – work environment of\nthe UAE, these initiatives include Tawteen UAE, ENDP or the Abu Dhabi Tawteen\nCouncil.\n\nThere are very few anti-discrimination laws in relation to labour issues, with\nEmiratis – and other GCC nationals – being given preference when it comes to\nemployment. Unions are generally banned and workers with any labour issues are\nadvised to be in touch with the Ministry of Labour, instead of protesting or\nrefusing to work. Migrant employees often complain of poor workplace safety\nand wages based on nationality, although this is being slowly addressed.\n\nBeyond directly sponsoring educational initiatives, the Emirates Foundation\nfor Philanthropy is funding major research initiatives into Emiratisation\nthrough competitive research grants, allowing universities such as United Arab\nEmirates University or Dubai School of Government to build and disseminate\nexpertise on the topic.\n\nAcademics working on various aspects of Emiratisation include _Paul Dyer_[12]\nand _Natasha Ridge_ from Dubai School of Government, _Ingo Forstenlechner_[13]\nfrom United Arab Emirates University, _Kasim Randaree_ from the British\nUniversity of Dubai and Paul Knoglinger from the FHWien.\n\nIn 2020, economy of the United Arab Emirates became vulnerable to the COVID-19\npandemic, witnessing an economic shutdown. Among the Emirates, Dubai was\nfacing extreme situation, where the expat workers were left jobless. Thousands\nof the Britons working in the city started selling off their possessions to\ncollect money, as the strict visa regulations forced them to return to the UK.\n\nAccording to an April 2021 report published by the Democracy Centre for\nTransparency on the _Discrimination against foreigners and expatriates living\nin the UAE versus Emirati citizens_ , despite labor reforms in the UAE,\nforeigners and skilled or unskilled migrant workers face discrimination and\nracialization[_clarification needed_] from the citizens of the country.\nForeigners and expatriates are often subjected to discrimination at work\nconcerning promotions and wages, or gender inequality. The findings of the DCT\nconcern the organization as the UAE’s economy largely relies on foreign\nworkers and thus fulfills a crucial international role. The organization\ndemands that the UAE abide by universal human rights principles.\n\nThe 31st edition of World Report 2021 released by Human Rights Watch\nreiterates that labour abuses driven by an exploitative kafala system are\npersistent in the UAE. During the Covid-19 pandemic, migrant workers faced\nmassive unemployment issues and were also left stranded in dire conditions\nwithout legal residencies. Also, many migrants suffered wage theft and were\nunable to pay rent or buy food.",
    "openai_summarised_points": [
      "• Emiratisation is a government initiative in the United Arab Emirates (UAE) aimed at increasing the employment of UAE Nationals in both the public and private sectors in a meaningful and efficient manner.",
      "• The Emiratisation program has been in place for over a decade, showing visible results in the public sector; however, the private sector remains significantly behind, with UAE Nationals constituting only 0.34% of the private sector workforce.",
      "• There is broad consensus on the social, economic, and political importance of Emiratisation, but debate exists regarding its impact on organizational efficiency, particularly within multinational enterprises (MNEs) operating in the Middle East.",
      "• Recent research indicates that localization through Emiratisation is not universally beneficial for firms and that its effectiveness depends on various contingent factors specific to the organizational and regional context.",
      "• In December 2009, a newspaper article cited an unpublished study identifying a positive impact of UAE citizens in the workplace, specifically highlighting their advantageous use of networks within evolving power structures.",
      "• Despite substantial investments in education, uptake of Emiratisation in the private sector remains low; education expenditures reached record levels in 2010, accounting for 22.5% of the overall budget or $2.6 billion.",
      "• Multiple governmental initiatives actively promote Emiratisation by providing training across a wide range of skills for individuals from high school dropouts to university graduates, tailored to the predominantly Western work environment of the UAE; notable programs include Tawteen UAE, ENDP, and the Abu Dhabi Tawteen Council.",
      "• The UAE has very limited anti-discrimination labor laws, with Emiratis and other Gulf Cooperation Council (GCC) nationals receiving employment preference; labor unions are generally banned, and workers with labor disputes are advised to contact the Ministry of Labour rather than engage in protests or work stoppages.",
      "• Migrant workers frequently report issues such as poor workplace safety and wage disparities based on nationality, although these concerns are gradually being addressed by authorities.",
      "• The Emirates Foundation for Philanthropy supports Emiratisation by funding major research initiatives through competitive grants, enabling academic institutions such as United Arab Emirates University and Dubai School of Government to develop and disseminate expertise on the subject.",
      "• Key academics researching Emiratisation include Paul Dyer and Natasha Ridge from Dubai School of Government, Ingo Forstenlechner from United Arab Emirates University, Kasim Randaree from the British University of Dubai, and Paul Knoglinger from FHWien.",
      "• In 2020, the UAE economy became vulnerable due to the COVID-19 pandemic, resulting in an economic shutdown; Dubai was particularly affected, with many expatriate workers losing their jobs and British expatriates reportedly selling possessions to raise funds amid strict visa regulations forcing repatriation.",
      "• An April 2021 report by the Democracy Centre for Transparency (DCT) on discrimination against foreigners and expatriates in the UAE highlighted ongoing discrimination and racialization against migrant workers despite labor reforms, including workplace discrimination related to promotions, wages, and gender inequality.",
      "• The DCT report emphasized concerns about discrimination given the UAE’s heavy reliance on foreign labor, calling for adherence to universal human rights principles in the country.",
      "• The 31st edition of the World Report 2021 by Human Rights Watch reaffirmed persistent labor abuses in the UAE driven by the exploitative kafala system, noting that during the COVID-19 pandemic, migrant workers faced widespread unemployment, were stranded without legal residency, and suffered wage theft, leaving many unable to afford rent or food."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:36.309420",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4344,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Investment",
    "text": "The stock market capitalization of listed companies in the UAE was valued at\n$109.9 billion in October 2012 by Bloomberg.",
    "openai_summarised_points": [
      "• The stock market capitalization of listed companies in the United Arab Emirates was valued at $109.9 billion as of October 2012, according to data reported by Bloomberg."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:25.959740",
      "openai_model": "gpt-4.1-mini",
      "content_length": 121,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Outward investment",
    "text": "A investment institutions were created by the government to promote manage\ninvestments made by the UAE abroad:\n\nAbu Dhabi Investment Authority (ADIA)\n\n* Abu Dhabi Investment Council (ADIC)\n* Mubadala Development Company (MDC)\n* International Petroleum Investment Company (IPIC)\n* Dubai World\n* Dubai International Capital (DIC)",
    "openai_summarised_points": [
      "• The government of the United Arab Emirates established several investment institutions to promote and manage investments made by the UAE abroad.",
      "• The Abu Dhabi Investment Authority (ADIA) is one of the key government investment institutions responsible for managing UAE's overseas investments.",
      "• The Abu Dhabi Investment Council (ADIC) is another government entity created to oversee and promote UAE investments internationally.",
      "• Mubadala Development Company (MDC) functions as a government investment institution aimed at managing and expanding the UAE's foreign investment portfolio.",
      "• The International Petroleum Investment Company (IPIC) is a government-established institution focused on investing in international petroleum and energy sectors.",
      "• Dubai World is a government-owned investment company involved in managing and promoting UAE investments abroad.",
      "• Dubai International Capital (DIC) is a government investment institution dedicated to managing international investments on behalf of the UAE."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:29.680481",
      "openai_model": "gpt-4.1-mini",
      "content_length": 327,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Inward investment",
    "text": "The UAE is in the 17th position in term of the Global Competitiveness Index\n(GCI). The report says that the UAE competitiveness stems from \"high quality\n[...] infrastructure\" and \"highly efficient good markets.\"",
    "openai_summarised_points": [
      "• The United Arab Emirates (UAE) ranks 17th globally according to the Global Competitiveness Index (GCI).",
      "• The GCI report attributes the UAE's competitiveness primarily to its \"high quality infrastructure.\"",
      "• Additionally, the report highlights the presence of \"highly efficient goods markets\" as a key factor contributing to the UAE's competitive standing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:29.546779",
      "openai_model": "gpt-4.1-mini",
      "content_length": 211,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Corporate Governance Code",
    "text": "The Securities and Commodities Authority (SCA) introduced a new corporate\ngovernance regulation (the Corporate Governance Code), which applies to all\njoint stock companies and institutions whose securities are listed on Dubai\nFinancial Market (DFM) and Abu Dhabi Securities Exchange (ADX) in 2009.",
    "openai_summarised_points": [
      "• In 2009, the Securities and Commodities Authority (SCA) of the United Arab Emirates introduced a new corporate governance regulation known as the Corporate Governance Code.",
      "• The Corporate Governance Code applies specifically to all joint stock companies and institutions whose securities are listed on the Dubai Financial Market (DFM) and the Abu Dhabi Securities Exchange (ADX).",
      "• This regulation was established to enhance transparency, accountability, and governance standards within publicly listed companies in the UAE financial markets."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:32.004018",
      "openai_model": "gpt-4.1-mini",
      "content_length": 297,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Banking",
    "text": "On 19 June 2020, rating agency Moody's changed its outlook regarding eight\nbanks in the United Arab Emirates from stable to negative. The change was due\nto \"the potential material weakening in their standalone credit profiles\",\nwhere the UAE's economy was facing additional challenges amidst the COVID-19\npandemic and low oil prices. The eight banks included Abu Dhabi Commercial\nBank, Emirates NBD, HSBC Bank Middle East, Dubai Islamic Bank, Abu Dhabi\nIslamic Bank, National Bank of Fujairah, National Bank of Ras al-Khaimah and\nMashreq Bank.\n\nThe Fitch Ratings in its 22 June 2020 report predicted that the Standalone\nCredit Profiles of UAE-based banks are to possibly weaken in the following\nyear due to the COVID-19 pandemic and oil price collapse. As per the Fitch\nreport, despite the implementation of timely measures for supporting the\neconomy, the profitability of banks in the UAE are prone to get affected by a\nlower non-interest income worsened by a controlled business volume, lower\ninterest rates, and higher loan recovery charges. In addition, the asset\nquality is expected to weaken, too, following the unbearable impact of the\neconomic downturn that all borrowers may not be able to withstand.",
    "openai_summarised_points": [
      "• On 19 June 2020, Moody's rating agency revised the outlook for eight banks in the United Arab Emirates from stable to negative due to concerns over \"the potential material weakening in their standalone credit profiles.\"",
      "• The negative outlook change by Moody's was attributed to the UAE economy facing additional challenges amid the COVID-19 pandemic and persistently low oil prices.",
      "• The eight banks affected by Moody's outlook downgrade included Abu Dhabi Commercial Bank, Emirates NBD, HSBC Bank Middle East, Dubai Islamic Bank, Abu Dhabi Islamic Bank, National Bank of Fujairah, National Bank of Ras al-Khaimah, and Mashreq Bank.",
      "• Fitch Ratings, in its report dated 22 June 2020, forecasted a possible weakening of the Standalone Credit Profiles of UAE-based banks over the following year due to the combined effects of the COVID-19 pandemic and the collapse in oil prices.",
      "• According to Fitch, despite the implementation of timely economic support measures, UAE banks’ profitability was expected to be adversely impacted by lower non-interest income, which was further exacerbated by controlled business volumes, reduced interest rates, and increased loan recovery charges.",
      "• Fitch also anticipated a deterioration in asset quality among UAE banks, driven by the severe economic downturn that could render some borrowers unable to meet their financial obligations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:36.318634",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1209,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Real estate",
    "text": "Dubai International Financial Center\n\nThe development in the real estate and infrastructure sectors during the\nrecent year has contributed in making the country a global touristic\ndestination. The contribution of tourism in the Emirati GDP increased from 3%\nin the mid-1990s to more than 16.5% by the end of 2010. This trend is\nsupported by the huge public investments in touristic projects (47 Billion\nDollars per annum) carried mainly to expend airports, increase their capacity,\nset up new airports and ports.\n\nThe real estate sector have a positive impact on development, job\nopportunities, investments and tourism as estate projects were launched to\nmeet the needs of market and the increasing demand for housing and commercial\nunits especially in Dubai and Abu Dhabi.\n\nThe UAE has about 37% of the region's petroleum and gas industries, chemical\nindustries, energy and water and garbage projects. The UAE's government have\nbeen injecting huge funds in tourism and real estate projects, especially in\nAbu Dhabi and Dubai. Al Saadiyat Island in Abu Dhabi and Burj Khalifa in\nDubai, the tallest tower in the world, world central near \"Jebel Ali\" are a\npoint in case of the milestones that have given the UAE its high profile of a\nglobal tourist destination. According to 2013–2014 Global Competitiveness\nReport, the UAE ranked fourth worldwide in terms of infrastructure quality.\n\nOn 28 November 2020, the Abu Dhabi Media Office announced that the government\nof United Arab Emirates, ahead of the 49th National Day, granted house loans,\nland and homes worth $2 billion (7.2 billion dirhams) to their citizens. The\npackage is said to consist 3,099 plots, 2,000 house loans and 601 homes and\nexempting some families of the deceased citizens and retirees from the\nrepayment of mortgage. The Director General of the Abu Dhabi Housing Society,\nBasheer Al Mehairbi said the initiative of providing sustainable housing aimed\nat ensuring a good standard of living for the citizens of the UAE."
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "11.1",
    "section_name": "Real-estate projects",
    "text": "Some of the significant real-estate projects are:\n\n* Burj Khalifa\n* Creek Tower\n* Mohammed bin Rashid City\n* Falcon City of Wonders\n* International City\n* Dubai Marina\n* Jumeirah Beach Residence\n* Jumeirah Lakes Towers (JLT)\n* Business Bay\n* Dubai Hills\n* Dubai South\n* City Walk\n* Al Furjan\n* Dubai Sports City\n* Dubai Motor City\n* Saadiyat Island\n* The World, the Palms and the Palm (artificial islands)\n* Dubai Miracle Garden, the world's largest natural flower garden.\n* Masdar City, a zero carbon, zero waste city.\n* Yas Island, in Abu Dhabi, featuring attractions such as Ferrari World,\n* Yas Marina"
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Financial centers",
    "text": "Among the most prominent financial centers in the UAE are:\n\n* Dubai International Financial Center (DIFC), a Dubai-based federal financial free zone\n* Abu Dhabi Global Market (ADGM), an international financial centre located on Al Maryah Island",
    "openai_summarised_points": [
      "• The United Arab Emirates hosts several prominent financial centers that play a critical role in its economy.",
      "• The Dubai International Financial Center (DIFC) is a major financial free zone based in Dubai, operating under federal jurisdiction.",
      "• The DIFC serves as a hub for financial services and institutions, contributing significantly to Dubai's status as a global financial center.",
      "• The Abu Dhabi Global Market (ADGM) is another key international financial center situated on Al Maryah Island in Abu Dhabi.",
      "• ADGM functions as a financial free zone, facilitating international financial activities and enhancing Abu Dhabi's economic diversification efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:39.581226",
      "openai_model": "gpt-4.1-mini",
      "content_length": 244,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the United Arab Emirates",
    "chapter_id": "1",
    "section_number": "13",
    "section_name": "Regional GDP",
    "text": "Data shown are for the year 2023 in nominal numbers.\n\nEmirate | GDP (billion US$)  | GDP per capita (US$)\n---|---|---\nAbu Dhabi | 219.1 | 65,700\nAjman | 10.9 | 22,600\nDubai | 138.1 | 44,600\nFujairah | 6.8 | 23,500\nRas Al Khaimah | 14.3 | 30,700\nSharjah | 56.1 | 32,100\nUmm Al Quwain | 0.7 | 7,700\n**United Arab Emirates** | **446.0** | **48,000**",
    "openai_summarised_points": [
      "• In 2023, the nominal Gross Domestic Product (GDP) of the United Arab Emirates (UAE) totaled 446.0 billion US dollars, with a GDP per capita of 48,000 US dollars.",
      "• Abu Dhabi, the largest emirate by GDP, recorded a nominal GDP of 219.1 billion US dollars and a GDP per capita of 65,700 US dollars in 2023.",
      "• Dubai’s economy contributed 138.1 billion US dollars to the UAE’s GDP in 2023, with a GDP per capita of 44,600 US dollars.",
      "• Sharjah’s nominal GDP was 56.1 billion US dollars in 2023, accompanied by a GDP per capita of 32,100 US dollars.",
      "• Ras Al Khaimah had a GDP of 14.3 billion US dollars in 2023, with a GDP per capita of 30,700 US dollars.",
      "• Ajman’s economy contributed 10.9 billion US dollars to the UAE’s GDP in 2023, with a GDP per capita of 22,600 US dollars.",
      "• Fujairah recorded a nominal GDP of 6.8 billion US dollars in 2023, with a GDP per capita of 23,500 US dollars.",
      "• Umm Al Quwain had the smallest GDP among the emirates in 2023, at 0.7 billion US dollars, and a GDP per capita of 7,700 US dollars."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:16:41.834733",
      "openai_model": "gpt-4.1-mini",
      "content_length": 346,
      "bullet_points_count": 8
    }
  }
]