[
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Peru** is an emerging, mixed economy characterized by a high\nlevel of foreign trade and an upper middle income economy as classified by the\nWorld Bank. Peru has the forty-seventh largest economy in the world by total\nGDP and currently experiences a high human development index. The country was\none of the world's fastest-growing economies in 2012, with a GDP growth rate\nof 6.3%. The economy was expected to increase 9.3% in 2021, in a rebound from\nthe COVID-19 pandemic in Peru. Peru has signed a number of free trade\nagreements with its main trade partners. China became the nation's largest\ntrading partner following the China–Peru Free Trade Agreement signed on 28\nApril 2009. Additional free trade agreements have been signed with the United\nStates in 2006, Japan in 2011 and the European Union in 2012. Trade and\nindustry are centralized in Lima while agricultural exports have led to\nregional development within the nation.\n\nPeru's economy is dependent on commodity exports, making it vulnerable to\nprice volatility in international markets. The Government of Peru has\nhistorically shown limited involvement in the public sector, as the economy\nhas often relied on commodity booms. The extraction of these commodities has\nled to conflicts within the country due to their environmental and social\nimpacts.\n\nFollowing the independence of Peru from the Spanish Empire, the economic elite\nfocused their power on the coastal regions through _centralismo_ , while the\nrural provinces were governed by existing serfdom practices by _hacienda_\nlandowners. This model essentially continued until 1968 when General Juan\nVelasco Alvarado took power, leading a dictatorship that increased social\nspending and removing the power of landowners, which resulted with a power\nvacuum in the 1970s that saw the rise of communist guerilla group Shining\nPath. Beginning in the 1980s, Peru faced economic difficulties as a result of\nthe early 1980s recession and the internal conflict in Peru during its Lost\nDecade. The government of Alan García enacted price controls that resulted in\nhyperinflation. In response, the armed forces of Peru drafted Plan Verde, an\noperation to create a neoliberal, open market economy. This was reportedly\nexecuted by the government of Alberto Fujimori, beside prescriptions from\neconomist Hernando de Soto, during a period known as \"Fujishock\". During this\nshock, price controls were discontinued, the privatization of state-run\norganizations occurred and the promotion of foreign investments happened\nthrough the removal of regulations. The economic measures of the Fujimori\nadministration made the country macro-economically stable.\n\nDevelopment in Peru increased following the 2000s commodities boom while\ngovernment finances, poverty reduction and progress in social sectors\nimproved. The nation has more recently adopted the Lima Consensus, an economic\nideology of neoliberalism, deregulation and free market policies that has made\nforeign portfolio investment in Peru attractive. Inflation in 2012 was the\nlowest in Latin America at 1.8%, with the most recent annual rate standing at\n1.9% in 2020. Though statistical poverty has decreased significantly – from\nnearly 60% in 2004 to 20.5% in 2018.\n\nPeruvian economic performance has been tied to exports, which provide hard\ncurrency to finance imports and external debt payments, though in recent\ndecades the economy has begun to diversify. Peru's main exports are copper,\ngold, zinc, textiles, chemicals, pharmaceuticals, manufactures, machinery,\nservices and fish meal. The country's major trade partners are the United\nStates, China, Brazil, the European Union and Chile. Although exports have\nprovided substantial revenue, self-sustained growth and a more egalitarian\ndistribution of income have proven elusive. Services account for 59.9% of\nPeruvian gross domestic product, followed by industry (32.7%) and agriculture\n(7.6%). Recent economic growth has been fueled by macroeconomic stability,\nimproved terms of trade, as well as rising investment and consumption.",
    "openai_summarised_points": [
      "• The economy of Peru is classified by the World Bank as an emerging, mixed economy with an upper middle income status, characterized by a high level of foreign trade.",
      "• Peru ranks as the forty-seventh largest economy globally by total GDP and currently exhibits a high human development index.",
      "• In 2012, Peru was among the world’s fastest-growing economies, achieving a GDP growth rate of 6.3%.",
      "• The economy was projected to grow by 9.3% in 2021, reflecting a rebound from the COVID-19 pandemic’s economic impact.",
      "• Peru has established multiple free trade agreements with key partners, including the China–Peru Free Trade Agreement signed on 28 April 2009, which made China its largest trading partner.",
      "• Additional free trade agreements were signed with the United States in 2006, Japan in 2011, and the European Union in 2012.",
      "• Economic activities such as trade and industry are concentrated in Lima, while agricultural exports have driven regional development across Peru.",
      "• Peru’s economy heavily depends on commodity exports, rendering it vulnerable to international market price volatility.",
      "• Historically, the Peruvian government has maintained limited involvement in the public sector, often relying on commodity booms for economic growth.",
      "• Commodity extraction has caused internal conflicts due to environmental degradation and social impacts.",
      "• After independence from the Spanish Empire, economic power was centralized in coastal regions under a system known as _centralismo_, while rural provinces remained under serfdom-like control by _hacienda_ landowners.",
      "• This socio-economic model persisted until 1968, when General Juan Velasco Alvarado’s dictatorship increased social spending and diminished landowners’ power, creating a power vacuum in the 1970s that facilitated the rise of the communist guerrilla group Shining Path.",
      "• During the 1980s, Peru experienced economic difficulties due to the early 1980s recession and internal conflict, known as the Lost Decade.",
      "• The government of Alan García implemented price controls that led to hyperinflation.",
      "• In response, the Peruvian armed forces developed Plan Verde, aiming to establish a neoliberal, open market economy.",
      "• Plan Verde was reportedly implemented during Alberto Fujimori’s government, influenced by economist Hernando de Soto, in a period called \"Fujishock.\"",
      "• Fujishock involved discontinuing price controls, privatizing state-run organizations, and promoting foreign investment through deregulation.",
      "• These economic reforms under Fujimori’s administration achieved macroeconomic stability in Peru.",
      "• Economic development accelerated following the 2000s commodities boom, with improvements in government finances, poverty reduction, and social sector progress.",
      "• Peru has more recently embraced the Lima Consensus, an economic ideology emphasizing neoliberalism, deregulation, and free market policies, which has attracted foreign portfolio investment.",
      "• Inflation in Peru was the lowest in Latin America at 1.8% in 2012, with a recent annual rate of 1.9% in 2020.",
      "• Statistical poverty rates declined significantly from nearly 60% in 2004 to 20.5% in 2018.",
      "• Peru’s economic performance remains closely tied to exports, which generate hard currency essential for financing imports and external debt payments, though economic diversification has increased in recent decades.",
      "• Peru’s main exports include copper, gold, zinc, textiles, chemicals, pharmaceuticals, manufactured goods, machinery, services, and fish meal.",
      "• The country’s major trade partners are the United States, China, Brazil, the European Union, and Chile.",
      "• Despite substantial export revenues, Peru has struggled to achieve self-sustained economic growth and a more equitable income distribution.",
      "• The services sector accounts for 59.9% of Peru’s gross domestic product, followed by industry at 32.7%, and agriculture at 7.6%.",
      "• Recent economic growth has been driven by macroeconomic stability, improved terms of trade, and increased investment and consumption."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:36.300023",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4061,
      "bullet_points_count": 28
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Historic GDP per capita in Peru"
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Inca Empire",
    "text": "The Tahuantinsuyo (the _Realm of the Four Parts_), popularly known as the Inca\nEmpire, was the largest civilization that emerged from the highlands of Peru\nin the early 13th century. The Spanish conquered the last Inca stronghold in\n1572.\n\nThe Inca Empire employed central planning. Writing about the Inca tax system,\nSpanish chronicler Pedro Cieza de León said \"the system the Incas employed was\nso good that the people did not feel it, and prospered ... [A]ll this was\naccomplished in such orderly fashion that neither did the natives fail to pay\nwhat they owed and were assessed, nor did those who collected these tributes\nventure to take one grain of corn in excess\". Officials would travel to cities\nand provinces where they would be provided quipus storing data, with Inca\nterritories contributing what was possible; whether it be labor (_mit'a_),\ntextiles, food, weapons or construction materials. Regarding labor, provinces\nwould provide men to be employed by the empire who required to be married so\ntheir wives could maintain home life. Citizens were not exposed to overwork as\nindividuals who became ill would be returned and replaced by their home\nprovince while many days of a month were dedicated to recreation and feasts.",
    "openai_summarised_points": [
      "• The Tahuantinsuyo, also known as the Realm of the Four Parts, was the largest civilization to emerge from the highlands of Peru in the early 13th century and is popularly known as the Inca Empire.",
      "• The Spanish conquest culminated in 1572 with the fall of the last Inca stronghold, marking the end of the Inca Empire.",
      "• The Inca Empire utilized a system of central planning to manage its economy and resources efficiently.",
      "• Spanish chronicler Pedro Cieza de León described the Inca tax system as highly effective, noting that the people prospered under it and did not feel burdened by the taxes.",
      "• According to Cieza de León, the Inca tax system was so orderly that natives consistently paid their assessed tributes, and tax collectors never took more than what was owed, not even a single grain of corn in excess.",
      "• Inca officials traveled to cities and provinces equipped with quipus, which were knotted strings used to store and transmit data related to tax assessments and contributions.",
      "• Inca territories contributed various resources to the empire, including labor (known as mit'a), textiles, food, weapons, and construction materials.",
      "• The mit'a labor system required provinces to provide men who were married, ensuring that their wives could maintain household and community life during their absence.",
      "• The Inca labor system was designed to prevent overwork; individuals who became ill during their service were returned to their home provinces and replaced by others.",
      "• The Inca calendar included many days dedicated to recreation and feasts, reflecting a balance between labor obligations and social or religious activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:37.837050",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1236,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Viceroyalty of Peru",
    "text": "_Bozal_ African in Lima, 1805\n\nThe economy of the Viceroyalty of Peru largely depended on the export of\nsilver. The huge amounts of silver exported from the Viceroyalty of Peru and\nMexico deeply affected Europe, where some scholars believe it caused the so-\ncalled price revolution. Silver mining was carried out using contract and free\nwage labourers, as well as the _encomienda_ system of slavery. The\n_encomienda_ has been described as constituting genocide. Under the Spanish\nsystem, Cieza de León wrote that \"with the disorder and greed of the\nSpaniards, the number of the people has fallen off to such a degree that most\nof them have disappeared, and they will be wiped out completely as a result of\nthe covetousness and greed\". Afro-Peruvians also appeared as a result of\nslavery in colonial Spanish America. Silver production peaked in 1610.\n\nPrussian explorer Alexander von Humboldt first encountered guano in 1802 and\nstarted fertilizer research Callao in Peru, with his findings being reported\nthroughout Europe.",
    "openai_summarised_points": [
      "• The economy of the Viceroyalty of Peru was predominantly reliant on the export of silver, which was a major economic driver during the colonial period.",
      "• Large quantities of silver exported from the Viceroyalty of Peru and Mexico had a significant impact on Europe’s economy, with some scholars attributing these exports to the onset of the European price revolution.",
      "• Silver mining operations in the Viceroyalty utilized a combination of labor systems, including contract laborers, free wage laborers, and the _encomienda_ system, which involved forced indigenous labor akin to slavery.",
      "• The _encomienda_ system has been characterized by historians as constituting genocide due to its devastating effects on the indigenous population.",
      "• Spanish chronicler Cieza de León documented the severe demographic decline caused by Spanish exploitation, stating that the indigenous population had diminished drastically and faced potential complete extinction due to Spanish greed and disorder.",
      "• The presence of Afro-Peruvians in colonial Peru resulted from the transatlantic slave trade and the institution of slavery in Spanish America.",
      "• Silver production in the Viceroyalty of Peru reached its peak around the year 1610, marking the height of colonial mining output.",
      "• In 1802, Prussian explorer Alexander von Humboldt discovered guano deposits in Callao, Peru, initiating scientific research into its use as a fertilizer.",
      "• Humboldt’s findings on guano were disseminated throughout Europe, influencing agricultural practices and fertilizer research internationally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:41.112662",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1023,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.1",
    "section_name": "Guano Era",
    "text": "The Chincha Islands, a large source of guano, 1866\n\nAfter winning independence from Spain on 28 July 1821, Peru was financially\nstrapped. Additionally, the economy suffered from the collapse of the silver\nmines. However, the guano trade with Europe, beginning in the 1840s, flooded\nPeru with European investments and money. In 1840, Peruvian politician and\nentrepreneur Francisco Quirós y Ampudia commercialized guano exports in a deal\nwith French businessmen and the Peruvian government, abolishing existing\nclaims to Peruvian guano. Guano was essentially nationalized and became Peru's\nlargest revenue source. Despite the near exhaustion of guano, Peru achieved\nits greatest ever export of guano in 1870, with more than 700,000 tonnes\n(770,000 short tons).",
    "openai_summarised_points": [
      "• Peru gained independence from Spain on 28 July 1821, but subsequently faced significant financial difficulties.",
      "• The Peruvian economy was further weakened by the collapse of its silver mines, a traditional source of wealth.",
      "• Starting in the 1840s, the guano trade with Europe became a major economic driver, attracting substantial European investments and capital into Peru.",
      "• In 1840, Francisco Quirós y Ampudia, a Peruvian politician and entrepreneur, formalized the commercialization of guano exports through an agreement involving French businessmen and the Peruvian government.",
      "• This agreement abolished all existing private claims to Peruvian guano, effectively nationalizing the resource under state control.",
      "• Guano quickly became Peru’s largest source of government revenue, underpinning the national economy during this period.",
      "• Despite concerns about the near exhaustion of guano reserves, Peru reached its highest recorded guano export volume in 1870, exporting over 700,000 tonnes (770,000 short tons).",
      "• The Chincha Islands were a major source of guano during this era, playing a critical role in Peru’s export economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:32.199324",
      "openai_model": "gpt-4.1-mini",
      "content_length": 758,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.2",
    "section_name": "War of the Pacific",
    "text": "Chile was devastated by the Long Depression economic crisis of the 1870s and\nbegan looking for a replacement for its silver, copper and wheat exports. It\nhas been argued that Chile's economic situation and the prospect of new wealth\nin nitrates were the true reasons for the Chilean elite to go to war against\nPeru and Bolivia, with most historians agreeing that the Chilean government's\nexpansionist foreign policy and its ambitions to control Atacama's mineral\nwealth led to the conflict .\n\nChile won the war and with the Treaty of Ancón of 1884, the War of the Pacific\nended. Chile obtained half of Peru's guano income from the 1880s and its guano\nislands, with Chile taking control over the most valuable nitrogen resources\nin the world. Chile's national treasury would increase 900% from 1879 to 1902\ndue to the newly acquired lands. Meanwhile, Peru's reliance on commodity\nexports – which continued through its history – resulted the bankruptcy of its\neconomy. Peru would go on to approve the Grace Contract, which granted\nownership of Peru's railroads to holders of sovereign debt, with the Peruvian\ngovernment not issuing new sovereign debt until 1906.",
    "openai_summarised_points": [
      "• Chile experienced severe economic devastation during the Long Depression of the 1870s, prompting the country to seek alternatives to its traditional exports of silver, copper, and wheat.",
      "• Historians largely agree that Chile's economic difficulties and the potential wealth from nitrate deposits were primary motivations for the Chilean elite to engage in war against Peru and Bolivia.",
      "• The Chilean government's expansionist foreign policy aimed at controlling the mineral-rich Atacama region was a significant factor leading to the War of the Pacific.",
      "• Chile emerged victorious in the War of the Pacific, which officially ended with the signing of the Treaty of Ancón in 1884.",
      "• As a result of the treaty, Chile acquired half of Peru's guano income starting in the 1880s, along with control over Peru’s guano islands, which contained some of the world’s most valuable nitrogen resources.",
      "• The acquisition of these territories and resources caused Chile’s national treasury to increase by 900% between 1879 and 1902.",
      "• In contrast, Peru’s economy, heavily dependent on commodity exports, suffered bankruptcy following the war, continuing a historical pattern of economic vulnerability.",
      "• To address its financial crisis, Peru approved the Grace Contract, which transferred ownership of the country’s railroads to holders of sovereign debt.",
      "• Following the Grace Contract, the Peruvian government refrained from issuing new sovereign debt until the year 1906."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:43.570606",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1160,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.3",
    "section_name": "Amazon rubber boom",
    "text": "Into the twentieth century, Anglo-Peruvian Amazon Rubber Co in Iquitos began\nto market rubber internationally. The rubber boom brought regions of Amazonia\ninto the international market. The Government of Peru ceded to the Anglo-\nPeruvian Amazon Rubber Co the Amazon territories north of Loreto, after the\ncompany's founder Julio César Arana purchased the land. During the rubber boom\nthe Putumayo Genocide was committed by Anglo-Peruvian Amazon Rubber Co.\nBetween 40,000 and 250,000 indigenous peoples were killed, with many being\nsent to labor camps; ninety percent of the affected Amazonian populations were\nannihilated.",
    "openai_summarised_points": [
      "• Into the twentieth century, the Anglo-Peruvian Amazon Rubber Co, based in Iquitos, began marketing rubber on the international market.",
      "• The rubber boom integrated regions of Amazonia into the global economy, significantly increasing international trade in rubber.",
      "• The Government of Peru ceded the Amazon territories north of Loreto to the Anglo-Peruvian Amazon Rubber Co after the company's founder, Julio César Arana, purchased the land.",
      "• During the rubber boom, the Anglo-Peruvian Amazon Rubber Co committed the Putumayo Genocide against indigenous populations.",
      "• Between 40,000 and 250,000 indigenous peoples were killed as a result of the Putumayo Genocide.",
      "• Many indigenous victims were forced into labor camps under brutal conditions during the rubber boom.",
      "• Ninety percent of the affected Amazonian indigenous populations were annihilated due to the violence and exploitation perpetrated by the Anglo-Peruvian Amazon Rubber Co."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:40.088463",
      "openai_model": "gpt-4.1-mini",
      "content_length": 622,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.4",
    "section_name": "World War I and II eras",
    "text": "In the early 1910s, Peru enjoyed a growing economy due to mining and crop\nproduction, with a working class developing at the time. Following the\noutbreak of World War I, international markets became turbulent and Peru\nexperienced a recession and a series of coups occurred through the mid and\nlate-1910s. Augusto B. Leguía, a member of Peru's oligarchy, then took power\nthrough a coup and essentially assumed dictatorial powers, writing a new\nconstitution; Leguía would often ignore the constitution through his acts,\nhowever. Víctor Raúl Haya de la Torre founded the American Popular\nRevolutionary Alliance (APRA) calling for reforms, though Leguía quickly\nbanned the party. Leguía increased spending to modernize Peru, though this\nalso raised national debt and with the addition of the Great Depression in\n1929, he was overthrown soon-after in 1930 by Luis Miguel Sánchez Cerro.\n\nSánchez announced a debt moratorium on US$180 million and Peru was banned from\nmarkets in the United States as a result. The Sánchez government also\ncontinued the repression of APRA, resulting in an Aprista party member\nassassinating Sánchez. Óscar R. Benavides was chosen by the constituent\nassembly to finish Sánchez's term and intensified persecution of left-wing\ngroups, resulting in increased support for the Peruvian Communist Party (PCP)\namong indigenous and labor groups. As Peru's economy grew, a banker in Lima,\nManuel Prado Ugarteche, was elected into the presidency in the 1939 Peruvian\ngeneral election.\n\nPresident Prado adopted a softer tone on APRA while Aprista leader Haya de la\nTorre also espoused more moderate policy and support for foreign markets. APRA\nwas made a legal party in 1945 and in José Luis Bustamante y Rivero was\nelected the same year, making an Aprista politician the Minister of the\nEconomy. Subsequently, the Bustamante greatly increasedeconomic\ninterventionism to include price controls and a foreign exchange controls,\nwhich appeared beside a slowing economy, resulting in increased inflation.",
    "openai_summarised_points": [
      "• In the early 1910s, Peru experienced economic growth driven by mining and crop production, alongside the development of a working class.",
      "• The outbreak of World War I caused turbulence in international markets, leading Peru into a recession and a series of coups throughout the mid to late 1910s.",
      "• Augusto B. Leguía, a member of Peru's oligarchy, seized power through a coup and assumed dictatorial powers, drafting a new constitution which he frequently disregarded in practice.",
      "• Víctor Raúl Haya de la Torre founded the American Popular Revolutionary Alliance (APRA), advocating for reforms; however, Leguía quickly banned the party.",
      "• Leguía increased government spending to modernize Peru, which raised the national debt significantly.",
      "• The onset of the Great Depression in 1929 exacerbated economic difficulties, leading to Leguía’s overthrow in 1930 by Luis Miguel Sánchez Cerro.",
      "• President Sánchez announced a debt moratorium on US$180 million, resulting in Peru being banned from United States markets.",
      "• Sánchez’s government continued repression of APRA, culminating in the assassination of Sánchez by an Aprista party member.",
      "• Óscar R. Benavides was appointed by the constituent assembly to complete Sánchez’s term and intensified persecution of left-wing groups, which increased support for the Peruvian Communist Party (PCP) among indigenous and labor groups.",
      "• As Peru’s economy grew, Manuel Prado Ugarteche, a banker from Lima, was elected president in the 1939 Peruvian general election.",
      "• President Prado adopted a more conciliatory approach toward APRA, while Aprista leader Haya de la Torre promoted moderate policies and support for foreign markets.",
      "• APRA was legalized in 1945, and José Luis Bustamante y Rivero was elected president the same year, appointing an Aprista politician as Minister of the Economy.",
      "• Under Bustamante’s administration, economic interventionism increased significantly, including the implementation of price controls and foreign exchange controls.",
      "• Despite interventionist policies, the economy slowed and inflation increased during Bustamante’s presidency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:36.914569",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2014,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.5",
    "section_name": "Military _juntas_ and first Belaúnde government",
    "text": "Over the next two decades, military _juntas_ controlled Peru. On 29 October\n1948, General Manuel A. Odría led a successful military coup against\nBustamante and assumes the presidency until 1956. Odría's government\nexperienced a growing economy due to a commodity boom, though many of the\ngovernment's investments remained in coastal cities while unrest increased\namong interior and Andean regions that remained impoverished. Haya de la Torre\n– whose APRA party had drifted even more to right-wing politics at this time –\nwon the 1962 Peruvian general election against Fernando Belaúnde, founder of\nthe right-wing Popular Action, though Haya de la Torre was unable to take\noffice due to a military coup opposed to APRA.\n\nAfter a brief military government, Belaúnde won the 1963 Peruvian general\nelection, with his government making modest improvements by increasing\nindustrialization and constructing highways into the Andes. Belaúnde held a\ndoctrine called \"_The Conquest of Peru by Peruvians_ \", which promoted the\nexploitation of resources in the Amazon and other outlying areas of Peru\nthrough conquest. In one 1964 incident called the Matsé genocide, the Belaúnde\nadministration targeted the Matsés after two loggers were killed, with the\nPeruvian armed forces and American fighter planes dropping napalm on the\nindigenous groups armed with bows and arrows, killing hundreds. Belaúnde's\neconomic measures were received with disapproval from rural and peasant\nPeruvians. His government's reliance on resource exports, especially with the\nfishing industry, resulted in increased inflation and a growing deficit. Amid\nthis conflict, general Juan Velasco Alvarado overthrows the Belaúnde in the\n1968 Peruvian coup d'état .",
    "openai_summarised_points": [
      "• Over the two decades following 1948, Peru was predominantly controlled by military juntas, marking a period of military governance in the country’s political landscape.",
      "• On 29 October 1948, General Manuel A. Odría led a successful military coup that ousted President Bustamante and assumed the presidency, ruling until 1956.",
      "• During Odría’s administration, Peru experienced economic growth driven by a commodity boom; however, government investments were largely concentrated in coastal cities.",
      "• Despite economic growth, significant unrest and poverty persisted in the interior and Andean regions, which remained marginalized and impoverished under Odría’s rule.",
      "• Víctor Raúl Haya de la Torre, leader of the American Popular Revolutionary Alliance (APRA) party, which had shifted further to right-wing politics during this period, won the 1962 general election against Fernando Belaúnde, founder of the right-wing Popular Action party.",
      "• Haya de la Torre was prevented from assuming office due to a military coup that opposed APRA’s political influence, leading to a brief period of military government.",
      "• Fernando Belaúnde subsequently won the 1963 general election and became president, initiating modest improvements including increased industrialization and the construction of highways into the Andes region.",
      "• Belaúnde promoted a political and economic doctrine known as \"The Conquest of Peru by Peruvians,\" aimed at exploiting natural resources in the Amazon and other peripheral areas through internal conquest and development.",
      "• In 1964, under Belaúnde’s administration, the Matsé genocide occurred when the government targeted the Matsés indigenous group following the killing of two loggers; Peruvian armed forces, supported by American fighter planes, used napalm against the indigenous people armed only with bows and arrows, resulting in the deaths of hundreds.",
      "• Belaúnde’s economic policies, heavily reliant on resource exports such as the fishing industry, led to increased inflation and a growing fiscal deficit, causing disapproval and unrest among rural and peasant populations.",
      "• The growing economic and social conflicts during Belaúnde’s presidency culminated in the 1968 Peruvian coup d’état, when General Juan Velasco Alvarado overthrew Belaúnde’s government."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:44.290206",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1722,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.6",
    "section_name": "Revolutionary Government of the Armed Forces",
    "text": "Velasco established the Revolutionary Government of the Armed Forces and it\nadopted a state capitalism economic policy amid a period of economic\nexpansion. The government immediately instituted land reform initiatives,\nestablishing one of the most ambitious land tenure projects in the history of\nLatin America. The land reform projects removed the traditional _hacienda_\nsystem that resembled landowners imposing a serfdom on peasants and replaced\nit with agricultural cooperatives called Agricultural Social-Interest\nSocieties (SAIS). The Velasco government took a structural approach; it\ninvested in infrastructure and began a widespread nationalization campaign of\nkey economic production sectors, education and the media. A fixed exchange\nrate system was adopted and the national debt began to increase dramatically.\nA combination of debt, inflation and the 1973 oil crisis induced an economic\ncrisis in the Velasco government, with General Francisco Morales-Bermúdez\noverthrowing Velasco in the Tacnazo.\n\nBermúdez in name led the Second Revolutionary Government of the Armed Forces,\nwith his government introducing austerity measures and removing state\ncapitalist systems. This government began monetary adjustment and started with\nnegotiations on foreign debt. However, corruption scandals and widespread\nprotests broke out and the military government agreed to transition Peru back\ninto a democratic political system.",
    "openai_summarised_points": [
      "• General Juan Velasco Alvarado established the Revolutionary Government of the Armed Forces in Peru, adopting a state capitalism economic policy during a period of economic expansion.",
      "• The Velasco government immediately implemented land reform initiatives, launching one of the most ambitious land tenure projects in Latin American history.",
      "• These land reform projects dismantled the traditional hacienda system, which resembled a form of serfdom imposed by landowners on peasants, and replaced it with agricultural cooperatives known as Agricultural Social-Interest Societies (SAIS).",
      "• Velasco’s government pursued a structural economic approach by investing heavily in infrastructure development and initiating a widespread nationalization campaign targeting key sectors of economic production, education, and the media.",
      "• A fixed exchange rate system was adopted under Velasco’s administration, which coincided with a dramatic increase in Peru’s national debt.",
      "• The combination of rising debt, inflation, and the global 1973 oil crisis precipitated a severe economic crisis during Velasco’s tenure.",
      "• General Francisco Morales-Bermúdez led a coup known as the Tacnazo, overthrowing Velasco and assuming leadership of the government.",
      "• Morales-Bermúdez nominally headed the Second Revolutionary Government of the Armed Forces, which implemented austerity measures and dismantled the state capitalist economic systems established by Velasco.",
      "• The Morales-Bermúdez government initiated monetary adjustments and commenced negotiations concerning Peru’s foreign debt obligations.",
      "• Despite these efforts, the government was plagued by corruption scandals and widespread public protests.",
      "• Facing mounting pressure, the military government under Morales-Bermúdez agreed to transition Peru back to a democratic political system."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:42.650655",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1425,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.7",
    "section_name": "The Lost Decade",
    "text": "In 1980, after twelve years of military rule, Fernando Belaúnde Terry was\nelected president for a second time. On the day of the election, Shining Path\nlaunched its armed struggle in Chuschi with a ballot burning incident,\nessentially beginning the internal conflict in Peru. Belaúnde's used a\nfloating exchange rate and used populist policies, primarily relying on key\nexports. His government continued to reverse Velasco's existing policies and\nsome economic liberalization. However, Belaúnde's government could not develop\na monetary policy, failed at managing state-run entities and faced a growing\nexternal debt, leaving Peru in a vulnerable state.\n\nAlan García was elected president in the 1985 Peruvian general election and\nthe first Aprista president in over sixty years. His administration adopted a\nneo-structuralist economic policy, with the government funding the private\nsector to enhance economic performance, increasing welfare spending and\ninstituting price controls; this resulted with temporary economic growth,\nthough Peru's national debt grew dramatically. By 1989, inflation reached\nalmost 3,000 percent and 7,000 percent in 1990, with Peru experiencing a GDP\nloss of twenty-four percent in the last three years of García's tenure. With\nthe growing economic crisis and the terrorist Shining Path gaining territory\nin an armed conflict with the Peruvian government, the idea of a leader with a\n\"heavy hand\" became more attractive to Peruvians according to Gutiérrez Sanín\nand Schönwälder.\n\nThe Peruvian armed forces grew frustrated with the inability of the García\nadministration to handle the nation's crises and began to draft a plan to\noverthrow his government. According to Peruvian sociologist and political\nanalyst Fernando Rospigliosi, Peru's business elites held relationships with\nthe military planners, with Rospigliosi writing that businesses \"probably\nprovided the economic ideas which [the military] agreed with, the necessity of\na liberal economic program as well as the installment of an authoritarian\ngovernment which would impose order\". Thus, Plan Verde was drafted at the end\nof the García presidency; the objectives evolved into establishing a civilian-\nmilitary government with a neoliberal economic policy.",
    "openai_summarised_points": [
      "• In 1980, after twelve years of military rule in Peru, Fernando Belaúnde Terry was elected president for a second term.",
      "• On the day of the 1980 election, the Shining Path initiated its armed struggle in Chuschi by burning ballots, marking the beginning of Peru's internal conflict.",
      "• Belaúnde's administration implemented a floating exchange rate and pursued populist policies, primarily relying on key exports to drive the economy.",
      "• His government continued to reverse the policies of former leader Juan Velasco Alvarado and introduced some economic liberalization measures.",
      "• Despite these efforts, Belaúnde's government failed to develop an effective monetary policy, mismanaged state-run enterprises, and faced a growing external debt, leaving Peru economically vulnerable.",
      "• In the 1985 general election, Alan García was elected president, becoming the first Aprista leader in over sixty years.",
      "• García’s administration adopted a neo-structuralist economic policy, which involved government funding of the private sector to boost economic performance, increased welfare spending, and the institution of price controls.",
      "• These policies resulted in temporary economic growth but caused a dramatic increase in Peru’s national debt.",
      "• By 1989, inflation in Peru reached nearly 3,000 percent, and it escalated further to 7,000 percent in 1990.",
      "• During the last three years of García’s presidency, Peru experienced a GDP contraction of 24 percent.",
      "• The worsening economic crisis coincided with the Shining Path terrorist group expanding its territorial control amid armed conflict with the government.",
      "• According to scholars Gutiérrez Sanín and Schönwälder, the combination of economic turmoil and insurgency made the idea of a strong, authoritarian leader more appealing to the Peruvian populace.",
      "• The Peruvian armed forces grew increasingly frustrated with García’s inability to manage the country’s crises and began planning to overthrow his government.",
      "• Sociologist and political analyst Fernando Rospigliosi noted that Peru’s business elites maintained connections with the military planners, likely providing economic ideas favoring a liberal economic program and the establishment of an authoritarian government to restore order.",
      "• At the end of García’s presidency, the military drafted Plan Verde, which aimed to establish a civilian-military government implementing neoliberal economic policies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:45.487363",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2248,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.2.8",
    "section_name": "Fujimori government",
    "text": "During his campaigning for the 1990 election, Alberto Fujimori expressed\nconcern against the proposed neoliberal policies of his opponent Mario Vargas\nLlosa. Peruvian magazine _Oiga_ reported that following the election, the\narmed forces were unsure of Fujimori's willingness to fulfill their objectives\noutlined in Plan Verde and it was reported that the meeting held a negotiatory\nmeeting with him to ensure that Fujimori followed their direction. After\ntaking office, Fujimori abandoned the economic platform he promoted during his\ncampaign, adopting more aggressive neoliberal policies than those espoused by\nVargas Llosa, his competitor in the election. Fujimori would go on to adopt\nmany of the policies outlined in Plan Verde. Fujimori ultimately served as\npresident from 28 July 1990 to 17 November 2000.\n\nFujimori is often credited with defeating the Shining Path terrorist group in\nPeru and restoring its macroeconomic stability. Fujimori's economic policy was\nlargely adopted from the advice of Peruvian economist Hernando de Soto, who\nprescribed economic guidelines – including the loosening of economic\nregulation, the introduction of austerity measures and the use of neoliberal\npolicies – that were ultimately adopted by the Fujimori administration and\nestablished in the 1993 Constitution of Peru. Although economic statistics\nshow improved economic data in Peru in recent decades, the wealth earned\nbetween 1990 and 2020 was not distributed throughout the country; living\nstandards showed disparities between the more-developed capital city of Lima\nand similar coastal regions while rural provinces remained impoverished.",
    "openai_summarised_points": [
      "• During the 1990 presidential campaign, Alberto Fujimori expressed opposition to the neoliberal economic policies proposed by his opponent, Mario Vargas Llosa.",
      "• According to the Peruvian magazine _Oiga_, after Fujimori's election victory, the Peruvian armed forces were uncertain about his commitment to fulfilling their objectives as outlined in Plan Verde.",
      "• It was reported that the armed forces held a negotiation meeting with Fujimori to ensure his adherence to their strategic direction as specified in Plan Verde.",
      "• Upon assuming office on 28 July 1990, Fujimori abandoned the economic platform he had promoted during his campaign and instead implemented more aggressive neoliberal policies than those advocated by Vargas Llosa.",
      "• Fujimori adopted many of the economic and political policies outlined in Plan Verde during his presidency.",
      "• Alberto Fujimori served as President of Peru from 28 July 1990 until his resignation on 17 November 2000.",
      "• Fujimori is widely credited with defeating the Shining Path terrorist group, a significant insurgent threat in Peru during his tenure.",
      "• He is also recognized for restoring macroeconomic stability to Peru following a period of economic crisis.",
      "• Fujimori’s economic policies were largely influenced by Peruvian economist Hernando de Soto, who recommended loosening economic regulations, implementing austerity measures, and adopting neoliberal economic reforms.",
      "• The economic guidelines advised by Hernando de Soto were incorporated into the Fujimori administration’s policies and were institutionalized in the 1993 Constitution of Peru.",
      "• Despite improvements in Peru’s overall economic statistics from 1990 to 2020, the wealth generated during this period was unevenly distributed across the country.",
      "• Significant disparities in living standards persisted between the more developed capital city of Lima and other coastal regions compared to the impoverished rural provinces."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:46.023073",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1638,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "21st century",
    "text": "Peru bonds\n\n30 year\n\n20 year\n\n15 year\n\n10 year\n\n5 year\n\n2 year",
    "openai_summarised_points": [
      "• The section on Peru bonds lists government bond maturities available in the 21st century, specifically including 30-year, 20-year, 15-year, 10-year, 5-year, and 2-year bonds.",
      "• These bonds represent various fixed-income securities issued by the Peruvian government to finance public spending and manage national debt across different time horizons.",
      "• The availability of bonds with maturities ranging from 2 years to 30 years indicates Peru’s engagement in long-term and short-term debt instruments to attract diverse investors.",
      "• The issuance of these bonds reflects Peru’s efforts to maintain fiscal stability and support economic growth through capital market development in the 21st century."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:44.531112",
      "openai_model": "gpt-4.1-mini",
      "content_length": 62,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "1.3.1",
    "section_name": "Lima Consensus",
    "text": "Initially established by the Fujimori administration, the Lima Consensus\nfocused on deregulation and privatization with the goal of establishing a\nneoliberal economy, all while limiting the involvement of the government in\nthe public sector. As the Washington Consensus lost popularity in the 2000s, a\nmore defined Lima Consensus began to emerge in Peru as the economy\nsimultaneously improved during the 2000s commodities boom. While Latin\nAmerican governments invested into social programs for education, healthcare\nand poverty programs in the early 21st century, Peru under the Consensus chose\nto cut social programs. President Alejandro Toledo continued to promote the\ndecentralization of Peru, while the former social democrat Alan García took\nimplementation of the consensus even further, adopting policies similar to\nAugusto Pinochet. Keiko Fujimori, the daughter of Alberto Fujimori, has been a\nmajor proponent for the Lima Consensus, using the support of neoliberal\neconomist Hernando de Soto to support her position during her elections. This\nlack of state intervention as promoted by the Consensus has resulted with a\nweak government with poor performance, with many Peruvians experiencing\ninsufficient basic services such as education, justice and security while\ncorruption, crime, crony capitalism and economic inequality increased as many\npolitical officials frequently moving between business and government\npositions without oversight.\n\nFollowing the 2021 Peruvian general election that saw lefitst candidate Pedro\nCastillo elected into the presidency, Fitch Solutions warned that his election\nposed \"substantial risks to the 'Lima Consensus', the investor-friendly\neconomic policy framework that has persisted over the last 20 years\"."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Sectors",
    "text": "Peru's economic activity in the 1970s"
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "Peru is a country with many climates and geographical zones that make it a\nvery important agricultural nation. Peruvian agricultural exports are highly\nappreciated and include artichokes, grapes, avocados, mangoes, peppers,\nsugarcane, organic coffee and premium-quality cotton.\n\nPeru is one of the 5 largest producers of avocado, blueberry, artichoke and\nasparagus, one of the 10 largest producers in the world of coffee and cocoa,\none of the 15 largest producers in the world of potato and pineapple, and also\nhas a considerable production of grape, sugarcane, rice, banana, maize and\ncassava; its agriculture is considerably diversified.\n\nIn 2018, Peru produced 10.3 million tons of sugarcane, 5.1 million tons of\npotato, 3.5 million tons of rice, 2.2 million tons of banana, 1.5 million tons\nof maize, 1.2 million tons of cassava, 921 thousand tons of palm oil, 645\nthousand tons of grape, 548 thousand tons of pineapple, 504 thousand tons of\navocado, 481 thousand tons of tangerine, 502 thousand tons of orange, 369\nthousand tons of coffee, 383 thousand tons of mango, 360 thousand tons of\nasparagus, 270 thousand tons of lemon, 252 thousand tons of tomato, 207\nthousand tons of barley, 195 thousand tons of wheat, 188 thousand tons of\nolives, 187 thousand tons of carrots, 175 thousand tons of papaya, 175\nthousand tons of pepper, 154 thousand tons of artichoke, 140 thousand tons of\napple, 134 thousand tons of cocoa, in addition to smaller productions of other\nagricultural products."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.1.1",
    "section_name": "Extraction",
    "text": "Natural gas separation plant of the Camisea Gas Project in La Convención\nProvince, Cuzco. Fishing fleet in Ferrol Bay near Chimbote. In the middle of\nthe 20th century, its port became the one with the largest fishing production\non the planet.\n\nFishing: Peru is an international leader in fishing, producing nearly 10\npercent of the world's fish catch.\n\nMining is a major pillar of the Peruvian economy. In 2019, the country was the\n2nd largest world producer of copper and silver, 8th largest world producer of\ngold, 3rd largest world producer of lead, 2nd largest world producer of zinc,\n4th largest world producer of tin, 5th largest world producer of boron and 4th\nlargest world producer of molybdenum. The country was once the world's largest\nproducer of silver and was also one of the five largest gold producers in the\nworld.\n\nIllegal mining remains a significant problem in Peru with its associated\ndeforestation, pollution, prostitution, poor working conditions and\ncriminality."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.1.2",
    "section_name": "Manufacturing",
    "text": "Peru has developed a medium manufacturing sector. The sector now represents 23\npercent of GDP and is tied heavily to mining, fishing, agriculture,\nconstruction and textiles. Manufacturing is mainly devoted to processing to\ngain a value-added advantage. The most promising sector is textiles, metal\nmechanics, food industry, agricultural industry, manufactures, chemicals,\npharmaceuticals, machinery and services.",
    "openai_summarised_points": [
      "• Peru has developed a medium-sized manufacturing sector that currently represents 23 percent of the country's Gross Domestic Product (GDP).",
      "• The manufacturing sector in Peru is closely linked to key industries such as mining, fishing, agriculture, construction, and textiles.",
      "• The primary focus of Peru’s manufacturing sector is on processing activities aimed at achieving a value-added advantage.",
      "• Among the various manufacturing subsectors, the most promising areas include textiles, metal mechanics, the food industry, the agricultural industry, general manufactures, chemicals, pharmaceuticals, machinery, and services."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:46.692109",
      "openai_model": "gpt-4.1-mini",
      "content_length": 412,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.1.3",
    "section_name": "Services",
    "text": "Tourism has represented a new growth industry in Peru since the early 1990s,\nwith the government and private sector dedicating considerable energies to\nboosting the country's tourist destinations both to Peruvians and foreigners.",
    "openai_summarised_points": [
      "• Tourism has emerged as a new growth industry in Peru since the early 1990s, marking a significant shift in the country’s economic focus within the services sector.",
      "• Both the Peruvian government and the private sector have invested substantial efforts and resources to promote and enhance the country’s tourist destinations.",
      "• These promotional activities target both domestic tourists (Peruvians) and international visitors, aiming to increase tourism inflows and economic benefits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:47.357954",
      "openai_model": "gpt-4.1-mini",
      "content_length": 229,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Natural resources",
    "text": "Peru's natural resources are copper, silver, gold, timber, fish, iron ore,\ncoal, phosphate, potash, and natural gas.",
    "openai_summarised_points": [
      "• Peru's natural resources encompass a diverse range of minerals and materials, including copper, silver, gold, timber, fish, iron ore, coal, phosphate, potash, and natural gas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:47:47.050172",
      "openai_model": "gpt-4.1-mini",
      "content_length": 116,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.2.1",
    "section_name": "Foreign trade and balance of payments",
    "text": "In 2001 the current account deficit dropped to about 2.2% of GDP (US$1.17\nbillion)--from 3.1% in 2000—while the trade balance registered a small\ndeficit. Exports dropped slightly to $7.11 billion, while imports fell 2.1% to\n$7.20 billion. After being hit hard by El Niño in 1998, fisheries exports have\nrecovered, and minerals and metals exports recorded large gains in 2001 and\n2002, mostly as a result of the opening of the Antamina copper-zinc mine. By\nmid-2002, most sectors of the economy were showing gains. After several years\nof substantial growth, foreign direct investment not related to privatization\nfell dramatically in 2000 and 2001, as well as in the first half of 2002. Net\ninternational reserves at the end of May 2002 stood at $9.16 billion, up from\n$8.6 billion (2001), $17 billion at the end of 2006, over $20 billion in 2007,\nand over $35 billion in May 2008. Peru has signed a number of free trade\nagreements, including the 2007 United States-Peru Trade Promotion Agreement,\nand agreements with Chile, Canada, Singapore, Thailand and China. Under\nPresident Alan Garcia administration Peru achieved a bilateral trade agreement\nwith U.S. since 2010 to improve exports for its country and reach in August\n2011 its pick in exports of more than 4,700 MM."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "2.2.2",
    "section_name": "Foreign investment",
    "text": "The Port of Callao is Peru's gateway for exports and imports\n\nThe Peruvian government actively seeks to attract both foreign and domestic\ninvestment in all sectors of the economy. International investment was spurred\nby the significant progress Peru made during the 1990s toward economic,\nsocial, and political stability, but it slowed again after the government\ndelayed privatizations and as political uncertainty increased in 2000.\nPresident Alejandro Toledo has made investment promotion a priority of his\ngovernment. While Peru was previously marked by terrorism, hyperinflation, and\ngovernment intervention in the economy, the Government of Peru under former\nPresident Alberto Fujimori took the steps necessary to bring those problems\nunder control. Democratic institutions, however, and especially the judiciary,\nremain weak.\n\nThe Government of Peru's economic stabilization and liberalization program\nlowered trade barriers, eliminated restrictions on capital flows, and opened\nthe economy to foreign investment, with the result that Peru now has one of\nthe most open investment regimes in the world. Between 1992 and 2001, Peru\nattracted almost $17 billion in foreign direct investment, after negligible\ninvestment until 1991, mainly from Spain (32.35%), the United States (17.51%),\nSwitzerland (6.99%), Chile (6.63%), and Mexico (5.53%). The basic legal\nstructure for foreign investment in Peru is formed by the 1993 constitution,\nthe Private Investment Growth Law, and the November 1996 Investment Promotion\nLaw. Although Peru does not have a bilateral investment treaty with the United\nStates, it has signed an agreement (1993) with the Overseas Private Investment\nCorporation (OPIC) concerning OPIC-financed loans, guarantees, and\ninvestments. Peru also has committed itself to arbitration of investment\ndisputes under the auspices of ICSID (the World Bank'sInternational Center for\nthe Settlement of Investment Disputes) or other international or national\narbitration tribunals."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Currency",
    "text": "The sol is the currency of Peru. The exchange rate as of January 2025 is 3.76\nsoles to the US dollar. It was instated in 1991, when the Peruvian government\nabandoned the inti due to hyperinflation of the currency; the sol has since\nmaintained the lowest inflation rate in Latin America. The sol replaced the\ninti at a rate of 1 nuevo sol = 1,000,000 intis. The inti itself replaced\nanother inflated currency, the sol, which was used between 1863 and 1985. The\nname _sol_ comes from the Latin _solidus_ , and is also the Spanish word for\n\"sun\", which the ancient Inca civilization worshiped as the god Inti.\n\nThe sol currently enjoys a low inflation rate of 2.5%. Since it was put into\nuse, the sol's exchange rate with the United States dollar has stayed mostly\nbetween 2.80 and 3.30 to 1. Out of all the currencies of the Latin American\nregion, the sol is the most stable and reliable, being the least affected by\nthe downturn in the value of the US dollar; during late 2007 and early 2008,\nthe exchange rate fell to 2.69 to 1, which had not been seen since 1997. The\nexchange rate is set on a daily basis by the _Banco Central de Reserva del\nPerú_ (Central Reserve Bank of Peru).\n\nThe sol is divided into 100 céntimos. The highest-denomination banknote is the\n200 soles note; the lowest-denomination coin is the rarely used 5 céntimos\ncoin."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Income and consumption",
    "text": "Peru divides its population into five socio-economic classes, A-E, with A\nrepresenting the rich; B, the upper middle class; C, the middle class; D, the\nworking class and low income families; and E, the marginalized poor. In 2018,\nthe segments were described as \"crude\" by Miguel Planas of the Ministry of\nFinance due to the complicated structure of the society in Peru, where some\nclasses make money off of illegal trade which aren't counted in the GDP, and\nare thus falsely classified as low income or marginalised poor families."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Employment",
    "text": "Unemployment in Greater Lima is 5.6%, while for the rest of Peru is 7%. FY\n2012–2013 In the last report, the number of workers by participants belonging\nto the public sector amounted to 1.45 million."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Greater depth",
    "text": "The Lima Stock Exchange\n\nFrom 1994 through 1998, under the government of Alberto Fujimori, the economy\nrecorded robust growth driven by foreign direct investment, almost 46% of\nwhich was related to the privatization program. The government invested\nheavily on the country's infrastructure, which became a solid foundation for\nthe future of the Peruvian economy.[_citation needed_] The economy stagnated\nfrom 1998 through 2001, the result of the century's strongest El Niño weather\nphenomenon, global financial turmoil, political instability, a stalled\nprivatization program, increased government intervention in markets[_citation\nneeded_], and worsening terms of trade. President Alejandro Toledo implemented\na recovery program after taking office, maintained largely orthodox economic\npolicies, and took measures to attract investment, including restarting the\nprivatization program. Nonetheless, political uncertainty led to GDP growth of\n0.2% in 2001.[_citation needed_] The Lima Stock Exchange general index fell\n34.5% in 2000 and 0.2% in 2001.[_citation needed_] Inflation remained at\nrecord lows, registering 3.7% in 2000.[_citation needed_]\n\nThe year 2001 saw deflation of 0.1%. The government's overall budget deficit\nrose sharply in 1999 and 2000 to 3.2% of GDP, the result of hikes in\ngovernment salaries, expenditures related to the 2000 election campaign,\nhigher foreign debt service payments, and lower tax revenues.[_citation\nneeded_] The government brought the deficit down to 2.5% of GDP in 2001, and\nset a target of 1.9% of GDP for 2002. Peru's stability brought about a\nsubstantial reduction in underemployment, from an average of 74% from the late\n1980s through 1994 to 43% in the 1995–96 period, but the rates began climbing\nagain in 1997–2002 to over half the working population. The poverty rate\nremained at 54% in 2001, with 24% of Peruvians living in extreme poverty. In\n2005, 18% of Peruvians were living in extreme poverty and a poverty rate at\n39%. As of 2010, around 30% of its total population is poor."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Outlook",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( October 2011)_\n---|---\n\nThe virtues of today's new multi-polar world for Peru are many. At 30 million\npeople, Peru is neither too small to matter nor so big it is going to be a\npower in its own right. Midsized states, benefits from a world where it is no\nlonger mandatory to pick a big-power patron.\n\nWith expanding ports loading up boats to China on one side, and a new\nsuperhighway to Brazil on the other, along with a free trade agreement with\nthe United States in its hip pocket, Peru seems well-positioned to prosper in\nthe coming years. But former President Toledo may not be hyperbolic when he\nworries the future stability of the state may depend on its willingness to\ndistribute wealth more evenly.\n\nForecasts for the medium- and long-term remain highly positive. Peru's real\nGDP growth in 2007 was (8.3%) and largest in Latin America in 2008 was an\noutstanding 9.8%, the highest in the world. Inflation remained low, at about\n3%, while the budget surplus is expected to remain at about 1% of\nGDP.[_citation needed_] Private investment should keep growing at a rate of\n15% a year.[_citation needed_] Exports and imports are expected to keep\nrising.[_citation needed_] The unemployment and underemployment indexes (5.2%\nand 34%, respectively, in Lima) should keep coming down as the economy\ngrows[_citation needed_], other cities in Peru like Cajamarca, Ica, Cuzco and\nTrujillo are starting to show less unemployment nowadays.[_citation needed_]\nThe country is likely to attract future domestic and foreign investment in\ntourism, agriculture, mining, petroleum and natural gas, power industries and\nfinancial institutions. According to the IMF and the World Bank, Peruvian GDP\neconomic growth between 2007 and 2013 was:\n\nIn 2007 at 8.9%, in 2008 at 9.7%, in 2009 at 0.9%, in 2010 at 8.6%, in 2011 at\n6.0%, in 2012 at 6,3% and in 2013 at 5.3%.\n\nTherefore, Peruvian GDP grew in the 2007–2013 6 years period an outstanding\nnet growth of 45.7% or a 7.61% yearly average. The IMF forecast for Peru's\neconomic growth for the next 6 years 2013–2019 is a 7% yearly growth.\n\nIn FY 2011 for the first time since 1991 the size of the Peruvian economy\nsurpassed the Chilean economy. Peru now is the fifth major economy in South\nAmerica and is expected to become the fourth South American economy in 2018 by\nsurpassing Venezuela.\n\nPrivate investment reached 25% of the GDP in 2007, and has remained stable\nthrough 2010; and inflation is under control at an average 2% per year for the\nnext 5 years. International Debt will reach 25% of the GDP by 2010, down from\n35% in 2006, and will be only 12% of the GDP by 2015.[_citation needed_] The\nInternational Monetary Reserves of the National Reserve Bank (Dollar, Euro,\nYen, Gold, and other currencies) reached US$27 billion by the end of 2007, and\nUS$31 billion at the end of 2008. Currently reserves are at a US$73 billion\nlevel for end of FY 2013, which more than doubles the total foreign debt of\nPeru which is US$30 billion at the end of FY 2013.\n\nExports are growing at a pace of 25% and reached US$28 billion at the end of\n2007 and US$30 billion at the end of 2010. In FY 2012 Peruvian exports reached\na total of US$46 billion.\n\nHigh technological investment is growing fast in Peru, and will be 10% of the\nGDP by 2010.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.2.1",
    "section_name": "Background",
    "text": "Coca has a long history of cultivation in the Andes, and has always been a\ntraditional part of Peruvian life. However, the narcotic properties of coca\nwere known only locally until 1786, when Lamarck listed the leaf in his\nbotanical encyclopedia. After the arrival of the Spanish, coca cultivation\nincreased and its use became more common and widespread. Since 1543, coca has\nbeen internationally recognized for its trading value, and regulations imposed\nupon it have attached increasing economic importance to the plant. Exchange of\nthe coca leaf between consumers in the highlands and growers in the low-lying\nhills has gone on for at least the last millennium, strengthening local\neconomic ties. Between 1884 and 1900, coca and cocaine grew in popularity for\nmedical purposes and mass consumption in the United States. From 1905 to 1922,\nanti-cocaine sentiments in the US resulted in criminalization of both coca and\ncocaine. It was not until the 1920s that US diplomats began to extend drug\nprohibitions internationally."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.2.2",
    "section_name": "Current trends",
    "text": "The Peruvian coca and cocaine industry is as huge as it is today because of\nadvanced industrial nations’ demand for drugs. This high demand has created a\nframework of dependence on \"coca-dollars\" and on US drug policy. Money from\ncocaine trafficking feeds local economies, supports inflation, and even causes\nsocial changes such as cocaine smoking among indigenous Peruvians. Coca\nfarming today is still a significant source of income for peasants, as it\naccounts for 48% of total net family income in the high coca-growing Apurímac\nRiver region. In an effort to reduce drug use in America, for the past 50\nyears the US government together with the United Nations have been waging a\nwar on drugs. The US Drug Control Program maintains that \"eliminating the\ncultivation of illicit coca and opium is the best approach to combating\ncocaine and heroin availability in the US.\"\n\nWith US government cooperation, the Peruvian Government installed the National\nPlan for the Prevention and Control of Drugs in 1995. This government\nprohibition of narcotics trafficking in Peru has resulted in a 70% reduction\nof coca leaf cultivation since 1995. However the reduction in cultivation may\nnot have actual effects on cocaine production, as recent advances in coca\ngrowing and more efficient processing methods allow for greater cocaine yield.\nThe size of the narcotics industry as a part of the national economy is\ndifficult to measure, but estimates range from $300–$600 million. An estimated\n200,000 Peruvian households have economies based on the production, refining,\nor distribution of coca. Many economists believe that large flows of dollars\ninto the banking system contribute to the traditional depression of the dollar\nexchange rate vis-a-vis the sol. The Central Bank engages in open market\nactivities to prevent the price of the sol from rising to levels that would\ncause Peruvian exports to become prohibitively expensive.\n\nHurt economically by Peruvian Air Force interdiction efforts in the mid-1990s,\ndrug traffickers are now using land and river routes as well as aircraft to\ntransport cocaine paste and, increasingly, refined cocaine to consumers around\nand out of the country. The Air Bridge Denial Program was suspended in April\n2001 after the Peruvian Air Force and strength of the U.S. DEA misidentified a\ncivilian aircraft as a drug trafficker and shot it down, killing two American\ncitizens on board. Peru continues to arrest drug traffickers and seize drugs\nand precursor chemicals, destroy coca labs, disable clandestine airstrips, and\nprosecute officials involved in narcotics corruption.\n\nWorking with limited aid of the U.S. Agency for International Development\n(USAID), the Peruvian Government carries out alternative development programs\nin the leading coca-growing areas in an effort to convince coca farmers not to\ngrow that crop. Although the government previously eradicated only coca seed\nbeds, in 1998 and 1999 it began to eradicate mature coca being grown in\nnational parks and elsewhere in the main coca growing valleys. In 1999 the\ngovernment eradicated more than 150 km2 of coca; this figure declined to 65\nkm2 in 2000, due largely to political instability. The government agency\n\"Contradrogas\", founded in 1996, facilitates coordination among Peruvian\nGovernment agencies working on counter-narcotics issues. Alternative crops,\nhowever, are not economically comparable to coca. 2004 prices indicate an\nannual income per hectare of $600 for coffee and $1000 for cocoa, versus up to\n$7500 for a hectare of coca.\n\nFor the global push towards a green economy, sustainability depends on access\nto minerals such as copper, lithium, and rare earth elements. Peru, as one of\nthe most resource-rich nations in the world, plays an important role. Peru is\ncurrently considered the world’s second-largest exporter of minerals such as\ncopper, silver, zinc, and lithium; these minerals are essential to the\ntechnologies that drive change in industry to a cleaner and more sustainable\nfuture. This year, in August 2024, Peru and the United States signed a\nmemorandum of understanding (MOU) for greater foreign direct investment (FDI)\nand shared technological innovation. The MOU represents Peru as the US supply\nfor the accessibility of essential minerals, guaranteeing responsible\nextraction processes. Peru has more than 6 t of lithium and managed 31 active\ncopper projects with almost US$40 billion in potential investments. Thus, this\npartnership marks a new era for the Peruvian economy. (Owen, 2024)"
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.2.3",
    "section_name": "Effect on family economies",
    "text": "The anti-coca policies imposed in 1995 have had adverse effects on Peruvian's\nhousehold economies. Many families dependent on coca farming have been forced\nto send their children to work as eradication of crops has decreased their\nhousehold income. In states where coca is grown, child labour increased by 18%\nin 1997 and 40% in 2000. Work hours and domestic work increased as well, with\ngirls taking on 28% more domestic work with boys doing 13% more. Wage work for\nadults also increased since 1995. As such, it can be inferred that the\nincrease in child labour since eradication policies have come into effect is\ncaused by children filling in for working parents. However, the issue of child\nlabour in cocoa production is still present in Peru as reported in 2013 in the\nU.S. Department of Labor's report _Findings on the Worst Forms of Child Labor_\nand in December 2014, in the Bureau of International Labor Affairs's _List of\nGoods Produced by Child Labor or Forced Labor_."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Corruption",
    "text": "Peru is the 101st least corrupt country in the world according to Transparency\nInternational's Corruption Perceptions Index.\n\nThe Peruvian organization _\"Ciudadanos al Dia\"_ has started to measure and\ncompare transparency, costs, and efficiency in different government\ndepartments in Peru. It annually awards the best practices which has received\nwidespread media attention. This has created competition among government\nagencies to improve.\n\nA recent case of corruption was the 2008 oil scandal, which caused protests in\nlarge cities around Peru. The cabinet has to resign due to the\nscandal.However, a judge absolved all the officials involved in the case in\n2016."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Main economic indicators",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff stimtates in 2022–2027). Inflation below 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 53.9  | 3,111.3  | 20.2  | 1,164.8  | 7.7%  | 59.1%  | 7.3%  | n/a\n1981  | 62.3  | 3,503.5  | 24.4  | 1,373.1  | 5.5%  | 75.4%  | 6.8%  | n/a\n1982  | 65.9  | 3,618.9  | 24.3  | 1,332.5  | -0.3%  | 64.5%  | 6.4%  | n/a\n1983  | 62.1  | 3,329.7  | 18.9  | 1,011.7  | -9.3%  | 111.1%  | 9.0%  | n/a\n1984  | 66.8  | 3,498.4  | 19.4  | 1,018.8  | 3.8%  | 110.2%  | 8.9%  | n/a\n1985  | 70.3  | 3,601.1  | 16.8  | 861.6  | 2.1%  | 163.4%  | 4.6%  | n/a\n1986  | 80.4  | 4,026.1  | 25.2  | 1,263.7  | 12.1%  | 77.9%  | 5.3%  | n/a\n1987  | 88.8  | 4,346.5  | 41.7  | 2,040.7  | 7.7%  | 85.8%  | 4.8%  | n/a\n1988  | 83.3  | 3,987.4  | 33.0  | 1,579.5  | -9.4%  | 667.0%  | 4.2%  | n/a\n1989  | 74.9  | 3,512.3  | 40.7  | 1,908.5  | -13.4%  | 3398.3%  | 7.9%  | n/a\n1990  | 73.8  | 3,388.6  | 28.3  | 1,301.5  | -5.1%  | 7481.7%  | 8.3%  | n/a\n1991  | 77.9  | 3,510.0  | 34.0  | 1,530.7  | 2.2%  | 409.5%  | 5.9%  | n/a\n1992  | 79.3  | 3,501.8  | 35.4  | 1,562.6  | -0.5%  | 73.5%  | 9.4%  | n/a\n1993  | 85.4  | 3,702.0  | 34.3  | 1,487.9  | 5.2%  | 48.6%  | 9.9%  | n/a\n1994  | 98.0  | 4,169.0  | 43.2  | 1,839.2  | 12.3%  | 23.7%  | 8.8%  | n/a\n1995  | 107.4  | 4,490.8  | 51.4  | 2,147.4  | 7.4%  | 11.1%  | 7.1%  | n/a\n1996  | 112.5  | 4,619.6  | 53.4  | 2,193.7  | 2.8%  | 11.5%  | 7.2%  | n/a\n1997  | 121.8  | 4,918.8  | 56.3  | 2,272.4  | 6.5%  | 8.5%  | 8.6%  | n/a\n1998  | 122.7  | 4,873.1  | 53.9  | 2,141.1  | -0.4%  | 7.3%  | 6.9%  | n/a\n1999  | 126.3  | 4,936.0  | 48.7  | 1,903.9  | 1.5%  | 3.5%  | 9.4%  | n/a\n2000  | 132.6  | 5,105.1  | 50.4  | 1,940.2  | 2.7%  | 3.8%  | 7.8%  | 44.9%\n2001  | 136.5  | 5,176.0  | 51.0  | 1,935.5  | 0.6%  | 2.0%  | 9.2%  | 43.8%\n2002  | 146.2  | 5,466.1  | 54.0  | 2,017.8  | 5.5%  | 0.2%  | 9.4%  | 45.5%\n2003  | 155.3  | 5,728.1  | 58.5  | 2,159.7  | 4.2%  | 2.3%  | 9.4%  | 49.4%\n2004  | 167.3  | 6,093.4  | 66.1  | 2,408.1  | 5.0%  | 3.7%  | 9.4%  | 46.7%\n2005  | 183.4  | 6,595.2  | 74.2  | 2,669.2  | 6.3%  | 1.6%  | 9.6%  | 40.4%\n2006  | 203.3  | 7,222.1  | 87.5  | 3,106.7  | 7.5%  | 2.0%  | 8.5%  | 34.9%\n2007  | 226.6  | 7,955.7  | 102.2  | 3,587.8  | 8.5%  | 1.8%  | 8.4%  | 31.9%\n2008  | 252.0  | 8,748.4  | 121.3  | 4,209.0  | 9.1%  | 5.8%  | 8.4%  | 28.0%\n2009  | 256.4  | 8,801.7  | 121.8  | 4,179.7  | 1.1%  | 2.9%  | 8.4%  | 28.3%\n2010  | 281.1  | 9,541.6  | 148.9  | 5,055.5  | 8.3%  | 1.5%  | 7.9%  | 25.3%\n2011  | 305.1  | 10,239.4  | 170.9  | 5,736.1  | 6.3%  | 3.4%  | 7.7%  | 23.0%\n2012  | 318.4  | 10,567.0  | 193.1  | 6,407.6  | 6.1%  | 3.7%  | 6.8%  | 21.1%\n2013  | 338.7  | 11,115.3  | 202.6  | 6,647.5  | 5.9%  | 2.8%  | 5.9%  | 19.9%\n2014  | 349.9  | 11,356.0  | 202.9  | 6,584.0  | 2.4%  | 3.2%  | 5.9%  | 20.6%\n2015  | 356.8  | 11,454.4  | 192.0  | 6,164.2  | 3.3%  | 3.5%  | 6.5%  | 24.0%\n2016  | 378.5  | 12,019.8  | 195.5  | 6,207.4  | 4.0%  | 3.6%  | 6.7%  | 24.3%\n2017  | 402.0  | 12,631.7  | 215.7  | 6,776.9  | 2.5%  | 2.8%  | 6.9%  | 25.2%\n2018  | 428.0  | 13,307.2  | 226.8  | 7,051.6  | 4.0%  | 1.3%  | 6.7%  | 26.0%\n2019  | 445.4  | 13,430.2  | 232.3  | 7,006.3  | 2.2%  | 2.1%  | 6.6%  | 26.9%\n2020  | 401.1  | 11,975.3  | 205.8  | 6,145.0  | -11.0%  | 1.8%  | 13.9%  | 35.0%\n2021  | 474.4  | 14,022.8  | 225.9  | 6,678.9  | 13.6%  | 4.0%  | 10.9%  | 36.4%\n2022  | 521.8  | 15,273.2  | 239.3  | 7,004.8  | 2.7%  | 7.5%  | 7.6%  | 34.8%\n2023  | 554.5  | 16,067.4  | 253.8  | 7,353.4  | 2.6%  | 4.4%  | 7.5%  | 35.7%\n2024  | 584.2  | 16,762.7  | 266.8  | 7,655.6  | 3.2%  | 2.5%  | 7.4%  | 35.7%\n2025  | 613.5  | 17,428.4  | 279.7  | 7,945.5  | 3.1%  | 2.1%  | 7.3%  | 35.7%\n2026  | 644.0  | 18,111.8  | 293.2  | 8,246.5  | 3.0%  | 2.0%  | 7.2%  | 35.2%\n2027  | 676.1  | 18,828.5  | 307.4  | 8,560.9  | 3.0%  | 2.0%  | 7.0%  | 34.3%\nPeru's poverty rate from 2004 to 2012.\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ 0.8%\n_highest 10%:_ 37.5% (2000)\n\n**Inflation rate (consumer prices):** 2.08% (2010)\n\n**Budget:**\n_revenues:_ $57 billion (2014 est.)\n_expenditures:_ $50 billion, including long-term capital expenditures of $3.8\nbillion (2010 est.)\n\n**Industrial production growth rate:** 12% (2013 est.)\n\n**Electricity – production:** 175,500 GWh (2013 est.)\n\n**Electricity – production by source:**\n_natural gas:_ 44.53%\n_hydro:_ 54.79%\n_nuclear:_ 0%\n_other:_ 0.68% (2013)\n\n**Electricity – consumption:** 133,000 GWh (2013)\n\n**Electricity – exports:** 32,000 kWh (2013) mainly to Ecuador\n\n**Electricity – imports:** 0 kWh (2013)\n\n**Agriculture – products:** coffee, cotton, sugarcane, rice, wheat, potatoes,\nplantains, coca; poultry, beef, dairy products, wool; fish\n\n**Exports:** 63.5 billion f.o.b. (2013 est.) of goods and products. 10.5\nbillion f.o.b. (2013 est.) of services. Total Exports $73.5 billion f.o.b.\n(2013) **Exports:** fish and fish products, copper, zinc, gold, molybdenum,\niron, crude petroleum and byproducts, lead; coffee, asparagus, artichokes,\npaprika, sugar, cotton, textiles, chemicals, pharmaceuticals, manufactures,\nmachinery, services.\n\n**Exports – partners:** Mainland China 20%, United States 15%, European Union\n15%, Brazil 10%, Chile 10%, Japan 5%, Mexico 5%, United Kingdom 5%, Bolivia 5%\nRest of Latin America 5%, Rest of world 5%, (2013)\n\n**Imports:** Total Imports $68 billion f.o.b. (2013)\n\n**Imports – commodities:** machinery, transport equipment, foodstuffs, iron\nand steel, pharmaceuticals, electronics, petroleum and chemicals.\n\n**Imports – partners:** Mainland China 25%, US 15%, European Union 15%, Brazil\n10%, Japan 10%, Chile 5%, Colombia 5%, Mexico 5%, Ecuador 4%, Bolivia 1%, Rest\nof World 5% (2013)."
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Trade agreements",
    "text": "According to the Ministry of Foreign Trade and Tourism, Peru decided to\nnegotiate trade agreements to consolidate the access of Peruvian exports to\nits most important markets by giving them permanent benefits unlimited in time\nand coverage as opposed to temporary commercial preferences given unilaterally\nby certain countries; a system that did not allow Peruvian exporters embark in\nlong-term export-related investments.\n\n**Economic Complementation Agreement**\n\n* Integration Agreement with Andean Community of Nations:  Bolivia,  Ecuador and  Colombia (signed and effective 1969)\n* ACE 50 with  Cuba (signed October 2000 and effective 2001)\n* ACE 58 with  Mercosur (signed August 2003 and effective November 2005)\n\n\n---\n**FTA (Free Trade Agreement) currently in force**\n\n* FTA with  United States (signed April 2006 and effective February 2009).\n* FTA with  Chile (signed August 2006 and effective March 2009)\n* FTA with  Canada(_**CPFTA**_) (signed May 2008 and effective August 2009)\n* FTA with  Singapore (signed May 2008 and effective August 2009)\n* FTA with  China (signed April 2009 and effective March 2010)\n* FTA with  South Korea (signed March 2011 and effective August 2011)\n* Partial FTA with  Thailand (last protocol signed November 2010 and effective December 2011)\n* FTA with  Mexico (signed April 2011 and effective February 2012)\n* FTA with  Japan (signed May 2011 and effective March 2012)\n* FTA with  Panama (signed May 2011 and effective May 2012)\n* FTA with EFTA  Switzerland,  Liechtenstein,  Iceland and  Norway (signed July 2010,  Switzerland and  Liechtenstein effective July 2011,  Iceland effective October 2011,  Norway effective July 2012)\n* FTA with  European Union (signed April 2011 and effective February 2013)\n* FTA with  Costa Rica (signed May 2011 and effective June 2013)\n* Partial FTA with  Venezuela (signed January 2012 and effective August 2013)\n* FTA with Pacific Alliance (signed February 2014 and effective May 2016)\n* FTA with  Honduras (signed May 2015 and effective January 2017)\n\n\n**FTA (Free Trade Agreement) concluded**\n\n* Guatemala (signed December 2011)\n* Brazil (signed April 2016)\n* Australia (signed February 2018)\n* CPTPP (signed March 2018)\n\n\n**FTA (Free Trade Agreement) in negotiation**\n\n* El Salvador\n* India\n* Turkey"
  },
  {
    "chapter_name": "Economy of Peru",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Peru – United States Trade Promotion Agreement",
    "text": "The _United States – Peru Trade Promotion Agreement_ (Spanish: _Tratado de\nLibre Comercio Perú – Estados Unidos_) is a bilateral free trade agreement,\nwhose objectives are eliminating obstacles to trade, consolidating access to\ngoods and services and fostering private investment in and between the United\nStates and Peru. Besides commercial issues, it incorporates economic,\ninstitutional, intellectual property, labor and environmental policies, among\nothers. The agreement was signed on 12 April 2006; ratified by the Peruvian\nCongress on 28 June 2006; by the U.S. House of Representatives on 2 November\n2007 and by the U.S. Senate on 4 December 2007. The agreement was implemented\non 1 February 2009.\n\nPeru looks to the agreement are to:\n\n* Consolidate and extend the trade preferences under ATPDEA\n* Attract foreign investment\n* Generate employment\n* Enhance the country's competitiveness within the region\n* Increase workers' income\n* Curb poverty levels\n* Create and export sugar cane ethanol\n\nThe United States looks to the agreement to:\n\n* Improve access to goods and services\n* Strengthen its investments\n* Promote security and democracy\n* Fight against drug trafficking\n\nThe U.S.-Peru agreement has faced criticism. In Peru, the treaty was\nchampioned by Toledo, and supported to different extents by former President\nAlan García and candidates Lourdes Flores and Valentín Paniagua. Ollanta\nHumala has been its most vocal critic. Humala's Union for Peru won 45 of 120\nseats in Congress in 2006, the largest share by a single party, prompting\ndebate on ratification of the agreement before the new legislature was sworn\nin. Some Congressmen-elect interrupted the debate after forcibly entering\nCongress in an attempt to stop the agreement ratification.\n\nOne controversial element of the agreement relates to land resources. Laura\nCarlsen, of the Center for International Policy, who is also a contributor to\nForeign Policy in Focus notes that \"Indigenous organizations warn that this\nruling effectively opens up 45 million hectares to foreign investment and\ntimber, oil, and mining exploitation.\"\n\nHowever, most of the criticism of the agreement has focused on its potential\nimpact on Peru's agricultural sector. By planting crops to similar to those\nsubsidized by the U.S., Peru faced a competitive disadvantage in the\nproduction of agricultural products because poor farming families with\ninadequate tools, technology and techniques may not be able to produce crops\nat low enough prices to export. In response to these concerns, Peruvian\nlawmakers created a Compensation Fund which directed $34 million per year to\ncotton, maize/corn, and wheat producers for a five-year period to help them\nadjust to the new competitive pressures.\n\nToledo is therefore a market-oriented politician who continued to globalize\nPeru's economy and is rumored to be getting ready for another run for\npresident. Toledo says bluntly that unless the poorest in the country are\nbetter educated, better paid, housed, and fed, the Peruvian economic miracle\nwill stall."
  }
]