[
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Malta\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( December 2007)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nThe **economy of Malta** is a highly industrialised service-based economy. It\nis classified as an advanced economy by the International Monetary Fund and is\nconsidered a high-income country by the World Bank and an innovation-driven\neconomy by the World Economic Forum. It is a member of the European Union and\nof the eurozone, having formally adopted the euro on 1 January 2008.\n\nThe strengths of Malta's economy are its advantageous location, being situated\nin the middle of the Mediterranean Sea at a crossroads between Europe, North\nAfrica and the Middle East, its fully developed open market economy,\nmultilingual population (88% of Maltese people speak English), productive\nlabour force, low corporate tax and well developed finance and ICT clusters.\nThe economy is dependent on foreign trade, manufacturing (especially\nelectronics), tourism and other services in the tertiary sector of the\neconomy. In 2014, over 1.7 million tourists visited the island.\n\nMalta's GDP per capita in 2024, adjusted by purchasing power parity, stood at\n$67,682 and ranked 15th in the list of EU countries in terms of purchasing\npower standard. In the 2013 calendar year, Malta recorded a budget deficit of\n2.7%, which is within the limits for eurozone countries imposed by the\nMaastricht criteria, and Government gross debt of 69.8%. At 5.9%, Malta had\nthe sixth-lowest unemployment rate in the EU in 2015.\n\nMalta is the 33rd-most democratic country in the world according to the\nEconomist Intelligence Unit's Democracy Index.",
    "openai_summarised_points": [
      "• The economy of Malta is characterized as a highly industrialised, service-based economy, reflecting a modern and diversified economic structure.",
      "• The International Monetary Fund classifies Malta as an advanced economy, indicating a high level of economic development and sophistication.",
      "• The World Bank designates Malta as a high-income country, underscoring its substantial per capita income and economic prosperity.",
      "• The World Economic Forum categorizes Malta as an innovation-driven economy, highlighting its focus on technological advancement and knowledge-based industries.",
      "• Malta is a member of the European Union and the eurozone, having officially adopted the euro as its currency on 1 January 2008, integrating it into the European monetary system.",
      "• Key strengths of Malta’s economy include its strategic geographic location in the central Mediterranean Sea, serving as a crossroads between Europe, North Africa, and the Middle East, which facilitates trade and connectivity.",
      "• Malta possesses a fully developed open market economy, promoting free trade and investment with minimal restrictions.",
      "• The population is multilingual, with 88% of Maltese people speaking English, enhancing communication and business operations internationally.",
      "• The labour force in Malta is productive, contributing to economic efficiency and competitiveness.",
      "• Malta offers a low corporate tax regime, attracting foreign investment and multinational companies.",
      "• The country has well-developed finance and information and communications technology (ICT) clusters, supporting sectors critical to modern economic growth.",
      "• The Maltese economy relies significantly on foreign trade, manufacturing—particularly electronics—and tourism, alongside other tertiary sector services.",
      "• In 2014, Malta attracted over 1.7 million tourists, reflecting the importance of tourism to the national economy.",
      "• In 2024, Malta’s GDP per capita, adjusted for purchasing power parity (PPP), was $67,682, ranking 15th among European Union countries in terms of purchasing power standard.",
      "• In the 2013 calendar year, Malta recorded a budget deficit of 2.7%, which complied with the Maastricht criteria limits set for eurozone countries, ensuring fiscal discipline.",
      "• Malta’s government gross debt stood at 69.8% of GDP in 2013, indicating the level of public indebtedness relative to economic output.",
      "• The unemployment rate in Malta was 5.9% in 2015, representing the sixth-lowest rate within the European Union, signifying a relatively strong labour market.",
      "• According to the Economist Intelligence Unit’s Democracy Index, Malta ranks as the 33rd-most democratic country worldwide, reflecting its political stability and governance quality."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:29:34.186511",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1878,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Transport",
    "text": "Aerial view of Luqa International Airport\n\nMalta has an airport, Luqa International Airport, and two majors ports, Malta\nFreeport and Valletta Cruise Port. Malta Freeport is used for all cargo ships\nand imports-exports while Valletta Cruise Port is only used by cruise ships.\nThe Malta Freeport reported revenues of 170 million euros, while €90 million\ncame from the Valletta Cruise Port, totaling €260 million. The Freeport\nconnects Malta with 110 others ports in the world including 55 in the\nMediterranean. Furthermore, 2,189 container ships carried 2.80 million TEU of\ncontainer traffic in and out of Malta Freeport in 2022. The Valletta Cruise\nPort welcomed 900,000 passengers in 2023, contributing €53 million to the\nMaltese economy.\n\n\nLuqa International Airport serves 35 different airlines with 115 destinations.\nIn 2023, 7.8 million people travelled through the airport, providing $2.7\nbillion in revenues to the Maltese economy, equivalent to 24% of Malta's Gross\nDomestic Product (GDP). Specifically, the former air flag carrier of Malta Air\nMalta, KM Malta Airlines since 2024, had a revenue of €679.4 million in 2022.\nAnother new airline operating from Luqa Airport, Universal Air, started\noperations in April 2024 with a fleet of 6 aircraft. The airlines, airport,\nand surrounding businesses employ almost 7,000 people.",
    "openai_summarised_points": [
      "• Malta's transport infrastructure includes one airport, Luqa International Airport, and two major ports: Malta Freeport and Valletta Cruise Port.",
      "• Malta Freeport exclusively handles all cargo ship traffic and import-export activities, while Valletta Cruise Port is dedicated solely to cruise ships.",
      "• In 2022, Malta Freeport generated revenues amounting to €170 million, whereas Valletta Cruise Port contributed €90 million, resulting in a combined total revenue of €260 million from both ports.",
      "• Malta Freeport maintains maritime connections with 110 ports worldwide, including 55 ports located within the Mediterranean region.",
      "• During 2022, Malta Freeport managed 2,189 container ships, which transported a total of 2.80 million TEU (twenty-foot equivalent units) of container traffic in and out of the port.",
      "• Valletta Cruise Port welcomed 900,000 cruise passengers in 2023, generating €53 million in economic contribution to Malta.",
      "• Luqa International Airport serves 35 airlines and offers flights to 115 destinations globally.",
      "• In 2023, Luqa International Airport handled 7.8 million passengers, producing $2.7 billion in revenue for the Maltese economy, which represents 24% of Malta's Gross Domestic Product (GDP).",
      "• Malta’s former national airline, Air Malta, rebranded as KM Malta Airlines in 2024, reported revenues of €679.4 million in 2022.",
      "• Universal Air, a new airline operating from Luqa International Airport, commenced operations in April 2024 with an initial fleet of 6 aircraft.",
      "• The combined employment from airlines, the airport, and associated businesses at Luqa International Airport accounts for nearly 7,000 individuals."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:29:39.612211",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1333,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "History",
    "text": "During the Napoleonic Wars (1800–1815), Malta's economy prospered and became\nthe focal point of a major trading system. In 1808, two-thirds of the cargo\nconsigned from Malta went to Levant and Egypt. Later, one half of the cargo\nwas usually destined for Trieste. Cargo consisted of largely British and\ncolonial-manufactured goods. Malta's economy became prosperous from this trade\nand many artisans, such as weavers, found new jobs in the port industry.\n\nIn 1820, during the Battle of Navarino, which took place in Greece, the\nBritish fleet was based in Malta. In 1839, P&O and East India Company used\nMalta as a calling port on their Egypt and Levant runs.\n\nIn 1869, the opening of the Suez Canal benefited Malta's economy greatly as\nthere was a massive increase in the shipping which entered in the port. The\neconomy had entered a special phase. The Mediterranean Sea became the \"world\nhighway of trade\" and a number of ships called at Malta for coal and various\nsupplies on their way to the Indian Ocean and the Far East. From 1871 to 1881,\nabout 8,000 workers found jobs in the Malta docks and a number of banks opened\nin Malta. By 1882, Malta reached the height of its prosperity.\n\nHowever, the boom did not last long. By the end of the 19th century, the\neconomy began declining and by the 1940s, Malta's economy was in serious\ncrisis. This was primarily due to the invention of large ships which had\nbecome oil-fired and therefore had no need to stop in the Grand Harbor of\nMalta to refuel. The British Government had to extend the dockyard.\n\nAt the end of World War II, Malta's strategic importance had reached a low\npoint. Modern air warfare technology and the invention of the atomic bomb had\nchanged the importance of the military base. The British lost control of the\nSuez Canal and withdrew from the naval dockyard, transforming it for\ncommercial shipbuilding and ship repair purposes."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Modern economy",
    "text": "The Maltese economy is dependent on foreign trade, manufacturing (especially\nelectronics and pharmaceuticals), and tourism. Malta adopted the Euro currency\non 1 January 2008.\n\nTourist arrivals and foreign exchange earnings derived from tourism have\nsteadily increased since 1987. Following the September 11 attacks, the tourist\nindustry suffered a temporary setback. With the help of a favorable\ninternational economic climate, the availability of domestic resources, and\nindustrial policies that support foreign export-oriented investment, the\neconomy has been able to sustain a period of rapid growth.[_citation needed_]\nGrowing public and private sector demand for credit has led — in the context\nof interest rate controls — to credit rationing to the private sector and the\nintroduction of non-interest charges by banks. Despite these pressures,\nconsumer price inflation has remained low (2.2% according to the Central Bank\nof Malta in 2007), reflecting the impact of a fixed exchange rate policy (100%\nhard peg to the euro, in preparation for currency changeover) and lingering\nprice controls.\n\nThere is a strong manufacturing base for high value-added products like\nelectronics and pharmaceuticals, and the manufacturing sector has more than\n250 foreign-owned, export-oriented enterprises. Tourism generates around 15%\nof GDP. Film production in Malta is another growing industry (approx. 35\nmillion euros between 1997 and 2011), despite stiff competition from other\nfilm locations in Eastern Europe and North Africa, with the Malta Film\nCommission providing support services to foreign film companies for the\nproduction of feature cinema, commercials and television series.\n\nFrom 2001 to 2005 the mean GDP real growth was 0.4% due to Malta losing pace\nin tourism and other industries. Unemployment was down to 4.4%, its lowest\nlevel in 3 years. Many formerly state-owned companies are being privatised—and\nthe market liberalised.\n\nFiscal policy has been directed toward bringing down the budget deficit after\npublic debt grew from a negative figure in 1988 to 56% in 1999 and 69.1% in\n2009. By 2007, the deficit-to-GDP ratio was comfortably below 3% as required\nfor eurozone membership, but due to pre-election spending has gone up to 4.4%\nin 2008 and 3.8% in 2009."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Energy",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2014)_\n---|---\n\nDespite a great potential for solar and wind power, Malta produces almost all\nits electricity from oil, importing 100% of it. Energy and the cost of energy,\nwhich is oft-quoted as the highest in Europe, was a key issue in the 2013\nelection."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Industry",
    "text": "Average annual employment and average annual earnings in manufacturing industry (2007)  Sector  | Average annual\nemployment  | Average annual\nearnings per capita\nin euros\n---|---|---\nFood and beverages; tobacco  | 2,873  | 13,441\nTextiles and textile products  | 422  | 15,512\nWearing apparel and clothes  | 733  | 11,698\nLeather and leather products  | 185  | 9,308\nWood and wood products  | 78  | 12,000\nPaper and paper products  | 265  | 15,698\nPublishing and printing  | 1,669  | 17,615\nChemicals and chemical products  | 1,038  | 19,052\nRubber and plastic products  | 1,578  | 15,254\nOther non-metallic mineral products  | 766  | 11,928\nFabricated metal products  | 596  | 14,451\nMachinery and equipment n.e.c.  | 446  | 13,518\nElectrical machinery and apparatus  | 1,409  | 16,515\nRadio, TV and communication equipment  | 3,168  | 18,673\nMedical, precision and optical instruments  | 877  | 15,582\nMotor vehicles, trailers and semitrailers  | 50  | 10,220\nOther transport equipment  | 258  | 20,938\nFurniture and manufacturing n.e.c.  | 1,597  | 15,753\nTotal  | 18,008  | 15,812"
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Banking",
    "text": "Largest banks in Malta, 2022  Rank  | Company  | Founded  | Market %\n---|---|---|---\n1  | Bank of Valletta | 1974  | 44.67 %\n2  | HSBC Bank Malta p.l.c.  | 1999  | 20.48 %\n3  | APS BANK P.L.C.  | 1910  | 8.41 %\n4  | MeDirect Bank (Malta) plc  | 2004  | 6.87 %\n5  | FIMBank plc  | 1995  | 5.70 %\n6  | Lombard Bank Malta plc  | 1955  | 3.85 %\n7  | BNF Bank plc  | 2008  | 3.13 %"
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2014)_\n---|---\n**GDP identity from the income side:** Percentage compensation of employees by\nindustry averaged for the period 2016 to 2020. (NSO, Gross Domestic Product:\n2020 report.)\n\n**Electricity - production:** 1,620 GWh (1998)\n\n**Electricity - production by source:**\n_fossil fuel:_ 98.6%\n_hydro:_ 0%\n_nuclear:_ 0%\n_Renewable sources:_ 1.4%\n_other:_ 0% (1998)\n\n**Electricity - consumption:** 1,507 GWh (1998)\n\n**Electricity - exports:** 0 kWh (1998)\n\n**Electricity - imports:** 0 kWh (1998)\n\n**Agriculture - products:** potatoes, cauliflower, grapes, wheat, barley,\ntomatoes, citrus, cut flowers, green peppers; pork, milk, poultry, eggs\n\n**Currency:** 1 euro = 100 cents since 1 January 2008\npreviously 1 Maltese lira = 100 cents;\n\n**Exchange rates:** Maltese liri (LM) per US$1 – 0.4086 (January 2000), 0.3994\n(1999), 0.3885 (1998), 0.3857 (1997), 0.3604 (1996), 0.3529 (1995) Irrevocably\nfixed conversion rate to the euro: Maltese liri (LM) per EUR1 - 0.4293 (2007)"
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Companies",
    "text": "According to HitHorizons, companies registered in Malta generate €\n88,255,174,701 in sales per annum. The company with the highest sales is\nALKAGESTA LTD with € 2.075B followed by HC TRADING MALTA LIMITED and ADVAITA\nTRADE PRIVATE LIMITED with € 1.346B and € 1.253B in sales respectively."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Poverty",
    "text": "Poverty and social exclusion are significant problems in Malta. As of 2008, an\nestimate of 15% of Malta's citizens were living below the poverty line, which\nwas slightly better than the EU average of 17% at the time. To address the\nissue of poverty, on 24 December 2014 Malta addressed poverty in the six\nbranches of social services, health and environment, culture, income and\nsocial benefits, education and employment, by unveiling the National Strategic\nPolicy for Poverty Reduction and Social Inclusion; this will stay in effect\nfrom 2014 to 2024. Under this policy, stakeholders will be involved in the\ndiscussion of how to reduce hardships experienced by families living in Malta."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Unemployment system",
    "text": "Benefits for unemployment are given out based on contributory and non-\ncontributory schemes. Contributory schemes distribute unemployment benefits\nwithin 50 weeks of contribution. Non-contributory schemes a Social\nUnemployment Benefit is granted after a means test to the head of a household.\nIn order to qualify for unemployment benefits, a person must be able to do\nwork and have registered as unemployed.\n\nThere are three categories to the Malta registrar of unemployment. People who\nhave never worked fall into category one. Those who quit or were dismissed\nfrom their jobs fall into category two. Category three is for people who are\ncurrently employed but are looking for other job prospects. Benefits for\nunemployment are given for 156 days after which a person may qualify for the\nmeans tested unemployment assistance. People eligible for unemployment\nbenefits are Maltese citizens who are aged sixteen years or older, people\nsigned up for eligible work-study programs, and citizens outside of Malta who\nare employed by foreign entities.\n\nSome scholars have noted that Malta's unemployment system has created a\ndependency on the benefits provided by the system. From 1992 to 2005, there\nwas an increase in the number of recipients of both short-term and long-term\nbenefits. Additionally, in 2016, 969 Maltese citizens were cut off the\nemployment register for abusing the system. For these reasons, there has been\nmovements from politicians to reduce and reshape the unemployment system.\nAfter the election of the Labour Party in 2013, the number of people receiving\nunemployment benefits dropped by 75%. This same government introduced the \"in-\nwork\" benefit which forces more people to work while helping the most poor and\ndesperate.\n\nIn order to be eligible for in-work benefit, applicants must first have\nchildren under the age of 23, and from that point, benefits vary depending on\nmarital status and the number of people employed per family. For a single\nparent in employment who earns between €6,600-€16,500, they are eligible for a\nmaximum payable rate of up to €1,250 annually per child. For a married couple\nwhose collective income is between €10,000 and is less than €24,000 (the\nincome of one of the spouses must be over €3,000), they are eligible for a\nmaximum payment rate of up to €1,200 annually per child. In 2016, the in-work\nbenefit was extended to married couples where only one parent works, extending\nthe benefit to an additional 3,700 families. For a married couple with only\none parent gainfully employed whose income is greater than €6,600 and less\nthan €16,500, they are eligible for a maximum payable rate of up to €350\nyearly per child. The in-work benefit is paid quarterly in January, April,\nJuly, and October.\n\nAt 42.3% in 2017, female workforce participation rate in Malta is relatively\nlow. For over half of Maltese women who stay out of the workforce altogether,\nthey do not receive direct unemployment benefits. Rather, most unemployment\nbenefits are given to men because to receive unemployment benefits, one must\nfirst be employed. However, because older women tend to stay out of the\nworkforce, those women who do participate in the workforce tend to be younger\nand have higher levels of education. This has led to a lower long-term\nunemployment rate amongst women than men. In 2011, the long-term unemployment\nrate of women was 2.5% while the long-term unemployment rate of men was 3.3%."
  },
  {
    "chapter_name": "Economy of Malta",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Pensions system",
    "text": "Malta has public and private pension systems. There are two types of\ncontributions for the public pension system: class one and class two. Employed\npeople contribute to class one and those are self-employed contribute to class\ntwo. There was a gradual increase in pension age in Malta in the 1950s and\n1960s; for example, someone who was born in 1953 needs to be 62 years old in\norder to collect pensions while another person born in 1960 would have to be\n64 years old in order to collect pensions. Another requirement to qualify for\na Malta pension program is that a person must have been contributing to the\nprogram for a certain time period or they will not be eligible..In Malta there\nis a state Malta Retirement Programme for foreign pensioners. According to the\nprogramme, a foreigner whose income is more than 75% from pension payments,\ncan receive a residence permit in the country and a special tax status."
  }
]