[
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Jamaica** is heavily reliant on services, accounting for 71%\nof the country's GDP. Jamaica has natural resources and a climate conducive to\nagriculture and tourism. The discovery of bauxite in the 1940s and the\nsubsequent establishment of the bauxite-alumina industry shifted Jamaica's\neconomy from sugar, and bananas.\n\nWeakness in the financial sector, speculation, and lower levels of investment\nerode confidence in the productive sector. The government continues its\nefforts to raise new sovereign debt in local and international financial\nmarkets to meet its U.S. dollar debt obligations, to mop up liquidity to\nmaintain the exchange rate and to help fund the current budget deficit.\n\nThe Jamaican government's economic policies encourage foreign investment in\nareas that earn or save foreign exchange, generate employment, and use local\nraw materials. The government also provides a wide range of incentives to\ninvestors.\n\nFree trade zones have stimulated investment in garment assembly, light\nmanufacturing, and data entry by foreign firms. However, over the last 5\nyears[_when?_], the garment industry has suffered from reduced export\nearnings, continued factory closures, and rising unemployment. The Government\nof Jamaica hopes to encourage economic activity through a combination of\nprivatisation, financial sector restructuring, reduced interest rates, and by\nboosting tourism and related productive activities.",
    "openai_summarised_points": [
      "• The economy of Jamaica is predominantly service-oriented, with services accounting for 71% of the country's Gross Domestic Product (GDP).",
      "• Jamaica possesses natural resources and a climate favorable to agriculture and tourism, which are significant sectors of the economy.",
      "• The discovery of bauxite in the 1940s marked a pivotal shift in Jamaica's economic structure, leading to the development of the bauxite-alumina industry.",
      "• The establishment of the bauxite-alumina industry caused a transition away from reliance on traditional exports such as sugar and bananas.",
      "• The Jamaican economy faces vulnerabilities due to weaknesses in the financial sector, including issues related to speculation and lower levels of investment, which undermine confidence in the productive sectors.",
      "• The Jamaican government actively seeks to raise new sovereign debt both domestically and internationally to meet U.S. dollar debt obligations, manage liquidity, stabilize the exchange rate, and fund the current budget deficit.",
      "• Economic policies implemented by the Jamaican government promote foreign investment in sectors that generate or conserve foreign exchange, create employment opportunities, and utilize local raw materials.",
      "• The government offers a broad range of incentives to attract investors, aiming to stimulate economic growth.",
      "• Free trade zones in Jamaica have attracted foreign firms involved in garment assembly, light manufacturing, and data entry, thereby stimulating investment in these sectors.",
      "• Over the past five years, the garment industry in Jamaica has experienced setbacks characterized by reduced export earnings, factory closures, and rising unemployment rates.",
      "• The Jamaican government aims to bolster economic activity through strategies such as privatization, restructuring of the financial sector, reduction of interest rates, and enhancement of tourism and related industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:48:52.309331",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1439,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Before independence, Jamaica's economy was largely focused on agriculture with\nthe vast majority of the labour force engaged in the production of sugar,\nbananas, and tobacco. According to one study, 18th century Jamaica had the\nhighest wealth inequality in the world, as a very small, slave-owning elite\nwas extremely wealthy while the rest of the population lived on the edge of\nsubsistence.\n\nThese products were mainly exported to the United Kingdom, Canada, and to the\nUnited States of America. Jamaica's trade relationships expanded substantially\nfrom 1938 to 1946, with total imports almost doubling from £6,485,000 to\n£12,452,000. After 1962, the Jamaican government pushed for economic growth\nand all sectors excluding bauxite/alumina, energy, and tourism had shrunk\nbetween 1998 and 1999. In 2000, Jamaica experienced its first year of positive\ngrowth since 1995 due to continued tight macroeconomic policies.\n\nInflation fell from 25% in 1995 to single digits in 2000, reaching a\nmultidecade low of 4.3% in 2004. Through periodic intervention in the market,\nthe central bank also has prevented any abrupt drop in the exchange rate. The\nJamaican dollar has been slipping, despite intervention, resulting in an\naverage exchange rate of J$73.40 per US$1.00 and J136.2 per €1.00 (February\n2011). In addition, inflation has been trending upward since 2004 and is\nprojected to once again reach a double digit rate of 12–13% through the year\n2008 due to a combination of unfavorable weather damaging crops and increasing\nagricultural imports and high energy prices.\n\nOver the last 30 years, real per capita GDP increased at an average of just\none per cent per year, making Jamaica one of the slowest growing developing\ncountries in the world.\n\nTo reverse this trajectory, the Government of Jamaica embarked on a\ncomprehensive and ambitious program of reforms for which it has garnered\nnational and international support: a four-year Extended Fund Facility (EFF)\nby the International Monetary Fund (IMF) providing a support package of US$932\nmillion; World Bank Group and the Inter-American Development Bank (IDB)\nprograms providing US$510 million each to facilitate the GoJ's economic reform\nagenda to stabilise the economy, reduce debt and create the conditions for\ngrowth and resilience.. In addition, the International Finance Corporation\n(IFC) and Multilateral Investment Guarantee Agency (MIGA) will continue to\nsupport private sector development.\n\nThe reform program is beginning to bear fruit: Institutional reforms and\nmeasures to improve the environment for the private sector have started to\nrestore confidence in the Jamaican economy. Jamaica jumped 27 places to 58\namong 189 economies worldwide in the 2015 Doing Business ranking, the\ncountry's credit rating has improved and the Government has successfully\nraised more than US$2 billion in the international capital in the markets in\n2014 and 2015..\n\nDespite some revival, economic growth is still low: the Jamaican Government is\nforecasting real gross domestic product (GDP) growth of 1.9 per cent for the\nfiscal year 2015/2016 and the country continues to be confronted by serious\nsocial issues that predominantly affect youth, such as high levels of crime\nand violence and high unemployment. Jamaica, which had seen its poverty rate\ndrop almost 20 per cent over two decades, saw it increase by eight per cent in\na few years.\n\nThe unemployment rate in Jamaica is approximately 6.0% (April 2022,\nStatistical Institute of Jamaica), with youth unemployment more than twice the\nnational rate, albeit trending downwards (15%). However, among Jamaica's\nassets are its skilled labour force and strong social and governance\nindicators.",
    "openai_summarised_points": [
      "• Prior to independence, Jamaica's economy was predominantly agriculture-based, with the majority of the labor force engaged in producing sugar, bananas, and tobacco.",
      "• In the 18th century, Jamaica had the highest wealth inequality globally, characterized by a small, slave-owning elite that was extremely wealthy, while the rest of the population lived on the brink of subsistence.",
      "• The primary export products—sugar, bananas, and tobacco—were mainly shipped to the United Kingdom, Canada, and the United States.",
      "• Jamaica's trade relationships expanded significantly between 1938 and 1946, with total imports nearly doubling from £6,485,000 to £12,452,000.",
      "• After gaining independence in 1962, the Jamaican government prioritized economic growth; however, between 1998 and 1999, all sectors except bauxite/alumina, energy, and tourism experienced contraction.",
      "• In 2000, Jamaica recorded its first year of positive economic growth since 1995, driven by sustained tight macroeconomic policies.",
      "• Inflation decreased from 25% in 1995 to single digits by 2000, reaching a multi-decade low of 4.3% in 2004.",
      "• The Bank of Jamaica has periodically intervened in the market to prevent sharp declines in the exchange rate; despite interventions, the Jamaican dollar has depreciated, with an average exchange rate of J$73.40 per US$1.00 and J$136.2 per €1.00 as of February 2011.",
      "• Since 2004, inflation has trended upward, with projections indicating it could reach 12–13% in 2008 due to adverse weather damaging crops, rising agricultural imports, and high energy prices.",
      "• Over the past 30 years, Jamaica's real per capita GDP has grown at an average rate of only 1% annually, making it one of the slowest-growing developing countries.",
      "• To address economic stagnation, the Jamaican government initiated a comprehensive reform program supported by both domestic and international entities, including:",
      "• A four-year Extended Fund Facility (EFF) from the IMF totaling US$932 million.",
      "• Support from the World Bank Group and the Inter-American Development Bank (IDB), each providing US$510 million to aid economic stabilization, debt reduction, and growth.",
      "• Continued support for private sector development from the International Finance Corporation (IFC) and the Multilateral Investment Guarantee Agency (MIGA).",
      "• The reform efforts have begun to yield positive results:",
      "• Institutional reforms and measures to improve the business environment have started restoring confidence in the economy.",
      "• Jamaica improved 27 places in the 2015 Doing Business ranking to position 58 among 189 economies worldwide.",
      "• The country's credit rating has improved, and the government successfully raised over US$2 billion in international capital markets during 2014 and 2015.",
      "• Despite some economic revival, growth remains modest, with a forecasted real GDP growth of 1.9% for fiscal year 2015/2016.",
      "• Jamaica continues to face significant social challenges, including high crime and violence rates and elevated unemployment levels.",
      "• The poverty rate, which had decreased by nearly 20% over two decades, increased by 8% in recent years.",
      "• The unemployment rate as of April 2022 stands at approximately 6.0%, according to the Statistical Institute of Jamaica, with youth unemployment more than twice the national rate at around 15%, though this figure is trending downward.",
      "• Jamaica's notable assets include a skilled labor force and strong social and governance indicators."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:05.620983",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3693,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "Agricultural production is an important contributor to Jamaica's economy.\nHowever, it is vulnerable to extreme weather, such as hurricanes and to\ncompetition from neighbouring countries such as the USA. Other difficulties\nfaced by farmers include thefts from the farm, known as praedial larceny.\nAgricultural production accounted for 7.4% of GDP in 1997, providing\nemployment for nearly a quarter of the country. Jamaica's agriculture,\ntogether with forestry and fishing, accounted for about 6.6% of GDP in 1999.\nSugar has been produced in Jamaica for centuries, it is the nation's dominant\nagricultural export. Sugar is produced in nearly every parish. The production\nof raw sugar in the year 2000 was estimated at 175,000 tons, a decrease from\n290,000 tons in 1978.\n\nJamaican agriculture has been less prominent in GDP in the 2000s than other\nindustries, hitting an all-time low between 2004 and 2008. This may have been\ndue to a reaction to increased competition as international trade policies\nwere enacted. For example, as NAFTA was enacted in 1993, a significant amount\nof Caribbean exports to the United States diminished, being out competed by\nLatin American exports. Another example is the Banana Import Regime's 3rd\nphase, in which EU nations had first given priority in banana imports to\npreviously colonised nations. Under pressure by the World Trade Organization,\nthe EU policy was altered to provide a non-discriminatory trade agreement.\nJamaica's banana industry was easily outpriced by American companies exporting\nLatin American goods. Jamaica's agriculture industry is now bouncing back,\ngrowing from being 6.6% of GDP to 7.2%.\n\nSugar formed 7.1% of the exports in 1999 and Jamaica made up about 4.8% of the\ntotal production of sugar in the Caribbean. Sugar is also used for the\nproduction of by-products such as molasses, rum and some wallboard is made\nfrom bagasse.\n\nBanana production in 1999 was 130,000 tons. Bananas formed 2.4% of the exports\nin 1999 and Jamaica formed around 7.5% of the total production of banana in\nthe Caribbean. Jamaica stopped exporting banana in 2008 after suffering from\nseveral years of hurricanes that devastated the plantations.\n\nCoffee is mainly grown around the Blue Mountains and in hilly areas. One type\nin particular, Jamaican Blue Mountain Coffee, is considered among the best in\nthe world because at those heights in the Blue Mountains, the cooler climate\ncauses the berries to take longer to ripen and the beans develop more of the\nsubstances which on roasting give coffee its flavor. Coffee formed 1.9% of\nexports in 1999. The picking season lasts from August to March. The coffee is\nexported from Kingston.\n\nCocoa is grown throughout Jamaica and local sales absorb about 1/3 of the\noutput to be made into instant drinks and confectionery. Citrus fruit is\nmainly grown in the central parts of Jamaica, particularly between the\nelevations of 1,000–2,500 feet. The picking season lasts from November to\nApril. Two factories in Bog Walk produce fruit juices, canned fruit, essential\noils and marmalade. Coconuts are grown on the northern and eastern coasts,\nwhich provide enough copra to supply factories to make butterine, margarine,\nlard, edible oil and laundry soap.\n\nVanilla is also grown.\n\nOther export crops are pimento, ginger, tobacco, sisal and other fruit are\nexported. Rice is grown around swampy areas around the Black River & around\nLong Bay in Hanover and Westmoreland parishes for local consumption.\n\nAs tastes have changed in Jamaica in favour of more meat and packaged food the\nnational food import bill has grown to the point that it threatens the health\nof the economy. The government has responded by encouraging gardening and\nfarming, a response which has had limited success. For example, the percentage\nof potatoes grown locally has increased, but imports of french fries have\ncontinued at a high level.",
    "openai_summarised_points": [
      "• Agricultural production is a significant contributor to Jamaica's economy, providing employment for nearly a quarter of the population.",
      "• The sector is vulnerable to extreme weather events such as hurricanes and faces competition from neighboring countries, notably the USA.",
      "• Farmers in Jamaica encounter challenges including praedial larceny, which is theft from farms.",
      "• In 1997, agriculture accounted for 7.4% of Jamaica's Gross Domestic Product (GDP).",
      "• The agricultural sector, combined with forestry and fishing, contributed approximately 6.6% to GDP in 1999.",
      "• Sugar has been produced in Jamaica for centuries and remains the nation's dominant agricultural export, produced across nearly every parish.",
      "• Raw sugar production in 2000 was estimated at 175,000 tons, representing a decline from 290,000 tons produced in 1978.",
      "• During the 2000s, Jamaican agriculture's share of GDP declined further, reaching an all-time low between 2004 and 2008, partly due to increased international competition.",
      "• The enactment of NAFTA in 1993 led to a significant reduction in Caribbean exports to the United States, as Latin American exports outcompeted Jamaican products.",
      "• The EU's Banana Import Regime's third phase prioritized imports to previously colonized nations, but under WTO pressure, EU policy shifted to a non-discriminatory trade agreement, adversely affecting Jamaica's banana industry.",
      "• Jamaican banana exports declined after 2008 due to hurricane damage and increased competition, with Jamaica producing about 130,000 tons in 1999, accounting for 2.4% of Caribbean banana exports and approximately 7.5% of regional banana production.",
      "• Sugar constituted 7.1% of Jamaica's exports in 1999 and represented about 4.8% of the Caribbean's total sugar production.",
      "• Sugar is also processed into by-products such as molasses, rum, and some wallboard made from bagasse.",
      "• Coffee production in Jamaica, mainly around the Blue Mountains and hilly areas, is renowned globally, especially Jamaican Blue Mountain Coffee, valued for its unique flavor developed due to cooler high-altitude climates.",
      "• Coffee accounted for 1.9% of exports in 1999, with the picking season from August to March, and is exported from Kingston.",
      "• Cocoa is cultivated throughout Jamaica, with about one-third of output used locally for instant drinks and confectionery.",
      "• Citrus fruits are primarily grown in central Jamaica at elevations between 1,000 and 2,500 feet, with a harvesting season from November to April.",
      "• Two factories in Bog Walk produce fruit juices, canned fruits, essential oils, and marmalade from citrus.",
      "• Coconuts are cultivated on the northern and eastern coasts, providing copra for manufacturing butterine, margarine, lard, edible oil, and laundry soap.",
      "• Vanilla is also cultivated as an export crop.",
      "• Other export crops include pimento, ginger, tobacco, sisal, and various fruits.",
      "• Rice is grown in swampy areas around Black River, Long Bay in Hanover, and Westmoreland parishes primarily for local consumption.",
      "• Changing dietary preferences towards more meat and packaged foods have increased Jamaica's food import bill, posing a threat to the economy.",
      "• The government has promoted gardening and farming to boost local food production, with limited success; for example, local potato cultivation has increased, but imports of French fries remain high."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:14.219767",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3883,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Animal husbandry",
    "text": "Cows Grazing, Saint Ann Parish 2023\n\nPastures form a good percentage of the land in Jamaica. Many properties\nspecialise in cattle rearing. Livestock holdings include 400,000 head of\ncattle, 440,000 goats and 180,000 pigs. Dairying has increased since the\nerection of a condensed milk factory at Bog Walk in 1940. Even so, the supply\nof dairy products is not enough for local requirements and there are large\nimports of powdered milk, butter and cheese.",
    "openai_summarised_points": [
      "• Pastures constitute a significant portion of land in Jamaica, supporting the country's livestock industry.",
      "• Many properties in Jamaica specialize in cattle rearing, contributing to the agricultural sector.",
      "• The total livestock holdings in Jamaica include approximately 400,000 head of cattle, 440,000 goats, and 180,000 pigs.",
      "• Dairying activities in Jamaica have increased since the establishment of a condensed milk factory at Bog Walk in 1940.",
      "• Despite the growth in dairy production, the domestic supply of dairy products remains insufficient to meet local demand.",
      "• As a result of the shortfall, Jamaica imports large quantities of powdered milk, butter, and cheese to supplement local production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:16.276267",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 452,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Fishing",
    "text": "White River Fishing Village is in Ocho Rios, St. Ann\n\nThe fishing industry grew during the 1900s, primarily from the focus on inland\nfishing. Several thousand fishermen make a living from fishing. The shallow\nwaters and cays off the south coast are richer than the northern waters. Other\nfishermen live on the Pedro Cays, 80 miles (130 km) to the south of Jamaica.\nJamaica supplies about half of its fish requirements; major imports of frozen\nand salted fish are imported from the United States and Canada.\n\nThe total catch in 2000 was 5,676 tons, a decrease from 11,458 tons in 1997;\nthe catch was mainly marine, with freshwater carp, barbel, etc., crustaceans &\nmolluscs.",
    "openai_summarised_points": [
      "• White River Fishing Village is located in Ocho Rios, St. Ann, Jamaica.",
      "• The fishing industry in Jamaica experienced growth during the 1900s, primarily driven by an increased focus on inland fishing activities.",
      "• Several thousand fishermen are engaged in the industry, earning their livelihoods through fishing.",
      "• The waters off the south coast of Jamaica, including the surrounding cays, are richer in marine resources compared to the northern waters.",
      "• Some fishermen operate from the Pedro Cays, which are situated approximately 80 miles (130 km) south of Jamaica.",
      "• Jamaica is able to supply about 50% of its own fish requirements domestically.",
      "• The country imports major quantities of frozen and salted fish from the United States and Canada to meet the remaining demand.",
      "• The total fish catch in Jamaica was 5,676 tons in the year 2000, representing a significant decrease from 11,458 tons recorded in 1997.",
      "• The majority of the catch is marine-based, including species such as fish from the sea, along with freshwater species like carp and barbel.",
      "• In addition to fish, the catch includes crustaceans and molluscs, contributing to the diversity of marine resources harvested."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:20.475483",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 673,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Forestry",
    "text": "By the late 1890, only 185,000 hectares (460,000 acres) of Jamaica's original\n1,000,000 hectares (2,500,000 acres) of forest remained. Roundwood production\nwas 881,000 cu m (31.1 million cu ft) in 2000. About 68% of the timber cut in\n2000 was used as fuel wood while 32% was used for industrial use. The forests\nthat once covered Jamaica now exist only in mountainous areas. They only\nsupply 20% of the island timber requirements. The remaining forest is\nprotected from further exploitation. Other accessible mountain areas are being\nreforested, mainly with pines, mahoe and mahogany.",
    "openai_summarised_points": [
      "• By the late 1890s, Jamaica's original forest cover had diminished significantly, with only 185,000 hectares (460,000 acres) remaining out of an initial 1,000,000 hectares (2,500,000 acres).",
      "• In the year 2000, Jamaica's roundwood production was recorded at 881,000 cubic meters (31.1 million cubic feet).",
      "• Approximately 68% of the timber harvested in 2000 was utilized as fuel wood, while the remaining 32% was designated for industrial purposes.",
      "• The forests that once extensively covered Jamaica now predominantly exist only in mountainous regions, indicating significant deforestation of lowland areas.",
      "• These remaining mountain forests supply merely 20% of the island's total timber requirements, highlighting a substantial shortfall in domestic timber production.",
      "• The majority of the remaining forest areas are under protection to prevent further exploitation and deforestation.",
      "• Efforts are underway to reforest accessible mountain areas, with a focus on planting species such as pines, mahoe, and mahogany to restore forest cover."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:24.662860",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 584,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Mining",
    "text": "Windalco, Alumina plant in the background (Kirkvine, Manchester)\n\nJamaica was the third-leading producer of bauxite and alumina in 1998,\nproducing 12.6 million tons of bauxite, accounting for 10.4% of world\nproduction, and 3.46 million tons of alumina, accounting for 7.4% of world\nproduction. 8,540 million tons of bauxite was mined in 2012 and 10,200 million\ntons of bauxite in 2011.\n\nMining and quarrying made up 4.1% of the nation's gross domestic product in\n1999. Bauxite and alumina formed 55.2% of exports in 1999 and are the second-\nleading money earner after tourism. Jamaica has reserves of over 2 billion\ntonnes, which are expected to last 100 years. Bauxite is found in the central\nparishes of St. Elizabeth, Manchester, Clarendon, St. Catherine, St. Ann, and\nTrelawny. There are four alumina plants and six mines.\n\nJamaica has deposits of several million tons of gypsum on the southern slopes\nof the Blue Mountains. Jamaica produced 330,441 tons of gypsum in the year\n2000, some of which was used in the local cement industry and in the\nmanufacturing of building materials.\n\nOther minerals present in Jamaica include marble, limestone, and silica, as\nwell as ores of copper, lead, zinc, manganese and iron. Some of these are\nworked in small quantities. Petroleum has been sought, but so far none has\nbeen found.",
    "openai_summarised_points": [
      "• In 1998, Jamaica was the third-leading producer of bauxite and alumina globally, producing 12.6 million tons of bauxite, which accounted for 10.4% of world production, and 3.46 million tons of alumina, representing 7.4% of global output.",
      "• In 2012, Jamaica mined 8,540 million tons of bauxite, and in 2011, the country mined 10,200 million tons of bauxite, indicating fluctuations in production levels over these years.",
      "• Mining and quarrying contributed approximately 4.1% to Jamaica's gross domestic product (GDP) in 1999.",
      "• In 1999, bauxite and alumina exports constituted 55.2% of Jamaica’s total exports, making them the second-largest source of foreign exchange earnings after tourism.",
      "• Jamaica's bauxite reserves exceed 2 billion tonnes, with an expected lifespan of approximately 100 years based on current extraction rates.",
      "• Bauxite deposits are primarily located in the central parishes of St. Elizabeth, Manchester, Clarendon, St. Catherine, St. Ann, and Trelawny.",
      "• The country has four alumina processing plants and six bauxite mines.",
      "• Jamaica possesses deposits of several million tons of gypsum on the southern slopes of the Blue Mountains; in 2000, the country produced 330,441 tons of gypsum.",
      "• Gypsum produced in Jamaica is utilized locally in the cement industry and in manufacturing building materials.",
      "• Other minerals found in Jamaica include marble, limestone, silica, and ores of copper, lead, zinc, manganese, and iron, though these are mined in small quantities.",
      "• Petroleum exploration has been conducted in Jamaica; however, no commercial oil reserves have been discovered to date."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:28.859794",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1324,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Manufacturing",
    "text": "The manufacturing sector is an essential contributor to the Jamaican economy.\nThough manufacturing accounted for 13.9% of GDP in 1999. Jamaican companies\ncontribute many manufactures such as food processing; oil refining; produced\nchemicals, construction materials, plastic goods, paints, pharmaceuticals,\ncartons, leather goods and cigars & assembled electronics, textiles and\napparel. The garment industry is a major job employer for thousands of\nhundreds of locals and they formed 12.9% of exports in 1999 earning US$159\nmillion. Chemicals formed 3.3% of the exports in 1999 earning US$40 million.\n\nA portion of the bauxite mined on the island is processed into alumina before\nexport.\n\nAn oil refinery is located near Kingston converts crude petroleum obtained\nfrom Venezuela into gasoline and other products. These are mainly for local\nuse. The construction industry is growing due to new hotels and attractions\nbeing built for tourism. Construction and installation formed 10.4% of the GDP\nin 1999.\n\nManufactured goods were imported and formed 30.3% of the imports and cost\nUS$877 million in 1999.\n\nSince the launch of the Jamaican Logistics Hub initiative, various economic\nzones have been proposed throughout the country to assemble goods from other\nparts of the world for distribution to the Americas.",
    "openai_summarised_points": [
      "• The manufacturing sector is a vital component of Jamaica's economy, contributing significantly to its economic activities.",
      "• In 1999, manufacturing accounted for 13.9% of Jamaica's Gross Domestic Product (GDP).",
      "• Jamaican manufacturing companies produce a diverse range of products, including food processing, oil refining, chemicals, construction materials, plastic goods, paints, pharmaceuticals, cartons, leather goods, cigars, assembled electronics, textiles, and apparel.",
      "• The garment industry is a major employer, providing jobs to thousands of local residents and representing 12.9% of Jamaica's exports in 1999, with export earnings of US$159 million.",
      "• Chemicals constituted 3.3% of the country's exports in 1999, generating US$40 million in revenue.",
      "• A portion of the bauxite mined in Jamaica is processed into alumina before being exported.",
      "• Jamaica operates an oil refinery located near Kingston that converts crude petroleum imported from Venezuela into gasoline and other petroleum products primarily for domestic consumption.",
      "• The construction industry is experiencing growth due to the development of new hotels and tourist attractions, supporting Jamaica’s tourism sector.",
      "• In 1999, the construction and installation sector contributed 10.4% to the GDP.",
      "• Manufactured goods were imported into Jamaica, constituting 30.3% of total imports, with a total import value of US$877 million in 1999.",
      "• The Jamaican Logistics Hub initiative has led to the proposal of various economic zones across the country, aimed at assembling goods from other regions for distribution throughout the Americas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:32.343034",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1309,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Tourism",
    "text": "Tourism is tied with remittances as Jamaica's top source of revenue. The\ntourism industry earns over 50 per cent of the country's total foreign\nexchange earnings and provides about one-fourth of all jobs in Jamaica. Most\ntourist activity is centered on the island's northern coast, including the\ncommunities of Montego Bay, Ocho Rios, and Port Antonio, as well as in Negril\non the island's western tip.\n\nKFC Draxhall\n\nSome destinations include Ocho Rios, Green Grotto Caves, Y.S. Falls and\nAppleton Estate. Most of the tourist sites are landmarks as well as homes for\nmany Jamaicans. Many of the most frequented tourist sites are located mainly\nby water such as rivers and beaches where fishermen make a living from\nseafood. One of the most famous beach towns in Jamaica is Ocho Rios, a located\nin the parish of Saint Ann on the north coast of Jamaica. It was once a\nfishing village but now attracts millions of tourists yearly. The site is\npopular today because of the food and culture that can be found there.\n\nAnother famous location in Jamaica that attracts millions yearly is Dunn's\nRiver Falls, located in Ocho Rios; this waterfall is approximately 600 feet\nlong and runs off into the sea. Around the location many hotels and\nrestaurants are available and many street vendors sell food around the clock.\nAnother well-known beach town is Negril, the party capital of the country.\nThis beach town has many different factors to add to the night life.",
    "openai_summarised_points": [
      "• Tourism, alongside remittances, is Jamaica's top source of revenue, significantly contributing to the national economy.",
      "• The tourism industry accounts for over 50 percent of Jamaica's total foreign exchange earnings.",
      "• Tourism provides approximately one-fourth (25%) of all employment opportunities in Jamaica.",
      "• Most tourist activity is concentrated along Jamaica's northern coast, including key communities such as Montego Bay, Ocho Rios, and Port Antonio, as well as in Negril on the western tip of the island.",
      "• Notable tourist destinations include Ocho Rios, Green Grotto Caves, Y.S. Falls, and Appleton Estate.",
      "• Many of Jamaica's popular tourist sites are landmarks that also serve as residences for many Jamaicans.",
      "• The majority of frequented tourist sites are located near water bodies, such as rivers and beaches, where local fishermen sustain livelihoods through seafood harvesting.",
      "• Ocho Rios, situated in the parish of Saint Ann on Jamaica's north coast, is one of the most famous beach towns; it transitioned from a fishing village to a major tourist attraction hosting millions of visitors annually.",
      "• Ocho Rios is renowned for its local food and cultural experiences that draw tourists.",
      "• Dunn's River Falls, located in Ocho Rios, is approximately 600 feet long and flows directly into the sea, making it a major natural attraction.",
      "• The area surrounding Dunn's River Falls features numerous hotels and restaurants, along with street vendors selling food around the clock.",
      "• Negril is known as the party capital of Jamaica, contributing significantly to the country's nightlife and entertainment scene.",
      "• Negril's diverse factors, including vibrant nightlife, contribute to its popularity among tourists."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:36.337674",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1453,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Logistics",
    "text": "In April 2014, the Governments of Jamaica and China signed the preliminary\nagreements for the first phase of the Jamaican Logistics Hub (JLH) – the\ninitiative that aims to position Kingston as the fourth node in the global\nlogistics chain, joining Rotterdam, Dubai and Singapore, and serving the\nAmericas. The Project, when completed, is expected to provide many jobs for\nJamaicans, Economic Zones for multinational companies and much needed economic\ngrowth to alleviate the country's heavy debt-to-GDP ratio. Strict adherence to\nthe IMF's refinancing programme and preparations for the JLH has favourably\naffected Jamaica's credit rating and outlook from the three biggest rating\nagencies.",
    "openai_summarised_points": [
      "• In April 2014, the Governments of Jamaica and China signed preliminary agreements for the first phase of the Jamaican Logistics Hub (JLH).",
      "• The JLH initiative aims to position Kingston as the fourth global logistics node, joining Rotterdam, Dubai, and Singapore, to serve the Americas.",
      "• Upon completion, the project is expected to generate numerous employment opportunities for Jamaicans.",
      "• The development will establish Economic Zones designed to attract multinational companies.",
      "• The JLH is anticipated to stimulate significant economic growth, helping to reduce Jamaica’s heavy debt-to-GDP ratio.",
      "• The project’s progress and Jamaica’s adherence to the IMF’s refinancing programme have positively influenced the country's credit rating and outlook.",
      "• The improvements in credit ratings have been recognized by the three major rating agencies, reflecting enhanced investor confidence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:49:38.794397",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 690,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "1.9",
    "section_name": "ICT/BPO",
    "text": "Jamaica has made strides in developing its Information and Communications\nTechnology (ICT) infrastructure.\n\nAs the largest English speaking territory in the Caribbean, Jamaica is the\nregion's leading contact centre location with over 87 information\ncommunications technology/business process outsourcing (ICT/BPO) companies\noperating in the country employing 44,000 full-time agents."
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Taxation/Tax Rates",
    "text": "Jamaican tax rates are extremely favourable in world standards, the brackets\nare as follows:\n\nBand | Personal Allowance (J$) | Tax Rate\n---|---|---\n1 (Lower) -Up to | J$1,500,000 | 0%\n2 (Middle) – J$1,500,001-J$6,000,000 | J$1,500,000 | 25%\n3 (Upper) – J$6,000,000+ | J$0 | 30%\n\nSeparate Tax Rates apply for foreign nationals."
  },
  {
    "chapter_name": "Economy of Jamaica",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Economic Data",
    "text": "The following table shows the main economic indicators in 1980–2024. Inflation\nbelow 5% is in green.\n\nYear  | GDP\n(in bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bil. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---\n1980  | 6.5  | 3,089  | 2.6  | −4.0  | 18.0  | 27.3  | n/a\n1981  | 7.5  | 3,469  | 2.8  | 4.4  | 9.2  | 25.9  | n/a\n1982  | 8.2  | 3,733  | 3.2  | 3.1  | 6.8  | 27.6  | n/a\n1983  | 8.8  | 3,961  | 2.9  | 4.2  | 16.7  | 26.4  | n/a\n1984  | 9.2  | 4,134  | 2.1  | 1.0  | 31.3  | 25.5  | n/a\n1985  | 9.4  | 4163  | 2.0  | −0.9  | 29.7  | 25.0  | n/a\n1986  | 10.3  | 4,504  | 2.4  | 7.0  | 24.4  | 23.7  | n/a\n1987  | 11.4  | 4,935  | 2.7  | 7.7  | 11.2  | 21.0  | n/a\n1988  | 11.3  | 4,876  | 3.2  | −4.0  | 8.2  | 19.1  | n/a\n1989  | 12.3  | 5,295  | 3.7  | 4.7  | 16.1  | 15.2  | n/a\n1990  | 13.4  | 5,662  | 4.7  | 4.9  | 24.8  | 15.7  | n/a\n1991  | 14.0  | 5,863  | 4.3  | 0.8  | 51.0  | 15.4  | n/a\n1992  | 14.7  | 6,117  | 4.3  | 2.8  | 77.3  | 15.7  | n/a\n1993  | 15.4  | 6,348  | 5.4  | 2.2  | 21.6  | 16.3  | n/a\n1994  | 16.0  | 6,548  | 5.5  | 1.9  | 35.5  | 15.4  | n/a\n1995  | 16.7  | 6,792  | 6.5  | 2.5  | 19.9  | 16.2  | n/a\n1996  | 17.1  | 6,868  | 7.4  | 0.2  | 26.4  | 16.0  | n/a\n1997  | 17.1  | 6,805  | 8.4  | −1.6  | 9.7  | 16.5  | n/a\n1998  | 17.1  | 6,732  | 8.8  | −1.2  | 8.6  | 15.5  | n/a\n1999  | 17.5  | 6,829  | 8.9  | 1.0  | 6.0  | 15.7  | 82.7\n2000  | 18.0  | 6,973  | 9.1  | 0.8  | 8.1  | 15.5  | 91.8\n2001  | 18.6  | 7,158  | 9.2  | 1.3  | 6.9  | 15.0  | 108.0\n2002  | 19.1  | 7,277  | 9.7  | 0.7  | 7.0  | 14.2  | 118.4\n2003  | 20.2  | 7,665  | 9.4  | 3.7  | 10.1  | 11.8  | 123.2\n2004  | 21.0  | 7,947  | 10.2  | 1.3  | 13.5  | 12.2  | 119.9\n2005  | 21.8  | 8,239  | 11.2  | 0.9  | 15.1  | 11.2  | 124.7\n2006  | 23.1  | 8,709  | 11.9  | 2.9  | 8.5  | 10.3  | 117.1\n2007  | 24.1  | 9,042  | 12.9  | 1.4  | 9.3  | 9.9  | 114.5\n2008  | 24.4  | 9,108  | 13.7  | −0.8  | 22.0  | 10.6  | 127.0\n2009  | 23.7  | 8,821  | 12.1  | −3.4  | 9.6  | 11.4  | 141.9\n2010  | 23.6  | 8,769  | 13.2  | −1.4  | 12.6  | 12.4  | 141.4\n2011  | 24.5  | 9,053  | 14.4  | 1.4  | 7.5  | 12.4  | 139.5\n2012  | 24.8  | 9,151  | 14.8  | −0.5  | 6.9  | 13.9  | 143.9\n2013  | 25.3  | 9,316  | 14.2  | 0.2  | 9.4  | 15.3  | 138.7\n2014  | 25.9  | 9,525  | 13.9  | 0.6  | 8.3  | 13.8  | 137.9\n2015  | 26.3  | 9,683  | 14.2  | 0.9  | 3.7  | 13.5  | 121.9\n2016  | 27.0  | 9,914  | 14.1  | 1.5  | 2.4  | 13.2  | 113.7\n2017  | 27.7  | 10,144  | 14.8  | 0.7  | 4.4  | 11.7  | 101.2\n2018  | 28.3  | 10,363  | 15.6  | 1.8  | 3.7  | 9.1  | 94.4\n2019  | 28.5  | 10,412  | 15.8  | 1.0  | 3.9  | 7.7  | 94.3\n2020  | 25.5  | 9,298  | 13.9  | −9.9  | 5.2  | 10.2  | 109.7\n2021  | 27.2  | 9,917  | 14.7  | 4.6  | 5.9  | 8.4  | 94.2\n2022  | 30.6  | 11,167  | 17.0  | 5.2  | 10.3  | 6.3  | 77.0\n2023  | 32.6  | 11,856  | 19.3  | 2.6  | 6.5  | 4.4  | 73.3\n2024  | 33.8  | 12,283  | 20.6  | 1.3  | 5.8  | n/a  | 67.9"
  }
]