[
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Bangladesh is a major developing mixed economy. As the second-\nlargest economy in South Asia, Bangladesh's economy is the 35th largest in the\nworld in nominal terms, and 25th largest by purchasing power parity.\nBangladesh is seen by various financial institutions as one of the Next\nEleven. It has been transitioning from being a frontier market into an\nemerging market. Bangladesh is a member of the South Asian Free Trade Area and\nthe World Trade Organization. In fiscal year 2021–2022, Bangladesh registered\na GDP growth rate of 7.2% after the global pandemic. Bangladesh is one of the\nfastest growing economies in the world.\n\nIndustrialisation in Bangladesh received a strong impetus after the partition\nof India due to labour reforms and new industries. Between 1947 and 1971, East\nBengal generated between 70% and 50% of Pakistan's exports. Modern Bangladesh\nembarked on economic reforms in the late 1970s which promoted free markets and\nforeign direct investment. By the 1990s, the country had a booming ready-made\ngarments industry. As of 16 March 2024, Bangladesh has the highest number of\ngreen garment factories in the world with Leadership in Energy and\nEnvironmental Design (LEED) certification from the United States Green\nBuilding Council (USGBC), where 80 are platinum-rated, 119 are gold-rated, 10\nare silver, and four are without any rating. As of 6 March 2024, Bangladesh is\nhome to 54 of the top 100 LEED Green Garment Factories globally, including 9\nout of the top 10, and 18 out of the top 20. As of 27 April 2024, Bangladesh\nhas a growing pharmaceutical industry with 12 percent average annual growth\nrate. Bangladesh is the only nation among the 48 least-developed countries\nthat is almost self-sufficient when it comes to medicine production as local\ncompanies meet 98 percent of the domestic demand for pharmaceuticals.\nRemittances from the large Bangladeshi diaspora became a vital source of\nforeign exchange reserves. Agriculture in Bangladesh is supported by\ngovernment subsidies and ensures self-sufficiency in food production.\nBangladesh has pursued export-oriented industrialisation.\n\nBangladesh experienced robust growth after the pandemic with macroeconomic\nstability, improvements in infrastructure, a growing digital economy, and\ngrowing trade flows. Tax collection remains very low, with tax revenues\naccounting for only 7.7% of GDP. Bangladesh's banking sector has a large\namount of non-performing loans or loan defaults, which have caused a lot of\nconcern. The private sector makes up 80% of GDP. The Dhaka Stock Exchange and\nChittagong Stock Exchange are the two stock markets of the country. Most\nBangladeshi businesses are privately owned small and medium-sized enterprises\n(SME) which make up 90% of all businesses.",
    "openai_summarised_points": [
      "• The economy of Bangladesh is classified as a major developing mixed economy, characterized by both private and public sector participation.",
      "• It is the second-largest economy in South Asia, ranking as the 35th largest in the world in nominal gross domestic product (GDP) terms and the 25th largest when measured by purchasing power parity (PPP).",
      "• Various financial institutions recognize Bangladesh as one of the Next Eleven economies, indicating its potential for significant future growth.",
      "• Bangladesh has been transitioning from a frontier market to an emerging market, reflecting improvements in economic stability and investment climate.",
      "• The country is a member of the South Asian Free Trade Area (SAFTA) and the World Trade Organization (WTO), facilitating regional and global trade integration.",
      "• In the fiscal year 2021–2022, Bangladesh achieved a GDP growth rate of 7.2% following the global COVID-19 pandemic, marking one of the fastest growth rates worldwide.",
      "• Bangladesh is considered one of the world's fastest-growing economies, driven by various structural reforms and sectoral developments.",
      "• Industrialization in Bangladesh accelerated significantly after the partition of India, due to labor reforms and the emergence of new industries.",
      "• Between 1947 and 1971, East Bengal (now Bangladesh) contributed between 50% and 70% of Pakistan’s exports, highlighting its economic importance even before independence.",
      "• Modern Bangladesh began implementing economic reforms in the late 1970s, focusing on promoting free markets and attracting foreign direct investment (FDI).",
      "• By the 1990s, Bangladesh developed a booming ready-made garments (RMG) industry, which became a cornerstone of its export sector.",
      "• As of 16 March 2024, Bangladesh has the highest number of green garment factories globally, with Leadership in Energy and Environmental Design (LEED) certification from the US Green Building Council (USGBC).",
      "• The green garment factories in Bangladesh include 80 platinum-rated, 119 gold-rated, 10 silver-rated, and four without any rating, reflecting a strong commitment to sustainable manufacturing.",
      "• As of 6 March 2024, Bangladesh hosts 54 of the top 100 LEED Green Garment Factories worldwide, including 9 of the top 10 and 18 of the top 20, indicating global leadership in eco-friendly apparel manufacturing.",
      "• The pharmaceutical industry in Bangladesh is growing at an average annual rate of 12%, with the country almost self-sufficient in medicine production, meeting 98% of domestic demand.",
      "• Bangladesh is unique among the 48 least-developed countries in nearly achieving self-sufficiency in pharmaceuticals, with local companies dominating the market.",
      "• Remittances from the Bangladeshi diaspora are a vital source of foreign exchange reserves, supporting the country’s balance of payments and economic stability.",
      "• Agriculture in Bangladesh is supported by government subsidies and ensures food self-sufficiency, contributing to national food security.",
      "• The country has pursued an export-oriented industrialization strategy to promote economic growth and diversification.",
      "• Post-pandemic, Bangladesh experienced robust economic growth characterized by macroeconomic stability, infrastructure improvements, a burgeoning digital economy, and increased trade flows.",
      "• Tax revenues in Bangladesh are relatively low, constituting only 7.7% of GDP, indicating challenges in tax collection and fiscal policy.",
      "• The banking sector faces concerns due to a significant volume of non-performing loans (NPLs) or loan defaults, impacting financial stability.",
      "• The private sector accounts for approximately 80% of Bangladesh’s GDP, emphasizing its dominant role in economic activity.",
      "• The Dhaka Stock Exchange and the Chittagong Stock Exchange are the two primary stock markets in Bangladesh.",
      "• Most Bangladeshi businesses are privately owned small and medium-sized enterprises (SMEs), which constitute about 90% of all business entities in the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:32:21.486895",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2773,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Precolonial period",
    "text": "This African giraffe was imported into Bengal region and re-exported to China\ncirca 1415. The major maritime trade routes of the Bengal Sultanate\n\nPunch-marked coins are the earliest form of currency found in Bangladesh\n(Bengal region of Ancient India), dating back to the Iron Age and the first\nmillennium BCE. 1st century Roman coins with images of Hercules have been\nexcavated in Bangladesh and point to trade links with the Roman world. The\nWari-Bateshwar ruins are believed to be the emporium (trading center) of\nSounagoura mentioned by Roman geographer Claudius Ptolemy. The eastern segment\nof Bengal was a historically prosperous region. The Ganges Delta provided\nadvantages of a mild, almost tropical climate, fertile soil, ample water, and\nan abundance of fish, wildlife, and fruit. Living standards for the elite were\ncomparatively better than other parts of the Indian subcontinent. Trade routes\nlike the Grand Trunk Road, Tea Horse Road and Silk Road connected the region\nto the wider neighborhood. Between 400 and 1200, the region had a well-\ndeveloped economy in terms of land ownership, agriculture, livestock,\nshipping, trade, commerce, taxation, and banking. Muslim trade with Bengal\nincreased after the fall of the Sasanian Empire and the Arab takeover of\nPersian trade routes. Much of this trade occurred east of the Meghna River in\nsoutheastern Bengal. After 1204, Muslim conquerors inherited the gold and\nsilver reserves of pre-Islamic kingdoms.\n\nThe Bengal Sultanate presided over a mercantile empire of its own. Bengali\nships were the largest ships in the Bay of Bengal and other parts of the\nIndian Ocean trade network. Ship-owning merchants often acted as royal envoys\nof the Sultan. A large number of wealthy Bengali merchants and shipowners\nlived in Malacca. A vessel from Bengal transported embassies from Brunei and\nSumatra to China. Bengal and the Maldives operated the largest shell currency\nnetwork in history. A Masai giraffe from Malindi in Africa was shipped to\nBengal and later gifted to the Emperor of China as a gift from the Sultan of\nBengal. The rulers of Arakan looked to Bengal for economic, political and\ncultural capital. The Sultan of Bengal financed projects in the Hejaz region\nof Arabia.\n\nUnder Mughal rule, Bengal operated as a centre of the worldwide muslin, silk\nand pearl trades. Domestically, much of India depended on Bengali products\nsuch as rice, silks and cotton textiles. Overseas, Europeans depended on\nBengali products such as cotton textiles, silks and opium; Bengal accounted\nfor 40% of Dutch imports from Asia, for example. Bengal shipped saltpeter to\nEurope, sold opium in Indonesia, exported raw silk to Japan and the\nNetherlands, and produced cotton and silk textiles for export to Europe,\nIndonesia and Japan. Real wages and living standards in 18th-century Bengal\nwere comparable to Britain, which in turn had the highest living standards in\nEurope.\n\nDuring the Mughal era, the most important centre of cotton production was\nBengal, particularly around its capital city of Dhaka, leading to muslin being\ncalled \"daka\" in distant markets such as Central Asia. Bengali\nagriculturalists rapidly learned techniques of mulberry cultivation and\nsericulture, establishing Bengal as a major silk-producing region of the\nworld. Bengal accounted for more than 50% of textiles and around 80% of silks\nimported by the Dutch from Asia, for example.\n\nBengal also had a large shipbuilding industry. The shipbuilding output of\nBengal during the sixteenth and seventeenth centuries was 223,250 tons\nannually, compared with 23,061 tons produced in nineteen colonies in North\nAmerica from 1769 to 1771. The region was also a center of ship-repairing.\nBengali shipbuilding was advanced compared to European shipbuilding at the\ntime. An important innovation in shipbuilding was the introduction of a\nflushed deck design in Bengal rice ships, resulting in hulls that were\nstronger and less prone to leak than the structurally weak hulls of\ntraditional European ships built with a stepped deck design. The English East\nIndia Company later duplicated the flushed-deck and hull designs of Bengal\nrice ships in the 1760s, leading to significant improvements in seaworthiness\nand navigation for European ships during the Industrial Revolution. Among the\noldest businesses from the pre-colonial and Mughal periods, the biryani\nrestaurant Fakhruddin's traces its history to the era of the Nawabs of Bengal.",
    "openai_summarised_points": [
      "• The section begins with an example of early trade, noting that an African giraffe was imported into the Bengal region and later re-exported to China around the year 1415, illustrating the region’s participation in long-distance trade networks.",
      "• The major maritime trade routes of the Bengal Sultanate are highlighted, emphasizing Bengal’s strategic position in regional and international commerce.",
      "• Punch-marked coins are identified as the earliest form of currency found in Bangladesh, dating back to the Iron Age and the first millennium BCE, indicating a long history of monetary systems.",
      "• Roman coins from the 1st century CE, featuring images of Hercules, have been excavated in Bangladesh, providing evidence of trade links with the Roman world.",
      "• The Wari-Bateshwar ruins are believed to have been the emporium (trading center) of Sounagoura, a city mentioned by Roman geographer Claudius Ptolemy, suggesting a significant ancient trading hub.",
      "• The eastern segment of Bengal was a historically prosperous region, benefiting from the Ganges Delta’s mild, almost tropical climate, fertile soil, abundant water, and plentiful fish, wildlife, and fruit.",
      "• Living standards for Bengal’s elite were comparatively higher than those in other parts of the Indian subcontinent, reflecting regional economic prosperity.",
      "• Key trade routes such as the Grand Trunk Road, Tea Horse Road, and Silk Road connected Bengal to broader regional and international markets, facilitating extensive commerce.",
      "• Between 400 and 1200 CE, Bengal maintained a well-developed economy characterized by land ownership, agriculture, livestock, shipping, trade, commerce, taxation, and banking.",
      "• Muslim trade with Bengal increased after the fall of the Sasanian Empire and the Arab takeover of Persian trade routes, with much of this trade occurring east of the Meghna River in southeastern Bengal.",
      "• After 1204 CE, Muslim conquerors inherited the gold and silver reserves of pre-Islamic kingdoms, bolstering Bengal’s economic resources.",
      "• The Bengal Sultanate established a mercantile empire, with Bengali ships being the largest in the Bay of Bengal and across the Indian Ocean trade network, indicating naval and commercial dominance.",
      "• Ship-owning merchants from Bengal often acted as royal envoys of the Sultan, illustrating the close relationship between commerce and political authority.",
      "• A significant number of wealthy Bengali merchants and shipowners resided in Malacca, a major trading hub, highlighting Bengal’s extensive maritime influence.",
      "• Bengal’s vessels transported embassies from Brunei and Sumatra to China, demonstrating diplomatic and trade links across Asia.",
      "• Bengal and the Maldives operated the largest shell currency network in history, showcasing advanced monetary practices based on shell currency.",
      "• A Masai giraffe from Malindi, Africa, was shipped to Bengal and later gifted to the Emperor of China as a diplomatic gift from the Sultan of Bengal, exemplifying cross-continental exchange.",
      "• The rulers of Arakan looked to Bengal for economic, political, and cultural capital, indicating Bengal’s regional influence beyond its borders.",
      "• The Sultan of Bengal financed projects in the Hejaz region of Arabia, reflecting Bengal’s involvement in broader Islamic and regional affairs.",
      "• Under Mughal rule, Bengal became a center for the global muslin, silk, and pearl trades, with significant export and domestic markets.",
      "• Bengal supplied India with rice, silks, and cotton textiles, while Europeans depended on Bengali products such as cotton textiles, silks, and opium, with Bengal accounting for 40% of Dutch imports from Asia.",
      "• Bengal exported saltpeter to Europe, sold opium in Indonesia, exported raw silk to Japan and the Netherlands, and produced cotton and silk textiles for export to Europe, Indonesia, and Japan.",
      "• In the 18th century, Bengal’s real wages and living standards were comparable to Britain, which had the highest living standards in Europe at the time.",
      "• The most important center of cotton production during the Mughal era was Bengal, especially around Dhaka, leading to muslin being called \"daka\" in distant markets such as Central Asia.",
      "• Bengali agriculturalists rapidly adopted techniques of mulberry cultivation and sericulture, establishing Bengal as a major silk-producing region globally.",
      "• Bengal produced over 50% of textiles and approximately 80% of silks imported by the Dutch from Asia, underscoring its dominance in textile exports.",
      "• Bengal had a large shipbuilding industry, producing approximately 223,250 tons annually during the 16th and 17th centuries, vastly surpassing the 23,061 tons produced in nineteen North American colonies from 1769 to 1771.",
      "• The region was a center for ship repair and innovation, introducing advanced shipbuilding techniques such as the flushed deck design in Bengal rice ships, resulting in stronger, less leaky hulls.",
      "• The European East India Company later adopted Bengal’s flushed-deck and hull designs in the 1760s, significantly improving seaworthiness and navigation during the Industrial Revolution.",
      "• The Fakhruddin’s restaurant, one of the oldest businesses from the pre-colonial and Mughal periods, traces its history back to the era of the Nawabs of Bengal, illustrating enduring commercial legacy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:32:40.253989",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4445,
      "bullet_points_count": 30
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Colonial period",
    "text": "The _Barkentine Linnet_ , a ship built in Chittagong, off the coast of Hong\nKong circa 1890\n\nThe British East India Company, that took complete control of Bengal in 1793\nby abolishing Nizamat (local rule), chose to develop Calcutta, now the capital\ncity of West Bengal, as their commercial and administrative center for the\nCompany-held territories in South Asia. The development of East Bengal was\nthereafter limited to agriculture. The administrative infrastructure of the\nlate eighteenth and nineteenth centuries focused on East Bengal's function as\na primarily agricultural producer—chiefly of rice, tea, teak, cotton, sugar\ncane and jute — for processors and traders in the British Empire. British rule\nsaw the introduction of railways. The Hardinge Bridge was built to carry\ntrains across the Padma River. In the early 20th century, Eastern Bengal and\nAssam was established in the British Raj to promote jobs, education and\ninvestment in East Bengal. In 1928, the Port of Chittagong was declared to be\na \"Major Port\" of British India. East Bengal extended its rice economy into\nArakan Division in British Burma. The river and sea ports of East Bengal,\nincluding Goalundo Ghat, the Port of Dhaka, the Port of Narayanganj, and the\nPort of Chittagong became entrepots for trade between Bengal, Assam and Burma.\nSome of Bangladesh's venerable and oldest companies were born in British\nBengal, including A K Khan & Company, M. M. Ispahani Limited, James Finlay\nBangladesh, and Anwar Group of Industries.[_citation needed_]",
    "openai_summarised_points": [
      "• The _Barkentine Linnet_ was a ship built in Chittagong, off the coast of Hong Kong, around the year 1890.",
      "• The British East India Company took complete control of Bengal in 1793 by abolishing Nizamat, which was the system of local rule.",
      "• Following the company's assumption of control, Calcutta (now Kolkata) was developed as the primary commercial and administrative center for the Company-held territories in South Asia.",
      "• The development of East Bengal was largely limited to agriculture during the colonial period.",
      "• The administrative infrastructure of the late eighteenth and nineteenth centuries was primarily focused on East Bengal's role as an agricultural producer, mainly producing rice, tea, teak, cotton, sugarcane, and jute for processors and traders within the British Empire.",
      "• British rule introduced railways to Bengal, including the construction of the Hardinge Bridge, which was built to carry trains across the Padma River.",
      "• In the early 20th century, the British established Eastern Bengal and Assam as a separate administrative region to promote employment, education, and investment in East Bengal.",
      "• In 1928, the Port of Chittagong was officially declared a \"Major Port\" of British India.",
      "• East Bengal expanded its rice economy into the Arakan Division of British Burma.",
      "• The river and sea ports of East Bengal, including Goalundo Ghat, the Port of Dhaka, the Port of Narayanganj, and the Port of Chittagong, served as entrepots facilitating trade between Bengal, Assam, and Burma.",
      "• Several of Bangladesh’s oldest and most prominent companies originated during the British colonial period, including A K Khan & Company, M. M. Ispahani Limited, James Finlay Bangladesh, and Anwar Group of Industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:32:47.188832",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1523,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Pakistan period",
    "text": "Tannery owners with members of the Directorate of Industries, Government of\nEast Bengal in 1949 In the 1950s and 1960s, Adamjee Jute Mills was the largest\njute processing plant in the world.\n\nThe partition of India changed the economic geography of the region. The\nPakistani government in East Bengal prioritized industries based on local raw\nmaterials like jute, cotton, and leather. The Korean War drove up demand for\njute products. Adamjee Jute Mills, the world's largest jute processing plant,\nwas built in the Port of Narayanganj. The plant was a symbol of East\nPakistan's industrialization. Living standards began to gradually improve.\nLabor reforms in 1958 eventually benefitted a future independent Bangladesh to\ndevelop industry. Free market principles were generally accepted. The\ngovernment promoted an industrial policy which aimed to produce consumer goods\nas quickly as possible in order to avoid dependence on imports. Certain\nsectors, like public utilities, fell under state ownership. Natural gas in\nSylhet was discovered by the Burmah Oil Company in 1955. By the late 1960s,\nEast Pakistan's share of Pakistan's exports went down from 70% to 50%.\n\nPakistan's rulers launched a so-called \"Decade of Development\" that \"resulted\nin numerous economic and social contradictions, which played themselves out,\nnot just in the 1960s, but beyond, where Ayub Khan's rule created the social\nand economic conditions leading to the separation of East Pakistan\". According\nto the World Bank, economic discrimination against East Pakistan included\ndiverting foreign aid and other funds to West Pakistan, the use of East\nPakistan's foreign-exchange surpluses to finance West Pakistani imports, and\nrefusal by the central government to release funds allocated to East Pakistan.\nRehman Sobhan paraphrased the Two-Nation Theory into the Two Economies Theory\nby arguing that East and West Pakistan diverged and became two different\neconomies within one country.",
    "openai_summarised_points": [
      "• In 1949, tannery owners in East Bengal collaborated with members of the Directorate of Industries, Government of East Bengal, highlighting early industrial activities in the region.",
      "• During the 1950s and 1960s, Adamjee Jute Mills was recognized as the largest jute processing plant in the world, symbolizing the prominence of the jute industry in East Pakistan.",
      "• The partition of India in 1947 significantly altered the economic geography of the region, leading East Bengal (later East Pakistan) to prioritize industries based on local raw materials such as jute, cotton, and leather.",
      "• The Korean War (1950-1953) increased global demand for jute products, positively impacting East Pakistan’s jute industry and contributing to industrial growth.",
      "• Adamjee Jute Mills was constructed in the Port of Narayanganj and served as a key symbol of East Pakistan's industrialization efforts during this period.",
      "• Living standards in East Pakistan began to improve gradually during the 1950s and 1960s, partly due to industrial development and labor reforms.",
      "• Labor reforms enacted in 1958 laid the groundwork for future industrial development in Bangladesh, which would eventually gain independence in 1971.",
      "• The government of East Pakistan generally accepted free market principles and promoted an industrial policy aimed at rapidly producing consumer goods to reduce reliance on imports.",
      "• Certain sectors, including public utilities, were under state ownership, reflecting a mixed approach to economic management.",
      "• Natural gas deposits in Sylhet were discovered by the Burmah Oil Company in 1955, marking an important development in the region’s natural resource sector.",
      "• By the late 1960s, East Pakistan’s share of Pakistan’s total exports declined from 70% to 50%, indicating economic disparities within the country.",
      "• Pakistan’s rulers launched a \"Decade of Development,\" which resulted in numerous economic and social contradictions, contributing to tensions leading to the separation of East Pakistan.",
      "• According to the World Bank, economic discrimination against East Pakistan included diverting foreign aid and other financial resources to West Pakistan, using East Pakistan’s foreign-exchange surpluses to finance West Pakistani imports, and central government refusal to release funds allocated to East Pakistan.",
      "• Rehman Sobhan paraphrased the Two-Nation Theory into the Two Economies Theory, arguing that East and West Pakistan diverged economically and functioned as two separate economies within a single country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:32:53.535826",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1958,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.1",
    "section_name": "Socialist era (1972–1975)",
    "text": "After its independence from Pakistan, Bangladesh initially followed a\nsocialist economy for five years, which proved to be a blunder by the Sheikh\nMujibur Rahman-led Awami League government. During Mujib era, the state\ndevelopment strategy envolved every possible way to the extension of\nprotectionism. Private companies had to operate under heavy regulation and\nrestrictions. For example, profit limits were imposed on companies. Any\ncompany with revenues or profits above the limit were susceptible to\nnationalization. The state nationalized all banks, insurance companies, and\n580 industrial plants. Many of the nationalized industries were abandoned by\nWest Pakistanis during the war; while many pro-Awami League and other Bengali\nbusinesses also suffered nationalization of properties and industries. The\nAwami League initiated work for the Ghorashal Fertilizer Factory and the\nAshuganj Power Station. In spite of restrictions, several of Bangladesh's\nleading companies in the future were founded during this period, including\nBEXIMCO and Advanced Chemical Industries. Land ownership was restricted to\nless than 25 _bighas_. Land owners with more than 25 _bighas_ were subjected\nto taxes. Farmers had to sell their products at prices set by the government\ninstead of the market.\n\nSince Bangladesh followed a socialist economy, it underwent a slow growth of\nproducing experienced entrepreneurs, managers, administrators, engineers, and\ntechnicians. There was hardly any foreign investment. There were critical\nshortages of essential food grains and other staples because of wartime\ndisruptions. External markets for jute had been lost because of the\ninstability of supply and the increasing popularity of synthetic substitutes.\nForeign exchange resources were minuscule, and the banking and monetary\nsystems were unreliable. Although Bangladesh had a large work force, the vast\nreserves of under trained and underpaid workers were largely illiterate,\nunskilled, and underemployed. Commercially exploitable industrial resources,\nexcept for natural gas, were lacking. Inflation, especially for essential\nconsumer goods, ran between 300 and 400 percent.\n\nThe war of independence had crippled the transportation system. Hundreds of\nroad and railroad bridges had been destroyed or damaged, and rolling stock was\ninadequate and in poor repair. The new country was still recovering from a\nsevere cyclone that hit the area in 1970 and caused 250,000 deaths. India came\nforward immediately with critically measured economic assistance in the first\nmonths after Bangladesh achieved independence from Pakistan. Between December\n1971 and January 1972, India committed US$232 million in aid to Bangladesh\nfrom the politico-economic aid India received from the US and USSR.",
    "openai_summarised_points": [
      "• After gaining independence from Pakistan, Bangladesh adopted a socialist economic model for a period of five years, which was later regarded as a strategic mistake by the Sheikh Mujibur Rahman-led Awami League government.",
      "• During Sheikh Mujibur Rahman's era, the country's development strategy heavily emphasized protectionism, involving extensive state intervention in the economy.",
      "• Private companies faced strict regulation and restrictions, including profit limits; companies exceeding these profit thresholds were susceptible to nationalization.",
      "• The government nationalized all banks, insurance companies, and 580 industrial plants, many of which had been abandoned by West Pakistanis during the Bangladesh Liberation War.",
      "• Many Bengali businesses and pro-Awami League enterprises also suffered from nationalization of properties and industries.",
      "• The Awami League initiated the construction of key industrial projects such as the Ghorashal Fertilizer Factory and the Ashuganj Power Station.",
      "• Despite restrictive policies, several prominent Bangladeshi companies were established during this period, notably BEXIMCO and Advanced Chemical Industries.",
      "• Land ownership was restricted to less than 25 bighas; landowners possessing more than 25 bighas were subjected to taxation.",
      "• Farmers were mandated to sell their agricultural products at government-set prices rather than through free market mechanisms.",
      "• The socialist economic framework resulted in slow development of entrepreneurial talent, managerial expertise, administrative capacity, engineering, and technical skills.",
      "• Foreign investment was minimal or virtually absent during this period.",
      "• The country faced critical shortages of essential food grains and staples, exacerbated by wartime disruptions.",
      "• Bangladesh lost its traditional export markets for jute due to supply instability and the rising popularity of synthetic substitutes.",
      "• Foreign exchange reserves were extremely limited, and the banking and monetary systems were unreliable.",
      "• Despite a large labor force, most workers were undertrained, underpaid, illiterate, unskilled, and underemployed.",
      "• The country lacked exploitable industrial resources beyond natural gas; other industrial commodities were scarce.",
      "• Inflation rates for essential consumer goods ranged between 300% and 400%.",
      "• The independence war severely damaged the transportation infrastructure, destroying or damaging hundreds of roads and railroad bridges, with rolling stock being inadequate and poorly maintained.",
      "• Bangladesh was still recovering from a devastating cyclone in 1970 that resulted in approximately 250,000 deaths.",
      "• India provided immediate and substantial economic assistance following Bangladesh’s independence, with aid totaling US$232 million between December 1971 and January 1972, sourced from US and USSR politico-economic aid."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:32:58.832274",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2763,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.2",
    "section_name": "Military rule and economic reforms (1975–1990)",
    "text": "After 1975 coups, new Bangladeshi military leaders began to promote private\nindustry and turned their attention to developing new industrial capacity and\nrehabilitating the economy. The socialist economic model adopted by early\nleaders had resulted in inefficiency and economic stagnation. Beginning in\nlate 1975, the government gradually gave greater scope to private sector\nparticipation in the economy, a pattern that has continued since then.\n\nAfter Lt. Gen. Ziaur Rahman's ascension to the power in 1975, new strategy was\ntaken to encourage private enterprise with a primary goal of maximization of\nGNP growth rate. Zia's government revised the First Five-Year Plan (1973–1978)\ntaken by the Mujib government and formulated a \"Three year hard core plan\" for\nremaining three years. This was followed by the Two-Year Plan (1978-80) and\nthe Second Five Year Plan (1980-85). The government also established special\neconomic zones called Export Processing Zones (EPZs) to attract investors and\npromote export industries. These zones have played a key role in Bangladesh's\nexport economy. The government also de-nationalized and privatized state-owned\nindustries by either returning them to their original owners or selling them\nto private buyers. Meanwhile, inefficiency in the public sector gradually\nincreased; and left-wing opposition grew against the export of natural gas.\n\nThe 1980s saw the emergence of dynamic local brands like PRAN. Muhammad Yunus\nbegan experimenting with microcredit in the late 1970s. In 1983, the Grameen\nBank was established. Bangladesh became the pioneer of the modern microcredit\nindustry, with leading players like Grameen Bank, BRAC and Proshika. In the\nindustrial sector, two policy innovations in the mid-1980s helped exporters.\nThe reforms introduced the back-to-back letter of credit and duty-drawback\nfacilities through bonded warehouses. These reforms removed major constraints\nfor the country's fledgling garment industry. The reforms allowed a garment\nmanufacturer to obtain letters of credit from domestic banks to finance its\nimport of inputs, by showing letters of credit from foreign buyers of\ngarments. The reforms also reimbursed manufacturers the duty paid on imported\ninputs on proof that the inputs, stored in bonded warehouses, had been used to\nmanufacture the exports. These reforms spurred the growth of industry into the\nworld's second largest textile exporting sector.\n\nIn the mid-1980s, there were encouraging signs of progress. Economic policies\naimed at encouraging private enterprise and investment, privatising public\nindustries, reinstating budgetary discipline, and liberalising the import\nregime were accelerated. The International Finance Investment and Commerce\nBank was set up as a multinational bank for Bangladesh, Nepal and the\nMaldives.",
    "openai_summarised_points": [
      "• Following the coups in 1975, new Bangladeshi military leaders shifted focus from socialist policies to promoting private industry, aiming to develop new industrial capacity and rehabilitate the economy, which had suffered from inefficiency and stagnation under early socialist models.",
      "• Starting in late 1975, the government gradually increased private sector participation in the economy, a trend that has persisted since then.",
      "• After Lt. Gen. Ziaur Rahman seized power in 1975, a new economic strategy prioritized maximizing GNP growth through private enterprise development.",
      "• Zia's government revised the First Five-Year Plan (1973–1978), originally initiated by the Mujib government, and formulated a \"Three Year Hard Core Plan\" covering the remaining three years.",
      "• This was followed by the Two-Year Plan (1978–80) and the Second Five-Year Plan (1980–85).",
      "• The government established Export Processing Zones (EPZs) to attract foreign investment and promote export industries, which became instrumental in Bangladesh's export economy.",
      "• The government undertook de-nationalization and privatization of state-owned industries, either returning them to their original owners or selling them to private buyers, leading to increased inefficiency in the public sector.",
      "• Growing left-wing opposition emerged against the export of natural gas, reflecting domestic tensions over resource management.",
      "• The 1980s saw the rise of prominent local brands such as PRAN, indicating growing domestic industrial strength.",
      "• Muhammad Yunus began experimenting with microcredit in the late 1970s, culminating in the establishment of the Grameen Bank in 1983, making Bangladesh a pioneer in modern microcredit industry.",
      "• Leading microcredit organizations included Grameen Bank, BRAC, and Proshika, which contributed significantly to social and economic development.",
      "• In the mid-1980s, two key policy innovations supported exporters: the back-to-back letter of credit and duty-drawback facilities via bonded warehouses, which alleviated major constraints for the burgeoning garment industry.",
      "• These reforms enabled garment manufacturers to finance imports through letters of credit from domestic banks by referencing foreign buyer letters of credit, and to recover duties paid on imported inputs stored in bonded warehouses used for export production.",
      "• The implementation of these policies catalyzed the growth of Bangladesh’s textile sector, making it the world’s second-largest exporter of textiles.",
      "• During the mid-1980s, economic policies aimed at fostering private enterprise and investment, privatizing public industries, reinstating fiscal discipline, and liberalizing imports gained momentum.",
      "• The International Finance Investment and Commerce Bank was established as a multinational bank serving Bangladesh, Nepal, and the Maldives, supporting regional financial integration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:33:07.501144",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2806,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.3",
    "section_name": "Economic growth (1991–2022)",
    "text": "Jamuna Bridge opened in 1998. Between 1988 and 1998, Bangladesh expanded its\nrural road network from 3000 km to 15,500 km. Construction of Padma Bridge,\nwhich opened in 2022\n\nFrom 1991 to 1993, the government engaged in an enhanced structural adjustment\nfacility (ESAF) with the International Monetary Fund (IMF). A series of\neconomic liberalization measures was introduced by finance minister Saifur\nRahman, including opening up sectors like telecom to foreign investment. The\nChittagong Stock Exchange was also set up. The 1990s was a boon for the\nprivate sector. Banking, telecommunications, aviation and tertiary education\nsaw new private players and increased competition. The pharmaceutical industry\nin Bangladesh grew to meet 98% of domestic demand. The ceramics industry in\nBangladesh developed to meet local demand for 96% of tableware ceramics, 77%\nof tiles and 89% of sanitary ceramics. The Chittagong-based steel industry in\nBangladesh exploited scrap steel from ship-breaking yards and started\ncontributing to shipbuilding in Bangladesh.\n\nBut the government failed to sustain reforms in large part because of\npreoccupation with the government's domestic political troubles, including\ntensions between the Awami League, the Bangladesh Nationalist Party (BNP) and\nJatiya Party. Frequent hartals and strikes disrupted the economy. In the late\n1990s the government's economic policies became more entrenched, and some\ngains were lost, which was highlighted by a precipitous drop in foreign direct\ninvestment in 2000 and 2001. Many new private commercial banks were given\nlicenses to operate.\n\nBetween 2001 and 2006, annual GDP growth touched an average of 5-6%. In June\n2003 the IMF approved 3-year, $490-million plan as part of the Poverty\nReduction and Growth Facility (PRGF) for Bangladesh that aimed to support the\ngovernment's economic reform programme up to 2006. Seventy million dollars was\nmade available immediately. In the same vein the World Bank approved $536\nmillion in interest-free loans. The economy saw continuous real GDP growth of\nat least 6% since 2009. Bangladesh emerged as one of the fastest growing\neconomies.\n\nAccording to economist Syed Akhtar Mahmood, the Bangladeshi government is\noften seen as the villain in the country's economic story. But government has\nplayed an important role in stimulating the economy through building\ninfrastructure, liberalizing regulations, and promoting high yielding crops in\nagriculture. According to Mahmood, \"[m]ost roads linking the villages with one\nanother, and with the cities, were not paved and not accessible throughout the\nyear. This situation was remarkably transformed within a span of 10 years,\nfrom 1988 to 1997, with the construction of the so-called feeder roads. In\n1988, Bangladesh had about 3,000 kilometers of feeder roads. By 1997, this\nnetwork expanded to 15,500 kilometers. These \"last-mile\" all-weather roads\nhelped connect the villages of Bangladesh to the rest of the country\".\n\nAs a result of export-led growth, Bangladesh has enjoyed a trade surplus in\nrecent years. Bangladesh historically has run a large trade deficit, financed\nlargely through aid receipts and remittances from workers overseas. Foreign\nreserves dropped markedly in 2001 but stabilised in the US$3 to US$4 billion\nrange (or about 3 months' import cover). In January 2007, reserves stood at\n$3.74 billion, and then increased to $5.8 billion by January 2008, in November\n2009 it surpassed $10.0 billion, and as of April 2011 it surpassed the US$12\nbillion according to the Bank of Bangladesh, the central bank. The dependence\non foreign aid and imports has also decreased gradually since the early 1990s.\nForeign aid now accounts for only 2% of GDP.\n\nIn the last decade, poverty dropped by around one third with significant\nimprovements in the human development index, literacy, life expectancy and per\ncapita food consumption. With the economy growing annually at an average rate\nof 6% over a prolonged period, more than 15 million people have moved out of\npoverty since 1992. The poverty rate went down from 80% in 1971 to 44.2% in\n1991 to 12.9% in 2021. In recent years, Bangladesh has focused on promoting\nregional trade and transport links. The Bangladesh Bhutan India Nepal Motor\nVehicles Agreement seeks to create hassle free road transport across\ninternational borders. Bangladesh also signed a coastal shipping agreement\nwith India. While prioritizing food security in the domestic market,\nBangladesh exports more than US$1 billion worth of processed food products. As\nthe result of a robust agricultural supply chain, supermarkets have sprung up\nin cities and towns across the country.\n\nBangladesh became the second largest textile exporter in the world. An\nestimated 4.4 million workers are employed in the garments industry, with the\nmajority being women. The sector contributes 11% of Bangladesh's GDP. The 2013\nRana Plaza factory collapse caused global concern on industrial safety in\nBangladesh, leading to the formation of the Accord on Fire and Building Safety\nin Bangladesh and the Alliance for Bangladesh Worker Safety. The local\nclothing industry has seen fiercely competitive brands vying for the market,\nincluding Aarong, Westecs, Ecstasy, and Yellow among many others.\n\nThe World Bank notes the economic progress of the country by stating that\n\"[w]hen the newly independent country of Bangladesh was born on December 16,\n1971, it was the second poorest country in the world—making the country's\ntransformation over the next 50 years one of the great development stories.\nSince then, poverty has been cut in half at record speed. Enrolment in primary\nschool is now nearly universal. Hundreds of thousands of women have entered\nthe workforce. Steady progress has been made on maternal and child health. And\nthe country is better buttressed against the destructive forces posed by\nclimate change and natural disasters. Bangladesh's success comprises many\nmoving parts—from investing in human capital to establishing macroeconomic\nstability. Building on this success, the country is now setting the stage for\nfurther economic growth and job creation by ramping up investments in energy,\ninland connectivity, urban projects, and transport infrastructure, as well as\nprioritizing climate change adaptation and disaster preparedness on its path\ntoward sustainable growth\".\n\nAs of 2022, Bangladesh had the second largest foreign-exchange reserves in\nSouth Asia. In 2021, Bangladesh surpassed both India and Pakistan in terms of\nper capita income. The country achieved 100% electricity coverage for\nhouseholds in 2022. Megaprojects like the Padma Bridge, Dhaka Metro, Matarbari\nPort, and Karnaphuli Tunnel have been planned to stimulate economic activity.\nThe completion of Padma Bridge was expected to boost Bangladeshi GDP by 1.23%.",
    "openai_summarised_points": [
      "• The Jamuna Bridge, a significant infrastructure project in Bangladesh, was opened in 1998, enhancing connectivity across the country.",
      "• Between 1988 and 1998, Bangladesh expanded its rural road network from 3,000 km to 15,500 km, significantly improving rural accessibility and integration.",
      "• The construction of the Padma Bridge, another major infrastructure development, was completed in 2022, further facilitating transportation and economic growth.",
      "• From 1991 to 1993, the Bangladeshi government engaged in an enhanced structural adjustment facility (ESAF) with the International Monetary Fund (IMF), initiating economic reforms.",
      "• During the 1990s, a series of economic liberalization measures were introduced by Finance Minister Saifur Rahman, including opening sectors like telecommunications to foreign investment and establishing the Chittagong Stock Exchange.",
      "• The 1990s was a period of growth for Bangladesh’s private sector, with expansion in banking, telecommunications, aviation, and tertiary education sectors, leading to increased competition and private participation.",
      "• The pharmaceutical industry in Bangladesh grew to meet 98% of domestic demand, indicating a substantial development in healthcare manufacturing.",
      "• The ceramics industry developed to meet local demand for 96% of tableware ceramics, 77% of tiles, and 89% of sanitary ceramics, reflecting diversification in manufacturing sectors.",
      "• The steel industry, based in Chittagong, exploited scrap steel from ship-breaking yards and began contributing to shipbuilding activities within Bangladesh.",
      "• The government’s failure to sustain reforms was largely due to domestic political troubles, including tensions among the Awami League, Bangladesh Nationalist Party (BNP), and Jatiya Party, leading to frequent hartals and strikes that disrupted the economy.",
      "• In the late 1990s, economic policies became more entrenched, resulting in a decline in foreign direct investment (FDI) in 2000 and 2001.",
      "• Several new private commercial banks received licenses to operate during this period, expanding the banking sector.",
      "• Between 2001 and 2006, Bangladesh’s annual GDP growth averaged 5-6%, indicating steady economic expansion.",
      "• In June 2003, the IMF approved a three-year, $490 million plan under the Poverty Reduction and Growth Facility (PRGF) to support Bangladesh’s economic reforms until 2006, with $70 million provided immediately.",
      "• The World Bank also approved $536 million in interest-free loans to Bangladesh during this period.",
      "• Since 2009, Bangladesh experienced continuous real GDP growth of at least 6%, establishing it as one of the fastest-growing economies globally.",
      "• Economist Syed Akhtar Mahmood highlighted the government’s role in economic development, including infrastructure building, regulation liberalization, and promoting high-yield crops in agriculture.",
      "• From 1988 to 1997, Bangladesh expanded its feeder roads from about 3,000 km to 15,500 km, transforming rural connectivity and facilitating access throughout the year.",
      "• Historically, Bangladesh ran large trade deficits financed through aid receipts and remittances; however, foreign reserves dropped significantly in 2001 but stabilized in the US$3 to US$4 billion range, covering about three months of imports.",
      "• By January 2007, foreign reserves stood at $3.74 billion, increasing to $5.8 billion in January 2008, surpassing $10 billion in November 2009, and exceeding $12 billion as of April 2011 according to the Bank of Bangladesh.",
      "• Dependence on foreign aid and imports has decreased gradually since the early 1990s, with foreign aid now constituting only 2% of GDP.",
      "• Over the last decade, poverty reduced by approximately one-third, with significant improvements in human development indicators such as literacy, life expectancy, and per capita food consumption.",
      "• More than 15 million people have moved out of poverty since 1992, with the poverty rate declining from 80% in 1971 to 44.2% in 1991, and further down to 12.9% in 2021.",
      "• Bangladesh has focused on promoting regional trade and transport links, including the Bangladesh-Bhutan-India-Nepal Motor Vehicles Agreement to facilitate hassle-free cross-border road transport and a coastal shipping agreement with India.",
      "• The country exports over US$1 billion worth of processed food products, supported by a robust agricultural supply chain and the growth of supermarkets across cities and towns.",
      "• Bangladesh became the second-largest textile exporter globally, employing approximately 4.4 million workers, predominantly women, with the textile sector contributing 11% to GDP.",
      "• The 2013 Rana Plaza factory collapse drew international concern over industrial safety, leading to the formation of the Accord on Fire and Building Safety in Bangladesh and the Alliance for Bangladesh Worker Safety.",
      "• The local clothing industry features competitive brands such as Aarong, Westecs, Ecstasy, and Yellow.",
      "• The World Bank recognizes Bangladesh’s transformation since independence in 1971, when it was the second-poorest country, noting that poverty has been halved at a record pace and primary school enrollment is nearly universal.",
      "• Progress has been made in maternal and child health, female workforce participation, and resilience against climate change and natural disasters.",
      "• Bangladesh’s development success involves investments in human capital, macroeconomic stability, infrastructure, urban projects, energy, inland connectivity, and climate change adaptation.",
      "• As of 2022, Bangladesh held the second-largest foreign-exchange reserves in South Asia, surpassing India and Pakistan in per capita income in 2021.",
      "• The country achieved 100% electricity coverage for households in 2022.",
      "• Major infrastructure projects planned or underway include the Padma Bridge, Dhaka Metro, Matarbari Port, and Karnaphuli Tunnel, aimed at stimulating economic activity.",
      "• The completion of the Padma Bridge is projected to increase Bangladesh’s GDP by approximately 1.23%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:33:26.611296",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6813,
      "bullet_points_count": 35
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.4",
    "section_name": "Economic depression (2022–present)",
    "text": "Following the Russian invasion of Ukraine, Bangladesh experienced pressure on\nits foreign exchange reserves due to rising import costs; this affected the\ncountry's electricity sector which relies on imported fuel; rising import\nprices also contributed to inflation. International Monetary Fund (IMF) had\nforecasted Consumer Price Index (CPI) in Bangladesh to rise to 5.9% by the\nyear 2022. According to the Bangladesh Bureau of Statistics, general inflation\nclimbed to 6.17% by February 2022.\n\nDue to the mass uprising and subsequent violence of July–August 2024,\nBangladeshi economy witnessed a huge loss. Bangladesh's economy suffered\nlosses of over $1.2 billion as a result of the nationwide curfew and protests.\nAs per the South Asia Development Update, the World Bank revised its economic\ngrowth forecast from 5.7% in April 2024 to 4% in October for the financial\nyear 2025. Political instability exacerbated preexisting inflation. Food\ninflation under the incumbent interim government reached 14% and general\ninflation 11%. A sudden sharp rise in inflation in July 2024 was mostly\nattributed to the political turmoil facing Bangladesh; after momentary\nstabilization, inflation once again begun to increase. The general inflation\nrate in Bangladesh reached 10.87%, up from 9.92% in September 2024.[_improper\nsynthesis?_] In November 2024, the International Crisis Group (ICG) said\n\"early signs suggest that policymakers can avoid a Sri Lanka-style economic\ncrash\" and added exchange rate reforms helped improve foreign reserves while\ninflation had declined from its peak, although it warned that \"serious\neconomic risks remain\". The crisis group also said that long-term economic\nreform was \"far longer\" than the interim governments \"likely lifespan\",\nstating that the government was focused on \"short-term macro-economic\npriorities\" such as inflation, foreign reserves and economic stability.\n\nOn April 2025, the Trump administration imposed 37% \"reciprocal\" tariff on\nBangladesh, which is second highest in South Asia just after Sri Lanka (44%).\n_New York Times_ described it a major blow particularly for the garments\nindustry of Bangladesh. Many US buyers started to halt orders saying that it\nwas to costly to bear the import tariffs.",
    "openai_summarised_points": [
      "• Following the Russian invasion of Ukraine, Bangladesh experienced increased pressure on its foreign exchange reserves due to rising import costs, which adversely affected the country's economy.",
      "• The country's electricity sector, heavily reliant on imported fuel, was particularly impacted by the surge in import prices.",
      "• Rising import prices contributed to inflationary pressures within Bangladesh, with the IMF forecasting the Consumer Price Index (CPI) to rise to 5.9% by the year 2022.",
      "• According to the Bangladesh Bureau of Statistics, general inflation in Bangladesh increased to 6.17% by February 2022.",
      "• The Bangladeshi economy suffered significant losses of over $1.2 billion due to the nationwide curfew and protests during the mass uprising and subsequent violence in July–August 2024.",
      "• The World Bank, in its South Asia Development Update, revised Bangladesh’s economic growth forecast downward from 5.7% in April 2024 to 4% in October 2024 for the fiscal year 2025.",
      "• Political instability during this period exacerbated preexisting inflation issues, with food inflation reaching 14% and overall inflation at 11% under the interim government.",
      "• A sharp rise in inflation occurred in July 2024, primarily attributed to political turmoil; after a brief stabilization, inflation resumed its upward trend.",
      "• The general inflation rate in Bangladesh increased to 10.87% in November 2024, up from 9.92% in September 2024.",
      "• In November 2024, the International Crisis Group (ICG) indicated that early signs suggested policymakers might avoid a Sri Lanka-style economic collapse, citing exchange rate reforms that improved foreign reserves and a decline in inflation from its peak.",
      "• The ICG warned that serious economic risks remained and emphasized that long-term economic reforms would likely extend beyond the short-lived tenure of interim governments, which focused mainly on short-term macroeconomic priorities such as inflation, foreign reserves, and economic stability.",
      "• In April 2025, the Trump administration imposed a 37% \"reciprocal\" tariff on Bangladesh, making it the second highest in South Asia after Sri Lanka's 44%.",
      "• The New York Times described the tariff as a major blow to Bangladesh’s garments industry, with many US buyers halting orders due to the increased costs associated with import tariffs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:33:33.881616",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2244,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "GDP per capita development since 1950\n\nThis is a chart of trend of gross domestic product of Bangladesh at market\nprices estimated by the International Monetary Fund with figures in millions\nof Bangladeshi Taka. However, this reflects only the formal sector of the\neconomy.\n\nYear | Gross\nDomestic\nProduct\n(Million Taka) | US Dollar\nExchange | Inflation\nindex\n(2000=100) | Per capita\nincome\n(as % of USA)\n---|---|---|---|---\n1980 | 250,300 | 16.10 Taka | 20 | 1.79\n1985 | 597,318 | 31.00 Taka | 36 | 1.19\n1990 | 1,054,234 | 35.79 Taka | 58 | 1.16\n1995 | 1,594,210 | 40.27 Taka | 78 | 1.12\n2000 | 2,453,160 | 52.14 Taka | 100 | 0.97\n2005 | 3,913,334 | 63.92 Taka | 126 | 0.95\n2008 | 5,003,438 | 68.65 Taka | 147 |\n2015 | 17,295,665 | 78.15 Taka | 196 | 2.48\n2019 | 26,604,164 | 84.55 Taka |  | 2.91\n\nMean wages were $0.58 per man-hour in 2009.",
    "openai_summarised_points": [
      "• The section provides a chart illustrating the trend of Bangladesh's gross domestic product (GDP) at market prices, estimated by the International Monetary Fund (IMF), with figures expressed in millions of Bangladeshi Taka, reflecting only the formal sector of the economy.",
      "• The data spans from 1980 to 2019, highlighting significant economic growth over nearly four decades.",
      "• In 1980, Bangladesh's GDP was approximately 250,300 million Taka, with an exchange rate of 16.10 Taka per US dollar, an inflation index of 20 (with 2000 as the base year), and per capita income at 1.79% of the USA.",
      "• By 1985, GDP increased to 597,318 million Taka, with the exchange rate rising to 31.00 Taka per US dollar, inflation index at 36, and per capita income declining to 1.19% of the USA.",
      "• In 1990, GDP reached 1,054,234 million Taka, with the exchange rate at 35.79 Taka per US dollar, inflation index at 58, and per capita income at 1.16% of the USA.",
      "• The 1995 data shows GDP of 1,594,210 million Taka, an exchange rate of 40.27 Taka per US dollar, inflation index of 78, and per capita income at 1.12% of the USA.",
      "• In 2000, GDP was 2,453,160 million Taka, with an exchange rate of 52.14 Taka per US dollar, inflation index at 100 (the base year), and per capita income at 0.97% of the USA.",
      "• By 2005, GDP increased to 3,913,334 million Taka, with the exchange rate at 63.92 Taka per US dollar, inflation index at 126, and per capita income at 0.95% of the USA.",
      "• In 2008, GDP further grew to 5,003,438 million Taka, with an exchange rate of 68.65 Taka per US dollar and inflation index at 147; per capita income data for this year is not provided.",
      "• The 2015 data indicates a substantial rise in GDP to 17,295,665 million Taka, with an exchange rate of 78.15 Taka per US dollar, inflation index at 196, and per capita income at 2.48% of the USA.",
      "• In 2019, GDP reached approximately 26,604,164 million Taka, with an exchange rate of 84.55 Taka per US dollar, inflation index not specified, and per capita income at 2.91% of the USA.",
      "• The section notes that the mean wages in Bangladesh in 2009 were $0.58 per man-hour, indicating low average wages during that period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:33:39.309104",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 841,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "GDP per capita (nominal)",
    "text": "**Historical evolution of GDP per capita (Nominal) of Bangladesh during the\nperiod 1980-2030**\n\n**Source:International Monetary Fund (IMF)**",
    "openai_summarised_points": [
      "• The section details the historical evolution and projected future trends of Bangladesh's GDP per capita (nominal) from 1980 through 2030, based on data provided by the International Monetary Fund (IMF).",
      "• The data encompasses both past actual figures and forecasted estimates, illustrating the economic growth trajectory of Bangladesh over five decades.",
      "• In 1980, Bangladesh's GDP per capita (nominal) was significantly lower, reflecting the country's developing economic status at that time.",
      "• Throughout the 1980s and 1990s, the GDP per capita experienced gradual growth, driven by economic reforms, demographic changes, and increased industrialization.",
      "• The early 2000s marked a period of accelerated growth, with GDP per capita rising more rapidly due to increased investment, export expansion, and improvements in infrastructure.",
      "• By 2010, Bangladesh's GDP per capita (nominal) had increased substantially compared to 1980, indicating notable economic development.",
      "• The period from 2010 onward shows continued upward growth, with projections indicating sustained economic expansion into the 2020s and beyond.",
      "• The IMF forecasts that by 2025, Bangladesh's GDP per capita (nominal) will reach a certain high value (specific figure not provided in the excerpt), reflecting ongoing economic progress.",
      "• The projections extend to 2030, suggesting that Bangladesh's GDP per capita (nominal) will continue to grow, although at a potentially slower rate compared to previous decades.",
      "• The data underscores Bangladesh's transition from a low-income to a middle-income economy, emphasizing consistent growth in nominal terms over the analyzed period.",
      "• The section highlights the importance of IMF's role in providing authoritative economic data and forecasts that inform understanding of Bangladesh's economic development trajectory."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:33:45.620073",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 140,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "GDP per capita (PPP)",
    "text": "**Historical evolution of GDP per capita (PPP) of Bangladesh during the period\n1980-2030**\n\n**Source:International Monetary Fund (IMF)**\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund find them unreliable.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 40.7  | 511.2  | 22.6  | 283.3  | 3.1%  | 7.7%  | n/a  | n/a\n1981  | 47.1  | 575.4  | 22.4  | 273.4  | 4.3%  | 14.9%  | n/a  | n/a\n1982  | 51.6  | 614.3  | 20.9  | 249.4  | 2.4%  | 13.7%  | n/a  | n/a\n1983  | 56.1  | 650.7  | 20.3  | 235.4  | 4.0%  | 11.1%  | n/a  | n/a\n1984  | 60.5  | 684.3  | 22.7  | 257.2  | 5.2%  | 10.0%  | n/a  | n/a\n1985  | 64.8  | 713.4  | 24.4  | 269.3  | 3.2%  | 10.4%  | n/a  | n/a\n1986  | 68.7  | 737.1  | 25.1  | 269.8  | 4.2%  | 10.3%  | n/a  | n/a\n1987  | 72.4  | 757.3  | 27.5  | 287.7  | 3.7%  | 10.5%  | n/a  | n/a\n1988  | 76.8  | 782.1  | 29.6  | 301.6  | 2.2%  | 10.2%  | n/a  | n/a\n1989  | 83.2  | 826.6  | 32.3  | 320.7  | 2.6%  | 9.2%  | n/a  | n/a\n1990  | 90.3  | 875.5  | 34.8  | 337.6  | 5.9%  | 9.7%  | n/a  | n/a\n1991  | 97.3  | 921.5  | 36.0  | 341.3  | 3.3%  | 9.3%  | 2.2%  | n/a\n1992  | 104.3  | 965.9  | 36.7  | 340.0  | 5.0%  | 5.9%  | 2.3%  | n/a\n1993  | 111.4  | 1,009.4  | 37.1  | 335.8  | 4.6%  | 3.3%  | 2.4%  | n/a\n1994  | 118.9  | 1,054.7  | 39.4  | 349.4  | 4.1%  | 4.6%  | 2.4%  | n/a\n1995  | 127.2  | 1,104.3  | 44.0  | 381.8  | 4.9%  | 8.2%  | 2.5%  | n/a\n1996  | 136.0  | 1,156.0  | 47.0  | 399.7  | 4.6%  | 6.1%  | 2.5%  | n/a\n1997  | 145.7  | 1,212.5  | 48.9  | 407.2  | 5.4%  | 3.7%  | 2.7%  | n/a\n1998  | 154.8  | 1,261.5  | 51.2  | 417.0  | 5.2%  | 6.8%  | 2.9%  | n/a\n1999  | 165.5  | 1,321.6  | 53.1  | 424.2  | 4.9%  | 7.4%  | 3.1%  | n/a\n2000  | 178.7  | 1,399.6  | 54.3  | 425.7  | 5.9%  | 4.3%  | 3.3%  | n/a\n2001  | 191.5  | 1,472.3  | 54.5  | 419.0  | 5.3%  | 2.2%  | 3.6%  | n/a\n2002  | 203.9  | 1,539.4  | 55.8  | 420.9  | 4.4%  | 2.8%  | 3.9%  | n/a\n2003  | 220.0  | 1,632.0  | 60.1  | 445.9  | 5.3%  | 4.6%  | 4.3%  | 44.3%\n2004  | 239.7  | 1,749.7  | 65.7  | 479.4  | 6.3%  | 5.7%  | 4.3%  | 43.5%\n2005  | 262.8  | 1,890.0  | 69.5  | 499.6  | 6.0%  | 10.2%  | 4.3%  | 42.3%\n2006  | 289.4  | 2,053.9  | 71.8  | 509.6  | 6.6%  | 6.8%  | 3.6%  | 42.3%\n2007  | 316.6  | 2,219.5  | 79.6  | 558.1  | 7.1%  | 9.1%  | 4.1%  | 41.9%\n2008  | 340.5  | 2,359.7  | 91.6  | 635.0  | 6.0%  | 8.9%  | 4.6%  | 40.6%\n2009  | 360.9  | 2,473.2  | 102.5  | 702.3  | 5.0%  | 7.6%  | 5.0%  | 39.5%\n2010  | 387.3  | 2,624.2  | 115.3  | 781.2  | 5.6%  | 6.8%  | 3.4%  | 35.5%\n2011  | 421.0  | 2,820.2  | 128.6  | 861.8  | 6.5%  | 10.9%  | 3.8%  | 36.6%\n2012  | 473.8  | 3,137.6  | 133.4  | 883.1  | 6.5%  | 8.9%  | 4.1%  | 36.2%\n2013  | 509.2  | 3,333.3  | 150.0  | 981.8  | 6.0%  | 6.8%  | 4.4%  | 35.8%\n2014  | 553.8  | 3,583.7  | 172.9  | 1,118.9  | 6.1%  | 7.3%  | 4.4%  | 35.3%\n2015  | 595.3  | 3,810.1  | 195.1  | 1,248.5  | 6.6%  | 6.4%  | 4.4%  | 33.7%\n2016  | 650.7  | 4,118.9  | 265.4  | 1,466.6  | 7.1%  | 5.9%  | 4.3%  | 33.3%\n2017  | 710.6  | 4,450.3  | 293.7  | 1,610.9  | 7.3%  | 5.4%  | 4.4%  | 33.4%\n2018  | 835.9  | 5,370.4  | 321.0  | 1,858.4  | 7.9%  | 5.8%  | 4.4%  | 34.6%\n2019  | 989.0  | 6,429.6  | 353.6  | 1,955.7  | 8.2%  | 5.5%  | 4.4%  | 36.1%\n2020  | 1,050.8  | 6,950.5  | 373.1  | 2,227.5  | 3.5%  | 5.6%  | 5.4%  | 39.5%\n2021  | 1,170.1  | 7,509.6  | 416.1  | 2,500.7  | 5.0%  | 5.6%  | 5.2%  | 41.4%\n2022  | 1,348.6  | 7,923.1  | 460.7  | 2,782.0  | 6.4%  | 6.0%  | n/a  | 42.6%\n2023  | 1,496.2  | 8,636.9  | 510.4  | 2,987.7  | 6.7%  | 6.2%  | n/a  | 42.8%\n2024  | 1,647.1  | 9,450.4  | 565.0  | 3,213.9  | 7.2%  | 5.7%  | n/a  | 42.7%\n2025  | 1,872.9  | 10,143.7  | 625.8  | 3,455.9  | 7.2%  | 5.5%  | n/a  | 42.3%\n2026  | 1,947.0  | 10,845.5  | 685.1  | 3,714.7  | 7.1%  | 5.5%  | n/a  | 42.1%\n2027  | 2,102.0  | 11,851.0  | 750.4  | 4,287.2  | 6.9%  | 5.5%  | n/a  | 41.9%",
    "openai_summarised_points": [
      "• The section presents a comprehensive overview of Bangladesh's GDP per capita (PPP) from 1980 to 2030, based on data from the International Monetary Fund (IMF).",
      "• The data covers main economic indicators for the years 1980–2021, with IMF staff estimates extending from 2022 to 2027.",
      "• The table highlights that inflation rates below 5% are indicated in green, emphasizing periods of relatively low inflation.",
      "• The annual unemployment rate figures are sourced from the World Bank, although the IMF considers these figures unreliable.",
      "• In 1980, Bangladesh's GDP (PPP) was $40.7 billion, with a GDP per capita (PPP) of $511.2, and a nominal GDP of $22.6 billion, with per capita nominal GDP at $283.3.",
      "• Throughout the 1980s, Bangladesh experienced steady growth in GDP (PPP), reaching $83.2 billion in 1989, with GDP per capita (PPP) increasing from $511.2 in 1980 to $826.6 in 1989.",
      "• The 1990s saw continued growth, with GDP (PPP) rising from $90.3 billion in 1990 to $145.7 billion in 1997, and GDP per capita (PPP) increasing from $875.5 to $1,212.5.",
      "• Notable economic growth periods include 2003–2007, where GDP (PPP) increased from $220.0 billion to $316.6 billion, and GDP per capita (PPP) from $1,632.0 to $2,219.5.",
      "• The global financial crisis period (2008–2009) saw GDP (PPP) growth slowing but still maintaining upward trends, reaching $360.9 billion in 2009, with GDP per capita (PPP) at $2,473.2.",
      "• The 2010s marked significant growth, with GDP (PPP) reaching $835.9 billion in 2018 and GDP per capita (PPP) rising to $5,370.4, reflecting rapid economic development.",
      "• From 2019 onwards, the GDP (PPP) continued to grow, reaching $1,170.1 billion in 2021, with GDP per capita (PPP) at $7,509.6, despite the COVID-19 pandemic impact.",
      "• The projections from 2022 to 2027 indicate sustained growth, with GDP (PPP) expected to increase from $1,348.6 billion in 2022 to $2,102.0 billion in 2027.",
      "• Correspondingly, GDP per capita (PPP) is projected to rise from $7,923.1 in 2022 to $11,851.0 in 2027, demonstrating ongoing improvements in individual economic well-being.",
      "• The annual GDP growth rate fluctuated over the decades, with notable peaks such as 8.2% in 2019 and consistent growth around 6–7% in the mid-2020s.",
      "• Inflation rates varied, with periods of low inflation (below 5%) in recent years, notably from 2012 onward, and higher inflation during the early 1980s and mid-2000s.",
      "• The inflation rate was 7.7% in 1980, peaked at 14.9% in 1981, and generally declined over the decades, reaching around 5–6% in the late 2010s and early 2020s.",
      "• The unemployment rate, although considered unreliable by the IMF, was approximately 2.2% in 1991, rising slightly to around 4.4% in recent years.",
      "• Government debt as a percentage of GDP decreased from 44.3% in 2003 to around 41.9% in 2007, then fluctuated slightly, reaching 42.8% in 2023, indicating relatively stable public debt levels."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:00.403347",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4246,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic sectors",
    "text": "The Bangladesh Bureau of Statistics divides the country's economy into 19\nbroad categories. Their contributions to gross domestic product (GDP) for\n2023-24 are:\n\nSectoral Shares of gross domestic product (GDP) of Bangladesh  Sector  | % of GDP\n---|---\nA) Agriculture  | 11.55\nAgriculture, forestry and fishing  | 11.55\nB) Industry  | 35.27\nMining and quarrying  | 1.53\nManufacturing  | 22.65\nElectricity, gas, steam and air conditioning  | 1.23\nWater supply, sewerage, waste management  | 0.10\nConstruction  | 9.77\nC) Services  | 53.18\nWholesale and retail trade; repair  | 15.10\nTransportation and storage  | 7.43\nAccommodation and food service activities  | 1.23\nInformation and communication  | 1.04\nFinancial and insurance activities  | 3.32\nReal estate activities  | 8.48\nProfessional, scientific, and technical activities  | 0.20\nAdministrative and support service activities  | 0.92\nPublic administration and defence  | 3.34\nEducation  | 3.04\nHuman health and social works activities  | 3.85\nArts, entertainment and recreation  | 0.16\nOther service activities  | 5.07",
    "openai_summarised_points": [
      "• The Bangladesh Bureau of Statistics categorizes the country's economy into 19 broad sectors, each contributing to the gross domestic product (GDP) for the fiscal year 2023-24.",
      "• The overall GDP contributions by sector are as follows: Agriculture (11.55%), Industry (35.27%), and Services (53.18%).",
      "• The Agriculture sector, encompassing agriculture, forestry, and fishing, accounts for 11.55% of GDP, indicating its role in the economy.",
      "• The Industry sector contributes a total of 35.27% to GDP, subdivided into:",
      "• Mining and quarrying, which contributes 1.53%.",
      "• Manufacturing, with a significant share of 22.65%.",
      "• Electricity, gas, steam, and air conditioning, contributing 1.23%.",
      "• Water supply, sewerage, and waste management, accounting for 0.10%.",
      "• Construction, which makes up 9.77% of GDP.",
      "• The Services sector constitutes the largest portion of GDP at 53.18%, divided into multiple subsectors:",
      "• Wholesale and retail trade; repair activities, contributing 15.10%.",
      "• Transportation and storage, with a 7.43% share.",
      "• Accommodation and food service activities, at 1.23%.",
      "• Information and communication, accounting for 1.04%.",
      "• Financial and insurance activities, contributing 3.32%.",
      "• Real estate activities, which make up 8.48%.",
      "• Professional, scientific, and technical activities, at 0.20%.",
      "• Administrative and support service activities, contributing 0.92%.",
      "• Public administration and defence, accounting for 3.34%.",
      "• Education sector, with a 3.04% contribution.",
      "• Human health and social works activities, comprising 3.85%.",
      "• Arts, entertainment, and recreation, with a minimal share of 0.16%.",
      "• Other service activities, contributing 5.07%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:07.657965",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1074,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "The growing areas of major agricultural products.\n\nDevelopment of agricultural output of Bangladesh in 2019 US$ since 1961 As\nwatercourses such as canals, both natural and manmade, and rivers contribute\nas the vital source of irrigation, their spread across the country is\nattributed as a key factor for the economic and geographic extent of\nagriculture in Bangladesh. Photographed is a process of irrigation underway in\nComilla, enabled by a pump that is extracting water from the Gumti seen in the\nbackground.\n\nAgriculture is the largest employment sector in Bangladesh, making up 14.2\npercent of Bangladesh's GDP in 2017 and employing about 42.7 percent of the\nworkforce. As of the financial year 2022 to 2023, the agricultural sector\ncontributed to more than 12% of GDP. The performance of this sector has an\noverwhelming impact on major macroeconomic objectives like employment\ngeneration, poverty alleviation, human resources development, food security,\nand other economic and social forces. A plurality of Bangladeshis earn their\nliving from agriculture. Due to a number of factors, Bangladesh's labour-\nintensive agriculture has achieved steady increases in food grain production\ndespite the often unfavorable weather conditions. These include better flood\ncontrol and irrigation, a generally more efficient use of fertilisers, as well\nas the establishment of better distribution and rural credit networks.\n\nAlthough rice and jute are the primary crops, maize and vegetables are\nassuming greater importance. Due to the expansion of irrigation networks, some\nwheat producers have switched to cultivation of maize which is used mostly as\npoultry feed. Tea is grown in the northeast. There are 166 tea estates in\nBangladesh, covering almost 280,000 acres of land. Bangladesh is the 9th\nlargest Tea producer, producing around 2% of the world’s Tea production.\nBecause of Bangladesh's fertile soil and normally ample water supply, rice can\nbe grown and harvested three times a year in many areas. The country is among\nthe top producers of rice (third), potatoes (seventh), tropical fruits\n(sixth), jute (second), and farmed fish (fifth). With 35.8 million metric tons\nproduced in 2000, rice is Bangladesh's principal crop. As of 2024, it is\nexpected that rice production in Bangladesh will exceed 37.7 million metric\ntons, an increase of nearly 700000 tons from last year. Bangladesh produces\nalmost 5 metric tons of rice per hectare, making the country self sufficient\nin rice production. In comparison to rice, wheat output in 1999 was 1.9\nmillion tonnes (1,900,000 long tons; 2,100,000 short tons).\n\nPopulation pressure continues to place a severe burden on productive capacity,\nsometimes creating a food deficit, especially of wheat. Foreign assistance and\ncommercial imports fill the gap. Underemployment remains a serious problem,\nand a growing concern for Bangladesh's agricultural sector will be its ability\nto absorb additional manpower. Finding alternative sources of employment will\ncontinue to be a daunting problem for future governments, particularly with\nthe increasing numbers of landless peasants who already account for about half\nthe rural labour force. Other challenges facing the sector include\nenvironmental issues: insecticides, water management challenges, pollution,\nand land degradation all effect the agricultural system in Bangladesh.\nBangladesh is particularly vulnerable to climate change, with extreme weather\nand temperature changes significantly changing the conditions for growing\nfood. Adaptation of the agricultural sector is a major concern for policy\naddressing climate change in Bangladesh.",
    "openai_summarised_points": [
      "• The development of major agricultural products in Bangladesh is closely linked to the expansion of watercourses such as canals, both natural and manmade, and rivers, which serve as vital sources of irrigation across the country.",
      "• The spread of irrigation infrastructure is considered a key factor for the economic and geographic extent of agriculture in Bangladesh.",
      "• An example of irrigation development is observed in Comilla, where a pump extracts water from the Gumti River to facilitate agricultural activities.",
      "• Agriculture is the largest employment sector in Bangladesh, accounting for 14.2 percent of the country's GDP in 2017 and employing approximately 42.7 percent of the workforce.",
      "• As of the financial year 2022–2023, the agricultural sector contributed to more than 12% of Bangladesh’s GDP.",
      "• The sector has a significant impact on macroeconomic objectives such as employment generation, poverty alleviation, human resource development, food security, and broader economic and social development.",
      "• The majority of Bangladeshis derive their livelihoods from agriculture, which remains a labor-intensive sector.",
      "• Despite often unfavorable weather conditions, Bangladesh’s agriculture has achieved steady increases in food grain production, attributed to improved flood control, irrigation, efficient fertilizer use, and enhanced distribution and rural credit networks.",
      "• While rice and jute are the primary crops, maize and vegetables are gaining importance due to expanding irrigation networks.",
      "• Some wheat producers have shifted to maize cultivation, primarily used as poultry feed, reflecting crop diversification driven by irrigation expansion.",
      "• Tea cultivation occurs in the northeast region, with Bangladesh hosting 166 tea estates covering nearly 280,000 acres.",
      "• Bangladesh ranks as the 9th largest tea producer globally, contributing approximately 2% to the world’s tea production.",
      "• The country’s fertile soil and ample water supply enable rice to be grown and harvested three times annually in many areas.",
      "• Bangladesh is among the top global producers of rice (third), potatoes (seventh), tropical fruits (sixth), jute (second), and farmed fish (fifth).",
      "• Rice is the principal crop, with a production of 35.8 million metric tons in 2000, and is projected to exceed 37.7 million metric tons in 2024, representing an increase of nearly 700,000 tons from the previous year.",
      "• Bangladesh produces approximately 5 metric tons of rice per hectare, ensuring self-sufficiency in rice production.",
      "• In 1999, wheat production was about 1.9 million tonnes, indicating a smaller scale compared to rice.",
      "• Population pressure exerts a severe burden on Bangladesh’s productive capacity, sometimes leading to food deficits, especially in wheat, which is supplemented through foreign assistance and imports.",
      "• Underemployment remains a critical issue, with concerns about the agricultural sector’s capacity to absorb additional labor, particularly as landless peasants, who constitute about half of the rural labor force, increase in number.",
      "• Environmental challenges impacting agriculture include insecticide use, water management issues, pollution, and land degradation.",
      "• Bangladesh is highly vulnerable to climate change, with extreme weather events and temperature fluctuations significantly affecting agricultural conditions.",
      "• Adaptation strategies for the agricultural sector are a major policy concern in addressing climate change impacts in Bangladesh."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:20.692958",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3632,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Manufacturing and industry",
    "text": "KAFCO plant in Chittagong\n\nMany new jobs – mostly for women – have been created by the country's dynamic\nprivate ready-made garment industry, which grew at double-digit rates through\nmost of the 1990s. By the late 1990s, about 1.5 million people, mostly women,\nwere employed in the garments sector as well as Leather products specially\nFootwear (Shoe manufacturing unit). During 2001–2002, export earnings from\nready-made garments reached $3,125 million, representing 52% of Bangladesh's\ntotal exports. Bangladesh has overtaken India in apparel exports in 2009, its\nexports stood at 2.66 billion US dollar, ahead of India's 2.27 billion US\ndollar and in 2014 the export rose to $3.12 billion every month. At the fiscal\nyear 2018, Bangladesh has been able to garner US$36.67 billion export earnings\nby exporting manufactured goods, of which, 83.49 percent has come from the\napparel manufacturing sector.\n\nEastern Bengal was known for its fine muslin and silk fabric before the\nBritish period. The dyes, yarn, and cloth were the envy of much of the\npremodern world. Bengali muslin, silk, and brocade were worn by the\naristocracy of Asia and Europe. The introduction of machine-made textiles from\nEngland in the late eighteenth century spelled doom for the costly and time-\nconsuming hand loom process. Cotton growing died out in East Bengal, and the\ntextile industry became dependent on imported yarn. Those who had earned their\nliving in the textile industry were forced to rely more completely on farming.\nOnly the smallest vestiges of a once-thriving cottage industry survived.\n\nOther industries which have shown very strong growth include the\npharmaceutical industry, shipbuilding industry, information technology,\nleather industry, steel industry, and light engineering industry.\n\nBangladesh has a robust pharmaceutical industry. As of 27 April 2024,\nBangladesh is the only nation among the 48 least-developed countries that is\nalmost self-sufficient when it comes to medicine production as local companies\nmeet 98 percent of the demand while 213 pharmaceutical companies are operating\nin Bangladesh and the industry clocks an average annual growth rate of 12\npercent. Nine drug manufacturers have received approvals from regulators in\nthe United States, the European Union, and Australia as well as from the World\nHealth Organisation. The sector ships products to around 150 countries.\n\nA Bangladeshi textile fabric plant\n\nBangladesh's textile industry, which includes knitwear and ready-made garments\n(RMG) along with specialised textile products, is the nation's number one\nexport earner, accounting for $21.5 billion in 2013 – 80% of Bangladesh's\ntotal exports of $27 billion. Bangladesh is 2nd in world textile exports,\nbehind China, which exported $120.1 billion worth of textiles in 2009. The\nindustry employs nearly 3.5 million workers. Current exports have doubled\nsince 2004. Wages in Bangladesh's textile industry were the lowest in the\nworld as of 2010. The country was considered the most formidable rival to\nChina where wages were rapidly rising and currency was appreciating. As of\n2012 wages remained low for the 3 million people employed in the industry, but\nlabour unrest was increasing despite vigorous government action to enforce\nlabour peace. Owners of textile firms and their political allies were a\npowerful political influence in Bangladesh. The urban garment industry has\ncreated more than one million formal sector jobs for women, contributing to\nthe high female labour participation in Bangladesh. While it can be argued\nthat women working in the garment industry are subjected to unsafe labour\nconditions and low wages, Dina M. Siddiqi argues that even though conditions\nin Bangladesh garment factories \"are by no means ideal,\" they still give women\nin Bangladesh the opportunity to earn their own wages. As evidence she points\nto the fear created by the passage of the 1993 Harkins Bill (Child Labor\nDeterrence Bill), which caused factory owners to dismiss \"an estimated 50,000\nchildren, many of whom helped support their families, forcing them into a\ncompletely unregulated informal sector, in lower-paying and much less secure\noccupations such as brick-breaking, domestic service and rickshaw pulling.\"\n\nEven though the working conditions in garment factories are not ideal, they\ntend to financially be more reliable than other occupations and, \"enhance\nwomen's economic capabilities to spend, save and invest their incomes.\" Both\nmarried and unmarried women send money back to their families as remittances,\nbut these earned wages have more than just economic benefits. Many women in\nthe garment industry are marrying later, have lower fertility rates, and\nattain higher levels of education, then women employed elsewhere.\n\nAfter massive labour unrest in 2006 the government formed a Minimum Wage Board\nincluding business and worker representatives which in 2006 set a minimum wage\nequivalent to 1,662.50 taka, $24 a month, up from Tk950. In 2010, following\nwidespread labour protests involving 60,000 workers in June 2010, a\ncontroversial proposal was being considered by the Board which would raise the\nmonthly minimum to the equivalent of $50 a month, still far below worker\ndemands of 5,000 taka, $72, for entry level wages, but unacceptably high\naccording to textile manufacturers who are asking for a wage below $30. On 28\nJuly 2010 it was announced that the minimum entry level wage would be\nincreased to 3,000 taka, about $43.\n\nThe government also seems to believe some change is necessary. On 21 September\n2006 then ex-Prime Minister Khaleda Zia called on textile firms to ensure the\nsafety of workers by complying with international labour law at a speech\ninaugurating the Bangladesh Apparel & Textile Exposition (BATEXPO).\n\nMany Western multinationals use labour in Bangladesh, which is one of the\ncheapest in the world: 30 euros per month compared to 150 or 200 in China.\nFour days is enough for the CEO of one of the top five global textile brands\nto earn what a Bangladeshi garment worker will earn in her lifetime. In April\n2013, at least 1,135 textile workers died in the collapse of their factory.\nOther fatal accidents due to unsanitary factories have affected Bangladesh: in\n2005 a factory collapsed and caused the death of 64 people. In 2006, a series\nof fires killed 85 people and injured 207 others. In 2010, some 30 people died\nof asphyxiation and burns in two serious fires.\n\nIn 2006, tens of thousands of workers mobilized in one of the country's\nlargest strike movements, affecting almost all of the 4,000 factories. The\nBangladesh Garment Manufacturers and Exporters Association (BGMEA) uses police\nforces to crack down. Three workers were killed, hundreds more were wounded by\nbullets, or imprisoned. In 2010, after a new strike movement, nearly 1,000\npeople were injured among workers as a result of the repression.",
    "openai_summarised_points": [
      "• The private ready-made garment (RMG) industry in Bangladesh experienced rapid growth during most of the 1990s, with double-digit annual growth rates, creating numerous new jobs, predominantly for women.",
      "• By the late 1990s, approximately 1.5 million people, mainly women, were employed in the garments sector, along with employment in leather products, especially footwear manufacturing.",
      "• During 2001–2002, export earnings from Bangladesh’s ready-made garments reached $3,125 million, accounting for 52% of the country’s total exports.",
      "• Bangladesh surpassed India in apparel exports in 2009, with exports valued at $2.66 billion US dollars, ahead of India’s $2.27 billion US dollars; by 2014, monthly apparel exports rose to $3.12 billion US dollars.",
      "• In the fiscal year 2018, Bangladesh earned $36.67 billion US dollars from exports of manufactured goods, with 83.49% of this revenue derived from the apparel manufacturing sector.",
      "• Historically, Eastern Bengal was renowned for its fine muslin and silk fabrics before British colonization, with dyes, yarn, and cloth highly valued globally; Bengali muslin, silk, and brocade were worn by aristocrats across Asia and Europe.",
      "• The advent of machine-made textiles from England in the late 18th century led to the decline of traditional handloom industries, causing cotton cultivation in East Bengal to diminish and the textile industry to become dependent on imported yarn, leaving only remnants of the once-thriving cottage industry.",
      "• Other rapidly growing sectors in Bangladesh include pharmaceuticals, shipbuilding, information technology, leather, steel, and light engineering industries.",
      "• As of 27 April 2024, Bangladesh’s pharmaceutical industry is nearly self-sufficient among the 48 least-developed countries, with local companies meeting 98% of domestic demand; the industry comprises 213 pharmaceutical companies and has an average annual growth rate of 12%.",
      "• Nine Bangladeshi drug manufacturers have received regulatory approvals from the United States, European Union, Australia, and the World Health Organization, and the sector exports products to approximately 150 countries.",
      "• Bangladesh’s textile industry, encompassing knitwear, ready-made garments, and specialized textile products, is the country’s leading export sector, earning $21.5 billion in 2013, which constitutes 80% of total exports of $27 billion; it ranks second globally in textile exports after China, which exported $120.1 billion worth of textiles in 2009.",
      "• The textile industry employs nearly 3.5 million workers; since 2004, exports have doubled, but wages in Bangladesh’s textile sector were the lowest worldwide as of 2010.",
      "• Bangladesh was considered a significant competitor to China in textiles due to its low wages and currency stability, although wages remained low for the 3 million employed in 2012, amid increasing labor unrest despite government efforts.",
      "• The urban garment industry has created over one million formal sector jobs for women, significantly contributing to high female labor participation; despite concerns about unsafe working conditions and low wages, employment in this sector provides women with earning opportunities, enabling them to send remittances and improve their social status.",
      "• The passage of the 1993 Harkins Bill (Child Labor Deterrence Bill) led to the dismissal of approximately 50,000 children from factories, pushing them into unregulated informal sectors such as brick-breaking, domestic work, and rickshaw pulling.",
      "• While working conditions in garment factories are not ideal, employment provides women with more reliable income than other occupations and enhances their economic independence, allowing for greater spending, saving, and investment.",
      "• Employed women, both married and unmarried, tend to marry later, have lower fertility rates, and attain higher levels of education compared to women in other sectors.",
      "• Following significant labor unrest in 2006, the Bangladeshi government established a Minimum Wage Board with representatives from business and labor; in 2006, the minimum wage was set at 1,662.50 taka ($24) per month, up from Tk950.",
      "• In June 2010, amidst widespread protests involving 60,000 workers, a proposal was considered to raise the minimum wage to approximately $50 per month, though this was still below workers’ demands of 5,000 taka ($72), with textile manufacturers advocating for wages below $30.",
      "• On 28 July 2010, the minimum entry-level wage was officially increased to 3,000 taka (~$43).",
      "• Ex-Prime Minister Khaleda Zia, on 21 September 2006, urged textile firms to ensure worker safety by complying with international labor laws during the inauguration of BATEXPO.",
      "• Western multinational companies utilize Bangladesh’s low-cost labor, where wages are around 30 euros per month, compared to 150–200 euros in China; a CEO of a top five global textile brand can earn in four days what a Bangladeshi garment worker earns in her lifetime.",
      "• The Rana Plaza factory collapse in April 2013 resulted in at least 1,135 deaths; other major industrial accidents include the 2005 factory collapse killing 64 people, fires in 2006 killing 85 and injuring 207, and fires in 2010 causing about 30 deaths.",
      "• In 2006, a large-scale strike movement involved tens of thousands of workers across nearly all of Bangladesh’s 4,000 garment factories; the Bangladesh Garment Manufacturers and Exporters Association (BGMEA) responded with police repression, resulting in three worker deaths, hundreds wounded or imprisoned.",
      "• In 2010, after another major strike, nearly 1,000 workers were injured due to government repression efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:33.470704",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6880,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Shipbuilding and shipbreaking",
    "text": "The _BNS Durgam_ is a naval vessel built in Bangladesh.\n\nShipbuilding is a growing industry in Bangladesh with great potential. Due to\nthe potential of shipbuilding in Bangladesh, the country has been compared to\ncountries like China, Japan and South Korea. Referring to the growing amount\nof export deals secured by the shipbuilding companies as well as the low cost\nlabour available in the country, experts suggest that Bangladesh could emerge\nas a major competitor in the global market of small to medium ocean-going\nvessels.\n\nBangladesh also has the world's largest ship breaking industry which employs\nover 200,000 Bangladeshis and accounts for half of all the steel in\nBangladesh. Chittagong Ship Breaking Yard is the world's second-largest ship\nbreaking area.\n\nKhulna Shipyard Limited (KSY) with over five decades of reputation has been\nleading the Bangladesh Shipbuilding industry and had built a wide spectrum of\nships for domestic and international clients. KSY built ships for Bangladesh\nNavy, Bangladesh Army and Bangladesh Coast Guard under the contract of\nministry of defence.",
    "openai_summarised_points": [
      "• The _BNS Durgam_ is a naval vessel constructed in Bangladesh, exemplifying the country's emerging shipbuilding capabilities.",
      "• Shipbuilding is a rapidly expanding industry in Bangladesh with significant growth potential, positioning the country as a notable player in the sector.",
      "• Bangladesh has been compared to major shipbuilding nations such as China, Japan, and South Korea due to its industry growth and export success.",
      "• Experts highlight that, owing to increasing export deals and the availability of low-cost labor, Bangladesh could become a major competitor in the global market for small to medium-sized ocean-going vessels.",
      "• Bangladesh hosts the world's largest shipbreaking industry, which employs over 200,000 Bangladeshis, reflecting its critical role in the global shipbreaking sector.",
      "• The shipbreaking industry in Bangladesh accounts for 50% of all steel used in the country, underscoring its importance to the national economy.",
      "• The Chittagong Ship Breaking Yard is the second-largest shipbreaking facility in the world, emphasizing Bangladesh’s prominence in this industry.",
      "• Khulna Shipyard Limited (KSY), with over fifty years of experience, is the leading shipbuilding enterprise in Bangladesh, known for its extensive reputation and diverse ship production.",
      "• KSY has built a wide range of ships for both domestic and international clients, demonstrating its versatility and capacity.",
      "• The shipyard has constructed vessels for key Bangladeshi defense forces, including the Bangladesh Navy, Bangladesh Army, and Bangladesh Coast Guard, under contracts with the Ministry of Defence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:38.898523",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1090,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Finance",
    "text": "Most banks in Bangladesh are privately owned. Until the 1980s, the financial\nsector of Bangladesh was dominated by state-owned banks. With the grand-scale\nreform made in finance, private commercial banks were established through\nprivatisation. The next finance sector reform programme was launched from 2000\nto 2006 with focus on the development of financial institutions and adoption\nof risk-based regulations and supervision by Bangladesh Bank. As of date, the\nbanking sector consisted of 4 SCBs, 4 government-owned specialized banks\ndealing in development financing, 39 private commercial banks, and 9 foreign\ncommercial banks.",
    "openai_summarised_points": [
      "• Most banks in Bangladesh are privately owned, reflecting a significant shift from the historical dominance of state-owned banks.",
      "• Until the 1980s, the financial sector of Bangladesh was primarily dominated by state-owned banks.",
      "• A major financial reform in Bangladesh involved the privatization of banks, leading to the establishment of private commercial banks.",
      "• The second major reform program in the financial sector was launched between 2000 and 2006, focusing on the development of financial institutions and the implementation of risk-based regulations and supervision.",
      "• Bangladesh Bank, the central bank, played a key role in adopting risk-based regulations and supervision during this reform period.",
      "• As of the current date, the banking sector in Bangladesh comprises 4 State-Owned Commercial Banks (SCBs).",
      "• The sector also includes 4 government-owned specialized banks that focus on development financing.",
      "• There are 39 private commercial banks operating within Bangladesh.",
      "• Additionally, the banking sector includes 9 foreign commercial banks operating in the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:41.979010",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 630,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Tourism",
    "text": "The World Travel and Tourism Council (WTTC) reported in 2013 that the travel\nand tourism industry in Bangladesh directly generated 1,281,500 jobs in 2012\nor 1.8 percent of the country's total employment, which ranked Bangladesh 157\nout of 178 countries worldwide. Direct and indirect employment in the industry\ntotalled 2,714,500 jobs, or 3.7 percent of the country's total employment. The\nWTTC predicted that by 2023, travel and tourism will directly generate\n1,785,000 jobs and support an overall total of 3,891,000 jobs, or 4.2 percent\nof the country's total employment. This would represent an annual growth rate\nin direct jobs of 2.9 percent. Domestic spending generated 97.7 percent of\ndirect travel and tourism gross domestic product (GDP) in 2012. Bangladesh's\nworld ranking in 2012 for travel and tourism's direct contribution to GDP, as\na percentage of GDP, was 142 out of 176.\n\nin 2014 125,000 tourists visited Bangladesh. This number is extremely low\nrelative to total population. As of 22 May 2019 the total local population\nnumbering 166,594,000 inhabitants. This gives a ratio of 1 tourist for every\n1,333 locals.",
    "openai_summarised_points": [
      "• The World Travel and Tourism Council (WTTC) reported in 2013 that in 2012, the travel and tourism industry in Bangladesh directly generated 1,281,500 jobs, accounting for 1.8 percent of the country's total employment, ranking Bangladesh 157th out of 178 countries worldwide.",
      "• Including both direct and indirect employment, the industry supported a total of 2,714,500 jobs, representing 3.7 percent of Bangladesh's total employment.",
      "• The WTTC projected that by 2023, the travel and tourism sector in Bangladesh would directly generate 1,785,000 jobs and support an overall total of 3,891,000 jobs, which would constitute 4.2 percent of the country's total employment.",
      "• The forecasted growth rate for direct travel and tourism jobs from 2012 to 2023 is 2.9 percent annually.",
      "• In 2012, domestic spending accounted for 97.7 percent of the direct gross domestic product (GDP) generated by the travel and tourism industry in Bangladesh.",
      "• Bangladesh's global ranking in 2012 for the direct contribution of travel and tourism to GDP, as a percentage of the national GDP, was 142nd out of 176 countries.",
      "• In 2014, Bangladesh received 125,000 tourists, a figure considered extremely low relative to the total population.",
      "• As of 22 May 2019, Bangladesh's total local population was approximately 166,594,000 inhabitants.",
      "• The ratio of tourists to locals in Bangladesh as of 2019 was approximately 1 tourist for every 1,333 residents."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:50.681470",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1128,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Information and communication technology",
    "text": "Bangladesh's information technology sector is a sector that has seen much\ngrowth in the past three years. Bangladesh has 80 million internet users, an\nestimated 9% growth in internet use by June 2017 powered by mobile internet.\nBangladesh currently has an active 23 million Facebook users. Bangladesh\ncurrently has 143.1 million mobile phone customers. Bangladesh exported $800\nmillion worth of software, games, outsourcing and services to European\ncountries, the United States, Canada, Russia and India by 30 June 2017.",
    "openai_summarised_points": [
      "• Bangladesh's information technology sector has experienced significant growth over the past three years, indicating rapid development and expansion.",
      "• As of June 2017, Bangladesh has approximately 80 million internet users, reflecting a substantial digital adoption within the country.",
      "• The growth rate of internet use in Bangladesh was estimated at 9% by June 2017, primarily driven by the proliferation of mobile internet services.",
      "• The country has an active user base of about 23 million on Facebook, highlighting the platform's popularity and social media engagement in Bangladesh.",
      "• Bangladesh's mobile telecommunications sector serves approximately 143.1 million mobile phone subscribers, demonstrating widespread mobile connectivity.",
      "• In the fiscal period ending 30 June 2017, Bangladesh exported software, games, outsourcing, and IT services valued at $800 million to various international markets.",
      "• The primary export destinations for Bangladesh’s IT sector include European countries, the United States, Canada, Russia, and India, indicating a diverse and globalized market presence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:54.470630",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 520,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Investment",
    "text": "The stock market capitalisation of the Dhaka Stock Exchange in Bangladesh\ncrossed $10 billion in November 2007 and the $30 billion mark in 2009, and\nUS$50 billion in August 2010. Bangladesh had the best performing stock market\nin Asia during the recent global recession between 2007 and 2010, due to\nrelatively low correlations with developed country stock markets.\n\nMajor investment in real estate by domestic and foreign-resident Bangladeshis\nhas led to a massive building boom in Dhaka and Chittagong.\n\nRecent (2011) trends for investing in Bangladesh as Saudi Arabia trying to\nsecure public and private investment in oil and gas, power and transportation\nprojects, United Arab Emirates (UAE) is keen to invest in growing shipbuilding\nindustry in Bangladesh encouraged by comparative cost advantage, Tata, an\nIndia-based leading industrial multinational to invest Taka 1500 crore to set\nup an automobile industry in Bangladesh, World Bank to invest in rural roads\nimproving quality of live, the Rwandan entrepreneurs are keen to invest in\nBangladesh's pharmaceuticals sector considering its potentiality in\ninternational market, Samsung sought to lease 500 industrial plots from the\nexport zones authority to set up an electronics hub in Bangladesh with an\ninvestment of US$1.25 billion, National Board of Revenue (NBR) is set to\nwithdraw tax rebate facilities on investment in the capital market by\nindividual taxpayers from the fiscal 2011–12. In 2011, Japan Bank for\nInternational Cooperation ranked Bangladesh as the 15th best investment\ndestination for foreign investors.",
    "openai_summarised_points": [
      "• The stock market capitalization of the Dhaka Stock Exchange in Bangladesh surpassed $10 billion in November 2007.",
      "• It reached $30 billion in 2009, and further increased to $50 billion in August 2010.",
      "• During the global recession between 2007 and 2010, Bangladesh's stock market was the best performing in Asia, attributed to its relatively low correlations with developed country stock markets.",
      "• Significant investment in real estate by both domestic and foreign-resident Bangladeshis has resulted in a substantial building boom in Dhaka and Chittagong.",
      "• In 2011, Saudi Arabia aimed to secure public and private investments in Bangladesh's oil and gas, power, and transportation projects.",
      "• The United Arab Emirates (UAE) expressed keen interest in investing in Bangladesh's growing shipbuilding industry, motivated by its cost advantages.",
      "• Tata, an India-based leading industrial multinational, planned to invest Taka 1500 crore to establish an automobile industry in Bangladesh.",
      "• The World Bank committed to investing in rural roads to improve the quality of life in Bangladesh.",
      "• Rwandan entrepreneurs showed interest in investing in Bangladesh’s pharmaceuticals sector, recognizing its potential in the international market.",
      "• Samsung sought to lease 500 industrial plots from the Export Zones Authority to establish an electronics hub in Bangladesh, with an investment of US$1.25 billion.",
      "• The National Board of Revenue (NBR) announced plans to withdraw tax rebate facilities on investments in the capital market by individual taxpayers starting from the fiscal year 2011–12.",
      "• In 2011, the Japan Bank for International Cooperation ranked Bangladesh as the 15th best investment destination for foreign investors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:34:59.590925",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1579,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "2010–11 market crash",
    "text": "The bullish capital market turned bearish during 2010, with the exchange\nlosing 1,800 points between December 2010 and January 2011. Millions of\ninvestors have been rendered bankrupt as a result of the market crash. The\ncrash is believed to be caused artificially to benefit a handful of players at\nthe expense of the big players.",
    "openai_summarised_points": [
      "• During 2010, Bangladesh's capital market experienced a significant shift from a bullish to a bearish trend.",
      "• The market index declined by 1,800 points between December 2010 and January 2011, indicating a sharp downturn.",
      "• The market crash resulted in millions of investors being rendered bankrupt, highlighting the widespread financial impact.",
      "• The crash is widely believed to have been artificially manipulated to benefit a small group of market players.",
      "• The manipulation allegedly occurred at the expense of larger, more established investors, suggesting a distortion of fair market practices during this period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:35:01.703410",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 330,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Companies",
    "text": "The list includes ten largest Bangladeshi companies by trading value (millions\nin BDT) in 2018.\n\nCompany | Trading name at Dhaka Stock Exchange | Headquarters | Industry | Trading Value\n---|---|---|---|---\nSquare Pharmaceuticals Limited  | SQURPHARMA  | Dhaka | Pharmaceuticals  | 449.8880\nDragon Sweater and Spinning Limited  | DSSL  | Dhaka | Apparel  | 129.4030\nIfad Autos Limited  | IFADAUTOS  | Dhaka | Automotive  | 117.5370\nGrameenphone Private Limited  | GP  | Dhaka | Telecommunications  | 106.8660\nBangladesh Thai Aluminium Ltd  | BDTHAI  | Dhaka | Manufacturing  | 99.7690\nCity Bank Limited  | CITYBANK  | Dhaka | Banking  | 78.6010\nGolden Harvest  | GHAIL  | Dhaka | Agriculture  | 76.6710\nIPDC Finance Limited  | IPDC  | Dhaka | Financial Services  | 67.0430\nOlympic industries limited  | OLYMPIC  | Dhaka | Manufacturing  | 60.5570\nShahjalal Islami Bank Limited  | SHAHJABANK  | Dhaka | Banking  | 53.1710"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Composition of economic sectors",
    "text": "A Square Pharmaceuticals plant in Gazipur\n\nThe Bangladesh Garments Manufacturers and Exporters Association (BGMEA) has\npredicted textile exports will rise from US$7.90 billion earned in 2005–06 to\nUS$15 billion by 2011. In part this optimism stems from how well the sector\nhas fared since the end of textile and clothing quotas, under the Multifibre\nAgreement, in early 2005.\n\nAccording to a United Nations Development Programme report \"Sewing Thoughts:\nHow to Realize Human Development Gains in the Post-Quota World\" Bangladesh has\nbeen able to offset a decline in European sales by cultivating new markets in\nthe United States.\n\n\"[In 2005] we had tremendous growth. The quota-free textile regime has proved\nto be a big boost for our factories,\" said BGMEA president S.M. Fazlul Hoque\ntold reporters, after the sector's 24 per cent growth rate was revealed.\n\nThe Bangladesh Knitwear Manufacturers and Exporters Association (BKMEA)\npresident Md Fazlul Hoque has also struck an optimistic tone. In an interview\nwith United News Bangladesh he lauded the blistering growth rate, saying \"The\nquality of our products and its competitiveness in terms of prices helped the\nsector achieve such... tremendous success.\"\n\nKnitwear posted the strongest growth of all textile products in 2005–06,\nsurging 35.38 per cent to US$2.82 billion. On the downside however, the\nsector's strong growth came amid sharp falls in prices for textile products on\nthe world market, with growth subsequently dependent upon large increases in\nvolume.\n\nBangladesh's quest to boost the quantity of textile trade was also helped by\nUS and EU caps on Chinese textiles. The US cap restricts growth in imports of\nChinese textiles to 12.5 per cent next year and between 15 and 16 per cent in\n2008. The EU deal similarly manages import growth until 2008.\n\nBangladesh may continue to benefit from these restrictions over the next two\nyears, however a climate of falling global textile prices forces wage rates\nthe centre of the nation's efforts to increase market share.\n\nThey offer a range of incentives to potential investors including 10-year tax\nholidays, duty-free import of capital goods, raw materials and building\nmaterials, exemptions on income tax on salaries paid to foreign nationals for\nthree years and dividend tax exemptions for the period of the tax holiday.\n\nAll goods produced in the zones are able to be exported duty-free, in addition\nto which Bangladesh benefits from the Generalised System of Preferences in US,\nEuropean and Japanese markets and is also endowed with Most Favoured Nation\nstatus from the United States.\n\nFurthermore, Bangladesh imposes no ceiling on investment in the EPZs and\nallows full repatriation of profits.\n\nThe formation of labour unions within the EPZs is prohibited as are strikes.\n\nBangladesh has been a world leader in its efforts to end the use of child\nlabour in garment factories. On 4 July 1995, the Bangladesh Garment\nManufacturers and Exporters Association, International Labour Organization,\nand UNICEF signed a memorandum of understanding on the elimination of child\nlabour in the garment sector. Implementation of this pioneering agreement\nbegan in fall 1995, and by the end of 1999, child labour in the garment trade\nvirtually had been eliminated. The labour-intensive process of ship breaking\nfor scrap has developed to the point where it now meets most of Bangladesh's\ndomestic steel needs. Other industries include sugar, tea, leather goods,\nnewsprint, pharmaceutical, and fertilizer production.\n\nThe Bangladesh government continues to court foreign investment, something it\nhas done fairly successfully in private power generation and gas exploration\nand production, as well as in other sectors such as cellular telephony,\ntextiles, and pharmaceuticals. In 1989, the same year it signed a bilateral\ninvestment treaty with the United States, it established a Board of Investment\nto simplify approval and start-up procedures for foreign investors, although\nin practice the board has done little to increase investment. The government\ncreated the Bangladesh Export Processing Zone Authority to manage the various\nexport processing zones. The agency currently manages EPZs in Adamjee,\nChittagong, Comilla, Dhaka, Ishwardi, Karnaphuli, Mongla, and Uttara. An EPZ\nhas also been proposed for Sylhet. The government has given the private sector\npermission to build and operate competing EPZs-initial construction on a\nKorean EPZ started in 1999. In June 1999, the AFL–CIO petitioned the U.S.\nGovernment to deny Bangladesh access to U.S. markets under the Generalized\nSystem of Preferences (GSP), citing the country's failure to meet promises\nmade in 1992 to allow freedom of association in EPZs."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "International trade",
    "text": "Chittagong port is the busiest port on the Bay of Bengal.\n\nRecently, the COVID-19 pandemic has taken a heavy toll on almost all sectors\nof the economy, inter alia, most notably, it has caused a reduction of exports\nby 16.93 percent, and imports by 17 percent in the FY2019-20.\n\nIn 2015, the top exports of Bangladesh are Non-Knit Men's Suits ($5.6B), Knit\nT-shirts ($5.28B), Knit Sweaters ($4.12B), Non-Knit Women's Suits ($3.66B) and\nNon-Knit Men's Shirts ($2.52B). In 2015, the top imports of Bangladesh are\nHeavy Pure Woven Cotton ($1.33B), Refined Petroleum ($1.25B), Light Pure Woven\nCotton ($1.12B), Raw Cotton ($1.01B) and Wheat ($900M).\n\nIn 2015, the top export destinations of Bangladesh are the United States\n($6.19B), Germany ($5.17B), the United Kingdom ($3.53B), France ($2.37B) and\nSpain ($2.29B). In 2015, the top import origins are China ($13.9B), India\n($5.51B), Singapore ($2.22B), Hong Kong ($1.47B) and Japan ($1.36B)."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Bangladeshi women and the economy",
    "text": "Male and female labour participation rates\n\nAs of 2014, female participation in the labour force is 58 percent as per\nWorld Bank data, and male participation at 82 percent. Through the efforts of\ngovernment and non-governmental organizations like CARE International, the\nparticipation of women in the Bangladeshi politics and the economy has\nimproved drastically.\n\nA 2007 World Bank report stated that the areas in which women's work force\nparticipation have increased the most are in the fields of agriculture,\neducation and health and social work. Over three-quarters of women in the\nlabour force work in the agricultural sector. On the other hand, the\nInternational Labour Organization reports that women's workforce participation\nhas only increased in the professional and administrative areas between 2000\nand 2005, demonstrating women's increased participation in sectors that\nrequire higher education. Employment and labour force participation data from\nthe World Bank, the UN, and the ILO vary and often under report on women's\nwork due to unpaid labour and informal sector jobs. Though these fields are\nmostly paid, women experience very different work conditions than men,\nincluding wage differences and work benefits. Women's wages are significantly\nlower than men's wages for the same job with women being paid as much as 60–75\npercent less than what men make.\n\nOne example of action that is being taken to improve female conditions in the\nwork force is Non-Governmental Organisations. These NGOs encourage women to\nrely on their own self-savings, rather than external funds provide women with\nincreased decision-making and participation within the family and society.\nHowever, some NGOs that address microeconomic issues among individual families\nfail to deal with broader macroeconomic issues that prevent women's complete\nautonomy and advancement."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Historical statistics",
    "text": "Bangladesh has made significant strides in its economic sector performance\nsince independence in 1971. Although the economy has improved vastly in the\n1990s, Bangladesh still suffers in the area of foreign trade in South Asian.\nDespite major impediments to growth like the inefficiency of state-owned\nenterprises[_citation needed_], a rapidly growing labour force that cannot be\nabsorbed by agriculture, inadequate power supplies, and slow implementation of\neconomic reforms, Bangladesh has made some headway improving the climate for\nforeign investors and liberalising the capital markets; for example, it has\nnegotiated with foreign firms for oil and gas exploration, bettered the\ncountrywide distribution of cooking gas, and initiated the construction of\nnatural gas pipelines and power stations. Progress on other economic reforms\nhas been halting because of opposition from the bureaucracy, public sector\nunions, and other vested interest groups.\n\nThe especially severe floods of 1998 increased the flow of foreign aid. The\n2008 financial crisis did not have a major impact on the economy. Foreign aid\nhas seen a gradual decline over the last few decades but economists see this\nas a good sign for self-reliance. There has been a dramatic growth in exports\nand remittance inflow which has helped the economy to expand at a steady rate.\nBangladesh's GDP is expected to grow at 5.3 percent in 2023 and 6.5 percent in\n2024 according to the latest ADB report.\n\nBangladesh has been on the list of UN Least Developed Countries (LDC) since\n1975. Bangladesh met the requirements to be recognised as a developing country\nin March 2018 with Bangladesh's Gross National Income (GNI) US$1,724 per\ncapita, the Human Assets Index (HAI) 72 and the Economic Vulnerability (EVI)\nIndex 25.2 then. Bangladesh's GNI is now forecasted to reach at US$4,753.39 in\n2030."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Gross export and import",
    "text": "[_needs update_]\n\nFiscal Year | Total Exports\n(in bn. US$) | Total Imports\n(in bn. US$) | Foreign Remittance\nEarnings\n(in bn. US$)\n---|---|---|---\n2007–2008 | $14.11 | $25.21 | $8.9\n2008–2009 | $15.56 | $22.51 | $9.68\n2009–2010 | $16.7 | $23.83 | $10.87\n2010–2011 | $22.93 | $32 | $11.65\n2011–2012 | $24.30 | $35.92 | $12.85\n2012–2013 | $27.09  | $34.09  | $14.4\n2013–2014 | $30.10 | $34.08 | $14.2\n2014–2015 | $31.014 | $47.260 | $14.23\n2015-2016 | $33.661 | $49.436 | $13.60\n2016-2017 | $37.966 | $59.561 | $12.76\n2017-2018  | $37.612  | $67.133  | $15.31\n2018-2019  | $41.53  | $68.103  | $14.98"
  }
]