[
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Monaco** is reliant on tourism and banking. Monaco, situated\non the French coast of the Mediterranean Sea, is a popular resort, attracting\ntourists to its casino and pleasant climate.\n\nThe Principality has successfully sought to diversify into services and small,\nhigh-value-added, nonpolluting industries. The state has no income tax and low\nbusiness taxes and thrives as a tax haven both for individuals who have\nestablished residence and for foreign companies that have set up businesses\nand offices. The state retains monopolies in a number of sectors, including\ngambling, tobacco, the telephone network, and the postal service.\n\nDenture adhesion rings made in Monaco, early to mid 20th century"
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Background",
    "text": "Economic development was spurred in the late 19th century with the opening of\nthe rail link to France and the Monte Carlo Casino. Monaco's economy is now\nprimarily geared toward finance, services, and real estate."
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Modern times",
    "text": "Low taxes have drawn many foreign individuals to Monaco and account for around\n75% of the $7.78 billion annual GDP income in (2021).[_how?_] Similarly,\ntourism accounts for close to 15% of the annual revenue, as the Principality\nof Monaco also has been a major center for tourism ever since the famed Monte\nCarlo Casino was established in 1856.\n\nFinancial and insurance activities, along with scientific, support-\nadministrative, activities are the main contributors to the GDP of Monaco.\nWholesale trades (10%), construction (9.1%) and real estate activities (7.8%)\nalso contribute highly to the country's GDP. Monaco real estate is known to be\none of the most expensive in the world. Banking sector of Monaco is rather\nlarge: in 2015 consolidated banking assets 8.42 times exceeded the country's\nGDP. Banks operating in Monaco traditionally specialize in private banking,\nasset and wealth management services. Wholesale trade, construction and real\nestate sectors come afterward in the ranking.\n\nAn economic and customs union with France governs customs, postal services,\ntelecommunications, and banking in Monaco. Before the euro, Monaco used the\nMonegasque franc, which itself was pegged to the French franc. Now part of the\nEurozone, but not the EU, Monaco mints its own euro coins.\n\nAll residents pay tax in the form of 20% value-added tax on all goods and\nservices.\n\nMonaco is noted for its activity in the field of marine sciences. Its\nOceanographic Museum, formerly directed by Jacques-Yves Cousteau, is one of\nthe most renowned institutions of its kind in the world. Monaco import and\nexports products and services from all over the world. There is no commercial\nagriculture in Monaco; it is 100% urban."
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Tax haven",
    "text": "Monaco levies no income tax on individuals. The absence of a personal income\ntax in the principality has attracted to it a considerable number of wealthy\n\"tax refugee\" residents from European countries who derive the majority of\ntheir income from activity outside Monaco; celebrities such as Formula One\ndrivers attract most of the attention, but the vast majority of them are less\nwell-known business people.\n\nIn 2000, a report by the French parliamentarians, Arnaud Montebourg and\nVincent Peillon, alleged that Monaco had lax policies with respect to money\nlaundering, including within its famed casino, and that the government of\nMonaco had been placing political pressure on the judiciary so that alleged\ncrimes were not properly investigated.\n\nIn 1998, the Organisation for Economic Co-operation and Development (OECD)\nissued a first report on the consequences of the tax havens' financial\nsystems. Monaco did not appear in the list of these territories until 2004,\nwhen OECD became indignant regarding the Monegasque situation and denounced it\nin its last report, as well as Andorra, Liechtenstein, Liberia and the\nMarshall Islands, underlining its lack of co-operation as regards to financial\ninformation disclosure and availability.\n\nIn 2000, the Financial Action Task Force on Money Laundering (FATF) stated:\n\"The anti-money laundering system in Monaco is comprehensive. However,\ndifficulties have been encountered with Monaco by countries in international\ninvestigations on serious crimes that appear to be linked also with tax\nmatters. In addition, the FIU of Monaco (SICCFIN) suffers a great lack of\nadequate resources. The authorities of Monaco have stated that they will\nprovide additional resources to SICCFIN.\" The Principality is no longer blamed\nin the 2005 FATF report, as well as all other territories. In 2003, the\nInternational Monetary Fund (IMF) has identified Monaco, along with 36 other\nterritories, as a tax haven but Monaco came out of that list in 2009.\n\nIn June 2024, due to concerns about money laundering and terror financing, the\nFATF added Monaco to a list of countries \"under increased monitoring.\" In a\nstatement, the FATF said that the country needed to \"address strategic\ndeficiencies.\""
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "National enterprises",
    "text": "Monaco's economy is also based on national companies, which combined produce\nover a billion in profit every year. Among the most profitable and well-known\ncompanies outside Monaco are the Société des bains de mer, the bank UBS\nMonaco, the auction house Monaco Legend Group and the media conglomerate\nLagardère News."
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in Monaco\nis Finance, Insurance, and Real Estate with 4,497 companies followed by\nServices with 1,895 and 1,184 companies respectively."
  },
  {
    "chapter_name": "Economy of Monaco",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Public finances",
    "text": "In 2023 Monaco recorded government revenues of 2.19 billion EUR and expenses\nof 2.07 billion EUR, for a 126 million EUR budget surplus.\n\nThe state's fiscal reserves, the Constitutional Reserve Fund (CRF), reached a\nbalance of 7 billion EUR in 2023, up from 5.7 billion EUR in 2019."
  }
]