[
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( June 2025)_  \n---|---  \n  \nThe **economy of Syria** , primarily based on agriculture in the country's\nearly years, deteriorated after the start of the Syrian civil war in March\n2011."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Since the establishment of the First Syrian Republic in 1946, the economy has\nundergone many structural and other changes. Although the presence of the\nAllied forces during World War II stimulated commerce by providing markets for\nagriculture, textiles, and other locally manufactured goods, Syria lacked both\nthe infrastructure and the resources to achieve economic prosperity.\nAgriculture, which had played a key role in the economy, became a factor in\nindustrial expansion as landowners channeled profits from agricultural exports\ninto agroindustrial and related urban enterprises. The population, working\nunder land tenure and sharecropping arrangements, derived few benefits from\nthe agriculturally induced economic growth of the 1950s. However, Syria's\nunion with Egypt (1958–61) and the rise of the Baath Party as the major\npolitical force in the country in the 1960s, transformed Syria's economic\norientation and development strategy.\n\nHistorical development of real GDP per capita in Syria, since 1820"
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "1960s–1970s: State-led development",
    "text": "By the mid-1960s, government-sponsored land reform and nationalization of\nmajor industries and foreign investments had confirmed the new socialist\ndirection of Syria's economic policy. As the state assumed greater control\nover economic decision-making by adopting centralized planning and strictly\nregulating commercial transactions, Syria experienced a substantial loss of\nskilled workers, administrators, and their capital. Despite the political\nupheavals, which undermined the confidence of landowners, merchants, and\nindustrialists, the state successfully implemented large-scale development\nprojects to expand industry, agriculture, and infrastructure.\n\nDuring the 1970s, Syria achieved high rates of economic growth. The dramatic\nrise of world oil prices from 1973 to 1974 led to increased production from\ndomestic refineries. Moreover, higher prices for agricultural and oil exports,\nas well as the state's limited economic liberalization policy, encouraged\ngrowth. Also, Syria's economic boom was furthered by increased remittances\nfrom Syrians working in the oil-rich Arab states and higher levels of Arab and\nother foreign aid. By the end of the decade, the Syrian economy had shifted\nfrom its traditional agrarian base to an economy dominated by the service,\nindustrial, and commercial sectors. Massive expenditures for development of\nirrigation, electricity, water, road building projects, irisin plants and\nexpansion of health services and education to rural areas contributed to\nprosperity. However, the economy remained dependent on foreign aid and grants\nto finance the growing deficits both in the budget and in trade. Syria, as a\nfront-line state in the Arab-Israeli conflict, was also vulnerable to the\nvagaries of Middle East politics, relying on Arab aid transfers and Soviet\nassistance to support mounting defense expenditures."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "1980s: Crisis and austerity",
    "text": "By the mid-1980s, the country's economic climate had shifted from prosperity\nto austerity. Syria's economic boom collapsed as a result of the rapid fall of\nworld oil prices, lower export revenues, drought affecting agricultural\nproduction, and falling worker remittances. Also, Arab aid levels decreased\nbecause of economic retrenchment in the oil-producing states and Syrian\nsupport for Iran in the Iran-Iraq War. Real per capita GDP fell 22% between\n1982 and 1989. To restore the economy, the government sharply reduced\nspending, cut back imports, encouraged more private sector and foreign\ninvestment, and launched an anticorruption campaign against smugglers and\nblack-market money changers. However, massive defense outlays continued to\ndivert resources from productive investments.\n\nBy the late 1980s, spot shortages of basic commodities occurred frequently,\nand industry operated far below capacity because of routine power outages.\nForeign exchange reserves plummeted, the trade deficit widened, and real gross\ndomestic product growth fell as economic difficulties compounded. Although the\ngovernment instituted limited reforms to respond to the burgeoning crisis,\nSyria's pressing economic problems required a radically restructured economic\npolicy to improve future economic performance."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "1990s–2000s: Liberalization and privatization",
    "text": "In 1990, the Assad government instituted a series of economic reforms,\nalthough the economy remained highly regulated. The Syrian economy experienced\nstrong growth throughout the 1990s, and into the 2000s. Syria's per capita GDP\nwas US$4,058 in 2010. There is no authoritative GDP data available after 2012,\ndue to Syria's civil war.\n\nFollowing his assumption of power in 2000, Bashar al-Assad sought to frame his\nleadership around modernizing and opening the economy. He emphasized, in\nparticular, \"the need to modernize the regulatory environment and the\nindustrial base, activate and encourage the private sector, remove\nbureaucratic obstacles to investment, increase job opportunities, qualify\ncadres, improve education and expand information technology.\" While the\ngovernment's neoliberal reforms indeed contributed to ramping up trade and\ninvigorating the private sector, these were accompanied by rising inequality,\ndeclining public services, and increasingly overt forms of corruption, which\nultimately helped fuel protests in 2011. In one example of this trend, the\nSyrian Agricultural Workers Union complained in February 2011 that state\nmismanagement and the lifting of input subsidies was exacerbating the impact\nof drought on Syria's agricultural sector.\n\nBefore the civil war, the two main pillars of the Syrian economy were\nagriculture and oil, which together accounted for about one-half of GDP.\nAgriculture, for instance, accounted for about 26% of GDP and employed 25% of\nthe total labor force. However, poor climatic conditions and severe drought\nbadly affected the agricultural sector, reducing its share in the economy to\nabout 17% of 2008 GDP, down from 20.4% in 2007, according to preliminary data\nfrom the Central Bureau of Statistics. On the other hand, higher crude oil\nprices countered declining oil production and led to higher budgetary and\nexport receipts."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "2011–present: Syria's civil war",
    "text": "Since the outbreak of the Syrian Civil War, the Syrian economy has been\naffected by economic sanctions restricting trade with the Arab League,\nAustralia, Canada, the European Union, (as well as the European countries of\nAlbania, Iceland, Liechtenstein, Moldova, Montenegro, North Macedonia, Norway,\nSerbia, and Switzerland), Georgia, Japan, South Korea, Taiwan, Turkey, and the\nUnited States. Sanctions against Syria were further extended by the US Caesar\nSyria Civilian Protection Act that came into force in June 2020.\n\nThe destruction and dislocation associated with the civil war have devastated\nSyria's economy. By the end of 2013, the UN estimated total economic damage\nfrom the Syrian Civil War at $143 billion. In 2018, the World Bank estimated\nthat about one-third of Syria's housing stock and one half of its health and\neducation facilities have been destroyed by the conflict. According to the\nWorld Bank, a cumulative total of $226 billion in GDP was lost due to the\nconflict from 2011 to 2016.\n\nThe Syrian economy suffered from conflict-related hyperinflation. The Syrian\nannual inflation rate is one of the highest in the world. The national\ncurrency, the Syrian pound, tumbled in mid-2020 against the US dollar,\ntherefore stating that Syrian economy was only taking a turn for the worst.\nThe pound, which traded at LS 47 to the dollar before the 2011 uprising,\nplunged to over LS 3,000 to the dollar. Prices of basic goods have skyrocketed\nand some staples have disappeared from the market as merchants and the public\nstruggled to keep up with the rising cost of living.\n\nIn 2022, Syria joined the Chinese Belt and Road Initiative, which could help\nthe country rebuild its war-torn infrastructure and economy. Following the end\nof Bashar Al-asad regime and the civil war, the interim government appointed\nfor the first time in history a woman as governor of the central bank. Maysaa\nSabreen was announced as the new governor on December 30, 2024. 20 days before\non the 10 December Basel Abdul Hannan became Minister of the Economy, In his\nnew role, he announced plans to implement market liberalization reforms,\nincluding dismantling the existing import-export control system and moving\ntoward a free-market economic model. During a meeting with the Damascus\nChambers of Commerce, he outlined plans to remove restrictions on imports and\nallow registered businesses to trade more freely."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Basic information",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed. _( April 2016)__(Learn how\nand when to remove this message)_\n---|---\n\nDuring the 1960s, along socialist lines, the government nationalized most\nmajor enterprises and adopted economic policies designed to address regional\nand class disparities. Economic reform has been incremental and gradual. In\n2001, private banking in Syria has been legalized. In 2004, four private banks\nbegan operations. In August 2004, a committee was formed to supervise the\nestablishment of a stock market. Beyond the financial sector, the Syrian\nGovernment has enacted major changes to rental and tax laws, and is reportedly\nconsidering similar changes to the commercial code and to other laws, which\nimpact property rights.[_citation needed_]\n\nSyria produced heavy-grade oil from fields inside in the northeast since the\nlate 1960s. In the early 1980s, light-grade, low-sulphur oil was discovered\nnear Deir ez-Zor in eastern Syria. This discovery relieved Syria of the need\nto import light oil to mix with domestic heavy crude in refineries. As the war\nerupted in 2011, Syria's oil production had dropped to 353,000 bpd and then\nplunged to 24,000 bpd by 2018. Syria's oil reserves have been gradually\ndepleted and reached an estimated 2.5 billion barrels of oil reserves in 2018.\n\nIn 1990, the government established an official parallel exchange rate to\nprovide incentives for remittances and exports through official channels. This\naction improved the supply of basic commodities and contained inflation by\nremoving risk premiums on smuggled commodities.\n\nForeign aid to Syria in 1997 totaled an estimated US$199 million. The World\nBank reported that in July 2004, it had committed a total of US$661 million\nfor 20 operations in Syria. One investment project remained active at that\ntime.\n\nYear | Gross Domestic Product | US Dollar Exchange | Inflation Index\n(2000=100) | Per Capita Income\n(as % of USA) | Population\n---|---|---|---|---|---\n1980 | 78,270 | £S 3.94 | 8.10 | 12.17 | 8,971,343\n1985 | 146,225 | £S 3.92 | 14 | 11.64 | 10,815,289\n1990 | 268,328 | £S 28.80 | 57 | 4.37 | 12,720,920\n1995 | 570,975 | £S 35.30 | 98 | 4.18 | 14,610,348\n2000 | 903,944 | £S 49.68 | 100 | 3.49 | 16,510,861\n2005 | 1,677,417 | £S 56.09 | 122 | 3.70 | 19,121,454\n2010 | 59,633,000 | £S 47.00 | 4.40% | 5.79 | 21,092,262"
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "External trade and investment",
    "text": "Syrian exports in 2006\n\nDespite the mitigation of the severe drought that plagued the region in the\nlate 1990s and the recovery of energy export revenues, Syria's economy has\nhistorically faced serious challenges.\n\nCommerce has always been important to the Syrian economy, which benefited from\nthe country's strategic location along major east–west trade routes. Syrian\ncities boast both traditional industries such as weaving and dried-fruit\npacking and modern heavy industry. Given the policies adopted from the 1960s\nthrough the late 1980s, Syria refused to join the \"global economy\". In late\n2001, however, Syria submitted a request to the World Trade Organization (WTO)\nto begin the accession process. Syria had been an original contracting party\nof the former General Agreement on Tariffs and Trade but withdrew in 1951\nbecause of Israel's joining. Major elements of current Syrian trade rules\nwould have to change in order to be consistent with the WTO. In March 2007,\nSyria signed an Association Agreement with the European Union that would\nencourage both sides to negotiate a free trade agreement before 2010.\n\nThe bulk of Syrian imports have been raw materials essential for industry,\nagriculture, equipment, and machinery. Major exports include crude oil,\nrefined products, raw cotton, clothing, fruits, and cereal grains.\n\nOver time, the government has increased the number of transactions to which\nthe more favorable neighboring country exchange rate applies. The government\nalso introduced a quasi-rate for non-commercial transactions in 2001 broadly\nin line with prevailing black market rates.\n\nGiven the poor development of its own capital markets and Syria's lack of\naccess to international money and capital markets, monetary policy remains\ncaptive to the need to cover the fiscal deficit. Although in 2003 Syria\nlowered interest rates for the first time in 22 years and again in 2004, rates\nremain fixed by law.\n\nAs of 2012[update], because of the ongoing Syrian civil war, the value of\nSyria's overall exports has been slashed by two-thirds, from the figure of\nUS$12 billion in 2010 to only US$4 billion in 2012. Syria's GDP declined by\nover 3% in 2011."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Debt",
    "text": "Under Syrian President Bashar Assad, national debt in relation to GDP went\nfrom 152.09% in 2000 down to 30.02% in 2010. Prior to the civil war, Syria\nattempted to ease its heavy foreign debt burden through bilateral rescheduling\ndeals with virtually all of its key creditors in Europe, including Germany,\nFrance, and Russia. In December 2004, Syria and Poland reached an agreement by\nwhich Syria would pay $27 million out of the total $261.7 million debt. In\nJanuary 2005, Russia and Syria signed a deal that wrote off nearly 75% of\nSyria's debt to Russia, approximately $13 billion. The agreement left Syria\nwith less than €3 billion (just over $3.6 billion) owed to Moscow. Half of it\nwould be repaid over the next 10 years, while the rest would be paid into\nRussian accounts in Syrian banks and could be used for Russian investment\nprojects in Syria and for buying Syrian products. Later that year, Syria\nreached an agreement with Slovakia and the Czech Republic to settle an\nestimated $1.6 billion in debt, in exchange for a one time payment of $150\nmillion."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Agriculture",
    "text": "Olive groves in Western-Syria, Homs Governorate.\n\nAgriculture is a high priority in Syria's economic development plans, as the government seeks to achieve food self-sufficiency, increase export earnings, and halt rural out-migration. Thanks to sustained capital investment, infrastructure development, subsidies of inputs, and price supports, before the civil war Syria went from a net importer of many agricultural products to an exporter of cotton, fruits, vegetables, and other foodstuffs. One of the prime reasons for this turnaround was the government's investment in huge irrigation systems in northern and northeastern Syria. The agriculture sector, as of 2009, employed about 17% of the labor force and generates about 21% .org/ddp/home.do?Step=2&id=4&DisplayAggregation=N&SdmxSupported=Y&CNO=2&SET_BRANDING=YES The World Bank DataBank | Explore . Create . Share]. Databank.worldbank.org.</ref> of which livestock accounted for 16%, and fruit and grains for more than 40%.\n\nIn 2015, Syria's main exports included spice seeds ($83.2 million), apples and\npears ($53.2 million).\n\nMost land is privately owned, a crucial factor behind the sector's success. Of\nSyria's 196,000 km2 (76,000 sq mi), about 28% of it is cultivated, and 21% of\nthat total is irrigated. Most irrigated land is designated \"strategic\",\nmeaning that it encounters significant state intervention in terms of pricing,\nsubsidies, and marketing controls. \"Strategic\" products such as wheat, barley,\nand sugar beets, must be sold to state marketing boards at fixed prices, often\nabove world prices in order to support farmers, but at a significant cost to\nthe state budget. The most widely grown arable crop is wheat, but the most\nimportant cash crop is cotton; cotton was the largest single export before the\ndevelopment of the oil sector. Nevertheless, the total area planted with\ncotton has declined because of an increasing problem of water shortage coupled\nwith old and inefficient irrigation techniques. The output of grains like\nwheat is often underutilized because of poor storage facilities.\n\nWater and energy are among the most pervasive issues facing the agriculture\nsector. Another difficulty suffered by the agricultural sector is the\ngovernment's decision to liberalize prices of fertilizers, which increased\nbetween 100% and 400%.[_when?_] Drought was an alarming problem in 2008;\nhowever, the drought situation slightly improved in 2009. Wheat and barley\nproduction about doubled in 2009 compared to 2008. In spite of that, the\nlivelihoods of up to 1 million agricultural workers have been threatened. In\nresponse, the UN launched an emergency appeal for $20.2 million. Wheat has\nbeen one of the crops most affected, and for the first time in 2 decades Syria\nhas moved from being a net exporter of wheat to a net importer. During the\ncivil war which began in 2011, the Syrian government was forced to put out a\ntender for 100,000 metric tonnes of wheat, one of the few trade products not\nsubject to economic sanctions.\n\nLess than 2.7% of Syria's land area is forested, and only a portion of that is\ncommercially useful. Limited forestry activity is centered in the higher\nelevations of the mountains just inland from the coast, where rainfall is more\nabundant."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Drug exports",
    "text": "As of 2022, captagon was Ba'athist Syria's most valuable export product and a\nkey source of income for the Assad regime. The total value of drug shipments\nsold in 2021 were approximately $5.7 billion. Those were mostly dismantled by\nthe new Syrian caretaker government in January 2025."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Mining",
    "text": "Phosphates are the major minerals exploited in Syria. According to estimates\nSyria has around 1,700 million tons of phosphate reserves. Production dropped\nsharply in the early 1990s when world demand and prices fell, but output has\nsince increased to more than 2.4 million tons. Syria produced about 1.9% of\nthe world's phosphate rock output and was the world's ninth ranked producer of\nphosphate rock in 2009. Other major minerals produced in Syria include cement,\ngypsum, industrial sand (silica), marble, natural crude asphalt, nitrogen\nfertilizer, phosphate fertilizer, salt, steel, and volcanic tuff, which\ngenerally are not produced for export."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.3.2",
    "section_name": "Oil and natural gas",
    "text": "Syria is a relatively small oil producer, accounting for just 0.5% of global\nproduction in 2010. Although Syria is not a major oil exporter by Middle\nEastern standards, oil is a major pillar of the economy. According to the\nInternational Monetary Fund, oil sales for 2010 were projected to generate\n$3.2 billion for the Syrian government and account for 25.1% of the state's\nrevenue.\n\nAccording to the 2009 Syria Report of the Oxford Business Group, the oil\nsector accounted for 23% of government revenues, 20% of exports and 22% of GDP\nin 2008. Syria exported roughly 150,000 bpd in 2008, and oil accounted for a\nmajority of the country's export income."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.3.3",
    "section_name": "Electrical generation",
    "text": "In 2001 Syria reportedly produced 23.3 billion kilowatt hours (kWh) of\nelectricity and consumed 21.6 billion kWh. As of January 2002, Syria's total\ninstalled electric generating capacity was 7.6 gigawatts (GW), with fuel oil\nand natural gas serving as the primary energy sources and 1.5 GW generated by\nhydroelectric power. A network totaling 45 GW linking the electric power grids\nof Syria, Egypt, and Jordan was completed in March 2001. Syria's electric\nsupply capacity is an important national priority, and the government hopes to\nadd 3,000 megawatts of power generating capacity by 2010 at a probable cost of\nUS$2 billion, but progress has been slowed by a lack of investment\ncapital.[_needs update_] Power plants in Syria are undergoing intensive\nmaintenance, and four new generating plants have been built. The power\ndistribution network has serious problems, with transmission losses estimated\nas high as 25 percent of total generated capacity as a result of poor quality\nwires and transformer stations. A project for the expansion and upgrading of\nthe power transmission network is scheduled for completion in 2005.[_needs\nupdate_]\n\nAs of May 2009 it was reported that the Islamic Development Bank and the\nSyrian government signed an agreement stating that the bank would provide a\n€100 million loan for the expansion of Deir Ali power station in Syria."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.3.4",
    "section_name": "Nuclear energy",
    "text": "Syria abandoned its plans to build a VVER-440 reactor after the Chernobyl\naccident. The plans for a nuclear program were revived at the beginning of the\n2000s when Syria negotiated with Russia to build a nuclear facility that would\ninclude a nuclear power plant and a seawater atomic desalination plant."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Industry and manufacturing",
    "text": "The industrial sector, which includes mining, manufacturing, construction, and\npetroleum, accounted for 27.3 percent of gross domestic product (GDP) in 2010\nand employed about 16 percent of the labor force. The main industrial products\nare petroleum, textiles, food processing, beverages, tobacco, phosphate rock\nmining, cement, oil seeds crushing, and car assembly. Syria's manufacturing\nsector was largely state dominated until the 1990s, when economic reforms\nallowed greater local and foreign private-sector participation. Private\nparticipation remains constrained, however, by the lack of investment funds,\ninput/output pricing limits, cumbersome customs and foreign exchange\nregulations, and poor marketing.\n\nBecause land prices are not controlled by the state, real estate is one of the\nfew domestic avenues for investment with realistic and safe returns. Activity\nin the construction sector tends to mirror changes in the economy. Investment\nLaw No. 10 of 1991, which opened the country to foreign investment in some\nareas, marked the beginning of a strong revival, with growth in real terms\nincreasing over 2001 and 2002."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Services",
    "text": "Services accounted for 60.4% of gross domestic product (GDP) in 2017 and\nemployed 67% of the labor force, including government, in 2008. In May 2009,\nit was reported that Damascus office prices were skyrocketing."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.5.1",
    "section_name": "Banking and finance",
    "text": "Bank Al-Sharq and the Blue Tower Hotel in Damascus\n\nThe Central Bank of Syria began operations in 1959. It controls all foreign\nexchange and trade transactions and gives priority to lending to the public\nsector. The Central Bank has been subject to US sanctions since May 2004,\nwhich has accused the Bank of money laundering. These US sanctions may have\nincreased the role of Lebanese and European banks because a ban on\ntransactions between U.S. financial institutions and the Central Bank of Syria\ncreated an increase in demand for intermediary sources for US$\ntransfers.[_needs update_] The United States, European Union, Arab League and\nTurkey all also imposed sanctions on the Central Bank because of the Civil\nWar.\n\nThe six specialized state-owned banks – the Central Bank of Syria, Commercial\nBank of Syria, Agricultural Co-Operative Bank, Industrial Bank, Popular Credit\nBank, and Real Estate Bank – are major financial operators. They each extend\nfunds to, and take deposits from, a particular sector. The Industrial Bank\nalso is directed more toward the public sector, although it is under-\ncapitalized. As a result, the private sector often is forced to bank abroad, a\nprocess that is more expensive and therefore a poor solution to industrial\nfinancing needs. Many business people travel abroad to deposit or borrow\nfunds. It is estimated that Syrians have deposited US$6 billion in Lebanese\nbanks.\n\nIn the 2000s, Syria started reforms in the financial sector, including the\nintroduction of private banks and the opening of the Damascus Securities\nExchange in March 2009. In 2001, Syria legalized private banks and the sector,\nwhile still nascent, has been growing. Foreign banks were given licenses in\nDecember 2002, under Law 28 March 2001 which allows the establishment of\nprivate and joint-venture banks. Foreigners are allowed up to 49% ownership of\na bank, but may not hold a controlling stake. As of January 2010, 13 private\nbanks had opened, including two Islamic banks.\n\nSyria took gradual steps to loosen controls over foreign exchange. In 2003,\nthe government canceled a law that criminalized private sector use of foreign\ncurrencies, and in 2005 it allowed licensed private banks to sell specific\namounts of foreign currency to Syrian citizens under certain circumstances and\nto the private sector to finance imports. In October 2009, Syria further\nloosened its restrictions on currency transfers by allowing Syrians travelling\nabroad to withdraw the equivalent of up to US$10,000 from their Syrian pound\naccounts. In practice, the decision allows local banks to open accounts of a\nmaximum of US$10,000 that their clients can use for their international\npayment cards. The holders of these accounts will be able to withdraw up to\nUS$10,000 per month while travelling abroad.\n\nTo attract investment and to ease access to credit, the government allowed\ninvestors in 2007 to receive loans and other credit instruments from foreign\nbanks, and to repay the loans and any accrued interest through local banks\nusing project proceeds. In February 2008, the government permitted investors\nto receive loans in foreign currencies from local private banks to finance\ncapital investments. Syria's exchange rate is fixed, and the government\nmaintains two official rates—one rate on which the budget and the value of\nimports, customs, and other official transactions are based, and a second set\nby the Central Bank on a daily basis that covers all other financial\ntransactions. The government passed a law in 2006 which permits the operation\nof private money exchange companies. However, there is still a small black\nmarket for foreign currency.\n\nSince the start of the Syrian Civil War in 2011, there has been a capital\nflight to nearby countries. Syria has been subject to sanctions by United\nStates, Canada, European Union, Arab League and Turkey because of the civil\nwar. The currency of Syria is the Syrian pound (SYP). The pound's official\nexchange rate has deteriorated significantly, falling from £S 47 for US$1\nbefore the civil war to £S 1,256 as in June 2020. On another hand, while its\nexchange rate for money transfer is £S 1,250 for US$1, its non-official\nexchange rate (black market) plunged to around £S 4,000 for US$1 in March\n2021."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "3.5.2",
    "section_name": "Tourism",
    "text": "Tourism in Syria has greatly reduced as a result of the Syrian Civil War and\nits associated refugee crisis. Tourism has been further impacted by the\noutbreak of COVID-19 that started in March 2020. The international economic\nsanctions imposed on Syria and the sharp drop in the value of the Syrian pound\nalso adversely impact tourism in Syria."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Labour",
    "text": "Syria has a population of approximately 21 million people, and Syrian\ngovernment figures place the population growth rate at 2.37%, with 65% of the\npopulation under the age of 35 and more than 40% under the age of 15. Each\nyear more than 200,000 new job seekers enter the Syrian job market, but the\neconomy has not been able to absorb them. In 2017, the Syrian labor force was\nestimated to total about 3.767 million people. An estimated 67 percent worked\nin the services sector including government, 17 percent in agriculture, and 16\npercent in industry in 2008. Government and public sector employees constitute\nabout 30% of the total labor force and are paid very low salaries and wages.\n\nAccording to Syrian Government statistics, the unemployment rate in 2009 was\n12.6%; however, more accurate independent sources place it closer to 20%.\nAbout 70 percent of Syria's workforce earns less than US$100 per month.\nAnecdotal evidence suggests that many more Syrians are seeking work over the\nborder in Lebanon than official numbers indicate. In 2002 the Unemployment\nCommission (UC) was established, tasked with creating several hundred thousand\njobs over a five-year period. As of June 2009 it was reported that some\n700,000 households in Syria – about 3.5 million people – have no income.\nGovernment officials acknowledge that the economy is not growing at a pace\nsufficient to create enough new jobs annually to match population growth. The\nUN Development Programme (UNDP) announced in 2005 that 30% of the Syrian\npopulation lives in poverty and 11.4% live below the subsistence level.\n\nThe Ministry of Social Affairs and Labour is responsible."
  },
  {
    "chapter_name": "Economy of Syria",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Opportunity cost of conflict",
    "text": "A report by Strategic Foresight Group, an India-based think tank, calculated\nthe opportunity cost of conflict for the Middle East for 1991–2010 at US$12\ntrillion in 2006 dollars. Syria's share in this was US$152 billion, more than\nfour times the projected 2010 GDP of US$36 billion.\n\nThe Syrian Center for Policy Research stated in March 2015 that, by then,\nnearly three million Syrians had lost their jobs because of the civil war,\ncausing the loss of the primary source of income of more than 12 million\npeople; unemployment levels \"surged\" from 14.9 percent in 2011 to 57.7 percent\nat the end of 2014. As a result, 4 in 5 Syrians were by then living in\npoverty, with 30 percent of the population living in \"abject poverty\" and\nfrequently unable to meet basic household food needs. An estimate from 2023\nestimated the population below the poverty threshold in Syria to be 90%."
  }
]