[
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Antigua and Barbuda** is service-based, with tourism and\ngovernment services representing the key sources of employment and income.\nTourism accounts directly or indirectly for more than half of GDP and is also\nthe principal earner of foreign exchange in Antigua and Barbuda. However, a\nseries of violent hurricanes since 1995 resulted in serious damage to tourist\ninfrastructure and periods of sharp reductions in visitor numbers. In 1999 the\nbudding offshore financial sector was seriously hurt by financial sanctions\nimposed by the United States and United Kingdom as a result of the loosening\nof its money-laundering controls. The government has made efforts to comply\nwith international demands in order to get the sanctions lifted. The dual\nisland nation's agricultural production is mainly directed to the domestic\nmarket; the sector is constrained by the limited water supply and labor\nshortages that reflect the pull of higher wages in tourism and construction.\nManufacturing comprises enclave-type assembly for export with major products\nbeing bedding, handicrafts, and electronic components. Prospects for economic\ngrowth in the medium term will continue to depend on income growth in the\nindustrialized world, especially in the US, which accounts for about one-third\nof all tourist arrivals. Estimated overall economic growth for 2000 was 2.5%.\nInflation has trended down going from above 2 percent in the 1995-99 period\nand estimated at 0 percent in 2000.\n\nTo lessen its vulnerability to natural disasters, Antigua has been\ndiversifying its economy. Transportation, communications and financial\nservices are becoming important.\n\nAntigua is a member of the Eastern Caribbean Currency Union (ECCU). The\nEastern Caribbean Central Bank (ECCB) issues a common currency (the East\nCaribbean dollar) for all members of the ECCU. The ECCB also manages monetary\npolicy, and regulates and supervises commercial banking activities in its\nmember countries.\n\nAntigua and Barbuda is a beneficiary of the U.S. Caribbean Basin Initiative.\nIts 1998 exports to the U.S. were valued at about US $3 million and its U.S.\nimports totaled about US $84 million. It also belongs to the predominantly\nEnglish-speaking Caribbean Community (CARICOM).",
    "openai_summarised_points": [
      "• The economy of Antigua and Barbuda is primarily service-based, with key sectors including tourism and government services, which are the main sources of employment and income.",
      "• Tourism directly or indirectly accounts for more than 50% of the country's Gross Domestic Product (GDP) and is the principal source of foreign exchange earnings.",
      "• Since 1995, a series of violent hurricanes have caused significant damage to tourist infrastructure and led to sharp declines in visitor numbers.",
      "• In 1999, Antigua and Barbuda's offshore financial sector was severely impacted by financial sanctions imposed by the United States and the United Kingdom due to the country's loosening of money-laundering controls.",
      "• The government has actively worked to improve compliance with international standards to have these sanctions lifted.",
      "• The nation's agriculture sector primarily produces for the domestic market and faces constraints such as limited water supply and labor shortages, the latter caused by higher wages in tourism and construction industries.",
      "• Manufacturing in Antigua and Barbuda mainly involves enclave-type assembly for export, with major products including bedding, handicrafts, and electronic components.",
      "• Medium-term economic growth prospects are heavily dependent on income growth in the industrialized world, particularly in the United States, which accounts for approximately one-third of all tourist arrivals.",
      "• The estimated overall economic growth rate for the year 2000 was 2.5%.",
      "• Inflation decreased from above 2% during the 1995-1999 period to an estimated 0% in 2000.",
      "• To reduce vulnerability to natural disasters, Antigua has been diversifying its economy, with increasing importance placed on transportation, communications, and financial services.",
      "• Antigua is a member of the Eastern Caribbean Currency Union (ECCU), which issues a common currency, the East Caribbean dollar, managed by the Eastern Caribbean Central Bank (ECCB).",
      "• The ECCB is responsible for managing monetary policy and regulating and supervising commercial banking activities within ECCU member countries.",
      "• Antigua and Barbuda benefits from the U.S. Caribbean Basin Initiative; in 1998, its exports to the U.S. were valued at approximately US $3 million, while imports from the U.S. totaled around US $84 million.",
      "• The country is also a member of the Caribbean Community (CARICOM), a predominantly English-speaking regional organization."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:14:59.688031",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2250,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Prior to colonization, several Amerindian groups inhabited Antigua and\nBarbuda, all of which relied on a subsistence lifestyle. British colonists\nestablished settlements in the islands in 1632. After fighting off the Caribs,\nDutch, and French to stabilize their colonies, settlers grew tobacco, indigo,\ncotton, and ginger as cash crops. As on many other Caribbean islands, sugar\ncultivation became the most profitable enterprise, quickly surpassing other\ncrops in economic importance. Due to the vast tracts of land needed for large-\nscale sugar production, rainforests on the islands were decimated. Timber from\nthe rainforests was used in shipbuilding and repair.\n\nWith the shift to a plantation economy, slaves were imported from Africa. Even\nafter the abolition of slavery in 1834, former slaves continued working in\nservitude due to laws designed to keep providing plantations with cheap labor.\nAs the sugar industry began to wane, the plantation economy came to an end.",
    "openai_summarised_points": [
      "• Prior to colonization, Antigua and Barbuda were inhabited by several Amerindian groups, all of which relied on a subsistence lifestyle.",
      "• British colonists established settlements on the islands in 1632.",
      "• Following conflicts with the Caribs, Dutch, and French, the British settlers stabilized their colonies and began agricultural development.",
      "• Early cash crops cultivated by settlers included tobacco, indigo, cotton, and ginger.",
      "• Sugar cultivation emerged as the most profitable enterprise on the islands, quickly surpassing other crops in economic significance.",
      "• The expansion of sugar plantations required large tracts of land, leading to significant deforestation of the islands' rainforests.",
      "• Timber harvested from rainforests was utilized in shipbuilding and ship repair industries.",
      "• The shift to a plantation economy involved the importation of slaves from Africa to work on sugar plantations.",
      "• Even after the abolition of slavery in 1834, former slaves continued to work in conditions of servitude due to laws aimed at maintaining cheap labor for plantations.",
      "• As the sugar industry declined, the plantation-based economic model eventually came to an end."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:15:02.965074",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 975,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "Some 30% of land on Antigua is under crops or potentially arable, with 18% in\nuse. Sea-island cotton is a profitable export crop. A modest amount of sugar\nis harvested each year, and there are plans for production of ethanol from\nsugarcane. Vegetables, including beans, carrots, cabbage, cucumbers,\nplantains, squash, tomatoes, and yams, are grown mostly on small family plots\nfor local markets. Over the past 30 years, agriculture's contribution to the\nGDP has fallen from over 40% to 12%. The decline in the sugar industry left\n60% of the country's 66,000 acres (270 km2) under government control, and the\nMinistry of Agriculture is encouraging self-sufficiency in certain foods in\norder to curtail the need to import food, which accounts for about 25% by\nvalue of all imports. Crops suffer from droughts and insect pests, and cotton\nand sugar plantings suffer from soil depletion and the unwillingness of the\npopulation to work in the fields. Mango production in 2004 was 1,430 tons.",
    "openai_summarised_points": [
      "• Approximately 30% of land on Antigua is designated as arable or potentially arable, with 18% actively in use for agricultural purposes.",
      "• Sea-island cotton is identified as a profitable export crop for Antigua and Barbuda.",
      "• A modest quantity of sugar is harvested annually, with future plans to produce ethanol from sugarcane as an alternative or additional product.",
      "• Vegetables such as beans, carrots, cabbage, cucumbers, plantains, squash, tomatoes, and yams are predominantly cultivated on small family plots primarily for local consumption.",
      "• Over the past 30 years, agriculture's contribution to Antigua and Barbuda's Gross Domestic Product (GDP) has significantly declined from over 40% to approximately 12%.",
      "• The decline of the sugar industry resulted in 60% of the country's 66,000 acres (equivalent to 270 km²) falling under government control.",
      "• The Ministry of Agriculture is actively promoting self-sufficiency in certain food products to reduce reliance on imports, which constitute about 25% by value of all imports into the country.",
      "• Agricultural crops are adversely affected by environmental challenges such as droughts and insect pests.",
      "• Cotton and sugar plantations face issues related to soil depletion and a general reluctance among the population to work in the fields.",
      "• In 2004, mango production in Antigua and Barbuda was recorded at 1,430 tons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:15:05.729343",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 986,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Animal husbandry",
    "text": "Livestock estimates in 2004 counted 14,300 head of cattle, 19,000 sheep, and\n36,000 goats; there were some 5,700 hogs in the same year. Most livestock is\nowned by individual households. Milk production in 2004 was an estimated 5,350\ntons. The government has sought to increase grazing space and to improve\nstock, breeding Nelthropp cattle and Black Belly sheep. There is a growing\npoultry industry. In 1992, the European Development Bank provided $5 million\nUS to the government to help develop the livestock industry.",
    "openai_summarised_points": [
      "• In 2004, livestock estimates in Antigua and Barbuda included approximately 14,300 head of cattle, 19,000 sheep, and 36,000 goats.",
      "• The same year, there were about 5,700 hogs in the country.",
      "• The majority of livestock is owned by individual households rather than commercial enterprises.",
      "• Milk production in 2004 was estimated at 5,350 tons.",
      "• The government has actively sought to expand grazing space and enhance livestock quality through breeding programs.",
      "• Specific breeding initiatives include the development of Nelthropp cattle and Black Belly sheep.",
      "• There is a growing poultry industry within Antigua and Barbuda, indicating diversification in livestock sectors.",
      "• In 1992, the European Development Bank provided a financial aid package of US $5 million to the government to support the development of the livestock industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:15:09.313906",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 518,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Fishing",
    "text": "Most fishing is for local consumption, although there is a growing export of\nthe lobster catch to the United States and of some fish to Guadeloupe and\nMartinique. Antiguans annually consume more fish per capita (46 kg/101.4 lb)\nper year live weight than any other nation or territory in the Caribbean. The\nmain fishing waters are near shore or between Antigua and Barbuda. There are\nshrimp and lobster farms operating, and the Smithsonian Institution has a\nCaribbean king crab farming facility for the local market. The government has\nencouraged modern fishing methods and supported mechanization and the building\nof new boats. Fish landings in 2000 were 1,481 tons; the lobster catch, 42\ntons. Exports of fish commodities in 2000 were valued at US$1.5 million.",
    "openai_summarised_points": [
      "• Most fishing activity in Antigua and Barbuda is primarily for local consumption, with a growing trend toward exporting seafood products.",
      "• There is an increasing export of lobster catches to the United States, alongside some fish exports to Guadeloupe and Martinique.",
      "• Antiguans consume more fish per capita annually (46 kg or 101.4 pounds live weight) than any other nation or territory in the Caribbean.",
      "• The main fishing waters are located near the shorelines and between Antigua and Barbuda, facilitating accessible fishing grounds.",
      "• The country operates shrimp and lobster farms, contributing to aquaculture and seafood supply.",
      "• The Smithsonian Institution maintains a Caribbean king crab farming facility in Antigua for the local market, supporting crustacean aquaculture.",
      "• The government has actively encouraged the adoption of modern fishing techniques, including mechanization and the construction of new fishing boats, to enhance productivity.",
      "• In the year 2000, fish landings totaled 1,481 tons, indicating the volume of fish caught and brought to land.",
      "• The lobster catch in 2000 was recorded at 42 tons, reflecting the scale of lobster fishing activity.",
      "• Export revenues from fish commodities in 2000 amounted to approximately US$1.5 million, representing the economic value of seafood exports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:15:14.537718",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 761,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Mining",
    "text": "Few of the islands' mineral resources, which included limestone, building\nstone, clay, and barite, were exploited until recently. Limestone and volcanic\nstone have been extracted from Antigua for local construction purposes, and\nthe manufacture of bricks and tiles from local clay has begun on a small\nscale. Barbuda produced a small amount of salt, while phosphate has been\ncollected from Redonda.",
    "openai_summarised_points": [
      "• The islands of Antigua and Barbuda possess mineral resources such as limestone, building stone, clay, and barite, but these resources were largely underexploited until recent times.",
      "• Limestone and volcanic stone have been extracted from Antigua primarily for local construction activities.",
      "• The production of bricks and tiles from local clay has commenced on a small scale, indicating limited but ongoing industrial activity in mineral processing.",
      "• Barbuda has historically produced a small quantity of salt, contributing to local mineral extraction efforts.",
      "• Phosphate has been collected from Redonda, adding to the range of mineral resources utilized in the islands."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:15:17.403627",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 398,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Secondary industries",
    "text": "Industrial activity has shifted from the processing of local agriculture\nproduce to consumer and export industries using imported raw materials.\nIndustrial products include rum, refined petroleum, paints, garments,\nfurniture, and electrical components. The government encourages investment in\nmanufacturing establishments, and most industries have some government\nparticipation.\n\nIndustry accounted for 19% of GDP in 2001. Manufacturing—which accounts for\napproximately 5% of GDP—comprises enclave-type assembly for export with major\nproducts being bedding, handicrafts, and electronic components. Prospects for\neconomic growth depend on income growth in the industrialized world,\nespecially in the US, which accounts for about half of all tourist arrivals.\nThe industrial park, located in the Coolidge Area, produces a range of\nproducts such as paints, furniture, garments, and galvanized sheets, mainly\nfor export."
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Tourism",
    "text": "Tourism is the mainstay of the economy of Antigua and Barbuda and is the\nleading sector in terms of providing employment and creating foreign exchange.\nIn 1999 it contributed 60 percent of GDP and more than half of all jobs.\nAccording to the Americas Review 1998, tourism contributed 15 percent directly\nand around 40 percent indirectly to the GDP in 1998. Real growth in this\nsector has moved from an average of 7 percent for the period 1985-89 to 8.24\npercent for the period 1990-95. There was slow growth between 1995 and 1998.\n\nFigures released by the East Caribbean Central Bank (ECCB) in 2000 show that\ntotal visitor arrivals increased steadily from 470,975 in 1995 to 613,990 in\n1998. In 1999 total visitor arrivals declined by about 4.1 percent to 588,866,\nyet the number of visitors staying at least 1 night or more increased by 1.9\npercent over 1998 to total 207,862. Arrivals via cruise ships in 1999 dropped\nto 325,195, a fall of 3.4 percent over 1998. The fall-off in cruise passengers\nwas mainly the result of one of the larger cruise ships being out of service\nfor a brief period. Most of the tourists in 1999 came from the United Kingdom\nand the United States. Visitor expenditures have increased steadily since\n1990, with total expenditures of EC$782.9 million.\n\nTo combat increasing competition from other Caribbean destinations, the\ngovernment and the Antigua Hotel and Tourist Association have established a\njoint fund to market the country's appeal as a tourist destination. The\nassociation has agreed to match the proceeds from a 2 percent hotel guest levy\nintroduced by the government.\n\nAt the start of March 2001, the Antigua Workers Union (AWU), the trade union\nwhich represents close to 7,000 workers in the tourism industry, described\ntourism as an industry in crisis. The AWU claimed the industry is on the\ndecline because some airlines are pulling out of the country, and government\nwas not spending enough money to promote tourism. While the government has\nconceded that it was not spending enough on marketing because of cash flow\nproblems, it has rejected the AWU's contention that the industry is in crisis."
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Visitor statistics",
    "text": "Most visitors arriving to Antigua and Barbuda as tourists are from the\nfollowing countries of nationality: This does not include numbers of tourists\ndisembarking as part of a cruise.\n\nCountry  | 2023  | 2022  | 2021  | 2020  | 2019  | 2018  | 2017  | 2016  | 2015  | 2014  | 2013\n---|---|---|---|---|---|---|---|---|---|---|---\nUnited States | 137,157  | 129,521  | 102,495  | 60,319  | 123,553  | 104,103 | 96,347 | 108,652 | 94,617 | 95,332 | 88,619\nUnited Kingdom | 68,278  | 79,900  | 48,328  | 31,765  | 76,837  | 70,607 | 70,701 | 76,512 | 77,890 | 71,193 | 68,854\nCanada | 28,775  | 17,611  | 4,055  | 15,716  | 37,225  | 38,087 | 22,932 | 21,196 | 23,270 | 27,701 | 30,235\nItaly | 2,584  | 2,343  | 598  | 2,249  | 9,735  | 6,832 | 8,527 | 8,600 | 7,032 | 7,976 | 7,942\nTrinidad and Tobago |  |  |  |  |  |  | 4,250 | 3,768 | 3,331 | 3,546 | 3,746\nDominica |  |  |  |  |  |  | 4,153 | 3,988 | 3,728 | 2,913 | 2,954\nJamaica |  |  |  |  |  |  | 3,876 | 3,932 | 3,857 | 3,543 | 3,273\nBarbados |  |  |  |  |  |  | 2,863 | 2,878 | 2,916 | 2,934 | 2,920\nSaint Kitts and Nevis |  |  |  |  |  |  | 2,213 | 2,651 | 2,175 | 2,490 | 2,741\nGermany | 1,061  | 776  | 377  | 718  | 2,125  | 2,216 | 2,120 | 2,165 | 2,505 | 2,665 | 2,443\nTotal  | 281,896  | 265,119  | 169,469  | 125,083  | 300,990  | 268,949 | 247,320 | 265,187 | 250,450 | 249,316 | 243,219\n\nIn 2012,\n\n* 81% of visitors to Antigua and Barbuda came for vacation,\n* 12% of visitors came to visit friends and family,\n* 3% visited for business,\n* and 4% visited for other reasons\n* 55% of visitors stayed for 4–7 days,\n* 28% for 8–14 days,\n* 9% for 1–3 days and\n* 8% for 15+ days."
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Air Arrivals from the United States",
    "text": "In Q4 2019,\n\n* 28.1% of air arrivals came from New York\n* 9.0% from Florida\n* 8.9% from New Jersey\n* 4.6% from California\n* 4.6% from Pennsylvania\n* 4.2% from Texas\n* 3.7% from Connecticut\n* 3.5% from Massachusetts\n* 2.8% from North Carolina\n* and 2.7% from Virginia"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Air Arrivals from Canada",
    "text": "In Q4 2019,\n\n* 7,055 air arrivals came from Ontario\n* 2,407 from Quebec\n* 421 from Alberta\n* 406 from British Columbia\n* 163 from Nova Scotia\n* 75 from Saskatchewan\n* 58 from Prince Edward Island\n* 50 from Manitoba\n* 49 from New Brunswick\n* 35 were Not Stated\n* 33 from Newfoundland"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Air Arrivals from the United Kingdom",
    "text": "In Q4 2019,\n\n* 5,351 air arrivals came from Greater London\n* 1,882 from Gloucester\n* 1,513 from Greater Manchester\n* 1,100 from Hampshire & Isle of Wight\n* 1,060 from Surrey\n* 768 from Kent\n* 732 from Essex\n* 503 from East Sussex\n* 378 from Berkshire\n* and 326 from Oxfordshire"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Air Arrivals Visitor Expenditure",
    "text": "**Average Daily Expenditure per Person (USD) for Q4 2019**\n\n* $356.06 for the United States of America\n* $277.70 for the United Kingdom\n* $260.91 for Continental Europe\n* $251.65 for the Caribbean\n* $239.38 for Latin America\n* $222.18 for Canada\n* $166.67 for Other\n\n**Average Length of Stay for Q4 2019**\n\n* 14.4 for Other\n* 10.5 for Continental Europe\n* 10.4 for Latin America\n* 10.3 for the United Kingdom\n* 9.8 for the Caribbean\n* 8.9 for Canada\n* 8.5 for the United States of America\n\n**Estimated Expenditure**\n\n* $96,730,286 for the United States of America\n* $68,939,192 for the United Kingdom\n* $24,294,241 for the Caribbean\n* $21,136,450 for Canada\n* $15,738,743 for Continental Europe\n* $3,405,668 for Other\n* $1,468,836 for Latin America"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Cruise Passenger Arrivals by Country of Residence",
    "text": "In Q4 2019,\n\n* 104,691 Cruise Passenger Arrivals were from the United States.\n* 61,442 from the UK\n* 32,935 from Germany\n* 14,669 from Canada\n* 7,761 other parts of Europe\n* 7,252 from other places\n* 5,114 from France\n* 2,088 from the Caribbean\n* 1,737 from Italy\n* 1,451 from South America\n* 1,146 from Switzerland"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Financial services",
    "text": "Antigua and Barbuda is advertised as \"an attractive offshore jurisdiction.\"\nThe country was the first to sign the United Nations' anti-money laundering\nact. This agreement came out of a conference in 1999 which urged worldwide\noffshore financial centers to introduce laws to tighten their policing of\nmoney laundering activities. The United Kingdom exerted considerable pressure\non Antigua and Barbuda to reform laws to combat money laundering, even issuing\nan advisory in April 1999 to British financial institutions that Antigua and\nBarbuda's anti-money laundering laws were wanting. Antigua and Barbuda\nresponded to this concern, and a subsequent joint United States and United\nKingdom review reported they were satisfied that the country had taken\npositive steps to check illegal activity in this sector. In September 2000 the\ngovernment of Antigua and Barbuda announced that it had strengthened its\nsurveillance of money laundering and drug trafficking. In March 2009, the\nStanford Financial Group, based in Antigua was found by regulators there and\nin the United States, of operating a massive ponzi scheme. The international\nbank controlled by the Stanford group is now in receivership pending the\noutcome of an investigation.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "2.9",
    "section_name": "Retail",
    "text": "The retail sector is dominated by the sale of food and beverages, clothing and\ntextiles, and vegetables. The main markets are located in the capital, St.\nJohn's. There are many street vendors and duty-free shops. The government has\nbeen taking steps to improve this sector. A US$43.5 million vendors' mall and\nmarket has been built to provide better facilities for retailers in the\ncapital. In addition, a US$27 million fisheries complex now provides improved\nfacilities for fish processing and retailing. A growing area of computer\nbusiness on Antigua is Internet casinos."
  },
  {
    "chapter_name": "Economy of Antigua and Barbuda",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Statistics",
    "text": "**GDP:** purchasing power parity \\- $1.61 billion (2008 est.)\n\n_country comparison to the world:_ 189\n\n**GDP - real growth rate:** 2.1% (2008 est.)\n\n_country comparison to the world:_ 161\n\n**GDP - per capita:** purchasing power parity - $19,000 (2008 est.)\n\n_country comparison to the world:_ 64\n\n**GDP - composition by sector:** _agriculture:_ 3.8% _industry:_ 22%\n_services:_ 74.3% (2002 est.)\n\n**Inflation rate (consumer prices):** 1.5% (2007 est.)\n\n_country comparison to the world:_ 14\n\n**Labor force:** 30,000 (1991)\n\n_country comparison to the world:_ 197\n\n**Unemployment rate:** 11% (2001 est.)\n\n_country comparison to the world:_ 130\n\n**Budget:** _revenues:_ $123.7 million\n\n_expenditures:_ $145.9 million (2000 est.)\n\n**Central bank discount rate:** 6.5% (January 2008)\n\n_country comparison to the world:_ 57\n\n**Agriculture - products:** cotton, fruits, vegetables, bananas, coconuts,\ncucumbers, mangoes, sugarcane; livestock\n\n**Industries:** tourism, construction, light manufacturing (clothing, alcohol,\nhousehold appliances)\n\n**Electricity - production:** 105 million kWh (2006)\n\n_country comparison to the world:_ 188\n\n**Electricity - consumption:** 97.65 million kWh (2006)\n\n_country comparison to the world:_ 189\n\n**Electricity - exports:** 0 kWh (2007)\n\n**Electricity - imports:** 0 kWh (2007)\n\n**Oil - production:** 0 bbl/d (0 m3/d) (2007)\n\n_country comparison to the world:_ 116\n\n**Oil - consumption:** 4,109 bbl/d (653.3 m3/d) (2006 est.)\n\n_country comparison to the world:_ 169\n\n**Oil - exports:** 157.7 bbl/d (25.07 m3/d) (2005)\n\n_country comparison to the world:_ 132\n\n**Oil - imports:** 4,556 bbl/d (724.3 m3/d) (2005)\n\n_country comparison to the world:_ 161\n\n**Oil - proved reserves:** 0 bbl (0 m3) (1 January 2006 est.)\n\n_country comparison to the world:_ 99\n\n**Natural gas - production:** 0 cu m (2007 est.)\n\n_country comparison to the world:_ 209\n\n**Natural gas - consumption:** 0 cu m (2007 est.)\n\n_country comparison to the world:_ 209\n\n**Natural gas - exports:** 0 cu m (2006 est.)\n\n_country comparison to the world:_ 206\n\n**Natural gas - imports:** 0 cu m (2006)\n\n_country comparison to the world:_ 205\n\n**Natural gas - proved reserves:** 0 cu m (1 January 2006 est.)\n\n_country comparison to the world:_ 206\n\n**Exports:** $84.3 million (2007 est.)\n\n_country comparison to the world:_ 199\n\n**Exports - commodities:** petroleum products 48%, manufactures 23%, machinery\nand transport equipment 17%, food and live animals 4%, other 8%\n\n**Exports - partners:** Spain 34%, Germany 20.7%, Italy 7.7%, Singapore 5.8%,\nUK 4.9% (2006)\n\n**Imports:** $522.8 million (2007 est.)\n\n_country comparison to the world:_ 189\n\n**Imports - commodities:** food and live animals, machinery and transport\nequipment, manufactures, chemicals, oil\n\n**Imports - partners:** US 21.1%, China 16.4%, Germany 13.3%, Singapore 12.7%,\nSpain 6.5% (2006)\n\n**Debt - external:** $359.8 million (June 2006)\n\n_country comparison to the world:_ 169\n\n**Economic aid - recipient:** $7.23 million (2005)\n\n**Currency:** 1 East Caribbean dollar (EC$) = 100 cents\n\n**Exchange rates:** East Caribbean dollars per US dollar - 2.7 (2007), 2.7\n(2007), 2.7 (2006), 2.7 (2005), 2.7 (2004), 2.7 (2003) **note:** fixed rate\nsince 1976\n\n**Fiscal year:** 1 April - 31 March"
  }
]