[
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofPapua New Guinea** (PNG) is largely underdeveloped with the\nvast majority of the population living below the poverty line. However,\naccording to the Asian Development Bank its GDP is expected to grow 3.4% in\n2022 and 4.6% in 2023. It is dominated by the agricultural, forestry, and\nfishing sector and the minerals and energy extraction sector. The\nagricultural, forestry, and fishing sector accounts for most of the labour\nforce of PNG while the minerals and energy extraction sector, including gold,\ncopper, oil and natural gas is responsible for most of the export earnings.\n\nMain market in Goroka\n\nPNG's GDP growth has been driven by the extraction industries and real GDP\ngrowth per capita has averaged 4% since mid-2000. The GDP Growth rate for PNG\nin 2021 was at 1.3%. The country has made significant progress investing\nproceeds from oil and gas in infrastructure building. As a result, its major\ncities like Port Moresby and Lae have received increased international\ninvestor attention, giving rise to an unprecedented building boom to exploit\nthe opportunities presented by the country's rise as a regional economic\nleader in the South Pacific region. This is well supported by its strategic\nlocation as a gateway from the Pacific to Asia, as well as its comparatively\nhuge landmass and demographic profile (almost 7 times that of the rest of the\nsmaller Pacific Island nations)\n\nThe International Monetary Fund has reported that despite PNG's poverty, it is\nrichly endowed with natural resources, but exploitation has been hampered by\nthe rugged terrain and the high cost of developing infrastructure. Agriculture\nprovides a subsistence livelihood for the bulk of the population. Mineral\ndeposits, including oil, copper, and gold, account for 72% of export earnings.\n\nBudgetary support from Australia and development aid under World Bank auspices\ncontinue to sustain the economy. Australia is PNG's largest aid donor, and\nwill provide $479.2 million of aid in 2023. In June 2021 the World Bank\napproved a US$100 million (PGK 352 million equivalent) operation to support\nPapua New Guinea in its response to COVID-19, and to lay important foundations\nfor a sustainable recovery.",
    "openai_summarised_points": [
      "• The economy of Papua New Guinea (PNG) is largely underdeveloped, with the vast majority of the population living below the poverty line.",
      "• According to the Asian Development Bank, PNG's GDP is expected to grow by 3.4% in 2022 and 4.6% in 2023.",
      "• PNG's economy is dominated by two main sectors: the agricultural, forestry, and fishing sector, and the minerals and energy extraction sector.",
      "• The agricultural, forestry, and fishing sector employs most of PNG’s labor force.",
      "• The minerals and energy extraction sector, which includes gold, copper, oil, and natural gas, accounts for the majority of PNG’s export earnings.",
      "• PNG’s GDP growth has been primarily driven by the extraction industries, with real GDP growth per capita averaging 4% since the mid-2000s.",
      "• The GDP growth rate for PNG in 2021 was 1.3%.",
      "• PNG has made significant progress in investing proceeds from oil and gas revenues into infrastructure development.",
      "• Major cities such as Port Moresby and Lae have attracted increased international investor attention, resulting in an unprecedented building boom.",
      "• This urban development boom aims to capitalize on PNG’s emergence as a regional economic leader in the South Pacific.",
      "• PNG’s strategic location serves as a gateway from the Pacific to Asia, enhancing its economic potential.",
      "• PNG’s large landmass and demographic profile, nearly seven times that of other smaller Pacific Island nations, contribute to its economic significance in the region.",
      "• The International Monetary Fund (IMF) reports that despite widespread poverty, PNG is richly endowed with natural resources.",
      "• Exploitation of these resources has been hindered by rugged terrain and the high cost of infrastructure development.",
      "• Agriculture provides a subsistence livelihood for the majority of PNG’s population.",
      "• Mineral deposits, including oil, copper, and gold, constitute 72% of PNG’s export earnings.",
      "• Budgetary support from Australia and development aid coordinated under World Bank auspices continue to sustain PNG’s economy.",
      "• Australia is PNG’s largest aid donor and plans to provide $479.2 million in aid in 2023.",
      "• In June 2021, the World Bank approved a US$100 million operation (equivalent to PGK 352 million) to support PNG’s response to the COVID-19 pandemic and to establish foundations for sustainable economic recovery."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:11.515317",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2202,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economy",
    "text": "Port Moresby's central business district\n\nPapua New Guinea is classified as a developing economy by the International\nMonetary Fund. The economy is largely dependent on natural resources. As of\n2018, natural resource extraction made up 28% of overall GDP, with substantial\ncontributors including minerals, oil, and natural gas.\n\nAccording to the Investment Promotion Authority of Papua New Guinea the major\neconomic sectors are agriculture and livestock, forestry, mining and\npetroleum, tourism and hospitality, fisheries and marine resources,\nmanufacturing, retailing and wholesaling, building and construction, transport\nand telecommunications, and finance and business trade. The economy generally\ncan be separated into subsistence and market sectors, although the distinction\nis blurred by smallholder cash cropping of coffee, cocoa, and copra. About 75%\nof the country's population relies primarily on the subsistence economy. The\nminerals, timber, and fish sectors are dominated by foreign investors.\nManufacturing is limited, and the formal labour sector consequently also is\nlimited.\n\nTimber and marine resources are also exported, with the country being one of\nthe few suppliers of tropical timber, Forestry is an important economic\nresource for Papua New Guinea, but the industry uses low and semi-intensive\ntechnological inputs. As a result, product ranges are limited to sawed timber,\nveneer, plywood, block board, moulding, poles and posts and wood chips. Only a\nfew limited finished products are exported. Lack of automated machinery,\ncoupled with inadequately trained local technical personnel, are some of the\nobstacles to introducing automated machinery and design. Forestry is an avenue\nfor corruption and many projects face legal uncertainty. Up to 70% of logging\nmay be illegal. Marine fisheries provide around 10% of global catch.\n\nOther sources include renewable resources, such as forests, marine resources\n(including a large portion of the world's major tuna stocks), and in some\nparts agriculture. Agriculture, for subsistence and cash crops, provides a\nlivelihood for 85% of the population and continues to provide some 30% of GDP.\nOil palm production has grown steadily over recent years (largely from estates\nand with extensive outgrower output), with palm oil now the main agricultural\nexport. Coffee remains the major export crop (produced largely in the\nHighlands provinces); followed by cocoa and coconut oil/copra from the coastal\nareas, each largely produced by smallholders; tea, produced on estates; and\nrubber.[_citation needed_]\n\nMeasuring economic growth is tricky due to the resource-dependent economy\ndistorting GDP. Other metrics such as Gross national income are hard to\nmeasure. Even historical GDP estimates have changed dramatically. As of 2019,\nPNG's real GDP growth rate was 3.8%, with an inflation rate of 4.3% This\neconomic growth has been primarily attributed to strong commodity prices,\nparticularly mineral but also agricultural, with the high demand for mineral\nproducts largely sustained even during the crisis by the buoyant Asian\nmarkets, a booming mining sector and by a buoyant outlook and the construction\nphase for natural gas exploration, production, and exportation in liquefied\nform (liquefied natural gas or \"LNG\") by LNG tankers, all of which will\nrequire multibillion-dollar investments (exploration, production wells,\npipelines, storage, liquefaction plants, port terminals, LNG tanker ships).\n\nFormal employment is low. There is a minimum wage, but it has declined in real\nterms since independence. In the late 2010s, around 40% of those employed in\nurban areas worked outside of agriculture, but only around 20% in rural areas.\n\nThe Papua New Guinean kina is managed through a crawling peg, with its value\nheavily impacted by the country's natural resource exports. The largest\nbilateral trade partner is Australia, followed by Japan, and then China.",
    "openai_summarised_points": [
      "• Papua New Guinea (PNG) is classified as a developing economy by the International Monetary Fund (IMF), with its economy largely dependent on natural resources.",
      "• As of 2018, natural resource extraction accounted for 28% of PNG's overall Gross Domestic Product (GDP), with key contributors including minerals, oil, and natural gas.",
      "• The Investment Promotion Authority of Papua New Guinea identifies the major economic sectors as agriculture and livestock, forestry, mining and petroleum, tourism and hospitality, fisheries and marine resources, manufacturing, retailing and wholesaling, building and construction, transport and telecommunications, and finance and business trade.",
      "• PNG's economy is generally divided into subsistence and market sectors, though this distinction is blurred by smallholder cash cropping of coffee, cocoa, and copra.",
      "• Approximately 75% of PNG's population relies primarily on the subsistence economy for their livelihood.",
      "• The minerals, timber, and fish sectors are predominantly dominated by foreign investors, while manufacturing remains limited, resulting in a correspondingly limited formal labor sector.",
      "• Timber and marine resources are significant exports for PNG; the country is one of the few global suppliers of tropical timber.",
      "• The forestry industry in PNG is important economically but employs low and semi-intensive technological inputs, limiting product ranges to sawed timber, veneer, plywood, block board, moulding, poles and posts, and wood chips, with only a few finished products exported.",
      "• Challenges in the forestry sector include lack of automated machinery, inadequately trained local technical personnel, legal uncertainties, and corruption, with estimates suggesting up to 70% of logging may be illegal.",
      "• Marine fisheries contribute significantly, with PNG providing around 10% of the global fish catch, including a large portion of the world’s major tuna stocks.",
      "• Renewable resources such as forests, marine resources, and agriculture remain important, with agriculture providing livelihoods for 85% of the population and contributing approximately 30% of GDP.",
      "• Oil palm production has grown steadily in recent years, primarily from estates and extensive outgrower output, making palm oil the main agricultural export.",
      "• Coffee remains PNG's major export crop, largely produced in the Highlands provinces, followed by cocoa and coconut oil/copra from coastal areas, both mainly produced by smallholders; tea is produced on estates, and rubber is also cultivated.",
      "• Measuring PNG's economic growth is complicated due to distortions in GDP caused by the resource-dependent economy, and other metrics such as Gross National Income are difficult to measure accurately.",
      "• Historical GDP estimates for PNG have changed dramatically over time, reflecting measurement challenges.",
      "• In 2019, PNG's real GDP growth rate was 3.8%, with an inflation rate of 4.3%.",
      "• This economic growth has been primarily driven by strong commodity prices, especially minerals and agricultural products, supported by buoyant Asian markets.",
      "• The mining sector has been booming, and there has been a positive outlook due to the construction phase of natural gas exploration, production, and exportation in liquefied natural gas (LNG) form, involving multibillion-dollar investments in exploration, production wells, pipelines, storage, liquefaction plants, port terminals, and LNG tanker ships.",
      "• Formal employment levels in PNG are low; although a minimum wage exists, it has declined in real terms since independence.",
      "• In the late 2010s, approximately 40% of employed persons in urban areas worked outside agriculture, compared to only about 20% in rural areas.",
      "• The Papua New Guinean kina is managed through a crawling peg exchange rate system, with its value heavily influenced by the country's natural resource exports.",
      "• PNG's largest bilateral trade partner is Australia, followed by Japan and then China."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:13.860884",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3920,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Mineral resources",
    "text": "The Ok Tedi Mine in southwestern Papua New Guinea\n\nSignificant exported minerals include gold, copper, cobalt, and nickel. Oil\nand liquified natural gas (LNG) are also significant resource exports.\nExtractive resources make up 86% of all exports, has their high value has\nenabled the country to generally run current account surpluses. The biggest\nmine is a private gold mine on Lihir Island, which is followed by the state-\nrun Ok Tedi Mine, and then the Porgera Gold Mine. LNG exports began in 2014,\nalthough the opening of new projects has been delayed due to disputes\nregarding revenue sharing.\n\nIn 1999, mineral production accounted for 26.3% of gross domestic product.\nGovernment revenues and foreign exchange earning minerals. Copper and gold\nmines are currently in production at Porgera, Ok Tedi, Misima, Lihir, Simberi\nand Hidden Valley. As of 2014, talks of resuming mining operations in the\nPanguna mine have also resurfaced, with the Autonomous Bougainville Government\nand National Government of Papua New Guinea expressing interest in restarting\nmining operations in the area.\n\nNew nickel, copper and gold projects have been identified and are awaiting a\nrise in commodity prices to begin development. At early 2011, there are\nconfirmation that Mount Suckling project has found at least two new large\nhighly prospective porphyry bodies at Araboro Creek and Ioleu Creek. A\nconsortium led by Chevron is producing and exporting oil from the Southern\nHighlands Province of Papua New Guinea. In 2001, it expects to begin the\ncommercialization of the country's estimated 640 km3 (23 trillion cubic feet)\nof natural gas reserves through the construction of a gas pipeline from Papua\nNew Guinea to Queensland, Australia. The project was shelved.\n\nIn 2019, the country was the 8th largest world producer of cobalt, and the\n15th largest world producer of gold. In the production of silver, in 2017 the\ncountry produced 90 tons.\n\nMineral deposits account for 72% of export earnings.\n\nThe Iagifu/Hedinia Field was discovered in 1986 in the Papuan fold and thrust\nbelt.\n\nThe first major gas project was the PNG LNG joint venture. ExxonMobil is\noperator of the joint venture, also comprising PNG company Oil Search, Santos,\nKumul Petroleum Holdings (Papua New Guinea's national oil and gas company), JX\nNippon Oil and Gas Exploration, the PNG government's Mineral Resources\nDevelopment Company and Petromin PNG Holdings. The project is an integrated\ndevelopment that includes gas production and processing facilities in the\nHela, Southern Highlands and Western Provinces of Papua New Guinea, including\nliquefaction and storage facilities (located northwest of Port Moresby) with\ncapacity of 6.9 million tonnes per year. There are over 700 kilometres (430\nmi) of pipelines connecting the facilities.[_non-primary source needed_] It is\nthe largest private-sector investment in the history of PNG. A second major\nproject is based on initial rights held by the French oil and gas major\nTotalEnergies and the U.S. company InterOil Corp. (IOC), which have partly\ncombined their assets after TotalEnergies agreed in December 2013 to purchase\n61.3% of IOC's Antelope and Elk gas field rights, with the plan to develop\nthem starting in 2016, including the construction of a liquefaction plant to\nallow export of LNG. TotalEnergies has separately another joint operating\nagreement with Oil Search.\n\nFurther gas and mineral projects are proposed (including the large Wafi-Golpu\ncopper-gold mine), with extensive exploration ongoing across the\ncountry.[_failed verification_]",
    "openai_summarised_points": [
      "• The Ok Tedi Mine is a significant mineral resource located in southwestern Papua New Guinea and is state-run.",
      "• Key exported minerals from Papua New Guinea include gold, copper, cobalt, and nickel, with oil and liquified natural gas (LNG) also constituting important resource exports.",
      "• Extractive resources account for 86% of all exports, and their high value has generally enabled Papua New Guinea to maintain current account surpluses.",
      "• The largest mine in the country is a private gold mine on Lihir Island, followed by the state-run Ok Tedi Mine, and then the Porgera Gold Mine.",
      "• LNG exports from Papua New Guinea commenced in 2014; however, the initiation of new LNG projects has been delayed due to disputes over revenue sharing.",
      "• In 1999, mineral production contributed 26.3% to Papua New Guinea’s gross domestic product (GDP).",
      "• Minerals provide significant government revenues and foreign exchange earnings, with active copper and gold mines located at Porgera, Ok Tedi, Misima, Lihir, Simberi, and Hidden Valley.",
      "• As of 2014, discussions to resume mining operations at the Panguna mine have re-emerged, with both the Autonomous Bougainville Government and the National Government of Papua New Guinea expressing interest in restarting mining activities there.",
      "• New nickel, copper, and gold projects have been identified but are awaiting higher commodity prices before development can begin.",
      "• By early 2011, the Mount Suckling project confirmed the discovery of at least two large, highly prospective porphyry bodies at Araboro Creek and Ioleu Creek.",
      "• A consortium led by Chevron produces and exports oil from Papua New Guinea’s Southern Highlands Province.",
      "• In 2001, Papua New Guinea planned to commercialize its estimated 640 km³ (23 trillion cubic feet) of natural gas reserves by constructing a gas pipeline to Queensland, Australia; however, this project was ultimately shelved.",
      "• In 2019, Papua New Guinea ranked as the world’s 8th largest producer of cobalt and the 15th largest producer of gold.",
      "• In 2017, the country produced 90 tons of silver.",
      "• Mineral deposits contribute approximately 72% of Papua New Guinea’s export earnings.",
      "• The Iagifu/Hedinia Field, located in the Papuan fold and thrust belt, was discovered in 1986.",
      "• The first major gas project in Papua New Guinea is the PNG LNG joint venture, operated by ExxonMobil and including partners Oil Search, Santos, Kumul Petroleum Holdings (the national oil and gas company), JX Nippon Oil and Gas Exploration, the Mineral Resources Development Company, and Petromin PNG Holdings.",
      "• The PNG LNG project is an integrated development comprising gas production and processing facilities in the Hela, Southern Highlands, and Western Provinces, as well as liquefaction and storage facilities northwest of Port Moresby with a capacity of 6.9 million tonnes per year.",
      "• The PNG LNG project includes over 700 kilometers (430 miles) of pipelines connecting its facilities and represents the largest private-sector investment in Papua New Guinea’s history.",
      "• A second major gas project is based on initial rights held by French oil and gas company TotalEnergies and U.S. company InterOil Corp. (IOC); in December 2013, TotalEnergies agreed to purchase 61.3% of IOC’s Antelope and Elk gas field rights with plans to develop these starting in 2016, including constructing a liquefaction plant for LNG export.",
      "• TotalEnergies also holds a separate joint operating agreement with Oil Search.",
      "• Additional gas and mineral projects, including the large Wafi-Golpu copper-gold mine, have been proposed, with extensive exploration ongoing throughout Papua New Guinea."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:19.190470",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3562,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Gold discovery",
    "text": "Traces of gold were first found in 1852, in pottery from Redscar Bay on the\nPapuan Peninsula.",
    "openai_summarised_points": [
      "• Traces of gold were initially discovered in 1852 within pottery artifacts found at Redscar Bay, located on the Papuan Peninsula in Papua New Guinea."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:03.729220",
      "openai_model": "gpt-4.1-mini",
      "content_length": 93,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture, timber, and fish",
    "text": "Agriculture in the country includes crops grown for domestic sale and\ninternational export, as well as for subsistence agriculture. Agricultural\nexport of commodities such as copra, copra oil, rubber, tea, cocoa, and coffee\nhave not grown. However, the conversion of forests to oil palm plantations to\nproduce palm oil has become a significant and growing source of employment and\nincome. Overall the country produces 1.6% of global palm oil, and 1% of global\ncoffee. While not the largest sector of the economy, agriculture provides the\nmost employment, at around 85% of all jobs.\n\nNearly 40% of the population are subsistence farmers, living relatively\nindependently of the cash economy. Their traditional social groupings are\nexplicitly acknowledged by the Papua New Guinea Constitution, which expresses\nthe wish for \"traditional villages and communities to remain as viable units\nof Papua New Guinean society\" and protects their continuing importance to\nlocal and national community life.[_citation needed_] This makes farming the\nmost widespread economic activity. Most is carried out through simple rainfed\nsurface irrigation, with specific techniques varying by location. Taro is a\nhistorical crop, although the introduction of the now-staple sweet potato\nallowed for cultivation as high as 2,700 metres (8,900 ft). _Metroxylon_ (a\nsago palm) is another common crop.\n\nThe agricultural, forestry, and fishing sector accounts for most of the labour\nforce of PNG. Agriculture currently accounts for 25% of GDP and supports more\nthan 80% of the population. Most agriculture is subsistence, while cash crops\nare exported. The main crops by value are coffee, oil, cocoa, copra, tea,\nrubber, and sugar. The timber industry was not active in 1998, due to low\nworld prices, but rebounded in 1999. About 40% of the country is covered with\ntimber rich trees, and a domestic woodworking industry has been slow to\ndevelop. Fish exports are confined primarily to shrimp, although fishing boats\nof other nations catch tuna in Papua New Guinea waters under license.\n\nPapua New Guinea has the largest yam market in Asia.\n\nPapua New Guinea produced in 2021:\n\n* 3.0 million tons of palm oil (7th largest world producer);\n* 1.8 million tons of coconut (7th largest world producer);\n* 1.3 million tons of banana;\n* 1.1 million tons of fruits, fresh nes;\n* 699 thousand tons of sweet potato (17th largest world producer);\n* 371 thousand tons of yam;\n* 361 thousand tons of root and tubers;\n* 353 thousand tons of sugar cane;\n* 322 thousand tons of vegetable;\n* 278 thousand tons of taro;\n* 247 thousand tons of maize (green);\n* 156 thousand tons of cassava;\n* 109 thousand tons of berries nes;\n* 42 thousand tons of coffee;\n* 42 thousand tons of cocoa;\n\nIn addition to smaller productions of other agricultural products, like\nnatural rubber (7.7 thousand tons) and tea (5.5 thousand tons).",
    "openai_summarised_points": [
      "• Agriculture in Papua New Guinea encompasses crops grown for domestic sale, international export, and subsistence farming, with key export commodities including copra, copra oil, rubber, tea, cocoa, and coffee, although these exports have not experienced growth.",
      "• The conversion of forests into oil palm plantations for palm oil production has become a significant and expanding source of employment and income in Papua New Guinea.",
      "• Papua New Guinea produces approximately 1.6% of the global palm oil supply and 1% of the global coffee supply.",
      "• Despite not being the largest economic sector, agriculture provides the majority of employment in the country, accounting for around 85% of all jobs.",
      "• Nearly 40% of Papua New Guinea’s population are subsistence farmers who live relatively independently from the cash economy.",
      "• The Papua New Guinea Constitution explicitly acknowledges traditional social groupings, expressing the desire for \"traditional villages and communities to remain as viable units of Papua New Guinean society,\" thereby protecting their ongoing importance in local and national community life.",
      "• Farming is the most widespread economic activity in Papua New Guinea, predominantly conducted through simple rainfed surface irrigation, with agricultural techniques varying by location.",
      "• Taro is a historical staple crop, while the introduction of sweet potato has enabled cultivation at altitudes as high as 2,700 metres (8,900 feet).",
      "• The sago palm (_Metroxylon_) is another common crop cultivated in Papua New Guinea.",
      "• The combined agricultural, forestry, and fishing sector employs the majority of Papua New Guinea’s labor force.",
      "• Agriculture accounts for 25% of Papua New Guinea’s Gross Domestic Product (GDP) and supports more than 80% of the population.",
      "• Most agricultural production is subsistence-based, with cash crops such as coffee, palm oil, cocoa, copra, tea, rubber, and sugar grown primarily for export.",
      "• The timber industry in Papua New Guinea was inactive in 1998 due to low world prices but experienced a rebound in 1999.",
      "• Approximately 40% of Papua New Guinea’s land area is covered with timber-rich forests, although the domestic woodworking industry has developed slowly.",
      "• Fish exports from Papua New Guinea are primarily limited to shrimp, while foreign fishing vessels catch tuna in Papua New Guinea waters under license agreements.",
      "• Papua New Guinea hosts the largest yam market in Asia.",
      "• In 2021, Papua New Guinea’s agricultural production included:",
      "• 3.0 million tons of palm oil, ranking as the 7th largest global producer;",
      "• 1.8 million tons of coconut, also the 7th largest global producer;",
      "• 1.3 million tons of bananas;",
      "• 1.1 million tons of fresh fruits (not elsewhere specified);",
      "• 699 thousand tons of sweet potato, ranking 17th globally;",
      "• 371 thousand tons of yam;",
      "• 361 thousand tons of roots and tubers;",
      "• 353 thousand tons of sugar cane;",
      "• 322 thousand tons of vegetables;",
      "• 278 thousand tons of taro;",
      "• 247 thousand tons of green maize;",
      "• 156 thousand tons of cassava;",
      "• 109 thousand tons of berries (not elsewhere specified);",
      "• 42 thousand tons of coffee;",
      "• 42 thousand tons of cocoa.",
      "• Additional smaller agricultural productions in 2021 included natural rubber at 7.7 thousand tons and tea at 5.5 thousand tons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:11.516723",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2874,
      "bullet_points_count": 33
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Industry",
    "text": "In general, the Papua New Guinea economy is highly dependent on imports for\nmanufactured goods. Its industrial sector—exclusive of mining—accounts for\nonly 9% of GDP and contributes little to exports. Small-scale industries\nproduce beer, soap, concrete products, clothing, paper products, matches, ice\ncream, canned meat, fruit juices, furniture, plywood, and paint. The small\ndomestic market, relatively high wages, and high transport costs are\nconstraints to industrial development.",
    "openai_summarised_points": [
      "• The Papua New Guinea economy is heavily reliant on imports for manufactured goods, indicating limited domestic production capacity in this sector.",
      "• The industrial sector of Papua New Guinea, excluding mining activities, contributes only 9% to the country’s Gross Domestic Product (GDP), reflecting a relatively small role in the overall economy.",
      "• Industrial production in Papua New Guinea contributes minimally to the country’s export earnings, highlighting limited international competitiveness in manufactured goods.",
      "• Small-scale industries in Papua New Guinea produce a diverse range of products including beer, soap, concrete products, clothing, paper products, matches, ice cream, canned meat, fruit juices, furniture, plywood, and paint.",
      "• The development of the industrial sector in Papua New Guinea faces significant constraints due to the small size of the domestic market, which limits economies of scale and demand for locally produced goods.",
      "• Relatively high wages in Papua New Guinea act as a barrier to industrial growth by increasing production costs compared to other countries.",
      "• High transport costs within Papua New Guinea further hinder industrial development by raising the expenses associated with distributing goods domestically and internationally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:05.673053",
      "openai_model": "gpt-4.1-mini",
      "content_length": 484,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Telecommunications",
    "text": "Until the second half of 2007, information and communication technology (ICT)\nservices in Papua New Guinea (PNG) were limited to urban centres under the\nmonopoly operator, Telikom PNG (Mitchel 2008). Thereafter, the Irish owned\nutility Digicel entered the mobile market and expanded mobile signal coverage\nacross the country enabling connectivity to many people — the mobile phone\npenetration rate reached 41 per cent by 2014, marking a substantial change in\nthe communications landscape. PNG has 42.68 mobile phone users per 100\npopulation, estimated in 2017. PNG has a low level of broadband uptake,\nestimated in 2017 at 0.213 per 100 population.",
    "openai_summarised_points": [
      "• Until the second half of 2007, information and communication technology (ICT) services in Papua New Guinea (PNG) were confined primarily to urban centres and operated under the monopoly of Telikom PNG, the national telecommunications provider (Mitchel 2008).",
      "• In the latter half of 2007, the Irish-owned telecommunications company Digicel entered the PNG mobile market, breaking the monopoly and significantly expanding mobile signal coverage throughout the country.",
      "• The entry of Digicel facilitated increased connectivity for a broad segment of the PNG population, transforming the communications landscape from limited urban access to widespread mobile availability.",
      "• By 2014, mobile phone penetration in Papua New Guinea had reached 41 percent, indicating substantial growth in mobile telecommunications adoption within a relatively short period.",
      "• As of 2017, Papua New Guinea had approximately 42.68 mobile phone users per 100 population, reflecting continued expansion in mobile usage across the country.",
      "• Despite improvements in mobile telephony, Papua New Guinea exhibited a low level of broadband uptake, with broadband penetration estimated at only 0.213 per 100 population in 2017, highlighting ongoing challenges in internet accessibility and infrastructure development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:08.029472",
      "openai_model": "gpt-4.1-mini",
      "content_length": 648,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Energy",
    "text": "Particularly in rural areas there is reliance on traditional sources of\nbiomass energy for cooking.",
    "openai_summarised_points": [
      "• In Papua New Guinea, particularly in rural areas, there is a significant reliance on traditional sources of biomass energy for cooking purposes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:06.700269",
      "openai_model": "gpt-4.1-mini",
      "content_length": 99,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.1",
    "section_name": "Access to electricity",
    "text": "By 2017, only 50.42% of the rural population had access to electricity. 80.23%\nof the urban population in 2017 had access to electricity. Limitations in the\ntransmission and distribution infrastructure lead to frequent outages in urban\ncenters.",
    "openai_summarised_points": [
      "• By the year 2017, only 50.42% of Papua New Guinea's rural population had access to electricity, indicating limited electrification in non-urban areas.",
      "• In contrast, 80.23% of the urban population in Papua New Guinea had access to electricity in 2017, reflecting higher electrification rates in cities and towns.",
      "• Despite relatively higher urban access, frequent power outages occur in urban centers due to limitations in the transmission and distribution infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:08.854026",
      "openai_model": "gpt-4.1-mini",
      "content_length": 244,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.2",
    "section_name": "Consumption",
    "text": "Electricity - consumption: 3.116 billion kWh (2012 est.)",
    "openai_summarised_points": [
      "• In 2012, Papua New Guinea's electricity consumption was estimated at 3.116 billion kilowatt-hours (kWh)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:08.875789",
      "openai_model": "gpt-4.1-mini",
      "content_length": 56,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.3",
    "section_name": "Generation",
    "text": "Electricity - production: 3.35 billion kWh (2012 est.)",
    "openai_summarised_points": [
      "• In 2012, Papua New Guinea's electricity production was estimated at 3.35 billion kilowatt-hours (kWh)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:09.975875",
      "openai_model": "gpt-4.1-mini",
      "content_length": 54,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.4",
    "section_name": "Transmission and distribution",
    "text": "PNG Power Ltd (PPL) operates three separate grids. There are two main large\ngrids, the Port Moresby system serving the National Capital District and the\nlarge Ramu grid that extends into the highlands. Also, PPL operates the small\nGazelle Peninsula Grid powered mainly by a 10 MW run-of-river hydro plant.",
    "openai_summarised_points": [
      "• PNG Power Ltd (PPL) is responsible for operating three distinct electrical grids within Papua New Guinea.",
      "• The first major grid operated by PPL is the Port Moresby system, which serves the National Capital District, the administrative and economic center of the country.",
      "• The second large grid managed by PPL is the Ramu grid, notable for its extensive reach into the highlands region of Papua New Guinea.",
      "• In addition to the two large grids, PPL also operates a smaller grid known as the Gazelle Peninsula Grid.",
      "• The Gazelle Peninsula Grid is primarily powered by a 10 megawatt (MW) run-of-river hydroelectric plant, highlighting the use of renewable energy sources in this area."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:11.838021",
      "openai_model": "gpt-4.1-mini",
      "content_length": 305,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.5",
    "section_name": "Entities and institutions",
    "text": "The Electricity Commission (ELCOM) was privatised with the passage of the\nElectricity Commission (Privatization) Act 2002. PNG Power Limited (PPL) is a\nvertically integrated utility responsible for generation, transmission,\ndistribution and retailing of electricity throughout Papua New Guinea.",
    "openai_summarised_points": [
      "• The Electricity Commission (ELCOM) of Papua New Guinea was privatised following the enactment of the Electricity Commission (Privatization) Act 2002.",
      "• PNG Power Limited (PPL) is the successor entity to ELCOM and operates as a vertically integrated utility.",
      "• PNG Power Limited (PPL) holds comprehensive responsibilities encompassing the generation, transmission, distribution, and retailing of electricity across the entire territory of Papua New Guinea."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:11.618740",
      "openai_model": "gpt-4.1-mini",
      "content_length": 294,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.6",
    "section_name": "Renewable energy",
    "text": "A study by Bloomberg New Energy Finance ranked PNG in the top 10 for potential\nrenewable resources, with about 2.5 GW of these but only 2% of it exploited.",
    "openai_summarised_points": [
      "• A study conducted by Bloomberg New Energy Finance ranked Papua New Guinea (PNG) among the top 10 countries globally for potential renewable energy resources.",
      "• The study identified that PNG possesses approximately 2.5 gigawatts (GW) of renewable energy potential.",
      "• Despite this significant potential, only about 2% of PNG's renewable energy resources have been exploited to date."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:13.559782",
      "openai_model": "gpt-4.1-mini",
      "content_length": 155,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.6.1",
    "section_name": "Hydroelectric projects",
    "text": "The Yonki Dam project, which commenced operation in 1991, on the Ramu River\nhas generation capacity of 77 MW (103,000 hp) (Ramu 1) plus proposed\nadditional capacity of 18 MW.",
    "openai_summarised_points": [
      "• The Yonki Dam project, located on the Ramu River in Papua New Guinea, began operation in 1991.",
      "• The existing generation capacity of the Yonki Dam (Ramu 1) is 77 megawatts (MW), equivalent to 103,000 horsepower (hp).",
      "• There is a proposed plan to add an additional 18 MW of generation capacity to the Yonki Dam project."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:13.810952",
      "openai_model": "gpt-4.1-mini",
      "content_length": 174,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "6.0.6.1.1",
    "section_name": "Proposed projects",
    "text": "The list of intended projects include the US$2 billion Ramu 2 hydro project on\nthe Ramu River to be built under a public-private partnership with Shenzhen\nEnergy Group.\n\nEdevu Dam is to be constructed by PNG Hydro Development Ltd (PNGHDL) to\ngenerate 50 Megawatts (MW).\n\nConsultants to PNG Power have conducted feasibility studies for the Naoro\nBrown hydroelectricity Project which would supply up to 80MW of electricity to\nthe Port Moresby grid.",
    "openai_summarised_points": [
      "• The proposed Ramu 2 hydro project on the Ramu River is valued at US$2 billion and is planned to be developed through a public-private partnership with Shenzhen Energy Group.",
      "• The Edevu Dam is scheduled for construction by PNG Hydro Development Ltd (PNGHDL) and is designed to generate 50 Megawatts (MW) of electricity.",
      "• Feasibility studies for the Naoro Brown hydroelectricity Project, intended to supply up to 80 MW of electricity to the Port Moresby grid, have been conducted by consultants working for PNG Power."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:18.475893",
      "openai_model": "gpt-4.1-mini",
      "content_length": 446,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Transport",
    "text": "The country's mountainous terrain impedes transport. Aeroplanes opened up the\ncountry during its colonial period and continue to be used for most travel and\nmost high-density/value freight. The capital, Port Moresby, has no road links\nto any of PNG's other major towns. Similarly, many remote villages are\nreachable only by light aircraft or on foot.\n\nJacksons International Airport is the major international airport in Papua New\nGuinea, located 8 kilometres (5 mi) from Port Moresby. In addition to two\ninternational airfields,[_citation needed_] Papua New Guinea has over 500\nairstrips, most of which are unpaved. The national airline is Air Niugini,\noperating out of Jacksons International.[_non-primary source needed_]\n\nTransport in Papua New Guinea is in many cases heavily limited by the\nmountainous terrain. The capital, Port Moresby, is not linked by road to any\nof the other major towns and many highland villages can only be reached by\nlight aircraft or on foot.\n\nPapua New Guinea has no major railways, but some mine sites have disused\ntracks.\n\nThe country has 10,940 km (6,800 mi) of waterways, and commercial port\nfacilities at Port Moresby, Alotau, Oro Bay, Lae, Kimbe, Kieta Madang, Buka,\nRabaul/Kokopo, Kiunga, Wewak and Vanimo.",
    "openai_summarised_points": [
      "• Papua New Guinea’s mountainous terrain significantly impedes transport infrastructure and connectivity across the country.",
      "• Aeroplanes have played a crucial role since the colonial period in opening up Papua New Guinea and continue to be the primary mode of travel and transport for most high-density and high-value freight.",
      "• The capital city, Port Moresby, lacks road connections to any of Papua New Guinea’s other major towns, highlighting the limited road transport network.",
      "• Many remote villages, particularly in the highlands, are accessible only by light aircraft or on foot, underscoring the challenges posed by the terrain.",
      "• Jacksons International Airport, located 8 kilometres (5 miles) from Port Moresby, serves as the major international airport in Papua New Guinea.",
      "• In addition to Jacksons International Airport and two other international airfields, Papua New Guinea has over 500 airstrips, most of which are unpaved, facilitating air travel to remote areas.",
      "• The national airline, Air Niugini, operates primarily out of Jacksons International Airport, serving as the country’s main carrier.",
      "• Papua New Guinea has no major railway systems; however, some disused railway tracks exist at certain mining sites, indicating limited historical rail infrastructure.",
      "• The country possesses 10,940 kilometres (6,800 miles) of waterways, which contribute to its transport network.",
      "• Commercial port facilities are located at multiple sites including Port Moresby, Alotau, Oro Bay, Lae, Kimbe, Kieta Madang, Buka, Rabaul/Kokopo, Kiunga, Wewak, and Vanimo, supporting maritime trade and transport."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:17.874045",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1245,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Finance",
    "text": "The Bank of Papua New Guinea (BPNG) is the central bank of Papua New Guinea.\nIts main function is to issue currency and to act as the banker and financial\nagent to the Government. It is also in charge of regulating banking and other\nfinancial services and manages the gold, foreign exchange and any other\ninternational reserves of Papua New Guinea.\n\nBPNG is engaged in developing policies to promote financial inclusion and is a\nmember of the Alliance for Financial Inclusion, which had been formed in 2008.\nIn 2013, BPNG made a Maya Declaration Commitment to create an enabling\nenvironment for building an inclusive financial sector in Papua New Guinea.\n\nThe currency of Papua New Guinean, issued by the BPNG, is the kina, which was\nintroduced on 19 April 1975 to replace the Australian dollar.",
    "openai_summarised_points": [
      "• The Bank of Papua New Guinea (BPNG) serves as the central bank of Papua New Guinea, with primary responsibilities including issuing the national currency and acting as the banker and financial agent to the Government of Papua New Guinea.",
      "• BPNG is tasked with regulating banking institutions and other financial services within the country, ensuring the stability and integrity of the financial sector.",
      "• The bank manages Papua New Guinea’s gold reserves, foreign exchange reserves, and other international reserves, playing a critical role in the country’s monetary stability and international financial relations.",
      "• BPNG actively develops policies aimed at promoting financial inclusion, seeking to increase access to financial services for all segments of the population.",
      "• The bank is a member of the Alliance for Financial Inclusion, an organization established in 2008 to support the development of inclusive financial sectors globally.",
      "• In 2013, BPNG made a formal commitment under the Maya Declaration to create an enabling environment that fosters the growth of an inclusive financial sector in Papua New Guinea.",
      "• The official currency of Papua New Guinea is the kina, which is issued by BPNG; the kina was introduced on 19 April 1975, replacing the Australian dollar as the national currency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:21.773988",
      "openai_model": "gpt-4.1-mini",
      "content_length": 795,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Trade and investment",
    "text": "In 2014, Papua New Guinea's merchandise exports were:\n\n* 41% fuels and mining;\n* 23.8% agriculture;\n* 6.2% manufacturing; and\n* 29% other.\n\nMajor destinations for merchandise exports include Australia (39.9%), the\nEuropean Union (20.2%), Japan (11.7%), China (6.7%), and Singapore (5.6%).\n\nIn 2014, Papua New Guinea's merchandise imports were:\n\n* 17.8% fuels and mining;\n* 11.4% agriculture;\n* 69.4% manufacturing; and\n* 1.4% other.\n\nMajor source countries for merchandise imports include Australia (34.4%),\nSingapore (14.3%), the European Union (8.3%), China (6.9%), and Japan (6.4%).\n\nPetroleum, mining machinery and aircraft have been the primary U.S. exports to\nPapua New Guinea. In 1999, as mineral exploration and new minerals investments\ndeclined, as did United States exports. Crude oil is the largest U.S. import\nfrom Papua New Guinea, followed by gold, cocoa, coffee, and copper ore.\n\nU.S. companies are active in developing Papua New Guinea's mining and\npetroleum sectors. Chevron operates the Kutubu and Gobe oil projects and is\ndeveloping its natural gas reserves. A 5,000–6,000 m³ (30,000–40,000 barrel)\nper day oil refinery project in which there is an American interest also is\nunder development in Port Moresby.\n\nIn 1993, Papua New Guinea became a participating economy in the Asia-Pacific\nEconomic Cooperation (APEC) Forum. In 1996, it joined the World Trade\nOrganization (WTO).",
    "openai_summarised_points": [
      "• In 2014, Papua New Guinea's merchandise exports comprised 41% fuels and mining, 23.8% agriculture, 6.2% manufacturing, and 29% other categories.",
      "• The major destinations for Papua New Guinea's merchandise exports in 2014 were Australia (39.9%), the European Union (20.2%), Japan (11.7%), China (6.7%), and Singapore (5.6%).",
      "• In 2014, Papua New Guinea's merchandise imports consisted of 17.8% fuels and mining, 11.4% agriculture, 69.4% manufacturing, and 1.4% other categories.",
      "• The principal source countries for Papua New Guinea's merchandise imports in 2014 were Australia (34.4%), Singapore (14.3%), the European Union (8.3%), China (6.9%), and Japan (6.4%).",
      "• Petroleum, mining machinery, and aircraft have historically been the primary exports from the United States to Papua New Guinea.",
      "• In 1999, a decline in mineral exploration and new mineral investments in Papua New Guinea corresponded with a decrease in United States exports to the country.",
      "• The largest U.S. import from Papua New Guinea is crude oil, followed by gold, cocoa, coffee, and copper ore.",
      "• U.S. companies are actively involved in developing Papua New Guinea's mining and petroleum sectors, with Chevron operating the Kutubu and Gobe oil projects and developing natural gas reserves.",
      "• A petroleum refinery project in Port Moresby, with American interests, is under development, designed to process 5,000–6,000 m³ (30,000–40,000 barrels) of oil per day.",
      "• Papua New Guinea became a participating economy in the Asia-Pacific Economic Cooperation (APEC) Forum in 1993.",
      "• In 1996, Papua New Guinea joined the World Trade Organization (WTO)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:21.162503",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1396,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Development programs and aid",
    "text": "Papua New Guinea is highly dependent on foreign aid. Australia has been the\nlargest bilateral aid donor to PNG, providing $A506 million ($US376 million)\nin 2016. Budgetary support, which has been provided in decreasing amounts\nsince independence, was phased out in 2000, with aid concentrated on project\ndevelopment.\n\nOther major aid sources to Papua New Guinea are Japan, the European Union, the\nPeople's Republic of China, the Republic of China, the United Nations, the\nAsian Development Bank, the International Monetary Fund, and the World Bank.\nVolunteers from a number of countries, including the United States, and\nmission church workers also provide education, health, and development\nassistance throughout the country.\n\nIn July 2024 The International Monetary Fund would provide Papua New Guinea\nwith immediate access to about $125 million in order \"to support Papua New\nGuinea’s reform agenda, help protect the vulnerable and foster inclusive\ngrowth, with a focus maintained on strengthening debt sustainability,\nalleviating FX shortages, and enhancing governance and anti-corruption\nframeworks,\"",
    "openai_summarised_points": [
      "• Papua New Guinea is highly dependent on foreign aid for its economic development and support.",
      "• Australia has been the largest bilateral aid donor to Papua New Guinea, providing AUD 506 million (USD 376 million) in 2016.",
      "• Australian budgetary support to Papua New Guinea, which had been provided since independence, was phased out in 2000; subsequent aid has been concentrated on project development rather than direct budget support.",
      "• Other major sources of aid to Papua New Guinea include Japan, the European Union, the People's Republic of China, the Republic of China (Taiwan), the United Nations, the Asian Development Bank, the International Monetary Fund, and the World Bank.",
      "• Volunteers from various countries, including the United States, as well as mission church workers, contribute to education, health, and development assistance across Papua New Guinea.",
      "• In July 2024, the International Monetary Fund (IMF) planned to provide Papua New Guinea with immediate access to approximately USD 125 million.",
      "• The IMF funding aims to support Papua New Guinea’s reform agenda, protect vulnerable populations, and foster inclusive economic growth.",
      "• The IMF assistance focuses on strengthening debt sustainability, alleviating foreign exchange shortages, and enhancing governance and anti-corruption frameworks in Papua New Guinea."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:18.623858",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1105,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Land tenure",
    "text": "The Ok Tedi Mine in southwestern Papua New Guinea\n\nOver 97% of the country designated as customary land, held by communities.\nMany such effective titles remain unregistered and effectively informal. Land\nregistration efforts have had very limited success.\n\nThe PNG legislature has enacted laws in which a type of tenure called\n\"customary land title\" is recognised, meaning that the traditional lands of\nthe indigenous peoples have some legal basis for inalienable tenure. This\ncustomary land notionally covers most of the usable land in the country (some\n97% of total land area); alienated land is either held privately under state\nlease or is government land. Freehold title (also known as fee simple) can\nonly be held by Papua New Guinean citizens.\n\nOnly some 3% of the land of Papua New Guinea is in private hands; this is\nprivately held under a 99-year state lease, or it is held by the State. There\nis virtually no freehold title; the few existing freeholds are automatically\nconverted to state leases when they are transferred between vendor and\npurchaser. Unalienated land is owned under customary title by traditional\nlandowners. The precise nature of the seisin varies from one culture to\nanother. Many writers portray land as the communal ownership of traditional\nclans; however, closer studies usually show that the smallest portions of land\nwhose ownership cannot be further divided are held by the individual heads of\nextended families and their descendants or their descendants alone if they\nhave recently died.[_citation needed_]\n\nThis is a matter of vital importance because a problem of economic development\nis identifying the membership of customary landowning groups and the owners.\nDisputes between mining and forestry companies and landowner groups often\ndevolve on the issue of whether the companies entered into contractual\nrelations for the use of land with the true owners. Customary property—usually\nland—cannot be devised by will. It can only be inherited according to the\ncustom of the deceased's people.[_citation needed_] The Lands Act was amended\nin 2010 along with the Land Group Incorporation Act, intended to improve the\nmanagement of state land, mechanisms for dispute resolution over land, and to\nenable customary landowners to be better able to access finance and possible\npartnerships over portions of their land if they seek to develop it for urban\nor rural economic activities. The Land Group Incorporation Act requires more\nspecific identification of the customary landowners than hitherto and their\nmore specific authorisation before any land arrangements are determined; (a\nmajor issue in recent years has been a land grab, using, or rather misusing,\nthe Lease-Leaseback provision under the Land Act, notably using 'Special\nAgricultural and Business Leases' (SABLs) to acquire vast tracts of customary\nland, purportedly for agricultural projects, but in almost all cases as a\nback-door mechanism for securing tropical forest resources for\nlogging—circumventing the more exacting requirements of the Forest Act, for\nsecuring Timber Permits (which must comply with sustainability requirements\nand be competitively secured, and with the customary landowners' approval).\nFollowing a national outcry, these SABLs have been subject to a Commission of\nInquiry, established in mid-2011, for which the report is still awaited for\ninitial presentation to the Prime Minister and Parliament.[_as of?_][_citation\nneeded_]",
    "openai_summarised_points": [
      "• Over 97% of Papua New Guinea’s land is designated as customary land, held collectively by indigenous communities, though many such titles remain unregistered and effectively informal, with land registration efforts achieving very limited success.",
      "• The Papua New Guinea legislature has enacted laws recognizing a form of tenure known as \"customary land title,\" which provides traditional indigenous lands with a legal basis for inalienable tenure, covering approximately 97% of the country’s total land area.",
      "• Alienated land in Papua New Guinea is either held privately under state lease or is government land, with freehold title (fee simple) being restricted exclusively to Papua New Guinean citizens.",
      "• Only about 3% of Papua New Guinea’s land is in private hands, held under 99-year state leases or by the State; virtually no freehold titles exist, as any freeholds are automatically converted to state leases upon transfer between vendor and purchaser.",
      "• Unalienated land is owned under customary title by traditional landowners, with the precise nature of ownership (seisin) varying among different cultural groups; while many portray land as communally owned by clans, detailed studies reveal that smallest indivisible land portions are held by individual heads of extended families and their descendants.",
      "• Identifying the membership and rightful owners of customary landowning groups is a critical issue for economic development, as disputes between mining and forestry companies and landowner groups often hinge on whether contractual agreements were made with the true landowners.",
      "• Customary property, primarily land, cannot be devised by will but must be inherited according to the customs of the deceased’s people.",
      "• The Lands Act and the Land Group Incorporation Act were amended in 2010 to improve state land management, enhance dispute resolution mechanisms, and enable customary landowners better access to finance and partnerships for developing portions of their land for urban or rural economic activities.",
      "• The Land Group Incorporation Act mandates more precise identification of customary landowners and requires their explicit authorization before any land arrangements are finalized, addressing prior issues of unclear ownership and consent.",
      "• A significant recent problem has been the misuse of the Lease-Leaseback provision under the Land Act, particularly through Special Agricultural and Business Leases (SABLs), which have been used to acquire large tracts of customary land purportedly for agricultural projects but effectively as a back-door method to secure tropical forest resources for logging.",
      "• SABLs circumvent the Forest Act’s stricter requirements for Timber Permits, which mandate sustainability compliance, competitive securing processes, and customary landowners’ approval.",
      "• Following widespread national outcry over SABL abuses, a Commission of Inquiry was established in mid-2011 to investigate these leases; as of the latest information, the Commission’s report is awaited for initial presentation to the Prime Minister and Parliament."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:27.037730",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3451,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Science and technology",
    "text": "Papua New Guinea's _National Vision 2050_ was adopted in 2009. This has led to\nthe establishment of the Research, Science and Technology Council. At its\ngathering in November 2014, the Council re-emphasised the need to focus on\nsustainable development through science and technology.\n\n_Vision 2050'_ s medium-term priorities are:\n\n* emerging industrial technology for downstream processing;\n* infrastructure technology for the economic corridors;\n* knowledge-based technology;\n* science and engineering education; and\n* to reach the target of investing 5% of GDP in research and development by 2050. (Papua New Guinea invested 0.03% of GDP in research and development in 2016.)\n\nIn 2016, women accounted for 33.2% of researchers in Papua New Guinea.\n\nAccording to Thomson Reuters' Web of Science, Papua New Guinea had the largest\nnumber of publications (110) among Pacific Island states in 2014, followed by\nFiji (106). Nine out of ten scientific publications from Papua New Guinea\nfocused on immunology, genetics, biotechnology and microbiology. Nine out of\nten were also co-authored by scientists from other countries, mainly\nAustralia, the United States of America, the United Kingdom, Spain and\nSwitzerland. In 2019 Papua New Guinea produced 253 publications in the Scopus\n(Elsevier) database of scientific publications. Health sciences accounted for\n49% of these publications. Papua New Guinea's top scientific collaborators\nfrom 2017 to 2019 were Australia, the United States of America, the United\nKingdom, France and India.\n\nRenewable energy sources represent two-thirds of the total electricity supply.\nIn 2015, the Secretariat of the Pacific Community observed that, 'while Fiji,\nPapua New Guinea, and Samoa are leading the way with large-scale hydropower\nprojects, there is enormous potential to expand the deployment of other\nrenewable energy options such as solar, wind, geothermal and ocean-based\nenergy sources'. The European Union funded the Renewable Energy in Pacific\nIsland Countries Developing Skills and Capacity programme (EPIC) over 2013 to\n2017. The programme developed a master's programme in renewable energy\nmanagement, accredited in 2016, at the University of Papua New Guinea and\nhelped to establish a Centre of Renewable Energy at the same university.\n\nPapua New Guinea is one of the 15 beneficiaries of a programme on Adapting to\nClimate Change and Sustainable Energy worth €37.26 million. The programme\nresulted from the signing of an agreement in February 2014 between the\nEuropean Union and the Pacific Islands Forum Secretariat. The other\nbeneficiaries are the Cook Islands, Fiji, Kiribati, Marshall Islands,\nFederated States of Micronesia, Nauru, Niue, Palau, Samoa, Solomon Islands,\nTimor-Leste, Tonga, Tuvalu and Vanuatu.",
    "openai_summarised_points": [
      "• Papua New Guinea adopted its National Vision 2050 in 2009, which led to the establishment of the Research, Science and Technology Council aimed at promoting sustainable development through science and technology.",
      "• At the Council's meeting in November 2014, there was a renewed emphasis on focusing efforts on sustainable development via science and technology initiatives.",
      "• The medium-term priorities outlined in Vision 2050 include: emerging industrial technology for downstream processing; infrastructure technology development for economic corridors; advancement of knowledge-based technology; enhancement of science and engineering education; and achieving a target of investing 5% of GDP in research and development by the year 2050.",
      "• In 2016, Papua New Guinea invested only 0.03% of its GDP in research and development, indicating a significant gap from the Vision 2050 target.",
      "• Women comprised 33.2% of researchers in Papua New Guinea in 2016, reflecting gender representation in the scientific workforce.",
      "• According to Thomson Reuters' Web of Science, Papua New Guinea led Pacific Island states in scientific publications in 2014 with 110 publications, followed by Fiji with 106 publications.",
      "• Approximately 90% of Papua New Guinea’s scientific publications in 2014 focused on immunology, genetics, biotechnology, and microbiology.",
      "• Around 90% of these publications were co-authored with international scientists, primarily from Australia, the United States of America, the United Kingdom, Spain, and Switzerland.",
      "• In 2019, Papua New Guinea produced 253 scientific publications indexed in the Scopus (Elsevier) database, with health sciences accounting for 49% of these publications.",
      "• From 2017 to 2019, Papua New Guinea’s top scientific collaborators were Australia, the United States of America, the United Kingdom, France, and India.",
      "• Renewable energy sources accounted for two-thirds of Papua New Guinea’s total electricity supply, highlighting the country’s reliance on sustainable energy.",
      "• In 2015, the Secretariat of the Pacific Community noted that Fiji, Papua New Guinea, and Samoa were leading the Pacific region with large-scale hydropower projects, while also recognizing significant potential for expanding solar, wind, geothermal, and ocean-based renewable energy options.",
      "• The European Union funded the Renewable Energy in Pacific Island Countries Developing Skills and Capacity programme (EPIC) from 2013 to 2017, which developed a master's programme in renewable energy management accredited in 2016 at the University of Papua New Guinea.",
      "• The EPIC programme also supported the establishment of a Centre of Renewable Energy at the University of Papua New Guinea.",
      "• Papua New Guinea is one of 15 beneficiaries of the €37.26 million Adapting to Climate Change and Sustainable Energy programme, resulting from an agreement signed in February 2014 between the European Union and the Pacific Islands Forum Secretariat.",
      "• The other 14 beneficiaries of this programme include the Cook Islands, Fiji, Kiribati, Marshall Islands, Federated States of Micronesia, Nauru, Niue, Palau, Samoa, Solomon Islands, Timor-Leste, Tonga, Tuvalu, and Vanuatu."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:28.891059",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2759,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "13",
    "section_name": "Economic conditions",
    "text": "By mid-1999, Papua New Guinea's economy was in crisis. Although its\nagricultural sector had recovered from the 1997 drought and timber prices were\nrising as most Asian economies recovered from their 1998 slump, Papua New\nGuinea's foreign currency earnings suffered from low world mineral and\npetroleum prices. Estimates of minerals in exploration expenditure in 1999\nwere one-third of what was spent in 1997. The resulting lower foreign exchange\nearnings, capital flight, and general government mismanagement resulted in a\nprecipitous drop in the value of Papua New Guinea's currency, the kina,\nleading to a dangerous decrease in foreign currency reserves. The kina has\nfloated since 1994. Economic activity decreased in most sectors; imports of\nall kinds shrunk; and inflation, which had been over 21% in 1998, slowed to an\nestimated annual rate of 8% in 1999.\n\nCiting the previous government's failure to successfully negotiate acceptable\ncommercial loans or bond sales to cover its budget deficit, the government\nformed by Sir Mekere Morauta in July 1999 successfully requested emergency\nassistance from the International Monetary Fund and the World Bank. With\nassistance from the Fund and the Bank, the government has made considerable\nprogress toward macroeconomic stabilization and economic reform.\n\nAs of 2019, although statistics show that an economic recovery is underway,\nPapua New Guinea's economy is still struggling.\n\nThe rugged terrain (including high mountain ranges and valleys, swamps and\nislands) and the high cost of developing infrastructure, combined with other\nfactors (including law and order problems in some centres and the system of\ncustomary land title) make it difficult for outside developers. Local\ndevelopers are hindered by years of deficient investment in education, health,\nand access to finance.\n\nThe country's terrain has made it difficult for the country to develop\ntransportation infrastructure, resulting in air travel being the most\nefficient and reliable means of transportation. There are five highways,\nalthough only two go into the interior. Domestic shipping is limited. Overall\nhousing quality is low, with 15% of houses having a finished floor in the late\n2010s. In urban areas, 55% of houses were connected to electricity in 2016.\nRural areas saw only 10% connection, although this is a significant increase\nfrom 3% in 1996. Over half of urban houses had access to piped water, while\nonly 15% of rural houses did, although rural houses had more access to wells.\nThe average number of people per room was 2.5.\n\nThe Sirinumu Dam and Yonki Dam provide some hydropower. There is limited\nsewage treatment, even in the capital. Some is discharged directly into the\nocean, leading to issues with pollution.\n\nFormer Prime Minister Sir Mekere Morauta tried to restore integrity to state\ninstitutions, stabilise the kina, restore stability to the national budget,\nprivatise public enterprises where appropriate, and ensure ongoing peace on\nBougainville following the 1997 agreement which ended Bougainville's\nsecessionist unrest. The Morauta government had considerable success in\nattracting international support, specifically gaining the backing of the\nInternational Monetary Fund (IMF) and the World Bank in securing development\nassistance loans.\n\nThe PNG government's long-term Vision 2050 and shorter-term policy documents,\nincluding the 2013 Budget and the 2014 Responsible Sustainable Development\nStrategy, emphasise the need for a more diverse economy, based upon\nsustainable industries and avoiding the effects of Dutch disease from major\nresource extraction projects undermining other industries. This occurred in\nmany countries experiencing oil or other mineral booms, notably in Western\nAfrica, undermining much of their agriculture sector, manufacturing and\ntourism, and with them broad-based employment prospects. Measures have been\ntaken to mitigate these effects, including through the establishment of a\nsovereign wealth fund, partly to stabilise revenue and expenditure flows, but\nmuch will depend upon the readiness to make real reforms to effective use of\nrevenue, tackling rampant corruption and empowering households and businesses\nto access markets, services and develop a more buoyant economy, with lower\ncosts, especially for small to medium-sized enterprises.[_citation needed_]\nEconomic 'development' based on the extractive industries also carries\ndifficult consequences for local communities. One major project conducted\nthrough the PNG Department for Community Development suggested that other\npathways to sustainable development should be considered.\n\nThe Institute of National Affairs, a PNG independent policy think tank,\nprovides a report on the business and investment environment of Papua New\nGuinea every five years, based upon a survey of large and small, local and\noverseas companies, highlighting law and order problems and corruption, as the\nworst impediments, followed by the poor state of transport, power and\ncommunications infrastructure.[_non-primary source needed_]",
    "openai_summarised_points": [
      "• By mid-1999, Papua New Guinea's economy was in crisis despite recovery in the agricultural sector from the 1997 drought and rising timber prices due to Asian economies recovering from the 1998 slump.",
      "• Papua New Guinea's foreign currency earnings declined significantly in 1999 because of low world mineral and petroleum prices, with minerals exploration expenditure estimated at one-third of the 1997 level.",
      "• The decline in foreign exchange earnings, capital flight, and government mismanagement caused a sharp depreciation of Papua New Guinea's currency, the kina, leading to a dangerous reduction in foreign currency reserves; the kina had been floating since 1994.",
      "• Economic activity contracted across most sectors in 1999, imports decreased, and inflation dropped from over 21% in 1998 to an estimated 8% annually in 1999.",
      "• The government formed by Sir Mekere Morauta in July 1999 cited the previous administration’s failure to secure acceptable commercial loans or bond sales to cover the budget deficit and successfully requested emergency assistance from the International Monetary Fund (IMF) and the World Bank.",
      "• With IMF and World Bank support, the Morauta government made significant progress toward macroeconomic stabilization and economic reform.",
      "• As of 2019, despite statistical indications of economic recovery, Papua New Guinea’s economy continued to face substantial challenges.",
      "• Papua New Guinea’s rugged terrain, including high mountain ranges, valleys, swamps, and islands, combined with high infrastructure development costs, law and order issues in some areas, and the customary land title system, create obstacles for external developers.",
      "• Local developers are further hindered by long-term underinvestment in education, health, and access to finance.",
      "• The country’s difficult terrain has impeded transportation infrastructure development, making air travel the most efficient and reliable mode of transport; there are five highways, but only two extend into the interior, and domestic shipping is limited.",
      "• Housing quality is generally low: in the late 2010s, only 15% of houses had finished floors; in urban areas, 55% of houses were connected to electricity in 2016, while rural areas had only 10% electricity connection, an increase from 3% in 1996.",
      "• Over half of urban houses had access to piped water, compared to only 15% in rural areas, though rural households had greater access to wells; the average occupancy was 2.5 persons per room.",
      "• Hydropower is generated by the Sirinumu Dam and Yonki Dam, but sewage treatment is limited, even in the capital, with some sewage discharged directly into the ocean, causing pollution problems.",
      "• Former Prime Minister Sir Mekere Morauta sought to restore integrity to state institutions, stabilize the kina, achieve national budget stability, privatize public enterprises where appropriate, and maintain peace on Bougainville following the 1997 agreement ending Bougainville’s secessionist unrest.",
      "• The Morauta government successfully attracted international support, notably from the IMF and World Bank, securing development assistance loans.",
      "• Papua New Guinea’s long-term Vision 2050 and shorter-term policy documents, including the 2013 Budget and the 2014 Responsible Sustainable Development Strategy, emphasize economic diversification based on sustainable industries to avoid Dutch disease effects from major resource extraction projects.",
      "• The Dutch disease phenomenon, observed in countries with oil or mineral booms (notably in Western Africa), undermines agriculture, manufacturing, tourism, and broad-based employment, which Papua New Guinea aims to mitigate.",
      "• Measures to counteract Dutch disease include establishing a sovereign wealth fund to stabilize revenue and expenditure flows, though success depends on implementing reforms to improve revenue use, combat corruption, and empower households and businesses to access markets and services.",
      "• Economic development focused on extractive industries poses difficult consequences for local communities; a major project by the PNG Department for Community Development recommended exploring alternative pathways to sustainable development.",
      "• The Institute of National Affairs, an independent Papua New Guinea policy think tank, produces a quinquennial report on the business and investment environment based on surveys of large and small, local and foreign companies, identifying law and order problems and corruption as the most significant impediments, followed by poor transport, power, and communications infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:35.372946",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5050,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "13.1",
    "section_name": "Main indicators",
    "text": "Main economic indicators 1980–2016 [_needs update_] Year  | GDP  | GDP\ngrowth\n(real) | Inflation  | Government\ndebt\n(% of GDP)\n---|---|---|---|---\nTotal\n(bil. US$ PPP) | Per capita\n(US$ PPP) | Total\n(bil. US$ nominal)\n1980  | 10.1  | 1,067  | 4.1  | −2.3%  | 12.1%  | ...\n1985  | 11.9  | 1,323  | 3.3  | 3.6%  | 3.7%  | ...\n1990  | 15.4  | 1,462  | 4.8  | −3.0%  | 7.0%  | ...\n1995  | 23.4  | 2,067  | 7.1  | −3.4%  | 17.3%  | 36%\n2000  | 29.6  | 2,056  | 5.2  | −2.5%  | 15.6%  | 42%\n2005  | 13.2  | 2,280  | 7.3  | 3.9%  | 1.8%  | 32%\n2006  | 13.9  | 2,348  | 8.4  | 2.3%  | 2.4%  | 26%\n2007  | 15.9  | 2,348  | 9.5  | 11.1%  | 0.9%  | 23%\n2008  | 16.1  | 2,617  | 11.7  | −0.3%  | 10.8%  | 22%\n2009  | 17.3  | 2,600  | 11.6  | 6.8%  | 6.9%  | 22%\n2010  | 19.3  | 2,891  | 14.3  | 10.1%  | 5.1%  | 17%\n2011  | 20.0  | 2,830  | 18.0  | 1.1%  | 4.4%  | 16%\n2012  | 21.3  | 2,861  | 21.3  | 4.6%  | 4.5%  | 19%\n2013  | 22.4  | 2,954  | 21.3  | 3.8%  | 5.0%  | 25%\n2014  | 25.7  | 3,313  | 23.2  | 12.5%  | 5.2%  | 27%\n2015  | 28.0  | 3,540  | 21.7  | 9.0%  | 6.0%  | 29%\n2016  | 29.1  | 3,597  | 20.8  | 2.4%  | 6.7%  | 32%",
    "openai_summarised_points": [
      "• In 1980, Papua New Guinea's GDP at purchasing power parity (PPP) was 10.1 billion US dollars, with a per capita GDP of 1,067 US dollars; the nominal GDP was 4.1 billion US dollars, real GDP growth was −2.3%, inflation stood at 12.1%, and government debt data was not available.",
      "• By 1985, GDP (PPP) increased to 11.9 billion US dollars, per capita GDP rose to 1,323 US dollars, nominal GDP was 3.3 billion US dollars, real GDP growth was positive at 3.6%, inflation decreased to 3.7%, and government debt data remained unavailable.",
      "• In 1990, Papua New Guinea's GDP (PPP) reached 15.4 billion US dollars, with a per capita GDP of 1,462 US dollars; nominal GDP was 4.8 billion US dollars, real GDP growth was negative at −3.0%, inflation was 7.0%, and government debt data was not provided.",
      "• The year 1995 saw a significant rise in GDP (PPP) to 23.4 billion US dollars and per capita GDP to 2,067 US dollars; nominal GDP increased to 7.1 billion US dollars, real GDP growth was −3.4%, inflation rose to 17.3%, and government debt was recorded at 36% of GDP.",
      "• In 2000, GDP (PPP) further increased to 29.6 billion US dollars, while per capita GDP slightly decreased to 2,056 US dollars; nominal GDP was 5.2 billion US dollars, real GDP growth was −2.5%, inflation was 15.6%, and government debt rose to 42% of GDP.",
      "• The year 2005 marked a drop in GDP (PPP) to 13.2 billion US dollars, with per capita GDP increasing to 2,280 US dollars; nominal GDP was 7.3 billion US dollars, real GDP growth turned positive at 3.9%, inflation decreased sharply to 1.8%, and government debt declined to 32% of GDP.",
      "• In 2006, GDP (PPP) rose slightly to 13.9 billion US dollars, per capita GDP increased to 2,348 US dollars; nominal GDP was 8.4 billion US dollars, real GDP growth slowed to 2.3%, inflation was 2.4%, and government debt further decreased to 26% of GDP.",
      "• By 2007, GDP (PPP) increased to 15.9 billion US dollars with per capita GDP steady at 2,348 US dollars; nominal GDP rose to 9.5 billion US dollars, real GDP growth surged to 11.1%, inflation dropped to 0.9%, and government debt was 23% of GDP.",
      "• In 2008, GDP (PPP) slightly increased to 16.1 billion US dollars, per capita GDP grew to 2,617 US dollars; nominal GDP reached 11.7 billion US dollars, real GDP growth was marginally negative at −0.3%, inflation rose to 10.8%, and government debt was 22% of GDP.",
      "• The year 2009 recorded GDP (PPP) of 17.3 billion US dollars, per capita GDP at 2,600 US dollars; nominal GDP was 11.6 billion US dollars, real GDP growth rebounded to 6.8%, inflation decreased to 6.9%, and government debt remained at 22% of GDP.",
      "• In 2010, GDP (PPP) grew to 19.3 billion US dollars, per capita GDP increased to 2,891 US dollars; nominal GDP was 14.3 billion US dollars, real GDP growth was strong at 10.1%, inflation rose to 5.1%, and government debt declined to 17% of GDP.",
      "• For 2011, GDP (PPP) reached 20.0 billion US dollars, per capita GDP slightly decreased to 2,830 US dollars; nominal GDP rose to 18.0 billion US dollars, real GDP growth slowed to 1.1%, inflation was 4.4%, and government debt further decreased to 16% of GDP.",
      "• In 2012, GDP (PPP) increased to 21.3 billion US dollars, per capita GDP was 2,861 US dollars; nominal GDP grew to 21.3 billion US dollars, real GDP growth improved to 4.6%, inflation slightly increased to 4.5%, and government debt rose to 19% of GDP.",
      "• The year 2013 saw GDP (PPP) rise to 22.4 billion US dollars, per capita GDP increased to 2,954 US dollars; nominal GDP remained at 21.3 billion US dollars, real GDP growth was 3.8%, inflation increased to 5.0%, and government debt increased to 25% of GDP.",
      "• In 2014, GDP (PPP) significantly increased to 25.7 billion US dollars, per capita GDP rose to 3,313 US dollars; nominal GDP grew to 23.2 billion US dollars, real GDP growth surged to 12.5%, inflation increased to 5.2%, and government debt rose to 27% of GDP.",
      "• For 2015, GDP (PPP) further increased to 28.0 billion US dollars, per capita GDP reached 3,540 US dollars; nominal GDP decreased slightly to 21.7 billion US dollars, real GDP growth slowed to 9.0%, inflation rose to 6.0%, and government debt increased to 29% of GDP.",
      "• In 2016, Papua New Guinea's GDP (PPP) was 29.1 billion US dollars, with a per capita GDP of 3,597 US dollars; nominal GDP was 20.8 billion US dollars, real GDP growth slowed to 2.4%, inflation increased to 6.7%, and government debt rose to 32% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:46.432811",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1122,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Papua New Guinea",
    "chapter_id": "1",
    "section_number": "14",
    "section_name": "Statistics",
    "text": "**Household income or consumption by percentage share:**\n_lowest 10%:_ 4.3%\n_highest 10%:_ 36% (2008)\n\n**Labour force:** 2.078 million\n\n**Electricity – production:** 2,200 GWh (2008)\n\n**Electricity – production by source:**\n_fossil fuel:_ 67.78%\n_hydro:_ 32.22%\n_nuclear:_ 0%\n_other:_ 0% (2008)\n\n**Electricity – consumption:** 2,000 GWh (2008)\n\n**Electricity exports:** 10 kWh (2008)\n\n**Electricity – imports:** 0 kWh (2008)\n\n**Agriculture – products:** coffee, cocoa, coconuts, palm kernels, tea,\nrubber, sweet potatoes, fruit, vegetables; poultry, pork, vanilla\n\n**Currency:** 1 kina (K) = 100 toea\n\n**Exchange rates:** kina (K) per US$1 – 3.14 (April 2016), 2.7624 (November\n1999), 2.520 (1999), 2.058 (1998), 1.434 (1997), 1.318 (1996), 1.276 (1995)",
    "openai_summarised_points": [
      "• In 2008, the lowest 10% of households in Papua New Guinea accounted for 4.3% of total income or consumption, while the highest 10% accounted for 36%.",
      "• The labour force of Papua New Guinea is approximately 2.078 million individuals.",
      "• Electricity production in Papua New Guinea in 2008 was 2,200 gigawatt-hours (GWh).",
      "• The sources of electricity production in 2008 were predominantly fossil fuels at 67.78%, followed by hydroelectric power at 32.22%, with no contribution from nuclear or other sources.",
      "• Electricity consumption in Papua New Guinea in 2008 was recorded at 2,000 GWh.",
      "• Electricity exports in 2008 were minimal, totaling 10 kilowatt-hours (kWh).",
      "• Papua New Guinea did not import any electricity in 2008, with imports recorded at 0 kWh.",
      "• The primary agricultural products of Papua New Guinea include coffee, cocoa, coconuts, palm kernels, tea, rubber, sweet potatoes, various fruits and vegetables, poultry, pork, and vanilla.",
      "• The national currency of Papua New Guinea is the kina (K), subdivided into 100 toea.",
      "• Historical exchange rates of the kina against the US dollar show a depreciation over time: 3.14 K per US$1 in April 2016; 2.7624 K in November 1999; 2.520 K in 1999; 2.058 K in 1998; 1.434 K in 1997; 1.318 K in 1996; and 1.276 K in 1995."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:46:27.006150",
      "openai_model": "gpt-4.1-mini",
      "content_length": 753,
      "bullet_points_count": 10
    }
  }
]