[
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Part of a series on  \n---  \nJordan  \nGeography  \n  \n  * Climate\n  * Governorates\n  * Nahias\n  * Cities\n  * Mediterranean\n  * Jordan River\n  * Nature reserves\n  * Extreme points\n\n  \nHistory  \n|\n\n  * Timeline\n  * Syria (region)\n\n  \n---  \nPre-modern history  \n  \n  * Ammon\n  * Moab\n  * Edom\n  * Nabataeans\n  * Ghassanids\n  * Islamic Empire\n  * Oultrejordain\n  * Arab Kingdom of Syria\n  * Ottoman Empire\n\n  \nHashemite rule  \n  \n  * Hashemites\n  * Arab Revolt\n  * Sykes–Picot\n  * Transjordan memo\n  * British Mandate\n  * Emirate of Transjordan\n  * Kura Rebellion\n  * Adwan Rebellion\n  * Ikhwan raids\n  * 1948 War\n  * 1967 War\n  * Black September\n  * Israel–Jordan peace treaty\n  * 2011 protests\n\n  \nEconomy  \n  \n  * International rankings\n  * Globalization\n  * Agriculture\n  * Defense industry\n  * Tourism\n  * Petra World Heritage Site\n  * Oil shale\n  * Renewable energy\n  * Nuclear energy\n  * Water supply\n\n  \nDemographics / Culture  \n  \n  * Religion\n  * Freedom of religion\n  * Islam\n  * Christianity\n  * Jordanian Arabic\n  * Art\n  * Cinema\n  * Cuisine\n  * Music\n  * Sports\n  * Scouts and Guides\n  * Holidays\n  * Prominent Jordanians\n\n  \nHealth / Education  \n  \n  * Hospitals\n  * Medical education\n  * Universities\n  * University of Jordan\n  * Education and Research Ministry\n  * Science and technology in Jordan\n\n  \nGovernment / Politics  \n  \n  * Constitution\n  * Kings\n  * Prime Ministers\n  * Cabinet\n  * Parliament\n  * Elections\n  * Political parties\n  * Law enforcement\n  * Central Bank\n  * Foreign affairs\n  * Human rights\n\n  \nArmed Forces  \n  \n  * Army\n  * Air\n  * Naval\n  * Special forces (JSOC)\n  * Maintenance Corps\n  * Intelligence\n  * Jordan Royal Guard\n  * Design and Development Bureau\n  * Military ranks\n  * Arab Legion\n\n  \nTransportation  \n  \n  * Airports\n  * Queen Alia Airport\n  * Royal Jordanian Airlines\n  * Railways\n  * Aqaba seaport\n\n  \nCommunications  \n  \n  * Newspapers\n  * Internet\n  * Jordan Radio & TV Corporation (JRTV)\n  * ATV Jordan\n\n  \n  \n  * Jordan portal\n  * Index\n  * Outline\n\n  \n  \n  * v\n  * t\n  * e\n\n  \n  \nThe **economy of Jordan** is classified by the World Food Programme as an\nupper-middle income economy, as well as being poor in resources with limited\nland for agriculture. Jordan's GDP per capita rose by 351% in the 1970s,\ndeclined 30% in the 1980s, and rose 36% in the 1990s. After King Abdullah II's\naccession to the throne in 1999, liberal economic policies were introduced.\nJordan's economy had been growing at an annual rate of 8% between 1999 and\n2008. However, growth slowed to 2% after the Arab Spring in 2011. The\nsubstantial increase of the population, coupled with slowed economic growth\nand rising public debt, led to a worsening of poverty and unemployment in the\ncountry. As of 2023, Jordan has a GDP of US$50.85 billion, ranking it 89th\nworldwide.\n\nJordan has free trade agreements with the United States, Canada, Singapore,\nMalaysia, the European Union, Tunisia, Algeria, Libya, Turkey and Syria. More\nfree trade agreements were planned with Iraq, the Palestinian Authority, the\nGCC, Lebanon, and Pakistan. Jordan is a member of the Greater Arab Free Trade\nAgreement, the Euro-Mediterranean free trade area, the Agadir Agreement, and\nalso enjoys advanced status with the EU.\n\nJordan's economic resource base centers on phosphates, potash, and their\nfertilizer derivatives; tourism; overseas remittances; and foreign aid. These\nare its principal sources of hard currency earnings. Lacking coal reserves,\nhydroelectric power, large tracts of forest or commercially viable oil\ndeposits, Jordan relies on natural gas for 93% of its domestic energy needs.\nJordan used to depend on Iraq for oil until the American-led 2003 invasion of\nIraq. Jordan also has a plethora of industrial zones producing goods in the\ntextile, aerospace, defense, ICT, pharmaceutical, and cosmetic sectors. Jordan\nis an emerging knowledge economy.\n\nThe main obstacles to Jordan's economy are scarce water supplies, complete\nreliance on oil imports for energy, and regional instability. Just over 10% of\nits land is arable and the water supply is limited. Rainfall is low and highly\nvariable, and much of Jordan's available ground water is not renewable.\n\nJordan's total foreign debt in 2011 was $19 billion, representing 60% of its\nGDP. In 2016, the debt reached $35.1 billion representing 93.4% of its GDP.\nThis was attributed to regional instability, causing a decrease in tourist\nactivity and foreign investments along with increased military expenditure.\nOther factors were attacks on the Egyptian pipeline supplying the Kingdom with\ngas, the collapse of trade with Iraq and Syria; expenses from hosting Syrian\nrefugees and accumulated interest from loans. According to the World Bank,\nSyrian refugees cost Jordan more than $2.5 billion a year, amounting to 6% of\nthe GDP and 25% of the government's annual revenue. Wage growth declined due\nto competition for jobs between refugees and Jordan citizens. The downturn\nthat began in 2011 continued until 2018. The country's top five contributing\nsectors to GDP, government services, finance, manufacturing, transport, and\ntourism and hospitality were badly impacted by the Syrian civil war. Foreign\naid covered only a small part of these costs, 63% of the total costs are\ncovered by Jordan. An austerity programme was adopted by the government to\nreduce Jordan's debt-to-GDP ratio to 77% by 2021. The programme succeeded in\npreventing the debt from rising above 95% in 2018. The yearly growth rate of\nthe economy was 2% from 2016 to 2019, compared to 6.4% from 2000 to 2009.\n\nOn 15 May, 2025 Jordan and the UAE activatet their Comprehensive Economic\nPartnership Agreement (CEPA), marking a significant step in strengthening\nbilateral economic ties. Signed in 2023 under the leadership of King Abdullah\nII and President Sheikh Mohamed bin Zayed, the agreement aims to boost trade,\nreduce tariffs, and enhance investment across key sectors such as industry,\nrenewable energy, and tourism. It establishes frameworks for cooperation,\nincluding a joint investment council, and targets increasing non-oil trade to\nover $8 billion by 2032. As the UAE’s first CEPA with an Arab country, the\ndeal underscores a shared commitment to regional integration, SME empowerment,\nand long-term economic partnership.",
    "openai_summarised_points": [
      "• The economy of Jordan is classified by the World Food Programme as an upper-middle income economy.",
      "• Jordan is resource-poor, with limited land available for agriculture.",
      "• The country's GDP per capita increased by 351% during the 1970s.",
      "• In the 1980s, Jordan's GDP per capita declined by 30%.",
      "• During the 1990s, GDP per capita rose by 36%.",
      "• After King Abdullah II's accession to the throne in 1999, Jordan implemented liberal economic policies.",
      "• Between 1999 and 2008, Jordan's economy grew at an annual rate of 8%.",
      "• Post-2011 Arab Spring, economic growth slowed to 2% annually.",
      "• The population increase, slowed economic growth, and rising public debt worsened poverty and unemployment.",
      "• As of 2023, Jordan's GDP is US$50.85 billion, ranking 89th worldwide.",
      "• Jordan has free trade agreements with the United States, Canada, Singapore, Malaysia, the European Union, Tunisia, Algeria, Libya, Turkey, and Syria.",
      "• Planned free trade agreements include those with Iraq, the Palestinian Authority, the Gulf Cooperation Council (GCC), Lebanon, and Pakistan.",
      "• Jordan is a member of the Greater Arab Free Trade Area, the Euro-Mediterranean free trade area, the Agadir Agreement, and has advanced status with the EU.",
      "• The main economic resources are phosphates, potash, fertilizer derivatives, tourism, overseas remittances, and foreign aid.",
      "• These resources are the primary sources of Jordan's hard currency earnings.",
      "• Jordan lacks coal reserves, hydroelectric power, large forests, and commercially viable oil deposits.",
      "• The country relies on natural gas for 93% of its domestic energy needs.",
      "• Jordan previously depended on Iraq for oil until the 2003 invasion of Iraq by the US-led coalition.",
      "• Jordan has industrial zones producing textiles, aerospace, defense, ICT, pharmaceuticals, and cosmetics.",
      "• Jordan is an emerging knowledge economy.",
      "• The main obstacles to economic development include scarce water supplies, reliance on oil imports for energy, and regional instability.",
      "• Less than 10% of Jordan's land is arable, with limited and non-renewable groundwater sources.",
      "• Rainfall in Jordan is low and highly variable.",
      "• In 2011, Jordan's total foreign debt was $19 billion, representing 60% of GDP.",
      "• By 2016, the debt increased to $35.1 billion, or 93.4% of GDP.",
      "• The debt increase was due to regional instability, decreased tourism and foreign investment, increased military expenditure, attacks on the Egyptian gas pipeline, collapse of trade with Iraq and Syria, expenses from hosting Syrian refugees, and accumulated loan interest.",
      "• Syrian refugees cost Jordan over $2.5 billion annually, which is 6% of GDP and 25% of the government's annual revenue.",
      "• Refugee-related economic pressures led to declining wage growth due to job competition.",
      "• The economic downturn from 2011 persisted until 2018.",
      "• The top five sectors contributing to GDP—government services, finance, manufacturing, transport, and tourism/hospitality—were severely impacted by the Syrian civil war.",
      "• Foreign aid covered only a small part of the costs; approximately 63% of total costs were borne by Jordan.",
      "• The government adopted an austerity program to reduce the debt-to-GDP ratio to 77% by 2021, successfully preventing it from exceeding 95% in 2018.",
      "• The annual economic growth rate was 2% from 2016 to 2019, compared to 6.4% during 2000–2009.",
      "• On 15 May 2025, Jordan and the UAE activated their Comprehensive Economic Partnership Agreement (CEPA).",
      "• The CEPA, signed in 2023 under King Abdullah II and President Sheikh Mohamed bin Zayed, aims to strengthen bilateral trade, reduce tariffs, and promote investment in sectors like industry, renewable energy, and tourism.",
      "• The agreement establishes cooperation frameworks, including a joint investment council.",
      "• It targets increasing non-oil trade to over $8 billion by 2032.",
      "• The Jordan-UAE CEPA is the UAE’s first such agreement with an Arab country, emphasizing regional integration, SME empowerment, and long-term economic partnership."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:24.180916",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6273,
      "bullet_points_count": 38
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Currency",
    "text": "The Central Bank of Jordan commenced operations in 1964 and is the sole issuer\nof Jordanian currency, the Jordanian dinar, which is pegged to the US dollar.\nThe following chart of the trend of gross domestic product of Jordan at market\nprices by the International Monetary Fund with figures in millions of\nJordanian dinars.\n\nYear | Gross domestic product\n(JD million) | $US exchange | Inflation index\n(2000=100)\n---|---|---|---\n1980 | 1,165 | 0.29 Jordanian dinars | 35\n1985 | 1,971 | 0.39 Jordanian dinars | 45\n1990 | 2,761 | 0.66 Jordanian dinars | 70\n1995 | 4,715 | 0.70 Jordanian dinars | 87\n2005 | 9,118 | 0.70 Jordanian dinars | 112\n\nFor purchasing power parity comparisons, the Jordanian dinar is exchanged per\nUS dollar at 0.710.\n\nJordan's population is 6,342,948 and mean wages were $4.19 per man-hour in\n2009.",
    "openai_summarised_points": [
      "• The Central Bank of Jordan began operations in 1964 and holds the exclusive authority to issue Jordanian currency.",
      "• The official currency of Jordan is the Jordanian dinar, which is pegged to the US dollar.",
      "• The trend of Jordan's gross domestic product (GDP) at market prices, as reported by the International Monetary Fund, is provided in millions of Jordanian dinars across several years:",
      "• For purchasing power parity (PPP) comparisons, the Jordanian dinar is exchanged at a rate of 0.710 per US dollar.",
      "• Jordan's population is approximately 6,342,948 inhabitants.",
      "• In 2009, the average wage was $4.19 per man-hour."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:28.992116",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 819,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic overview",
    "text": "Jordan is classified by the UN as an \"Upper-middle-income country.\" According\nto the Heritage Foundation's Index of Economic Freedom, Jordan has the fourth\nfreest economy in the Middle East and North Africa, behind only Israel,\nBahrain and Qatar, and the 32nd freest in the world. Jordan ranked as having\nthe 35th best infrastructure in the world, according to the World Economic\nForum's Index of Economic Competitiveness. The Kingdom scored higher than many\nof its peers in the Persian Gulf and Europe like Kuwait, Israel and Ireland.\nThe 2010 AOF Index of Globalization ranked Jordan as the most globalized\ncountry in the Middle East and North Africa region. Jordan's banking sector is\nclassified as \"highly developed\" by the IMF along with the GCC economies and\nLebanon.\n\nThe official currency in Jordan is the Jordanian dinar and divides into 100\nqirsh (also called piastres) or 1000 fils. Since 23 October 1995, the dinar\nhas been officially pegged to the IMF's special drawing rights (SDRs). In\npractice, it is fixed at 1 US$ = 0.709 dinar, which translates to\napproximately 1 dinar = 1.41044 dollars. The Central Bank buys US dollars at\n0.708 dinar, and sell US dollars at 0.7125 dinar, Exchangers buys US dollars\nat 0.708 and sell US dollars at 0.709.\n\nIn 2011, the Jordanian market was considered one of the most developed Arab\nmarkets outside the Persian Gulf. Jordan ranked 18th on the 2012 Global Retail\nDevelopment Index which lists the 30 most attractive retail markets in the\nworld. Jordan was ranked as the 19th most expensive country in the world to\nlive in 2010 and the most expensive Arab country to live in.\n\nJordan has been a member of the World Trade Organization since 2000. In the\n2009 Global Enabling Trade Report, Jordan ranked 4th in the Arab World behind\nthe UAE, Bahrain, and Qatar. The free trade agreement with the United States\nthat went into effect in December 2001 phased out duties on nearly all goods\nand services by 2010.",
    "openai_summarised_points": [
      "• Jordan is classified by the United Nations as an \"Upper-middle-income country,\" indicating a moderate level of income per capita and economic development.",
      "• According to the Heritage Foundation's Index of Economic Freedom, Jordan has the fourth freest economy in the Middle East and North Africa region, surpassed only by Israel, Bahrain, and Qatar, and ranks as the 32nd freest economy globally.",
      "• The World Economic Forum's Index of Economic Competitiveness ranks Jordan as having the 35th best infrastructure worldwide, outperforming many peers in the Persian Gulf and Europe, including Kuwait, Israel, and Ireland.",
      "• In 2010, the AOF Index of Globalization ranked Jordan as the most globalized country in the Middle East and North Africa, reflecting high levels of economic integration and openness.",
      "• Jordan's banking sector is classified as \"highly developed\" by the International Monetary Fund (IMF), comparable to the banking sectors of the Gulf Cooperation Council (GCC) economies and Lebanon.",
      "• The official currency of Jordan is the Jordanian dinar, which is subdivided into 100 qirsh (also called piastres) or 1000 fils.",
      "• Since 23 October 1995, the Jordanian dinar has been officially pegged to the International Monetary Fund's (IMF) special drawing rights (SDRs).",
      "• The fixed exchange rate is approximately 1 US dollar = 0.709 dinar, which equates to about 1 dinar = 1.41044 US dollars.",
      "• The Central Bank of Jordan buys US dollars at 0.708 dinar and sells US dollars at 0.7125 dinar; currency exchangers buy US dollars at 0.708 dinar and sell at 0.709 dinar.",
      "• In 2011, Jordan's market was considered one of the most developed Arab markets outside the Persian Gulf.",
      "• Jordan ranked 18th on the 2012 Global Retail Development Index, which lists the 30 most attractive retail markets worldwide.",
      "• In 2010, Jordan was ranked as the 19th most expensive country in the world to live in and was the most expensive Arab country in terms of cost of living.",
      "• Jordan has been a member of the World Trade Organization (WTO) since 2000, facilitating international trade and economic integration.",
      "• In the 2009 Global Enabling Trade Report, Jordan ranked 4th in the Arab World, behind the UAE, Bahrain, and Qatar, indicating a favorable environment for trade facilitation.",
      "• The free trade agreement between Jordan and the United States, which commenced in December 2001, phased out duties on nearly all goods and services by 2010, enhancing trade relations and market access."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:35.341852",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1958,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Unemployment",
    "text": "Jordan has high unemployment rates, 11.9% in the fourth quarter of 2010 but\nsome estimate it to be as high as a quarter of the working-age population.\nUnemployment reached 25% in 2021, the highest level in more than 25 years, 6%\npoints more than in 2019, and more than double the amount in 2011.\nUnemployment is a major issue, particularly for young people, women, and those\nwith a university degree, with rates of unemployment exceeding 45%, 30%, and\n30%, respectively.",
    "openai_summarised_points": [
      "• Jordan experienced high unemployment rates, with an official rate of 11.9% in the fourth quarter of 2010.",
      "• Some estimates suggest that unemployment could be as high as 25% of the working-age population.",
      "• In 2021, unemployment reached 25%, marking the highest level in over 25 years.",
      "• The 2021 unemployment rate was 6 percentage points higher than in 2019.",
      "• The 2021 rate was more than double the unemployment rate in 2011.",
      "• Unemployment is identified as a significant economic issue in Jordan, especially affecting specific demographic groups.",
      "• Young people face particularly high unemployment rates, exceeding 45%.",
      "• Women experience unemployment rates over 30%.",
      "• Individuals with a university degree also face unemployment rates exceeding 30%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:37.494084",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 470,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.1.1",
    "section_name": "Youth unemployment",
    "text": "There are 15 million unemployed young men in Arab communities. The youth\nunemployment rate in Jordan has traditionally been much higher than other\ncountries. In the past ten years, the rate has stayed around 23%. There has\nbeen a recent increase in the popular belief that unemployment is the fault of\nthe individual and not a societal problem. However, youth unemployment has\nalso been attributed to increased pressure on service sectors that typically\nemploy more youth in Jordan. Youth unemployment has led to later and later\nages of marriage in Jordan, which some view as one of the most important\nconsequences of the phenomenon. Another consequence experienced in Jordan is\nincreased mental health problems. In 2019, the estimated youth unemployment\nrate in Jordan was at 35%.",
    "openai_summarised_points": [
      "• There are approximately 15 million unemployed young men across Arab communities.",
      "• The youth unemployment rate in Jordan has historically been significantly higher than in other countries.",
      "• Over the past ten years, Jordan’s youth unemployment rate has remained steady at around 23%.",
      "• Recently, there has been a growing public perception that youth unemployment is primarily due to individual shortcomings rather than systemic societal issues.",
      "• Youth unemployment in Jordan has been linked to increased pressure on service sectors, which are typically major employers of young people in the country.",
      "• The phenomenon of youth unemployment has contributed to delayed marriage ages in Jordan, which is considered one of its most significant social consequences.",
      "• An additional notable consequence of youth unemployment in Jordan is a rise in mental health problems among young people.",
      "• In 2019, the youth unemployment rate in Jordan was estimated at 35%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:40.155985",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 781,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Remittances to Jordan",
    "text": "The flows of remittance to Jordan experienced rapid growth, particularly in\nthe late 1970s and 1980s, when Jordan started exporting high skilled labour to\nthe Persian Gulf States. The money that migrants send home, remittances, is an\nimportant source of external funding for many developing countries, including\nJordan. With about US$3000 million in remittances in 2010, Jordan was in 10th\nplace among developing countries according to World Bank data. Jordan has\nranked constantly among the top 20 remittances-recipient countries over the\nlast decade. In addition, the Arab Monetary Fund (AMF) statistics in 2010\nindicate that Jordan was the third biggest recipient of remittances among Arab\ncountries after Egypt and Lebanon. The host countries that have absorbed most\nof the Jordanian expatriates are Saudi Arabia and the United Arab of Emirates\n(UAE), where the available recorded number of the Jordanian expatriates,\nworking abroad, indicates that about 90% of these migrants are working in\nPersian Gulf countries.[_citation needed_] The proportion of skilled workers\nin Jordan is among the highest in the region. Many of the world's major\nsoftware and hardware IT companies are present in Jordan. The presence of such\nfirms underlines Jordan's attractiveness as a stable base with high-calibre\nhuman resources from which to serve the wider region. According to a report\npublished in January 2012 by the founder of venture capital firm Finaventures,\nRachid Sefraoui, Amman is one of the top 10 best cities in the world to launch\na tech start-up.\n\nAn estimated 13.3% of citizens live under the poverty line. Since the\nmid-1970s, migrants' remittances are Jordan's most important source of foreign\nexchange, and a decisive factor in the country's economic development and the\nrising standard of living of the population.\n\nAgriculture in Jordan constituted almost 40% of GNP in the early 1950s; on the\neve of the June 1967 War, it was 17%. By the mid-1980s, agriculture's share of\nGNP in Jordan was only about 6%.\n\nJordan hosts SOFEX, the world's fastest growing and region's only special\noperations and homeland security exhibition and conference. Jordan is a\nregional and international provider of advanced military goods and services.\nThe KADDB Industrial Park, specialized in defense manufacturing, was opened in\nSeptember 2009 in Mafraq. By 2015, the park is expected to provide around\n15,000 job opportunities whereas the investment volume is expected to reach\nJD500 million. A report by Strategic Foresight Group has calculated the\nopportunity cost of conflict for the Middle East from 1991 to 2010 at $12\ntrillion. Jordan's share in this is almost $84 billion.\n\nJordan has a 138% mobile phone penetration rate and a 63% internet penetration\nrate. 41.6% of all mobile phones in Jordan are smartphones, compared with 40%\nin the United States and 26% in the United Kingdom. 97% of Jordanian\nhouseholds own at least one television set while 90% have satellite reception.\nFurthermore, 61% of Jordanian households own at least one personal computer or\nlaptop.\n\nAccording to an investment survey, Jordan ranked as the 9th best outsourcing\ndestination worldwide. Amman is one of the top 10 cities in the world to\nlaunch a tech start-up in 2012 and is becoming referred to as the \"Silicon\nValley of the Middle East\".\n\nJordan has hosted the World Economic Forum on the Middle East and North Africa\nsix times and plans to hold it again at the Dead Sea for the seventh time in\n2013. Amman also hosts the Mercedes Benz Fashion Week semiannually and is the\nonly city in the region to hold such a prestigious event that is usually held\nby the likes of New York, Paris, and Milan.",
    "openai_summarised_points": [
      "• Remittance flows to Jordan experienced rapid growth during the late 1970s and 1980s, coinciding with Jordan's export of high-skilled labor to Persian Gulf States.",
      "• Remittances are a significant source of external funding for Jordan and many other developing countries.",
      "• In 2010, Jordan received approximately US$3,000 million in remittances, ranking 10th among developing countries according to World Bank data.",
      "• Over the past decade, Jordan has consistently ranked among the top 20 remittance-recipient countries globally.",
      "• According to the Arab Monetary Fund (AMF) statistics in 2010, Jordan was the third-largest recipient of remittances among Arab countries, after Egypt and Lebanon.",
      "• The primary host countries for Jordanian expatriates are Saudi Arabia and the United Arab Emirates (UAE), with about 90% of these migrants working in Persian Gulf countries.",
      "• The proportion of skilled workers in Jordan is among the highest in the Middle East region.",
      "• Jordan hosts many major software and hardware IT companies, highlighting its attractiveness as a stable base with high-caliber human resources to serve the wider region.",
      "• A January 2012 report by Rachid Sefraoui, founder of venture capital firm Finaventures, ranked Amman as one of the top 10 best cities worldwide to launch a tech start-up.",
      "• Approximately 13.3% of Jordanian citizens live below the poverty line.",
      "• Since the mid-1970s, remittances from migrants have been Jordan’s most important source of foreign exchange, significantly contributing to the country’s economic development and improving living standards.",
      "• In the early 1950s, agriculture accounted for nearly 40% of Jordan’s GNP; by the eve of the June 1967 War, this share had decreased to 17%, and by the mid-1980s, it further declined to about 6%.",
      "• Jordan hosts SOFEX, the world's fastest-growing and the region’s only special operations and homeland security exhibition and conference.",
      "• Jordan is a regional and international provider of advanced military goods and services.",
      "• The KADDB Industrial Park, focused on defense manufacturing, was opened in September 2009 in Mafraq; by 2015, it was expected to generate around 15,000 jobs with an investment volume of JD500 million.",
      "• The Strategic Foresight Group estimated the opportunity cost of conflict in the Middle East from 1991 to 2010 at $12 trillion, with Jordan’s share approximately $84 billion.",
      "• Jordan has a mobile phone penetration rate of 138% and an internet penetration rate of 63%.",
      "• About 41.6% of mobile phones in Jordan are smartphones, compared to 40% in the United States and 26% in the United Kingdom.",
      "• 97% of Jordanian households own at least one television set, and 90% have satellite reception.",
      "• 61% of Jordanian households own at least one personal computer or laptop.",
      "• Jordan was ranked as the 9th best outsourcing destination worldwide according to an investment survey.",
      "• Amman was recognized as one of the top 10 cities globally to launch a tech start-up in 2012 and is increasingly referred to as the \"Silicon Valley of the Middle East.\"",
      "• Jordan has hosted the World Economic Forum on the Middle East and North Africa six times, with plans to host it again at the Dead Sea in 2013.",
      "• Amman hosts the Mercedes Benz Fashion Week semiannually, being the only city in the region to hold such a prestigious event, typically held in New York, Paris, and Milan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:49.780108",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3674,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Standard of living",
    "text": "Jordan is one of the most liberal countries in the Middle East allowing a\ndebate to consider introducing a secular government. In the 2010 Human\nDevelopment Index, Jordan was placed in the \"high human development\" bracket\nand came 7th among Arab countries, after the Persian Gulf states and Lebanon.\nThe 2010 Quality of Life Index prepared by _International Living_ magazine\nranked Jordan second in the MENA with 55.0 points after Israel.\n\nDecades of political stability and security and strict law enforcement make\nJordan one of the top 10 countries worldwide in security. In the 2010 Newsweek\n\"World's Best Countries\" list, Jordan ranked 53rd worldwide, and 3rd among\nArab countries after Kuwait and the UAE. Jordan is also among the top ten\ncountries whose citizens feel safest walking the streets at night.\n\nAs of 2011, 63% of working Jordanians are insured with the Social Security\nCorporation, as well as 120,000 foreigners, with plans to include the rest of\nJordanian workers both inside and outside the kingdom as well as students,\nhousewives, business owners, and the unemployed. Only 1.6% of Jordanians make\nless than $2 a day, one of the lowest in the developing world according to the\nHuman Poverty Index.\n\nIn the 2010 Gallup Global Wellbeing Survey, 30% of Jordanians described their\nfinancial situation as \"thriving\", surpassed most of the Arab countries with\nthe exception of Qatar, the United Arab Emirates, Kuwait, and Saudi Arabia. In\n2008, the Jordanian government launched the \"Decent Housing for a Decent\nLiving\" project aimed at building 120,000 affordable housing units within the\nnext 5 years, plus an additional 100,000 housing units if the need arises.",
    "openai_summarised_points": [
      "• Jordan is recognized as one of the most liberal countries in the Middle East, allowing a debate on introducing a secular government.",
      "• In the 2010 Human Development Index, Jordan was classified within the \"high human development\" bracket and ranked 7th among Arab countries, following the Persian Gulf states and Lebanon.",
      "• The 2010 Quality of Life Index, compiled by _International Living_ magazine, ranked Jordan second in the Middle East and North Africa (MENA) region with a score of 55.0 points, trailing only Israel.",
      "• Decades of political stability, security, and strict law enforcement contribute to Jordan being among the top 10 countries worldwide in terms of security.",
      "• In the 2010 Newsweek \"World's Best Countries\" list, Jordan was ranked 53rd globally and 3rd among Arab nations, after Kuwait and the United Arab Emirates (UAE).",
      "• Jordan is also among the top ten countries where citizens feel safest walking the streets at night.",
      "• As of 2011, 63% of employed Jordanians are insured through the Social Security Corporation, which also insures 120,000 foreigners; plans are in place to extend coverage to all Jordanian workers both inside and outside the kingdom, as well as students, housewives, business owners, and the unemployed.",
      "• Only 1.6% of Jordanians live on less than $2 per day, making it one of the lowest poverty rates in the developing world according to the Human Poverty Index.",
      "• In the 2010 Gallup Global Wellbeing Survey, 30% of Jordanians described their financial situation as \"thriving,\" a figure higher than most Arab countries, except for Qatar, the United Arab Emirates, Kuwait, and Saudi Arabia.",
      "• In 2008, the Jordanian government launched the \"Decent Housing for a Decent Living\" project, aiming to build 120,000 affordable housing units within five years, with an additional 100,000 units planned if needed."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:53:54.080592",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1678,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Main indicators",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP (in bn. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bn. US$ nominal)  | GDP growth (real)  | Inflation (in percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1980  | 8.82  | 3,978  | 3.93  | 11.1%  | 10.9%  | n/a\n1985  | 14.65  | 5,326  | 5.03  | −1.1%  | 2.8%  | n/a\n1990  | 16.83  | 4,834  | 4.19  | −1.6%  | 16.2%  | 227.5%\n1995  | 24.31  | 5,453  | 6.76  | 6.0%  | 2.4%  | 117.8%\n2000  | 31.00  | 6,131  | 8.73  | 4.2%  | 0.7%  | 99.3%\n2005  | 47.66  | 8,392  | 13.13  | 8.8%  | 3.5%  | 73.0%\n2006  | 53.31  | 8,774  | 15.80  | 8.5%  | 6.3%  | 66.3%\n2007  | 59.34  | 9,166  | 17.96  | 8.4%  | 4.7%  | 64.3%\n2008  | 64.95  | 9,792  | 22.65  | 7.4%  | 14.0%  | 54.2%\n2009  | 68.63  | 10,122  | 24.54  | 5.0%  | -0.7%  | 58.0%\n2010  | 71.07  | 10,254  | 27.13  | 2.3%  | 4.8%  | 59.4%\n2011  | 74.52  | 10,482  | 29.52  | 2.7%  | 4.2%  | 62.1%\n2012  | 77.76  | 10,782  | 31.68  | 2.4%  | 4.5%  | 70.5%\n2013  | 81.14  | 10,545  | 34.50  | 2.6%  | 4.8%  | 75.6%\n2014  | 85.35  | 9,858  | 36.90  | 3.4%  | 2.9%  | 75.0%\n2015  | 88.29  | 9,300  | 38.64  | 2.5%  | −0.9%  | 78.4%\n2016  | 90.91  | 9,123  | 39.95  | 2.0%  | −0.8%  | 77.4%\n2017  | 94.83  | 9,283  | 41.67  | 2.5%  | 3.3%  | 75.7%\n2018  | 94.60  | 9,045  | 43.43  | 1.9%  | 4.5%  | 74.3%\n2019  | 100.63  | 9,405  | 44.57  | 1.8%  | 0.8%  | 78.0%\n2020  | 104.08  | 9,524  | 43.76  | −1.1%  | 0.3%  | 88.0%\n2021  | 101.62  | 9,115  | 46.36  | 3.7%  | 1.3%  | 93.3%\n2022  | 111.51  | 9,880  | 48.72  | 2.4%  | 4.2%  | 93.0%\n2023  | 118.54  | 10,456  | 50.89  | 2.6%  | 2.1%  | 92.8%\n2024  | 124.28  | 10,917  | 53.31  | 2.4%  | 2.1%  | 91.7%",
    "openai_summarised_points": [
      "• The table presents key economic indicators for Jordan spanning from 1980 to 2024, providing a comprehensive overview of the country's economic performance over this period.",
      "• In 1980, Jordan's GDP measured 8.82 billion US dollars (PPP), with a GDP per capita of 3,978 US dollars (PPP), and a nominal GDP of 3.93 billion US dollars.",
      "• During 1980, Jordan experienced a high real GDP growth rate of 11.1%, accompanied by an inflation rate of 10.9%, with government debt data not available.",
      "• By 1985, Jordan's GDP increased to 14.65 billion US dollars (PPP), with a per capita GDP of 5,326 US dollars (PPP), and a nominal GDP of 5.03 billion US dollars; the economy contracted by −1.1% in real terms, and inflation decreased to 2.8%.",
      "• In 1990, the GDP reached 16.83 billion US dollars (PPP), with a per capita GDP of 4,834 US dollars (PPP), and a nominal GDP of 4.19 billion US dollars; the economy shrank by −1.6%, but inflation surged to 16.2%, and government debt was 227.5% of GDP.",
      "• The 1995 data shows a significant growth to 24.31 billion US dollars (PPP), with a per capita GDP of 5,453 US dollars (PPP), and a nominal GDP of 6.76 billion US dollars; the economy grew by 6.0%, inflation was low at 2.4%, and government debt decreased to 117.8% of GDP.",
      "• By 2000, Jordan's GDP increased to 31.00 billion US dollars (PPP), with a per capita GDP of 6,131 US dollars (PPP), and a nominal GDP of 8.73 billion US dollars; the economy grew by 4.2%, inflation was minimal at 0.7%, and government debt was 99.3% of GDP.",
      "• The period from 2005 to 2007 saw substantial growth, with GDP rising from 47.66 billion US dollars (PPP) in 2005 to 59.34 billion US dollars in 2007; per capita GDP increased from 8,392 US dollars to 9,166 US dollars, and nominal GDP from 13.13 billion to 17.96 billion US dollars.",
      "• In 2008, GDP reached 64.95 billion US dollars (PPP), with a per capita GDP of 9,792 US dollars, and a nominal GDP of 22.65 billion US dollars; the economy grew by 7.4%, but inflation spiked to 14.0%, and government debt was 54.2% of GDP.",
      "• The 2009 data shows a GDP of 68.63 billion US dollars (PPP), with a per capita GDP of 10,122 US dollars, and a nominal GDP of 24.54 billion US dollars; growth slowed to 5.0%, inflation turned negative at −0.7%, and government debt increased to 58.0%.",
      "• In 2010, GDP grew to 71.07 billion US dollars (PPP), with a per capita GDP of 10,254 US dollars, and a nominal GDP of 27.13 billion US dollars; real growth was 2.3%, inflation rose to 4.8%, and government debt was 59.4%.",
      "• The year 2011 saw GDP at 74.52 billion US dollars (PPP), with a per capita GDP of 10,482 US dollars, and a nominal GDP of 29.52 billion US dollars; growth was 2.7%, inflation at 4.2%, and government debt at 62.1%.",
      "• In 2012, GDP increased to 77.76 billion US dollars (PPP), with a per capita GDP of 10,782 US dollars, and a nominal GDP of 31.68 billion US dollars; growth was 2.4%, inflation at 4.5%, and government debt rose to 70.5%.",
      "• The 2013 figures show GDP of 81.14 billion US dollars (PPP), with a per capita GDP of 10,545 US dollars, and a nominal GDP of 34.50 billion US dollars; growth was 2.6%, inflation at 4.8%, and government debt at 75.6%.",
      "• In 2014, GDP reached 85.35 billion US dollars (PPP), with a per capita GDP of 9,858 US dollars, and a nominal GDP of 36.90 billion US dollars; growth was 3.4%, inflation decreased to 2.9%, and government debt was 75.0%.",
      "• The 2015 data indicates GDP of 88.29 billion US dollars (PPP), with a per capita GDP of 9,300 US dollars, and a nominal GDP of 38.64 billion US dollars; growth slowed to 2.5%, inflation was negative at −0.9%, and government debt increased to 78.4%.",
      "• In 2016, GDP was 90.91 billion US dollars (PPP), with a per capita GDP of 9,123 US dollars, and a nominal GDP of 39.95 billion US dollars; growth was 2.0%, inflation was negative at −0.8%, and government debt slightly decreased to 77.4%.",
      "• The year 2017 saw GDP at 94.83 billion US dollars (PPP), with a per capita GDP of 9,283 US dollars, and a nominal GDP of 41.67 billion US dollars; growth was 2.5%, inflation increased to 3.3%, and government debt was 75.7%.",
      "• In 2018, GDP slightly declined to 94.60 billion US dollars (PPP), with a per capita GDP of 9,045 US dollars, and a nominal GDP of 43.43 billion US dollars; growth was 1.9%, inflation rose to 4.5%, and government debt was 74.3%.",
      "• The 2019 data shows GDP at 100.63 billion US dollars (PPP), with a per capita GDP of 9,405 US dollars, and a nominal GDP of 44.57 billion US dollars; growth was 1.8%, inflation was 0.8%, and government debt increased to 78.0%.",
      "• In 2020, GDP was 104.08 billion US dollars (PPP), with a per capita GDP of 9,524 US dollars, and a nominal GDP of 43.76 billion US dollars; the economy contracted by −1.1%, inflation was minimal at 0.3%, and government debt rose significantly to 88.0%.",
      "• The 2021 figures show GDP at 101.62 billion US dollars (PPP), with a per capita GDP of 9,115 US dollars, and a nominal GDP of 46.36 billion US dollars; the economy grew by 3.7%, inflation was 1.3%, and government debt increased to 93.3%.",
      "• In 2022, GDP increased to 111.51 billion US dollars (PPP), with a per capita GDP of 9,880 US dollars, and a nominal GDP of 48.72 billion US dollars; growth was 2.4%, inflation at 4.2%, and government debt was 93.0%.",
      "• The 2023 data indicates GDP at 118.54 billion US dollars (PPP), with a per capita GDP of 10,456 US dollars, and a nominal GDP of 50.89 billion US dollars; growth was 2.6%, inflation at 2.1%, and government debt slightly decreased to 92.8%.",
      "• In 2024, GDP is projected to reach 124.28 billion US dollars (PPP), with a per capita GDP of 10,917 US dollars, and a nominal GDP of 53.31 billion US dollars; growth is expected to be 2.4%, inflation at 2.1%, and government debt to slightly decline to 91.7%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:13.138528",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1705,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Agriculture, forestry, and fishing",
    "text": "Despite increases in production, the agriculture sector's share of the economy\nhas declined steadily to just 2.4% of gross domestic product by 2004. About 4%\nof Jordan's labor force worked in the agricultural sector in 2002. The most\nprofitable segment of Jordan's agriculture is fruit and vegetable production\n(including tomatoes, cucumbers, citrus fruit, and bananas) in the Jordan\nValley. The rest of crop production, especially cereal production, remains\nvolatile because of the lack of consistent rainfall. Fishing and forestry are\nnegligible in terms of the overall domestic economy. The fishing industry is\nevenly divided between live capture and aquaculture; the live weight catch\ntotaled just over 1,000 metric tons in 2002. The forestry industry is even\nsmaller in economic terms; approximately 240,000 total cubic meters of\nroundwood were removed in 2002, the vast majority for fuelwood.",
    "openai_summarised_points": [
      "• Despite increases in agricultural production, the sector's contribution to Jordan's economy has steadily declined, accounting for only 2.4% of gross domestic product (GDP) by 2004.",
      "• In 2002, approximately 4% of Jordan's labor force was employed in the agricultural sector.",
      "• The most profitable segment within Jordan's agriculture is fruit and vegetable production, which includes tomatoes, cucumbers, citrus fruits, and bananas, primarily cultivated in the Jordan Valley.",
      "• Other crop productions, particularly cereal crops, are characterized by volatility due to inconsistent rainfall patterns.",
      "• The fishing industry in Jordan is minimal relative to the overall economy, with an even split between live capture fishing and aquaculture.",
      "• In 2002, the total live weight catch from fishing was just over 1,000 metric tons.",
      "• The forestry industry in Jordan is negligible economically; in 2002, approximately 240,000 cubic meters of roundwood were harvested, predominantly for fuelwood purposes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:16.096162",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 898,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.5.1",
    "section_name": "Recent Developments",
    "text": "Since gaining independence, Jordan's agricultural sector has experienced\nsignificant growth, with the added value of its production reaching JD1.691\nbillion and registering a 9% growth rate. Vegetable production has increased\nby 91%, and fruit tree produce has risen by 141%, expanding to meet both local\nand international demand. Jordanian agricultural products now reach 112\ncountries, with exports rising by 441% to JD1.5 billion. Livestock numbers\nhave grown by 54%, totaling 3.8 million animals, and the value of animal\nproducts has increased by 279% to JD1.305 billion. Employment in the sector\nhas grown by 38%, now encompassing 261,000 workers. The Agricultural Credit\nCorporation's capital has expanded by 213% to JD100 million, providing JD55\nmillion in annual loans to 11,000 farmers. These developments underscore the\nsector's role in enhancing food security, economic integration, and job\ncreation in rural areas.",
    "openai_summarised_points": [
      "• Since Jordan's independence, the agricultural sector has experienced substantial growth, with the added value of its production reaching JD1.691 billion and achieving a 9% growth rate.",
      "• Vegetable production in Jordan has increased by 91%, significantly expanding the sector's output to meet rising domestic and international demand.",
      "• Fruit tree produce has risen by 141%, contributing to the diversification and expansion of Jordanian agricultural exports.",
      "• Jordanian agricultural products are now exported to 112 countries worldwide, indicating a broad international market presence.",
      "• Agricultural exports have surged by 441%, reaching a total value of JD1.5 billion, reflecting a substantial increase in trade activity.",
      "• Livestock numbers in Jordan have grown by 54%, totaling approximately 3.8 million animals, which supports the sector's expansion.",
      "• The value of animal products has increased by 279%, reaching JD1.305 billion, highlighting significant growth in livestock-related revenue.",
      "• Employment within the agricultural sector has expanded by 38%, now employing approximately 261,000 workers, thereby contributing to rural employment and economic stability.",
      "• The Agricultural Credit Corporation's capital has increased by 213%, reaching JD100 million, which enhances financial support for the sector.",
      "• The Corporation provides JD55 million annually in loans to around 11,000 farmers, facilitating agricultural development and investment.",
      "• These recent developments emphasize the sector's critical role in improving food security, fostering economic integration, and generating employment opportunities in rural areas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:19.068139",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 926,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Mining and minerals",
    "text": "Potash and phosphates are among the country's main economic exports. In 2003\napproximately 2 million tons of potash salt production translated into US$192\nmillion in export earnings, making it the second most lucrative exported good.\nPotash production totaled 1.9 million tons in 2004 and 1.8 million tons in\n2005. In 2004 approximately 6.75 million tons of phosphate rock production\ngenerated US$135 million in export earnings, placing it fourth on Jordan's\nprincipal export list. With production totaling 6.4 million tons in 2005,\nJordan was the world's third largest producer of raw phosphates. In addition\nto these two major minerals, smaller quantities of unrefined salt, copper ore,\ngypsum, manganese ore, and the mineral precursors to the production of\nceramics (glass sand, clays, and feldspar) are also mined.",
    "openai_summarised_points": [
      "• Potash and phosphates are among Jordan's primary economic exports, playing a significant role in the country's trade revenue.",
      "• In 2003, Jordan produced approximately 2 million tons of potash salt, which generated US$192 million in export earnings, making potash the second most lucrative exported good.",
      "• Potash production in Jordan was 1.9 million tons in 2004 and slightly decreased to 1.8 million tons in 2005.",
      "• In 2004, Jordan produced approximately 6.75 million tons of phosphate rock, which yielded US$135 million in export earnings, ranking it as the fourth most important export product.",
      "• Jordan was the world's third largest producer of raw phosphates in 2005, with a production total of 6.4 million tons.",
      "• Besides potash and phosphates, Jordan also mines smaller quantities of unrefined salt, copper ore, gypsum, manganese ore, and mineral precursors used in ceramics production, including glass sand, clays, and feldspar."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:22.752661",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 818,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Industry and manufacturing",
    "text": "A recycling project situated a few kilometres outside Amman.\n\nThe industrial sector, which includes mining, manufacturing, construction, and\npower, accounted for approximately 26% of gross domestic product in 2004\n(including manufacturing 16.2%; construction 4.6%; and mining 3.1%). More than\n21% of the country's labor force was reported to be employed in this sector in\n2002. The main industrial products are potash, phosphates, pharmaceuticals,\ncement, clothes, and fertilizers. The most promising segment of this sector is\nconstruction. In the past several years, demand has increased rapidly for\nhousing and offices of foreign enterprises based in Jordan to better access\nthe Iraqi market. The manufacturing sector has grown as well (to nearly 20% of\nGDP by 2005), in large part as a result of the United States–Jordan Free Trade\nAgreement (ratified in 2001 by the U.S. Senate); the agreement has led to the\nestablishment of approximately 13 qualifying industrial zones throughout the\ncountry. The zones, which provide duty-free access to the U.S. market, produce\nmostly light industrial products, especially ready-made garments. By 2004 the\nzones accounted for nearly US$1.1 billion in exports, according to the\nJordanian government.\n\nJordan's free trade agreement with the US – the first in the Arab world – has\nalready made the US one of Jordan's most significant markets. By 2010, it\nwould have barrier-free export access in almost all sectors. A number of trade\nagreements with countries in the Middle Eastern and North African regions and\nbeyond should also reap increasing benefits, not in the least the Agadir\nAgreement, which is seen as a precursor to a free trade agreement with the EU.\nJordan also recently[_when?_] signed a free trade agreement with Canada.\nFurthermore, Jordan's plethora of industrial zones offering tax incentives,\nlow utility costs and improved infrastructure links are helping incubate new\ndevelopments. The relatively high skills level is also a key factor in\npromoting investment and stimulating the economy, particularly in value-added\nsectors. Despite the fact that Jordan has few natural resources it does\nbenefit from abundant reserves of potash and phosphates, which are widely used\nin the production of fertilisers. Exports by these industries are expected to\nhave a combined worth of $1bn in 2008. Other important industries include\npharmaceuticals, which exported around $435m in 2006 and $260m in the first\nhalf of 2008 alone, as well as textiles, which were worth $1.19bn in 2007.\nAlthough the value of Jordan's industrial sector is high, the kingdom faces a\nnumber of challenges. Because the country is dependent on importing raw\nmaterials, it is vulnerable to price volatility. Shortages in water and power\nalso make consistent development difficult. Despite these challenges, Jordan's\neconomic openness and long-standing fertiliser and pharmaceutical industries\nshould continue to provide a solid source of foreign currency.\n\nJordan has a plethora of industrial zones and special economic zones aimed at\nincreasing exports and making Jordan an industrial giant. The Mafraq SEZ is\nfocused on industry and logistics hoping to become the regional logistics hub\nwith air, road, and rail links to neighboring countries and eventually Europe\nand the Persian Gulf. The Ma'an SEZ is primarily industrial focusing on\nsatisfying domestic demand and reducing reliance on imports. With a national\nrail system under construction, Jordan expects trade to grow significantly and\nJordan will mostly become the trade hub of the Levant and even the Middle East\nregion as a whole due to its geography and natural resources.",
    "openai_summarised_points": [
      "• The industrial sector in Jordan, encompassing mining, manufacturing, construction, and power, contributed approximately 26% to the country's gross domestic product (GDP) in 2004, with manufacturing accounting for 16.2%, construction 4.6%, and mining 3.1%.",
      "• Over 21% of Jordan's labor force was employed in the industrial sector in 2002.",
      "• The main industrial products produced in Jordan include potash, phosphates, pharmaceuticals, cement, clothing, and fertilizers.",
      "• The construction segment is considered the most promising within the industrial sector, driven by increased demand for housing and office spaces for foreign enterprises seeking better access to the Iraqi market.",
      "• The manufacturing sector experienced growth, reaching nearly 20% of GDP by 2005, largely due to the United States–Jordan Free Trade Agreement ratified in 2001 by the U.S. Senate.",
      "• The Free Trade Agreement facilitated the establishment of approximately 13 qualifying industrial zones across Jordan, which offer duty-free access to the U.S. market and primarily produce light industrial goods, especially ready-made garments.",
      "• By 2004, these industrial zones accounted for nearly US$1.1 billion in exports, according to the Jordanian government.",
      "• Jordan's free trade agreement with the U.S., the first such agreement in the Arab world, has made the U.S. one of Jordan's most significant markets, with plans for barrier-free export access in nearly all sectors by 2010.",
      "• Jordan has also signed trade agreements with other Middle Eastern and North African countries, including the Agadir Agreement, which is viewed as a precursor to a free trade agreement with the European Union (EU).",
      "• Recently, Jordan signed a free trade agreement with Canada, further expanding its trade relations.",
      "• The country’s numerous industrial zones offer tax incentives, low utility costs, and improved infrastructure, fostering new industrial developments.",
      "• Jordan benefits from a relatively high skills level among its workforce, which promotes investment and economic growth, especially in value-added sectors.",
      "• Despite limited natural resources, Jordan possesses abundant reserves of potash and phosphates, which are extensively used in fertilizer production; exports from these industries were expected to reach a combined value of US$1 billion in 2008.",
      "• Key industries include pharmaceuticals, which exported approximately US$435 million in 2006 and US$260 million in the first half of 2008, and textiles, valued at US$1.19 billion in 2007.",
      "• The country faces challenges such as dependence on imported raw materials, making it vulnerable to price volatility, and shortages in water and power, which hinder consistent industrial development.",
      "• Despite these challenges, Jordan’s open economy and established fertilizer and pharmaceutical industries are expected to continue generating significant foreign currency.",
      "• Jordan has developed numerous industrial zones and special economic zones (SEZs) aimed at boosting exports and establishing the country as an industrial hub.",
      "• The Mafraq SEZ focuses on industry and logistics, aiming to become a regional logistics hub with air, road, and rail links to neighboring countries, Europe, and the Persian Gulf.",
      "• The Ma'an SEZ is primarily industrial, targeting domestic demand and reducing reliance on imports.",
      "• With a national rail system under construction, Jordan anticipates significant trade growth, positioning itself as a trade hub for the Levant and the broader Middle East region due to its strategic geography and natural resources."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:27.619198",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3657,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Telecoms and IT",
    "text": "Telecommunications is a billion-dollar industry with estimates showing that\ncore markets of fixed-line, mobile and data service generate annual revenue of\naround JD836.5m ($1.18bn) per year, which is equivalent to 13.5% of GDP.\nJordan's IT sector is the most developed and competitive in the region due to\nthe 2001 telecom liberalization. Market share of the mobile sector, the most\ncompetitive telecoms market, is currently fairly evenly divided between the\nthree operators, with Zain, owned by MTC Kuwait, maintaining the largest share\n(39%), followed by France Telecom's brand Orange (36%) and Umniah (25%), which\nis 96% owned by Bahrain's Batelco. End of year figures for 2007 show that the\nmarket trend is towards greater parity, with Zain's share falling in the space\nof a year from 47% in 2006 and the other two operators picking up subscribers.\nThe increased competition has led to pricing that is more favourable to\nconsumers. Mobile penetration is currently around 80%.\n\nAmbitious subsequent national strategies were formulated already since Y 2000\nas a private sector initiative directly led by his majesty the king of Jordan.\nInformation technology association in Jordan (int@j ) was established to kick\noff a private sector process that would focus on preparing Jordan for the new\neconomy through IT and shall reflect the national objectives towards\nautomation and modernization in co-operation with the ministry of information\ntechnology in Jordan the (MOICT). The latest strategy will take the sector\nthrough to 2011, aims to bring Jordan to precise objectives. The ICT sector\ncurrently accounts for over a 14% (indirect) of the kingdom's GDP. This figure\nincludes foreign investment and total domestic revenue from the sector.\nEmployment growth in the sector was progressive and reached up to 60.000\n(indirect ) by 2008. The government is working to address employment issues\nand education related to sector by developing ICT training and opportunities\nto increase the overall penetration of ICT in Jordanian society. The policy\noutlines a number of objectives for the country to reach within the next three\nyears, including almost doubling the size of the sector to $3bn, and pushing\ninternet user penetration up to 50%.\n\nThe early founder of Int@j and its first chairman of the board is Karim Kawar\nand early activists who drove the national strategic objectives and helped\nformulate an action plan through the developing pillars were Marwan Juma\nJordan's minister of ICT, Doha Abdelkhaleq on labour and education. Humam\nMufti on advocacy and Nashat Masri on Capital and finance amongst others. Such\nan infrastructure made Jordan a suitable location for IT startups that operate\nin the fields of web development, mobile application development, online\nservices, and investment in IT businesses.\n\nThe IT industry in Jordan in the year 2000 and beyond got a very big boost\nafter the Gulf War of 1991. This boost came from a large influx of immigrants\nfrom the Gulf countries to Jordan, mostly from Jordanian expatriates from\nKuwait, totaling few hundred thousands. This large wave impacted Jordan in\nmany ways, and one of them was on its IT industry.",
    "openai_summarised_points": [
      "• Telecommunications in Jordan is a billion-dollar industry, with core markets of fixed-line, mobile, and data services generating approximately JD836.5 million ($1.18 billion) annually, accounting for about 13.5% of the country's GDP.",
      "• Jordan's IT sector is the most developed and competitive in the Middle East region, a status achieved following the 2001 liberalization of the telecom sector.",
      "• The mobile telecommunications market in Jordan is highly competitive, with market share distribution among three main operators: Zain (owned by MTC Kuwait) holding 39%, Orange (owned by France Telecom) with 36%, and Umniah (96% owned by Bahrain's Batelco) with 25%.",
      "• End-of-year 2007 data indicated a trend toward market parity, with Zain's market share decreasing from 47% in 2006, while Orange and Umniah gained subscribers, reflecting increased competition.",
      "• The intensified competition in the telecom sector has resulted in more favorable pricing for consumers.",
      "• Mobile phone penetration in Jordan is approximately 80%.",
      "• Since 2000, Jordan has implemented ambitious national strategies for ICT development, initiated as private sector efforts led by the Jordanian monarchy.",
      "• The Information Technology Association in Jordan (int@j) was established to facilitate private sector involvement in preparing Jordan for the digital economy, focusing on automation and modernization in collaboration with the Ministry of Information Technology (MOICT).",
      "• The latest ICT strategy aims to extend until 2011, targeting specific national objectives, including sector growth and societal penetration.",
      "• The ICT sector contributes over 14% to Jordan's GDP indirectly, encompassing foreign investment and domestic revenue.",
      "• Employment in the ICT sector grew to approximately 60,000 indirect jobs by 2008, with the government actively working to address employment and educational issues through ICT training and opportunities.",
      "• Policy objectives for the next three years include nearly doubling the sector's size to $3 billion and increasing internet user penetration to 50%.",
      "• Karim Kawar, the founder and first chairman of int@j, played a key role in establishing the organization and driving national ICT strategic objectives, alongside influential figures such as Marwan Juma (Jordan's Minister of ICT), Doha Abdelkhaleq (labor and education), Humam Mufti (advocacy), and Nashat Masri (capital and finance).",
      "• Jordan's robust ICT infrastructure has made it an attractive location for startups specializing in web development, mobile applications, online services, and IT business investments.",
      "• The Jordanian IT industry experienced a significant boost after the Gulf War of 1991, driven by a large influx of Gulf expatriates, particularly from Kuwait, numbering in the hundreds of thousands, which positively impacted Jordan's IT sector development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:34.853302",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3166,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.9",
    "section_name": "Energy",
    "text": "Energy remains perhaps the biggest challenge for continued growth for Jordan's\neconomy. Spurred by the surge in the price of oil to more than $145 a barrel\nat its peak, the Jordanian government has responded with an ambitious plan for\nthe sector. The country's lack of domestic resources is being addressed via a\n$14bn investment programme in the sector. The programme aims to reduce\nreliance on imported products from the current level of 96%, with renewables\nmeeting 10% of energy demand by 2020 and nuclear energy meeting 60% of energy\nneeds by 2035. The government also announced in 2007 that it would scale back\nsubsidies in several areas, including energy, where there have historically\nbeen regressive subsidies for fuel and electricity. In another new step, the\ngovernment is opening up the sector to competition, and intends to offer all\nthe planned new energy projects to international tender.\n\nUnlike most of its neighbors, Jordan has no significant petroleum resources of\nits own and is heavily dependent on oil imports to fulfill its domestic energy\nneeds. In 2002 proved oil reserves totaled only 445,000 barrels (70,700 m3).\nJordan produced only 40 barrels per day (6.4 m3/d) in 2004 but consumed an\nestimated 103,000 barrels per day (16,400 m3/d). According to U.S. government\nfigures, oil imports had reached about 100,000 barrels per day (16,000 m3/d)\nin 2004. The Iraq invasion of 2003 disrupted Jordan's primary oil supply route\nfrom its eastern neighbor, which under Saddam Hussein had provided the kingdom\nwith highly discounted crude oil via overland truck routes. Since late 2003,\nan alternative supply route by tanker through the Al Aqabah port has been\nestablished; Saudi Arabia is now Jordan's primary source of imported oil;\nKuwait and the United Arab Emirates (UAE) are secondary sources. Although not\nso heavily discounted as Iraqi crude oil, supplies from Saudi Arabia and the\nUAE are subsidized to some extent.\n\nIn the face of continued high oil costs, interest has increased in the\npossibility of exploiting Jordan's vast oil shale resources, which are\nestimated to total approximately 40 billion tons, 4 billion tons of which are\nbelieved to be recoverable. Jordan's oil shale resources could produce 28\nbillion barrels (4.5 km3) of oil, enabling production of about 100,000 barrels\nper day (16,000 m3/d). The oil shale in Jordan has the fourth largest in the\nworld which currently, there are several companies who are negotiating with\nthe Jordanian government about exploiting the oil shale like Royal Dutch\nShell, Petrobras and Eesti Energia.\n\nNatural gas is increasingly being used to fulfill the country's domestic\nenergy needs, especially with regard to electricity generation. Jordan was\nestimated to have only modest natural gas reserves (about 6 billion cubic\nmeters in 2002), but new estimates suggest a much higher total. In 2003 the\ncountry produced and consumed an estimated 390 million cubic meters of natural\ngas. The primary source is located in the eastern portion of the country at\nthe Risha gas field. Until the early 2010s, the country imported the bulk of\nits natural gas via the Arab Gas Pipeline that stretches from the Al Arish\nterminal in Egypt underwater to Al Aqabah and then to northern Jordan, where\nit links to two major power stations. This Egypt–Jordan pipeline supplied\nJordan with approximately 1 billion cubic meters of natural gas per year. Gas\nsupplies from Egypt were halted in 2013 due to insurgent activities in the\nSinai and domestic gas shortages in Egypt. In light of this, a liquified\nnatural gas terminal was built in the Port of Aqaba to facilitate gas imports.\nIn 2017, a low-capacity gas pipeline from Israel was completed which supplies\nthe Arab Potash factories near the Dead Sea. As of 2018, a large capacity\npipeline from Israel is under construction in northern Jordan which is\nexpected to begin operating by 2020 and will supply the kingdom with 3 BCM of\ngas per year, thereby satisfying most of Jordan's natural gas consumption\nneeds.\n\nThe state-owned National Electric Power Company (NEPCO) produces most of\nJordan's electricity (94%). Since mid-2000, privatization efforts have been\nundertaken to increase independent power generation facilities; a Belgian firm\nwas set to begin operations at a new power plant near Amman with an estimated\ncapacity of 450 megawatts. Power plants at Az Zarqa (400 megawatts) and Al\nAqabah (650 MW) are Jordan's other primary electricity providers. As a whole,\nthe country consumed nearly 8 billion kilowatt-hours of electricity in 2003\nwhile producing only 7.5 billion kWh of electricity. Electricity production in\n2004 rose to 8.7 billion kWh, but production must continue to increase in\norder to meet demand, which the government estimates would continue to grow by\nabout 5% per year. About 99% of the population is reported to have access to\nelectricity.",
    "openai_summarised_points": [
      "• Energy is considered perhaps the biggest challenge for Jordan's continued economic growth, driven by fluctuating oil prices and resource limitations.",
      "• The peak price of oil reached over $145 per barrel, prompting the Jordanian government to implement an ambitious sector development plan.",
      "• Jordan's energy strategy involves a $14 billion investment program aimed at reducing dependence on imports, which currently account for 96% of energy needs.",
      "• The plan targets renewable energy sources to meet 10% of Jordan's energy demand by 2020 and nuclear energy to supply 60% of energy needs by 2035.",
      "• In 2007, the Jordanian government announced plans to scale back subsidies in several sectors, including energy, where historically fuel and electricity subsidies have been regressive.",
      "• The government is opening the energy sector to competition by offering all new energy projects through international tenders.",
      "• Unlike most neighboring countries, Jordan has no significant domestic petroleum resources and relies heavily on imports to meet energy needs.",
      "• In 2002, Jordan's proved oil reserves totaled only 445,000 barrels (70,700 m³).",
      "• Oil production in Jordan was only 40 barrels per day (6.4 m³/d) in 2004, while domestic consumption was estimated at 103,000 barrels per day (16,400 m³/d).",
      "• According to U.S. government data, Jordan's oil imports reached about 100,000 barrels per day (16,000 m³/d) in 2004.",
      "• The 2003 Iraq invasion disrupted Jordan's primary oil supply route from Iraq, which previously provided highly discounted crude oil via overland truck routes under Saddam Hussein.",
      "• Since late 2003, Jordan established an alternative oil supply route via tanker through the Port of Aqaba; Saudi Arabia is now the primary source of imported oil, with Kuwait and the UAE as secondary sources.",
      "• Supplies from Saudi Arabia and the UAE are subsidized to some extent, although not as heavily discounted as Iraqi crude oil.",
      "• Due to high oil costs, Jordan has shown increased interest in exploiting its oil shale resources, estimated at approximately 40 billion tons, with about 4 billion tons believed recoverable.",
      "• Jordan's oil shale could produce around 28 billion barrels (4.5 km³) of oil, enabling an estimated production of about 100,000 barrels per day (16,000 m³/d).",
      "• Jordan possesses the fourth largest oil shale reserves in the world, with several companies negotiating with the government for exploitation, including Royal Dutch Shell, Petrobras, and Eesti Energia.",
      "• Natural gas usage is increasing for domestic energy needs, especially electricity generation, with modest reserves estimated at about 6 billion cubic meters in 2002, though recent estimates suggest higher reserves.",
      "• In 2003, Jordan produced and consumed approximately 390 million cubic meters of natural gas, primarily from the Risha gas field in the eastern part of the country.",
      "• Until the early 2010s, Jordan imported most of its natural gas via the Arab Gas Pipeline from Egypt, which supplied about 1 billion cubic meters annually, linking from the Al Arish terminal through Aqaba to northern Jordan.",
      "• Gas imports from Egypt were halted in 2013 due to insurgent activities in Sinai and domestic gas shortages in Egypt.",
      "• To compensate, Jordan built a liquefied natural gas (LNG) terminal at the Port of Aqaba to facilitate imports.",
      "• In 2017, a low-capacity pipeline from Israel was completed, supplying the Arab Potash factories near the Dead Sea.",
      "• As of 2018, a large-capacity pipeline from Israel under construction in northern Jordan is expected to begin operation by 2020, supplying approximately 3 billion cubic meters (BCM) of gas annually, covering most of Jordan's natural gas needs.",
      "• The National Electric Power Company (NEPCO), a state-owned entity, produces approximately 94% of Jordan's electricity.",
      "• Since the mid-2000s, privatization efforts have aimed to increase independent power generation, including a new 450 MW power plant near Amman operated by a Belgian firm.",
      "• Major power plants include Az Zarqa (400 MW) and Al Aqaba (650 MW), which are primary electricity providers.",
      "• In 2003, Jordan consumed nearly 8 billion kilowatt-hours (kWh) of electricity, producing 7.5 billion kWh, with production increasing to 8.7 billion kWh in 2004.",
      "• Electricity demand is projected to grow annually by about 5%, necessitating continued expansion of production capacity.",
      "• Approximately 99% of the Jordanian population has access to electricity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:41.090079",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4880,
      "bullet_points_count": 29
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.10",
    "section_name": "Transport",
    "text": "The transportation sector on average contributes some 10% to Jordan's GDP,\nwith transportation and communications accounting for $2.14bn in 2007. Well\naware of the sector's importance to the country's service and industry-\noriented economy, in 2008 the government formulated a new national transport\nstrategy with the aim to improve, modernise and further privatise the sector.\nWith no imminent solution to the ongoing security crisis in Iraq in sight,\nprospects for the Jordanian transport sector as a whole look bright. The\ncountry will arguably remain one of the major transit points for both goods\nand people destined for Iraq, while the number of tourists visiting Jordan is\nset to continue to increase. The main events to follow in the near future are\nthe relocation of Aqaba's main port, a national railway system, and the\nconstruction of a new terminal at QAIA. Volatility in fuel prices is almost\ncertainly going to have negative effects on operational costs and as such may\nhamper the sector's average annual growth of around 6%. However, uncertain\nfuel prices also offer a great deal of incentive to boost private investments\nin alternative modes of transport such as public buses and improved trains.",
    "openai_summarised_points": [
      "• The transportation sector in Jordan contributes approximately 10% to the country's Gross Domestic Product (GDP).",
      "• In 2007, transportation and communications sectors collectively accounted for $2.14 billion.",
      "• Recognizing the sector's critical role in Jordan's service and industry-oriented economy, the government formulated a new national transport strategy in 2008 aimed at improving, modernizing, and further privatizing the sector.",
      "• Due to the ongoing security crisis in Iraq, with no immediate solution in sight, the prospects for Jordan's transport sector remain positive.",
      "• Jordan is expected to continue serving as a major transit hub for both goods and people destined for Iraq.",
      "• The number of tourists visiting Jordan is projected to increase steadily.",
      "• Key upcoming developments in Jordan’s transport infrastructure include the relocation of Aqaba's main port, the development of a national railway system, and the construction of a new terminal at Queen Alia International Airport (QAIA).",
      "• Volatility in fuel prices is almost certain to negatively impact operational costs within the sector, potentially hindering the sector’s average annual growth rate of around 6%.",
      "• Despite the risks associated with fluctuating fuel prices, such volatility provides incentives to boost private investments in alternative transportation modes, such as public buses and improved train services."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:54:45.280482",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1212,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.11",
    "section_name": "Media and advertising",
    "text": "Although the state remains a major influence, Jordan's media sector has seen\nsignificant privatisation and liberalisation efforts in recent years. Based on\nofficial rack rates, research firm Ipsos estimated that the advertisement\nsector spent some $280m towards publicity in Jordan's media, 80% of which was\nspent on newspapers, followed by TV, radio and magazines. The biggest event of\n2007 was the cancelled launch of ATV, the kingdom's first private broadcaster.\nAs a result, the state-owned Jordan TV (JTV) remains the country's sole\nbroadcaster. In recent years, Jordan has also seen a spectacular rise in the\nnumber of blogs, websites and news portals as sources of news information. The\nincreasing diversification of Jordan's media is a good sign and should boost\nadvertising revenues and private initiatives.\n\nRecording growth of 30%, 2007 turned out to be yet another outstanding year\nfor Jordan's advertising industry. Following nearly a decade of double-digit\ngrowth, however, most publicity specialists expect to see a relative slowdown\nin 2008. Unlike 2007, no major campaigns were planned for the first part of\n2008. Additionally, the Jordanian advertising had some catching up to do with\nthe rest of the region in terms of average expenditure per capita. As the\nsector matures, it is only normal for growth figures to gradually decrease.\nSince 2000 total ad spend increased from $77m to $280m in 2007, an increase of\n260%. The Jordanian telecoms sector was the biggest ad spender in 2007,\naccounting for around 20% of the market, followed by the banking and finance\nsector (12%), services industry (11%), real estate (8%) and the automotive\nsector (5%). In the next year, particularly if there is a downturn, it would\nbecome increasingly important for the sector to develop good vocational\ntraining and to begin to take advantage of new media markets."
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.12",
    "section_name": "Services",
    "text": "Services accounted for more than 70% of gross domestic product (GDP) in 2004.\nThe sector employed nearly 75% of the labor force in 2002.\n\nJordan's banking system consists of 25 commercial banks, three Islamic banks,\nand nine foreign banks, with total assets of Jordanian dinar, JOD 57 billion\n(or EUR69.6 billion). Between 2010 and 2020, the sector's total assets climbed\nby 5% on average, led by a 7% increase in lending.\n\nThe banking sector is widely regarded as advanced in both regional and\ninternational terms. In 2007, total profits of the 15 listed banks rose 14.89%\nto JD640m ($909m). Jordan's strong growth of 6% in 2007 was reflected in a\n20.57% expansion in net credit to JD17.9bn ($25.4bn) by the end of the year.\nThe most improvement was in trade, construction and industry. Many banks\nsuffered from the sharp correction in the Amman Stock Market in 2006,\nencouraging them to focus on core banking business in 2007, and this was\nreflected in a 16.65% rise in net interest and commission income to JD1.32bn\n($1.87bn). The stock market also picked up in 2007 and total portfolio income\nlosses decreased. Although Jordan's banking sector is small by global\nstandards, it has attracted strong interest from regional investors in Lebanon\nand the GCC. New regulations introduced by the CBJ, in addition to political\nstability, have helped to create a favourable investment environment. Its\nconservative policies helped Jordan avoid the 2008 financial crisis, Jordanian\nbanks was one of the only countries that posted a profit in 2009.\n\nBanking sector profitability was momentarily impacted (in 2020) by the\nCOVID-19-induced economic downturn, but it already recovered to pre-COVID-19\nlevels in 2021. The Jordanian banking sector's non-performing loan (NPL) ratio\nremained at 5.5% during the COVID-19 pandemic. According to a survey conducted\nin 2021, the pandemic's impact on credit supply in Jordan has been quite\nlimited, with two-thirds of the banks surveyed indicating a constant or\ngrowing availability of loans. 50% of banks also reported an increase to loan\nsupply for SMEs. For corporates, the increase was 25%.\n\n90% of Banks believed that the pandemic will also affect the digitization of\ninternal processes. 81% believed that banks' daily operations will be impacted\nand 90% believed that banks' online offerings will be improved.\n\nContributing an estimated JD477.5m ($678.05m), or 4.25% of Jordan's GDP,\naccording to figures from the Central Bank, the construction sector performed\nstrongly in 2007. The Great Amman Municipality (GAM) completed its master plan\nfor the capital, which is expected to grow from 700 km2 today to 1700 km2 by\n2025. Amman is changing from a predominantly horizontal to a largely vertical\ncity due to various clusters of high-rises. Significant developments outside\nAmman include the rapid residential build-up of Zarqa, the transformation of\nAqaba into a commercial and tourist centre, and the construction of a series\nof high-end hotels and tourist resorts along the Dead Sea. A new airport\nterminal, Amman ring road and a light rail between the capital and Zarqa are\nbeing constructed.\n\nDespite recording a relative slowdown compared to the expansion of recent\nyears, Jordan's construction and real estate market continued to grow in 2007.\nTrading totaled JD5.6bn ($8bn), up from JD5.2bn ($7.4bn) in 2006, according to\nJordan's Land and Survey Department. Although the years of astounding\ngrowth—some 75% in 2004 and 48% in 2005—seem to have passed, the future looks\nbright for real estate, as demand continues to outstrip supply, while Jordan\nremains a very attractive investment destination for foreign businesses,\nsecond-home buyers and Jordanians working abroad. With Jordan's continuing\nsharp population growth, as well as its strategic location at the heart of the\nMiddle East, the kingdom's main market drivers indicate a bright future for\nyears to come. Although a number of class-A office space developments are\ncurrently under construction, it would take a few years to close the gap\nbetween demand and supply. The Amman retail market may become more saturated\nin the short term. Consequently, developers may turn to other cities to build\nsupermarkets and malls.\n\nJordan's insurance market, with 29 companies operating in a country of just\n5.7 million people, is saturated, despite regulatory encouragements for\nmergers and acquisitions. In terms of market share based on premiums, motor\ncoverage accounts for 42.4%, medical insurance 18.6%, fire and property damage\n17%, life 9.8%, marine and transport 7.9% and other insurance the remaining\n4.3%. The insurance sector made up 2.52% of GDP in 2006, up from 2.43% in\n2005. Current plans call for increasing the sector's GDP contribution to 7% in\nthe short term and 10% in the long term. The sector holds great potential but\nremains underdeveloped. Region-wide price increases and a lack of consumer\nunderstanding of products are two major challenges. In addition, cultural\nconsiderations, including religion, make improving market penetration\ndifficult. The cost of living has also risen, and the IMF forecasts that the\ninflation rate would reach 9% in 2008. Salaries have remained unchanged,\nhowever, leaving consumers with less disposable income. Other than mandatory\nmotor coverage, insurance products are considered a luxury by average\nJordanians, who must often prioritise spending. There would likely only be a\nfew changes to the market in the coming year. Members of the sector would like\nto see greater coordination among the regulators and those working for the\nkingdom's legal system in order to improve insurance laws."
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "2.13",
    "section_name": "Tourism",
    "text": "The state of the tourism sector is widely regarded as below potential,\nespecially given the country's rich history, ancient ruins, Mediterranean\nclimate, and diverse geography. Despite personal appeals by the king and an\nincreasingly sophisticated marketing campaign, the industry is still adversely\naffected by the political instability of the region. More than 5 million\nvisitors entered Jordan in 2004, generating US$1.3 billion in earnings.\nEarnings from tourism rose to US$1.4 billion in 2005. The fact that the bulk\nof Jordan's tourist trade emanates from elsewhere in the Middle East should\ncontribute to the industry's growth potential in the years ahead, as Jordan is\nrelatively stable, open, and safe in comparison to many of its neighbors. The\ntourism sector remains an important element of the Jordanian economy, directly\nemploying some 30,000 Jordanians and contributing 10% to the kingdom's GDP.\nDespite a decline in Arab and Gulf visitors, 2007 marked a year of steady\ngrowth for the tourism sector. Revenues jumped 13% to nearly $2.11bn during\nthe first 11 months, up from $1.86bn for the same period in 2006. The sector\nis overseen by the government's National Tourism Strategy (NTS), which was\nestablished in 2004 to take the industry through 2010. NTS aimed to double\ntourism revenues during the period and to increase tourism-related jobs to\n91,719. The first goal has already been met but the second one might be more\nof a challenge: between 2004 and 2007 the total number of people employed in\nthe sector rose from 23,544 to 35,484. This is impressive growth, but less\nthan half the 90,000-or-more goal. NTS hopes to place Jordan as a boutique\ndestination for high-end tourists. The strategy identifies seven priorities or\nniche markets: cultural heritage (archaeology); religion; ecotourism; health\nand wellness; adventure; meetings, incentives, conventions and exhibitions\n(MICE); and cruises. The Jordan Tourism Board's (JTB) marketing budget has\nincreased in the past year from JD6m ($8.52m) to JD11.5m ($16.3m). These are\npositive times for tourism in Jordan, with steady growth and major projects in\nthe pipeline. The sector has to make improvements in infrastructure and\nmarketing, but overall the industry has been improving for the past several\nyears.\n\nJordan's real GDP fell by 1.6% in 2020, with a dramatic reduction in tourism—a\ncrucial economic sector—being one of the primary transmission routes of the\ncrisis. Tourism provides for about 40% of Jordan's export receipts and 10–15%\nof GDP, with 3.8 million international tourists every year. The sector's GDP\nshare fell to 3% in 2020, and the recovery from the COVID-19 pandemic is\nlikely to be slow."
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "External trade",
    "text": "Jordanian exports in 2006\n\nSince 1995, economic growth has been low. Real GDP has grown at only about\n1.5% annually, while the official unemployment has hovered at 14% (unofficial\nestimates are double this number). The budget deficit and public debt have\nremained high and continue to widen, yet during this period inflation has\nremained low due mainly to stable monetary policy and the continued peg to the\nUnited States Dollar. Exports of manufactured goods have risen at an annual\nrate of 9%. Monetary stability has been reinforced, even when tensions were\nrenewed in the region during 1998, and during the illness and ultimate death\nof King Hussein in 1999.\n\nExpectations of increased trade and tourism as a consequence of Jordan's peace\ntreaty with Israel have been disappointing. Security-related restrictions to\ntrade with the West Bank and the Gaza Strip have led to a substantial decline\nin Jordan's exports there. Following his ascension, King Abdullah improved\nrelations with Arabic states of the Persian Gulf and Syria, but this brought\nfew real economic benefits. Most recently the Jordanians have focused on WTO\nmembership and a Free Trade Agreement with the U.S. as means to encourage\nexport-led growth."
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Investment",
    "text": "The stock market capitalisation of listed companies in Jordan was valued at\n$37.639 billion in 2005 by the World Bank."
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Salaries",
    "text": "According to the 2015 Middle East and North Africa Salary Survey conducted by\nBayt.com, Respondents from GCC (49%) seem somewhat happier with the raise they\nreceived in 2014, as compared to respondents from Levant (42%):"
  },
  {
    "chapter_name": "Economy of Jordan",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Aqaba Special Economic Zone",
    "text": "The population of Aqaba is only 100,000 people and is set to double over the\nnext 10 years. The town benefits from some natural advantages. Located at the\nsouthern tip of the country, between Saudi Arabia and Israel on the shores of\nthe Red Sea, the city is close to the Suez Canal, with easy access to key\ntrade centres in both the Middle East and Africa. Aqaba is also the kingdom's\nonly deep-water port town, taking up most of Jordan's scant 27 km (17 mi) of\ncoastline. The Aqaba Special Economic Zone (ASEZ) has been responsible for\nmost of this development since it opened in 2001.\n\nIt covers 375 km2 and offers tax and tariff incentives, as well as full\nrepatriation rights and more flexible operating regulations. There is a 5%\nflat tax on most economic activities, no tariffs on imported goods, no\ncurrency restrictions and no property taxes for corporate land. Additionally –\nand somewhat controversially, given Jordan's past issues with unemployment –\ncompanies based in ASEZ are allowed to employ up to 70% foreign workers in\ntheir operations. Jordan's investment profile has been growing nationally, but\naccording to the Jordan Investment Board (JIB), the ASEZ has exceeded\ninvestment targets by 33%. By 2006 it had already brought in around $8bn in\ninvestment, some $2bn more than the original target of $6bn by 2020. ASEZ\nexpects to attract a further $12bn spread across a number of sectors,\nincluding tourism, finance and industry. The Development Law of 2008 set in\nplace a universal framework for special development areas based on the Aqaba\nmodel."
  }
]