[
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. The reason given is: Some statistics\nin the infobox are outdated. Please help update this article to reflect recent\nevents or newly available information. _( May 2025)_  \n---|---  \n  \nThe **economy of Belgium** is a highly developed, high-income, mixed economy.\n\nBelgium's economy has capitalised on the country's central geographic\nlocation, and has a well-developed transport network, and diversified\nindustrial and commercial base. Belgium was the first European country to join\nthe Industrial Revolution in the early 19th century. It has since developed a\nhighly-developed transportation infrastructure made up of ports (most notably\nthe Port of Antwerp), canals, railways, and highways, in order to integrate\nits industry with that of its neighbours. Among OECD nations, Belgium has a\nhighly efficient and strong social security system; social expenditure stood\nat roughly 29% of GDP.\n\nBelgium's industry is concentrated mainly in the populous region of Flanders\nin the north, around Brussels and in the two biggest Walloon cities, Liège and\nCharleroi, along the _Sillon industriel_. Belgium imports raw materials and\nsemi-finished goods that are further processed and re-exported. Except for its\ncoal, which is no longer economical to exploit, Belgium has few natural\nresources other than fertile soils. Despite the heavy industrial component,\nservices dominate the country's economy and account for 77.2% of Belgium's\ngross domestic product (GDP), while agriculture accounts for 0.7%.\n\nWith exports equivalent to over two-thirds of the country's gross national\nincome (GNI), Belgium depends heavily on world trade. Belgium's trade\nadvantages are derived from its central geographic location and a highly\nskilled, multilingual, and productive work force. One of the founding members\nof the European Community, Belgium strongly supports deepening the powers of\nthe present-day European Union (EU) to integrate European economies further.\nAbout three-quarters of its trade is with other EU countries. In 2021,\nBelgium's public debt was about 108% of the country's gross domestic product\n(GDP).",
    "openai_summarised_points": [
      "• The article on the economy of Belgium requires updating as of May 2025 due to outdated statistics in the infobox, indicating a need for revision to reflect recent events or newly available information.",
      "• The economy of Belgium is characterized as highly developed, high-income, and of a mixed economic structure.",
      "• Belgium's economic strength is partly attributed to its strategic central geographic location in Europe, facilitating trade and industrial integration.",
      "• The country boasts a well-developed transport network, including ports (notably the Port of Antwerp), canals, railways, and highways, designed to connect its industry with neighboring countries.",
      "• Belgium was the first European nation to join the Industrial Revolution in the early 19th century, marking its early industrialization.",
      "• The country has developed a highly efficient and robust social security system, with social expenditure constituting approximately 29% of its GDP.",
      "• Industrial activity is primarily concentrated in the populous Flanders region in the north, around Brussels, and in the major Walloon cities of Liège and Charleroi, along the _Sillon industriel_ (industrial belt).",
      "• Belgium imports raw materials and semi-finished goods, which are processed domestically and then re-exported, indicating a significant role in global supply chains.",
      "• Natural resources are limited; aside from fertile soils, Belgium's natural resource base is minimal, with coal being the only resource previously exploited but now considered uneconomical to extract.",
      "• Despite a substantial industrial sector, services dominate Belgium's economy, accounting for 77.2% of gross domestic product (GDP), while agriculture contributes only 0.7%.",
      "• The country’s trade is heavily reliant on international markets, with exports representing over two-thirds of its gross national income (GNI), underscoring its dependence on global trade.",
      "• Belgium’s trade advantages include its central geographic position and a highly skilled, multilingual, and productive workforce.",
      "• As a founding member of the European Community, Belgium advocates for deepening the powers of the European Union to further integrate European economies.",
      "• Approximately 75% of Belgium’s trade occurs with other EU countries, highlighting its strong economic ties within the European Union.",
      "• In 2021, Belgium’s public debt was approximately 108% of its gross domestic product (GDP), indicating a high level of government debt relative to its economic output."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:14.964225",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2137,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "In the twentieth century",
    "text": "Evolution of the Belgian GDP\n\nFor 50 years through World War II, French-speaking Wallonia was a technically\nadvanced, industrial region, with its industry concentrated along the sillon\nindustriel, while Dutch-speaking Flanders was predominantly agricultural with\nsome industry, mainly processing agricultural products and textiles. This\ndisparity began to fade during the interwar period. When Belgium emerged from\nWorld War II with its industrial infrastructure relatively undamaged thanks to\nthe Galopin doctrine, the stage was set for a period of rapid development,\nparticularly in Flanders. The postwar boom years, enhanced by the\nestablishment of the European Union and NATO headquarters in Brussels,\ncontributed to the rapid expansion of light industry throughout most of\nFlanders, particularly along a corridor stretching between Brussels and\nAntwerp, which is the second largest port in Europe after Rotterdam.\n\nForeign investment contributed significantly to Belgian economic growth in the\n1960s. In particular, U.S. firms played a leading role in the expansion of\nlight industrial and petrochemical industries in the 1960s and 1970s.\n\nThe older, traditional industries of Wallonia, particularly the steel\nindustry, began to lose their competitive edge during this period, but the\ngeneral growth of world prosperity masked this deterioration until the 1973\nand 1979 oil price shocks and resultant shifts in international demand sent\nthe economy into a period of prolonged recession. In the 1980s and 1990s, the\neconomic center of the country continued to shift northwards to Flanders with\ninvestments by multinationals (automotive industry, chemical industry) and\ngrowing local industrial agriculture (for textiles and food).\n\nThe early 1980s saw the country facing a difficult period of structural\nadjustment caused by declining demand for its traditional products,\ndeteriorating economic performance, and neglected structural reform.\nConsequently, the 1980–82 recession shook Belgium to the core—unemployment\nmounted, social welfare costs increased, personal debt soared, the government\ndeficit climbed to 13% of GDP, and the national debt, although mostly held\ndomestically, mushroomed.\n\nAgainst this grim backdrop, in 1982, Prime Minister Martens' center-right\ncoalition government formulated an economic recovery program to promote\nexport-led growth by enhancing the competitiveness of Belgium's export\nindustries through an 8.5% devaluation. Economic growth rose from 2% in 1984\nto a peak of 4% in 1989. In May 1990, the government linked the Belgian franc\nto the Deutsche Mark, primarily through closely tracking German interest\nrates. Consequently, as German interest rates rose after 1990, Belgian rates\nhave increased and contributed to a decline in the economic growth rate. In\n1992–93, the Belgian economy suffered the worst recession since World War II,\nwith the real GDP declining 0.96% in 1993.\n\nOn 1 May 1998, Belgium became a first-tier member of the European Monetary\nUnion.",
    "openai_summarised_points": [
      "• For approximately 50 years leading up to World War II, the Belgian economy was characterized by a regional disparity: French-speaking Wallonia was a highly advanced industrial region concentrated along the sillon industriel, while Dutch-speaking Flanders was predominantly agricultural with some industry focused on processing agricultural products and textiles.",
      "• During the interwar period, this regional disparity began to diminish as economic development and industrialization efforts increased in Flanders.",
      "• Belgium emerged from World War II with its industrial infrastructure largely intact, thanks to the Galopin doctrine, which contributed to a favorable postwar recovery environment.",
      "• The postwar economic boom was significantly bolstered by the establishment of the European Union and NATO headquarters in Brussels, which stimulated economic activity.",
      "• The boom years led to rapid expansion of light industry across most of Flanders, especially along a corridor between Brussels and Antwerp, the latter being the second largest port in Europe after Rotterdam.",
      "• In the 1960s, foreign investment played a crucial role in Belgian economic growth, with U.S. firms leading the expansion of light industrial and petrochemical industries during the 1960s and 1970s.",
      "• Traditional industries in Wallonia, notably the steel industry, began to decline in competitiveness during this period; however, this decline was masked by overall global prosperity until the oil price shocks of 1973 and 1979.",
      "• The 1973 and 1979 oil crises triggered shifts in international demand, leading to a prolonged recession in Belgium.",
      "• During the 1980s and 1990s, the economic focus continued shifting northward to Flanders, driven by investments from multinationals in the automotive and chemical industries, as well as growing local industrial agriculture for textiles and food production.",
      "• The early 1980s marked a difficult period of structural adjustment for Belgium, characterized by declining demand for traditional products, deteriorating economic performance, and neglect of structural reforms.",
      "• The 1980–82 recession severely impacted Belgium, resulting in rising unemployment, increased social welfare costs, soaring personal debt, a government deficit reaching 13% of GDP, and a growing national debt, which was mostly domestically held.",
      "• In response, Prime Minister Martens' center-right coalition government introduced an economic recovery program in 1982 aimed at promoting export-led growth through an 8.5% devaluation of the Belgian franc.",
      "• Between 1984 and 1989, economic growth improved, rising from 2% to a peak of 4%.",
      "• In May 1990, Belgium linked its currency, the Belgian franc, to the Deutsche Mark, primarily by closely tracking German interest rates, which led to increased Belgian interest rates as German rates rose.",
      "• The linkage to the Deutsche Mark contributed to a slowdown in Belgium’s economic growth rate after 1990.",
      "• During 1992–93, Belgium experienced its worst recession since World War II, with real GDP declining by 0.96% in 1993.",
      "• On 1 May 1998, Belgium became a first-tier member of the European Monetary Union, integrating more closely into the European economic framework."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:25.718244",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3001,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "In the twenty-first century",
    "text": "Belgium switched from the Belgian franc to the Euro as its currency after 1\nJanuary 2002. Belgian per capita GDP ranks among the world's highest. In 2008,\nthe per capita income (PPP) was $37,500. The federal government has not\nmanaged to present balanced budgets in recent years and public debt remains\nhigh, at 99% of 2009 GDP.[_citation needed_] In 2009, during the Great\nRecession, Belgium suffered negative growth and increased unemployment. GDP\ngrowth in 2009 was −1.5%.",
    "openai_summarised_points": [
      "• Belgium transitioned from the Belgian franc to the Euro as its official currency after 1 January 2002.",
      "• Belgian per capita GDP ranks among the highest in the world, indicating a high standard of living.",
      "• In 2008, Belgium's per capita income measured by purchasing power parity (PPP) was $37,500.",
      "• The federal government of Belgium has struggled to present balanced budgets in recent years, indicating fiscal challenges.",
      "• Public debt in Belgium remained high at 99% of the country's GDP in 2009.",
      "• During the Great Recession in 2009, Belgium experienced negative economic growth, with a GDP contraction of −1.5%.",
      "• The recession also led to an increase in unemployment rates within Belgium during that period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:29.198762",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 475,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Trade unions",
    "text": "With 65% of the workers belonging to a union, Belgium is a country with one of\nthe highest percentages of trade union membership. Only the Scandinavian\ncountries have a higher trade union density. The biggest union with around 1.7\nmillion members is the Christian democrat Confederation of Christian Trade\nUnions (ACV-CSC) which was founded in 1904. The origins of the union can be\ntraced back to the \"Anti-Socialist Cotton Workers Union\" that was founded in\n1886. The second biggest union is the socialist General Federation of Belgian\nLabour (ABVV-FGTB) which has a membership of more than 1.5 million. The ABVV-\nFGTB traces its origins to 1857, when the first Belgian union was founded in\nGhent by a group of weavers. This and other socialist unions became unified\naround 1898. The ABVV-FGTB in its current form dates back to 1945. The third\nmajor multi-sector union in Belgium is the liberal (classical liberal) union\nGeneral Confederation of Liberal Trade Unions of Belgium (ACLVB-CGSLB) which\nis relatively small in comparison to the first two with a little under 290\nthousand members. The ACLVB-CGSLB was founded in 1920 in an effort to unite\nthe many small liberal unions. Back then the liberal union was known as the\n\"Nationale Centrale der Liberale Vakbonden van België\". In 1930, the ACLVB-\nCGSLB adopted its current name.\n\nBesides these \"big three\" there are a number of smaller unions, some more\ninfluential than others. These smaller unions tend to specialize in one\nprofession or economic sector. Next to these specialized unions there is also\nthe Neutral and Independent Union that rejects the pillarization of the \"big\nthree\" trade unions (their affiliation with political parties). There is also\na small Flemish nationalist union that exists only in the Flemish-speaking\npart of Belgium, called the Vlaamse Solidaire Vakbond. The last Belgian union\nworth mentioning is the very small, but highly active anarchist union called\nthe Vrije Bond.",
    "openai_summarised_points": [
      "• Belgium has a high trade union membership rate, with 65% of workers belonging to a union, making it one of the countries with the highest union density globally.",
      "• Only Scandinavian countries surpass Belgium in trade union density, indicating a strong tradition of unionization in the country.",
      "• The largest trade union in Belgium is the Christian democrat Confederation of Christian Trade Unions (ACV-CSC), which has approximately 1.7 million members.",
      "• The ACV-CSC was founded in 1904, with its origins traceable to the \"Anti-Socialist Cotton Workers Union\" established in 1886.",
      "• The second largest union is the socialist General Federation of Belgian Labour (ABVV-FGTB), which has over 1.5 million members.",
      "• The ABVV-FGTB traces its origins back to 1857, when the first Belgian union was founded in Ghent by a group of weavers.",
      "• The socialist unions, including the ABVV-FGTB, unified around 1898, and the federation in its current form has existed since 1945.",
      "• The third major multi-sector union is the liberal (classical liberal) General Confederation of Liberal Trade Unions of Belgium (ACLVB-CGSLB), which has just under 290,000 members, making it significantly smaller than the first two.",
      "• The ACLVB-CGSLB was founded in 1920 to unify numerous small liberal unions, initially known as the \"Nationale Centrale der Liberale Vakbonden van België.\"",
      "• In 1930, the union adopted its current name, ACLVB-CGSLB.",
      "• Beyond the \"big three\" unions, Belgium hosts several smaller unions, some with more influence than others, often specializing in specific professions or economic sectors.",
      "• There exists a Neutral and Independent Union that opposes the pillarization (political party affiliation) of the major unions (\"big three\").",
      "• A small Flemish nationalist union, the Vlaamse Solidaire Vakbond, operates exclusively in the Flemish-speaking region of Belgium.",
      "• The Vrije Bond is a very small but highly active anarchist union in Belgium."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:36.673519",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1959,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Trade",
    "text": "About 80% of Belgium's trade is with fellow EU member states. Given this high\npercentage, it seeks to diversify and expand trade opportunities with non-EU\ncountries. The Belgian authorities are, as a rule, anti-protectionist and try\nto maintain a hospitable and open trade and investment climate. The European\nCommission negotiates on trade issues for all member states, which, in turn\nlessens bilateral trade disputes with Belgium.\n\nThe Belgian Government encourages new foreign investment as a means to promote\nemployment. With regional devolution, Flanders, Brussels, and Wallonia are now\ncourting potential foreign investors and offer a host of incentives and\nbenefits. Foreign companies in Belgium account for approximately 11% of the\ntotal work force, with the U.S.\n\nAttracted by the EU 1992 single-market program, many foreign firms and lawyers\nhave settled in Brussels since 1989.",
    "openai_summarised_points": [
      "• Approximately 80% of Belgium's trade is conducted with other European Union (EU) member states, reflecting a high level of regional economic integration.",
      "• Belgium actively seeks to diversify and expand its international trade relationships beyond the EU to include non-EU countries, aiming to reduce dependency on intra-EU trade.",
      "• Belgian authorities generally adopt an anti-protectionist stance, striving to maintain a trade and investment environment that is open and welcoming to foreign businesses.",
      "• The European Commission handles trade negotiations on behalf of all EU member states, which helps to reduce bilateral trade disputes involving Belgium by presenting a unified front in international trade negotiations.",
      "• The Belgian government promotes foreign direct investment (FDI) as a strategy to stimulate employment across the country.",
      "• With the process of regional devolution, the regions of Flanders, Brussels, and Wallonia actively compete to attract foreign investors by offering various incentives and benefits tailored to encourage international investment.",
      "• Foreign companies operating in Belgium constitute approximately 11% of the total workforce, indicating a significant foreign presence in the Belgian labor market.",
      "• The United States is notably active in Belgium’s foreign investment landscape, reflecting strong economic ties.",
      "• The attraction of foreign firms and legal professionals to Brussels has been significantly influenced by the European Union’s 1992 single-market program, which has led many foreign entities and legal practitioners to establish a presence in Brussels since 1989."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:40.667210",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 888,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Employment",
    "text": "The social security system, which expanded rapidly during the prosperous 1950s\nand 1960s, includes a medical system, unemployment insurance coverage, child\nallowances, invalid benefits, and other benefits and pensions. With the onset\nof a recession in the 1970s, this system became an increasing burden on the\neconomy and accounted for much of the government budget deficits. The national\nunemployment figures mask considerable differences between Flanders and\nWallonia. Unemployment in Wallonia is mainly structural, while in Flanders it\nis cyclical. Flanders' unemployment levels are generally only about half those\nof Walloon. The southern region continues a difficult transition out of sunset\nindustries (mainly coal and steel), while sunrise industries (chemicals, high-\ntech, and services) dominate in Flanders.\n\nBelgium's unemployment rate was 6.5% in 2008. A total of 4.99 million people\nmake up Belgium's labor force. The vast majority of these people (80%), work\nin the service sector. The Belgian Industry claims 19% of the labor force; and\nagriculture claims 1%. As in other industrialized nations, pension and other\nsocial entitlement programs have become a major economic and political concern\nas the baby boomers approach retirement age.",
    "openai_summarised_points": [
      "• The social security system in Belgium expanded rapidly during the prosperous decades of the 1950s and 1960s, encompassing a broad range of benefits including medical care, unemployment insurance, child allowances, invalid benefits, pensions, and other social benefits.",
      "• During the economic recession of the 1970s, the social security system increasingly burdened the Belgian economy and was a significant contributor to government budget deficits.",
      "• The national unemployment rate in Belgium was 6.5% in 2008.",
      "• The total labor force in Belgium comprised approximately 4.99 million people.",
      "• The majority of the Belgian labor force, about 80%, is employed in the service sector.",
      "• The industrial sector accounts for 19% of the labor force, while agriculture employs about 1%.",
      "• Unemployment in Belgium exhibits regional disparities: in Wallonia, unemployment is primarily structural, reflecting long-term economic shifts, whereas in Flanders, it is mainly cyclical, fluctuating with economic cycles.",
      "• Flanders' unemployment levels are generally about half those of Wallonia, indicating a significant regional difference in employment conditions.",
      "• The southern region of Belgium (Wallonia) is undergoing a challenging transition from sunset industries such as coal and steel, which are in decline.",
      "• Conversely, Flanders is experiencing growth in sunrise industries, notably chemicals, high-tech sectors, and services.",
      "• As in other industrialized nations, pension and social entitlement programs in Belgium have become major economic and political concerns, especially as the baby boomer generation approaches retirement age."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:47.219291",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1252,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Budget",
    "text": "Evolution of the Belgian public debt as % of Belgian GDP\n\nAlthough Belgium is a wealthy country, public expenditures far exceeded income\nfor many years, and taxes were not diligently pursued. The Belgian Government\nreacted to the 1973 and 1979 oil price hikes by hiring the redundant work\nforce into the public sector and subsidizing industries like coal, steel,\ntextiles, glass, and shipbuilding, which had lost their international\ncompetitive edge. As a result, cumulative government debt reached 121% of GDP\nby the end of the 1980s. However, thanks to Belgium's high personal savings\nrate, the Belgian Government financed the deficit from mainly domestic\nsavings, minimizing the deleterious effects on the overall economy.\n\nThe federal government ran a 7.1% budget deficit in 1992 at the time of the\nEU's Treaty of Maastricht, which established conditions for Economic and\nMonetary Union (EMU) that led to adoption of the common Euro currency on 1\nJanuary 2002. Among other criteria spelled out under the Maastricht treaty,\nthe Belgian Government had to attain a budget deficit of no greater than 3% of\nGDP by the end of 1997; Belgium achieved this, with a total budget deficit in\n2001 (just prior to implementation of the Euro) that amounted to 0.2% of GDP.\nThe government has balanced the budget every year since, until 2009 where it\nran a deficit of about $25 billion. Belgium's accumulated public debt remains\nhigh at 99% of 2009 GDP. A slight decrease in the accumulated public debt\ncompared to GDP has been seen, however, thanks to a higher economic growth\nrate compared to the budget growth rate, which pushed the percentage from 99%\nof GDP in 2009 to 95% of GDP in 2011, a four-point decrease in two years, a\nfeat rare enough to mention in the Western World.",
    "openai_summarised_points": [
      "• Despite Belgium's wealth, public expenditures significantly exceeded income for many years, and tax collection was not diligently enforced.",
      "• The Belgian government responded to the 1973 and 1979 oil price hikes by increasing public sector employment and subsidizing industries such as coal, steel, textiles, glass, and shipbuilding, which had lost their international competitiveness.",
      "• As a result of these policies, Belgium's cumulative government debt reached 121% of GDP by the end of the 1980s.",
      "• Belgium's high personal savings rate allowed the government to finance the deficit primarily through domestic savings, thereby minimizing adverse effects on the overall economy.",
      "• In 1992, the federal government ran a budget deficit of 7.1%, coinciding with the EU's Treaty of Maastricht, which established conditions for the Economic and Monetary Union (EMU).",
      "• The Maastricht treaty required member states to attain a budget deficit of no more than 3% of GDP by the end of 1997; Belgium achieved this target.",
      "• In 2001, just prior to the Euro's adoption, Belgium's total budget deficit was only 0.2% of GDP.",
      "• Since the Euro's implementation, Belgium has maintained a balanced budget every year until 2009, when it ran a deficit of approximately $25 billion.",
      "• Belgium's accumulated public debt remained high at 99% of GDP in 2009.",
      "• A slight decrease in the public debt-to-GDP ratio was observed, dropping from 99% in 2009 to 95% in 2011, due to higher economic growth rates outpacing budget growth.",
      "• This 4-point reduction over two years is considered a rare achievement in the Western world."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:52.135656",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1769,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Regional differences",
    "text": "The economy of Belgium is varied and cannot be understood without taking the\nregional differences into account. Indeed, the Flemish and Walloon economies\ndiffer in many respects (consider for instance Eurostat and OECD statistics),\nand cities like Brussels, Antwerp, Liège, Bruges, Charleroi, or Ghent also\nexhibit significant differences. In general, productivity in Flanders is\nroughly 20% higher (per inhabitant) than in Wallonia.[_citation needed_]\nBrussels' GDP per capita is much higher than either region, although this is\nmisleading, as many of those that work in the Brussels-Capital Region live in\nFlanders or Wallonia. Their output is counted in Brussels and not where they\nlive, artificially raising the _per capita_ GDP of Brussels and slightly\nlowering that of Flanders and Wallonia.\n\nUnemployment has remained consistently more than twice as high in Wallonia\nthan in Flanders, and has been even higher in Brussels, during most of the\nlast 20 years (2012: Flanders: 4.55%; Wallonia: 10.12% and Brussels: 17.47%).\n\nGross Domestic Product in Belgium (2022)  Rank  | NUTS region  | Per capita\nin Euros | % of EU average\n---|---|---|---\n1  | Brussels | 69,500  | 196\n2  | Flemish Region | 43,800  | 124\n3  | Walloon Region | 30,700  | 87",
    "openai_summarised_points": [
      "• The economy of Belgium is characterized by significant regional differences that are essential to understanding its overall economic landscape.",
      "• The Flemish and Walloon economies differ markedly in various respects, as evidenced by statistics from Eurostat and the OECD.",
      "• Major cities such as Brussels, Antwerp, Liège, Bruges, Charleroi, and Ghent also display substantial economic disparities.",
      "• On average, productivity per inhabitant in Flanders is approximately 20% higher than in Wallonia.",
      "• The GDP per capita in Brussels is significantly higher than in either Flanders or Wallonia; however, this figure is somewhat misleading due to commuting patterns.",
      "• Many individuals working in the Brussels-Capital Region reside in Flanders or Wallonia, and their output is counted in Brussels’ GDP, which artificially inflates Brussels’ per capita GDP and slightly deflates those of Flanders and Wallonia.",
      "• Unemployment rates have consistently been more than twice as high in Wallonia compared to Flanders over the past 20 years.",
      "• During 2012, unemployment rates were recorded as follows: Flanders at 4.55%, Wallonia at 10.12%, and Brussels at 17.47%.",
      "• In 2022, the Gross Domestic Product (GDP) per capita for the NUTS regions was as follows:"
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:56.129046",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1247,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Brussels",
    "text": "Being the _de facto_ capital of the European Union, its economy is very\nservice-oriented. It has a number of regional headquarters of multinational\ncorporations. It is also host to a great number of European institutions, in\naddition to the Belgian federal government, the government of the Flemish\nCommunity and the government of the French Community. Brussels also has many\ncommuters, with 230,000 coming from Flanders, and 130,000 from Wallonia. Much\nof the success of Brussels is based on the high educational skills of its\nworkforce. As of July 2012, however, the statistical unemployment rate in\nBrussels was 20.6%.",
    "openai_summarised_points": [
      "• Brussels is considered the de facto capital of the European Union, playing a central role in EU affairs.",
      "• The economy of Brussels is predominantly service-oriented, reflecting its role as an administrative and political hub.",
      "• The city hosts numerous regional headquarters of multinational corporations, contributing to its economic landscape.",
      "• Brussels is home to a large number of European institutions, including the European Commission, the European Parliament, and other EU agencies.",
      "• In addition to European institutions, Brussels hosts the Belgian federal government, the government of the Flemish Community, and the government of the French Community.",
      "• The city experiences significant commuter flows, with approximately 230,000 people commuting from Flanders and about 130,000 from Wallonia into Brussels.",
      "• The success of Brussels' economy is largely attributed to the high educational skills of its workforce.",
      "• As of July 2012, the unemployment rate in Brussels was recorded at 20.6%, indicating a relatively high level of unemployment at that time."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:41:59.100285",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 621,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Flanders",
    "text": "The Bevrijdingsdok [nl] container terminal in the port of Antwerp\n\nIn 2004, the port of Antwerp was the second-largest European sea port by cargo\nvolume, and the Antwerp freight railway station accounts for one-third of\nBelgian freight traffic. Antwerp is the first diamond market in the world,\ndiamond exports account for roughly 1/10 of Belgian exports. The Antwerp-based\nBASF plant is the largest BASF-base outside Germany, and accounts on its own\nfor about 2% of Belgian exports. Other industrial and service activities\ninclude car manufacturing, telecommunications, and photographic products.\n\nThe port of Bruges-Zeebrugge is one of the most important, modern and fastest\ngrowing ports in Europe. It is Europe's largest port for RoRo traffic and\nnatural gas. It also is the world's largest port for the import and export of\nnew vehicles. Tourism is also a major component of the economy of Bruges. Due\nto its pristine medieval city centre, Bruges has become a popular tourist\ndestination. Annually about 2.5 million day tourists visit the city and in\n2007 there were about 1.4 million overnight stays.\n\nThe port of Ghent, in the north of the city, is the third-largest port of\nBelgium. It is accessed by the Ghent–Terneuzen Canal, which ends near the\nDutch port of Terneuzen on the Western Scheldt. The port houses, among others,\nbig companies like ArcelorMittal, Volvo Cars, Volvo Trucks, Volvo Parts,\nHonda, and Stora Enso. Ghent University, the second-largest university of\nBelgium by number of students, and a number of research-oriented companies are\nsituated in the central and southern part of the city. Tourism is increasingly\nbecoming a major employer in the local area. Begonias have been cultivated in\nthe Ghent area since 1860. Belgium is the world's largest producer of\nbegonias, planting 60 million tubers per year. Eighty percent of the crop is\nexported.",
    "openai_summarised_points": [
      "• In 2004, the port of Antwerp was the second-largest European seaport by cargo volume, highlighting its significant role in maritime trade within Europe.",
      "• The Antwerp freight railway station is responsible for approximately one-third of all freight traffic in Belgium, underscoring its importance in national logistics.",
      "• Antwerp is recognized as the world's leading diamond market, with diamond exports constituting roughly 10% (one-tenth) of Belgian total exports, emphasizing its central role in the global diamond trade.",
      "• The BASF plant located in Antwerp is the largest BASF facility outside Germany, and it accounts for about 2% of Belgium's total exports, indicating its substantial contribution to the national economy.",
      "• Other key industrial and service sectors in Antwerp include car manufacturing, telecommunications, and photographic products, diversifying the region's economic activities.",
      "• The port of Bruges-Zeebrugge is considered one of Europe's most important, modern, and rapidly expanding ports, notable for its strategic significance.",
      "• Zeebrugge is Europe's largest port for Roll-on/Roll-off (RoRo) traffic and natural gas, highlighting its critical role in freight and energy logistics.",
      "• It is also the world's largest port for the import and export of new vehicles, establishing its dominance in automotive logistics.",
      "• Tourism significantly contributes to Bruges' economy due to its well-preserved medieval city centre, making it a popular tourist destination.",
      "• Annually, approximately 2.5 million day tourists visit Bruges, and in 2007, the city recorded about 1.4 million overnight stays, reflecting its tourism appeal.",
      "• The port of Ghent, situated in the northern part of the city, is the third-largest port in Belgium and is accessible via the Ghent–Terneuzen Canal, which connects to the Dutch port of Terneuzen on the Western Scheldt.",
      "• Major companies operating in Ghent include ArcelorMittal, Volvo Cars, Volvo Trucks, Volvo Parts, Honda, and Stora Enso, indicating a strong industrial presence.",
      "• Ghent University, the second-largest university in Belgium by student population, is located in the city along with various research-oriented companies, fostering innovation and education.",
      "• Tourism is increasingly becoming a major employer in the Ghent area, contributing to local economic development.",
      "• Begonia cultivation has been a tradition in the Ghent region since 1860, with Belgium being the world's largest producer of begonias, planting approximately 60 million tubers annually.",
      "• About 80% of the begonias produced in Belgium are exported, highlighting the importance of horticulture to the regional economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:42:07.803931",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1874,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Wallonia",
    "text": "In the past, Liège was one of the most important steel-making centres in\nEurope. Starting in 1817, John Cockerill extensively developed the iron and\nsteel industry. The industrial complex of Seraing was the largest in the\nworld. Although now a shadow of its former self, steel production and the\nmanufacture of steel goods remain important.\n\nLiège has also been an important centre for gunsmithing since the Middle Ages,\nand the arms industry is still strong with the headquarters of FN Herstal. The\neconomy of the region is now diversified, the most important centers are\nmechanical industries (aircraft engine and spacecraft propulsion), space\ntechnology, information technology, biotechnology and also production of\nwater, beer, and chocolate. Liège Science Park, southeast of the city, near\nthe University of Liège campus, houses spin-offs and high technology\nbusinesses. Liège is also a very important logistics center: the city\npossesses the third-largest river port in Europe, directly connected to\nAntwerp, Rotterdam and Germany via the Meuse river and the Albert Canal. In\n2006, Liège Airport was the 8th most important cargo airport in Europe. A new\npassenger terminal was opened in 2005. It is also the main hub and the\nheadquarters of TNT Airways.\n\nCharleroi features an industrial area, iron and steel industry, glassworks,\nchemicals, and electrical engineering. Charleroi is in the center of a vast\ncoal basin, called _Pays Noir_. Many slag heaps still surround the city.\nCharleroi is also known for its publishing industry with Dupuis, one of the\nmain publishers of Franco-Belgian comics, located in Marcinelle.",
    "openai_summarised_points": [
      "• Historically, Liège was one of Europe's most significant steel-making centers, with a prominent industrial complex in Seraing that was the largest in the world.",
      "• The development of the iron and steel industry in Liège began in 1817, notably driven by John Cockerill, who extensively expanded the sector.",
      "• Although steel production and steel goods manufacturing have declined from their peak, they remain important to the region's economy.",
      "• Liège has a longstanding tradition as an important gunsmithing center dating back to the Middle Ages, with the arms industry still robust today, exemplified by the headquarters of FN Herstal.",
      "• The region's economy has become diversified, with key sectors including mechanical industries such as aircraft engine and spacecraft propulsion, space technology, information technology, biotechnology, and the production of water, beer, and chocolate.",
      "• Liège Science Park, located southeast of the city near the University of Liège campus, hosts numerous spin-offs and high-tech businesses, fostering innovation and technological development.",
      "• Liège serves as a major logistics hub, possessing the third-largest river port in Europe, which is directly connected to Antwerp, Rotterdam, and Germany via the Meuse River and the Albert Canal.",
      "• In 2006, Liège Airport ranked as the 8th most important cargo airport in Europe; a new passenger terminal was opened there in 2005.",
      "• Liège Airport functions as the main hub and headquarters for TNT Airways.",
      "• Charleroi features an industrial zone with industries including iron and steel, glassworks, chemicals, and electrical engineering.",
      "• The city is situated in the heart of the _Pays Noir_, a vast coal basin, with many slag heaps still visible around Charleroi.",
      "• Charleroi is renowned for its publishing industry, notably hosting Dupuis in Marcinelle, one of the leading publishers of Franco-Belgian comics."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:42:14.971105",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1626,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "GDP per capita development of Belgium\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation under 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 106.1  | 10,769.0  | 123.5  | 12,529.3  | 4.4%  | 6.7%  | 8.3%  | 76.8%\n1981  | 115.8  | 11,745.0  | 102.2  | 10,366.1  | -0.3%  | 7.6%  | 10.0%  | 89.7%\n1982  | 123.7  | 12,556.1  | 90.0  | 9,128.6  | 0.6%  | 8.7%  | 11.5%  | 99.6%\n1983  | 129.0  | 13,083.9  | 85.0  | 8,626.2  | 0.3%  | 7.7%  | 10.7%  | 110.3%\n1984  | 136.9  | 13,897.6  | 81.2  | 8,244.8  | 2.5%  | 6.3%  | 10.8%  | 114.6%\n1985  | 143.6  | 14,566.9  | 84.5  | 8,568.7  | 1.7%  | 4.9%  | 10.1%  | 119.4%\n1986  | 149.2  | 15,129.2  | 117.1  | 11,873.8  | 1.8%  | 1.3%  | 10.1%  | 124.7%\n1987  | 156.4  | 15,851.6  | 145.4  | 14,740.5  | 2.3%  | 1.6%  | 9.8%  | 129.2%\n1988  | 169.5  | 17,166.6  | 158.1  | 16,008.6  | 4.7%  | 1.2%  | 8.8%  | 129.7%\n1989  | 182.3  | 18,362.2  | 159.8  | 16,098.2  | 3.5%  | 3.1%  | 7.4%  | 126.4%\n1990  | 195.0  | 19,607.2  | 200.1  | 20,119.9  | 3.1%  | 3.5%  | 6.6%  | 130.3%\n1991  | 205.3  | 20,560.9  | 205.4  | 20,563.7  | 1.8%  | 3.2%  | 6.5%  | 131.8%\n1992  | 213.2  | 21,276.7  | 228.7  | 22,823.0  | 1.5%  | 2.3%  | 7.1%  | 134.7%\n1993  | 216.2  | 21,472.2  | 218.7  | 21,723.6  | -1.0%  | 2.5%  | 8.6%  | 138.9%\n1994  | 227.9  | 22,566.2  | 238.6  | 23,624.5  | 3.2%  | 2.4%  | 9.8%  | 137.1%\n1995  | 238.3  | 23,519.1  | 288.3  | 28,458.5  | 2.4%  | 1.3%  | 9.7%  | 131.3%\n1996  | 245.8  | 24,236.3  | 279.3  | 27,535.3  | 1.3%  | 1.8%  | 9.6%  | 129.0%\n1997  | 259.6  | 25,521.1  | 253.0  | 24,878.7  | 3.8%  | 1.5%  | 9.2%  | 124.3%\n1998  | 267.6  | 26,257.7  | 258.9  | 25,399.2  | 2.0%  | 0.9%  | 9.3%  | 119.2%\n1999  | 281.0  | 27,513.1  | 258.5  | 25,309.1  | 3.5%  | 1.1%  | 8.4%  | 115.4%\n2000  | 298.1  | 29,110.0  | 236.9  | 23,136.5  | 3.7%  | 2.7%  | 6.9%  | 109.6%\n2001  | 308.1  | 30,021.8  | 236.7  | 23,067.2  | 1.1%  | 2.4%  | 6.6%  | 108.2%\n2002  | 318.3  | 30,870.9  | 258.2  | 25,044.3  | 1.7%  | 1.5%  | 7.5%  | 105.4%\n2003  | 327.9  | 31,665.3  | 318.0  | 30,707.7  | 1.0%  | 1.5%  | 8.2%  | 101.7%\n2004  | 348.7  | 33,545.0  | 369.0  | 35,497.6  | 3.6%  | 1.9%  | 8.4%  | 97.2%\n2005  | 368.0  | 35,232.8  | 385.9  | 36,945.5  | 2.3%  | 2.5%  | 8.5%  | 95.1%\n2006  | 389.1  | 37,014.5  | 408.3  | 38,841.8  | 2.6%  | 2.3%  | 8.3%  | 91.5%\n2007  | 414.3  | 39,140.3  | 471.0  | 44,496.8  | 3.7%  | 1.8%  | 7.5%  | 87.3%\n2008  | 424.1  | 39,760.0  | 517.3  | 48,493.1  | 0.4%  | 4.5%  | 7.0%  | 93.2%\n2009  | 418.2  | 38,891.8  | 482.7  | 44,892.2  | -2.0%  | 0.0%  | 8.0%  | 100.2%\n2010  | 435.4  | 40,162.4  | 481.8  | 44,448.2  | 2.9%  | 2.3%  | 8.4%  | 100.3%\n2011  | 451.9  | 41,082.4  | 523.2  | 47,564.4  | 1.7%  | 3.4%  | 7.2%  | 103.5%\n2012  | 469.7  | 42,409.3  | 496.5  | 44,824.2  | 0.7%  | 2.6%  | 7.7%  | 104.8%\n2013  | 487.3  | 43,755.2  | 521.8  | 46,848.6  | 0.5%  | 1.2%  | 8.6%  | 105.5%\n2014  | 503.6  | 45,043.2  | 535.5  | 47,897.0  | 1.6%  | 0.5%  | 8.7%  | 107.0%\n2015  | 521.0  | 46,365.2  | 462.4  | 41,147.3  | 2.0%  | 0.6%  | 8.7%  | 105.2%\n2016  | 550.6  | 48,679.7  | 475.9  | 42,076.4  | 1.3%  | 1.8%  | 7.9%  | 105.0%\n2017  | 575.8  | 50,726.6  | 502.6  | 44,274.1  | 1.6%  | 2.2%  | 7.2%  | 102.0%\n2018  | 600.5  | 52,678.4  | 543.6  | 47,689.5  | 1.8%  | 2.3%  | 6.0%  | 99.8%\n2019  | 624.1  | 54,481.0  | 535.4  | 46,740.5  | 2.1%  | 1.2%  | 5.5%  | 97.7%\n2020  | 595.7  | 51,703.3  | 521.3  | 45,238.7  | -5.7%  | 0.4%  | 5.8%  | 112.8%\n2021  | 659.3  | 57,054.5  | 599.1  | 51,849.3  | 6.2%  | 3.2%  | 6.3%  | 108.4%\n2022  | 723.1  | 62,065.1  | 589.5  | 50,597.9  | 2.4%  | 9.5%  | 5.4%  | 103.9%\n2023  | 751.7  | 64,125.3  | 596.7  | 50,906.1  | 0.4%  | 4.9%  | 5.6%  | 105.1%\n2024  | 778.3  | 66,336.5  | 619.3  | 52,786.0  | 1.4%  | 1.8%  | 5.6%  | 107.2%\n2025  | 802.1  | 68,219.2  | 642.3  | 54,627.8  | 1.2%  | 1.7%  | 5.6%  | 109.7%\n2026  | 827.5  | 70,140.6  | 666.5  | 56,487.1  | 1.2%  | 1.7%  | 5.5%  | 112.3%\n2027  | 853.6  | 72,111.5  | 690.7  | 58,351.9  | 1.2%  | 1.7%  | 5.5%  | 115.1%",
    "openai_summarised_points": [
      "• The section presents data on Belgium's GDP per capita development from 1980 to 2027, including main economic indicators and estimates by IMF staff for 2022–2027.",
      "• The table includes the following key indicators for each year: GDP in billions of US$PPP, GDP per capita in US$ PPP, GDP in billions of US$ nominal, GDP per capita in US$ nominal, real GDP growth rate, inflation rate percentage, unemployment rate percentage, and government debt as a percentage of GDP.",
      "• In 1980, Belgium's GDP was 106.1 billion US$PPP, with a GDP per capita of 10,769.0 US$, and nominal GDP was 123.5 billion US$, with a per capita of 12,529.3 US$.",
      "• The GDP growth rate in 1980 was 4.4%, with an inflation rate of 6.7%, unemployment at 8.3%, and government debt at 76.8% of GDP.",
      "• During the early 1980s, GDP increased from 115.8 billion US$PPP in 1981 to 123.7 billion US$PPP in 1982, with fluctuations in growth and inflation.",
      "• The 1980s saw gradual growth in GDP, reaching 156.4 billion US$PPP in 1987, with inflation rates decreasing to as low as 1.2% in 1988.",
      "• The early 1990s experienced moderate growth, with GDP reaching 205.3 billion US$PPP in 1991 and 213.2 billion US$PPP in 1992, and GDP per capita surpassing 20,000 US$ PPP.",
      "• The period from 1993 to 1996 showed a slight slowdown, with some negative growth in 1993 (-1.0%) but recovery afterward, and government debt fluctuating around 129–138% of GDP.",
      "• The late 1990s and early 2000s marked steady growth, with GDP reaching 298.1 billion US$PPP in 2000 and GDP per capita exceeding 29,000 US$ PPP.",
      "• The 2008 financial crisis caused a dip in GDP growth to 0.4% in 2008 and a contraction of -2.0% in 2009, with inflation dropping to 0.0% in 2009.",
      "• Post-2009, Belgium experienced recovery with GDP growth rates of 2.9% in 2010 and 1.7% in 2011, with GDP per capita rising above 41,000 US$ PPP by 2011.",
      "• From 2012 to 2019, GDP growth remained relatively modest, generally between 0.5% and 2.1%, with inflation rates mostly below 3%, and unemployment decreasing to around 5.5% in 2019.",
      "• In 2020, GDP contracted by -5.7% due to the COVID-19 pandemic, with unemployment slightly increasing to 5.8%, and government debt rising to 112.8% of GDP.",
      "• The economic recovery in 2021 saw GDP grow by 6.2%, with GDP per capita reaching 57,054.5 US$, and government debt decreasing slightly to 108.4%.",
      "• IMF estimates project continued growth from 2022 to 2027, with GDP in 2027 reaching 853.6 billion US$PPP and GDP per capita at approximately 72,111.5 US$, maintaining a steady growth rate around 1.2% annually.",
      "• Inflation rates are projected to remain under 5% from 2024 onward, with some years experiencing rates close to 1.7–1.8%.",
      "• Unemployment rates are expected to stay around 5.5% to 5.6% from 2023 to 2027.",
      "• Government debt as a percentage of GDP is forecasted to gradually increase from 105.1% in 2023 to 115.1% in 2027."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:42:25.925767",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4326,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Belgium",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in Belgium\nis Services with 433,375 companies followed by Finance, Insurance, and Real\nEstate with 169,544 companies.",
    "openai_summarised_points": [
      "• In 2022, the sector with the highest number of registered companies in Belgium was Services, comprising 433,375 companies.",
      "• The second-largest sector in terms of registered companies was Finance, Insurance, and Real Estate, with a total of 169,544 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:42:28.259320",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 185,
      "bullet_points_count": 2
    }
  }
]