[
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Portugal** is ranked 36th in the World Competitiveness\nRanking 2024 by Swiss institute IMD. The great majority of the international\ntrade is done within the European Union (EU), whose countries received 71.4%\nof the Portuguese exports and were the origin of 74.6% of the Portuguese\nimports in 2020.\n\nThe Portuguese currency is the euro (€) and the country has been a part of the\nEurozone since its inception. Portugal's central bank is the _Banco de\nPortugal_ , which forms part of the European System of Central Banks, and the\nmajor stock exchange is the Euronext Lisbon. Among OECD nations, Portugal has\na highly efficient and strong social security system; social expenditure stood\nat roughly 24.6% of GDP.\n\nThe Portuguese economy has a GDP growth forecast in 2025 of 2%, according to\nthe IMF World Economic Outlook. The economy's growth has been accompanied by a\ncontinuous fall in the unemployment rate (6.3% in the first quarter of 2019,\ncompared with 13.9% registered in the end of 2014). Portugal's unemployment\nrate stands at 6.4% in January 2025, according to Statistics Portugal.\nPortugal ranks third country in Europe with the highest GDP growth for Q3 2024\ncompared to the same period in 2023 since Portugal registered a GDP growth\nrate of 1.9%, while the average GDP growth rate in the EU and in the Eurozone\nis 0.9% for Q3 2024, compared to Q3 2023.\n\nPortugal’s budget surplus exceeds forecasts by 1 billion euros for the year\n2023. Portugal achieved a historic budget surplus of 1.2% of the Gross\nDomestic Product (GDP) for the year 2023, exceeding the target of 0.8% that\nwas expected to reach 2,191 million euros.\n\nThese rates mark an inversion from the negative trends caused by the impact of\nthe 2008 financial crisis in the Portuguese economy that caused it to shrink\nfor three consecutive years (2011, 2012, and 2013), accompanied by a high\nincrease of the unemployment rate (that achieved a record of 17.7% in early\n2013). The crisis had caused a wide range of domestic problems due to the\nlevels of public deficit, as well as the excessive debt levels. The problems\nculminated in the confirmation from Portugal of a €78 billion financial\nbailout from the EU in April 2011, following similar decisions from Greece and\nthe Republic of Ireland. The government that took office in June 2011 had to\nface tough choices in regard to its attempts to stimulate the economy while at\nthe same time seeking to maintain its public deficit around the EU average.\n\nPortugal is home to a number of notable leading companies with worldwide\nreputations, such as The Navigator Company, a major world player in the\ninternational paper market; Sonae Indústria, the largest producer of wood-\nbased panels in the world; Corticeira Amorim, the world leader in cork\nproduction; Conservas Ramirez, the oldest canned food producer; Cimpor, one of\nthe world's 10th largest producers of cement; EDP Renováveis, the 3rd largest\nproducer of wind energy in the world; Jerónimo Martins, consumer products\nmanufacturer and retail market leader in Portugal, Poland and Colombia; TAP\nAir Portugal, highly regarded for its safety record, and one of the leading\nairlines linking Europe with Africa and Latin America (especially Brazil).\n\nEducation in Portugal has been in gradual modernization and relative expansion\nsince the 1960s, achieving recognition for its world-standard practices and\ntrends in the 21st century. According to the Programme for International\nStudent Assessment (PISA) 2015, the average Portuguese 15-year-old student,\nwhen rated in terms of reading literacy, mathematics and science knowledge, is\nplaced significantly above the OECD's average. Portugal is home to several\nworld class universities and business schools that have been contributing to\nthe creation of a number of highly renowned international managers and are\nattracting an increasing number of foreign students. Portugal has the highest\nemigration rate as a proportion of population in the European Union. More than\ntwo million Portuguese people (20% of the population) now live outside the\ncountry.",
    "openai_summarised_points": [
      "• The economy of Portugal is ranked 36th in the World Competitiveness Ranking 2024 by the Swiss institute IMD.",
      "• In 2020, the European Union (EU) was the primary partner in Portugal’s international trade, receiving 71.4% of Portuguese exports and supplying 74.6% of Portuguese imports.",
      "• Portugal’s official currency is the euro (€), and the country has been a member of the Eurozone since its inception.",
      "• The central bank of Portugal is the Banco de Portugal, which is part of the European System of Central Banks.",
      "• The major stock exchange in Portugal is Euronext Lisbon.",
      "• Among OECD countries, Portugal has a highly efficient and strong social security system, with social expenditure accounting for approximately 24.6% of GDP.",
      "• The International Monetary Fund (IMF) forecasts Portugal’s GDP growth at 2% for the year 2025.",
      "• Portugal’s economic growth has been accompanied by a continuous decline in unemployment, from 13.9% at the end of 2014 to 6.3% in the first quarter of 2019.",
      "• According to Statistics Portugal, the unemployment rate stood at 6.4% in January 2025.",
      "• For the third quarter of 2024, Portugal ranked third in Europe for highest GDP growth compared to the same period in 2023, with a growth rate of 1.9%, surpassing the EU and Eurozone average growth rate of 0.9%.",
      "• In 2023, Portugal’s budget surplus exceeded forecasts by 1 billion euros, achieving a historic surplus of 1.2% of GDP, equivalent to 2,191 million euros, surpassing the expected target of 0.8%.",
      "• These positive economic indicators represent a reversal from the negative trends caused by the 2008 financial crisis, which led to economic contraction in 2011, 2012, and 2013, and a peak unemployment rate of 17.7% in early 2013.",
      "• The 2008 crisis resulted in significant domestic challenges, including high public deficits and excessive debt levels.",
      "• In April 2011, Portugal confirmed a €78 billion financial bailout from the European Union, following similar bailouts for Greece and the Republic of Ireland.",
      "• The government that took office in June 2011 faced the challenge of stimulating the economy while maintaining the public deficit near the EU average.",
      "• Portugal hosts several globally recognized companies, including The Navigator Company (a major international paper market player), Sonae Indústria (the world’s largest producer of wood-based panels), and Corticeira Amorim (the global leader in cork production).",
      "• Other notable Portuguese companies include Conservas Ramirez (the oldest canned food producer), Cimpor (ranked 10th largest cement producer worldwide), and EDP Renováveis (the third largest wind energy producer globally).",
      "• Jerónimo Martins is a leading consumer products manufacturer and retail market leader in Portugal, Poland, and Colombia.",
      "• TAP Air Portugal is highly regarded for its safety record and is a leading airline connecting Europe with Africa and Latin America, particularly Brazil.",
      "• Since the 1960s, education in Portugal has undergone gradual modernization and expansion, achieving recognition for world-standard practices and trends in the 21st century.",
      "• According to the 2015 Programme for International Student Assessment (PISA), the average Portuguese 15-year-old student scores significantly above the OECD average in reading literacy, mathematics, and science.",
      "• Portugal is home to several world-class universities and business schools that contribute to producing internationally renowned managers and attract an increasing number of foreign students.",
      "• Portugal has the highest emigration rate as a proportion of population in the European Union, with more than two million Portuguese people, representing 20% of the population, living abroad."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:49:42.265211",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4091,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Portuguese Colonial Empire",
    "text": "GDP per capita in Portugal throughout history.\n\nDuring the Portuguese Empire period, started in the 15th century, until the\nCarnation Revolution of 1974, the economy of Portugal was centered in trade\nand raw materials related activities within its vast colonial possessions,\nmainly in Asia (spices, silk, dyes, porcelain and gems), Africa (ivory,\ntimber, oil, diamonds and slaves) and South America (sugar cane, dyes, woods,\nand gold). The country, with a transcontinental empire with plenty of natural\nresources and vast unexploited areas, was among the most powerful nations in\nthe world.\n\nIn 1822, the Portuguese colony of Brazil became an independent country,\nhowever, until 1974, Portugal managed to preserve its colonies/overseas\nterritories in Africa, which included Angola and Mozambique, territories that\nwould experience reasonable rates of economic growth until the departure of\nthe Portuguese in 1975.\n\nThe economy of Portugal and its overseas territories on the eve of the\nCarnation Revolution (a military coup on 25 April 1974) was growing well above\nthe European average. Average family purchasing power was rising together with\nnew consumption patterns and trends and this was promoting both investment in\nnew capital equipment and consumption expenditure for durable and nondurable\nconsumer goods. The Estado Novo regime economic policy encouraged and created\nconditions for the formation of large business conglomerates.\n\nThe regime maintained a policy of corporatism that resulted in the placement\nof a large part of the Portuguese economy in the hands of a number of strong\nconglomerates, of which, the most important were known as the \"seven\nmagnificent\". These Portuguese conglomerates had a business model with\nsimilarities to South Korean chaebols and Japanese keiretsus and zaibatsus.\nAmong the seven magnificent were the conglomerates founded and held by the\nfamilies Champalimaud, Mello (CUF group), Amorim and Santos (Jerónimo Martins\ngroup).\n\nThe CUF (Companhia União Fabril) group was the largest and most diversified of\nthe Portuguese conglomerates. At one point, it became the largest industrial\ngroup in the Iberian Peninsula and one of the five largest in Europe. Its core\nbusinesses included the cement, chemicals, petrochemicals, agrochemicals,\ntextiles, beer, beverages, metallurgy, naval engineering, electrical\nengineering, insurance, banking, paper, tourism and mining. Its main business\nactivities and corporate headquarters located in mainland Portugal, but it\nalso included branches, plants and several developing business projects all\naround the Portuguese overseas territories, especially in Angola and\nMozambique.\n\nOther medium-sized family companies specialized in textiles (for instance\nthose located in the city of Covilhã and the northwest), ceramics, porcelain,\nglass and crystal (like those of Alcobaça, Caldas da Rainha and Marinha\nGrande), engineered wood (like SONAE near Porto), canned fish (like those of\nAlgarve and the northwest which included one of the oldest canned fish\ncompanies in continuous operation in the world), fishing, food and beverage\nproducing, tourism (well established in Estoril/Cascais/Sintra (the Portuguese\nRiviera) and growing as an international attraction in the Algarve since the\n1960s) and in agriculture and agribusiness (like the ones scattered around\nRibatejo and Alentejo – known as the breadbasket of Portugal, as well as the\nnotorious Cachão Agroindustrial Complex established in Mirandela, Northern\nPortugal, in 1963) completed the panorama of the national economy by the early\n1970s. In addition, rural areas' populations were committed to agrarianism\nthat was of great importance for a majority of the total population, with many\nfamilies living exclusively from agriculture or complementing their salaries\nwith farming, husbandry and forestry yields.\n\nBesides that, the overseas territories were also displaying impressive\neconomic growth and development rates from the 1920s onwards. Even during the\nPortuguese Colonial War (1961–1974), a counterinsurgency war against\nindependentist guerrilla and terrorism, the overseas territories of Angola and\nMozambique (the largest Portuguese Overseas Provinces at the time) had\ncontinuous economic growth rates and several sectors of their local economies\nwere booming. They were internationally notable centres of production of oil,\ncoffee, cotton, cashew, coconut, timber, minerals (like diamonds), metals\n(like iron and aluminium), banana, citrus, tea, sisal, beer, cement, fish and\nother sea products, beef and textiles.\n\nLabour unions were not allowed and a minimum wage policy was not enforced.\nHowever, in a context of an expanding economy, bringing better living\nconditions for the Portuguese population in the 1960s, the outbreak of the\ncolonial wars in Africa set off significant social changes, among them the\nrapid incorporation of more and more women into the labour market. Marcelo\nCaetano moved on to foster economic growth and some social improvements, such\nas the awarding of a monthly pension to rural workers who had never had the\nchance to pay social security.\n\nThe objectives of Caetano's pension reform were threefold: enhancing equity,\nreducing fiscal and actuarial imbalance, and achieving more efficiency for the\neconomy as a whole, for example, by establishing contributions less distortive\nto labour markets or by allowing the savings generated by pension funds to\nincrease the investments in the economy.",
    "openai_summarised_points": [
      "• During the Portuguese Empire period, beginning in the 15th century until the Carnation Revolution of 1974, Portugal's economy was primarily based on trade and raw materials sourced from its extensive colonial possessions across Asia, Africa, and South America.",
      "• Key colonial exports included spices, silk, dyes, porcelain, and gems from Asia; ivory, timber, oil, diamonds, and slaves from Africa; and sugar cane, dyes, woods, and gold from South America, reflecting the empire's vast natural resources.",
      "• Portugal maintained a transcontinental empire with abundant natural resources and largely unexploited territories, positioning it among the world's most powerful nations during this era.",
      "• In 1822, Brazil, Portugal’s largest colony, gained independence; however, Portugal retained its African colonies, notably Angola and Mozambique, which experienced reasonable economic growth until the Portuguese withdrawal in 1975.",
      "• On the eve of the Carnation Revolution (a military coup on 25 April 1974), the Portuguese economy and its overseas territories were growing at rates well above the European average, with rising average family purchasing power and evolving consumption patterns.",
      "• This economic growth fostered increased investment in capital equipment and consumption expenditure on both durable and nondurable consumer goods.",
      "• The Estado Novo regime’s economic policy promoted the formation of large business conglomerates, facilitating economic expansion through corporatism.",
      "• The corporatist policy concentrated much of the Portuguese economy in the hands of several powerful conglomerates, famously known as the \"seven magnificent,\" which operated similarly to South Korean chaebols and Japanese keiretsus and zaibatsus.",
      "• Prominent conglomerates among the \"seven magnificent\" included those founded and controlled by the Champalimaud, Mello (CUF group), Amorim, and Santos (Jerónimo Martins group) families.",
      "• The CUF (Companhia União Fabril) group was the largest and most diversified Portuguese conglomerate, at one point the largest industrial group in the Iberian Peninsula and among the five largest in Europe.",
      "• CUF’s core businesses spanned cement, chemicals, petrochemicals, agrochemicals, textiles, beer, beverages, metallurgy, naval engineering, electrical engineering, insurance, banking, paper, tourism, and mining.",
      "• CUF’s headquarters and main business activities were based in mainland Portugal, but it also operated branches, plants, and development projects across Portuguese overseas territories, especially in Angola and Mozambique.",
      "• Medium-sized family companies specialized in textiles (notably in Covilhã and northwest Portugal), ceramics, porcelain, glass, and crystal (in Alcobaça, Caldas da Rainha, and Marinha Grande), engineered wood (SONAE near Porto), canned fish (including some of the world's oldest continuously operating companies in Algarve and northwest), fishing, food and beverage production, tourism, and agriculture/agribusiness.",
      "• Tourism was well established in Estoril, Cascais, and Sintra (the Portuguese Riviera) and was growing as an international attraction in the Algarve since the 1960s.",
      "• Agricultural and agribusiness activities were prominent in Ribatejo and Alentejo (Portugal’s breadbasket) and included the notable Cachão Agroindustrial Complex established in Mirandela, Northern Portugal, in 1963.",
      "• Rural populations remained heavily committed to agrarianism, with many families relying exclusively on agriculture or supplementing incomes through farming, husbandry, and forestry.",
      "• From the 1920s onward, Portuguese overseas territories exhibited impressive economic growth and development, even during the Portuguese Colonial War (1961–1974), a counterinsurgency conflict against independence guerrillas.",
      "• Angola and Mozambique, the largest Portuguese Overseas Provinces at the time, maintained continuous economic growth during the colonial war, with booming sectors including oil, coffee, cotton, cashew, coconut, timber, minerals (diamonds), metals (iron and aluminium), banana, citrus, tea, sisal, beer, cement, fish and other sea products, beef, and textiles.",
      "• Labour unions were prohibited, and no minimum wage policy was enforced during this period.",
      "• Despite restrictive labour policies, the expanding economy of the 1960s improved living conditions for the Portuguese population and triggered significant social changes, including the rapid incorporation of women into the labour market due to the colonial wars in Africa.",
      "• Marcelo Caetano, who succeeded António Salazar, promoted continued economic growth and introduced social improvements such as monthly pensions for rural workers who had never contributed to social security.",
      "• Caetano’s pension reform aimed to enhance equity, reduce fiscal and actuarial imbalances, and improve overall economic efficiency by implementing less labour market-distortive contributions and enabling pension fund savings to increase investments in the economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:49:49.527974",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5470,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "1974",
    "text": "Portuguese population 1961–2003, in thousands, (2005 Data from FAO) with\nemigration giving way to retornados ranging from 500,000 to 1 million after\nthe revolution.\n\nThe post Carnation Revolution period was characterized by chaos and negative\neconomic growth as industries were nationalised and the negative effects of\nthe decoupling of Portugal from its former colonies were felt. Heavy industry\ncame to an abrupt halt. All sectors of the economy from manufacturing, mining,\nchemical, defence, finance, agriculture and fishing went into free fall.\n\nPortugal found itself overnight going from the country in Western Europe with\nthe highest growth rate to the lowest – in fact it experienced several years\nof negative growth. This was amplified by the mass emigration of skilled\nworkers and entrepreneurs due to political intimidation, and the costs of\naccommodating in Portugal thousands of refugees from the former overseas\nprovinces in Africa – the _retornados_.\n\nAfter the Carnation Revolution's turmoil of 1974, the Portuguese economic\nbasis changed deeply. The Portuguese economy had changed significantly by 1973\nprior to the leftist military coup, compared with its position in 1961 – total\noutput (GDP at factor cost) had grown by 120 percent in real terms. Clearly,\nthe prerevolutionary period was characterized by robust annual growth rates\nfor GDP (6.9 percent), industrial production (9 percent), private consumption\n(6.5 percent), and gross fixed capital formation (7.8 percent). After the\nCarnation Revolution military coup of 1974, by abandoning its moderate-\nreformist, pro-democracy posture, the Movimento das Forças Armadas leadership\nset out on a course of sweeping nationalizations and land expropriations\nduring a period known as _PREC_. Wide powers were handed over to the working\nclass always having the concept of dictatorship of the proletariat in mind.\nThe lasting effects of this hampered Portugal's economic growth and\ndevelopment for years to come.\n\nIn 1960, Portugal's per capita GDP was only 38 percent of the EC-12 average.\nAfter Salazar's late shift in economic policy toward a more outward-looking,\neconomically liberal direction due to the influence of a new generation of\ntechnocrats with background in economics and technical-industrial know-how, by\nthe end of the Salazar period, in 1968, it had risen to 48 percent; and in\n1973, on the eve of the revolution, Portugal's per capita GDP had reached 56.4\npercent of the EC-12 average. In 1975, the year of maximum revolutionary\nturmoil, Portugal's per capita GDP declined to 52.3 percent of the EC-12\naverage. Convergence of real GDP growth toward the EC average occurred as a\nresult of Portugal's economic resurgence since 1985. In 1991 Portugal's GDP\nper capita climbed to 54.9 percent of the EC average, exceeding by a fraction\nthe level attained just during the worst revolutionary period. Portugal\novertook Greece in terms of GDP per capita in 1992, but fell again below it in\n1993. This situation endured until 2013 when Greece was more hardly hit by\neconomic fallout from debt crisis.\n\nThe growth rate of Portuguese merchandise exports during the period 1959 to\n1973 was notable – 11 percent per annum. In 1960 the bulk of exports was\naccounted for by a few products – canned fish, raw and manufactured cork,\ncotton textiles, and wine. By contrast, in the early 1970s (before the 1974\nmilitary coup), Portugal's export list reflected significant product\ndiversification, including both consumer and capital goods. Several branches\nof Portuguese industry became export-oriented, and in 1973 over one-fifth of\nPortuguese manufactured output was exported.\n\nThere was a 16-percentage-point increase in the participation of the services\nsector from 39 percent of GDP in 1973 to 55.5 percent in 1990. Most of this\ngrowth reflected the exacerbated proliferation of civil service employment and\nthe associated cost of public administration, together with the contribution\nof tourism services during the 1980s to the detriment of more sustainable and\nreproductive activities like manufacturing, exporting and technology/capital-\nintensive industries.",
    "openai_summarised_points": [
      "• Between 1961 and 2003, the Portuguese population data (in thousands) from FAO 2005 shows a shift from emigration to the arrival of _retornados_, refugees numbering between 500,000 and 1 million following the 1974 Carnation Revolution.",
      "• The post-Carnation Revolution period was marked by economic chaos and negative growth as industries were nationalized and Portugal suffered the adverse effects of severing ties with its former colonies, leading to an abrupt halt in heavy industry.",
      "• All major economic sectors—manufacturing, mining, chemical, defense, finance, agriculture, and fishing—experienced severe decline during this period.",
      "• Portugal transitioned rapidly from having the highest growth rate in Western Europe to the lowest, enduring several years of negative economic growth.",
      "• This economic downturn was exacerbated by the mass emigration of skilled workers and entrepreneurs due to political intimidation and the financial burden of accommodating thousands of African _retornados_ refugees.",
      "• By 1973, prior to the Carnation Revolution, Portugal’s economy had experienced significant growth compared to 1961, with total output (GDP at factor cost) increasing by 120% in real terms.",
      "• The pre-revolution period featured robust average annual growth rates: GDP at 6.9%, industrial production at 9%, private consumption at 6.5%, and gross fixed capital formation at 7.8%.",
      "• Following the 1974 leftist military coup, the Movimento das Forças Armadas abandoned moderate reformism and democracy, initiating sweeping nationalizations and land expropriations during the _PREC_ period.",
      "• During _PREC_, extensive powers were granted to the working class under the ideological framework of the dictatorship of the proletariat, which had long-lasting negative effects on Portugal’s economic growth and development.",
      "• In 1960, Portugal’s per capita GDP was only 38% of the EC-12 average, reflecting its relative economic underdevelopment within Europe.",
      "• Influenced by a new generation of technocrats with expertise in economics and industrial technology, Salazar’s late economic policy shift toward liberalization and outward orientation raised Portugal’s per capita GDP to 48% of the EC-12 average by 1968.",
      "• By 1973, on the eve of the revolution, Portugal’s per capita GDP had further increased to 56.4% of the EC-12 average.",
      "• The turmoil of 1975 caused a decline in per capita GDP to 52.3% of the EC-12 average, marking the lowest point during the revolutionary period.",
      "• Portugal’s real GDP growth began converging toward the EC average after 1985, with per capita GDP reaching 54.9% of the EC average by 1991, slightly surpassing the level during the worst revolutionary years.",
      "• Portugal overtook Greece in GDP per capita in 1992 but fell below it again in 1993; this relative position persisted until 2013 when Greece was severely affected by the debt crisis.",
      "• Portuguese merchandise exports grew at an impressive annual rate of 11% from 1959 to 1973.",
      "• In 1960, exports were concentrated in a few products: canned fish, raw and manufactured cork, cotton textiles, and wine.",
      "• By the early 1970s, before the 1974 military coup, Portugal’s export portfolio had diversified significantly to include both consumer and capital goods.",
      "• Several Portuguese industrial sectors became export-oriented, with over 20% of manufactured output exported in 1973.",
      "• The services sector’s share of GDP increased by 16 percentage points, from 39% in 1973 to 55.5% in 1990.",
      "• This growth in services was largely due to the expansion of civil service employment and the rising costs of public administration, alongside tourism growth during the 1980s.",
      "• The expansion of the services sector occurred at the expense of more sustainable and productive sectors such as manufacturing, exporting, and technology- or capital-intensive industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:49:43.177598",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4134,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "EU membership (1986)",
    "text": "European GDP (PPP) per capita in 2024. Figures from International Monetary\nFund Portugal's GDP growth evolution (PPP) from 1980 to 2014.\n\nMembership in the European Communities, achieved in 1986, contributed to\nstable economic growth and development, largely through increased trade ties\nand an inflow of funds allocated by the European Union (and before that the\nEuropean Communities) to improve the country's infrastructure.\n\nAlthough the occurrence of economic growth and a public debt relatively well-\ncontained as a result of the number of civil servants has been increased from\n485,368 in 1988 to 509,732 in 1991, which was a much lower increase than that\nwhich will happen in the following years until 2005 marked by irrational and\nunsustainable State employment, from 1988 to 1993, during the government\ncabinets led by then Prime Minister Aníbal Cavaco Silva, the Portuguese\neconomy was radically changed. As a result, there was a sharp and rapid\ndecrease in the output of tradable goods and a rise of the importance of the\nnon-tradable goods sector in the Portuguese economy.\n\nAfter a recession in 1993, the economy grew at an average annual rate of 3.3%,\nwell above EU averages but well behind the growth of the Portuguese economy\nbefore the military coup of 1974.\n\nIn order to qualify for the Economic and Monetary Union (EMU), Portugal agreed\nto cut its fiscal deficit and undertake structural reforms. The EMU brought to\nPortugal exchange rate stability, falling inflation, and falling interest\nrates. Falling interest rates, in turn, lowered the cost of public debt and\nhelped the country achieve its fiscal targets.\n\nIn 1999, it continued to enjoy sturdy economic growth, falling interest rates,\nand low unemployment. The country qualified for the Economic and Monetary\nUnion of the European Union (EMU) in 1998 and joined with 10 other European\ncountries in launching the euro on 1 January 1999. The three different designs\nchosen for the national side of the Portuguese euro coins were drawn by the\nartist Vitor Manuel Fernandes dos Santos. The inspiration came from the three\nseals of the first king, Dom Afonso Henriques. Portugal's inflation rate for\n1999, 2.4%, was comfortably low.\n\nHousehold debt expanded rapidly. The European Commission, OECD, and others\nadvised the Portuguese Government to exercise more fiscal restraint.\nPortugal's public deficit exceeded 3% of GNP in 2001, the EU's self-imposed\nlimit, and left the country open to either EU sanctions or tighter financial\nsupervision. The overall rate of growth slowed in late 2001 and into 2002,\nmaking fiscal austerity that much more painful to implement.\n\nPortugal made significant progress in raising its standard of living to that\nof its EU partners. GDP per capita on a purchasing power parity basis rose\nfrom 51% of the EU average in 1985 to 78% in early 2002. By 2005 this had\ndropped to 72% (of the average across all of now 25 EU members, including\nseven with GDP per capita lower than Portugal) as GDP per capita rose in other\nEU countries. Unemployment stood at 4.1% at the end of 2001, which was low\ncompared to the EU average.\n\nGDP growth in 2006, at 1.3%, was the lowest not just in the European Union but\nin all of Europe. In the 2000s, the Czech Republic, Malta and Slovenia\novertook Portugal in terms of GDP per capita. From 2010 until 2012, GDP per\ncapita (PPP) in Portugal fell below those of Slovakia (in Europe) and\nSeychelles (outside Europe). In 2013 it was estimated that the Portuguese GDP\nper capita will be similar (within minus or plus US$1,000 per capita) of those\nof Greece, Estonia and Lithuania. The GDP per capita fell from just over 80%\nof the EU 25 average in 1999 to just over 70% in 2007. This poor performance\nof the Portuguese economy was explored in April 2007 by The Economist which\ndescribed Portugal as \"a new sick man of Europe\".\n\nFrom 2002 to 2007, the unemployment rate increased 65% (270,500 unemployed\ncitizens in 2002, 448,600 unemployed citizens in 2007). In December 2009,\nratings agency Standard and Poor's lowered its long-term credit assessment of\nPortugal to \"negative\" from \"stable\", voicing pessimism on the country's\nstructural weaknesses in the economy and weak competitiveness that would\nhamper growth and the capacity to strengthen its public finances and reduce\ndebt.\n\nHowever, the Portuguese subsidiaries of large multinational companies ranked\namong the most productive in the world, including Siemens Portugal, Volkswagen\nAutoeuropa, Qimonda Portugal (before the parent company filed for bankruptcy),\nIKEA, Nestlé Portugal, Microsoft Portugal, Unilever/Jerónimo Martins and\nDanone Portugal.\n\nMany Portuguese companies have grown and expanded internationally since after\n1986. Among the most notable Portugal-based global companies are SONAE,\nAmorim, Sogrape, EFACEC, Portugal Telecom, Jerónimo Martins, Cimpor, Unicer,\nMillennium bcp, Lactogal, Sumol + Compal, Delta Cafés, Derovo, Critical\nSoftware, Galp Energia, EDP, Grupo José de Mello, Sovena Group, Valouro,\nRenova, Teixeira Duarte, Soares da Costa, Portucel Soporcel, Simoldes,\nIberomoldes, Logoplaste and TAP Portugal",
    "openai_summarised_points": [
      "• Portugal became a member of the European Communities in 1986, which contributed to stable economic growth and development primarily through increased trade ties and significant inflows of funds from the European Union aimed at improving the country's infrastructure.",
      "• Between 1988 and 1991, the number of civil servants in Portugal increased from 485,368 to 509,732, a relatively modest rise compared to the more irrational and unsustainable state employment growth observed until 2005.",
      "• From 1988 to 1993, under the government cabinets led by Prime Minister Aníbal Cavaco Silva, the Portuguese economy underwent radical changes characterized by a sharp and rapid decrease in the output of tradable goods and a rising importance of the non-tradable goods sector.",
      "• After experiencing a recession in 1993, Portugal’s economy grew at an average annual rate of 3.3%, which was significantly above the European Union averages but still lagged behind the growth rates prior to the 1974 military coup.",
      "• To qualify for the Economic and Monetary Union (EMU), Portugal committed to reducing its fiscal deficit and implementing structural reforms, which resulted in exchange rate stability, falling inflation, and declining interest rates after joining the EMU.",
      "• The reduction in interest rates lowered the cost of public debt and facilitated Portugal’s achievement of fiscal targets during the late 1990s.",
      "• Portugal qualified for the EMU in 1998 and joined the eurozone alongside 10 other European countries, officially launching the euro currency on 1 January 1999.",
      "• The national side of Portuguese euro coins featured three different designs created by artist Vitor Manuel Fernandes dos Santos, inspired by the three seals of Portugal’s first king, Dom Afonso Henriques.",
      "• In 1999, Portugal experienced a low inflation rate of 2.4%, sturdy economic growth, falling interest rates, and low unemployment.",
      "• Household debt in Portugal expanded rapidly in the late 1990s and early 2000s, prompting advisories from the European Commission, OECD, and other organizations urging the Portuguese government to exercise greater fiscal restraint.",
      "• Portugal’s public deficit exceeded the European Union’s self-imposed limit of 3% of GNP in 2001, exposing the country to potential EU sanctions or tighter financial supervision.",
      "• Economic growth slowed in late 2001 and into 2002, making the implementation of fiscal austerity measures more challenging and painful.",
      "• Portugal made significant progress in raising its standard of living relative to EU partners, with GDP per capita on a purchasing power parity (PPP) basis increasing from 51% of the EU average in 1985 to 78% in early 2002.",
      "• By 2005, Portugal’s GDP per capita had declined to 72% of the EU average (now including 25 member states), despite seven of these countries having lower GDP per capita than Portugal.",
      "• Unemployment in Portugal stood at 4.1% at the end of 2001, which was low compared to the EU average at that time.",
      "• In 2006, Portugal’s GDP growth rate was 1.3%, the lowest in both the European Union and all of Europe.",
      "• During the 2000s, countries such as the Czech Republic, Malta, and Slovenia surpassed Portugal in GDP per capita.",
      "• Between 2010 and 2012, Portugal’s GDP per capita (PPP) fell below that of Slovakia in Europe and Seychelles outside Europe.",
      "• In 2013, Portuguese GDP per capita was estimated to be within plus or minus US$1,000 of the GDP per capita of Greece, Estonia, and Lithuania.",
      "• Portugal’s GDP per capita declined from just over 80% of the EU 25 average in 1999 to just over 70% in 2007, reflecting poor economic performance.",
      "• The Economist magazine described Portugal as \"a new sick man of Europe\" in April 2007, highlighting the country’s economic difficulties.",
      "• From 2002 to 2007, unemployment in Portugal increased by 65%, rising from 270,500 unemployed citizens in 2002 to 448,600 in 2007.",
      "• In December 2009, the ratings agency Standard and Poor’s downgraded Portugal’s long-term credit rating from \"stable\" to \"negative,\" citing structural economic weaknesses and weak competitiveness that would hinder growth and the country’s ability to improve public finances and reduce debt.",
      "• Despite economic challenges, Portuguese subsidiaries of multinational companies such as Siemens Portugal, Volkswagen Autoeuropa, Qimonda Portugal (prior to its parent company’s bankruptcy), IKEA, Nestlé Portugal, Microsoft Portugal, Unilever/Jerónimo Martins, and Danone Portugal ranked among the most productive worldwide.",
      "• Since 1986, many Portuguese companies have expanded internationally, with notable global companies including SONAE, Amorim, Sogrape, EFACEC, Portugal Telecom, Jerónimo Martins, Cimpor, Unicer, Millennium bcp, Lactogal, Sumol + Compal, Delta Cafés, Derovo, Critical Software, Galp Energia, EDP, Grupo José de Mello, Sovena Group, Valouro, Renova, Teixeira Duarte, Soares da Costa, Portucel Soporcel, Simoldes, Iberomoldes, Logoplaste, and TAP Portugal."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:49:50.383613",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5122,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "Portuguese financial crisis (2010–2013)",
    "text": "Portugal bonds during Portuguese financial crisis\n\n30 year bond\n\n10 year bond\n\n5 year bond\n\n1 year bond\n\n3 month bond\n\nGraph showing the economic data (Surplus/deficit, Public sector debt, GDP\ngrowth) of Portugal, the EU and the eurozone for 2009, from Eurostat November\n2011 protests against austerity measures of the Economic Adjustment Programme\nfor Portugal outside the Assembly of the Republic\n\nThe Portuguese Financial crisis was a major political and economic crisis,\nrelated with the European sovereign debt crisis and its heavy impact in\nPortugal. The crisis started to be noted in the initial weeks of 2010 and only\nbegan to fade away with the start of the Portuguese economic recovery in the\nlate 2013. It was the Portuguese economy's most severe recession since the\n1970s.\n\nA report published in January 2011 by the _Diário de Notícias_ , a leading\nPortuguese newspaper, demonstrated that during the period of the Carnation\nRevolution, from 1974 to 2010, the Portuguese democratic governments have\nencouraged over-expenditure and investment bubbles through unclear public-\nprivate partnerships. Consequently, numerous ineffective external\nconsultancy/advising committees and firms were funded, and this facilitated\nconsiderable slippage in state-managed public works, inflated top management\nand head officers' bonuses and wages. Additionally, a recruitment policy\neventuated that has boosted the number of redundant public servants.\n\nFor almost four decades, the nation's economy has also been damaged by risky\ncredit, public debt creation, and mismanaged European structural and cohesion\nfunds. Apparently, Prime Minister Sócrates's cabinet was unable to forecast or\nprevent the crisis when symptoms first appeared in 2005, and was later\nincapable of doing anything to ameliorate the situation when the country was\non the verge of bankruptcy in 2011. In 2010, acronyms like PIIGS were widely\nused by international bond analysts, academics, and the international\nfinancial press when referring to the underperforming economies of Portugal,\nItaly, Ireland, Greece and Spain. The number of civil servants had increased\nfrom 509,732 to 727,701 between 1991 and 2011.\n\nFour factors that heavily contributed to the financial crisis were:\n\n* The financial collapse of Banco Português de Negócios (BPN) due to a huge amount of toxic credits conceded by the bank in exchange of promises of illegal gains to the administrators, like corporate positions or the acquisitions of assets previously detained by them. The government nationalized the bank in November 2008 and, according to the BPN Inquiry Commission, until 2012, the nationalization of the bank cost 3405 million Euros to the State. In 2010 alone, the bank had an impact of 1803 million Euros in the public accounts, which was equivalent to 1.2% of the GDP.\n* The bankruptcy of the bank Banco Privado Português (BPP), which entailed large costs for the State. This bank was dissolved by Banco de Portugal in April 2010. In 2010 alone, the BPP cost 450 million euros to the taxpayers, consisting in guarantees driven by the State in that year.\n* The budgetary slippage with the Public–private partnerships (PPPs): between 2008 and 2010 the accounts slipped 560.2 million euros, mainly due to the rents paid to road concessions, to which were paid more 425.5 million euros than it was budgeted. In 2011 the slippage in the rents with the road concessions rose 28% to 197.4 million euros above what was budgeted and rose 42.3% to 266.3 million euros above what had been forecasted for 2010. The State spent a total of 896.6 million euros in rents to the road concessions. The rents paid to the PPPs in the health and rail sectors also slipped considerably.\n* The Swaps contracted by State-owned businesses with potential losses higher than 3000 million euros. In 2013, the Portuguese government reserved 898 million euros in the Amending Government Budget to bear the costs of the settlement of these contracts, so those companies can pay the accumulated losses to the financial institutions with which they contracted those swaps. The recipient firms of that support are the Lisbon Metro (548 million euros), the Porto Metro (315 million euros), REFER, whose administrator in the time when those contracts were approved is the former Finance Minister of Portugal, Maria Luís Albuquerque (20 million euros) and Estradas de Portugal (15 million euros).\n\nIn April 2011, Portugal confirmed the receipt of a financial bailout from the\nIMF and the European Union worth €78 billion ($115 billion, £70 billion),\nfollowing Greece and the Republic of Ireland. Some senior German policymakers\npublicly stated that emergency bailouts for Greece and future EU aid\nrecipients should be accompanied by harsh penalties, which caused social\nunrest in Ireland and across Southern European countries, germanophobia, a big\nincrease of euroscepticism and the rise of far-left and far-right parties in\nGreece (namely SYRIZA, Golden Dawn, among others), as well as the eurosceptic\nFive Star Movement and Lega Nord in Italy.\n\nIn May 2007, 65% of the Portuguese tended to trust the EU institutions while\n24% tended not to trust them. On the other hand, in November 2012, only 34%\ntended to trust them, while 59% tended not to trust them (even so, less\nextreme than Greece or Spain, where 81% and 72% tended not to trust them,\nrespectively). Partly as a result of this disappointed attitude concerning the\nEU, Portugal has started to close ties with Africa, Brazil as well as with\nother Latin American countries, China, USA, Switzerland and other parts of the\nworld, which has been reflected both in the investments, in foreign trade, and\neven in emigration.\n\nThe three-year EU aid program incorporating the €78 billion support package\nended in May 2014. At the time the Portuguese government reaffirmed its\ncommitment to continue its economic reform, declaring that while the bailout\nhad allowed the country to put its economy back on track, it still faced\nsignificant challenges."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "Resumption of Portuguese economic growth (2014–present)",
    "text": "The year of 2014 marked the start of the recovery of the Portuguese economy.\nSince the third quarter of 2014, the Portuguese economy has been steadily\nexpanding, with a GDP growth of 0.4% quarterly and 1.5% yearly registered in\nthe second quarter of 2015. The economic recovery has been accompanied by a\ncontinuous fall in the unemployment rate (8.5% in the third quarter of 2017,\nfrom a high of 17% in 2012). The Government budget deficit has also been\nreduced from the 11.2% of GDP in 2010 to 4.8% in 2014.\n\nThe International Monetary Fund issued an update report in late June 2017 with\nsome positive news including a stronger near-term outlook and an increase in\ninvestments and exports. Because of a surplus in 2016, the country was no\nlonger bound by the Excessive Deficit Procedure. The banking system was more\nstable, although there were still non-performing loans and corporate debt. The\nIMF recommended working on solving these problems for Portugal to be able to\nattract more private investment. \"Sustained strong growth, together with\ncontinued public debt reduction, would reduce vulnerabilities arising from\nhigh indebtedness, particularly when monetary accommodation is reduced.\"\n\nBy 2021, Portugal's GDP (PPP) was $36,381 per capita, according to OECD's\nreport. It was the 4th lowest GDP per capita (PPP) of the eurozone out of 19\nmembers, and the 8th lowest of the European Union out of 27 member-states,\nwith several former economically disadvantaged Communist Bloc countries which\nin the meanwhile had become Eastern European member-states of the EU, nearly\nreaching or surpassing Portugal in terms of GDP (PPP) per capita around this\ndate. Also in 2021, labour productivity (PPP) was the fifth lowest among the\n27 member-states of the European Union (EU) and was 35% lower than the EU\naverage. By 2022, the Portuguese productivity of labour had fallen to the\nfourth lowest position among the 27 member-states of the European Union with\nonly Bulgaria and Greece being clearly inferior to Portugal in that parameter.\n\nAt this stage, Portugal had been a net beneficiary to the European Union\nbudget since it joined the union, then known as EEC, in 1986.\n\nPortugal's GDP growth rate recorded the highest increase in the EU for the\nfourth quarter of 2024 as a percentage change compared with the previous\nquarter of 2024, according to Eurostat, with +1.5%. Moreover, while GDP per\ncapita increased in 21 out of 27 countries across Europe, Portugal ranked 5th\nwith an increase in the quarterly real GDP per capita of 0.68% in 2024.\n\nPortugal also ranks 2nd highest growth in household income rising by 6.7% and\ntherefore surpassing the OECD average of 0.9%. According to the figures\npublished in January 2024, by Banco de Portugal, Portugal’s Central Bank,\nPortugal's debt-to-GDP ratio is declining. Portugal’s total net debt vis-à-vis\nthe rest of the world decreased from 85.4% of GDP in June 2023 to 82.7% of GDP\nin September 2023.\n\nPortugal’s budget surplus exceeded forecasts by 1 billion euros for the year\n2023. Portugal achieved a historic budget surplus of 1.2% of the Gross\nDomestic Product (GDP) for the year 2023, exceeding the target of 0.8% that\nwas expected to reach 2,191 million euros.****The country also ranks 6th EU\ncountry with the highest Gold Reserves by value in euros in 2025, since in Q4\n2024, the country holds 382.66 tonnes of gold valued at nearly 35 billion\neuros.",
    "openai_summarised_points": [
      "• The year 2014 marked the beginning of the recovery of the Portuguese economy, with steady expansion starting from the third quarter of 2014.",
      "• By the second quarter of 2015, Portugal registered a GDP growth rate of 0.4% quarterly and 1.5% yearly.",
      "• The economic recovery was accompanied by a continuous decline in the unemployment rate, which fell to 8.5% in the third quarter of 2017 from a peak of 17% in 2012.",
      "• The government budget deficit was significantly reduced from 11.2% of GDP in 2010 to 4.8% in 2014.",
      "• In late June 2017, the International Monetary Fund (IMF) issued an update report highlighting a stronger near-term economic outlook for Portugal, with increases in investments and exports.",
      "• Due to a budget surplus in 2016, Portugal was no longer subject to the European Union’s Excessive Deficit Procedure.",
      "• The Portuguese banking system had stabilized by 2017, although challenges remained with non-performing loans and corporate debt; the IMF recommended addressing these issues to attract more private investment.",
      "• The IMF emphasized that sustained strong growth combined with continued public debt reduction would mitigate vulnerabilities related to high indebtedness, especially as monetary accommodation is reduced.",
      "• According to the OECD report, by 2021 Portugal’s GDP (PPP) per capita was $36,381, ranking as the 4th lowest among the 19 eurozone members and the 8th lowest among the 27 European Union member-states.",
      "• Several former economically disadvantaged Communist Bloc countries, now Eastern European EU members, had nearly reached or surpassed Portugal in GDP (PPP) per capita by 2021.",
      "• In 2021, Portugal’s labour productivity (PPP) was the fifth lowest among the 27 EU member-states, being 35% lower than the EU average.",
      "• By 2022, Portugal’s labour productivity declined to the fourth lowest position in the EU, with only Bulgaria and Greece scoring lower.",
      "• Since joining the European Union (then the EEC) in 1986, Portugal has been a net beneficiary of the EU budget.",
      "• In the fourth quarter of 2024, Portugal recorded the highest GDP growth rate in the EU, with a 1.5% increase compared to the previous quarter, according to Eurostat.",
      "• Portugal ranked 5th among 27 European countries for quarterly real GDP per capita growth in 2024, with an increase of 0.68%.",
      "• Portugal achieved the second highest growth in household income in 2024, rising by 6.7%, surpassing the OECD average growth of 0.9%.",
      "• Data published in January 2024 by Banco de Portugal, the country’s central bank, showed a declining debt-to-GDP ratio, with total net debt vis-à-vis the rest of the world decreasing from 85.4% of GDP in June 2023 to 82.7% in September 2023.",
      "• Portugal’s budget surplus for 2023 exceeded forecasts by 1 billion euros, reaching a historic surplus of 1.2% of GDP, surpassing the target of 0.8%, which was expected to be 2,191 million euros.",
      "• As of the fourth quarter of 2024, Portugal ranked 6th among EU countries for the highest gold reserves by value in euros, holding 382.66 tonnes of gold valued at nearly 35 billion euros."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:49:48.295558",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3406,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Data",
    "text": "**GDP growth %**\n\n| This graph was using the legacy Graph extension, which is no longer\nsupported. It needs to be converted to the new Chart extension.\n---|---\n\n**GDP per capita (in US$ PPP)**\n\n| This graph was using the legacy Graph extension, which is no longer\nsupported. It needs to be converted to the new Chart extension.\n---|---\n\nThe following table shows the main economic indicators in 1980–2024 (with IMF\nstaff estimates between 2025–2030 in _italics_). Inflation below 5% is in\ngreen.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 63.5  | 6,503.6  | 32.6  | 3,338.8  | 6.7%  | 5.9%  | 7.8%  | n/a\n1981  | 72.0  | 7,306.1  | 32.5  | 3,296.7  | 3.5%  | 21.2%  | 8.3%  | n/a\n1982  | 78.1  | 7,877.1  | 30.7  | 3,095.1  | 2.2%  | 22.7%  | 7.5%  | n/a\n1983  | 81.9  | 8,226.8  | 28.3  | 2,838.7  | 1.0%  | 25.1%  | 7.9%  | n/a\n1984  | 84.0  | 8,402.6  | 26.0  | 2,596.1  | -1.0%  | 29.3%  | 10.5%  | n/a\n1985  | 88.1  | 8,786.0  | 27.2  | 2,716.6  | 1.6%  | 19.3%  | 8.7%  | n/a\n1986  | 92.8  | 9,252.1  | 37.9  | 3,774.6  | 3.3%  | 11.7%  | 8.6%  | n/a\n1987  | 102.4  | 10,207.7  | 47.4  | 4,724.5  | 7.6%  | 9.4%  | 7.1%  | n/a\n1988  | 111.7  | 11,143.6  | 55.4  | 5,532.6  | 5.3%  | 9.6%  | 7.1%  | n/a\n1989  | 123.7  | 12,368.6  | 59.8  | 5,977.6  | 6.6%  | 12.6%  | 5.1%  | n/a\n1990  | 138.5  | 13,870.2  | 79.4  | 7,957.3  | 7.9%  | 13.4%  | 4.2%  | 60.2%\n1991  | 148.0  | 14,856.7  | 89.9  | 9,026.3  | 3.4%  | 11.4%  | 4.1%  | 63.9%\n1992  | 156.1  | 15,683.1  | 108.1  | 10,863.5  | 3.1%  | 8.9%  | 3.9%  | 58.1%\n1993  | 158.7  | 15,925.0  | 95.1  | 9,547.7  | -0.7%  | 5.9%  | 5.1%  | 57.2%\n1994  | 164.5  | 16,462.9  | 99.7  | 9,977.6  | 1.5%  | 5.0%  | 6.3%  | 60.4%\n1995  | 171.8  | 17,136.4  | 118.2  | 11,787.3  | 2.3%  | 4.0%  | 7.9%  | 62.2%\n1996  | 181.1  | 17,993.9  | 122.7  | 12,187.5  | 3.5%  | 2.9%  | 8.0%  | 63.3%\n1997  | 192.3  | 19,024.6  | 117.2  | 11,594.8  | 4.4%  | 1.9%  | 7.5%  | 58.7%\n1998  | 203.8  | 20,061.7  | 124.1  | 12,216.7  | 4.8%  | 2.2%  | 5.7%  | 55.6%\n1999  | 214.8  | 21,021.2  | 127.6  | 12,487.7  | 3.9%  | 2.2%  | 5.2%  | 55.4%\n2000  | 228.0  | 22,161.4  | 118.7  | 11,531.5  | 3.8%  | 2.8%  | 4.7%  | 54.2%\n2001  | 237.7  | 22,938.5  | 121.6  | 11,734.9  | 1.9%  | 4.4%  | 4.8%  | 57.4%\n2002  | 243.3  | 23,346.4  | 134.7  | 12,927.5  | 0.8%  | 3.7%  | 5.8%  | 60.0%\n2003  | 245.8  | 23,497.4  | 165.2  | 15,793.8  | -0.9%  | 3.2%  | 7.0%  | 63.9%\n2004  | 256.9  | 24,502.1  | 189.3  | 18,056.0  | 1.8%  | 2.5%  | 7.4%  | 67.1%\n2005  | 267.0  | 25,420.8  | 197.4  | 18,790.5  | 0.8%  | 2.1%  | 8.3%  | 72.2%\n2006  | 279.7  | 26,582.7  | 208.8  | 19,840.5  | 1.6%  | 3.0%  | 8.4%  | 73.7%\n2007  | 294.5  | 27,932.3  | 240.5  | 22,813.8  | 2.5%  | 2.4%  | 8.7%  | 72.7%\n2008  | 301.1  | 28,520.1  | 263.4  | 24,946.3  | 0.3%  | 2.7%  | 8.3%  | 75.6%\n2009  | 293.5  | 27,773.7  | 244.4  | 23,126.1  | -3.1%  | -0.9%  | 10.2%  | 87.8%\n2010  | 302.2  | 28,586.5  | 238.6  | 22,570.4  | 1.7%  | 1.4%  | 11.5%  | 100.1%\n2011  | 303.2  | 28,696.1  | 245.4  | 23,224.2  | -1.7%  | 3.6%  | 13.6%  | 114.0%\n2012  | 296.3  | 28,138.0  | 216.7  | 20,574.0  | -4.1%  | 2.8%  | 16.6%  | 128.6%\n2013  | 298.4  | 28,490.6  | 226.7  | 21,642.2  | -1.0%  | 0.4%  | 17.2%  | 130.8%\n2014  | 305.9  | 29,354.1  | 230.1  | 22,087.0  | 0.7%  | -0.2%  | 14.5%  | 132.5%\n2015  | 313.6  | 30,207.1  | 199.1  | 19,173.7  | 1.6%  | 0.5%  | 12.9%  | 131.0%\n2016  | 322.9  | 31,181.3  | 206.2  | 19,914.9  | 2.0%  | 0.6%  | 11.3%  | 131.2%\n2017  | 339.6  | 32,843.8  | 220.8  | 21,352.3  | 3.3%  | 1.6%  | 9.2%  | 126.0%\n2018  | 358.9  | 34,725.2  | 242.2  | 23,436.0  | 2.9%  | 1.2%  | 7.2%  | 121.1%\n2019  | 389.5  | 37,616.2  | 240.1  | 23,192.2  | 2.7%  | 0.3%  | 6.6%  | 116.1%\n2020  | 370.4  | 35,662.8  | 229.4  | 22,093.3  | -8.2%  | -0.1%  | 7.1%  | 134.1%\n2021  | 402.7  | 38,690.8  | 256.2  | 24,618.9  | 5.6%  | 0.9%  | 6.7%  | 123.9%\n2022  | 461.5  | 44,085.7  | 257.1  | 24,558.6  | 7.0%  | 8.1%  | 6.2%  | 111.2%\n2023  | 490.6  | 46,381.4  | 289.8  | 27,394.2  | 2.6%  | 5.3%  | 6.6%  | 97.7%\n2024  | 512.2  | 47,996.7  | 308.6  | 28,917.9  | 1.9%  | 2.7%  | 6.5%  | 94.9%\n_2025_ | _536.1_ | _50,037.2_ | _321.4_ | _30,002.0_ | _2.0%_ | _1.9%_ | _6.4%_ | _91.8%_\n_2026_ | _556.9_ | _52,114.9_ | _336.3_ | _31,465.4_ | _1.7%_ | _2.1%_ | _6.3%_ | _87.9%_\n_2027_ | _575.5_ | _53,988.1_ | _347.9_ | _32,636.1_ | _1.5%_ | _2.0%_ | _6.2%_ | _84.7%_\n_2028_ | _597.2_ | _56,165.7_ | _360.8_ | _33,935.5_ | _1.7%_ | _2.1%_ | _6.2%_ | _81.6%_\n_2029_ | _618.2_ | _58,254.0_ | _374.4_ | _35,285.4_ | _1.7%_ | _2.0%_ | _6.2%_ | _78.7%_\n_2030_ | _640.1_ | _60,444.4_ | _388.2_ | _36,652.8_ | _1.7%_ | _1.9%_ | _6.2%_ | _75.8%_"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Government expenditure by function",
    "text": "According to Eurostat in 2022, the General Government expenditure by main\nfunction, as a percentage of Total Expenditure, was as follows (compared to\nthe Eurozone and EU averages):\n\nFunction  | Portugal  | Eurozone  | EU\n---|---|---|---\nSocial Protection | 39.7% | 39.8% | 39.3%\nHealth | 16.2% | 14.9% | 15.5%\nGeneral Public Services | 13.0% | 12.1% | 12.0%\nEconomic affairs | 11.0% | 11.5% | 11.8%\nEducation | 9.8% | 9.2% | 9.5%\nPublic order and safety | 3.7% | 3.4% | 3.4%\nRecreation, culture and religion | 2.1% | 2.2% | 2.3%\nDefence | 1.7% | 2.5% | 2.6%\nEnvironmental protection | 1.7% | 1.7% | 1.6%\nHousing and community amenities | 1.2% | 2.0% | 2.0%\n\nAlso according to Eurostat in 2022, the General Government expenditure by\nthree of the main functions, as a percentage of GDP, was as follows (compared\nto the Eurozone and EU averages):\n\nFunction  | Portugal  | Eurozone  | EU\n---|---|---|---\nSocial Protection | 17.5% | 20.0% | 19.4%\nHealth | 7.1% | 7.9% | 7.6%\nGeneral Public Services | 5.7% | 6.1% | 5.9%\nDetailed description of the functions described above  Government broad objective (division) | Sub-Items\n---|---\nSocial Protection | Sickness and disability, old age, survivors, family and children, unemployment, housing, R&D, social exclusion, social protection, non-specified\nGeneral Public Services | Executive and legislative organs, financial and fiscal affairs, external affairs foreign economic aid, basic research, R&D related to general public services, public debt services, transfers of a general character between different levels of government\nEconomic Affairs | General economic, labour and commercial affairs, agriculture, forestry, fishing and hunting, fuel and energy, mining, manufacturing and construction, transport, communication, other industries, related R&D\nHealth | Medical products, appliances and equipment, outpatient, hospital and public health service, R&D related to health\nEducation | Pre-primary, primary, secondary and tertiary education, post-secondary non-tertiary education, education nondefinable by level, subsidiary services to education, R&D\nPublic Order and Safety | Police, fire-protection services, law courts, prisons, R&D related to public order and safety\nDefense | Military and civil defense, foreign military aid, R&D related to defense\nRecreation, Culture and Religion | Recreational and sporting, cultural services, broadcasting and publishing services, religious and other community services, R&D\nHousing and Community Amenities | Housing development, community development, water supply, street lighting, R&D related\nEnvironmental Protection | Waste and water waste management, pollution abatement, protection of biodiversity and landscape, related R&D\n\nAccording to these data, in 2022, Portugal did not present any overspending\nneither on the coverage of social risks (social protection and health) and the\nslightly high spending on education can be related to a lag between the\naverage qualifications of Portuguese and their European counterparts,\nresulting in an eventual attempt to overcome that lag. There has been a\nremarkable progress towards that objective, since the school dropout rate fell\nfrom 43.6% in 2000 to 8.0% in 2023, with Portugal going from the top positions\nin 2000 to 13th in 2023 and below the EU average.\n\nThe functions where the overspending probably existed were in \"general public\nservices\", specifically those related with compensations to employees,\nintermediate and final consumptions of the \"legislative and executive organs,\nfinancial and fiscal affairs and external affairs\", some sub-functions in the\nitem \"economic affairs\", since there was a very intensive public works,\nnotably focused on new motorways, that didn't have a high multiplier effect.\nIt is also worthy to mention the item \"public order and safety\" and \"defence\",\nwith the compensations to employees and intermediate and final consumptions\nbeing quite higher than the EU average. There seems to have been an\noverspending on these functions, since Portugal has had only a very discrete\nrole in international conflicts and the crime rate is also quite moderate.\nThere was a big controversy about the purchase of two submarines, whose need\nhas been questioned. Also the expenses in the sub-section of \"outpatient\nservices\", belonging to the \"health\" function\" was very high compared to the\nEU average, in opposition to the in-patient \"hospital services\" where the\nexpenses were very low in 2011. It is also very relevant to explain the\ndifficulties in controlling the deficits if we take into account the payments\nof interests concerning to loans contracted by the State. Having been stable\naround 3.0% of the GDP until 2010, they jumped to 4.2% in 2011."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Evolution of the number of public employees in Portugal (1968–present)",
    "text": "Number of Public Employees| Year| Pop.| ±%\n---|---|---\n1968 | 196,755| —\n1979 | 383,103| +94.7%\n1983 | 435,795| +13.8%\n1986 | 464,321| +6.5%\n1988 | 485,368| +4.5%\n1991 | 509,732| +5.0%\n1996 | 614,256| +20.5%\n1999 | 701,911| +14.3%\n2005 | 731,485| +4.2%\n2006 | 726,523| −0.7%\n2007 | 708,507| −2.5%\n2008 | 692,279| −2.3%\n2009 | 675,048| −2.5%\n2010 | 663,167| −1.8%\n| Year| Pop.| ±%\n---|---|---\n2011 | 727,785| +9.7%\n2012 | 699,901| −3.8%\n2013 | 674,927| −3.6%\n2014 | 656,376| −2.7%\n2015 | 659,144| +0.4%\n2016 | 664,168| +0.8%\n2017 | 669,321| +0.8%\n2018 | 683,165| +2.1%\n2019 | 699,031| +2.3%\n2020 | 718,940| +2.8%\n2021 | 733,896| +2.1%\n2022 | 742,260| +1.1%\n2023 | 745,406| +0.4%\n2024 | 753,850| +1.1%\n\n**A** All data refer to 31 December of the respective year, except 1996 (which\nrefer to 1 October).\n**B** Data for 1986, 1988 and 1991 were obtained by estimates from internal\nsurveys and exclude military and militarized personnel and public employees in\nthe Azores and Madeira islands.\n**C** Data for 2010 is an estimate made in October 2010 for the State Budget\n2011.\n\nIn 2019, 13.7% of the employment as a percentage of the labour force worked in\nthe General Government, as opposed to an average of 17.9% in the OECD."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Regional economy",
    "text": "2023 GDP and GDP per capita in the NUTS II regions of Portugal according to\ndata by the National Institute for Statistics (INE).\n\nRank  | Region  | GDP in euros €  | % of GDP  | GDP per capita\n---|---|---|---|---\nIn euros €  | As % of\nPortugal\naverage\n1  | Greater Lisbon | 84,363,398,000  | 31.6%  | 39,942  | 158.0%\n2  | North Region | 78,659,537,000  | 29.4%  | 21,509  | 85.1%\n3  | Centro Region | 36,631,120,000  | 13.7%  | 21,753  | 86.1%\n4  | West and Tagus Valley | 16,560,191,000  | 6.2%  | 19,603  | 77.6%\n5  | Setúbal Peninsula | 14,154,110,000  | 5.3%  | 17,069  | 67.5%\n6  | Algarve Region | 13,143,033,000  | 4.9%  | 27,303  | 108.0%\n7  | Alentejo Region | 11,326,559,000  | 4.2%  | 23,910  | 94.6%\n8  | Autonomous Region of Madeira | 6,988,630,000  | 2.6%  | 27,369  | 108.3%\n9  | Autonomous Region of the Azores | 5,376,008,000  | 2.0%  | 22,346  | 88.4%\n**Portugal** | **267,384,332,000** | **100.0%** | **25,277** | **100.0%**"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Employment and wages",
    "text": "In the fourth quarter of 2024, the unemployment rate was at 6.7%.\n\nThe unemployment rate has been continuously falling since the end of 2013,\nmarking the reversal of the increase of unemployed people trend that had been\nrecorded since the 2000s. This negative trend had been pronounced with the\nimpact of the 2008 financial crisis, causing the unemployment rate to climb,\nachieving a record of 17.7% in the early 2013.\n\nThe decrease of the unemployment is related with the expanding of the\nPortuguese Economy registered since the third quarter of 2014 (after shrinking\nin 2011, 2012 and 2013), with a yearly GDP growth of 1.5% registered in the\nsecond quarter of 2015. The increase of the number of people that emigrated to\nwork in other countries also impacted positively the reduction of the\nunemployment, this happening specially in 2013, when the labor force decreased\n1.6% in the first 9 months of the year. Other factors have also impacted the\ndecrease, like the methodology used by the Statistics Portugal (for instance,\npeople doing internships or professional training do not count as unemployed),\nthe previous heavy loss of jobs, the increase of tourism and the resurgence of\nthe agricultural sector, where many jobs were created.\n\nAlthough being both a developed country and a high income country, Portugal\nhas the lowest GDP per capita in Western Europe and according to the Eurostat\nit had the 9th lowest purchasing power among the 27 member states of the\nEuropean Union in 2018.\n\nMaria da Conceição Cerdeira, one of the authors of a published research study\nmade by the Lisbon School of Economics and Management (ISEG), explained that\n\"in a generic way, there is not a high intensity of work, or a great\npsychological pressure\" in Portugal, for the mass of common ordinary workers,\nunlike what happens in Northern Europe or North America. Less pressure does\nnot mean, however, a better job. The last European survey of workers,\npublished in 2007 and which formed the basis of this 2009 research study\nshowed that Portugal is the 5th European country with lower quality of work. A\nstudy conducted by Harvard Business School, including 9 EU member-countries,\nalso revealed that Portugal had the 2nd worst managers in that universe, just\nabove Greece, and below Ireland, Poland, Italy, UK, France, Germany and\nSweden.\n\nThe first quarter of 2013 marked a new unemployment rate record for Portugal,\nas it reached 17.8 per cent—up from 16.9 per cent in the previous quarter—and\nthe government predicted an 18.5 per cent unemployment rate in 2014.\n\nSince 2011, the year when Troika arrived to Portugal to apply the bailout\nprogram, around 300,000-360,000 people have left the country, many of them\nqualified young people.\n\nIn 2014, unemployment was at 13.9%. Around 70,000 jobs were created while\n59,000 people became unavailable to work either due to not finding employment\nfor a long time or emigration. The number of part-time employees who are\nconsidered under-employed and as such, would like to work more hours per day,\nis at 251,700 people while 240,300 people are currently inactive (not working,\nor studying). The Portuguese Central Bank has stated that one third of jobs\ncreated are intern-ships by the IEFP public institute."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Wages",
    "text": "The minimum monthly wage in Portugal is 870 euros (from January 1, 2025),\nhaving been previously set at 820 euros. The current minimum wage was\nestablished in December 2024, with the goal of reaching at least 1000 euros by\n2028. The minimum wage has been increasing since 2015, where it stood at 505\neuros. The average gross wage is 1525 euros (US$1648, nearly the same as the\nCzech Republic and Estonia), and the average net wage is 1270 euros (US$1372).\nAll wages are paid 14 times a year, twelve monthly salary payments plus one\nmonth's pay in the form of a Christmas bonus and one month for a holiday\nbonus.\n\nThe Portuguese minimum wage, according to article 273 of the Labor Code, is\nset after dialogue and negotiations in the Permanent Social Conciliation\nCommission, whose value includes the Government and the Employers'\nConfederations and Trade Union Confederations. Minimum and average monthly\nwages by population employed by others, after income taxes:\n\nYear  | Minimum Wage  | Average Wage\n---|---|---\n2015  | **505** €  | **834** €\n2016  | **530** €  | **846** €\n2017  | **557** €  | **865** €\n2018  | **580** €  | **896** €\n2019  | **600** €  | **912** €\n2020  | **635** €  | **968** €\n2021  | **665** €  | **1,011** €\n2022  | **705** €  | **1,019** €\n2023  | **760** €  | **1,054** €\n2024  | **820** €  | **1,184** €\n2025  | **870** €  | **1,203** € (Q1 2025)"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Graduate unemployment",
    "text": "In 2008, about 8% of the people with a degree were unemployed, and a much\nlarger proportion was underemployed. This was directly correlated with a\ngeneral lack of employability and a student's under-preparation for the\nworkplace that was seen among many courses in a number of fields that were\noffered by certain higher education institutions or departments. The\nimplementation of the Bologna process and other educational reforms, such as\nthe compulsory closing of a number of courses, departments, colleges and\nprivate universities after 2005 due to a lack of academic rigour and low\nteaching standards, was a completely new approach to tackle the\nproblem.[_citation needed_]\n\nIn 2007 some major private universities were investigated by state agencies\nand two were immediately closed. Additionally, a number of degrees of the\npublic system were also discontinued due to lack of quality, low demand from\npotential students or scarce interest from potential employers in these\nfields. Secondary and post-secondary non-higher education (intermediate\neducation— _ensino médio_) that consists of technical and vocational education\nhas been redeveloped since 2007 through the governmental policies of the _XVII\nGoverno Constitucional_ (headed by Prime-Minister José Sócrates).[_citation\nneeded_]\n\nAs of March 2014, the graduate unemployment (between 15 and 24 years old) rate\nis over 35.4%, which represents an increase when comparing to January and\nFebruary 2014. 57% of the Portuguese youth are planning to emigrate to other\ncountries due to the current (and seemingly the future) fragile state of the\neconomy."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Poverty prevention",
    "text": "**History**\n\nPoverty and inequality are significant social problems that Portugal has\nattempted to address through various social policy measures. The European\neconomic crisis has increased the number of households that remain below the\npoverty line in Portugal with the greatest affected being the youth due to\nhigh unemployment rates. The current economic crisis experienced across the\nglobe is the leading cause of income inequalities which lead to poor market\ndemand in an economy and lower economic growth in Portugal. The minimum wage\npolicy is aimed at reducing abject poverty and income inequalities in Portugal\nwhich will increase demand and lead to economic stability in the long-term. In\n2014 after a four-year freeze Portugal increased their minimum wage by 4%. The\nminimum wage policy which came after negotiations with labor organizations and\nemployers was only possible after substantial recovery of the economy and will\nincrease the sustainability of the economy with aims at reducing poverty.\n\n**Taxes and transfer payments in Portugal**\n\nPortugal uses tax and transfer payments to increase equality between high-\nincome earners and the low-income earners in the country. There are\nsignificant progressive characteristics of income taxes in Portugal. The\ngovernment tax policy ensures that the high-income earners face higher taxes\nin comparison to low-income earners which have enabled the low-income earners\nto be able to stimulate demand for goods and services in the country economy.\nThe high-income earners pay roughly three times the amount paid by the low-\nincome earners. This approach has been significant in reducing income\ninequality through means of redistribution.\n\n**Portuguese GMI**\n\nThe Act no. 19-A/96, 29 June created a policy measure by the name of GMI:\nGuaranteed minimum income. This decade old means tested approach ensures a\nminimum income which grants financial stability for the citizens of Portugal.\nThe GMI is viewed as a right to the Portuguese people, and proves independent\nof market influences. The GMI program aims at providing the low-income earners\nwho are above 18 years social and economic autonomy to encourage them to\nparticipate in the economic growth of the country. In 2001 reports show that\n32 percent of those that were previously approved to benefit from the GMI have\nbeen discontinued after attaining an income above the minimum threshold. This\nreport shows GMI policy measures as effective in eradicating poverty and\nincreasing income equality in Portugal"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economy by sector",
    "text": "Natural resources of Portugal. Fe – iron ore, PY – pyrite, Sn – tin, W –\ntungsten, U – uranium, C – coal, L – lignite.\n\nThe tertiary sector is presently the most important component of the\nPortuguese economy, representing 75.8% of the gross value added (GVA) and\nemploying 68.1% of the working population. It is followed by the industry\nsector, which represents 21.9% of the GVA, proving 24.5% of the jobs.\nFisheries and agriculture – which represented 25% of the economy in 1960 – had\na sharp decrease in its weight, now only representing 2.4% of the GVA, while\nemploying 7.5% of the working population."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Natural resources",
    "text": "Forests are the major natural resource of Portugal, covering about 34% of the\ncountry. The most important forest resources are the pine trees (13,500 km2),\ncork oaks (6800 km2), holm oaks (5,340 km2), and eucalyptus (2,430 km2). Cork\nis a major production, with Portugal producing half of the world's cork.\nSignificant mining resources are lithium, tungsten, tin, and uranium."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Agriculture",
    "text": "Vineyards in the Douro Valley.\n\nAfter years of decline, the agriculture in Portugal had a surprising\nresurgence, involuntarily caused by the Portuguese debt crisis, when a number\nof highly qualified persons lost their jobs in the tertiary sector and decided\nto turn themselves to the development of agricultural businesses, despite\nhaving little or no experience in this sector.\n\nDespite presently representing only a small percentage of the economy, a\nconsiderable part of continental Portugal is dedicated to agriculture. The\nSouth has developed an extensive monoculture of cereals and olive trees and\nthe Douro Valley of vineyards. Olive trees (4,000 km2; 1,545 sq mi), vineyards\n(3,750 km2; 1,450 sq mi), wheat (3,000 km2; 1,160 sq mi) and maize (2,680 km2;\n1,035 sq mi) are produced in vast areas. Portuguese wine and olive oil are\nespecially praised by nationals for their quality, thus external competition\n(even at much lower prices) has had little effect on consumer demand.\n\nPortugal is a traditional wine grower, and has exported its wines since the\ndawn of western civilization; Port Wine, _Vinho Verde_ and Madeira Wine are\nthe leading wine exports. Portugal is also a quality producer of fruits,\nnamely the Algarve oranges, cherries (large production in Cova da Beira and\nAlto Alentejo), Oeste region's _pêra rocha_ (a type of pear) and Alcobaça’s\napples (_maçã de Alcobaça_). More recently, niche crops such as blueberry and\nraspberry have seen great increase in production, mainly for exporting. Other\nexports include horticulture and floriculture products, beet sugar, sunflower\noil, cork, and tobacco."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Fisheries",
    "text": "Portugal's Exclusive Economic Zone of 1,727,408 km2.\n\nExclusive Economic Zone\n\nProposed expansion\n\nThe Portuguese fishing industry is fairly large and diversified. Fishing\nvessels classified according to the area in which they operate, can be divided\ninto local fishing vessels, coastal fishing vessels and long-distance fishing\nvessels. The local fleet is mainly composed of small traditional vessels (less\nthan 5 gross tonnage), comprising, in 2004, 87% of the total fishing fleet and\naccounting for 8% of the total tonnage. These vessels are usually equipped to\nuse more than one fishing method, such as hooks, gill nets and traps, and\nconstitute the so-called polyvalent segment of the fleet.\n\nTheir physical output is low but reasonable levels of income are attained by\nvirtue of the high commercial value of the species they capture: octopus,\nblack scabbardfish, conger, pouting, hake and anglerfish. Purse seine fishing\nis also part of the local fleet and has, on the mainland, only one target\nspecies: the sardine. This fishery represents 37% of total landings.\nPortugal's Exclusive Economic Zone has 1,727,408 km2, being the 3rd largest of\nthe EU and the 20th largest in the world.\n\nThe coastal fishing fleet accounted for only 13% of vessels but had the\nlargest GT (93%). These vessels operate in areas farther from the coast, and\neven outside the Portugal's Exclusive Economic Zone. The coastal fishing fleet\ncomprises polyvalent, purse seine and trawl fishing vessels. The trawlers\noperate only on the mainland shelf and target demersal species such as horse\nmackerel, blue whiting, octopus and crustaceans.\n\nThe crustacean trawling fishery targets Norway lobster, red shrimp and\ndeepwater rose shrimp. The most important fish species landed in Portugal in\n2004 were sardine, mackerel and horse mackerel, representing 37%, 9% and 8% of\ntotal landings by weight, and 13%, 1% and 8% of total value, respectively.\nMolluscs accounted for only 12% of total landings in weight, but 22% of total\nlandings in value. Crustaceans were 0.6% of the total landings by weight and\n5% by value."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Industry",
    "text": "Oeiras Municipality, in Lisbon metropolitan area, has the headquarters of\nseveral Portuguese subsidiaries of major multinational companies.\n\nThe Portuguese industry had a high development, especially after the Second\nWorld War, achieving a peak in 1974, when it represented almost 35% of the GDP\nof Portugal and achieved a high degree of diversification.\n\nPresently, the major industries in Portugal include: machinery, electrical and\nelectronics industries, automotive and shipbuilding industries, injection\nmoulding, plastics and ceramics industries, textile, footwear and leather\nindustries, oil refinery, petrochemistry and cement industries, beverages and\nfood industries and furniture, pulp and paper, wood and cork industries.\n\nAutomotive and other mechanical industries such as bicycle industry[5] are\nprimarily located in and around Setúbal, Porto, Lisbon, Aveiro, Braga and\nMangualde. Coimbra and Oeiras have growing technological-based industries,\nincluding pharmaceuticals and software. Sines has the largest oil refinery in\nthe country and is a major petrochemical centre, as well as the busiest port\nin Portugal. Maia has one of the largest industrial parks of the country,\nincluding noted[_according to whom?_] wood processing and food industries.\nFigueira da Foz and Setúbal are major centres of pulp and paper industry.\nMarinha Grande is the most reputed glass making centre of Portugal. Leiria,\nOliveira de Azeméis, Vale de Cambra and Viseu, have important light\nindustries, including injection moulding and plastics. Viana do Castelo and\nSetúbal are centres of ship building and repair industries.\n\nModern non-traditional technology-based industries like aerospace,\nbiotechnology and information technology, have been developed in several\nlocations across the country. Alverca, Covilhã, Évora, and Ponte de Sor are\nthe main centres of Portuguese aerospace industry, which is led by the local\nbranch of the Brazilian Embraer and by OGMA. Since after the turn of the 21st\ncentury, many major biotechnology and information technology industries have\nbeen founded and are concentrated in the metropolitan areas of Lisbon, Porto,\nBraga, Coimbra and Aveiro."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Energy",
    "text": "The Serpa solar power plant, one of the largest facilities of this type in the\nWorld.\n\nSince the late 1990s, when wind power was virtually nonexistent in Portugal,\nthe country has become the 6th producer of this kind of renewable energy.\nAlong with the traditional Hydroelectric energy, the Portuguese companies,\nincluding the biggest one in the country – EDP – and with the support of the\ngovernment have heavily invested in new kinds of renewable energy, from then\non. In 2010, 52% of the energy produced in Portugal was renewable.\n\nIn 2013, 61.7% of the energy produced was renewable, including 30.4%\nhydroelectric, 24.1% from wind, 5.2% from biomass, 0.9% solar energy and 1.1%\nfrom other renewable energy sources, particularly geothermical energy in the\nAzores. Thanks to this energetic strategy, during 2013 Portugal had reduced to\nonly 5% the energy that it imports. Fossil fuels are still the source of 38.3%\nor the energy produced, but the trend is to diminish. In 2013, the increase in\nthe production of clean energy helped to save 806 million Euros in the imports\nof fossil fuels and CO2 emission licenses.\n\nIn May 2016, Portugal became the second country in the world to be able to\nhave all its energy consumption fully covered by renewable energy alone, for\nfour consecutive days.\n\nIn the 1970s, the country abandoned the plan to install nuclear plants and\nopted not to invest in nuclear power, so there are no such plants in Portugal."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Services",
    "text": "The Vasco da Gama Mall, in Lisbon.\n\nThe tertiary sector has grown, producing 74.4% of the GDP and providing jobs\nfor 65.9% of the working population. The most significant growth rates are\nfound in the trade sector, due to the introduction of modern means of\ndistribution, transport and telecommunications. Financial tertiary companies\nhave benefited from privatisation, also gaining in terms of efficiency.\n\nTourism in Portugal has developed significantly, accounting for 16.5% of GDP\nby 2023. In 2023, the number of foreign tourists reached 26.5 million, and,\nincluding domestic tourists, the total is about 47 million.\n\nSome large Portuguese companies in the services' sector have committed\nthemselves to internationalize their services, like the retailer Jerónimo\nMartins, which holds the largest supermarket chain in Poland and is also\ninvesting in Colombia. Worth to notice is also TAP Portugal, a company often\nused by transit passengers traveling between Europe, Africa and Latin America\n(mainly Brazil), which is particularly regarded by its safety record."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "4.7",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nPortugal is Services with 224,004 companies followed by Retail Trade and\nFinance, Insurance, and Real Estate with 99,596 and 66,581 companies\nrespectively. As of 2023, Portugal had 1,526,926 active companies, an increase\nof 6.3% compared with the previous year."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Financial market",
    "text": "Headquarters of the Caixa Geral de Depósitos bank.\n\nIn the Portuguese financial system, the major stock exchange is the Euronext\nLisbon which is part of Euronext, the major pan-European group of stock\nexchanges. It is supervised and regulated by the Portuguese Securities Market\nCommission. The PSI-20 is Portugal's most selective and widely known stock\nindex. Portugal's central bank is the _Banco de Portugal_ , which is an\nintegral part of the European System of Central Banks. The largest Portuguese\nbanks are Banco Comercial Português and the state-owned Caixa Geral de\nDepósitos.\n\nPortuguese banks hold strategic stakes in other sectors of the economy,\nincluding the insurance sector. Foreign bank participation is relatively high\nas is state ownership through the Caixa Geral de Depósitos (CGD). Overall,\nPortugal's financial system is sound, well managed and competitive, with\nshorter-term risks and vulnerabilities quite well contained, and with the\nsystem buttressed by a strong financial policy framework. Despite being\nrelatively small and concentrated, Portugal's banking system generally\ncompares well with other European Union (EU) countries in terms of efficiency,\nprofitability, and asset quality, with solvency also close to European levels.\n\nAcross all the financial sub-sectors, and with particular reference to the\nlarger institutions, supervision of Portuguese financial institutions is\nactive, professional and well organized. The insurance sector has performed\nwell, partly reflecting a rapid deepening of the market in Portugal. While\nsensitive to various types of market and underwriting risks, both the life and\nnon-life sectors, overall, are estimated to be able to withstand a number of\nsevere shocks, even though the impact on individual insurers varies widely."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Competitiveness",
    "text": "The global distribution of Portuguese exports in 2006 as a percentage of the\ntop market (Spain – $11,493,400,000)."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Portugal's competitiveness in the world",
    "text": "The **economy of Portugal** is ranked 36th in the World Competitiveness\nRanking 2024 by Swiss institute IMD.\n\n\nThis represents a sharp increase from the 51st position where Portugal\nappeared in 2013–2014."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Competitiveness by city",
    "text": "A study concerning competitiveness of the 18 Portuguese district capitals,\ncomplying with World Economic Forum methodology, was made by Minho University\neconomics researchers. It was published in Público newspaper on 30 September\n2006. The best-ranked cities in the study were Évora, Lisbon and Coimbra.\n\n**Ranking:**\n\n1. Évora: 7,293\n2. Lisbon: 6,454\n3. Coimbra: 6,042\n4. Beja: 5,660\n5. Leiria: 5,609\n6. Castelo Branco: 5,608\n7. Aveiro: 5,452\n8. Guarda: 5,178\n9. Santarém: 5,037\n10. Portalegre: 4,711\n11. Viseu: 4,628\n12. Vila Real: 5,514\n13. Bragança: 4,271\n14. Setúbal: 4,070\n15. Braga: 4,055\n16. Faro: 3,971\n17. Viana do Castelo: 3,859\n18. Porto: 3,577"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Domestic issues",
    "text": "* Forest fires: Like in other countries with very hot summers and seasonal drying of soils and vegetation, every year large areas of the Portuguese forest are destroyed. This has an important impact on the economy because many people and industries depend on forestry related activities. It is also a very dramatic ecological problem and a safety issue for the populations.\n* Portugal's public debt: The Portuguese national debt is around 125% of the GDP as of June 2017. This problem is a threat to the Portuguese economy and the State's financial sustainability.\n* A bloated public sector: The public sector has been generally considered a very large, expensive and inefficient part of the economy. An excess of public employees and useless bureaucracy results in the loss of millions of euros every year. From the _XVI Governo Constitucional_ government, headed by Prime Minister José Durão Barroso, to the _XVII Governo Constitucional_ government, headed by Prime Minister José Sócrates (which tried to create new rules and implement reforms aiming at better efficiency, rationalized resource allocation, fight civil servant excedentary overcapacity (_excedentários_) and less bureaucracy for both citizens and companies – e.g.: _empresa na hora_ [6], _PRACE – Programa de Reestruturação da Administração Central do Estado_ , and SIMPLEX – Programa de Simplificação Administrativa e Legislativa, among others), the \"public expenditure problem\" has been a major concern in Portugal, however it had little effect, and the country's public debt and deficit were both out of control by 2010. In addition, João Bilhim who directed in 2005 the committee responsible for the Programme for Restructuring the State's Central Administration (PRACE) said to be disappointed with the results of the reforms tried in the mid-2000s.\n* Corruption: According to the 2008 Corruption Perceptions Index of countries published by Transparency International, Portugal had the 32nd lowest level of corruption out of 180 countries. In 2012 it had slumped to a three-way tie for 33rd place. (By comparison, in the same years, the United States ranked 18th and 19th). Nevertheless, corruption has become an issue of major political and economic significance for the Portuguese. The responsible authorities and many civic associations and think tanks are trying to combat corruption before it increases further. Many abusive lobbies and corruption schemes are related to concessions, unclear approvals to contractors and economic groups, or job creation for and commercial agreements with friends and family members, mainly involving the huge public sector and companies. Some cases are well known and were widely reported in the media, such as the affairs in several municipalities involving local town hall officials and businesspersons, as well as a number of politicians with wider responsibilities and power. Notable criminal cases include the _Face Oculta_ , the Oeiras Municipality Mayor Isaltino Morais scandal, the _Apito Dourado_ and the _Saco Azul de Felgueiras_."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Education, training and research in business and economic sciences",
    "text": "The NOVA SBE, one of the Portuguese world class business schools\n\nThere are many higher education institutions awarding academic degrees in\neconomics and business management, spread across the whole country. Programmes\nin management and administration are offered by almost every Portuguese\nuniversities and polytechnics. Programmes in economics are offered by all\npublic and by some private universities.\n\nAmong the largest and most reputed universities, which host an economics\ndepartment and develop research on this area, are the University of Lisbon\n(through its ISEG - Lisbon School of Economics and Management), the ISCTE –\nLisbon University Institute, the Portuguese Catholic University (through their\nCatólica Lisbon School of Business and Economics and Católica Porto School of\nEconomics and Management), the University of Porto (through its _Faculdade de\nEconomia_); the _Universidade Nova de Lisboa_ (through its NOVA SBE – Nova\nSchool of Business and Economics); the Minho University (through its _Escola\nde Economia e Gestão_ ); and the University of Coimbra (through its _Faculdade\nde Economia_ ). The Financial Times European Business school ranking has\nconsistently placed the Católica Lisbon School of Business and Economics and\nthe Nova School of Business and Economics among the top European business and\neconomics schools.\n\nBesides the higher education institutions, both the Bank of Portugal and the\nStatistics Portugal develop lengthy and thoroughly systematic research and\nmake reports on the Portuguese economy."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Poverty",
    "text": "2020 Quality of housing in the EU. Portugal had the 2nd worst rate, only below\nCyprus.\n\nIn 2012, 45.4% of the population were at risk of poverty before social\ntransfers, compared to the EU27 average (Croatia not yet included) of 44.1%.\nWhen pensions are included the percentage goes down to 25.2%. 17.5% of the\npopulation were at risk of poverty after social transfers, meaning their\ndisposable income was below their national at-risk-of-poverty threshold, which\nis set at 60% of the national median income per adult equivalent. This is just\nabove the European Union average of 17%, and compares favorably to other\nSouthern European countries, such as Spain (22.2%), Italy (19.4%) and Greece\n(23.1%).\n\nIn January 2015, the poverty stats was updated to 2013: 19.5% of the\npopulation were at risk of poverty after social transfers, meaning their\ndisposable income was below their national at-risk-of-poverty threshold, which\nis set at 60% of the national median income per adult equivalent numbering\nnearly 2 million people. According to ISEG economist, Carlos Farinha\nRodrigues, Portugal went back 10 years in terms of social reality, having lost\nall the progress that was made until 2009. The risk of poverty after social\ntransfers for men is 18.9%, 20% for women, 25.6% for children, 38.4% for\nmonoparental families with at least one child, 15.4% for two parents and one\nchild and 28.8% for other aggregates with children (elderly, etc.). The\nNational Statistics Institute made a separate calculation, basing their data\nin 2009 in order to have a poverty line that doesn't decrease because of the\nincome decreases associated with the crisis: with this calculation, the\npoverty risk increase is far greater with 17.9% in 2009 to 25.9% 4 years\nlater. The Prime-Minister, Pedro Passos Coelho, has stated that these numbers\ndo not reflect the current situation.\n\nPoverty increased in 2022 and affected 17% of the population by then.\nAccording to the National Statistics Institute (INE), the increase in poverty\ncovered all age groups. Homelessness had increased by 78% in four years:\n10,773 homeless people in Portugal, which represents an increase of 78% in\nfour years. In 2018 there were 6044.\n\nShare (%) of population below the poverty line  Year  | 1995  | 1997  | 1999  | 2001  | 2003  | 2005  | 2007  | 2009  | 2011  | 2013  | 2015  | 2017  | 2019  | 2020  | 2021  | 2022  | 2023\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nShare  | 23.0  | 22.0  | 21.0  | 20.0  | 20.4  | 18.5  | 18.5  | 17.9  | 17.9  | 19.5  | 19.0  | 17.3  | 16.2  | 18.4  | 16.4  | 17.0  | 16.6"
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Food insecurity",
    "text": "In 2005 and 2006, the National Health Survey gathered information on food\nsecurity which showed that those making a monthly household income of 251-500\neuros made up 37.3% of the food insecure, which was quite contrary to their\ncounterparts. For instance, those making more than a monthly household income\nof 901 euros made up only 15.9% of the food insecure. After the 2010–2014\nPortuguese financial crisis, food insecurity escalated and notably affected\nthose in poorer regions in Portugal—such as Alentejo and Algarve. In the\nAlgarve region, total food insecurity increased from 56.9% to 77.1% from 2011\nto 2012, and the severe food insecurity increased from 13.2% to 41.7%.\nMeanwhile, the national food insecurity only increased by 0.5% (48.6% to\n49.1%) and the severe food insecurity of other regions, such as Centro and\nNorte, started much lower and only increase by approximately 3%. Overall, the\ngeneral prevalence of food insecurity from 2011 to 2013 in Portugal was\npractically unchanged; however, the less fortunate and poorer regions were\nseen to have taken the toll, despite future progress.\n\nMore than 12% of the Portuguese population suffered from moderate or severe\nfood insecurity in 2020 and 2022, a prevalence that puts Portugal above the\naverage of 8.5% recorded in Southern Europe. Portugal was the sixth country\namong the 13 in Southern Europe with the highest percentage in this indicator,\nbehind Albania (30.2%), North Macedonia (24%), Serbia (14.8%), Bosnia\nHerzegovina (13.4%) and Montenegro (12.9%)."
  },
  {
    "chapter_name": "Economy of Portugal",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Economic emigration",
    "text": "In 2021, the United Nations revised downwards the estimate of how many\nPortuguese lived outside the country: the organization once pointed to 2.6\nmillion in 2020, but corrected it to 2 million, making Portugal the 20th\ncountry in the world with the most emigrants compared to the number of\nresidents. More Portuguese left the country in 2021 than before the COVID-19\npandemic. An increase in emigration to Northern Europe, Belgium and the\nNetherlands was reported. Portuguese emigrants living in France, Switzerland\nand the United Kingdom sent the most remittances to Portugal. In 2022,\nemigrants living in these countries were responsible for more than half of the\nremittances received by Portuguese families. The data released monthly by the\nBank of Portugal on the value of remittances that emigrants send to Portugal\nshows an increase of 1.8% in 2021 compared to the previous year, surpassing 3\nbillion euros. Portugal was one of the EU member states with the highest\nfigures for remittances received."
  }
]