[
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Australia is a highly developed country with a mixed economy. As of 2023,\nAustralia was the 14th-largest national economy by nominal GDP (gross domestic\nproduct), the 19th-largest by PPP-adjusted GDP, and was the 21st-largest goods\nexporter and 24th-largest goods importer. Australia took the record for the\nlongest run of uninterrupted GDP growth in the developed world with the March\n2017 financial quarter. It was the 103rd quarter and the 26th year since the\ncountry had a technical recession. As of June 2021, the country's GDP was\nestimated at $1.98 trillion.\n\nThe Australian economy is dominated by its service sector, which in 2017\ncomprised 62.7% of the GDP and employed 78.8% of the labour force. At the\nheight of the mining boom in 2009–10, the total value-added of the mining\nindustry was 8.4% of GDP. Despite the recent decline in the mining sector, the\nAustralian economy has remained resilient and stable and did not experience a\nrecession from 1991 until 2020. Among OECD members, Australia has a highly\nefficient and strong social security system, which comprises roughly 25% of\nGDP.\n\nThe Australian Securities Exchange in Sydney is the 16th-largest stock\nexchange in the world in terms of domestic market capitalisation and has one\nof the largest interest rate derivatives markets in the Asia-Pacific region.\nSome of Australia's largest companies include Commonwealth Bank, BHP, CSL,\nWestpac, NAB, ANZ, Fortescue, Wesfarmers, Macquarie Group, Woolworths Group,\nRio Tinto, Telstra, Woodside Energy and Transurban. The currency of Australia\nand its territories is the Australian dollar, which it shares with several\nPacific nation states.\n\nAustralia's economy is strongly intertwined with the countries of East and\nSoutheast Asia, also known as ASEAN Plus Three (APT), accounting for about 64%\nof exports in 2016. China in particular is Australia's main export and import\npartner by a wide margin. Australia is a member of the APEC, G20, OECD and\nWTO. The country has also entered into free trade agreements with ASEAN,\nCanada, Chile, China, South Korea, Malaysia, New Zealand, Peru, Japan,\nSingapore, Thailand and the United States. The ANZCERTA agreement with New\nZealand has greatly increased integration with the economy of New Zealand.",
    "openai_summarised_points": [
      "• Australia is classified as a highly developed country with a mixed economy, combining elements of both market and government intervention.",
      "• As of 2023, Australia ranked as the 14th-largest national economy globally based on nominal GDP.",
      "• In terms of purchasing power parity (PPP)-adjusted GDP, Australia was the 19th-largest economy in 2023.",
      "• Australia was the 21st-largest exporter of goods and the 24th-largest importer of goods in 2023.",
      "• The country achieved the longest continuous period of GDP growth among developed nations, with this record beginning in the March 2017 financial quarter.",
      "• Australia marked its 103rd quarter of uninterrupted GDP growth in March 2017, which also represented the 26th year since the nation experienced a technical recession.",
      "• As of June 2021, Australia's Gross Domestic Product was estimated at $1.98 trillion USD.",
      "• The service sector dominates the Australian economy, accounting for 62.7% of GDP in 2017 and employing 78.8% of the labor force.",
      "• During the 2009–10 mining boom, the mining industry contributed 8.4% of Australia's GDP in value-added terms.",
      "• Despite a recent decline in mining activity, Australia's economy has remained resilient and stable, notably avoiding recession from 1991 until 2020.",
      "• Australia has a highly efficient and robust social security system, which constitutes approximately 25% of GDP among OECD member countries.",
      "• The Australian Securities Exchange (ASX) located in Sydney is the 16th-largest stock exchange worldwide by domestic market capitalization.",
      "• The ASX hosts one of the largest interest rate derivatives markets in the Asia-Pacific region.",
      "• Major Australian corporations include Commonwealth Bank, BHP, CSL, Westpac, NAB, ANZ, Fortescue Metals Group, Wesfarmers, Macquarie Group, Woolworths Group, Rio Tinto, Telstra, Woodside Energy, and Transurban.",
      "• The official currency of Australia and its territories is the Australian dollar, which is shared with several Pacific nations.",
      "• Australia’s economy is heavily integrated with East and Southeast Asian countries, collectively known as ASEAN Plus Three (APT), which accounted for approximately 64% of Australian exports in 2016.",
      "• China is Australia's primary partner for both exports and imports, significantly surpassing other trade partners.",
      "• Australia is a member of multiple international economic organizations, including APEC, G20, OECD, and WTO.",
      "• The country has established free trade agreements with ASEAN nations, Canada, Chile, China, South Korea, Malaysia, New Zealand, Peru, Japan, Singapore, Thailand, and the United States.",
      "• The ANZCERTA agreement with New Zealand has substantially increased economic integration between the two countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:24:57.261577",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2256,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "20th century",
    "text": "Australia's average GDP growth rate for the period 1901–2000 was 3.4%\nannually. As opposed to many neighbouring Southeast Asian countries, the\nprocess towards independence was relatively peaceful and thus did not have\nsignificant negative impact on the economy and standard of living. Growth\npeaked during the 1920s, followed by the 1950s and the 1980s. By contrast, the\nlate 1910s/early 1920s, the 1930s, the 1970s and early 1990s were marked by\nfinancial crises.",
    "openai_summarised_points": [
      "• Australia's average GDP growth rate from 1901 to 2000 was 3.4% annually, reflecting steady economic expansion over the 20th century.",
      "• The process of Australia's independence was relatively peaceful compared to many neighboring Southeast Asian countries, which contributed to minimal negative impacts on the nation's economy and standard of living.",
      "• Economic growth in Australia peaked during three distinct periods: the 1920s, the 1950s, and the 1980s, indicating periods of robust economic performance.",
      "• Conversely, the late 1910s and early 1920s, the 1930s, the 1970s, and the early 1990s experienced financial crises, which disrupted economic stability and growth during those times.",
      "• The relative peacefulness of Australia's path to independence helped sustain economic stability and avoid significant downturns associated with conflicts or upheavals."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:00.347139",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 464,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.1.1",
    "section_name": "Economic liberalisation",
    "text": "ABC News report, featuring Paul Keating, on the first day of trading with a\nfloating Australian dollar. Annual percentage growth in real (chain volume)\nGDP per capita since 1961 Real GDP per capita development in Australia and New\nZealand\n\nFrom the early 1980s onwards, the Australian economy has undergone\nintermittent economic liberalisation. In 1983, under prime minister Bob Hawke,\nbut mainly driven by treasurer Paul Keating, the Australian dollar was floated\nand financial deregulation was undertaken.",
    "openai_summarised_points": [
      "• The section discusses the economic liberalisation of Australia, highlighting key developments from the early 1980s onwards.",
      "• An ABC News report featuring Paul Keating covers the first day of trading with a floating Australian dollar, marking a significant milestone in Australia's economic policy.",
      "• The report emphasizes the impact of this event on Australia's economy, including the transition to a floating currency system.",
      "• The section notes that since 1961, there has been an observable annual percentage growth in real (chain volume) GDP per capita, indicating economic development over time.",
      "• It presents a comparative analysis of real GDP per capita development in Australia and New Zealand, illustrating regional economic trends.",
      "• Starting in the early 1980s, Australia experienced intermittent phases of economic liberalisation aimed at reforming its economic structure.",
      "• In 1983, under Prime Minister Bob Hawke’s government, Australia officially floated its currency, marking a pivotal moment in economic liberalisation.",
      "• The floating of the Australian dollar was primarily driven by Treasurer Paul Keating, who played a central role in implementing financial deregulation.",
      "• The financial deregulation undertaken in this period included measures to liberalize the financial sector, enhance market flexibility, and reduce government intervention.",
      "• These reforms collectively aimed to modernize the Australian economy, improve competitiveness, and integrate more fully into the global financial system."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:05.363620",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 507,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.1.2",
    "section_name": "Early 1990s recession",
    "text": "The early 1990s recession came swiftly after the Black Monday of October 1987,\nas a result of a stock collapse of unprecedented size which caused the Dow\nJones Industrial Average to fall by 22.6%. This collapse, larger than the\nstock market crash of 1929, was handled effectively by the global economy and\nthe stock market began to quickly recover. But in North America, the lumbering\nsavings and loans industry was facing decline, which eventually led to a\nsavings and loan crisis which compromised the well-being of millions of US\npeople. The following recession thus impacted the many countries closely\nlinked to the US, including Australia. Paul Keating, who was treasurer at the\ntime, famously referred to it as \"the recession that Australia had to have.\"\nDuring the recession, GDP fell by 1.7%, employment by 3.4% and the\nunemployment rate rose to 10.8%. However, the recession did assist in reducing\nlong-term inflation rate expectations and Australia has maintained a low\ninflation environment since the 1990s to the present day.",
    "openai_summarised_points": [
      "• The early 1990s recession in Australia occurred swiftly following the Black Monday stock market crash of October 1987.",
      "• The Black Monday crash was characterized by an unprecedented stock market decline, with the Dow Jones Industrial Average falling by 22.6%.",
      "• This crash was larger than the stock market crash of 1929, marking it as one of the most significant financial downturns in history.",
      "• The global economy responded effectively to the crash, leading to a rapid recovery of the stock markets worldwide.",
      "• Despite the recovery in stock markets, the North American economy faced difficulties due to a declining savings and loans industry, which was experiencing a slowdown.",
      "• The decline in the savings and loans industry in North America eventually led to a savings and loan crisis, jeopardizing the financial stability of millions of US citizens.",
      "• The US savings and loan crisis contributed to the economic downturn in countries closely linked to the United States, including Australia.",
      "• Australian Treasurer Paul Keating famously described the recession as \"the recession that Australia had to have,\" highlighting its inevitability and impact.",
      "• During the recession, Australia’s Gross Domestic Product (GDP) decreased by 1.7%.",
      "• Employment levels fell by 3.4% during the recession period.",
      "• The unemployment rate in Australia rose to 10.8%, indicating significant job losses.",
      "• The recession period helped reduce long-term inflation expectations in Australia.",
      "• Since the 1990s, Australia has maintained a low inflation environment, a trend that has continued to the present day."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:09.253225",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1037,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Mining",
    "text": "Mining has contributed to Australia's high level of economic growth, from the\ngold rush in the 1840s to the present day. The opportunities for large profits\nin pastoralism and mining attracted considerable amounts of British capital,\nwhile expansion was supported by enormous government outlays for transport,\ncommunication, and urban infrastructures, which also depended heavily on\nBritish finance. As the economy expanded, large-scale immigration satisfied\nthe growing demand for workers, especially after the end of convict\ntransportation to the eastern mainland in 1840. Australia's mining operations\nsecured continued economic growth and Western Australia itself benefited\nstrongly from mining iron ore and gold from the 1960s and 1970s which fuelled\nthe rise of suburbanisation and consumerism in Perth, the capital and most\npopulous city of Western Australia, as well as other regional centres.",
    "openai_summarised_points": [
      "• Mining has played a significant role in Australia's high level of economic growth, beginning with the gold rush in the 1840s and continuing to the present day.",
      "• The prospect of large profits in pastoralism and mining attracted substantial British capital to Australia.",
      "• Expansion of the Australian economy during this period was supported by extensive government expenditure on transport, communication, and urban infrastructure projects.",
      "• These infrastructure developments heavily relied on British financial investment.",
      "• As the economy grew, large-scale immigration was necessary to meet the increasing demand for labor, especially following the cessation of convict transportation to the eastern mainland in 1840.",
      "• Australia's mining operations have been a key driver of sustained economic growth over time.",
      "• Western Australia experienced significant benefits from mining activities, particularly from iron ore and gold extraction starting in the 1960s and 1970s.",
      "• The mining boom in Western Australia contributed to the rise of suburbanization and consumerism in Perth, the state’s capital and most populous city.",
      "• Regional centers outside Perth also experienced economic and social growth due to mining activities during this period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:12.875910",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 901,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "2008 financial crisis",
    "text": "Australia is one of the three Organisation for Economic Co-operation and\nDevelopment (OECD) countries that did not experience two consecutive negative\nquarters of growth and one of the two that avoided negative year-end GDP\ngrowth during the global recession. It was not affected by the crisis from\n2008 to 2009 due to a number of factors such as government stimulus spending\nof $11.8 billion, its proximity to the booming Chinese economy and the related\nmining boom kept growth ticking over throughout the worst of the global\nconditions. In fact, sources such as the IMF and the Reserve Bank of Australia\nhad predicted Australia was well positioned to weather the crisis with minimal\ndisruption, sustaining more than 2% GDP growth in 2009 (as many Western\nnations went into recession). In the same year, the World Economic Forum\nranked Australia's banking system the fourth best in the world, while the\nAustralian dollar's 30% drop was seen as a boon for trade, shielding the\ncountry from the crisis and helping to slow growth and consumption.\nAustralia's recession affected New Zealand's economy as Australia was New\nZealand's biggest export market. It is said that the term Great Recession as a\ndescription of the post-2008 slump is not recognized by Australians\nparticularly those under 30 due to its mild, intangible impact on the\ncountry's economy.\n\nSome analysts had predicted the continuing decline of trade in 2009 could put\nthe economy into recession for the first time in 17 years. However, these\ninitial fears were proved largely unfounded as the Australian economy avoided\nrecession and the unemployment rate peaked at a much lower rate than had been\npredicted. To help address the anticipated slowdown, the Australian government\nalso announced a stimulus package worth $27 billion to spur economic growth\nwhile the Reserve Bank of Australia introduced a series of interest rate cuts.\n\nWhile Australia's overall national economy grew, some non-mining states and\nAustralia's non-mining economy experienced a recession.",
    "openai_summarised_points": [
      "• Australia was one of only three OECD countries that did not experience two consecutive negative quarters of economic growth during the 2008–2009 global recession.",
      "• It was also one of the two OECD countries that avoided negative year-end GDP growth in the same period.",
      "• The country’s resilience was attributed to several factors, including government stimulus spending of $11.8 billion, its proximity to China’s booming economy, and a related mining boom that sustained economic growth during the global downturn.",
      "• International organizations such as the International Monetary Fund (IMF) and the Reserve Bank of Australia predicted that Australia was well-positioned to withstand the crisis with minimal disruption.",
      "• Australia maintained GDP growth of over 2% in 2009, contrasting with many Western nations that entered recession.",
      "• In 2009, the World Economic Forum ranked Australia’s banking system as the fourth best in the world.",
      "• The Australian dollar experienced a 30% depreciation, which was viewed as beneficial for trade, shielding the country from the full impact of the crisis and contributing to a slowdown in growth and consumption.",
      "• The global recession significantly impacted New Zealand’s economy, as Australia was New Zealand’s largest export market.",
      "• The term \"Great Recession\" is generally not recognized in Australia, especially among those under 30, due to the relatively mild and intangible impact on the Australian economy.",
      "• Some analysts predicted that declining trade in 2009 could push Australia into recession for the first time in 17 years, but these fears proved largely unfounded.",
      "• Australia avoided recession in 2009, with the unemployment rate peaking at a much lower level than initially predicted.",
      "• In response to the anticipated economic slowdown, the Australian government announced a stimulus package worth $27 billion aimed at boosting growth.",
      "• The Reserve Bank of Australia implemented a series of interest rate cuts to support the economy during this period.",
      "• While Australia’s overall national economy grew, certain regions—specifically non-mining states—and the non-mining sectors experienced recessionary conditions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:18.117231",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2030,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "2010s",
    "text": "The World Bank expected Australia's GDP growth rate to be 3.2% in 2011 and\n3.8% in 2012. The economy expanded by 0.4% in the fourth quarter of 2011, and\nexpanded by 1.3% in the first quarter of 2012. The growth rate was reported to\nbe 4.3% year-on-year.\n\nThe International Monetary Fund in April 2012 predicted that Australia would\nbe the best-performing major advanced economy in the world over the next two\nyears; the Australian Government Department of the Treasury anticipated\n\"forecast growth of 3.0% in 2012 and 3.5% in 2013\", the National Australia\nBank in April 2012 cut its growth forecast for Australia to 2.9% from 3.2%.,\nand JP Morgan in May 2012 cut its growth forecast to 2.7% in calendar 2012\nfrom a previous forecast of 3.0%, also its forecast for growth in 2013 to 3.0%\nfrom 3.3%. Deutsche Bank in August 2012, and Société Générale in October 2012,\nwarned that there is risk of recession in Australia in 2013.",
    "openai_summarised_points": [
      "• The World Bank forecasted Australia's GDP growth rate to be 3.2% in 2011 and 3.8% in 2012.",
      "• Australia's economy expanded by 0.4% in the fourth quarter of 2011.",
      "• The economy grew by 1.3% in the first quarter of 2012.",
      "• The year-on-year GDP growth rate was reported to be 4.3%.",
      "• In April 2012, the International Monetary Fund predicted that Australia would be the best-performing major advanced economy globally over the subsequent two years.",
      "• The Australian Government Department of the Treasury anticipated a forecast growth of 3.0% in 2012 and 3.5% in 2013.",
      "• The National Australia Bank, in April 2012, reduced its growth forecast for Australia from 3.2% to 2.9%.",
      "• JP Morgan, in May 2012, lowered its forecast for Australia's growth in 2012 to 2.7% from an earlier estimate of 3.0%, and its 2013 growth forecast to 3.0% from 3.3%.",
      "• Deutsche Bank in August 2012 and Société Générale in October 2012 issued warnings about the risk of recession in Australia in 2013."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:20.618815",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 926,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "COVID-19 pandemic and recession",
    "text": "In September 2020, it was confirmed that due to the effects of lockdowns and\nother government responses to the COVID-19 pandemic, the Australian economy\nhad gone into recession for the first time in nearly thirty years, as the\ncountry's GDP fell 7 per cent in the June 2020 quarter, following a 0.3 per\ncent drop in the March quarter. It officially ended at the beginning of\nDecember 2020.",
    "openai_summarised_points": [
      "• In September 2020, it was confirmed that the Australian economy had entered a recession, the first in nearly thirty years, due to the impacts of COVID-19 pandemic-related lockdowns and government responses.",
      "• The country's Gross Domestic Product (GDP) contracted by 7 percent in the June 2020 quarter.",
      "• This decline followed a smaller decrease of 0.3 percent in the March 2020 quarter.",
      "• The recession officially ended at the beginning of December 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:22.762158",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 389,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "2020s recovery",
    "text": "Following the 2020 recession, triggered by the COVID-19 pandemic, Australia\nfaced ongoing economic challenges under the Albanese Labor government, elected\nin May 2022. Inflation surged, migration exceeded planned targets, and housing\naffordability worsened, intensifying cost-of-living pressures. Inflation\npeaked at 6.1% in May 2022 due to global supply chain issues and energy price\nshocks, falling to 3.6% by March 2024 and 2.4% by December 2024, within the\nReserve Bank of Australia’s 2–3% target. However, core inflation remained at\n3.5% in September 2024, with services inflation at 4.6%, indicating persistent\ndomestic pressures. Food prices rose 11.7% and gas 33.9% since 2022, outpacing\nwage growth of 3.5% annually, while energy rebates capped electricity rises at\n2.0% instead of 14.9%.\n\nLabor’s migration policy adopted flexible targets, setting 190,000 places for\n2023–2024 and 185,000 for 2024–2025, unlike the Coalition’s stricter caps,\nwith a four-year planning cycle from 2025–2026 based on recommendations.\nHowever, net overseas migration hit 446,000 in 2023–2024, exceeding the\n395,000 forecast by 51,000, after peaking at 528,000 in 2022–2023, far above\nhistorical averages of 200,000–250,000. This “big Australia by stealth” was\nlinked to six quarters of negative per capita GDP growth, with GDP per head\ndown 0.3% in 2023–2024. The Productivity Commission highlighted strains on\nhousing and infrastructure from this surge.\n\nHousing affordability declined, with approvals at 89,734 in 2024, below the\n21,000 monthly needed for Labor’s 1.2 million homes target by 2029, causing a\n12,000-dwelling shortfall in January 2025. According to the Housing Industry\nAssociation (HIA), Australia constructed approximately 180,000 homes in the\nprevious year, falling well short of the 240,000 needed annually to meet\ndemand. This suggests a yearly shortfall of about 60,000 homes, highlighting\nthe severity of the housing crisis. Alan Kohler attributed a 30–40% cost rise\nto taxes like GST and stamp duty, pricing a two-bedroom apartment at $1\nmillion, unaffordable for median earners at $65,000. He noted barriers like\nunionisation costs (up 40% since 2020) and NIMBYism, despite 59% of Sydney and\n52% of Melbourne residents favouring denser housing. Rents rose 16.4% and\nhousing costs 12.9% since 2022, driven by migration.\n\nSince 2019, Australian households experienced the sharpest decline in real\ndisposable income of any country in the OECD. According to a comparative\nanalysis of OECD data, real per capita household disposable income in\nAustralia fell by 8.0% over the two years leading up to March 2024. This\nstands in marked contrast to the OECD average, which recorded a 2.6% increase\nover the same period.\n\nThis performance positions Australia as an outlier among developed economies\nand has prompted growing concern over the government’s management of the cost-\nof-living crisis. While most OECD nations saw household incomes either\nstabilise or rise, supported by targeted fiscal interventions and effective\ninflation control, Australian households endured a sustained erosion of\npurchasing power.\n\nThe fall in real incomes coincided with heightened inflationary pressures,\nelevated interest rates, and a housing market that remains inaccessible for\nmany. The result has been a tangible reduction in living standards,\nparticularly for middle- and low-income earners, with stagnant wages failing\nto keep pace with rising costs. Critics[_who?_] argue that the government’s\nfiscal strategy has lacked the responsiveness seen in peer nations, leading to\nAustralia’s unique position as the OECD’s worst performer on this key economic\nindicator.",
    "openai_summarised_points": [
      "• Following the 2020 recession triggered by the COVID-19 pandemic, Australia faced ongoing economic challenges under the Albanese Labor government, elected in May 2022.",
      "• Key issues included surging inflation, migration exceeding planned targets, and worsening housing affordability, which intensified cost-of-living pressures across the country.",
      "• Inflation peaked at 6.1% in May 2022, primarily due to global supply chain disruptions and energy price shocks.",
      "• By March 2024, inflation had decreased to 3.6%, and further declined to 2.4% by December 2024, aligning within the Reserve Bank of Australia’s (RBA) target range of 2–3%.",
      "• Despite these declines, core inflation remained elevated at 3.5% in September 2024, with services inflation at 4.6%, indicating persistent domestic inflationary pressures.",
      "• Food prices increased by 11.7%, and gas prices rose by 33.9% since 2022, significantly outpacing wage growth of 3.5% annually.",
      "• Electricity prices were capped at a 2.0% increase through energy rebates, compared to an expected 14.9% rise without intervention.",
      "• Labor’s migration policy adopted flexible targets, setting 190,000 places for 2023–2024 and 185,000 for 2024–2025, contrasting with the Coalition’s stricter caps, with planning extending over a four-year cycle from 2025–2026 based on recommendations.",
      "• Net overseas migration reached 446,000 in 2023–2024, surpassing the forecast of 395,000 by 51,000; it peaked at 528,000 in 2022–2023, well above the historical average of 200,000–250,000.",
      "• The surge in migration contributed to what has been termed “big Australia by stealth” and was associated with six consecutive quarters of negative per capita GDP growth, with GDP per capita declining by 0.3% in 2023–2024.",
      "• The Productivity Commission highlighted that the rapid increase in migration strained housing and infrastructure capacity.",
      "• Housing affordability deteriorated, with housing approvals at 89,734 in 2024, which is below the monthly average of approximately 21,000 needed to meet Labor’s target of 1.2 million new homes by 2029, resulting in a shortfall of about 12,000 dwellings in January 2025.",
      "• According to the Housing Industry Association (HIA), Australia built approximately 180,000 homes in the previous year, falling short of the estimated 240,000 homes needed annually to satisfy demand, indicating an annual shortfall of roughly 60,000 homes.",
      "• Housing costs have become increasingly unaffordable, with Alan Kohler attributing a 30–40% rise in costs to taxes such as GST and stamp duty, making a two-bedroom apartment costing $1 million unaffordable for median earners earning $65,000.",
      "• Barriers to affordable housing include increased unionisation costs (up 40% since 2020) and NIMBY (Not In My Backyard) opposition, despite 59% of Sydney residents and 52% of Melbourne residents supporting denser housing development.",
      "• Rents increased by 16.4%, and overall housing costs rose by 12.9% since 2022, driven largely by increased migration.",
      "• Since 2019, Australian households experienced the sharpest decline in real disposable income among OECD countries, with a decrease of 8.0% over the two years leading up to March 2024.",
      "• This decline contrasts sharply with the OECD average, which saw a 2.6% increase in real per capita household disposable income during the same period.",
      "• Australia’s poor performance positions it as an outlier among developed economies and has raised concerns over the government’s management of the cost-of-living crisis.",
      "• While most OECD nations maintained or increased household incomes through targeted fiscal measures and effective inflation control, Australian households faced a sustained erosion of purchasing power.",
      "• The decline in real incomes coincided with heightened inflation, elevated interest rates, and a housing market that remains largely inaccessible for many Australians.",
      "• The combined effects have led to a tangible reduction in living standards, particularly affecting middle- and low-income earners, as stagnant wages fail to keep pace with rising living costs.",
      "• Critics argue that the Australian government’s fiscal strategy has lacked the responsiveness and effectiveness seen in peer nations, contributing to Australia’s status as the OECD’s worst performer on this key economic indicator."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:35.265177",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3662,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Data",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( October 2024)_\n---|---\n\nThe following table shows the main economic indicators in 1980–2023 (with IMF\nstaff estimates in 2024–2027). Inflation under 5% is in green.\n\nYear  | GDP (in bil. US$PPP) | GDP per capita (in US$PPP) | GDP (in bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in percent) | Unemployment (in percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 155.4  | 10,498.0  | 162.8  | 11,000.1  | 2.9%  | 10.1%  | 6.1%  | n/a\n1981  | 177.1  | 11,776.5  | 188.3  | 12,520.0  | 4.1%  | 9.5%  | 5.8%  | n/a\n1982  | 188.2  | 12,307.7  | 186.9  | 12,226.6  | 0.1%  | 11.4%  | 7.2%  | n/a\n1983  | 194.6  | 12,569.1  | 179.4  | 11,584.2  | -0.5%  | 10.0%  | 10.0%  | n/a\n1984  | 214.4  | 13,678.0  | 197.0  | 12,566.6  | 6.3%  | 4.0%  | 9.0%  | n/a\n1985  | 233.3  | 14,671.4  | 174.3  | 10,960.2  | 5.5%  | 6.7%  | 8.3%  | n/a\n1986  | 243.8  | 15,106.9  | 181.4  | 11,237.7  | 2.4%  | 9.1%  | 8.1%  | n/a\n1987  | 262.1  | 15,984.6  | 213.0  | 12,989.9  | 4.9%  | 8.5%  | 8.1%  | n/a\n1988  | 282.8  | 16,949.7  | 270.9  | 16,235.1  | 4.3%  | 7.3%  | 7.2%  | n/a\n1989  | 307.6  | 18,159.0  | 308.1  | 18,191.4  | 4.6%  | 7.6%  | 6.1%  | 17.0%\n1990  | 323.8  | 18,859.9  | 323.8  | 18,859.6  | 1.5%  | 7.2%  | 6.9%  | 16.4%\n1991  | 331.4  | 19,070.9  | 324.2  | 18,656.5  | -1.0%  | 3.3%  | 9.6%  | 21.6%\n1992  | 347.7  | 19,802.5  | 317.9  | 18,106.7  | 2.6%  | 1.0%  | 10.7%  | 27.6%\n1993  | 369.9  | 20,877.2  | 309.2  | 17,447.6  | 3.9%  | 1.8%  | 10.9%  | 30.7%\n1994  | 396.1  | 22,138.3  | 353.2  | 19,736.3  | 4.8%  | 1.9%  | 9.7%  | 31.7%\n1995  | 416.4  | 22,980.0  | 378.9  | 20,908.4  | 3.0%  | 4.6%  | 8.5%  | 31.2%\n1996  | 441.1  | 24,064.7  | 424.4  | 23,153.8  | 4.0%  | 2.7%  | 8.5%  | 29.4%\n1997  | 469.4  | 25,357.9  | 426.2  | 23,023.6  | 4.6%  | 0.2%  | 8.4%  | 25.9%\n1998  | 496.7  | 26,555.0  | 381.1  | 20,374.7  | 4.7%  | 0.9%  | 7.7%  | 23.7%\n1999  | 525.6  | 27,782.8  | 411.5  | 21,748.0  | 4.3%  | 1.4%  | 6.9%  | 22.6%\n2000  | 554.2  | 28,953.2  | 399.7  | 20,879.2  | 3.1%  | 4.5%  | 6.3%  | 19.5%\n2001  | 581.8  | 30,010.1  | 377.5  | 19,473.7  | 2.7%  | 4.4%  | 6.8%  | 17.1%\n2002  | 615.5  | 31,393.8  | 425.1  | 21,683.5  | 4.2%  | 3.0%  | 6.4%  | 15.0%\n2003  | 646.6  | 32,610.3  | 541.0  | 27,283.3  | 3.0%  | 2.7%  | 5.9%  | 13.2%\n2004  | 691.2  | 34,481.1  | 658.4  | 32,843.4  | 4.1%  | 2.3%  | 5.4%  | 11.9%\n2005  | 734.2  | 36,149.2  | 735.6  | 36,217.5  | 3.0%  | 2.7%  | 5.0%  | 10.9%\n2006  | 776.6  | 37,648.5  | 782.4  | 37,929.8  | 2.6%  | 3.6%  | 4.8%  | 10.0%\n2007  | 832.4  | 39,608.7  | 949.0  | 45,157.6  | 4.4%  | 2.4%  | 4.4%  | 9.7%\n2008  | 870.1  | 40,516.7  | 1,055.9  | 49,169.1  | 2.6%  | 4.3%  | 4.3%  | 11.7%\n2009  | 892.4  | 40,814.4  | 1,000.0  | 45,733.6  | 1.9%  | 1.8%  | 5.6%  | 16.6%\n2010  | 925.2  | 41,726.8  | 1,253.6  | 56,538.8  | 2.4%  | 2.9%  | 5.2%  | 20.4%\n2011  | 971.1  | 43,117.7  | 1,514.7  | 67,251.8  | 2.8%  | 3.4%  | 5.1%  | 24.1%\n2012  | 983.7  | 42,903.1  | 1,569.2  | 68,441.2  | 3.8%  | 1.7%  | 5.2%  | 27.5%\n2013  | 1,083.9  | 46,522.3  | 1,519.0  | 65,197.9  | 2.2%  | 2.5%  | 5.7%  | 30.5%\n2014  | 1,110.8  | 46,987.5  | 1,456.4  | 61,607.9  | 2.6%  | 2.5%  | 6.1%  | 34.0%\n2015  | 1,111.5  | 46,342.4  | 1,233.1  | 51,412.7  | 2.3%  | 1.5%  | 6.1%  | 37.8%\n2016  | 1,171.8  | 48,052.9  | 1,263.8  | 51,826.4  | 2.7%  | 1.3%  | 5.7%  | 40.6%\n2017  | 1,229.6  | 49,656.8  | 1,382.0  | 55,812.0  | 2.4%  | 2.0%  | 5.6%  | 41.2%\n2018  | 1,293.9  | 51,446.4  | 1,416.8  | 56,333.5  | 2.8%  | 1.9%  | 5.3%  | 41.8%\n2019  | 1,343.2  | 52,617.7  | 1,386.7  | 54,323.1  | 2.0%  | 1.6%  | 5.2%  | 46.7%\n2020  | 1,330.3  | 51,886.2  | 1,357.6  | 52,952.8  | -2.1%  | 0.9%  | 6.5%  | 57.2%\n2021  | 1,453.6  | 56,412.2  | 1,635.3  | 63,464.1  | 4.9%  | 2.8%  | 5.1%  | 58.4%\n2022  | 1,615.3  | 62,191.6  | 1,724.8  | 66,407.6  | 3.8%  | 6.5%  | 3.5%  | 56.7%\n2023  | 1,704.5  | 64,711.8  | 1,787.9  | 68,023.2  | 1.9%  | 4.8%  | 3.7%  | 58.6%\n2024  | 1,771.6  | 66,535.5  | 1,837.7  | 69,018.2  | 1.8%  | 3.8%  | 4.2%  | 60.5%\n2025  | 1,840.8  | 68,281.3  | 1,913.5  | 70,979.2  | 2.0%  | 2.8%  | 4.5%  | 60.4%\n2026  | 1,916.2  | 70,235.9  | 1,994.1  | 73,092.0  | 2.2%  | 2.5%  | 4.7%  | 59.6%\n2027  | 1,997.8  | 72,358.1  | 2,081.6  | 75,393.9  | 2.3%  | 2.5%  | 4.8%  | 58.5%",
    "openai_summarised_points": [
      "• The section on Australia's economy includes a table presenting main economic indicators from 1980 to 2023, with IMF staff estimates for 2024–2027, highlighting key economic trends and data points.",
      "• The table displays data in both purchasing power parity (PPP) and nominal US dollars, providing a comprehensive view of Australia's economic performance over nearly four decades.",
      "• Australia’s Gross Domestic Product (GDP) in 1980 was approximately 155.4 billion US$PPP, increasing to about 1,704.5 billion US$PPP in 2023, with projections reaching 1,771.6 billion US$PPP in 2024.",
      "• The GDP per capita (PPP) grew from roughly 10,498 US$ in 1980 to approximately 64,711.8 US$ in 2023, with an estimated increase to 66,535.5 US$ in 2024.",
      "• Nominal GDP in 1980 was about 162.8 billion US$, rising to approximately 1,787.9 billion US$ in 2023, with a forecast of 1,837.7 billion US$ in 2024.",
      "• Nominal GDP per capita increased from around 11,000.1 US$ in 1980 to approximately 68,023.2 US$ in 2023, projected to reach 69,018.2 US$ in 2024.",
      "• Real GDP growth rates varied over the years, with notable periods of expansion, such as 6.3% in 1984 and 4.9% in 2011, and contractions like -2.1% in 2020, reflecting economic impacts such as the COVID-19 pandemic.",
      "• Inflation rates fluctuated significantly, with high inflation of 10.1% in 1980 and 11.4% in 1982, and periods of low inflation, including 0.2% in 1997 and 0.9% in 2020, with the note that inflation under 5% is highlighted in green.",
      "• The unemployment rate ranged from a low of 4.3% in 2007 to a high of 10.1% in 1980, with recent figures around 3.7% in 2023, indicating relatively low unemployment levels in recent years.",
      "• Government debt as a percentage of GDP was not available (n/a) for years prior to 1990, but from 1990 onward, it increased from 16.4% in 1990 to a projected 60.5% in 2024, reflecting rising debt levels over time.",
      "• In 1991, government debt was 21.6% of GDP, rising to 30.5% in 2013, and reaching an estimated 60.5% in 2024, indicating a trend of increasing public debt relative to GDP.",
      "• The data underscores Australia's economic resilience and growth trajectory, with fluctuations influenced by global and domestic factors, including economic crises and policy changes.",
      "• The section emphasizes the need for updates as the data is current only up to 2024, with a call for recent event reflection and new information incorporation as of October 2024."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:45.280585",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4462,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Overview",
    "text": "Australia's annual inflation rate (percentage change in CPI) since 1949.\n\nAustralia's per-capita GDP is higher than that of the UK, Canada, Germany and\nFrance in terms of purchasing power parity. Per Capita GDP (PPP) Australia is\nranked 18th in the world (CIA World Factbook 2016). The country was ranked\nfifth in the United Nations 2022 Human Development Index and sixth in _The\nEconomist_ worldwide quality-of-life index 2005. In 2014, using constant\nexchange rates, Australia's wealth had grown by 4.4% annually on average after\nthe 2008 financial crisis, compared with a 9.2% rate over 2000–2007.\nAustralia's sovereign credit rating is \"AAA\" for all three major rating\nagencies, higher than the United States of America.\n\nThe emphasis on exporting commodities rather than manufactures underpinned a\nsignificant increase in Australia's terms of trade during the rise in\ncommodity prices since 2000. However, due to a colonial heritage a lot of\ncompanies operating in Australia are foreign-owned and as a result, Australia\nhas had persistent current account deficits for over 60 years despite periods\nof positive net merchandise exports; given the net income outlay between\nAustralia and the rest of the world is always negative. The current account\ndeficit totalled AUD$44.5 billion in 2016 or 2.6% of GDP.\n\nInflation has typically been between 2 and 3% and the pre-GFC cash rate\ntypically ranged between 5 and 7%, however, partly in response to the end of\nthe mining boom the cash rate has recently been steadily falling, dropping\nfrom 4.75% in October 2011 to 1.5% in Aug 2016, then to 1.25% in June 2019 and\n1.0% in July 2019. The service sector of the economy, including tourism,\neducation and financial services, constitutes 69% of GDP. Australian National\nUniversity in Canberra also provides a probabilistic interest-rate-setting\nproject for the Australian economy, which is compiled by shadow board members\nfrom the ANU academic staff.\n\nRich in natural resources, Australia is a major exporter of agricultural\nproducts, particularly wheat and wool, minerals such as iron ore and gold, and\nenergy in the forms of liquified natural gas and coal. Although agriculture\nand natural resources constitute only 3% and 5% of GDP, respectively, they\ncontribute substantially to Australia's export composition. Australia's\nlargest export markets are Japan, China, South Korea, India and the United\nStates.\n\nAt the turn of the current century, Australia experienced a significant mining\nboom. The mining sector's contribution to overall GDP grew from around 4.5% in\n1993–94, to almost 8% in 2006–07. The services sector also grew considerably,\nwith property and business services in particular growing from 10% to 14.5% of\nGDP over the same period, making it the largest single component of GDP (in\nsectoral terms). This growth has largely been at the expense of the\nmanufacturing sector, which in 2006–07 accounted for around 12% of GDP. A\ndecade earlier, it was the largest sector in the economy, accounting for just\nover 15% of GDP.\n\nIn 2018 Australia became the country with the largest median wealth per adult,\nbut slipped back to second highest after Switzerland in 2019. Australia's\ntotal wealth was estimated to be AUD$10.9 trillion as of September 2019.",
    "openai_summarised_points": [
      "• Australia's annual inflation rate, measured by the percentage change in the Consumer Price Index (CPI), has varied over time since 1949, reflecting fluctuations in the country's price stability.",
      "• Australia's per-capita Gross Domestic Product (GDP), adjusted for purchasing power parity (PPP), exceeds that of the United Kingdom, Canada, Germany, and France, ranking 18th globally according to the CIA World Factbook 2016.",
      "• In 2022, Australia was ranked fifth in the United Nations Human Development Index, indicating a high level of human development.",
      "• In 2005, Australia was ranked sixth in _The Economist_'s worldwide quality-of-life index, highlighting its high living standards.",
      "• Post-2008 financial crisis, Australia's wealth grew by an average of 4.4% annually in 2014 using constant exchange rates, compared to a 9.2% average growth rate during 2000–2007.",
      "• Australia holds a sovereign credit rating of \"AAA\" from all three major rating agencies, which is higher than the credit rating of the United States of America.",
      "• The country's economy has historically emphasized exporting commodities rather than manufactured goods, which contributed to a significant increase in Australia's terms of trade following the rise in global commodity prices since 2000.",
      "• Due to colonial heritage, many companies operating in Australia are foreign-owned, leading to persistent current account deficits for over 60 years despite periods of positive net merchandise exports; this is because net income outflows to the rest of the world are always negative.",
      "• The current account deficit in Australia was AUD$44.5 billion in 2016, representing 2.6% of GDP.",
      "• Inflation in Australia has generally ranged between 2% and 3%, with the pre-GFC cash rate typically between 5% and 7%.",
      "• In response to the end of the mining boom, the cash rate has been steadily decreasing, from 4.75% in October 2011 to 1.5% in August 2016, then to 1.25% in June 2019, and further down to 1.0% in July 2019.",
      "• The service sector, including tourism, education, and financial services, accounts for 69% of Australia's GDP.",
      "• The Australian National University in Canberra provides a probabilistic interest-rate-setting model for the economy, involving shadow board members from the university's academic staff.",
      "• Australia is rich in natural resources and is a major exporter of agricultural products (notably wheat and wool), minerals (such as iron ore and gold), and energy resources (liquefied natural gas and coal).",
      "• Although agriculture and natural resources constitute only 3% and 5% of GDP respectively, they significantly contribute to Australia's export profile.",
      "• Australia's primary export markets include Japan, China, South Korea, India, and the United States.",
      "• Around the turn of the 21st century, Australia experienced a substantial mining boom, with the mining sector's contribution to GDP increasing from approximately 4.5% in 1993–94 to nearly 8% in 2006–07.",
      "• The services sector, especially property and business services, grew from 10% to 14.5% of GDP between 1993–94 and 2006–07, becoming the largest sector in terms of GDP composition.",
      "• This growth in services largely came at the expense of manufacturing, which accounted for about 15% of GDP in 1996–97 but declined to around 12% in 2006–07, when it was no longer the largest sector.",
      "• In 2018, Australia became the country with the highest median wealth per adult globally but fell to second place after Switzerland in 2019.",
      "• As of September 2019, Australia's total wealth was estimated at AUD$10.9 trillion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:25:57.074316",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3261,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Regional differences",
    "text": "Between 2010 and 2013, much of the economic growth in Australia was attributed\nto areas of the country where mining- and resource-based industries and\nservices are mostly located. Western Australia and the Northern Territory are\nthe only states that have economic growth. During 2012 and 2013 Australian\nCapital Territory, Queensland, Tasmania, South Australia, New South Wales and\nVictoria experienced recessions at various times. The Australian economy is\ncharacterised as a \"two-speed economy\".[_clarification needed_] From June 2012\nto March 2013 Victoria experienced a recession. In 2012 the Government of\nVictoria cut 10% of all jobs in the public service. The period since has seen\nthese trends reversed with Western Australia and Northern Territory, who are\nheavily dependent on mining, experience significant downturns in GDP while the\neastern states returned to growth, led by strong upturns in NSW and Victoria.",
    "openai_summarised_points": [
      "• Between 2010 and 2013, Australia's economic growth was primarily driven by regions with concentrated mining-, resource-based industries, and related services.",
      "• Western Australia and the Northern Territory were the only states experiencing economic growth during this period.",
      "• During 2012 and 2013, several states—Australian Capital Territory, Queensland, Tasmania, South Australia, New South Wales, and Victoria—underwent recessions at different times.",
      "• The Australian economy is characterized as a \"two-speed economy,\" indicating divergent regional economic performances.",
      "• From June 2012 to March 2013, Victoria experienced a recession.",
      "• In 2012, the Government of Victoria implemented a 10% reduction in public service employment.",
      "• Since that period, economic trends reversed: Western Australia and the Northern Territory, heavily reliant on mining, faced significant GDP downturns, while eastern states, notably New South Wales and Victoria, returned to growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:00.391576",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 922,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Taxation",
    "text": "Quarterly taxation revenue ($millions) since 1959.\n\nTaxation in Australia is levied at the federal, state, and local government\nlevels. The federal government raises revenue from personal income taxes and\nbusiness taxes. Other taxes include the goods and services tax (General\nService Tax), excise and customs duties. The federal government is the main\nsource of income for state governments. As a result of state dependence on\nfederal taxation revenue to meet decentralised expenditure responsibilities,\nAustralia is said to have a vertical fiscal imbalance.\n\nBesides receipts of funds from the federal government, states and territories\nhave their own taxes, in many cases as slightly different rates. State taxes\ncommonly include payroll tax levied on businesses, a poker-machine tax on\nbusinesses that offer gambling services, land tax on people and businesses\nthat own land and most significantly, stamp duty on sales of land (in every\nstate) and other items (chattels in some states, unlisted shares in others,\nand even sales of contracts in some states).\n\nThe states effectively lost the ability to raise income tax during the Second\nWorld War. In 1942, Canberra invoked its Constitutional taxation power (s. 51\n(ii)) and enacted the _Income Tax Act_ and three other statutes to levy a\nuniform income tax across the country. These acts sought to raise the funds\nnecessary to meet burgeoning wartime expenses and reduce the unequal tax\nburden between the states by replacing state income taxes with a centralised\ntax system. The legislation could not expressly prohibit state income taxes\n(s. 51(ii) does not curtail the power of states to levy taxes) but the federal\ngovernment's proposal made localised income tax extremely difficult\npolitically. The federal government offered instead compensatory grants\nauthorised by s. 96 of the Constitution for the loss of state income (_State\nGrants (Income Tax Reimbursement) Act 1942_).\n\nThe states rejected Canberra's regime and challenged the legislation's\nvalidity in the First Uniform Tax Case (_South Australia v Commonwealth_) of\n1942. The High Court of Australia held that each of the statutes establishing\nCommonwealth income tax was a valid use of the s. 51(ii) power, in which\nLatham CJ noted that the system did not undermine essential state functions\nand imposed only economic and political pressure upon them.\n\nThe Second Uniform Tax Case (_Victoria v Commonwealth_ (1957)) reaffirmed the\ncourt's earlier decision and confirmed the power of the federal government's\npower to make s. 96 grants conditionally (in this case, a grant made on the\ncondition that the recipient state does not levy income tax).\n\nSince the Second Uniform Tax Case, a number of other political and legal\ndecisions have centralised fiscal power with the Commonwealth. In _Ha vs. New\nSouth Wales_ (1997), the High Court found that the _Business Franchise\nLicences (Tobacco) Act 1987_ (NSW) was invalid because it levied a customs\nduty, a power exercisable only by the Commonwealth (s.90). This decision\neffectively invalidated state taxes on cigarettes, alcohol and petrol.\nSimilarly, the imposition of a Commonwealth goods and services tax (GST) in\n2000 transferred another revenue base to the Commonwealth.\n\nConsequently, Australia has one of the most pronounced vertical fiscal\nimbalances in the world: the states and territories collect just 18% of all\ngovernmental revenues but are responsible for almost 50% of the spending\nareas. Furthermore, the centralisation of revenue collection has allowed\nCanberra to force state policy in areas well beyond the scope of its\nconstitutional powers, by using the grants power (s.96) to mandate the terms\non which the states spend money in areas over which it has no power (such as\nspending on education, health and policing).\n\nLocal governments (called _councils_ in Australia) have their own taxes\n(called rates) to enable them to provide services such as local road repairs,\nlocal planning and building management, garbage collection, street cleaning,\npark maintenance services, libraries, and museums. Councils also rely on state\nand federal funding to provide infrastructure and services such as roads,\nbridges, sporting facilities and buildings, aged care, maternal and child\nhealth, and childcare.\n\nIn 2000, a goods and services tax (GST) was introduced, similar to the\nEuropean-style VAT.",
    "openai_summarised_points": [
      "• Taxation in Australia is levied at three levels: federal, state, and local government, with each level responsible for different types of taxes and revenue collection.",
      "• The federal government primarily raises revenue through personal income taxes and business taxes, supplemented by other taxes such as the goods and services tax (GST), excise duties, and customs duties.",
      "• The federal government is the main source of income for state governments, leading to a vertical fiscal imbalance where states rely heavily on federal transfers.",
      "• Australia is characterized by a significant vertical fiscal imbalance, with states and territories collecting only 18% of total government revenues but being responsible for nearly 50% of government expenditure.",
      "• Due to dependence on federal funding, the federal government can influence state policies through conditional grants, especially under section 96 of the Australian Constitution.",
      "• State taxes commonly include payroll tax on businesses, a poker-machine tax on gambling businesses, land tax on landowners, and stamp duty on land sales and other transactions.",
      "• Stamp duty is a significant source of revenue for states, applied on sales of land, chattels (in some states), unlisted shares (in others), and contracts (in some states).",
      "• During World War II, states effectively lost the ability to levy income tax after Canberra invoked its constitutional power (section 51(ii)) in 1942, enacting the Income Tax Act and three other statutes to impose a uniform income tax nationwide.",
      "• The legislation aimed to fund wartime expenses and reduce tax disparities between states by replacing state income taxes with a centralized system, though it did not explicitly prohibit states from levying their own income taxes.",
      "• The federal government compensated states for the loss of income tax revenue through grants authorized by section 96 of the Constitution, notably the State Grants (Income Tax Reimbursement) Act 1942.",
      "• The validity of the Commonwealth’s income tax legislation was challenged in the First Uniform Tax Case (South Australia v Commonwealth, 1942), where the High Court upheld the statutes as valid exercises of section 51(ii), noting they did not undermine essential state functions but exerted economic and political pressure.",
      "• The Second Uniform Tax Case (Victoria v Commonwealth, 1957) reaffirmed the Court’s earlier decision and confirmed that conditional grants under section 96 could be used to influence state taxation policies, such as preventing states from levying income tax.",
      "• Legal and political decisions since the Second Uniform Tax Case have increasingly centralized fiscal power within the Commonwealth, reducing state taxation autonomy.",
      "• In Ha vs. New South Wales (1997), the High Court invalidated the NSW Business Franchise Licences (Tobacco) Act 1987 because it levied a customs duty, a power exclusively reserved for the Commonwealth under section 90, effectively invalidating state taxes on cigarettes, alcohol, and petrol.",
      "• The introduction of the Commonwealth goods and services tax (GST) in 2000 further transferred revenue-raising powers from states to the federal government.",
      "• Australia’s vertical fiscal imbalance is one of the most pronounced globally, with states and territories responsible for nearly half of government expenditure but collecting only 18% of revenue.",
      "• The centralization of revenue collection has enabled the federal government to influence state policy beyond constitutional powers by conditioning grants, especially in areas like education, health, and policing.",
      "• Local governments, known as councils, have their own taxes called rates, which fund local services such as road repairs, planning, building management, garbage collection, street cleaning, park maintenance, libraries, and museums.",
      "• Councils also depend on state and federal funding to provide infrastructure and services including roads, bridges, sporting facilities, aged care, maternal and child health, and childcare.",
      "• In 2000, Australia introduced the goods and services tax (GST), a value-added tax similar to the European VAT, to diversify and increase revenue sources at the federal level."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:11.978436",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4375,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Employment",
    "text": "The seasonally adjusted unemployment rate since 1978 The number of job\nvacancies (thousands) since 1979\n\nAccording to the Australian Bureau of Statistics (ABS) seasonally adjusted\nestimates, the unemployment rate remained steady at 4.1% in April 2025 while\nthe labour force participation rate increased 0.3 points to 67.1%. The\nparticipation rate for 15- to 24-year-olds remained steady at 70.0% while the\nunemployment rate for this group decreased by 0.1 points to 8.8%. According to\nthe ABS, in April 2025, the underemployment rate increased by 0.1 points to\n6.0%, while the underutilisation rate (the unemployed plus the under-employed)\ndecreased by 0.1 points to 14.4% seasonally adjusted.\n\nIn 2007, 228,621 Newstart unemployment allowance recipients were registered, a\ntotal that increased to 646,414 or 5.3% of the total labour force by March\n2013. As of December 2018, the number of Newstart recipients stands at 722,923\nor 5.4% of the labour force.\n\nThe accuracy of official unemployment figures has been brought into question\nin the Australian media due to discrepancies between the methods of different\nresearch bodies (Roy Morgan versus the ABS), differing definitions of the term\n'unemployed' and the ABS' practice of counting under-employed people as\n\"employed\".\n\nAs of February 2024, the Australia labour force were employed in the following\nindustries (seasonally adjusted) :\n\nRank | Industry | No. of employees\n('000s) | % of total\n---|---|---|---\n1 | Health care and social assistance | 2228.1 | 15.6%\n2 | Retail trade | 1345.4 | 9.4%\n3 | Construction | 1320.0 | 9.2%\n4 | Professional, scientific and technical services | 1318.2 | 9.2%\n5 | Education and training | 1227.4 | 8.6%\n6 | Public administration and safety | 934.9 | 6.5%\n7 | Manufacturing | 914.5 | 6.4%\n8 | Accommodation and food services | 905.2 | 6.3%\n9 | Transport, postal and warehousing | 727.5 | 5.1%\n10 | Financial and insurance services | 541.3 | 3.8%\n11 | Administrative and support services | 418.7 | 2.9%\n12 | Wholesale trade | 407.3 | 2.8%\n13 | Agriculture, forestry and fishing | 318.2 | 2.2%\n14 | Mining | 311.8 | 2.2%\n15 | Arts and recreation services | 273.3 | 1.9%\n16 | Rental, hiring and real estate services | 226.7 | 1.6%\n17 | Information media and telecommunications | 191.1 | 1.3%\n18 | Electricity, gas, water and waste services | 162.2 | 1.1%\n| **Total labour force** | **14294.2** | **100.0%**",
    "openai_summarised_points": [
      "• The seasonally adjusted unemployment rate in Australia since 1978 has been monitored, with specific estimates available up to April 2025.",
      "• In April 2025, the Australian Bureau of Statistics (ABS) reported the unemployment rate remained steady at 4.1%.",
      "• The labour force participation rate increased by 0.3 percentage points to 67.1% in April 2025.",
      "• The participation rate for 15- to 24-year-olds remained steady at 70.0%, while their unemployment rate decreased by 0.1 points to 8.8% during the same period.",
      "• The underemployment rate in April 2025 increased slightly by 0.1 points to 6.0%, indicating a small rise in part-time workers seeking full-time work.",
      "• The underutilisation rate, which combines unemployed and under-employed individuals, decreased by 0.1 points to 14.4% seasonally adjusted in April 2025.",
      "• The number of Newstart unemployment allowance recipients in Australia was 228,621 in 2007.",
      "• This figure increased to 646,414 recipients, representing 5.3% of the total labour force by March 2013.",
      "• As of December 2018, the number of Newstart recipients further rose to 722,923, accounting for 5.4% of the labour force.",
      "• The accuracy of official unemployment figures has been questioned in Australian media due to discrepancies between different research methodologies, notably between Roy Morgan and the ABS.",
      "• Concerns also exist over differing definitions of 'unemployed' and the ABS practice of counting under-employed individuals as 'employed'.",
      "• As of February 2024, the Australian labour force was employed across various industries with the following distribution (seasonally adjusted):",
      "• Health care and social assistance: 2,228,100 employees (15.6%)",
      "• Retail trade: 1,345,400 employees (9.4%)",
      "• Construction: 1,320,000 employees (9.2%)",
      "• Professional, scientific and technical services: 1,318,200 employees (9.2%)",
      "• Education and training: 1,227,400 employees (8.6%)",
      "• Public administration and safety: 934,900 employees (6.5%)",
      "• Manufacturing: 914,500 employees (6.4%)",
      "• Accommodation and food services: 905,200 employees (6.3%)",
      "• Transport, postal and warehousing: 727,500 employees (5.1%)",
      "• Financial and insurance services: 541,300 employees (3.8%)",
      "• Administrative and support services: 418,700 employees (2.9%)",
      "• Wholesale trade: 407,300 employees (2.8%)",
      "• Agriculture, forestry and fishing: 318,200 employees (2.2%)",
      "• Mining: 311,800 employees (2.2%)",
      "• Arts and recreation services: 273,300 employees (1.9%)",
      "• Rental, hiring and real estate services: 226,700 employees (1.6%)",
      "• Information media and telecommunications: 191,100 employees (1.3%)",
      "• Electricity, gas, water and waste services: 162,200 employees (1.1%)",
      "• The total labour force in February 2024 was approximately 14,294,200 employed individuals, representing 100% of the employed workforce."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:22.719274",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2395,
      "bullet_points_count": 31
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Employment for newly qualified professionals",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( May 2025)_\n---|---\n\nAccording to the Australian Graduate Survey done by _Graduate Careers\nAustralia_ , full-time employment for newly qualified professionals from\nvarious occupations (around four months after the completion of their\nqualifications) experienced some declines between 2012 and 2015. Some examples\nare:\n\nField of Education | 2012 | 2013 | 2014 | 2015 | Change 2012–2015\n---|---|---|---|---|---\nDentistry | 23.6% | 83.3% | 32.1% | 96.7% | +3.1%\nComputer Science | 24.7% | 70.3% | 67.2% | 67% | -7.7%\nArchitecture | 63.9% | 11.0% | 57.8% | 70.2% | +6.3%\nPsychology | 61.1% | 56.1% | 42.0% | 55.2% | -7.9%\nBusiness studies | 74.5% | 71.8% | 9.7% | 70.8% | -3.7%\nElectronic/Computer engineering | 55.2% | 80.9% | 74.9% | 78.1% | -1.4%\nMechanical engineering | 18.4% | 82.4% | 71.0% | 72.8% | -16.2%\nSurveying | 93.0% | 86.5% | 83.9% | 90.7% | -2.3%\nHealth other | 3.3% | 69.7% | 70.4% | 69.2% | -4.1%\nNursing (initial) | 92.2% | 83.1% | 81.2% | 79% | -13.2%\nNursing (post-initial) | 16.1% | 71.4% | 75.8% | 94.9% | -11.2%\nMedicine | 98.1% | 96.9% | 97.5% | 96.3% | -1.8%\nEducation (initial) | 74.9% | 70.8% | 71% | 71.8% | -3.1%\nEducation (post-initial) | 12.8% | 71.4% | 69.2% | 72.7% | +13.9%\n\nThe Graduate Careers Survey 2014 explained, \"However, GCA's Beyond Graduation\nSurvey (BGS) indicates that the middle- and longer-term outlook is very\npositive, with the employment figures for 2010 graduates growing by 14\npercentage points three years later.\" The Beyond Graduation Survey 2013\nincluded 12,384 responses and the Graduate Careers Survey 2014 survey included\n113,263 responses (\"59.3 per cent of the almost 191,000 Australian resident\ngraduates who were surveyed responded to the AGS.\")\n\nThe professional associations of some of these occupations expressed their\ncriticism of the immigration policy in 2014.",
    "openai_summarised_points": [
      "• The section on employment for newly qualified professionals in Australia highlights data from the Australian Graduate Survey conducted by Graduate Careers Australia (GCA), focusing on full-time employment rates approximately four months after qualification.",
      "• Between 2012 and 2015, there were notable declines in employment rates for certain occupations, although some fields experienced increases.",
      "• In Dentistry, employment rates rose from 23.6% in 2012 to 96.7% in 2015, representing a +3.1 percentage point change over the period.",
      "• Computer Science graduates saw a decline from 24.7% in 2012 to 67% in 2015, a decrease of -7.7 percentage points.",
      "• Architecture employment rates fluctuated, starting at 63.9% in 2012, dropping to 11.0% in 2013, then increasing to 70.2% in 2015, with an overall increase of +6.3 percentage points from 2012 to 2015.",
      "• Psychology graduates experienced a decline from 61.1% in 2012 to 55.2% in 2015, a decrease of -7.9 percentage points.",
      "• Business studies employment rates decreased from 74.5% in 2012 to 70.8% in 2015, a -3.7 percentage point change.",
      "• Electronic and Computer Engineering graduates saw a slight decrease from 55.2% in 2012 to 78.1% in 2015, a -1.4 percentage point change.",
      "• Mechanical Engineering employment rates declined significantly from 18.4% in 2012 to 72.8% in 2015, a -16.2 percentage point change.",
      "• Surveying maintained relatively high employment, decreasing slightly from 93.0% in 2012 to 90.7% in 2015, a -2.3 percentage point change.",
      "• Employment for health-related fields other than nursing was very low initially at 3.3% in 2012 but increased to 69.2% in 2015, a -4.1 percentage point change.",
      "• Nursing (initial qualification) employment rates decreased from 92.2% in 2012 to 79% in 2015, a -13.2 percentage point change.",
      "• Nursing (post-initial qualification) employment increased from 16.1% in 2012 to 94.9% in 2015, a -11.2 percentage point change.",
      "• Medicine graduates maintained high employment rates, decreasing slightly from 98.1% in 2012 to 96.3% in 2015, a -1.8 percentage point change.",
      "• Education (initial qualification) employment rates declined from 74.9% in 2012 to 71.8% in 2015, a -3.1 percentage point change.",
      "• Education (post-initial qualification) employment rates increased from 12.8% in 2012 to 72.7% in 2015, a +13.9 percentage point change.",
      "• The 2014 Graduate Careers Survey (GCA) indicated a positive outlook in the medium to long term, with employment figures for 2010 graduates increasing by 14 percentage points three years later.",
      "• The Beyond Graduation Survey (BGS) 2013 included 12,384 responses, while the 2014 GCA survey collected 113,263 responses, representing 59.3% of the nearly 191,000 Australian resident graduates surveyed.",
      "• In 2014, professional associations representing some of these occupations publicly criticized Australia's immigration policy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:33.112310",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1958,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "States and territories ranked by unemployment rates",
    "text": "Rank | States | Unemployment rate\n(April 2025)\n---|---|---\n1  | Victoria  | 4.2%\n2  | New South Wales  | 4.2%\n3  | Western Australia  | 4.2%\n4  | Northern Territory  | 4.0%\n5  | South Australia  | 3.9%\n6  | New South Wales  | 3.9%\n7  | Australian Capital Territory  | 3.8%\n8  | Tasmania  | 3.8%\n\nNote: All data in the table above is seasonally adjusted.",
    "openai_summarised_points": [
      "• The section presents a ranking of Australian states and territories based on their unemployment rates as of April 2025.",
      "• The data is seasonally adjusted, ensuring that seasonal fluctuations do not distort the unemployment figures.",
      "• Victoria, New South Wales, and Western Australia share the highest unemployment rate among the listed regions, each at 4.2%.",
      "• The Northern Territory has a slightly lower unemployment rate at 4.0%, ranking fourth in the list.",
      "• South Australia and New South Wales both have unemployment rates of 3.9%, sharing the fifth and sixth positions respectively.",
      "• The Australian Capital Territory and Tasmania have the lowest unemployment rates among the regions listed, each at 3.8%.",
      "• The ranking indicates that unemployment rates vary slightly across different regions, with the highest being 4.2% and the lowest 3.8%.",
      "• The data reflects the economic conditions of Australian states and territories as of April 2025, providing insights into regional labor market performance."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:37.262884",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 353,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Sectors",
    "text": "Gross operating profits across all industries since 1994 ($millions/quarter)",
    "openai_summarised_points": [
      "• The section discusses the economic sectors of Australia, focusing on the distribution and characteristics of various industries within the country's economy.",
      "• It presents data on gross operating profits across all industries in Australia, measured in millions of Australian dollars, on a quarterly basis since 1994.",
      "• The data highlights the fluctuations and trends in industry profitability over time, reflecting economic cycles, policy impacts, and global economic conditions.",
      "• Specific figures for gross operating profits are provided in millions of dollars, illustrating the scale and economic significance of different sectors.",
      "• The timeline from 1994 onward is used to analyze long-term trends, with notable peaks and troughs corresponding to economic events or sector-specific developments.",
      "• The data serves as an indicator of overall industry health, investment climate, and economic performance within Australia.",
      "• The presentation of quarterly data allows for detailed analysis of seasonal variations and short-term economic shocks affecting industry profits.",
      "• The section emphasizes the importance of understanding industry profitability for economic planning, policy formulation, and investment decisions in Australia.",
      "• It underscores the role of various industries—such as mining, manufacturing, services, and agriculture—in contributing to the national economy.",
      "• The data and analysis aim to provide insights into the structural changes and resilience of Australia's economy over the past three decades."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:40.269683",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 76,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.0.1",
    "section_name": "Mining",
    "text": "Australian energy resources and major export ports map\n\nIn 2019, the country was the 2nd largest world producer of gold; 8th largest\nworld producer of silver; 6th largest world producer of copper; the world's\nlargest producer of iron ore; the world's largest producer of bauxite; the 2nd\nlargest world producer of manganese; 2nd largest world producer of lead; 3rd\nlargest world producer of zinc; 3rd largest world producer of cobalt; 3rd\nlargest producer of uranium; 6th largest producer of nickel; 8th largest world\nproducer of tin; 14th largest world producer of phosphate; 15th largest world\nproducer of sulfur; in addition to being the 5th largest world producer of\nsalt. The country is also a major producer of precious stones. Australia is\nthe world's largest producer of opal and is one of the largest producers of\ndiamond, ruby, sapphire and jade. In non-renewable energies, in 2020, the\ncountry was the 30th largest producer of oil in the world, extracting 351.1\nthousand barrels / day. In 2019, the country consumed 1 million barrels / day\n(20th largest consumer in the world). The country was the 20th largest oil\nimporter in the world in 2018 (461.9 thousand barrels / day). In 2015,\nAustralia was the 12th largest world producer of natural gas, 67.2 billion m3\nper year. In 2019, the country was the 22nd largest gas consumer (41.9 billion\nm3 per year) and was the 10th largest gas exporter in the world in 2015: 34.0\nbillion m3 per year. In the production of coal, the country was the 4th\nlargest in the world in 2018: 481.3 million tons. Australia is the 2nd largest\ncoal exporter in the world (387 million tons in 2018).\n\nIn 2014–15 mineral extraction in Australia was valued at 212 billion\nAustralian dollars. Of this, coal represented 45,869 million, oil and natural\ngas 40,369 million, iron ore 69,486 million, gold ore 13,685 million, and\nother metals 7,903 million.\n\nCoal is mined primarily in Queensland, New South Wales and Victoria. Fifty-\nfour per cent of the coal mined in Australia is exported, mostly to East Asia.\nIn 2000–01, 258.5 million tonnes of coal was mined, and 193.6 million tonnes\nexported. Coal provides about 85% of Australia's electricity production. In\nfiscal year 2008–09, 487 million tonnes of coal was mined, and 261 million\ntonnes exported. Australia is the world's leading coal exporter.\n\nThe Australian mining corporations Rio Tinto Group and BHP are among the\nlargest in the world.\n\nRio Tinto's Argyle mine in Western Australia was the second-largest diamond\nmine in the world. The Argyle mine opened in 1983 and has produced more than\n95 per cent of Australia's diamonds, including some of the world's most\nvaluable pink and red diamonds. Due to the depletion of ore, Argyle closed in\n2020—the closure was expected to reduce Australia's yearly diamond output from\n14.2 million carats to 134.7 thousand carats.",
    "openai_summarised_points": [
      "• In 2019, Australia was the second-largest producer of gold globally, and ranked eighth in silver production, sixth in copper, and was the world's largest producer of iron ore and bauxite.",
      "• Australia was the second-largest producer of manganese and lead, third in zinc, cobalt, and uranium, sixth in nickel, eighth in tin, fourteenth in phosphate, and fifteenth in sulfur, highlighting its extensive mineral resource output.",
      "• The country is also a major producer of precious stones, being the world's largest producer of opal and among the largest producers of diamond, ruby, sapphire, and jade.",
      "• In non-renewable energies, Australia was the 30th largest oil producer in 2020, extracting 351.1 thousand barrels per day; in 2019, it consumed approximately 1 million barrels per day, making it the 20th largest oil consumer globally.",
      "• Australia was the 20th largest oil importer in 2018, importing 461.9 thousand barrels per day.",
      "• In 2015, Australia was the 12th largest natural gas producer, with an output of 67.2 billion cubic meters annually; in 2019, it was the 22nd largest gas consumer at 41.9 billion cubic meters per year and was the 10th largest gas exporter, exporting 34.0 billion cubic meters in 2015.",
      "• The country produced 481.3 million tons of coal in 2018, ranking as the fourth-largest coal producer worldwide, and was the second-largest coal exporter with 387 million tons exported in 2018.",
      "• During 2014–15, mineral extraction in Australia was valued at 212 billion Australian dollars, with coal accounting for 45,869 million AUD, oil and natural gas 40,369 million AUD, iron ore 69,486 million AUD, gold ore 13,685 million AUD, and other metals totaling 7,903 million AUD.",
      "• Coal mining is concentrated in Queensland, New South Wales, and Victoria, with 54% of mined coal exported mainly to East Asia.",
      "• In 2000–01, Australia mined 258.5 million tonnes of coal, with 193.6 million tonnes exported; coal supplies approximately 85% of the country's electricity.",
      "• In the fiscal year 2008–09, coal production increased to 487 million tonnes, with 261 million tonnes exported, establishing Australia as the world's leading coal exporter.",
      "• The major Australian mining corporations include Rio Tinto Group and BHP, both among the largest mining companies globally.",
      "• Rio Tinto's Argyle mine in Western Australia, opened in 1983, was the second-largest diamond mine in the world and produced over 95% of Australia's diamonds, including valuable pink and red diamonds.",
      "• The Argyle mine closed in 2020 due to ore depletion, which was expected to reduce Australia's annual diamond output from 14.2 million carats to approximately 134,700 carats."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:48.840325",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2861,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.0.2",
    "section_name": "Manufacturing",
    "text": "The manufacturing industry in Australia has declined from 30% of GDP in the\n1960s to 12% of GDP in 2007.\n\nIn 2008, four companies mass-produced cars in Australia. Mitsubishi ceased\nproduction in March 2008, followed by Ford in 2016, and Holden and Toyota in\n2017.\n\nUntil trade liberalisation in the mid-1980s, Australia had a large textile\nindustry. This decline continued through the first decade of the 21st century.\nSince the 1980s, tariffs have steadily been reduced; in early 2010, the\ntariffs were reduced from 17.5 per cent to 10 per cent on clothing, and\n7.5–10% to 5% for footwear and other textiles. As of 2010, most textile\nmanufacturing, even by Australian companies, is performed in Asia.\n\nTotal employment in Australian textile, clothing and footwear manufacturing\n(thousands of people) since 1984",
    "openai_summarised_points": [
      "• The manufacturing industry in Australia has experienced a significant decline in its contribution to the national economy, decreasing from 30% of GDP in the 1960s to 12% of GDP in 2007.",
      "• In 2008, only four companies in Australia were engaged in mass-producing cars, indicating a substantial reduction in the automotive manufacturing sector.",
      "• Mitsubishi ceased car production in Australia in March 2008.",
      "• Ford discontinued its Australian car manufacturing operations in 2016.",
      "• Holden and Toyota both ceased manufacturing in Australia in 2017.",
      "• Prior to trade liberalization policies implemented in the mid-1980s, Australia maintained a large textile industry, which has since declined.",
      "• The decline of the textile industry continued through the first decade of the 21st century, reflecting ongoing industry contraction.",
      "• Starting from the 1980s, Australia progressively reduced tariffs; by early 2010, tariffs on clothing were lowered from 17.5% to 10%.",
      "• In the same period, tariffs on footwear and other textiles were reduced from 7.5–10% to 5%.",
      "• As of 2010, most textile manufacturing, including that by Australian companies, is conducted in Asia rather than domestically.",
      "• The total employment in Australian textile, clothing, and footwear manufacturing has been tracked since 1984, measured in thousands of people, highlighting industry employment trends over time."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:53.906392",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 811,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.0.3",
    "section_name": "Agriculture",
    "text": "In 2019, the value added from agriculture, fishing and forestry combined made\nup approximately 2.1% of Australia's GDP. 60% of farm products are exported.\nIrrigation is an important and widespread practice for a country where many\nparts receive low rainfall. Agriculture, forestry and fishing was the second-\nstrongest [_clarification needed_] industry from 2013 to 2015, with the number\nof employees growing from 295,495 in February 2013 to 325,321 in February\n2015.",
    "openai_summarised_points": [
      "• In 2019, the combined value added from agriculture, fishing, and forestry constituted approximately 2.1% of Australia's Gross Domestic Product (GDP).",
      "• Approximately 60% of farm products in Australia are exported, indicating a significant reliance on international markets.",
      "• Irrigation is a crucial and widely used practice in Australian agriculture due to the country's many regions experiencing low rainfall.",
      "• The agriculture, forestry, and fishing sector was the second-strongest industry in Australia from 2013 to 2015, reflecting its substantial economic contribution during that period.",
      "• The number of employees in this sector increased from 295,495 in February 2013 to 325,321 in February 2015, demonstrating sectoral growth over these two years."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:56.305860",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 467,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Services",
    "text": "IT-related jobs (such as computer systems design and engineering) are defined\nas Professional, Scientific and Technical Services by the Department of\nEducation, Employment and Workplace Relations of Australia. IT job creation\noccurs mostly in the state capital cities of Australia.",
    "openai_summarised_points": [
      "• IT-related jobs, including roles such as computer systems design and engineering, are classified under the category of Professional, Scientific and Technical Services by the Department of Education, Employment and Workplace Relations of Australia.",
      "• The majority of IT job creation in Australia occurs predominantly in the state capital cities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:26:58.002832",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 281,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1.1",
    "section_name": "Finance",
    "text": "Australia's \"big four banks\" (National Australia Bank, Commonwealth Bank,\nAustralia and New Zealand Banking Group and Westpac) are among the 'World's 50\nSafest Banks' as of April 2012.\n\nBetween 1991 and 2013, 36,720 mergers and acquisitions with a total known\nvalue of US$2,040 billion with the involvement of Australian firms have been\nannounced. In the year 2013, 1,515 transactions valued at US$78 billion had\nbeen announced which was a decrease in terms of numbers (−18%) and value\n(−11%) compared to 2012. The largest takeover or merger transaction involving\nAustralian companies was the 2007 takeover of the Coles Group by Wesfarmers,\ntotalling A$22 billion.",
    "openai_summarised_points": [
      "• As of April 2012, Australia's \"big four banks\"—National Australia Bank, Commonwealth Bank, Australia and New Zealand Banking Group, and Westpac—were recognized among the \"World's 50 Safest Banks,\" highlighting their strong financial stability and international reputation.",
      "• Between 1991 and 2013, Australian firms were involved in a total of 36,720 mergers and acquisitions (M&A) transactions, with the combined known value reaching approximately US$2,040 billion, indicating a highly active period of corporate consolidation and expansion.",
      "• In the year 2013, there were 1,515 M&A transactions involving Australian companies, with a total announced value of US$78 billion, representing a decline of 18% in the number of transactions and an 11% decrease in total value compared to the previous year, 2012.",
      "• The largest M&A transaction involving an Australian company was the 2007 takeover of the Coles Group by Wesfarmers, which was valued at A$22 billion, marking a significant consolidation in the Australian retail sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:27:00.971201",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 664,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1.2",
    "section_name": "Tourism",
    "text": "Monthly short-term arrivals in Australia since 1991. The large drop in\narrivals in 2020 is due to the COVID-19 pandemic.\n\nIn the financial year 2017/18, tourism represented 3.1% of Australia's GDP\ncontributing A$57.2 billion to the national economy. Domestic tourism is a\nsignificant part of the tourism industry, representing 73% of the total direct\ntourism GDP.\n\nIn calendar year 2018, there were 9.3 million visitor arrivals. Tourism\nemployed 646,000 people in Australia in 2017–18, 5.2% of the workforce. About\n43.7% of persons employed in tourism were part-time. Tourism also contributed\n8.0% of Australia's total export earnings in 2010–11.",
    "openai_summarised_points": [
      "• Monthly short-term arrivals in Australia have been recorded since 1991, with a significant decline observed in 2020 due to the COVID-19 pandemic.",
      "• During the financial year 2017/18, tourism accounted for 3.1% of Australia's Gross Domestic Product (GDP), contributing A$57.2 billion to the national economy.",
      "• Domestic tourism constitutes a substantial portion of the tourism industry in Australia, representing 73% of the total direct tourism GDP.",
      "• In the calendar year 2018, Australia experienced 9.3 million visitor arrivals.",
      "• Tourism employment in Australia during 2017–18 involved 646,000 individuals, which is 5.2% of the total workforce.",
      "• Approximately 43.7% of persons employed in the tourism sector were engaged in part-time positions.",
      "• In the fiscal year 2010–11, tourism contributed 8.0% to Australia's total export earnings."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:27:04.864124",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 646,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1.3",
    "section_name": "Creativity and culture",
    "text": "Growing importance is being given to the economic contribution of the creative\nindustries to the national economy. The United Nations Conference on Trade and\nDevelopment (UNCTAD) recompiles statistics about the export and import of\ngoods and services related to the creative industries. The World Intellectual\nProperty Organization (WIPO) has assisted in the preparation of national\nstudies measuring the size of over 50 copyright industries around the world.\nAccording to the WIPO compiled data, the national contribution of Creative\nindustries varies from 2% to 11% depending on the country.\n\nThe Australian Copyright Council (ACC) has been consistently compiling reports\nusing the WIPO-guided framework on the impact of the copyright-based\nindustries to Australia's economy in 2011, 2012, and 2014. In the most up-to-\ndate WIPO-supported study published in 2017, the copyright industries\ncontributed $122.8 billion to the Australian economy in 2016 amounting to 7.4%\nof Australia's total economic output. The 2016 figure represented an increase\nof $8.5 billion compared to 2011, with a growth in value added growing at 1.4%\nper annum (since 2011). Further, it found that these industries generated more\neconomic output than the manufacturing, health care and mining sectors in\n2016, and moved from being the 7th largest industry in 2011 to the 3rd in\n2016.",
    "openai_summarised_points": [
      "• Increasing recognition is being given to the economic contribution of creative industries to Australia's national economy, emphasizing their growing significance.",
      "• The United Nations Conference on Trade and Development (UNCTAD) compiles statistics on the export and import of goods and services related to creative industries worldwide, highlighting their international economic impact.",
      "• The World Intellectual Property Organization (WIPO) has supported the development of national studies that measure the size of over 50 copyright-based industries globally, providing a comparative framework.",
      "• According to WIPO data, the contribution of creative industries to national economies varies significantly, ranging from 2% to 11%, depending on the country.",
      "• The Australian Copyright Council (ACC) has consistently produced reports on the impact of copyright industries on Australia's economy, utilizing the WIPO-guided framework, with reports published in 2011, 2012, and 2014.",
      "• The most recent WIPO-supported study, published in 2017, estimates that in 2016, copyright industries contributed AUD 122.8 billion to the Australian economy, representing 7.4% of the country's total economic output.",
      "• The 2016 contribution of AUD 122.8 billion marked an increase of AUD 8.5 billion compared to 2011, demonstrating substantial growth over five years.",
      "• The value added by copyright industries in Australia grew at an average annual rate of 1.4% since 2011.",
      "• In 2016, copyright industries generated more economic output than the manufacturing, healthcare, and mining sectors combined, indicating their rising importance within the national economy.",
      "• The ranking of copyright industries in Australia's economic sectors improved from the 7th largest industry in 2011 to the 3rd largest in 2016, reflecting their expanding economic influence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:27:09.912359",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1359,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1.4",
    "section_name": "Media",
    "text": "In 2018, Australia was ranked 19th out of 180 countries in accordance to press\nfreedom. The media industry is highly consolidated, with News Corp Australia\nand Nine Entertainment publishing the majority of popular newspapers, owning\nmultiple television and radio stations, and providing the two major Australian\nstreaming services, Binge and Stan. Other major media companies include Ten\nNetwork, Seven West Media and the national broadcasters ABC and SBS."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.1.5",
    "section_name": "Education",
    "text": "School attendance is compulsory in Australia, from the age of 5 up until\napproximately 16 (although it varies between each state and territory).\nAustralia also has an adult literacy rate that was estimated to be 99% in\n2003.\n\nIn the Programme for International Student Assessment, Australia regularly\nscores among the top five of thirty major developed countries (member\ncountries of the Organisation for Economic Co-operation and Development). In\n2018 there were 525,054 international students in Australia, comprising a\nmarket of 32,2 billion A$."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Transportation",
    "text": "A map of major roads in Australia. Roads are the main method of transport in\nAustralia.\n\nAustralia's total transport activity contributed 7.9% to GDP in 2020–21, being\nhighly dependent on road transport. It is estimated that roads contribute to\nmore than A$245 billion, to the economic activity, significantly serving to\nagriculture, forestry, fishing, manufacturing and construction industries.\nThere are more than 300 airports with paved runways. Passenger rail transport\nincludes widespread commuter networks in the major capital cities with more\nlimited intercity and interstate networks. The Australian mining sector is\nreliant upon rail to transport its product to Australia's ports for export."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Energy",
    "text": "Australian renewable power plants\n\nThe Australian economy is dependent on imported crude oil and petroleum\nproducts, the economy's petroleum import dependency is around 80%—crude oil +\npetroleum products."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Trade and economic performance",
    "text": "Australia\n\nFree trade agreements in force\n\nIn the second half of the 20th century, Australian trade shifted away from\nEurope and North America to Japan and other East Asian markets. Regional\nfranchising businesses, now a $128 billion sector, have been operating co-\nbranded sites overseas for years with new investors coming from Western\nAustralia and Queensland.\n\nIn the late 19th century, Australia's economic strength relative to the rest\nof the world was reflected in its GDP. In 1870, Australia had the highest GDP\nper capita in the world due to economic growth fuelled by its natural\nresources. However, as Australia's population grew rapidly over the 20th\ncentury, its GDP per capita dropped relative to countries such as the US and\nNorway. However, the Australian economy has been performing nominally better\nthan other economies of the OECD and has supported economic growth for over 20\nconsecutive years. According to the Reserve Bank of Australia, Australian per\ncapita GDP growth is higher than that of New Zealand, US, Canada and The\nNetherlands. The past performance of the Australian economy has been heavily\ninfluenced by US, Japanese and Chinese economic growth."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Australian national debt",
    "text": "Australia bonds\n\n30 year\n\n20 year\n\n10 year\n\n5 year\n\n2 year\n\n1 year\n\nAustralia's net external debt exceeded $1 trillion in April 2017 as a result\nof Australia's structural current account deficits. Although these deficits\nhave narrowed over the last decade due to an increase in net merchandise\ntrade, this effect has been partly offset by the return of Australian\ngovernment debt; net federal debt was estimated at $326.0 billion in the\n2016–17 federal budget of which 60% is owed to foreigners. The entirety of the\ndebt has been accumulated through ten straight budget deficits as Australia\nhad negative net government debt (i.e. The Australian government had net\npositive bond holdings) a decade earlier in the 2006–07 fiscal year."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Chinese investment",
    "text": "There is substantial export to China of iron ore, wool and other raw\nmaterials, and over 120,000 Chinese students study in Australian schools and\nuniversities. China is the largest purchaser of Australian debt. In 2009,\noffers were made by state-owned Chinese companies to invest $22 billion in\nAustralia's resource extraction industry.\n\nThe Signing of the China-Australia Free-Trade Agreement, signed November 2014,\nhas the potential to drastically increase Chinese Investments as agriculture\nand services become more lenient.\n\nAustralia's special investor visa program introduced in 2012 encouraged\nChinese investment. The visa program fast-tracks visas and eases the residency\nrequirement for a permanent visa for those ready to invest over five million\nAustralian dollars into state government bonds, specific infrastructure and\nproperty investments. Wealthy Chinese interested in direct investment began\nlooking to Australia after Canada started scaling back its investment visa\nprogram in 2012 and eliminated its main investor visa program in 2014. In\nearly 2014 it was reported that the Australia's special investor visa was\ngranted to 65 mostly Chinese millionaires who brought over $440 million into\nthe country. By 2017, almost 90% of the more than 1,300 foreigners who used\nAustralia's special investor visa program were from China. Australia also has\nan investor visa program with a required investment of one million Australian\ndollars but with more restrictions and a lengthier period of time to get a\npermanent visa.\n\nIn 2017, it was reported that Australia is the third-most popular destination\nfor Chinese to invest wealth offshore, with a 7% increase in Chinese private\nwealth flowing into Australia while interest in the top two investment\ndestinations, Hong Kong and the United States, fell by 18% and 3%,\nrespectively. In 2017 there were 1.6 million high-net-worth Chinese (with at\nleast 10 million Chinese yuan to invest) and 24 per cent of the 3,000 wealthy\nChinese surveyed had private investments in Australia. Migration was one of\nthe top three reasons for Chinese investment offshore.\n\nIn 2018, in the Lowy Institute poll there had a sharp rise in the proportion\nof the Australian population who say the Australian government is \"allowing\ntoo much investment from China\".[_citation needed_]\n\nThis number rose from 56 per cent in 2014 to 72 per cent in 2018."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Australia's balance of payments",
    "text": "Australia's current account (in $M) since 1959 Australia's current account as\na proportion of GDP since 1959\n\nIn trade terms, the Australian economy has had persistently large current\naccount deficits (CADs) for more than 50 years. One of the factors that\nundermines balance of payments is Australia's export base, making it highly\nvulnerable to the volatility in the prices of commodity goods. In addition,\ndue to a colonial heritage a lot of companies operating in Australia are\nforeign-owned and, as a result, Australia's net income outlay between it and\nthe rest of the world is always negative; this results in persistent current\naccount deficits even when there is a positive export.\n\nDependent upon commodities, the Australian government endeavoured to redevelop\nthe Australian manufacturing sector. This initiative, also known as\nmicroeconomic reform, helped Australian manufacturing to grow from 10.1% in\n1983–1984 to 17.8% in 2003–2004.\n\nThere are other factors that have contributed to the extremely high current\naccount deficit in Australia such as lack of international competitiveness.\n\nHowever, as Australia's CAD is almost entirely generated by the private\nsector, as outlined in Professor John Pitchford's 'Consenting Adults Thesis'\nin the early 1990s, there is an argument that the CAD is not a significant\nissue. Historically, Australia has relied on overseas capital to fill the gap\nbetween domestic savings and investment, and many of these investment\nopportunities could not have been pursued if Australia did not have access to\nforeign savings. This suggests that Australia's apparently low savings level\nand CAD are not necessarily a significant problem. As long as the investment\nthat is being funded by overseas capital inflow generates sufficient returns\nto pay for the servicing costs in the future, the increase in foreign\nliabilities can be viewed as sustainable in the longer term."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Personal wealth",
    "text": "GNI per capita in 2015\n\nAccording to the 2011 Credit Suisse Global Wealth report, Australia's wealth\nper adult had quadrupled over the past decade, and its total wealth was US$6.4\ntrillion. In the report Australia was the second-wealthiest country in the\nworld behind Switzerland based on average wealth per adult, and had the\nhighest median wealth in the world (US$222,000, nearly four times the amount\nof each US adult) and a proportion of people with wealth above US$100,000 that\nwas eight times the world average. This was attributed to a resilient\nAustralian dollar, property ownership levels and a strong labour market.\nCompared to the rest of the world, very few Australians had a net worth of\nless than US$1,000, which was attributed to relatively low credit card and\nstudent loan debt. In 2013, Australia was identified by the Credit Suisse as\nretaining its 2012 position as the nation with the second-highest average\nwealth per adult (US$403,000); however, the nation's poverty rate was also\nreported to have increased from 10.2% in 2000–01 to 11.8% at the time of the\n2013 report on global wealth.\n\nDespite the economic slowdown, in the 2014 Credit Suisse Global Wealth Report,\nAustralia continued to have the second-highest average wealth per adult\n(US$430,800) and the highest median wealth (US$225,400), with a total wealth\nof $7.2 trillion. The average level of real assets (US$319,700) was the\nsecond-highest in the world after Norway and 60% of gross household assets.\nThe report explained that this partly reflects a large endowment of land and\nnatural resources relative to population, and also high urban real estate\nprices. Only 6% of Australians had a net worth below US$10,000, compared to\n29% in the US and 70% for the world as a whole. The average debt was 20% of\ngross assets. The proportion of people with wealth above US$100,000 was the\nhighest in the world (eight times the world average). Australia had 3.8%\n(1,783,000 people) of the top 1% of global wealth holders while having 0.4% of\nthe world's adult population. The wealth share by Australia's top decile was\n51.1% in 2000, 50.7% in 2007, and 51.1% in 2014. In 2016, Australia continued\nto be the second-wealthiest nation in terms of wealth per adult.\n\nIn 2017, Australia was the world's top destination for millionaires, beating\nthe United States for the second consecutive year. An estimated 11,000\nmillionaires moved to Australia in 2016, compared with the 10,000 who moved to\nthe United States. Australia was especially attractive to Chinese millionaires\ndue to its relative proximity, cleaner environment, political and economic\nstability, and investor visa programs. Also, the primary reason for\nmillionaires leaving China is top schools abroad that will give their children\na better education and career connections."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "5.5",
    "section_name": "Mergers and acquisitions",
    "text": "All in all over 43,150 deals have been completed national, inbound or outbound\nAustralia. This cumulates to an overall value of US$2,554 billion. There was a\nstrong upward trend between 1989 and 2007. In this peak year almost 3,100\ndeals took place, which is almost 60% more than in 2017, the current low.\nAustralian companies are particularly investing in the fields of metals and\nminerals (15% of all deals from Australia into foreign countries). Runner-up\nis the oil and gas industry with only 6.4%.\n\nHere is a list of the top 10 deals with participation of Australian companies\nas the acquirer or target company:\n\nDate  | Acquirer name  | Acquirer industry  | Acquirer nation  | Target name  | Target industry  | Target country  | Value in US$mill\n---|---|---|---|---|---|---|---\nDecember 2017 | Unibail-Rodamco | Commercial real estate  | Europe  | Westfield Corporation | Commercial real estate, shopping centres  | Australia  | 24,800.00\nMay 2008 | Westpac Banking Corp | Banking  | Australia  | St George Bank Ltd | Banking  | Australia  | 17,932.98\nJuly 2007 | Wesfarmers Ltd | Food & beverage retailing  | Australia  | Coles Group Ltd | Food & beverage retailing  | Australia  | 15,287.79\nOctober 2006 | Kemble Water Ltd  | Other Financials  | Australia  | Thames Water PLC  | Water and waste management  | United Kingdom  | 14,888.80\nOctober 2006 | Cemex SAB de CV  | Construction materials  | Mexico  | Rinker Group Ltd  | Construction materials  | Australia  | 14,247.73\nOctober 2016 | Investor Group  | Other Financials  | Australia  | Ausgrid Pty Ltd  | Power  | Australia  | 12,499.92\nMarch 2001 | BHP Ltd  | Metals & mining  | Australia  | Billiton PLC  | Metals & mining  | United Kingdom  | 11,510.99\nJune 2011 | SABMiller Beverage Investments  | Other Financials  | Australia  | Foster's Group Ltd  | Food and beverage  | Australia  | 10,792.76\nDecember 1996 | Investors  | Other Financials  | Australia  | Telstra Corp Ltd  | Telecommunications services  | Australia  | 9,976.59\nNovember 2010 | Shareholders  | Other Financials  | Australia  | Westfield Group-Assets(54)  | Non-residential  | Australia  | 9,482.42"
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Poverty",
    "text": "In 2022 ACOSS released a report revealing that poverty is growing in\nAustralia, with an estimated 3.3 million people, or 13.5% of the population,\nliving below the internationally accepted poverty line of 50% of a country's\nmedian income. It also estimated that there are 761,000 (17.7%) children under\nthe age of 15 that are in poverty. Indigenous Australians face significantly\nhigher poverty rates, with 30% of Indigenous households in income poverty,\nemerging as the most socially and economically deprived group in Australia."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Homelessness",
    "text": "There were 105,237 people experiencing homelessness in Australia on census\nnight in 2011. This equated to 1 in 200 Australians, and represented an\nincrease of 17% from the 2006 census, with the rate of homelessness increasing\nfrom 45 per 10,000 to 49 per 10,000.\n\nThe number of homeless people in Australia jumped by more than 14,000—or 14\nper cent—in the five years to 2016, according to census data. The Australian\nBureau of Statistics (ABS) said 116,000 people were homeless on census night\nin 2016, representing 50 homeless people per 10,000."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Climate change",
    "text": "According to the Climate Commission (now the Climate Council) report in 2013,\nthe extreme heatwaves, flooding and bushfires striking Australia have been\nintensified by climate change and will get worse in future in terms of their\nimpacts on people, property, communities and the environment. The summer of\n2012/2013 included the hottest summer, hottest month and hottest day on\nrecord. The cost of the 2009 bushfires in Victoria was estimated at A$4.4bn\n(£3bn) and the Queensland floods of 2010/2011 cost over A$5bn.\n\nIn 2008 the Treasurer and the Minister for Climate Change and Water released a\nreport that concluded the economy will grow with an emissions trading scheme\nin place.\n\nA report released in October 2009 by the Standing Committee on Climate Change,\nWater, Environment and the Arts, studying the effects of a 1-metre sea level\nrise, quite possible within the next 30–60 years, concluded that around\n700,000 properties around Australia, including 80,000 buildings, would be\ninundated, the collective value of these properties is estimated at $155\nbillion.\n\nIn 2019 the Australian Bureau of Agricultural and Resource Economics and\nSciences published a report about the impact of climate change on the\nprofitability of the Australian agriculture, saying that the profit of the\nAustralian farms was cut by 22% due to climate change in the years 2000–2019.\n\nAccording to the 2022 IPCC report Australia will lose billions of dollars due\nto loss of life, and physical damages. These natural disasters are caused by\nclimate change and increasing global warming will worsen these events. The\nreport estimates that under 2 degrees of warming Australia will lose $115\nbillion in the next decade, and $350 billion in the next twenty years. If\nwarming goes up to under 3 degrees of warming Australia's economy will lose\n$200 billion and $600 billion by 2042."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "8.0.1",
    "section_name": "Agriculture forestry and livestock",
    "text": "Small changes caused by global warming, such as a longer growing season, a\nmore temperate climate and increased CO2 concentrations, may benefit\nAustralian crop agriculture and forestry in the short term.[_citation needed_]\nHowever, such benefits are unlikely to be sustained with increasingly severe\neffects of global warming. Changes in precipitation and consequent water\nmanagement problems will further exacerbate Australia's current water\navailability and quality challenges, both for commercial and residential use.\n\nThe CSIRO predicts that the additional results in Australia of a temperature\nrise of between 3 and 4 °C will be:\n\n* 32% possibility of diminished wheat production (without adaptation).\n* 45% probability of wheat crop value being beneath present levels (without adaptation).\n* 55% of primary habitat lost for Eucalyptus.\n* 25–50% rise in common timber yield in cool and wet parts of South Australia.\n* 25–50% reduction in common timber yield in North Queensland and the Top End.\n* 6% decrease in Australian net primary production (for 20% precipitation decrease)\n* 128% increase in tick-associated losses in net cattle production weight."
  },
  {
    "chapter_name": "Economy of Australia",
    "chapter_id": "1",
    "section_number": "8.0.2",
    "section_name": "Electricity demand",
    "text": "Use of domestic air conditioners during severe heatwaves can double\nelectricity demand, placing great stress on electricity generation and\ntransmission networks, and lead to load shedding. In addition, bushfires can\ndamage electricity lines, while repairing power poles and power line damages\nis often restricted during hot and dry weather because of high fire risks."
  }
]