[
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "---  \nPart of a series on  \nMontenegro  \nHistory  \nGeography  \n  \n  * Cities\n  * Mountains\n  * Places\n\n  * Regions\n  * Rivers\n\n  \nPolitics  \n  \n  * Elections\n  * Foreign relations\n\n  * Government\n  * Military\n\n  * Municipalities\n  * Parliament\n\n  * Political parties\n\nPresident  \n(Milo Đukanović) Prime Minister  \n(Zdravko Krivokapić)  \nEconomy  \n  \n  * Telecommunications\n\n  * Transportation\n\n  \nSociety  \n  \n  * Culture\n\nDemographics  \n(history)  \n  \n  * v\n  * t\n  * e\n\n  \n  \nThe **economy of Montenegro** is a transition economy seeking to stabilize,\ndiversify, and expand economic output. Montenegro navigates the impacts of the\nYugoslav Wars, the decline of industry following the dissolution of\nYugoslavia, and related economic sanctions imposed by the United Nations.\nMontenegro joined the World Trade Organization in 2012. Montenegro joined the\nNorth Atlantic Treaty Organization on 5 June 2017.",
    "openai_summarised_points": [
      "• The economy of Montenegro is characterized as a transition economy focused on stabilizing, diversifying, and expanding its economic output.",
      "• Montenegro’s economic development has been significantly influenced by the aftermath of the Yugoslav Wars, which disrupted regional stability and economic activity.",
      "• Following the dissolution of Yugoslavia, Montenegro experienced a decline in industrial production, contributing to economic challenges.",
      "• The country faced economic sanctions imposed by the United Nations during the post-Yugoslav period, further impacting its economic performance.",
      "• Montenegro became a member of the World Trade Organization (WTO) in 2012, marking a significant step in integrating into the global trading system.",
      "• On 5 June 2017, Montenegro joined the North Atlantic Treaty Organization (NATO), reflecting its strategic geopolitical alignment and security commitments."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:22.316930",
      "openai_model": "gpt-4.1-mini",
      "content_length": 903,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "As a relatively small principality founded in 1852, Montenegro's economy was\noriginally wholly based in agriculture, but it began developing an industrial\neconomy at the turn of the 20th century. Growth was hampered by its small\npopulation, lack of raw materials, an underdeveloped transport network, and a\ncomparatively low rate of domestic and international investment.\n\nThe first industrial enterprises built in Montenegro were wood mills, an oil\nrefinery, a brewery, salt works, and electric power plants. Economic\ndevelopment was interrupted by several wars, including the First Balkan War\n(1912–13), World War I (1914–18), and World War II (1939–45). Throughout the\nfirst half of the 20th century, agriculture continued to dominate Montenegro's\neconomic activity.",
    "openai_summarised_points": [
      "• Montenegro was established as a relatively small principality in 1852, with an economy initially entirely based on agriculture.",
      "• The country began developing an industrial economy around the turn of the 20th century, marking a shift from its agricultural roots.",
      "• Economic growth during this period was constrained by several factors, including Montenegro's small population, scarcity of raw materials, an underdeveloped transportation network, and relatively low levels of both domestic and international investment.",
      "• The earliest industrial enterprises established in Montenegro included wood mills, an oil refinery, a brewery, salt works, and electric power plants, representing the initial diversification of the economy.",
      "• Montenegro’s economic development was repeatedly disrupted by major conflicts, specifically the First Balkan War (1912–1913), World War I (1914–1918), and World War II (1939–1945).",
      "• Despite efforts toward industrialization, agriculture remained the dominant sector of Montenegro's economy throughout the first half of the 20th century."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:27.130905",
      "openai_model": "gpt-4.1-mini",
      "content_length": 769,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "The Yugoslav era",
    "text": "Montenegro's economy was developed significantly after World War II, as the\ncountry was integrated into the Socialist Federal Republic of Yugoslavia and\nexperienced a period of rapid urbanization and industrialization. Its\nindustrial sector included the generation of electricity, steel and aluminum\nproduction, coal mining, forestry and wood processing, textiles, and tobacco\nmanufacturing, while international trade, shipping, and tourism became\nincreasingly important by the late 1980s.",
    "openai_summarised_points": [
      "• Montenegro's economy underwent significant development after World War II as it became integrated into the Socialist Federal Republic of Yugoslavia.",
      "• During this period, Montenegro experienced rapid urbanization and industrialization, transforming its economic landscape.",
      "• The industrial sector in Montenegro encompassed several key areas, including electricity generation, steel production, and aluminum manufacturing.",
      "• Coal mining was a prominent industry, contributing to the energy and raw material supply within the republic.",
      "• Forestry and wood processing industries were also important components of Montenegro's industrial economy.",
      "• The textile industry and tobacco manufacturing played notable roles in the country's industrial output.",
      "• By the late 1980s, international trade had become increasingly significant to Montenegro's economy.",
      "• Shipping emerged as a vital sector, leveraging Montenegro's Adriatic coastline for economic growth.",
      "• Tourism developed into an important industry by the late 1980s, contributing to the diversification of Montenegro's economic activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:31.533426",
      "openai_model": "gpt-4.1-mini",
      "content_length": 489,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Post-Yugoslavia",
    "text": "Following the dissolution of Yugoslavia in the early 1990s, Montenegro's\nentire industrial production system effectively collapsed, leading to\nshortages of many goods and skyrocketing prices for them. Due to its political\nalliance with Serbia and favourable geographic location, with access to the\nAdriatic Sea and a shipping-link to Albania across Lake Skadar, Montenegro\nbecame a hub for smuggling activity during the 1990s. The smuggling of petrol\nand cigarettes, in particular, became a de facto legalised practice within the\ncountry.",
    "openai_summarised_points": [
      "• Following the dissolution of Yugoslavia in the early 1990s, Montenegro's entire industrial production system effectively collapsed, resulting in shortages of many goods and a significant increase in their prices.",
      "• Due to Montenegro's political alliance with Serbia during the 1990s and its favourable geographic location, including access to the Adriatic Sea and a shipping link to Albania across Lake Skadar, the country became a central hub for smuggling activities.",
      "• Smuggling of petrol and cigarettes became particularly prevalent in Montenegro throughout the 1990s, evolving into a de facto legalised practice within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:34.812316",
      "openai_model": "gpt-4.1-mini",
      "content_length": 538,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Dissolution of State Union with Serbia",
    "text": "In 1997, Milo Đukanović took control of Montenegro's ruling party, the\nDemocratic Party of Socialists of Montenegro, and began severing political\nties with Serbia. He blamed the policies of Serbian President Slobodan\nMilošević for the overall decline of the Montenegrin economy. Resurgent\ninflation led the Montenegrin government to \"dollarize\" the economy, adopting\nthe German mark as its dominant currency. These economic policies also led to\na revision in 2003 of the relationship between the two countries from a\nfederal republic to a much looser political union of Serbia and Montenegro, in\nwhich the Montenegrin government assumed responsibility for its own economic\npolicies.\n\nThe union did not last and on 21 May 2006, the people of Montenegro voted by\nreferendum to declare independence from Serbia.",
    "openai_summarised_points": [
      "• In 1997, Milo Đukanović assumed leadership of Montenegro's ruling party, the Democratic Party of Socialists of Montenegro, initiating a process of political separation from Serbia.",
      "• Milo Đukanović attributed the decline of Montenegro's economy to the policies implemented by Serbian President Slobodan Milošević.",
      "• Due to resurgent inflation, the Montenegrin government implemented a policy of \"dollarization,\" adopting the German mark as the dominant currency to stabilize the economy.",
      "• These economic reforms contributed to a redefinition of the political relationship between Montenegro and Serbia in 2003, transitioning from a federal republic to a looser political union known as Serbia and Montenegro.",
      "• Under the 2003 arrangement, the Montenegrin government gained autonomy over its own economic policies, marking a significant shift in governance.",
      "• The political union between Serbia and Montenegro was short-lived, culminating in a referendum held on 21 May 2006, in which the people of Montenegro voted to declare independence from Serbia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:40.148771",
      "openai_model": "gpt-4.1-mini",
      "content_length": 808,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Current economy",
    "text": "Following the independence referendum, Montenegro's economy has evolved to\nhighlight its service sector, with a goal of becoming an elite tourist\ndestination, and is navigating the process of joining the European Union.\nAttempts to attract foreign investors for large infrastructure projects are\nongoing, as these projects are integral to its development as a tourist\ndestination.\n\nMontenegro experienced a real estate boom in 2006 and 2007, with wealthy\nRussians, Britons and others buying property on the Montenegrin coast. As of\n2008, Montenegro received more foreign investment per capita than any other\nnation in Europe.\n\nIn the first half of 2012, Montenegro exported goods, mostly metals, worth\n€182.3 million, which was 14.6% less than in the same period of the preceding\nyear. Its major export partners include Croatia, Serbia, Bosnia and\nHerzegovina, and Hungary. Montenegro's imports in the first half of 2012,\nmostly food, oil, and electrical energy, were worth €864.9 million, which was\n2.6% more than the same period in 2011. Its major import partners include\nSerbia, Greece, and Bosnia and Herzegovina.\n\nIn 2022, the sector with the highest number of companies registered in\nMontenegro is Services with 15,496 companies followed by Retail Trade and\nWholesale Trade with 11,200 and 6,839 companies respectively.",
    "openai_summarised_points": [
      "• Following the independence referendum, Montenegro's economy has shifted focus towards its service sector, aiming to establish itself as an elite tourist destination while simultaneously navigating the process of joining the European Union.",
      "• The Montenegrin government and stakeholders are actively attempting to attract foreign investors for large infrastructure projects, which are considered essential for the country’s development as a premier tourist destination.",
      "• Montenegro experienced a significant real estate boom during 2006 and 2007, characterized by wealthy buyers from Russia, Britain, and other countries purchasing property along the Montenegrin coast.",
      "• As of 2008, Montenegro received more foreign investment per capita than any other nation in Europe, highlighting its attractiveness to international investors during that period.",
      "• In the first half of 2012, Montenegro exported goods valued at €182.3 million, primarily metals, representing a 14.6% decrease compared to the same period in 2011.",
      "• The major export partners for Montenegro in the first half of 2012 included Croatia, Serbia, Bosnia and Herzegovina, and Hungary.",
      "• During the same period in 2012, Montenegro’s imports, mainly consisting of food, oil, and electrical energy, totaled €864.9 million, which was a 2.6% increase compared to the first half of 2011.",
      "• The primary import partners for Montenegro in the first half of 2012 were Serbia, Greece, and Bosnia and Herzegovina.",
      "• In 2022, the sector with the highest number of registered companies in Montenegro was the Services sector, with 15,496 companies.",
      "• The Retail Trade sector followed with 11,200 registered companies in 2022.",
      "• The Wholesale Trade sector was the third largest by number of registered companies in 2022, with 6,839 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:45.064679",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1325,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Finance",
    "text": "The Central Bank of Montenegro was founded in 2001 and shortly thereafter\nadopted the euro as the currency of the country in March 2002.\n\nThe banking sector of Montenegro has a significant share of foreign capital.\nBanks in Montenegro provide both retail and corporate banking products under\none roof, and most offer non-resident accounts, usually to both natural\npersons and legal entities.\n\nThe Montenegro Stock Exchange, founded in 1993, was strengthened in 2011 when\nit merged to become the sole stock exchange in the country. It is owned by a\nnumber of financial institutions.",
    "openai_summarised_points": [
      "• The Central Bank of Montenegro was established in 2001 and subsequently adopted the euro as the official currency of Montenegro in March 2002.",
      "• Montenegro's banking sector features a substantial presence of foreign capital, indicating significant international investment and ownership within the financial institutions.",
      "• Banks operating in Montenegro offer a comprehensive range of services, including both retail and corporate banking products, consolidated under a single institution.",
      "• Most banks in Montenegro provide non-resident accounts, catering to both natural persons (individuals) and legal entities (corporations or organizations).",
      "• The Montenegro Stock Exchange was originally founded in 1993 and underwent a significant consolidation in 2011, merging to become the sole stock exchange in the country.",
      "• Ownership of the Montenegro Stock Exchange is distributed among various financial institutions, reflecting a collective investment by key players in the financial sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:48.839403",
      "openai_model": "gpt-4.1-mini",
      "content_length": 581,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Infrastructure",
    "text": "In the 2007 Great Recession the economic growth slowed, as several\ninfrastructure projects, such as the development of Velika Plaža, Ada Bojana,\nBuljarica, Jaz Beach, and the construction of the Bar-Boljare motorway and new\npower plants had to be postponed.\n\nThe Port of Bar is the country's primary communication with the maritime\ntrade. Its terminal is specialized in bulk shipment of bauxite and other ores,\ngrain, wood products, acetic acid and petroleum derivatives. In 2019 its\nallowable draft was reported as 12.8m and several private storage tanks exist\non site, to service trade. Ro–Ro traffic from Bari and Ancona is handled\nthrough an operational quay which is 400m long with water depth of between 4m\nand 5.9m.",
    "openai_summarised_points": [
      "• During the 2007 Great Recession, Montenegro experienced a slowdown in economic growth, resulting in the postponement of several key infrastructure projects including the development of Velika Plaža, Ada Bojana, Buljarica, Jaz Beach, the construction of the Bar-Boljare motorway, and new power plants.",
      "• The Port of Bar serves as Montenegro's primary maritime trade communication hub, specializing in the bulk shipment of commodities such as bauxite, other ores, grain, wood products, acetic acid, and petroleum derivatives.",
      "• In 2019, the Port of Bar's allowable draft was recorded at 12.8 meters, supporting significant maritime traffic and trade operations.",
      "• The port site includes several private storage tanks designed to facilitate and service the trade of various bulk goods.",
      "• Ro–Ro (roll-on/roll-off) traffic from the Italian ports of Bari and Ancona is managed through an operational quay at the Port of Bar, which measures 400 meters in length and has a water depth ranging between 4 meters and 5.9 meters."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:52.729397",
      "openai_model": "gpt-4.1-mini",
      "content_length": 722,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Industry",
    "text": "The 2007 recession was difficult for the Podgorica Aluminium Plant, which was\ninitially built in 1969 and was the biggest single contributor to the\nMontenegrin gross domestic product. The plant, first sold to Oleg Deripaska's\nEn+ Group in 2005, declared bankruptcy in 2013 and was sold to local magnate\nVeselin Pejovic's Uniprom in 2014.",
    "openai_summarised_points": [
      "• The Podgorica Aluminium Plant, originally constructed in 1969, was the largest single contributor to Montenegro's gross domestic product prior to the 2007 recession.",
      "• The economic downturn in 2007 significantly impacted the Podgorica Aluminium Plant's operations and financial stability.",
      "• In 2005, ownership of the Podgorica Aluminium Plant was transferred to En+ Group, a company controlled by Russian businessman Oleg Deripaska.",
      "• Following continued financial difficulties, the Podgorica Aluminium Plant declared bankruptcy in 2013.",
      "• In 2014, the bankrupt Podgorica Aluminium Plant was acquired by Uniprom, a company owned by Montenegrin local magnate Veselin Pejovic."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:44:55.903909",
      "openai_model": "gpt-4.1-mini",
      "content_length": 337,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Tourism",
    "text": "With 300km of coastline, backed by mountains, Montenegro is proving to be a\ndesirable holiday destination and generated around 25% of Montenegro's GDP.\nCovid restrictions in 2020 saw Montenegro suffer a 15% drop in GDP and high\nunemployment in the tourist sector before rebounding in 2021. Montenegro\nprefers luxurious and upscale projects to attract tourists, encouraging\nforeign investment to create the facilities.",
    "openai_summarised_points": [
      "• Montenegro has a coastline measuring 300 kilometers, which is complemented by mountainous terrain, making it an attractive holiday destination.",
      "• The tourism sector contributes approximately 25% to Montenegro's Gross Domestic Product (GDP), highlighting its significant role in the national economy.",
      "• In 2020, the COVID-19 pandemic and associated restrictions caused Montenegro's GDP to decline by 15%, with the tourism sector experiencing notably high unemployment rates.",
      "• Following the downturn in 2020, Montenegro's tourism industry showed signs of recovery in 2021.",
      "• The Montenegrin government and stakeholders prioritize the development of luxurious and upscale tourism projects to attract high-end tourists.",
      "• To support this strategy, Montenegro actively encourages foreign investment aimed at establishing and enhancing tourism facilities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:45:00.514374",
      "openai_model": "gpt-4.1-mini",
      "content_length": 417,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Energy",
    "text": "Elektroprivreda Crne Gore (EPCG) is the mainly state-owned coal and power\nproducer and distributor which owns two large hydroelectric plants and a coal\npowered thermal power plant.\n\nTwo wind power farms are in operation, Krnovo Wind Farm and Možura Wind Farm\nwhich generate a total of 118MW.\n\nIn June 2023 APCG obtained €82m finance to build the Gvozd wind farm which\nwill generate 54.6 MW. A new wind farm, the Bijela wind farm is planned with\n118MW capacity following UAE based Alcazar Energy acquiring the rights in 2023\nto spend $200m building the farm.\n\nIn 2023 Montenegro exported around €200m worth of electricity (2022 €140m)\nbecoming the top export item for the country."
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Agriculture",
    "text": "In July 2006 prior to EU integration efforts a survey document was produced by\nthe Ministry of Agriculture, Forestry and Water Management for the EU-funded\nproject _Agriculture and Rural Development Strategy of Montenegro_. The\nStatistical Office of Montenegro learned as late as November 2021 how to\ncollect its data in formats acceptable to the European Commission.\n\nSince 2010 agricultural trade relations between the EU and Montenegro have\nbeen governed by the EU-Montenegro Stabilisation and Association Agreement,\nand with the exception of beef, sugar and wine all agricultural products\noriginating in Montenegro can enter the EU duty free. The EU has a large agri-\nfood trade surplus with Montenegro, and exports meat, dairy and food\npreparations. The EU mainly imports vegetables such as mushrooms, wine and\noils from Montenegro.\n\nIt was reported by the EC Directorate-General for Agriculture and Rural\nDevelopment in March 2019 that the share of agriculture in Montenegro's GDP\nwas 8%. Agricultural land accounts for 38% of the total. Olives and citrus\nfruits are grown in the coastal region, while seasonal vegetables and tobacco\nare produced in the central areas. In the north of the country ungulates\ndominate the farming. The largest share of the land consists of pasture and\ngrassland.\n\nMontenegro became a member of the UN International Fund for Agricultural\nDevelopment (IFAD) in 2015, which notes that the rural population represents\none-third of the total. In 2019 the IFAD focused its activities \"on the key\nchallenges of better connectivity and higher productivity by (i) fostering the\ngraduation of micro and small agricultural holdings from the current non-\nviable subsistence-type agriculture toward semi-commercial and commercial\nagriculture, through investments in pro-poor rural infrastructure, (ii)\npromoting the aggregation of smallholders within inclusive value chain\nclusters and (iii) supporting the proactive role of municipalities to deploy\ninvestment to promote inclusion for entire sectors of the rural population.\"\n\nOver the years 2009 to 2019 the World Bank contributed a development project\ncalled the _Montenegro Institutional Development and Agriculture Strengthening\nProject_ , by which (amongst other highlights) the food safety system was\nupgraded in EU compliant manners, a Border Inspection Post with veterinary and\nphyto-sanitary controls was established in the Port of Bar, an electronic farm\nregister was created, procedures for the classification of farm and food\nestablishments were completed according to EU norms, and the Veterinary\nDiagnostic Laboratory in Podgorica was accredited in ISO 17025 analysis\nmethods."
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Import and export statistics",
    "text": "Imports per year (Source: World Bank)  | Year  | Imports (Billions in US dollars)\n---|---\n2018 | 3.68\n2019 | 3.60\n2020 | 2.91\n2021 | 3.65\n2022 | 4.63\nExports per year (Source: World Bank)  | Year  | Exports (Billions in US dollars)\n---|---\n2018 | 2.36\n2019 | 2.43\n2020 | 1.24\n2021 | 2.51\n2022 | 3.21"
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Trade agreements",
    "text": "Montenegro has free trade agreements with many countries, but not Russia or\nBelarus.\n\n* Central European Free Trade Agreement signed in 2007 giving free trade between Albania, North Macedonia, Moldova, UNMIK/Kosovo, Croatia, Serbia, and Bosnia and Herzegovina.\n* Turkey free trade agreement became effective in 2010\n* Ukraine 2011\n* European Free Trade Association, signed in 2011 giving free trade with EU countries together with Switzerland, Norway, Iceland, and Liechtenstein\n* USA _Most-Favored Nation status_ from 2003"
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Minimum wage",
    "text": "After years with a minimum wage of €288.10 per month, there was a small\nincrease in 2019 to €331.30 before 2022 saw a jump to €532.50, €6,390 p.a."
  },
  {
    "chapter_name": "Economy of Montenegro",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Taxation",
    "text": "VAT standard rate is 21% in 2022, with some items at 7% and is in line with EU\nguidelines.\n\nFrom 2023, a tax rate of 9% is applied to personal gross income above €700 per\nmonth, and a tax rate of 15% for income above €1,000 per month. Montenegrin\nmunicipalities also apply an income tax surcharge equivalent to 13-15% of the\nnational tax rate. Social security costs are 15.5%, 6% being borne by the\nemployee."
  }
]