[
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Set of productive activities developed in Guinea\n\nThe **economy of Guinea** is dependent largely on agriculture and other rural\nactivities. Guinea is richly endowed with minerals, possessing an estimated\nquarter of the world's proven reserves of bauxite, more than 1.8 billion\ntonnes (2.0 billion short tons) of high-grade iron ore, significant diamond\nand gold deposits, and undetermined quantities of uranium. In 2021, Guinea was\nthe world's biggest exporter of Aluminium Ore ($3.2B/ Gold $5.5B) 2021 trade\nsurplus was $4.3B.\n\nGuinea also has considerable potential for growth in the agricultural and\nfishing sectors. Land, water, and climatic conditions provide opportunities\nfor large-scale irrigated farming and agroindustry. Remittances from Guineans\nliving and working abroad and coffee exports account for the rest of Guinea's\nforeign exchanges industry.",
    "openai_summarised_points": [
      "• The economy of Guinea is primarily reliant on agriculture and other rural activities, which constitute the main sectors of productive activity in the country.",
      "• Guinea is richly endowed with mineral resources, including an estimated quarter of the world's proven reserves of bauxite.",
      "• The country possesses more than 1.8 billion tonnes (2.0 billion short tons) of high-grade iron ore.",
      "• Guinea has significant deposits of diamonds and gold, along with undetermined quantities of uranium.",
      "• In 2021, Guinea was the world's largest exporter of aluminium ore, generating approximately $3.2 billion in export revenue.",
      "• In the same year, gold exports from Guinea amounted to about $5.5 billion.",
      "• Guinea's trade surplus in 2021 was approximately $4.3 billion.",
      "• The country has considerable growth potential in the agricultural and fishing sectors, supported by favorable land, water, and climatic conditions.",
      "• These conditions provide opportunities for large-scale irrigated farming and agro-industry development.",
      "• Remittances from Guineans living and working abroad, along with coffee exports, constitute important components of Guinea's foreign exchange earnings."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:01.903816",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 862,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "GDP per capita development in Guinea\n\nGuinea was part of the franc zone countries that included most of the former\nFrench Colonies. After Independence, these countries did not become completely\neconomical free. France decided against monetary autonomy hence they could not\nuse a freely convertible currency. The state intervention of the new\ngovernments was characterized by stops of quotas on imports and internal price\ncontrols. In the time up to c. 1980, the franc-zone countries had on average a\nlower inflation and a higher economic growth compared to the Anglophone\ncounterparts, who could use their own currencies. But regarding the time after\nc. 1980 and the economic liberalism, characterized by Structural Adjustments,\nthe franc zone countries could not outperform the rest.\n\nSince 1985, the Guinean Government has adopted policies to return commercial\nactivity to the private sector, promote investment, reduce the role of the\nstate in the economy, and improve the administrative and judicial framework.\nThe government has eliminated restrictions on agricultural enterprise and\nforeign trade, liquidated many parastatals, increased spending on education,\nand vastly downsized the civil service. The government also has made major\nstrides in restructuring the public finances.\n\nThe IMF and the World Bank are heavily involved in the development of Guinea's\neconomy, as are many bilateral donor nations, including the United States.\nGuinea's economic reforms have had recent notable success, improving the rate\nof economic growth to 5% and reducing the rate of inflation to about 99%, as\nwell as increasing government revenues while restraining official\nexpenditures. Although Guinea's external debt burden remains high, the country\nis now current on external debt payments.\n\nCurrent GDP per capita of Guinea shrank by 16% in the 1990s.\n\nThe government revised the private investment code in 1998 to stimulate\neconomic activity in the spirit of a free enterprise. The code does not\ndiscriminate between foreigners and nationals and provides for repatriation of\nprofits. Foreign investments outside Conakry are entitled to especially\nfavorable conditions. A national investment commission has been formed to\nreview all investment proposals. The United States and Guinea have signed an\ninvestment guarantee agreement that offers political risk insurance to\nAmerican investors through OPIC. Guinea plans to inaugurate an arbitration\ncourt system to allow for the quick resolution of commercial disputes.\n\nMean wages were $0.45 per man-hour in 2009.\n\nIn 2002, the IMF suspended Guinea's Poverty Reduction and Growth Facility\n(PRGF) because the government failed to meet key performance criteria. In\nreviews of the PRGF, the World Bank noted that Guinea had met its spending\ngoals in targeted social priority sectors. However, spending in other areas,\nprimarily defense, contributed to a significant fiscal deficit. The loss of\nIMF funds forced the government to finance its debts through central bank\nadvances. The pursuit of unsound economic policies has resulted in imbalances\nthat are proving hard to correct.\n\nUnder then-Prime Minister Diallo, the government began a rigorous reform\nagenda in December 2004 designed to return Guinea to a PRGF with the IMF.\nExchange rates have been allowed to float, price controls on gasoline have\nbeen loosened, and government spending has been reduced while tax collection\nhas been improved. These reforms have not reduced inflation, which hit 27% in\n2004 and 30% in 2005. Currency depreciation is also a concern. The Guinea\nfranc was trading at 2550 to the dollar in January 2005. It hit 5554 to the\ndollar by October 2006. In August 2016 that number had reached 9089.\n\nDespite the opening in 2005 of a new road connecting Guinea and Mali, most\nmajor roadways remain in poor repair, slowing the delivery of goods to local\nmarkets. Electricity and water shortages are frequent and sustained, and many\nbusinesses are forced to use expensive power generators and fuel to stay open.\n\nEven though there are many problems plaguing Guinea's economy, not all foreign\ninvestors are reluctant to come to Guinea. Global Alumina's proposed alumina\nrefinery has a price tag above $2 billion. Alcoa and Alcan are proposing a\nslightly smaller refinery worth about $1.5 billion. Taken together, they\nrepresent the largest private investment in sub-Saharan Africa since the Chad-\nCameroon oil pipeline. Also, Hyperdynamics Corporation, an American oil\ncompany, signed an agreement in 2006 to develop Guinea's offshore Senegal\nBasin oil deposits in a concession of 80,000 square kilometres (31,000 sq mi);\nit is pursuing seismic exploration.\n\nOn 13 October 2009, Guinean Mines Minister Mahmoud Thiam announced that the\nChina International Fund would invest more than $7bn (£4.5bn) in\ninfrastructure. In return, he said the firm would be a \"strategic partner\" in\nall mining projects in the mineral-rich nation. He said the firm would help\nbuild ports, railway lines, power plants, low-cost housing and even a new\nadministrative centre in the capital, Conakry. In September 2011, Mohamed\nLamine Fofana, the Mines Minister following the 2010 election, said that the\ngovernment had overturned the agreement by the ex-military junta.\n\nYouth unemployment remains a large problem. Guinea needs an adequate policy to\naddress the concerns of urban youth. One problem is the disparity between\ntheir life and what they see on television. For youth who cannot find jobs,\nseeing the economic power and consumerism of richer countries only serves to\nfrustrate them further.",
    "openai_summarised_points": [
      "• Guinea was part of the franc zone countries, which included most of the former French Colonies, and after independence, these countries did not achieve complete economic independence due to France's decision against monetary autonomy, preventing the use of a freely convertible currency.",
      "• The economic policies of the new governments initially involved import quotas and internal price controls, with the period up to around 1980 characterized by lower inflation and higher economic growth in franc-zone countries compared to Anglophone counterparts, who could utilize their own currencies.",
      "• Post-1980, with the advent of economic liberalism and Structural Adjustment programs, franc-zone countries, including Guinea, could not outperform other nations.",
      "• Since 1985, Guinea's government adopted policies to revitalize the private sector, promote investment, reduce state intervention, and improve administrative and judicial frameworks.",
      "• Policy measures included eliminating restrictions on agricultural enterprises and foreign trade, liquidating many parastatals, increasing education spending, and significantly downsizing the civil service.",
      "• Major strides were made in restructuring public finances, aiming to improve fiscal stability.",
      "• The IMF and World Bank, along with bilateral donors such as the United States, are heavily involved in Guinea’s economic development efforts.",
      "• Recent economic reforms led to a growth rate of approximately 5% and a reduction in inflation to about 99%, alongside increased government revenues and restrained official expenditures.",
      "• Despite these improvements, Guinea's external debt remains high, although the country is currently up to date on external debt payments.",
      "• The GDP per capita of Guinea declined by 16% during the 1990s.",
      "• In 1998, Guinea revised its private investment code to stimulate economic activity aligned with free enterprise principles, ensuring no discrimination between foreigners and nationals and allowing profit repatriation.",
      "• Foreign investments outside Conakry benefit from especially favorable conditions, with a national investment commission established to review proposals.",
      "• The United States and Guinea signed an investment guarantee agreement providing political risk insurance to American investors through OPIC.",
      "• Guinea plans to establish an arbitration court system to facilitate the quick resolution of commercial disputes.",
      "• The mean wages in Guinea were $0.45 per man-hour in 2009.",
      "• In 2002, the IMF suspended Guinea's Poverty Reduction and Growth Facility (PRGF) due to the government’s failure to meet key performance criteria; however, the World Bank noted that Guinea met its social spending goals, though increased defense spending contributed to a significant fiscal deficit.",
      "• The suspension of IMF funds forced Guinea to finance debts via central bank advances, leading to economic imbalances that are difficult to correct.",
      "• Under Prime Minister Diallo in December 2004, Guinea initiated reforms including allowing currency to float, loosening gasoline price controls, reducing government spending, and improving tax collection; however, inflation persisted at 27% in 2004 and 30% in 2005.",
      "• The Guinea franc depreciated from 2,550 to the dollar in January 2005 to 5,554 in October 2006, and further to 9,089 by August 2016.",
      "• Infrastructure remains underdeveloped, with most major roads in poor condition despite a new road connecting Guinea and Mali opened in 2005; frequent electricity and water shortages force many businesses to rely on expensive generators and fuel.",
      "• Despite economic challenges, significant foreign investments are ongoing, including proposals for alumina refineries by Global Alumina (over $2 billion) and Alcoa and Alcan (about $1.5 billion), representing the largest private investments in sub-Saharan Africa since the Chad-Cameroon oil pipeline.",
      "• American oil company Hyperdynamics Corporation signed an agreement in 2006 to develop offshore oil deposits in Guinea’s Senegal Basin, covering 80,000 square kilometers, and is conducting seismic exploration.",
      "• On 13 October 2009, Guinea’s Mines Minister Mahmoud Thiam announced that the China International Fund would invest over $7 billion (£4.5 billion) in infrastructure, including ports, railway lines, power plants, low-cost housing, and a new administrative center in Conakry, positioning the firm as a strategic partner in mining projects.",
      "• In September 2011, following the 2010 elections, Mines Minister Mohamed Lamine Fofana stated that the government had overturned the agreement with the China International Fund made by the previous military junta.",
      "• Youth unemployment remains a major issue, with a need for policies addressing urban youth concerns, as many young people are frustrated by the disparity between their economic reality and the consumerist images seen on television."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:20.439226",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5587,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mining",
    "text": "In 2019, the country was the world's 3rd largest producer of bauxite.\n\nBauxite mining and alumina production provide about 80% of Guinea's foreign\nexchange. Several U.S. companies are active in this sector. Diamonds and gold\nalso are mined and exported on a large scale, providing additional foreign\nexchange. Concession agreements have been signed for future exploitation of\nGuinea's extensive iron ore deposits.\n\nGuinea is richly endowed with minerals, possessing an estimated one-third of\nthe world's proven reserves of bauxite, more than 1.8 billion metric tons (MT)\n(2.0 billion short tons) of high-grade iron ore, significant diamond and gold\ndeposits, and undetermined quantities of uranium.\n\nLately, with the increase of alumina demand from the booming economy of China,\nthere is a renew interest in Guinea riches. The consortium Alcan and Alcoa,\npartner with the Guinean government in the CBG mining in north western Guinea,\nhave announced the feasibility study for the construction of a 1 million TPa\nalumina smelter. This comes with a similar project from Canadian start-up\nGlobal Alumina trying to come with a 2 billion dollar alumina plant in the\nsame region. As of April 2005, the National Assembly of Guinea has not\nratified Global's project.\n\nRevenue from bauxite mining is expected to fall significantly in 2010 due\nmainly to the world economic situation.",
    "openai_summarised_points": [
      "• In 2019, Guinea was the world's third-largest producer of bauxite, highlighting its significant role in global bauxite supply.",
      "• Bauxite mining and alumina production account for approximately 80% of Guinea's foreign exchange earnings, underscoring their critical importance to the national economy.",
      "• Several U.S. companies are actively involved in Guinea's bauxite and alumina sector, indicating international corporate engagement.",
      "• Besides bauxite, Guinea also mines and exports large quantities of diamonds and gold, which contribute additional foreign exchange revenue.",
      "• Concession agreements have been signed for the future exploitation of Guinea's extensive iron ore deposits, indicating ongoing development in mineral resource extraction.",
      "• Guinea is highly mineral-rich, possessing an estimated one-third of the world's proven reserves of bauxite.",
      "• The country has over 1.8 billion metric tons (MT) of high-grade iron ore reserves, equivalent to approximately 2.0 billion short tons.",
      "• Guinea also has significant deposits of diamonds and gold, along with undetermined quantities of uranium, reflecting its diverse mineral wealth.",
      "• Recent increases in alumina demand, driven by China's booming economy, have renewed international interest in Guinea's mineral resources.",
      "• The consortium of Alcan and Alcoa, partnering with the Guinean government in the CBG mining operation in northwestern Guinea, announced a feasibility study for constructing a 1 million tonnes per annum (TPa) alumina smelter.",
      "• A Canadian start-up, Global Alumina, is attempting to develop a $2 billion alumina plant in the same region, indicating significant investment interest.",
      "• As of April 2005, the Guinean National Assembly had not ratified Global Alumina's project, reflecting regulatory or political considerations.",
      "• Revenue from bauxite mining was projected to decline significantly in 2010, primarily due to the global economic situation impacting demand and prices."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:28.119778",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1372,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Mining controversies",
    "text": "Guinea has large reserves of the steel-making raw material, iron ore. Rio\nTinto was the majority owner of the $6 billion Simandou iron ore project,\nwhich it had called the world's best unexploited resource. This project is\nsaid to be of the same magnitude as the Pilbara in Western Australia.\n\nIn 2017, Och-Ziff Capital Management Group pled guilty to a multi-year bribery\nscheme, after an investigation by the Securities & Exchange Commission (SEC)\nled to a trial in the United States and a fine of $412 million. Following\nthis, the SEC also filed a lawsuit in the US against head of Och-Ziff European\noperations, Michael Cohen, for his role in a bribery scheme in the region.\n\nIn 2009 the government of Guinea gave the northern half of Simandou to BSGR\nfor an $165 million investment in the project and a pledge to spend $1 billion\non railways, saying that Rio Tinto wasn't moving into production fast enough.\nThe US Justice Department investigated allegations that BSGR had bribed\nPresident Conté's wife to get him the concession, and so did the Federal\nBureau of Investigation, the next elected President of Guinea, Alpha Condé,\nand an assortment of other national and international entities.\n\nIn April 2014 the Guinean government cancelled the company's mining rights in\nSimandou. BSGR has denied any wrongdoing, and in May 2014 sought arbitration\nover the government of Guinea's decision to expropriate its mining rights. In\nFebruary 2019, BSGR and Guinean President Alpha Condé agreed to drop all\nallegations of wrongdoing as well as the pending arbitration case. Under the\nagreement, BSGR would relinquish rights to Simandou while being allowed to\nmaintain an interest in the smaller Zogota deposit that would be developed by\nNiron Metals head Mick Davis.\n\nIn 2010 Rio Tinto signed a binding agreement with Aluminum Corporation of\nChina Limited to establish a joint venture for the Simandou iron ore project.\nIn November 2016, Rio Tinto admitted paying $10.5 million to a close adviser\nof President Alpha Condé to obtain rights on Simandou. Conde said he knew\nnothing about the bribe and denied any wrongdoing. However, according to\nrecordings obtained by France 24, Guinean authorities were aware of the\nSimandou briberies.\n\nIn July 2017, the UK-based anti-fraud regulator, the Serious Fraud Office\n(SFO) and the Australian Federal Police launched an investigation into Rio\nTinto's business practices in Guinea.\n\nFurther, In November 2016, the former mining minister of Guinea, Mahmoud\nThiam, accused head of Rio Tinto's Guinea operation department of offering him\na bribe in 2010 to regain Rio Tinto's control over half of the undeveloped\nSimandou project.\n\nIn September 2011, Guinea adopted a new mining code. The law set up a\ncommission to review government deals struck during the chaotic days between\nthe end of dictatorship in 2008 and Condé coming to power.\n\nIn September 2015, the French Financial Public Prosecutor's Office launched an\ninvestigation into President Alpha Conde's son, Mohamed Alpha Condé. He was\ncharged with embezzlement of public funds and receiving financial and other\nbenefits from French companies that were interested in the Guinean mining\nindustry.\n\nIn August 2016, son of a former Prime Minister of Gabon, who worked for Och-\nZiff's Africa Management Ltd, a subsidiary of the U.S. hedge fund Och-Ziff,\nwas arrested in the US and charged with bribing officials in Guinea, Chad and\nNiger on behalf of the company to secure mining concessions and gain access to\nrelevant confidential information. The investigation also revealed that he was\ninvolved in rewriting Guinea's mining law during President Conde's rule. In\nDecember 2016, the US Department of Justice announced that the man pleaded\nguilty to conspiring to make corrupt payments to government officials in\nAfrica.\n\nAccording to a Global Witness report, Sable Mining sought iron ore\nexplorations rights to Mount Nimba in Guinea by getting close to Conde towards\nthe 2010 elections, backing his campaign for presidency and bribing his son.\nThese allegations have not been verified yet but in March 2016 Guinean\nauthorities ordered an investigation into the matter.\n\nThe Conde government investigated two other contracts as well, one which left\nHyperdynamic with a third of Guinea's offshore lease allocations as well as\nRusal's purchase of the Friguia Aluminum refinery, in which it said that Rusal\ngreatly underpaid.",
    "openai_summarised_points": [
      "• Guinea possesses substantial reserves of iron ore, a key raw material for steel production, with the Simandou iron ore project being a major focus of foreign investment and development.",
      "• Rio Tinto was the majority owner of the $6 billion Simandou project, which it described as the world's best unexploited resource, and compared its scale to the Pilbara region in Western Australia.",
      "• In 2017, Och-Ziff Capital Management Group pled guilty to a multi-year bribery scheme, resulting from SEC investigations, leading to a $412 million fine and subsequent legal actions.",
      "• The SEC also filed a lawsuit against Michael Cohen, head of Och-Ziff European operations, for his involvement in the bribery scheme in Africa.",
      "• In 2009, the Guinean government granted the northern half of the Simandou deposit to BSGR for a $165 million investment, with a commitment to spend $1 billion on railway infrastructure, citing slow progress by Rio Tinto.",
      "• Allegations emerged that BSGR had bribed Guinea President Conté’s wife to secure the concession; investigations were conducted by the US Justice Department, FBI, and other national and international entities.",
      "• In April 2014, the Guinean government canceled BSGR’s mining rights in Simandou. BSGR denied wrongdoing and sought arbitration in May 2014 over the expropriation.",
      "• In February 2019, BSGR and President Alpha Condé agreed to drop all allegations and arbitration claims; BSGR relinquished rights to Simandou but retained an interest in the smaller Zogota deposit, to be developed by Mick Davis of Niron Metals.",
      "• In 2010, Rio Tinto entered into a binding agreement with Aluminum Corporation of China Limited to establish a joint venture for developing the Simandou iron ore project.",
      "• In November 2016, Rio Tinto admitted to paying $10.5 million to a close adviser of President Alpha Condé to secure rights to Simandou; Condé claimed ignorance of the bribe and denied any misconduct.",
      "• France 24 obtained recordings indicating Guinean authorities were aware of the Simandou bribery activities, despite official denials.",
      "• In July 2017, investigations were launched by the UK Serious Fraud Office and the Australian Federal Police into Rio Tinto’s business practices in Guinea.",
      "• In November 2016, Mahmoud Thiam, Guinea’s former mining minister, accused Rio Tinto’s Guinea operations head of offering him a bribe in 2010 to regain control over part of the Simandou project.",
      "• Guinea adopted a new mining code in September 2011, establishing a commission to review government deals made between 2008 and 2011, during the transition from dictatorship to democracy.",
      "• In September 2015, French authorities launched an investigation into President Alpha Condé’s son, Mohamed Alpha Condé, charging him with embezzlement and accepting benefits from French companies interested in Guinea’s mining sector.",
      "• In August 2016, a man associated with Och-Ziff, the son of a former Gabonese Prime Minister, was arrested in the US and charged with bribing officials in Guinea, Chad, and Niger to secure mining concessions and access confidential information; he also participated in rewriting Guinea’s mining law.",
      "• In December 2016, the US Department of Justice announced that this individual pleaded guilty to conspiring to make corrupt payments to African government officials.",
      "• According to a report by Global Witness, Sable Mining attempted to secure iron ore exploration rights to Mount Nimba by cultivating relationships with President Condé during the 2010 elections, including backing his campaign and bribing his son; these allegations remain unverified.",
      "• In March 2016, Guinean authorities initiated an investigation into Sable Mining’s activities and other contracts, including one involving Hyperdynamic’s offshore lease allocations and Rusal’s purchase of the Friguia Aluminum refinery, which was alleged to be significantly underpaid."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:48.905738",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4413,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Agriculture",
    "text": "Guinea also has considerable potential for growth in the agricultural and\nfishing sectors. Land, water, and climatic conditions provide opportunities\nfor large-scale irrigated farming and agroindustry. Possibilities for\ninvestment and commercial activities exist in all these areas, but Guinea's\npoorly developed infrastructure continues to present obstacles to investment\nprojects.",
    "openai_summarised_points": [
      "• Guinea possesses significant potential for growth in the agricultural and fishing sectors due to favorable land, water, and climatic conditions.",
      "• The country's natural resources create opportunities for large-scale irrigated farming and agroindustry development.",
      "• There are considerable possibilities for investment and commercial activities across these sectors, indicating a promising economic outlook in agriculture and fishing.",
      "• Despite these opportunities, Guinea's poorly developed infrastructure remains a major obstacle to the implementation and success of investment projects in agriculture and fishing industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:51.363977",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 382,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Energy",
    "text": "Three primary energy sources make up the energy mix in Guinea – biomass, oil\nand hydropower. With 78%, biomass (mostly charcoal) makes the largest\ncontribution in primary energy consumption in Guinea. It is locally produced,\nwhile Guinea imports all petroleum products.",
    "openai_summarised_points": [
      "• The energy mix in Guinea is primarily composed of three sources: biomass, oil, and hydropower.",
      "• Biomass accounts for the largest share of primary energy consumption in Guinea, constituting 78% of the total energy use.",
      "• The predominant form of biomass used is charcoal.",
      "• Biomass is produced locally within Guinea, reducing reliance on imports for this energy source.",
      "• In contrast, Guinea imports all petroleum products, indicating a dependence on foreign sources for oil-based energy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:20:52.946335",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 269,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Communications",
    "text": "The people of Guinea are among the poorest in West Africa and this reality is\nreflected in the development of the country's telecommunications environment.\nRadio is the most important source of information for the public in Guinea,\nand the only one to reach the entire country.\n\nThere is a single government-owned radio network, a growing number of private\nradio stations, and one government TV station. The fixed telephone system is\ninadequate, with just 18,000 lines to serve the country's 10.5 million\ninhabitants in 2012. The mobile cellular system is growing rapidly and had an\nestimated 4.8 million lines in 2012. Internet usage is very low, reaching just\n1.5% of the population in 2012."
  },
  {
    "chapter_name": "Economy of Guinea",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic statistics",
    "text": "The following table shows the main economic indicators in 1990–2024.\n\nYear  | GDP\n(in billion US$\nPPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in billion US$\nnominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1990  | 6.5  | 1,076  | 3.7  | 4.3%  | 25.7%  | 71.6%\n1995  | 8.9  | 1,129  | 5.1  | 4.7%  | 5.6%  | 66.5%\n2000  | 11.7  | 1,332  | 4.0  | 2.5%  | 6.8%  | 91.5%\n2005  | 15.2  | 1,588  | 4.5  | 3.0%  | 31.4%  | 97.9%\n2006  | 16.1  | 1,639  | 4.2  | 2.5%  | 34.7%  | 95.2%\n2007  | 17.6  | 1,749  | 6.3  | 6.5%  | 22.9%  | 60.8%\n2008  | 18.7  | 1,809  | 7.0  | 4.1%  | 18.4%  | 58.5%\n2009  | 18.5  | 1,745  | 6.8  | -1.5%  | 4.7%  | 61.3%\n2010  | 19.5  | 1,792  | 6.9  | 4.2%  | 15.5%  | 71.1%\n2011  | 21.0  | 1,883  | 6.8  | 5.6%  | 21.4%  | 53.9%\n2012  | 22.7  | 1,980  | 7.4  | 5.9%  | 15.2%  | 26.9%\n2013  | 24.0  | 2,041  | 8.4  | 3.9%  | 11.9%  | 34.0%\n2014  | 25.3  | 2,099  | 8.8  | 3.7%  | 9.7%  | 35.2%\n2015  | 26.5  | 2,146  | 8.8  | 3.8%  | 8.2%  | 44.4%\n2016  | 29.6  | 2,343  | 8.6  | 10.8%  | 8.2%  | 43.0%\n2017  | 33.3  | 2,566  | 10.3  | 10.3%  | 8.9%  | 41.9%\n2018  | 36.1  | 2,718  | 11.9  | 6.4%  | 9.8%  | 39.3%\n2019  | 40.5  | 2,971  | 13.4  | 5.6%  | 9.5%  | 38.6%\n2020  | 44.6  | 3,190  | 14.1  | 4.7%  | 10.6%  | 47.8%\n2021  | 51.3  | 3,581  | 16.3  | 5.6%  | 12.6%  | 42.7%\n2022  | 57.1  | 3,891  | 19.6  | 4.0%  | 10.5%  | 40.2%\n2023  | 62.5  | 4,157  | 23.0  | 5.7%  | 7.8%  | 40.8%\n2024  | 66.6  | 4,321  | 25.5  | 4.1%  | 11.0%  | 37.8%\nGuinea's export destinations in 2006.\n\n**GDP:** purchasing power parity – $26.5 billion (2017 est.)\n\n**GDP – real growth rate:** 6.7% (2017 est.)\n\n**GDP – per capita:** purchasing power parity – $2,000 (2017 est.)\n\n**GDP – composition by sector:**\n_agriculture:_ 19.5%\n_industry:_ 38.4%\n_services:_ 42.1% (2017 est.)\n\n**Population below poverty line:** 47% (2006 est.)\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ 2.7% (2007)\n_highest 10%:_ 30.3% (2007)\n\n**Inflation rate (consumer prices):** 8.9% (2017 est.)\n\n**Labor force:** 5.558 million (2017)\n\n**Labor force – by occupation:** agriculture 76%, industry and services 24%\n(2006 est.)\n\n**Unemployment rate:** 2.8% (2017 est.)\n\n**Ease of Doing Business Rank** 179th\n\n**Budget:**\n_revenues:_ $382.7 million\n_expenditures:_ $711.4 million, including capital expenditures of NA (2004\nest.)\n\n**Industries:** bauxite, gold, diamonds; alumina refining; light manufacturing\nand agricultural processing industries\n\n**Industrial production growth rate:** 8% (2017 est.)\n\n**Electricity – production:** 1 billion kWh (2015 est.)\n\n**Electricity – production by source:**\n_fossil fuel:_ 63.55%\n_hydro:_ 36.45%\n_nuclear:_ 0%\n_other:_ 0% (1998)\n\n**Electricity – consumption:** 930 million kWh (2015 est.)\n\n**Electricity – exports:** 0 kWh (2016)\n\n**Electricity – imports:** 0 kWh (2016)\n\n**Agriculture – products:** rice, coffee, pineapples, palm kernels, cassava\n(tapioca), bananas, sweet potatoes; cattle, sheep, goats; timber\n\n**Exports:** $2.115 billion (2017 est.)\n\n**Exports – commodities:** bauxite, alumina, gold, diamonds, coffee, fish,\nagricultural products\n\n**Exports – partners:** China 35.8%, Ghana 20.1%, UAE 11.6%, India 4.3% (2017)\n\n**Imports:** $2.475 billion (2017 est.)\n\n**Imports – commodities:** petroleum products, metals, machinery, transport\nequipment, textiles, grain and other foodstuffs (1997)\n\n**Imports – partners:** Netherlands 17.2%, China 13.2%, India 11.8%, Belgium\n10%, France 6.9%, UAE 4.5% (2017)\n\n**Debt – external:** $1.53 billion (31 December 2017 est.)\n\n**Economic aid – recipient:** $359.2 million (1998)\n\n**Currency:** 1 Guinean franc (GNF) = 100 centimes"
  }
]