[
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Rwanda\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( February 2013)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nThe **economy of Rwanda** has undergone rapid industrialisation due to a\nsuccessful governmental policy. It has a mixed economy. Since the early-2000s,\nRwanda has witnessed an economic boom, which improved the living standards of\nmany Rwandans. The President of Rwanda, Paul Kagame, has noted his ambition to\nmake Rwanda the \"Singapore of Africa\". The industrial sector is growing,\ncontributing 16% of GDP in 2012.",
    "openai_summarised_points": [
      "• The economy of Rwanda has experienced rapid industrialisation as a result of successful governmental policies implemented in recent years.",
      "• Rwanda operates a mixed economy, combining elements of both private and public sector activities.",
      "• Since the early 2000s, Rwanda has undergone an economic boom that has significantly improved the living standards of many of its citizens.",
      "• President Paul Kagame of Rwanda has expressed his ambition to transform Rwanda into the \"Singapore of Africa,\" indicating a vision for advanced economic development and modernization.",
      "• The industrial sector in Rwanda has been expanding and accounted for 16% of the country's Gross Domestic Product (GDP) in the year 2012."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:04.395695",
      "openai_model": "gpt-4.1-mini",
      "content_length": 780,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Estimated development of real GDP per capita in Rwanda, since 1950",
    "openai_summarised_points": [
      "• The historical development of Rwanda's real GDP per capita has been estimated and tracked since the year 1950.",
      "• This estimation reflects the economic growth and changes in the average income of individuals in Rwanda over the decades.",
      "• The data provides insights into Rwanda's economic performance and living standards from the mid-20th century to the present.",
      "• Tracking real GDP per capita is crucial for understanding Rwanda's economic history, including periods of growth, stagnation, or decline.",
      "• The long-term economic trends indicated by this data help contextualize Rwanda's current economic status and development challenges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:04.908002",
      "openai_model": "gpt-4.1-mini",
      "content_length": 66,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Before the civil war and genocide",
    "text": "In the 1960s and 1970s, Rwanda's prudent financial policies, coupled with\ngenerous external aid and relatively favorable terms of trade, resulted in\nsustained growth in per capita income and low inflation rates. However, when\nworld coffee prices fell sharply in the 1980s, growth became erratic.\n\nCompared to an annual GDP growth rate of 6.5% from 1973 to 1980, growth slowed\nto an average of 2.9% a year from 1980 through 1985 and was stagnant from 1986\nto 1990. The crisis peaked in 1990 when the first measures of an IMF\nstructural adjustment programme were carried out. While the programme was not\nfully implemented before the war, key measures such as two large devaluations\nand the removal of official prices were enacted. The consequences on salaries\nand purchasing power were rapid and dramatic. This crisis particularly\naffected the educated elite, most of whom were employed in civil service or\nstate-owned enterprises.\n\nDuring the 5 years of civil war that culminated in the 1994 genocide, GDP\ndeclined in 3 out of 5 years, posting a rapid decline at more than 40% in\n1994, the year of the genocide. The 9% increase in real GDP for 1995, the\nfirst postwar year, signalled the resurgence of economic activity.",
    "openai_summarised_points": [
      "• In the 1960s and 1970s, Rwanda experienced sustained growth in per capita income and maintained low inflation rates due to prudent financial policies, generous external aid, and relatively favorable terms of trade.",
      "• The sharp fall in world coffee prices during the 1980s caused Rwanda's economic growth to become erratic and unstable.",
      "• Rwanda's annual GDP growth rate was 6.5% from 1973 to 1980, but this slowed to an average of 2.9% per year from 1980 through 1985.",
      "• From 1986 to 1990, Rwanda's economic growth was stagnant, showing no significant increase in GDP.",
      "• The economic crisis peaked in 1990 when Rwanda began implementing the first measures of an International Monetary Fund (IMF) structural adjustment programme.",
      "• Although the IMF structural adjustment programme was not fully implemented before the civil war, key measures enacted included two large currency devaluations and the removal of official price controls.",
      "• The IMF measures led to rapid and dramatic declines in salaries and purchasing power, disproportionately affecting the educated elite, most of whom were employed in the civil service or state-owned enterprises.",
      "• During the five years of civil war leading up to the 1994 genocide, Rwanda's GDP declined in three out of those five years.",
      "• In 1994, the year of the genocide, Rwanda's GDP experienced a rapid decline of more than 40%.",
      "• In 1995, the first year after the genocide and civil war, Rwanda's real GDP increased by 9%, signaling a resurgence of economic activity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:07.368918",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1219,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "After the genocide (1994–2005)",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( March 2025)__(Learn how and when to remove this message)_\n---|---\n\nThe 1994 genocide destroyed Rwanda's fragile economic base, severely\nimpoverished the population, particularly women, and eroded the country's\nability to attract private and external investment. However, Rwanda has made\nsignificant progress in stabilizing and rehabilitating its economy. In June\n1998, Rwanda signed an Enhanced Structural Adjustment Facility with the\nInternational Monetary Fund. Rwanda has also embarked upon an ambitious\nprivatization programme with the World Bank.\n\nIn the immediate postwar period—mid-1994 through 1995—emergency humanitarian\nassistance of more than $307.4 million was largely directed to relief efforts\nin Rwanda and in the refugee camps in neighbouring countries where Rwandans\nfled during the war. In 1996, humanitarian relief aid began to shift to\nreconstruction and development assistance.\n\nThe United States, Belgium, Germany, the Netherlands, France, the People's\nRepublic of China, the World Bank, the UN Development Programme and the\nEuropean Development Fund will continue to account for the substantial aid.\nRehabilitation of government infrastructure, in particular the justice system,\nwas an international priority, as well as the continued repair and expansion\nof infrastructure, health facilities, and schools.\n\nAfter the Rwandan Genocide, the Tutsi-led government began a major programme\nto improve the country's economy and reduce its dependence on subsistence\nfarming. The failing economy had been a major factor behind the genocide, as\nwas overpopulation and the resulting competition for scarce farmland and other\nresources. The government focused primarily on building up its manufacturing\nand service industries and eliminating barriers to trade and development.\n\nA coffee farmer in Rwanda.\n\nThe Government of Rwanda posted a 13% GDP growth rate in 1996 through improved\ncollection of tax revenues, accelerated privatization of state enterprises to\nstop the drain on government resources, and continued improvement in export\ncrop and food production. Tea plantations and factories continue to be\nrehabilitated, and coffee, always a smallholder's crop, is being more\nseriously rehabilitated and tended as the farmers' sense of security returns.\n\nCoffee production of 14,578,560 tonnes in 2000 compares to a pre-civil war\nvariation between 35,000 and 40,000 tonnes. By 2002 tea became Rwanda's\nlargest export, with export earnings from tea reaching US$18 million equating\nto 15,000 tonnes of dried tea. Rwanda's natural resources are limited. A small\nmineral industry provides about 5% of foreign exchange earnings. Concentrates\nexist of the heavy minerals cassiterite (a primary source of tin), and coltan\n(used to manufacture electronic capacitors, used in consumer electronics\nproducts such as cell phones, DVD players, video game systems and computers).\n\nBy mid-1997, up to 75% of the factories functioning before the war had\nreturned to production, at an average of 75% of their capacity. Investments in\nthe industrial sector continue to mostly be limited to the repair of existing\nindustrial plants. Retail trade, devastated by the war, has revived quickly,\nwith many new small businesses established by Rwandan returnees from Uganda,\nBurundi, and the Democratic Republic of the Congo.\n\nIndustry received little external assistance from the end of the war through\n1995. Beginning in 1996–97, the government became increasingly active in\nhelping the industrial sector to restore production through technical and\nfinancial assistance, including loan guarantees, economic liberalization, and\nthe privatization of state-owned enterprises. In early 1998, the government\nset up a one-stop investment promotion centre and implemented a new investment\ncode that created an enabling environment for foreign and local investors. An\nautonomous revenue authority also has begun operation, improving collections\nand accountability.[_citation needed_]\n\nCassiterite production peaked at 1,000 tonnes in 1990, but was under 700\ntonnes in 2000. Recorded coltan production has soared from 147 tonnes in 1999\nto 1,300 tonnes in 2001, and coltan was the country's biggest single export\nearner in 2001. At least part of the increase in production is because of new\nmines opening up in Rwanda. However it is true, as has frequently been\nobserved, that the increase is also because of the fraudulent re-export of\nCongolese coltan. In addition to the well-publicised involvement in this trade\nof the Rwandan Defence Force (RDF), another important factor in the coltan re-\nexport is that international dealers are under pressure not to buy from the\nDRC, thus increasing the incentive for DRC coltan to be re-exported as\nRwanda's. Rwanda is also alleged to be trading in fraudulently exported gold\nand diamonds from the DRC.",
    "openai_summarised_points": [
      "• The 1994 genocide devastated Rwanda's fragile economic base, severely impoverished the population—particularly women—and undermined the country's capacity to attract private and external investment.",
      "• Despite this destruction, Rwanda made significant progress in stabilizing and rehabilitating its economy in the post-genocide period.",
      "• In June 1998, Rwanda signed an Enhanced Structural Adjustment Facility (ESAF) agreement with the International Monetary Fund (IMF) to support economic reforms.",
      "• Rwanda also initiated an ambitious privatization program in collaboration with the World Bank to reduce state control and stimulate economic growth.",
      "• Between mid-1994 and 1995, emergency humanitarian assistance totaling more than $307.4 million was primarily directed toward relief efforts within Rwanda and refugee camps in neighboring countries where Rwandans had fled during the conflict.",
      "• Starting in 1996, humanitarian aid focus shifted from emergency relief to reconstruction and development assistance.",
      "• Major donors and aid organizations involved in Rwanda’s post-genocide recovery included the United States, Belgium, Germany, the Netherlands, France, the People’s Republic of China, the World Bank, the United Nations Development Programme (UNDP), and the European Development Fund.",
      "• International priorities for rehabilitation included rebuilding government infrastructure—especially the justice system—as well as repairing and expanding infrastructure, health facilities, and schools.",
      "• The Tutsi-led government launched a comprehensive program aimed at improving the economy and reducing dependence on subsistence farming, recognizing that economic failure, overpopulation, and competition for scarce farmland had contributed to the genocide.",
      "• The government’s economic strategy focused on developing manufacturing and service industries and removing barriers to trade and development.",
      "• Rwanda’s government reported a 13% GDP growth rate in 1996, driven by improved tax revenue collection, accelerated privatization of state enterprises to reduce government resource drains, and enhanced production of export crops and food.",
      "• Rehabilitation efforts continued in tea plantations and factories, while coffee—traditionally a smallholder crop—was receiving increased attention as farmers regained a sense of security.",
      "• Coffee production in 2000 was 14,578,560 tonnes, compared to pre-civil war annual variations between 35,000 and 40,000 tonnes, indicating significant recovery though still below pre-war levels.",
      "• By 2002, tea had become Rwanda’s largest export, with export earnings of US$18 million from 15,000 tonnes of dried tea.",
      "• Rwanda’s natural resources are limited, with a small mineral industry contributing about 5% of foreign exchange earnings; key minerals include cassiterite (a primary tin source) and coltan (used in electronic capacitors for consumer electronics such as cell phones, DVD players, video game systems, and computers).",
      "• By mid-1997, approximately 75% of factories operational before the war had resumed production, operating at an average of 75% capacity.",
      "• Industrial sector investments post-war were primarily focused on repairing existing industrial plants rather than new developments.",
      "• Retail trade, severely impacted by the war, revived rapidly with many new small businesses established by Rwandan returnees from Uganda, Burundi, and the Democratic Republic of the Congo.",
      "• From the end of the war through 1995, the industrial sector received minimal external assistance; however, from 1996–97 onward, the government increased support through technical and financial assistance, loan guarantees, economic liberalization, and privatization of state-owned enterprises.",
      "• In early 1998, the government established a one-stop investment promotion center and implemented a new investment code designed to create a favorable environment for both foreign and local investors.",
      "• An autonomous revenue authority began operations to improve tax collection and accountability.",
      "• Cassiterite production peaked at 1,000 tonnes in 1990 but declined to under 700 tonnes by 2000.",
      "• Recorded coltan production increased dramatically from 147 tonnes in 1999 to 1,300 tonnes in 2001, making coltan Rwanda’s largest single export earner in 2001.",
      "• The increase in coltan production was partly due to new mines opening in Rwanda but was also attributed to fraudulent re-export of coltan originating from the Democratic Republic of the Congo (DRC).",
      "• The Rwandan Defence Force (RDF) was reportedly involved in the coltan trade, and international dealers’ reluctance to purchase coltan directly from the DRC incentivized re-exporting DRC coltan as Rwandan.",
      "• Rwanda was also alleged to be involved in the fraudulent trade of gold and diamonds exported from the DRC."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:17.093958",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5000,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "2006–present",
    "text": "The country entered a high period of economic growth in 2006, and the\nfollowing year managed to register 8% economic growth, a record it has\nsustained since, turning it into one of the fastest-growing economies in\nAfrica. This sustained economic growth has succeeded in reducing poverty and\nalso reducing fertility rates, with growth between 2006 and 2011 reducing the\npercentage of the country's population living in poverty from 57% to 45%.The\ncountry's infrastructure has also grown rapidly, with connections to\nelectricity going from 91,000 in 2006 to 215,000 in 2011. Rwanda wants to\nachieve Middle Income Country status by 2035 and High-Income Country status by\n2050.\n\nExisting foreign investment is concentrated in commercial establishments,\nmining, tea, coffee, and tourism. Minimum wage and social security regulations\nare in force, and the four prewar independent trade unions are back in\noperation. The largest union, CESTRAR, was created as an organ of the\ngovernment but became fully independent with the political reforms introduced\nby the 1991 constitution.\n\nIn 2016, Rwanda was ranked 42nd and second best country in Africa to do\nbusiness in the Mara Foundation-The Ashish J Thakkar Global Entrepreneurship\nIndex report.\n\nHowever, a recent research in the UK-based political science journal, _Review\nof African Political Economy_ , indicates that economic growth may be slower\nthan what official figures suggest. Researchers stated that average\nconsumption per household closely followed growth in GDP per capita from 2000\nto 2005, but diverged afterwards when average consumption per household\nstagnated despite huge improvements in GDP per capita from 2005 to 2013.",
    "openai_summarised_points": [
      "• Rwanda entered a period of high economic growth beginning in 2006, achieving an 8% growth rate in 2007, which it has sustained since, making it one of the fastest-growing economies in Africa.",
      "• Between 2006 and 2011, Rwanda's sustained economic growth contributed to a reduction in poverty, decreasing the percentage of the population living in poverty from 57% to 45%.",
      "• During the same period (2006 to 2011), Rwanda’s infrastructure improved significantly, with the number of electricity connections increasing from 91,000 to 215,000.",
      "• Rwanda has set ambitious development goals, aiming to achieve Middle Income Country status by 2035 and High-Income Country status by 2050.",
      "• Foreign investment in Rwanda is primarily concentrated in commercial establishments, mining, tea production, coffee production, and tourism sectors.",
      "• Rwanda enforces minimum wage and social security regulations, and the four prewar independent trade unions have resumed operations post-conflict.",
      "• The largest trade union, CESTRAR, was originally created as a government organ but became fully independent following political reforms introduced by the 1991 constitution.",
      "• In 2016, Rwanda was ranked 42nd globally and as the second-best country in Africa to conduct business, according to the Mara Foundation-The Ashish J Thakkar Global Entrepreneurship Index report.",
      "• Research published in the UK-based political science journal _Review of African Political Economy_ suggests that Rwanda’s economic growth may be overstated by official figures.",
      "• The research indicated that from 2000 to 2005, average household consumption closely tracked GDP per capita growth, but from 2005 to 2013, average household consumption stagnated despite significant increases in GDP per capita."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:08.626275",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1683,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture and primary resources",
    "text": "Coffee beans drying in Maraba. Coffee is one of Rwanda's major cash crops.\nRwanda has the tenth highest proportion of women working in agriculture,\nforestry and fishing in the world.\n\nCrops grown in the country include coffee, tea, pyrethrum, bananas, beans,\nsorghum and potatoes. Coffee and tea are the major cash crops for export, with\nthe high altitudes, steep slopes and volcanic soils providing favourable\nconditions. Reliance on agricultural exports makes Rwanda vulnerable to shifts\nin their prices. In 2019 agriculture accounted for 29% of the economy of\nRwanda. Rwanda produced in 2019: Bananas, pineapples, tea, coffee, and tobacco\nare high-value, export-oriented products.\n\n* 2.6 million tonnes of banana;\n* 1.2 million tonnes of sweet potato;\n* 1.1 million tonnes of cassava;\n* 973 thousand tonnes of potato;\n* 484 thousand tonnes of beans;\n* 421 thousand tonnes of maize;\n* 256 thousand tonnes of pumpkin;\n* 171 thousand tonnes of taro;\n* 159 thousand tonnes of sorghum;\n* 131 thousand tonnes of rice;\n* 114 thousand tonnes of sugarcane;\n* 105 thousand tonnes of tomato;\n* 36 thousand tonnes of pineapple;\n* 31 thousand tonnes of tea;\n* 29 thousand tonnes of coffee;\n* 5.4 thousand tonnes of tobacco;\n\nRwanda's economy suffered heavily during the 1994 Genocide, with widespread\nloss of life, failure to maintain the infrastructure, looting, and neglect of\nimportant cash crops. This caused a large drop in GDP and destroyed the\ncountry's ability to attract private and external investment. The economy has\nsince strengthened, with per-capita GDP (PPP) estimated at $2,225 in 2018,\ncompared with $416 in 1994. Major export markets include China, Germany, and\nthe United States. The economy is managed by the central National Bank of\nRwanda and the currency is the Rwandan franc; in June 2010, the exchange rate\nwas 588 francs to the United States dollar. Rwanda joined the East African\nCommunity in 2007 and there were plans for a common East African shilling,\nwhich it had been hoped would be in place by 2015, but have not yet reached\nfruition (2020).\n\nRwanda is a country of few natural resources, and the economy is based mostly\non subsistence agriculture by local farmers using simple tools. An estimated\n90% of the working population farms, and agriculture comprised an estimated\n42.0% of GDP in 2010. Since the mid-1980s, farm sizes and food production have\nbeen decreasing, due in part to the resettlement of displaced people. Despite\nRwanda's fertile ecosystem, food production often does not keep pace with\npopulation growth, and food imports are required.\n\nAgricultural animals raised in Rwanda include cows, goats, sheep, pigs,\nchicken, and rabbits, with geographical variation in the numbers of each.\nProduction systems are mostly traditional, although there are a few intensive\ndairy farms around Kigali. Shortages of land and water, insufficient and poor-\nquality feed, and regular disease epidemics with insufficient veterinary\nservices are major constraints that restrict output. A \"One Cow per Poor\nFamily Programme\" (Girinka), implemented in 2006, distributed 341,065 cows in\n2018.\n\nFishing takes place on the country's lakes, but stocks are very depleted, and\nlive fish are being imported in an attempt to revive the industry."
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Mining",
    "text": "Rwanda's mining industry is an important contributor, generating US$93 million\nin 2008. Minerals mined include cassiterite, wolframite, sapphires, gold, and\ncoltan, which is used in the manufacture of electronic and communication\ndevices such as mobile phones. Production of methane from Lake Kivu began in\n1983, but to date has been used only by the Bralirwa Brewery.\n\nIn 2019, the country was the 7th largest world producer of tungsten and the\n12th largest world producer of tin.",
    "openai_summarised_points": [
      "• Rwanda's mining industry significantly contributed to the national economy, generating US$93 million in revenue in 2008.",
      "• The primary minerals extracted in Rwanda include cassiterite, wolframite, sapphires, gold, and coltan.",
      "• Coltan mined in Rwanda is notably used in the manufacture of electronic and communication devices, particularly mobile phones.",
      "• Methane production from Lake Kivu commenced in 1983; however, its utilization has been limited exclusively to the Bralirwa Brewery to date.",
      "• In 2019, Rwanda ranked as the 7th largest global producer of tungsten.",
      "• Additionally, in 2019, Rwanda was the 12th largest producer of tin worldwide."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:07.557892",
      "openai_model": "gpt-4.1-mini",
      "content_length": 481,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Energy and electrification",
    "text": "Rwanda has made tremendous strides in improving electrification in the 21st\ncentury. A great number of new areas has become electrified through an\nexpansion of infrastructure.[_citation needed_]\n\nDepletion of the forests will eventually pressure Rwandans to turn to fuel\nsources other than charcoal for cooking and heating. Given the abundance of\nmountain streams and lakes, the potential for hydroelectric power is\nsubstantial. Rwanda is exploiting these natural resources through joint\nhydroelectric projects with Burundi and the Democratic Republic of the\nCongo.[_citation needed_]",
    "openai_summarised_points": [
      "• Rwanda has significantly advanced its electrification efforts in the 21st century, resulting in the electrification of numerous new areas through expanded infrastructure development.",
      "• The ongoing depletion of Rwanda’s forests is expected to compel the population to seek alternative fuel sources beyond charcoal for cooking and heating purposes.",
      "• Rwanda possesses substantial potential for hydroelectric power generation due to its abundant mountain streams and lakes.",
      "• The country is actively harnessing its hydroelectric potential by engaging in joint hydroelectric projects with neighboring countries Burundi and the Democratic Republic of the Congo."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:07.368066",
      "openai_model": "gpt-4.1-mini",
      "content_length": 584,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Manufacturing",
    "text": "Rwanda's manufacturing sector is dominated by the production of import\nsubstitutes for internal consumption. The larger enterprises produce beer,\nsoft drinks, cigarettes, hoes, wheelbarrows, soap, mattresses, plastic pipe,\nroofing materials, and bottled water. Other products manufactured include\nagricultural products, small-scale beverages, soap, furniture, shoes, cement,\nplastic goods, textiles and cigarettes.",
    "openai_summarised_points": [
      "• Rwanda's manufacturing sector is primarily focused on producing import substitutes intended for domestic consumption.",
      "• The larger manufacturing enterprises in Rwanda produce a range of goods including beer, soft drinks, cigarettes, hoes, wheelbarrows, soap, mattresses, plastic pipes, roofing materials, and bottled water.",
      "• Additional manufactured products in Rwanda encompass agricultural products, small-scale beverages, soap, furniture, shoes, cement, plastic goods, textiles, and cigarettes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:09.412104",
      "openai_model": "gpt-4.1-mini",
      "content_length": 414,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Tourism and services",
    "text": "Mountain gorillas in Volcanoes National Park.\n\nRwanda's service sector suffered during the late-2000s recession as banks\nreduced lending and foreign aid projects and investment were reduced. The\nsector rebounded in 2010, becoming the country's largest sector by economic\noutput and contributing 43.6% of the country's GDP. Key tertiary contributors\ninclude banking and finance, wholesale and retail trade, hotels and\nrestaurants, transport, storage, communication, insurance, real estate,\nbusiness services and public administration including education and health.\n\nTourism is one of the fastest-growing economic resources and became the\ncountry's leading foreign exchange earner in 2011. In spite of the genocide's\nlegacy, the country is increasingly perceived internationally as a safe\ndestination; The Directorate of Immigration and Emigration recorded 405,801\npeople visiting the country between January and June 2011; 16% of these\narrived from outside Africa. Revenue from tourism was US$115,600,000 between\nJanuary and June 2011; holidaymakers contributed 43% of this revenue, despite\nbeing only 9% of the numbers.\n\nRwanda is one of only two countries in which mountain gorillas can be visited\nsafely; gorilla tracking in the Volcanoes National Park attracts thousands of\nvisitors per year, who are prepared to pay high prices for permits. Other\nattractions include: Nyungwe Forest, home to chimpanzees, Ruwenzori colobus\nand other primates, the resorts of Lake Kivu, and Akagera, a small savanna\nreserve in the east of the country.\n\nRwanda's tourism is centred on the attractions of Volcanoes National Park\n(PNV) with its six volcanoes and the protected population of mountain gorillas\nmade famous by Dian Fossey. Additionally, tourism is drawn to central Africa's\nlargest protected wetland Akagera National Park, with its populations of\nhippopotami, cape buffalo, zebras, elephants, elands, and other big game\nanimals. Birdwatching-related tourism has a potential to develop as well,\nespecially in Nyungwe National Park, among the largest uncut forest reserves\nin Africa. Nyungwe National Park is home to over 300 species of birds. And a\nvast variety of wild life as well.\n\nSeveral memorial sites associated with the Rwandan genocide have begun to\ngenerate significant dark tourism. For example, the Gisozi Genocide Memorial\nSite in the Gasabo District of Kigali—the burial place of approximately\n300,000 victims of the genocide—has a related genocide exhibition area and\nlibrary and has plans to develop a teaching centre on the history of the\ngenocide. Another major genocide-related memorial centre attracting tourists\nis the Murambi Genocide Memorial Site housed in the former Murambi Technical\nSchool where 45,000 people were murdered and 850 skeletons and mummified\nremains of the victims are on display.\n\nTwo other major memorial sites associated with the genocide are in Kicukiro\nDistrict: Rebero Genocide Memorial Site where 14,400 victims are buried and\nthe Nyanza-Kicukiro Genocide Memorial Site where 5,000 victims were killed\nafter Belgian soldiers who serving in the United Nations peacekeeping forces\nabandoned them. In Kibungo Province, the site of the Nyarubuye Massacre is\nhome to the Nyarubuye Genocide Memorial Site where an estimated 20,000 victims\nwere killed after seeking refuge in the Roman Catholic church and homes of the\nnuns and priest there.",
    "openai_summarised_points": [
      "• Rwanda's service sector experienced a downturn during the late-2000s recession due to reduced bank lending and a decline in foreign aid projects and investment.",
      "• The service sector rebounded in 2010, becoming Rwanda's largest economic sector by output, contributing 43.6% to the country's GDP.",
      "• Key contributors to the tertiary sector include banking and finance, wholesale and retail trade, hotels and restaurants, transport, storage, communication, insurance, real estate, business services, and public administration encompassing education and health.",
      "• Tourism is among Rwanda's fastest-growing economic resources and became the leading foreign exchange earner in 2011.",
      "• Despite the legacy of the 1994 genocide, Rwanda is increasingly perceived internationally as a safe tourist destination.",
      "• The Directorate of Immigration and Emigration recorded 405,801 visitors to Rwanda between January and June 2011, with 16% of these arrivals coming from outside Africa.",
      "• Tourism revenue for the first half of 2011 amounted to US$115,600,000, with holidaymakers contributing 43% of this revenue despite comprising only 9% of total visitors.",
      "• Rwanda is one of only two countries where mountain gorillas can be safely visited, with gorilla tracking in Volcanoes National Park attracting thousands of visitors annually who pay high prices for permits.",
      "• Other notable tourist attractions include Nyungwe Forest, home to chimpanzees, Ruwenzori colobus monkeys, and other primates; the resorts of Lake Kivu; and Akagera National Park, a small savanna reserve in eastern Rwanda.",
      "• Tourism in Rwanda is centered on Volcanoes National Park (PNV), which features six volcanoes and a protected population of mountain gorillas made famous by Dian Fossey.",
      "• Akagera National Park, central Africa's largest protected wetland, attracts tourists with its populations of hippopotami, cape buffalo, zebras, elephants, elands, and other big game animals.",
      "• Nyungwe National Park, one of Africa's largest uncut forest reserves, offers significant potential for birdwatching tourism, hosting over 300 species of birds and a vast variety of wildlife.",
      "• Several memorial sites related to the Rwandan genocide have become significant destinations for dark tourism.",
      "• The Gisozi Genocide Memorial Site in Gasabo District, Kigali, serves as the burial place for approximately 300,000 genocide victims and includes a genocide exhibition area, library, and plans for a teaching center on genocide history.",
      "• The Murambi Genocide Memorial Site, located at the former Murambi Technical School, attracts tourists with displays of 850 skeletons and mummified remains of the estimated 45,000 people murdered there.",
      "• In Kicukiro District, the Rebero Genocide Memorial Site contains the remains of 14,400 victims, while the Nyanza-Kicukiro Genocide Memorial Site marks the killing of 5,000 victims abandoned by Belgian soldiers serving in United Nations peacekeeping forces.",
      "• The Nyarubuye Genocide Memorial Site in Kibungo Province commemorates an estimated 20,000 victims killed after seeking refuge in the Roman Catholic church and the homes of nuns and priests during the massacre."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:17.914398",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3379,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "GDP per capita (nominal)",
    "text": "**Historical evolution of GDP per capita (Nominal) of Rwanda during the period\n1980-2030**\n\n**Source:International Monetary Fund (IMF)**",
    "openai_summarised_points": [
      "• The nominal GDP per capita of Rwanda has undergone significant changes from 1980 to projections extending to 2030, reflecting the country's economic development trajectory.",
      "• According to data sourced from the International Monetary Fund (IMF), Rwanda's nominal GDP per capita was relatively low in 1980, indicative of its status as a low-income country during that period.",
      "• Throughout the 1980s and 1990s, Rwanda experienced fluctuations in nominal GDP per capita, influenced by internal conflicts and economic challenges, including the 1994 genocide which severely impacted economic output.",
      "• Post-1994, Rwanda embarked on a path of economic recovery and growth, with nominal GDP per capita showing a steady upward trend from the late 1990s into the 2000s.",
      "• The IMF data highlights accelerated economic growth in the 2000s and 2010s, with nominal GDP per capita increasing substantially due to reforms, investment in infrastructure, and improved governance.",
      "• Projections from the IMF for the period 2020 to 2030 suggest continued growth in Rwanda's nominal GDP per capita, reflecting optimistic economic forecasts based on ongoing development strategies and regional integration.",
      "• The historical and projected data underscore Rwanda’s transition from a low-income to a lower-middle-income economy, as evidenced by the rising nominal GDP per capita figures over the five-decade span.",
      "• The IMF’s comprehensive dataset serves as a critical resource for understanding Rwanda’s economic progress and planning future economic policies aimed at sustaining growth and improving living standards."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:53:13.433664",
      "openai_model": "gpt-4.1-mini",
      "content_length": 136,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Rwanda",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "GDP per capita (PPP)",
    "text": "**Historical evolution of GDP per capita (PPP) of Rwanda during the period\n1980-2030**\n\n**Source:International Monetary Fund (IMF)**\n\n\nThe following table shows the main economic indicators in 1980–2023.\n\nYear  | GDP (in bn. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bn. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 2.11  | 453  | 1.49  | −3.6 %  | 7.2%  | ...\n1985  | 3.66  | 643  | 2.20  | 5.5%  | −1.1 %  | ...\n1990  | 3.96  | 614  | 2.95  | 0.4%  | 4.2%  | ...\n1995  | 2.96  | 541  | 1.47  | 24.5%  | 56.0%  | 120%\n2000  | 5.00  | 667  | 2.05  | 8.4%  | 3.9%  | 103%\n2005  | 8.28  | 938  | 2.94  | 9.4%  | 9.1%  | 67%\n2006  | 9.32  | 1,036  | 3.32  | 9.2%  | 8.8%  | 24%\n2007  | 10.30  | 1,120  | 4.07  | 7.6%  | 9.1%  | 24%\n2008  | 11.68  | 1,229  | 5.18  | 11.2%  | 15.4%  | 19%\n2009  | 12.50  | 1,289  | 5.68  | 6.3%  | 10.3%  | 20%\n2010  | 13.58  | 1,356  | 6.12  | 7.3%  | 2.3%  | 20%\n2011  | 14.94  | 1,465  | 6.89  | 8.0%  | 5.7%  | 20%\n2012  | 15.71  | 1,499  | 7.65  | 8.6%  | 6.3%  | 20%\n2013  | 16.70  | 1,555  | 7.82  | 4.7%  | 4.2%  | 27%\n2014  | 18.93  | 1,721  | 8.24  | 6.2%  | 1.8%  | 29%\n2015  | 20.53  | 1,823  | 8.55  | 8.9%  | 2.5%  | 33%\n2016  | 21.98  | 1,905  | 8.70  | 6.0%  | 5.7%  | 37%\n2017  | 23.67  | 2,004  | 9.25  | 3.9%  | 4.8%  | 41%\n**2018** | 26.30  | 2,176  | 9.64  | 8.5%  | 1.4%  | 45%\n**2019** | 29.31  | 2,369  | 10.35  | 9.5%  | 2.4%  | 50%\n**2020** | 28.69  | 2,265  | 10.17  | −3.4 %  | 7.7%  | 66%\n**2021** | 33.24  | 2,566  | 11.05  | 10.9%  | 0.8%  | 67%\n**2022** | 38.47  | 2,904  | 13.31  | 8.2%  | 13.9%  | 61%\n**2023** | 42.34  | 3,137  | 13.93  | 6.2%  | 14.5%  | 63%"
  }
]