[
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Countries by GDP per capita (PPP) larger than Lithuania (2025)\n\nThe **economy of Lithuania** is the largest economy among the three Baltic\nstates. Lithuania is a member of the European Union and belongs to the group\nof very high human development countries and is a member of the WTO and OECD.\n\nIn the 1990s, Lithuania rapidly moved from a centrally planned economy to a\nmarket economy, implementing numerous liberal reforms. It enjoyed high growth\nrates after joining the European Union along with the other Baltic states,\nleading to the notion of a Baltic Tiger. Lithuania's economy (GDP) grew more\nthan 500 percent since regaining independence in 1990. The Baltic states have\na combined workforce of 3.3 million people, with 1.5 million of these working\npeople living in Lithuania.\n\nThe country is one of the fastest growing economies in the EU. GDP growth\nreached its peak in 2008, and was approaching the same levels again in 2018.\nSimilar to the other Baltic States, the Lithuanian economy suffered a deep\nrecession in 2009, with GDP falling by almost 15%. After this severe\nrecession, the country's economy started to show signs of recovery already in\nthe 3rd quarter of 2009. It returned to growth in 2010, with a positive 1.3\noutcome and with 6.6 per cent growth during the first half of 2011. GDP growth\nhad resumed in 2010, albeit at a slower pace than before the crisis. The\nsuccess of the crisis taming is attributed to the austerity policy of the\nLithuanian government.\n\nLithuania has a sound fiscal position. The 2017 budget resulted in a 0.5%\nsurplus, with the gross debt stabilising at around 40% of the GDP. The budget\nremained positive in 2017, and was expected to continue to do so in 2018.\n\nForeign direct investment into Lithuania has been spiking every year since\n2015, with significant increasements in 2020s, reaching its highest ever\nrecorded number in 2023. On average, around 80% of all foreign direct\ninvestment in Lithuania comes from European Union countries. Sweden was\nhistorically the largest investor with 20% – 30% of all FDI in Lithuania, but\nit has been overtaken by Germany, the Netherlands and even Estonia in the\n2010s. In 2017, Lithuania was the third country, after the Republic of Ireland\nand Singapore by the average job value of investment projects. Lithuania is\nranked 11th in the world in the Ease of Doing Business Index prepared by the\nWorld Bank Group, 16th out of 178 countries in the Index of Economic Freedom,\nmeasured by The Heritage Foundation and 8th out of 165 countries in the\nEconomic Freedom of the World 2021 by Fraser Institute.\n\nBased on OECD data, Lithuania is among the top 5 countries in the world by\npostsecondary (tertiary) education attainment. This educated workforce\nattracted investments, especially in the ICT sector during the past years. The\nLithuanian government and the Bank of Lithuania simplified procedures for\nobtaining licences for the activities of e-money and payment institutions.\npositioning the country as one of the most attractive for the financial\ntechnology initiatives in the EU.",
    "openai_summarised_points": [
      "• Lithuania possesses the largest economy among the three Baltic states and is a member of the European Union, the World Trade Organization (WTO), and the Organisation for Economic Co-operation and Development (OECD), classified as a country with very high human development.",
      "• During the 1990s, Lithuania transitioned rapidly from a centrally planned economy to a market economy by implementing numerous liberal reforms, which facilitated significant economic growth.",
      "• Since regaining independence in 1990, Lithuania's Gross Domestic Product (GDP) has increased by more than 500 percent, contributing to the Baltic states' reputation as the \"Baltic Tiger\" economies following their accession to the European Union.",
      "• The combined workforce of the Baltic states totals approximately 3.3 million people, with Lithuania accounting for 1.5 million employed individuals.",
      "• Lithuania is recognized as one of the fastest growing economies within the European Union, with GDP growth peaking in 2008 and approaching similar levels again by 2018.",
      "• The Lithuanian economy experienced a severe recession in 2009, with GDP contracting by nearly 15%, mirroring economic challenges faced by the other Baltic states.",
      "• Economic recovery began in the third quarter of 2009, with Lithuania returning to positive GDP growth in 2010 at 1.3%, followed by a robust 6.6% growth during the first half of 2011, although growth rates remained slower than pre-crisis levels.",
      "• The successful management of the 2009 economic crisis is largely attributed to the Lithuanian government's implementation of austerity policies.",
      "• Lithuania maintained a sound fiscal position in 2017, achieving a budget surplus of 0.5% and stabilizing gross government debt at approximately 40% of GDP; the budget remained positive in 2017 and was projected to continue this trend in 2018.",
      "• Foreign direct investment (FDI) in Lithuania has increased annually since 2015, with significant growth during the 2020s, culminating in the highest recorded FDI levels in 2023.",
      "• Approximately 80% of all FDI in Lithuania originates from European Union countries; historically, Sweden was the largest investor, contributing 20% to 30% of total FDI, but in the 2010s, Germany, the Netherlands, and Estonia surpassed Sweden in investment volume.",
      "• In 2017, Lithuania ranked third globally, following the Republic of Ireland and Singapore, in terms of the average job value created by investment projects.",
      "• Lithuania holds an 11th place ranking worldwide in the Ease of Doing Business Index by the World Bank Group, 16th out of 178 countries in the Index of Economic Freedom by The Heritage Foundation, and 8th out of 165 countries in the Economic Freedom of the World 2021 report by the Fraser Institute.",
      "• According to OECD data, Lithuania ranks among the top five countries globally for postsecondary (tertiary) education attainment, providing a highly educated workforce that has attracted substantial investment, particularly in the information and communications technology (ICT) sector.",
      "• The Lithuanian government, in collaboration with the Bank of Lithuania, has simplified licensing procedures for e-money and payment institutions, enhancing the country's attractiveness as a hub for financial technology (fintech) initiatives within the European Union."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:49.097950",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3072,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History of economy",
    "text": "The history of Lithuania can be divided into seven major periods. All the\nperiods have some interesting and important facts that affected the economic\nsituation of the country in those times.\n\n* Ancient times – Baltic tribes (until the 13th century)\n* Kingdom of Lithuania (1251–1263)\n* Grand Duchy of Lithuania (1263–1569)\n* Polish–Lithuanian Commonwealth (1569–1795)\n* Pressure of the Russian Empire (1795–1914)\n* Republic of Lithuania during the interwar period (1918–1940)\n* Lithuanian Soviet Socialist Republic (1944–1990)\n* Republic of Lithuania (1990–)",
    "openai_summarised_points": [
      "• The history of Lithuania's economy is segmented into seven major periods, each characterized by distinct economic conditions and developments influenced by historical events.",
      "• The first period, Ancient times until the 13th century, was dominated by Baltic tribes whose economic activities were primarily based on agriculture, hunting, fishing, and trade within the Baltic region.",
      "• The Kingdom of Lithuania (1251–1263) marked the establishment of a centralized state under Mindaugas, which began to influence economic structures through consolidation of territories and increased trade.",
      "• The Grand Duchy of Lithuania (1263–1569) was a significant era of territorial expansion and political power, fostering economic growth through agriculture, trade routes connecting the Baltic and Black Seas, and the development of towns and markets.",
      "• The Polish–Lithuanian Commonwealth (1569–1795) represented a union that created one of the largest and most populous states in Europe, with an economy based on agriculture, feudal estates, and increasing involvement in European trade networks.",
      "• During the Pressure of the Russian Empire (1795–1914), Lithuania experienced economic changes under Russian rule, including industrialization in some regions, but also economic restrictions and integration into the Russian imperial economy.",
      "• The Republic of Lithuania during the interwar period (1918–1940) saw efforts to rebuild and modernize the economy after independence, focusing on land reforms, industrial development, and establishing financial institutions.",
      "• The Lithuanian Soviet Socialist Republic (1944–1990) was characterized by a centrally planned economy with emphasis on heavy industry, collectivized agriculture, and integration into the Soviet economic system.",
      "• The Republic of Lithuania (1990–) marks the post-Soviet transition to a market economy, involving privatization, economic liberalization, integration into global markets, and membership in international organizations such as the European Union."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:57.700880",
      "openai_model": "gpt-4.1-mini",
      "content_length": 559,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "History up to the 20th century",
    "text": "The first Lithuanians formed a branch of an ancient ethno-linguistic group\nknown as the Balts. Up to the 4th century, Lithuanian tribes maintained close\ntrade contacts with the Roman Empire[_self-published source?_] via Aquileia\nprocessing center and Carnuntum. Amber was the main good provided to the Roman\nEmpire from Baltic Sea coast, via a long route called the Amber Road.\n\nAfterwards, the trading ties persisted with the central European tribes,\nfostering a consistent exchange of goods. Alongside the most prized commodity\nof amber, items such as leathers, furs, beeswax, and limited algicultural\nproductss were among the other traded commodities. The connections can be seen\nthrough the shared name for amber - the Hungarian _gyanta, gyantar_ are\nclosely related to the Lithuanian _gintaras_. It's still debated which\nlanguage group could have loaned the word from another.\n\nConsolidation of the Lithuanian lands began in the late 12th century. King\nMindaugas was the first Catholic King of Lithuania in 1253. The expansion of\nthe Grand Duchy of Lithuania reached its height in the middle of the 14th\ncentury under the Grand Duke Gediminas (reigned 1316–1341), who established a\nstrong central government which later came to dominate the territories from\nthe Baltic Sea to the Black Sea. Grand Duke Gediminas issued letters to the\nHanseatic league, offering free access to his domains for men of every order\nand profession from nobles and knights to tillers of the soil. Economic\nimmigrants and immigrants, seeking religious freedom improved the level of\nhandicrafts. During the reign of Duke Kęstutis (1297–1382), the first cash\ntaxes were introduced, although most taxes were still paid in goods (e.g.,\nwheat, cattle, horses).\n\nIn 1569 the Polish–Lithuanian Commonwealth formed through the union of the\nKingdom of Poland and the Grand Duchy of Lithuania. The economy of the\nCommonwealth was dominated by feudal agriculture based on the exploitation of\nthe agricultural workforce (serfs). Poland–Lithuania played a significant role\nin supplying 16th-century Western Europe with exports of three sorts of goods:\ngrain (rye), cattle (oxen) and fur. These three articles amounted to nearly\n90% of the country's exports to western markets by overland and maritime\ntrade.[_citation needed_] There was even a Lithuanian trading vessel – vytinė,\nused for four hundred years to transport grain via Nemunas river. Statutes of\nLithuania were the main collections of law statements and rules for nearly\nthree centuries since being published in 1529.\n\nThe Commonwealth was famous for Europe's first and the world's second modern\ncodified national constitution, the so-called Constitution of 3 May, declared\non 3 May 1791 (after the 1788 ratification of the United States Constitution).\nEconomic and commercial reforms, previously shunned as unimportant by the\nSzlachta, were introduced, and the development of industries was encouraged.\n\nFollowing the partitions of the Polish–Lithuanian Commonwealth in 1772, 1793\nand 1795, the Russian Empire controlled the majority of Lithuania. During the\nadministration of the Lithuanian lands by the Russian Empire from 1772 to\n1917, one of the most important events that affected economic relations was\nthe emancipation reform of 1861 in Russia. The reform amounted to the\nliquidation of serf dependence previously suffered by peasants; it boosted the\ndevelopment of capitalism. However, Lithuania, as did its neighbouring\nprovinces, remained an agricultural supplier for the post Industrial\nRevolution European markets.",
    "openai_summarised_points": [
      "• The first Lithuanians were part of the ancient ethno-linguistic group known as the Balts, maintaining close trade contacts with the Roman Empire up to the 4th century via the Aquileia processing center and Carnuntum.",
      "• Amber was the primary commodity supplied from the Baltic Sea coast to the Roman Empire, transported along a long trade route known as the Amber Road.",
      "• After the 4th century, trading ties continued with Central European tribes, involving a consistent exchange of goods including amber, leathers, furs, beeswax, and limited agricultural products.",
      "• Linguistic evidence of trade connections is seen in the shared name for amber: the Hungarian terms _gyanta, gyantar_ are closely related to the Lithuanian _gintaras_, though it remains debated which language group originally loaned the word.",
      "• The consolidation of Lithuanian lands began in the late 12th century, culminating in King Mindaugas becoming the first Catholic King of Lithuania in 1253.",
      "• The Grand Duchy of Lithuania reached its territorial peak in the mid-14th century under Grand Duke Gediminas (reigned 1316–1341), who established a strong central government controlling territories from the Baltic Sea to the Black Sea.",
      "• Grand Duke Gediminas issued letters to the Hanseatic League, granting free access to his domains for men of all orders and professions, including nobles, knights, and tillers of the soil, thereby encouraging economic immigration and religious freedom which enhanced handicraft production.",
      "• During the reign of Duke Kęstutis (1297–1382), the first cash taxes were introduced in Lithuania, although the majority of taxes continued to be paid in goods such as wheat, cattle, and horses.",
      "• In 1569, the Polish–Lithuanian Commonwealth was formed through the union of the Kingdom of Poland and the Grand Duchy of Lithuania, creating a feudal agricultural economy reliant on the exploitation of serfs.",
      "• The Commonwealth played a significant role in supplying 16th-century Western Europe with exports primarily consisting of grain (rye), cattle (oxen), and fur, which together accounted for nearly 90% of the country's exports to western markets via overland and maritime trade.",
      "• The Lithuanian trading vessel known as the vytinė was used for approximately four hundred years to transport grain along the Nemunas River.",
      "• The Statutes of Lithuania, first published in 1529, served as the main collections of legal statements and rules for nearly three centuries.",
      "• The Polish–Lithuanian Commonwealth was notable for adopting Europe's first and the world's second modern codified national constitution, the Constitution of 3 May, declared on 3 May 1791, following the 1788 ratification of the United States Constitution.",
      "• Economic and commercial reforms were introduced in the Commonwealth after 1791, encouraging industrial development despite previous neglect by the Szlachta (nobility).",
      "• Following the partitions of the Polish–Lithuanian Commonwealth in 1772, 1793, and 1795, the Russian Empire gained control over the majority of Lithuanian territory.",
      "• Under Russian administration from 1772 to 1917, the emancipation reform of 1861 was a pivotal event that abolished serfdom, thereby ending peasants' dependence and stimulating the development of capitalism in Lithuania.",
      "• Despite these changes, Lithuania and its neighboring provinces remained primarily agricultural suppliers to post-Industrial Revolution European markets during the Russian Empire's rule."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:12:10.087412",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3557,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Lithuania in the 20th century",
    "text": "Lithuania had stagnant economic growth in the interwar period (1919–1940). Its\nGDP growth resembled newly established agricultureal states such as Estonia\nand Poland. Lithuania's economy did not undergo contraction during the Great\nDepression.\n\nConstruction of _Lietūkis_ agricultural cooperative's warehouse in Klaipėda.\n\nOn 16 February 1918, the Council of Lithuania passed a resolution for the re-\nestablishment of the Independent State of Lithuania. Soon, many economic\nreforms for sustainable economic growth were implemented. A national currency,\ncalled the Lithuanian litas, was introduced in 1922. It proved to become one\nof the strongest and most stable currencies in Europe during the inter-war\nperiod. Lithuania had a monometalism system where one litas was covered by\n0.150462 grams of gold stored by the Bank of Lithuania in foreign countries.\nLitas remained stable even in the period of Great Depression. During the time\nof its independence, 1918–1940, Lithuania made substantial progress. For\nexample, Lithuania was the third-ranking flax producer and exporter in the\nworld market (export of flax constituted about 30 percent of all export\nshare), being surpassed only by Soviet Russia and Poland; Lithuanian farm\nproducts such as meat, dairy products, many kinds of grain, potatoes, etc.\nwere of superior quality in the world market. Lithuanian farmers were joining\ninto cooperative companies – e.g. _Lietūkis_ , _Pienocentras_ , _Linas_ ,\nwhich helped farmers to process and sell their products more efficiently and\nprofitably.\n\nHaving taken advantage of favorable international developments, and driven by\nits foreign policy aims directed against Lithuanian statehood, the Union of\nSoviet Socialist Republics (USSR) occupied Lithuania in 1940. Land and the\nmost important objects for the economy were nationalized, and most of the\nfarms collectivized. Just after one year of occupation, poverty level,\nunemployment increased dramatically, lack of food products appeared. Later,\nmany inefficient factories and industry companies, highly dependent on other\nregions of USSR, were established in Lithuania. Despite that, in 1990, GDP per\ncapita of the Lithuanian Soviet Socialist Republic was $8,591, which was above\nthe average for the rest of the Soviet Union of $6,871 but lagging behind\ndeveloped western countries.\n\nThe Soviet era brought Lithuania intensive industrialization and economic\nintegration into the USSR, although the level of technology and state concern\nfor environmental, health, and labor issues lagged far behind Western\nstandards. Urbanization increased from 39% in 1959 to 68% in 1989. From 1949\nto 1952 the Soviets abolished private ownership in agriculture, establishing\ncollective and state farms. Production declined and did not reach pre-war\nlevels until the early 1960s. The intensification of agricultural production\nthrough intense chemical use and mechanization eventually doubled production\nbut created additional ecological problems. This changed after independence,\nwhen farm production dropped due to difficulties in restructuring the\nagricultural sector.\n\nThe overall damage, resulted from the Soviet occupation (including the loss of\ngross domestic product), estimated according to the UN recognised\nmethodologies amounted to approximately US$800 billion; direct damage\n(including genocide and deportations of the citizens, property looting)\nestimation is US$20 billion.\n\nAccording to a 2019 study by economic historians, Lithuania had above average\neconomic growth from 1937 to 1973 (when compared to other economies), but\nbelow average growth from 1973 to 1990.",
    "openai_summarised_points": [
      "• During the interwar period (1919–1940), Lithuania experienced stagnant economic growth, with its GDP growth pattern resembling that of newly established agricultural states such as Estonia and Poland.",
      "• Lithuania’s economy did not contract during the Great Depression, maintaining relative stability in this global economic crisis.",
      "• On 16 February 1918, the Council of Lithuania passed a resolution to re-establish the Independent State of Lithuania, initiating numerous economic reforms aimed at sustainable growth.",
      "• In 1922, Lithuania introduced a national currency called the Lithuanian litas, which became one of the strongest and most stable currencies in Europe during the interwar period.",
      "• The Lithuanian litas operated under a monometalism system, where one litas was backed by 0.150462 grams of gold held by the Bank of Lithuania in foreign countries.",
      "• The litas remained stable even throughout the Great Depression, contributing to economic resilience during this period.",
      "• Between 1918 and 1940, Lithuania made significant economic progress, becoming the third-largest flax producer and exporter globally, with flax exports constituting about 30 percent of the country’s total export share, surpassed only by Soviet Russia and Poland.",
      "• Lithuanian agricultural products such as meat, dairy, various grains, and potatoes were recognized for their superior quality in the world market.",
      "• Lithuanian farmers increasingly joined cooperative companies such as _Lietūkis_, _Pienocentras_, and _Linas_, which enhanced the efficiency and profitability of processing and selling farm products.",
      "• The USSR occupied Lithuania in 1940, motivated by favorable international conditions and foreign policy aims hostile to Lithuanian statehood.",
      "• Following Soviet occupation, land and key economic assets were nationalized, and most farms were collectivized.",
      "• Within one year of Soviet occupation, poverty and unemployment rose sharply, and shortages of food products emerged.",
      "• The Soviet regime established many inefficient factories and industrial enterprises in Lithuania, which were highly dependent on other USSR regions.",
      "• By 1990, the GDP per capita of the Lithuanian Soviet Socialist Republic was $8,591, exceeding the Soviet Union average of $6,871 but remaining below levels in developed Western countries.",
      "• The Soviet era brought intensive industrialization and economic integration into the USSR, although technological advancement and state attention to environmental, health, and labor standards lagged significantly behind Western norms.",
      "• Urbanization in Lithuania increased from 39% in 1959 to 68% in 1989 under Soviet rule.",
      "• Between 1949 and 1952, the Soviets abolished private agricultural ownership, replacing it with collective and state farms, which initially caused a decline in agricultural production that did not recover to pre-war levels until the early 1960s.",
      "• Agricultural production was later intensified through increased mechanization and chemical use, which eventually doubled output but also caused ecological problems.",
      "• After Lithuania regained independence, agricultural production declined due to challenges in restructuring the agricultural sector.",
      "• The overall damage caused by the Soviet occupation, including loss of gross domestic product, was estimated at approximately US$800 billion based on UN-recognized methodologies.",
      "• Direct damages from the Soviet occupation, including genocide, deportations, and property looting, were estimated at US$20 billion.",
      "• A 2019 study by economic historians found that Lithuania experienced above-average economic growth from 1937 to 1973 compared to other economies, but below-average growth from 1973 to 1990."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:12:25.346830",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3616,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Development since the 1990s",
    "text": "Countries with larger GDP PPP per capita than Lithuania in 1995 vs 2022\n\nReforms since the mid-1990s led to an open and rapidly growing economy. Open\nto global trade and investment, Lithuania now enjoys high degrees of business,\nfiscal, and financial freedom. Lithuania is a member of the EU and the WTO, so\nregulation is relatively transparent and efficient, with foreign and domestic\ncapital subject to the same rules. The financial sector is advanced,\nregionally integrated, and subject to few intrusive regulations.\n\nOne of Lithuania's most important reforms was the privatization of state-owned\nassets. The first stage of privatization was being implemented between 1991\nand 1995. Citizens were given investment vouchers worth €3.1 billion in\nnominal value, which let them participate in assets selling. By October 1995,\nthey were used as follows: 65% for acquisition of shares; 19% for residential\ndwellings; 5% for agricultural properties; and 7% remained unused. More than\n5,700 enterprises with €2.0 billion worth of state capital in book value were\nsold using four initial privatization methods: share offerings; auctions; best\nbusiness plans competitions; and hard currency sales.\n\nThe second privatization step began in 1995 by approving a new law that\nensured greater diversity of privatization methods and that enabled\nparticipation in the selling process without vouchers. Between 1996 and 1998,\n526 entities were sold for more than €0.7 billion. Before the reforms, the\npublic sector totally dominated the economy, whereas the share of the private\nsector in GDP increased to over 70% by the 2000 and 80% in 2011.\n\nMonetary reform was undertaken in the early nineties to improve the stability\nof the economy. Lithuania chose a currency board system controlled by the Bank\nof Lithuania independent of any government institution. On 25 June 1993, the\nLithuanian litas was introduced as a freely convertible currency, but on 1\nApril 1994 it was pegged to the United States dollar at a rate of 4 to 1. The\nmechanism of the currency board system enabled Lithuania to stabilize\ninflation rates to single digits. The stable currency rate helped to establish\nforeign economic relations, therefore leading[_citation needed_] to a constant\ngrowth of foreign trade.\n\nBy 1998, the economy had survived the early years of uncertainty and several\nsetbacks, including a banking crisis. However, the collapse of the Russian\nruble in August 1998 shocked the economy into negative growth and forced the\nreorientation of trade from Russia towards the West. In 1997, exports to the\nSoviet Union's successor entity (the Commonwealth of Independent States) made\nup 45% of total Lithuanian exports. This share of exports dropped to 21% of\nthe total in 2006, while exports to EU members increased to 63% of the total.\nExports to the United States made up 4.3% of all Lithuania's exports in 2006,\nand imports from the United States comprised 2% of total imports. Foreign\ndirect investment (FDI) in 2005 was €0.8 billion.\n\nShare of private sector in GDP\n\nLithuania was invited to the Helsinki EU summit in December 1999 to begin EU\naccession talks in early 2000. On 2 February 2002 the litas was pegged to the\neuro at a rate of 3.4528 to 1, which remained until Lithuania adopted the euro\nin 2015. Lithuania was very close to introducing the euro in 2007, but the\ninflation level exceeded the Maastricht requirements. On 1 January 2015,\nLithuania became the 19th country to use the euro.\n\nThe Vilnius Stock Exchange, now renamed the NASDAQ OMX Vilnius, started its\nactivity in 1993 and was the first stock exchange in the Baltic states. In\n2003, the VSE was acquired by OMX. Since 27 February 2008 the Vilnius Stock\nExchange has been a member of NASDAQ OMX Group, which is the world's largest\nexchange company across six continents, with over 3,800 listed companies. The\nmarket cap of Vilnius Stock Exchange was €3.4 billion on 27 November 2009.\n\nDuring the last decade (1998–2008) the structure of Lithuania's economy has\nchanged significantly. The biggest changes were recorded in the agricultural\nsector as the share of total employment decreased from 19.2% in 1998 to just\n7.9% in 2008. The service sector plays an increasingly important role. The\nshare of GDP in financial intermediation and real estate sectors was 17% in\n2008 compared to 11% in 1998. The share of total employment in the financial\nsector in 2008 has doubled compared with 1998.",
    "openai_summarised_points": [
      "• Since the mid-1990s, Lithuania has undergone reforms that transformed its economy into an open and rapidly growing system characterized by high levels of business, fiscal, and financial freedom.",
      "• Lithuania is a member of both the European Union (EU) and the World Trade Organization (WTO), resulting in relatively transparent and efficient regulation where foreign and domestic capital are subject to the same rules.",
      "• The financial sector in Lithuania is advanced, regionally integrated, and operates with minimal intrusive regulations.",
      "• A key reform was the privatization of state-owned assets, initiated between 1991 and 1995, during which citizens received investment vouchers worth €3.1 billion nominally to participate in asset sales.",
      "• By October 1995, the investment vouchers were utilized as follows: 65% for acquiring shares, 19% for residential dwellings, 5% for agricultural properties, and 7% remained unused.",
      "• Over 5,700 enterprises with a book value of €2.0 billion in state capital were privatized through four initial methods: share offerings, auctions, best business plan competitions, and hard currency sales.",
      "• The second phase of privatization began in 1995 with a new law that expanded privatization methods and allowed participation without vouchers; between 1996 and 1998, 526 entities were sold for over €0.7 billion.",
      "• Prior to reforms, the public sector dominated Lithuania’s economy, but by 2000 the private sector accounted for over 70% of GDP, increasing to 80% by 2011.",
      "• Lithuania implemented monetary reform in the early 1990s, adopting a currency board system managed by the independent Bank of Lithuania.",
      "• On 25 June 1993, the Lithuanian litas was introduced as a freely convertible currency; on 1 April 1994, it was pegged to the US dollar at a fixed rate of 4 to 1.",
      "• The currency board system stabilized inflation rates to single digits, fostering stable currency exchange rates that facilitated foreign economic relations and sustained growth in foreign trade.",
      "• By 1998, Lithuania’s economy had overcome early uncertainties and setbacks, including a banking crisis, but the August 1998 collapse of the Russian ruble triggered negative growth and necessitated a shift in trade focus from Russia to Western markets.",
      "• In 1997, exports to the Commonwealth of Independent States (CIS) accounted for 45% of Lithuania’s total exports; by 2006, this share dropped to 21%, while exports to EU members rose to 63%.",
      "• In 2006, exports to the United States constituted 4.3% of Lithuania’s total exports, and imports from the US made up 2% of total imports.",
      "• Foreign direct investment (FDI) in Lithuania reached €0.8 billion in 2005.",
      "• Lithuania was invited to the Helsinki EU summit in December 1999 to commence EU accession negotiations in early 2000.",
      "• On 2 February 2002, the Lithuanian litas was pegged to the euro at a rate of 3.4528 to 1, a peg maintained until Lithuania adopted the euro in 2015.",
      "• Lithuania nearly adopted the euro in 2007 but was delayed due to inflation exceeding the Maastricht criteria.",
      "• On 1 January 2015, Lithuania became the 19th country to adopt the euro as its official currency.",
      "• The Vilnius Stock Exchange (VSE), established in 1993 as the first stock exchange in the Baltic states, was acquired by OMX in 2003.",
      "• Since 27 February 2008, the Vilnius Stock Exchange has been part of the NASDAQ OMX Group, the world’s largest exchange company with over 3,800 listed companies across six continents.",
      "• The market capitalization of the Vilnius Stock Exchange was €3.4 billion as of 27 November 2009.",
      "• Between 1998 and 2008, Lithuania’s economic structure changed significantly, notably in agriculture where employment declined from 19.2% in 1998 to 7.9% in 2008.",
      "• The service sector’s importance increased, with the share of GDP from financial intermediation and real estate rising from 11% in 1998 to 17% in 2008.",
      "• Employment in the financial sector doubled between 1998 and 2008, reflecting the sector’s growing role in the Lithuanian economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:12:44.292369",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4440,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Lithuania in the 21st century",
    "text": "Real GDP growth in Lithuania, 1996–2019\n\nBetween 2000 and 2017, the Lithuanian GDP grew by 308%.\n\nEuropa Shopping Center in Vilnius with international brandmarks\n\nOne of the most important factors contributing to Lithuania's economic growth\nwas its accession to the WTO in 2001 and the EU in 2004, which allows free\nmovement of labour, capital, and trade among EU member states. On the other\nhand, rapid growth caused some imbalances in inflation and balance of\npayments. The current account deficit to GDP ratio in 2006–2008 was in the\ndouble digits and reached its peak in the first quarter of 2008 at a\nthreatening 18.8%. This was mostly due to rapid loan portfolio growth as\nScandinavian banks provided cheap credit under quite lax rules in Lithuania.\nThe volume of loans to acquire lodgings has grown from 50 million LTL in 2004\nup to 720 million LTL in 2007.[_citation needed_] Consumption was affected by\ncredit expansion as well. This led to high inflation of goods and services, as\nwell as trade deficit. A housing bubble was formed.\n\nEconomic sentiment indicator and its components\n\nThe global credit crunch which started in 2008 affected the real estate and\nretail sectors. The construction sector shrank by 46.8% during the first\nthree-quarters of 2009 and the slump in retail trade was almost 30%. GDP\nplunged by 15.7% in the first nine months of 2009.\n\nBalance of payments in Lithuania, quarterly data\n\nLithuania was the last among the Baltic states to be hit by recession because\nits GDP growth rate in 2008 was still positive, followed by a slump of more\nthan 15% in 2009. In the third quarter of 2009, compared to the previous\nquarter, GDP again grew by 6.1% after five-quarters with negative numbers.\nAusterity policy (four-fifths of the fiscal adjustment consisted of\nexpenditure cuts) introduced by the Kubilius government helped to balance the\ncurrent account from −15.5 in 2007 to 1.6 in 2009. Economic sentiment and\nconfidence of all business activities have rebounded from a record low at the\nbeginning of the year 2009.\n\nSectors related to domestic consumption and real estate still suffer from the\neconomic crisis, but exporters have started making profits even with lower\nlevels of revenue. The catalysts of growing profit margins are lower raw\nmaterial prices and staff expense.\n\nAt the end of 2017, investment of Lithuania's enterprises abroad amounted to\nEUR 2.9 billion. The largest investment was made in Netherlands (24.1 per cent\nof the total direct investment abroad), Cyprus (19.8 per cent), Latvia (14.9\nper cent), Poland (10.5 per cent) and Estonia (10.3 per cent). Lithuania's\ndirect investment in the EU member states totalled EUR 2.6 billion, or 89.3\nper cent of the total direct investment abroad.\n\nBased on the Eurostat's data, in 2017, the value of Lithuanian exports\nrecorded the most rapid growth not only in the Baltic countries, but also\nacross Europe, which was 16.9 per cent. Lithuania performs well in few\nmeasures of well-being in the Better Life Index by OECD, ranking above the\naverage in education and skills, and work-life balance. It is below the\naverage in income and wealth, jobs and earnings, housing, health status,\nsocial connections, civic engagement, environmental quality, personal\nsecurity, and subjective well-being. Lithuanian people are the happiest people\nin the Baltic States.",
    "openai_summarised_points": [
      "• Between 2000 and 2017, Lithuania's GDP grew by 308%, indicating substantial economic expansion over this period.",
      "• Lithuania's accession to the World Trade Organization (WTO) in 2001 and the European Union (EU) in 2004 were pivotal factors in its economic growth, facilitating free movement of labor, capital, and trade among EU member states.",
      "• Rapid economic growth in Lithuania led to imbalances such as inflation and a significant balance of payments deficit; the current account deficit to GDP ratio was in double digits during 2006–2008, peaking at 18.8% in the first quarter of 2008.",
      "• The high current account deficit was largely driven by rapid loan portfolio growth, with Scandinavian banks providing cheap credit under lax regulations; loans for housing acquisition increased dramatically from 50 million LTL in 2004 to 720 million LTL in 2007.",
      "• Credit expansion fueled consumption, resulting in high inflation of goods and services and a trade deficit, ultimately causing a housing bubble in Lithuania.",
      "• The global credit crunch beginning in 2008 severely impacted Lithuania’s real estate and retail sectors, with the construction sector contracting by 46.8% and retail trade declining by nearly 30% during the first three quarters of 2009.",
      "• Lithuania’s GDP fell sharply by 15.7% in the first nine months of 2009, marking a severe recession period.",
      "• Lithuania was the last Baltic state to enter recession, maintaining positive GDP growth in 2008 before experiencing a slump exceeding 15% in 2009; however, GDP rebounded by 6.1% in the third quarter of 2009 compared to the previous quarter after five quarters of negative growth.",
      "• The austerity policy implemented by the Kubilius government, primarily consisting of expenditure cuts (four-fifths of fiscal adjustment), helped improve the current account balance from −15.5% in 2007 to 1.6% in 2009.",
      "• Economic sentiment and business confidence recovered from record lows at the start of 2009, signaling a gradual economic recovery.",
      "• Despite ongoing challenges in sectors tied to domestic consumption and real estate, exporters began generating profits even with reduced revenue levels, aided by lower raw material prices and decreased staff expenses.",
      "• By the end of 2017, Lithuanian enterprises’ investments abroad totaled EUR 2.9 billion, with the largest shares in the Netherlands (24.1%), Cyprus (19.8%), Latvia (14.9%), Poland (10.5%), and Estonia (10.3%).",
      "• Lithuania’s direct investment in EU member states amounted to EUR 2.6 billion in 2017, representing 89.3% of its total direct investment abroad.",
      "• According to Eurostat data, Lithuanian exports experienced the fastest growth in 2017 among the Baltic countries and across Europe, with a 16.9% increase.",
      "• The OECD Better Life Index ranks Lithuania above average in education and skills, and work-life balance, while it ranks below average in income and wealth, jobs and earnings, housing, health status, social connections, civic engagement, environmental quality, personal security, and subjective well-being.",
      "• Among the Baltic States, Lithuanian people are considered the happiest, reflecting relatively higher subjective well-being within the region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:12:55.658389",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3347,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "1.4.1",
    "section_name": "Euro adoption",
    "text": "Real GPD per capita development of Estonia, Latvia and Lithuania\n\nOn 1 January 2015, Lithuania became the 19th country to adopt the euro.\nJoining the euro would relieve the Bank of Lithuania of defending the value of\nthe litas, and \"it would give Lithuania a say in the decision-making of the\nEuropean Central Bank (ECB), as well as access to the ECB single-resolution\nfund and cheaper borrowing costs\".",
    "openai_summarised_points": [
      "• On 1 January 2015, Lithuania officially adopted the euro, becoming the 19th country to join the Eurozone.",
      "• The adoption of the euro relieved the Bank of Lithuania from the responsibility of defending the value of the national currency, the litas.",
      "• By joining the Eurozone, Lithuania gained the right to participate in the decision-making processes of the European Central Bank (ECB).",
      "• Lithuania also obtained access to the ECB's single-resolution fund, which supports the stability of the banking sector within the Eurozone.",
      "• Euro adoption provided Lithuania with the benefit of cheaper borrowing costs due to increased financial integration and credibility within the Eurozone.",
      "• The section references the real GDP per capita development of Estonia, Latvia, and Lithuania, implying economic context related to the Baltic states’ economic performance around the time of euro adoption."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:00.472798",
      "openai_model": "gpt-4.1-mini",
      "content_length": 403,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Business climate",
    "text": "In 2024, Lithuania ranks 9th in the International Tax Competitiveness Index,\nconfirming its attractiveness for business. In the Index of Economic Freedom,\nthis European country ranks 15th, and 11th in the Ease of Doing Business\nIndex, underscoring its status as one of the most favorable jurisdictions for\nentrepreneurship in Europe.\n\nCumulative foreign direct investment (FDI) in 2017 was EUR 14.7 billion, or 35\nper cent of GDP, EUR 5215 per capita. The largest FDI flow in Lithuania was\ninto manufacturing (EUR 73.7 million), agriculture, forestry, fishery (EUR\n27.4 million), information and communication (EUR 10 million). Sweden, The\nNetherlands and Germany have remained the largest investors.\n\nLithuania seeks to become an innovation hub by 2020. To reach this goal, it is\nputting its efforts into attracting FDI to added-value sectors, especially IT\nservices, software development, consulting, finance, and logistics. Well-known\ninternational companies such as Microsoft, IBM, Transcom, Barclays, Siemens,\nSEB, TeliaSonera, Paroc, Wix.com, Philip Morris, Thermo Fisher Scientific\nestablished a presence in Lithuania.\n\nAerial view of the Kaunas Free Economic Zone\n\nLithuanian FEZs (Free economic zone) offer developed infrastructure, service\nsupport, and tax incentives. A company set up in an FEZ is exempt from\ncorporate taxation for its first six years, as well as a tax on dividends and\nreal estate tax. 7 FEZ operate in Lithuania – Marijampolė Free Economic Zone,\nKaunas Free Economic Zone, Klaipėda Free Economic Zone, Panevėžys Free\nEconomic Zone, Akmenė Free Economic Zone, Šiauliai Free Economic Zone,\nKėdainiai Free Economic Zone. There are nine industrial sites in Lithuania,\nwhich can also provide additional advantages by having a well-developed\ninfrastructure, offering consultancy service and tax incentives. Lithuania is\nranked third among developed economies by the quantity (16) of Special\nEconomic Zones – after USA (256) and Poland (21).\n\nLithuanian municipalities provide special incentives to investors who create\njobs or invest in infrastructure. Municipalities may tie designation criteria\nto additional factors, such as the number of jobs created or environmental\nbenefits. Strategic investors' benefits could include favorable tax incentives\nfor up to ten years. Municipalities may grant special incentives to induce\ninvestments in municipal infrastructure, manufacturing, and services.\n\nAbout 40 percent of surveyed investors confirmed that they are carrying out\nResearch and experimental development (R&D) or plan to do it in their\nLithuanian branches. In 2018 Lithuania ranked as the second most attractive\nlocation for manufacturers in the Manufacturing Risk Index 2018. In 2019,\nLithuania was 16th in _Top 20 European FDI destination countries_ list,\ncreated by the Ernst & Young.",
    "openai_summarised_points": [
      "• In 2024, Lithuania is ranked 9th in the International Tax Competitiveness Index, highlighting its attractiveness for business activities.",
      "• Lithuania holds the 15th position in the Index of Economic Freedom, reflecting a favorable economic environment.",
      "• The country is ranked 11th in the Ease of Doing Business Index, underscoring its status as one of the most favorable jurisdictions for entrepreneurship in Europe.",
      "• As of 2017, cumulative foreign direct investment (FDI) in Lithuania amounted to EUR 14.7 billion, representing 35 percent of GDP and EUR 5215 per capita.",
      "• The largest FDI inflows in Lithuania were directed towards manufacturing (EUR 73.7 million), agriculture, forestry, and fishery (EUR 27.4 million), and information and communication sectors (EUR 10 million).",
      "• Sweden, The Netherlands, and Germany have consistently been the largest foreign investors in Lithuania.",
      "• Lithuania aims to become an innovation hub by 2020, focusing on attracting FDI to high value-added sectors such as IT services, software development, consulting, finance, and logistics.",
      "• Prominent international companies with operations in Lithuania include Microsoft, IBM, Transcom, Barclays, Siemens, SEB, TeliaSonera, Paroc, Wix.com, Philip Morris, and Thermo Fisher Scientific.",
      "• Lithuanian Free Economic Zones (FEZs) provide developed infrastructure, service support, and tax incentives, including exemption from corporate taxation for the first six years, as well as exemptions from dividend and real estate taxes.",
      "• There are seven FEZs operating in Lithuania: Marijampolė, Kaunas, Klaipėda, Panevėžys, Akmenė, Šiauliai, and Kėdainiai Free Economic Zones.",
      "• Lithuania also hosts nine industrial sites offering additional advantages such as well-developed infrastructure, consultancy services, and tax incentives.",
      "• Lithuania ranks third among developed economies by the number of Special Economic Zones (16), following the USA (256) and Poland (21).",
      "• Lithuanian municipalities provide special incentives to investors who create jobs or invest in infrastructure, with criteria potentially linked to job creation or environmental benefits.",
      "• Strategic investors may receive favorable tax incentives for up to ten years from municipalities.",
      "• Municipalities may grant special incentives to encourage investments in municipal infrastructure, manufacturing, and service sectors.",
      "• Approximately 40 percent of surveyed investors confirmed they are conducting or planning to conduct Research and Experimental Development (R&D) activities in their Lithuanian branches.",
      "• In 2018, Lithuania was ranked as the second most attractive location for manufacturers according to the Manufacturing Risk Index 2018.",
      "• In 2019, Lithuania was placed 16th in the \"Top 20 European FDI destination countries\" list compiled by Ernst & Young."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:14.396471",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2819,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Regional situation",
    "text": "Lithuania is divided into ten counties. There are four cities with a\npopulation over 100,000 and two cities of over 50,000 people. The gross\nregional product is concentrated in the two largest counties – Vilnius and\nKaunas. These two counties account for two-thirds of the GDP with just 50% of\nthe population.\n\nIn 2023-Q3 Vilnius County was the only one with the average salary above the\nnational average, while Utena County had the lowest with 20% below it.\n\nIn order to achieve balanced regional distribution of GDP, nine public\nindustrial parks (Akmene Industrial Park, Alytus Industrial Park, Kedainiai\nIndustrial Park, Marijampolė Industrial Park, Pagegiai Industrial Park,\nPanevėžys Industrial Park, Radviliskis Industrial Park, Ramygala Industrial\nPark and Šiauliai Industrial Park) and three private industrial parks (Tauragė\nPrivate Industrial Park, Sitkunai Private Industrial Park, Ramučiai Private\nLogistic and Industrial Park) were established to provide some tax incentives\nand prepared physical infrastructure.\n\nLithuanian counties by GDP per capita, 2022 County  | Area\n(km2)  | Population (2024 January)  | GDP (billion EUR), 2023  | GDP per capita (EUR), 2023  | Av. monthly wage (2025 Q1)\n---|---|---|---|---|---\nGross (€)  | Net (€)\nAlytus County | 5,425  | 134,181  | 1.9  | 14,300  | 1,934  | 1,232\nKaunas County | 8,089  | 585,430  | 14.7  | 25,200  | 2,320  | 1,427\nKlaipėda County | 5,209  | 339,831  | 7.6  | 22,500  | 2,179  | 1,356\nMarijampolė County | 4,463  | 134,663  | 2.0  | 14,800  | 1,735  | 1,118\nPanevėžys County | 7,881  | 209,093  | 3.8  | 18,200  | 1,897  | 1,213\nŠiauliai County | 8,540  | 266,803  | 4.8  | 18,000  | 1,955  | 1,242\nTauragė County | 4,411  | 90,534  | 1.3  | 14,800  | 1,975  | 1,252\nTelšiai County | 4,350  | 130,913  | 2.3  | 17,700  | 2,050  | 1,291\nUtena County | 7,201  | 126,192  | 1.8  | 14,200  | 1,910  | 1,220\nVilnius County | 9,731  | 868,251  | 33.6  | 39,100  | 2,592  | 1,578\nLithuania  | 65,300  | 2,885,891  | 73.8  | 25,700  | 2,338  | 1,436",
    "openai_summarised_points": [
      "• Lithuania is administratively divided into ten counties, with four cities having populations exceeding 100,000 and two cities with populations over 50,000.",
      "• The gross regional product (GRP) of Lithuania is predominantly concentrated in the two largest counties, Vilnius and Kaunas, which together generate two-thirds of the national GDP while comprising only 50% of the country's population.",
      "• As of the third quarter of 2023, Vilnius County was the sole county with an average salary surpassing the national average, whereas Utena County recorded the lowest average salary, approximately 20% below the national average.",
      "• To promote a balanced regional GDP distribution, Lithuania established nine public industrial parks: Akmene Industrial Park, Alytus Industrial Park, Kedainiai Industrial Park, Marijampolė Industrial Park, Pagegiai Industrial Park, Panevėžys Industrial Park, Radviliskis Industrial Park, Ramygala Industrial Park, and Šiauliai Industrial Park.",
      "• Additionally, three private industrial parks were created: Tauragė Private Industrial Park, Sitkunai Private Industrial Park, and Ramučiai Private Logistic and Industrial Park; these parks offer tax incentives and have prepared physical infrastructure to stimulate regional economic development.",
      "• In 2022 and 2023, the Lithuanian counties exhibited the following economic and demographic characteristics:",
      "• Alytus County covers an area of 5,425 km², with a population of 134,181 (January 2024), a 2023 GDP of €1.9 billion, GDP per capita of €14,300, and an average monthly wage in Q1 2025 of €1,934 gross (€1,232 net).",
      "• Kaunas County spans 8,089 km², has 585,430 inhabitants, a GDP of €14.7 billion, GDP per capita of €25,200, and an average monthly wage of €2,320 gross (€1,427 net).",
      "• Klaipėda County encompasses 5,209 km², with 339,831 residents, a GDP of €7.6 billion, GDP per capita of €22,500, and an average monthly wage of €2,179 gross (€1,356 net).",
      "• Marijampolė County covers 4,463 km², population 134,663, GDP €2.0 billion, GDP per capita €14,800, average monthly wage €1,735 gross (€1,118 net).",
      "• Panevėžys County has an area of 7,881 km², population 209,093, GDP €3.8 billion, GDP per capita €18,200, average monthly wage €1,897 gross (€1,213 net).",
      "• Šiauliai County, with 8,540 km² area and 266,803 population, recorded GDP of €4.8 billion, GDP per capita €18,000, and average monthly wage €1,955 gross (€1,242 net).",
      "• Tauragė County covers 4,411 km², population 90,534, GDP €1.3 billion, GDP per capita €14,800, average monthly wage €1,975 gross (€1,252 net).",
      "• Telšiai County spans 4,350 km², with 130,913 inhabitants, GDP €2.3 billion, GDP per capita €17,700, average monthly wage €2,050 gross (€1,291 net).",
      "• Utena County, area 7,201 km², population 126,192, GDP €1.8 billion, GDP per capita €14,200, average monthly wage €1,910 gross (€1,220 net).",
      "• Vilnius County is the largest with 9,731 km², population 868,251, GDP €33.6 billion, GDP per capita €39,100, and the highest average monthly wage of €2,592 gross (€1,578 net).",
      "• The total area of Lithuania is 65,300 km², with a national population of 2,885,891 (January 2024), a GDP of €73.8 billion in 2023, a GDP per capita of €25,700, and an average monthly wage in Q1 2025 of €2,338 gross (€1,436 net)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:28.835351",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2016,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Sectors of economy",
    "text": "In 2022, the sector with the highest number of companies registered in\nLithuania is Services with 53,386 companies followed by Unknown industry and\nWholesale Trade with 50,660 and 26,974 companies respectively.",
    "openai_summarised_points": [
      "• In 2022, the Services sector in Lithuania registered the highest number of companies, totaling 53,386 entities.",
      "• The sector categorized as Unknown industry was the second largest in terms of company registrations, with 50,660 companies.",
      "• Wholesale Trade ranked third in Lithuania for the number of registered companies in 2022, with a total of 26,974 companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:31.190559",
      "openai_model": "gpt-4.1-mini",
      "content_length": 210,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Services",
    "text": "One of the most important sub-sectors is information and communication\ntechnologies (ICT). Around 37,000 employees work for more than 2,000 ICT\ncompanies. ICT received 9.5% of total FDI. Lithuania hosts 13 of the 20\nlargest IT companies in the Baltic States. Lithuania exported EUR 128 million\nworth ICT services in II quarter of 2018.\n\nDevelopment of shared services and business process outsourcing are some of\nthe most promising fields. Companies that have outsourced their business\noperations to Lithuania include, Danske Bank, CITCO Group, Western Union,\nUber, MIRROR, PricewaterhouseCoopers, Anthill, Adform, Booking Holdings\n(Kayak.com, Booking.com), HomeToGo, Visma, Unity, Yara International, Nasdaq\nNordic, Bentley Systems, Ernst & Young and many more.",
    "openai_summarised_points": [
      "• The information and communication technologies (ICT) sub-sector is one of the most important in Lithuania's services economy, employing approximately 37,000 individuals across more than 2,000 ICT companies.",
      "• ICT attracted 9.5% of Lithuania's total foreign direct investment (FDI), highlighting its significance in the national economy.",
      "• Lithuania is home to 13 of the 20 largest IT companies operating in the Baltic States, underscoring its regional prominence in the technology sector.",
      "• In the second quarter of 2018, Lithuania exported ICT services valued at EUR 128 million, indicating substantial international demand for its ICT capabilities.",
      "• The development of shared services and business process outsourcing (BPO) represents a highly promising area within Lithuania’s service sector.",
      "• Numerous multinational companies have outsourced their business operations to Lithuania, including Danske Bank, CITCO Group, Western Union, Uber, MIRROR, PricewaterhouseCoopers, Anthill, Adform, Booking Holdings (encompassing Kayak.com and Booking.com), HomeToGo, Visma, Unity, Yara International, Nasdaq Nordic, Bentley Systems, and Ernst & Young."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:34.775241",
      "openai_model": "gpt-4.1-mini",
      "content_length": 762,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.1.1",
    "section_name": "Financial services",
    "text": "Lending and saving data\n\nThe financial sector concentrates mostly on the domestic market. There are\nthirteen commercial banks that hold a license from the Bank of Lithuania and\neight foreign bank branches. Most of the banks belong to international\ncorporations, mainly Scandinavian. The financial sector has demonstrated\nincredible growth in the pre-crisis period (1998–2008). Bank assets were only\n€3.2 billion or 25.5% from GDP in 2000, half of which consisted of loan\nportfolio.\n\nBy the beginning of the year 2009, bank assets grew to €26.0 billion or 80.8%\nto GDP, the loan portfolio reached €20.7 billion. The loan-to-GDP ratio was\n64%. The growth of deposits was not as fast as that of loans. At the end of\n2008, the loan portfolio was almost twice as big as that of deposits. It\ndemonstrated high dependence on external financing. Contraction in the loan\nportfolio has been recorded over the past year, so the loans to deposits ratio\nare slowly getting back to healthy levels.\n\nMoody's Corporation declared about opening its office in Vilnius.",
    "openai_summarised_points": [
      "• The financial sector in Lithuania primarily focuses on the domestic market, with thirteen commercial banks licensed by the Bank of Lithuania and eight foreign bank branches operating within the country.",
      "• The majority of these banks are subsidiaries of international corporations, predominantly from Scandinavian countries.",
      "• Between 1998 and 2008, the Lithuanian financial sector experienced remarkable growth during the pre-crisis period.",
      "• In the year 2000, total bank assets amounted to €3.2 billion, representing 25.5% of Lithuania’s GDP, with approximately half of these assets composed of the loan portfolio.",
      "• By early 2009, bank assets had expanded significantly to €26.0 billion, equating to 80.8% of GDP, while the loan portfolio reached €20.7 billion.",
      "• The loan-to-GDP ratio increased to 64% by 2009, indicating substantial credit growth relative to the economy.",
      "• Deposit growth lagged behind loan growth, and by the end of 2008, the loan portfolio was nearly double the size of total deposits, reflecting a high dependency on external financing sources.",
      "• Over the subsequent year, a contraction in the loan portfolio was observed, leading to a gradual normalization of the loans-to-deposits ratio toward healthier levels.",
      "• Moody’s Corporation announced plans to open an office in Vilnius, signaling increased international financial services presence in Lithuania."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:42.760723",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1050,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.1.1.1",
    "section_name": "Fintech",
    "text": "The country has increasingly sought to position itself as the EU's main\nfintech hub, hoping to attract international firms by promising to provide\nEuropean operational licences within three months, compared to a waiting\nperiod of up to a year in countries like Germany or the UK. In 2017 only, 35\nfintech companies came to Lithuania – a result of Lithuanian government and\nBank of Lithuania simplified procedures for obtaining licences for the\nactivities of e-money and payment institutions. Europe's first international\nBlockchain Centre launched in Vilnius in 2018. Since 2021, Lithuania has\nissued hundreds of licenses for cryptocurrency exchange and storage services,\nmaking it one of the leading countries in the EU for such permits. The\ngovernment of Lithuania also aims to attract financial institutions looking\nfor a new location after Brexit. Lithuania has granted a total of 39 e-money\nlicenses, second in the EU only to the UK with 128 licenses. In 2018, Google\nset up a payment company in Lithuania, Vilnius was ranked a seventh fintech\ncity by foreign direct investment (FDI) performance in 2019.\n\nBank of Lithuania, the Central Bank of Lithuania established a Regulatory\nsandbox to test financial innovations in a live environment under the guidance\nand supervision of the Bank of Lithuania. Bank of Lithuania has also developed\nLBChain which is the world's first blockchain-based sandbox developed by a\nfinancial market regulator, combining technological and regulatory\ninfrastructures.",
    "openai_summarised_points": [
      "• Lithuania has strategically positioned itself as the European Union's primary fintech hub, aiming to attract international fintech firms by offering European operational licenses within a three-month timeframe, significantly faster than the up to one-year waiting periods in countries such as Germany and the United Kingdom.",
      "• In 2017 alone, Lithuania attracted 35 fintech companies, a direct outcome of the Lithuanian government's and Bank of Lithuania's streamlined procedures for obtaining licenses related to e-money and payment institution activities.",
      "• In 2018, Vilnius became home to Europe's first international Blockchain Centre, marking a significant milestone in Lithuania's fintech development.",
      "• Since 2021, Lithuania has issued hundreds of licenses for cryptocurrency exchange and storage services, positioning the country as one of the leading EU nations in granting such permits.",
      "• The Lithuanian government actively seeks to attract financial institutions relocating due to Brexit, offering a favorable regulatory environment.",
      "• Lithuania has granted a total of 39 e-money licenses, ranking second in the European Union only to the United Kingdom, which holds 128 such licenses.",
      "• In 2018, Google established a payment company in Lithuania, highlighting the country's growing importance in the fintech sector.",
      "• Vilnius was ranked as the seventh leading fintech city in Europe by foreign direct investment (FDI) performance in 2019.",
      "• The Bank of Lithuania, serving as the Central Bank of Lithuania, established a Regulatory Sandbox to enable the testing of financial innovations in a live environment under its guidance and supervision.",
      "• The Bank of Lithuania developed LBChain, the world's first blockchain-based sandbox created by a financial market regulator, which integrates both technological and regulatory infrastructures to foster fintech innovation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:13:48.188644",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1501,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Manufacturing",
    "text": "Linpra \\- the largest association for engineering and manufacturing companies\nin The Baltic States\n\nLithuania has a much larger manufacturing sector share in the economy's\nstructure than the other Baltic countries. In this regard, Lithuania is closer\nto some Central European countries like the Czech Republic or Germany.\n\nManufacturing constitutes the biggest part of gross value added in Lithuania.\nThe food processing sector constitutes 11% of total exports. Dairy products,\nespecially cheese, are well known in neighbouring countries. Another important\nmanufacturing activity is chemical products. The manufacturing of machinery\nand equipment sector in Lithuania comprises 7.1% of the country's GDP. 80% of\nproduction is exported so chemical products constitute 12.5% of total exports.\nYear 2019 was exemplary – more than 10 new factories were opened in Lithuania,\nworking in the fields in engineering, high precision instruments, furniture\nand medical products.\n\nFurniture\n\nFurniture production employs more than 50,000 people and has seen double-digit\ngrowth over the last three years. The biggest companies in this field work in\ncooperation with IKEA, which owns one of the biggest wood processing companies\nin Lithuania. Lithuania is the fourth biggest supplier of furniture for IKEA\nafter Poland, Italy and Germany.\n\nAutomotive industry\n\nContinental AG in 2018 started to build a factory for high precision car\nelectronics – the biggest greenfield investment project in Lithuania so far.\nAnother German manufacturer of lighting technology Hella opened a plant in\n2018 in Kaunas FEZ, which will produce sensors, actuators and control modules\nfor the automotive industry. Lithuania's automotive cluster experienced\nsignificant growth during the past 5 years.\n\nCompanies in the automotive and engineering sector are relatively small but\noffer flexible services for small and non-standard orders at competitive\nprices. The sector employs about 3% of the working population and receives\n5.6% of FDI. Vilnius Gediminas Technical University prepares experts for the\nsector.\n\nBiotechnology and life sciences\n\nLithuania's life science sector is growing around 20–25% annually; with\nspecial focus on the production and research of biotechnology, pharmaceutical\nand medical devices.\n\nLaser technology\n\nLithuanian laser companies were among the first ones in the world to transfer\nfundamental research into manufacturing. Lithuania's laser producers export\nlaser technologies and devices to nearly 100 countries. Half of all picosecond\nlasers sold worldwide are produced by Lithuanian companies, while Lithuanian-\nmade femtosecond parametric light amplifiers, used in generating the\nultrashort laser pulses, account for as much as 80% of the world market.",
    "openai_summarised_points": [
      "• Linpra is recognized as the largest association for engineering and manufacturing companies in the Baltic States, representing a significant organizational body within the sector.",
      "• Lithuania's manufacturing sector holds a substantially larger share in the national economy's structure compared to the other Baltic countries, aligning it more closely with Central European nations such as the Czech Republic and Germany.",
      "• Manufacturing represents the largest component of Lithuania's gross value added, underscoring its critical role in the country's economic output.",
      "• The food processing sector accounts for 11% of Lithuania's total exports, with dairy products, particularly cheese, being well-known and highly regarded in neighboring countries.",
      "• The chemical products manufacturing sector is another vital area, with machinery and equipment manufacturing contributing 7.1% to Lithuania's GDP; notably, 80% of chemical production is exported, making chemical products constitute 12.5% of total exports.",
      "• The year 2019 was notable for Lithuania's manufacturing sector, with the opening of more than 10 new factories specializing in engineering, high precision instruments, furniture, and medical products, indicating robust industrial growth.",
      "• The furniture manufacturing industry employs over 50,000 people in Lithuania and has experienced double-digit growth over the preceding three years, highlighting its expanding economic significance.",
      "• Major furniture companies in Lithuania collaborate closely with IKEA, which owns one of the largest wood processing companies in the country; Lithuania ranks as the fourth largest supplier of furniture to IKEA, following Poland, Italy, and Germany.",
      "• In the automotive industry, Continental AG initiated construction of a factory for high precision car electronics in 2018, marking the largest greenfield investment project in Lithuania to date.",
      "• Also in 2018, German lighting technology manufacturer Hella opened a plant in the Kaunas Free Economic Zone (FEZ) to produce sensors, actuators, and control modules for the automotive sector, contributing to industrial diversification.",
      "• Lithuania's automotive cluster has experienced significant growth over the past five years, reflecting increasing industrial capacity and specialization.",
      "• Companies within the automotive and engineering sectors tend to be relatively small but provide flexible services tailored to small and non-standard orders at competitive prices, enhancing Lithuania's niche market competitiveness.",
      "• The automotive and engineering sectors employ approximately 3% of Lithuania’s working population and attract 5.6% of the country’s foreign direct investment (FDI), indicating their importance in employment and investment.",
      "• Vilnius Gediminas Technical University plays a key role in preparing specialists for the automotive and engineering sectors, supporting workforce development and industry expertise.",
      "• Lithuania’s biotechnology and life sciences sector is expanding rapidly, with annual growth rates of approximately 20–25%, focusing particularly on biotechnology production and research, pharmaceuticals, and medical devices.",
      "• Lithuanian laser technology companies were pioneers in transforming fundamental research into commercial manufacturing, establishing a strong global presence.",
      "• Lithuanian laser producers export their technologies and devices to nearly 100 countries worldwide, demonstrating extensive international reach.",
      "• Lithuanian companies manufacture half of all picosecond lasers sold globally, indicating a dominant position in this advanced laser technology market.",
      "• Additionally, Lithuanian-made femtosecond parametric light amplifiers, which are essential for generating ultrashort laser pulses, account for approximately 80% of the global market share, underscoring Lithuania's leadership in this specialized field."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:14:01.809503",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2752,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Tourism",
    "text": "Tourism in Lithuania is becoming increasingly important for the local economy,\nconstituting around 5.3% of GDP in 2016. Lithuania has 22,000 rivers and\nrivulets, 3,000 lakes, a well-developed rural tourism network, a unique\ncoastal area of almost 100 km and four UNESCO World Heritage Sites. Lithuania\nreceives more than 1.4 million foreign tourists a year. Germany, Poland,\nRussia, Latvia, and Belarus supply the most tourists, and a significant number\narrive from the UK, the USA, Finland, and Italy as well."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Agriculture",
    "text": "Despite a decreased share in GDP, the agricultural sector is still important\nfor Lithuania as it employs almost 8% of the work force and supplies materials\nfor the food processing sector. In 2023 it, together with food produsts,\ncombined for 19.6% of all Lithuanian exports. 44.8% of the land is arable and\nthe total agricultural area was 2.9 million hectares, of which 2.3 million ha\nwere arable, in 2023. Three connecting municipalities - Panevėžys district,\nKupiškis and Raseiniai have the largest areas in the country. Cereals, wheat,\nand triticale are the most popular production of farms. The number of\nlivestock and poultry has decreased twofold compared to the 1990s. The number\nof cattle in Lithuania at the beginning of the year 2009 was 770,000, the\nnumber of dairy cows was 395,000, and the number of poultry was 9.1 million.\n\nLithuanian food consumption has evolved; between 1992 and 2008, consumption of\nvegetables increased by 30% to 86 kg per capita, and consumption of meat and\nits products increased by 23% during the same period to 81 kg per capita. On\nthe other hand, consumption of milk and dairy products has decreased to 268 kg\nper capita by 21%, and the consumption of bread and grain products decreased\nto 114 kg per capita by 19% as well.\n\nLithuania produced in 2018:\n\n* 2.8 million tons of wheat;\n* 888 thousand tons of sugar beet (the beet is used to manufacture sugar and ethanol);\n* 619 thousand tons of barley;\n* 433 thousand tons of rapeseed;\n* 296 thousand tons of potato;\n* 213 thousand tons of pea;\n* 182 thousand tons of oat;\n* 153 thousand tons of triticale;\n* 149 thousand tons of bean;\n\nIn addition to smaller productions of other agricultural products, like apple\n(92 thousand tons), maize (87 thousand tons)and rye (44 thousand tons)."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Corporations",
    "text": "Lithuania traditionally has strong agricultural, furniture, logistics,\nmeatpacking & poultry, biotechnology and laser industries. Maxima is a retail\nchain operating in Lithuania, Latvia, Estonia, Poland and Bulgaria and it is\nthe largest Lithuanian capital company and the largest employer in the Baltic\nstates. Girteka Logistics is Europe's largest transport company. Biotechpharma\n[lt] is a biopharmaceutical research and development company with a focus on\nrecombinant protein technology development. The BIOK Laboratory is a startup\nfounded by biochemistry scientists which is the biggest producer of Lithuanian\nnatural cosmetic products. UAB SANITEX is the largest wholesale, distribution\nand logistics company in Lithuania and Latvia, also active in Estonia and\nPoland. SoliTek – the largest photovoltaic module and energy storage battery\nmanufacturer in Northern Europe. One of the leaders of cellular IoT gateways\nproducers in Europe – UAB Teltonika.\n\nIn the \"Baltic Top 50\", the biggest Baltic states companies rating created by\nCoface, more than half – 27 – companies are from Lithuania. Together they\naccount for 69.1% combined turnover, 67.1% net profit, and 76.2% employees of\nall the listed companies."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Largest companies",
    "text": "The total revenue of the 1000 largest companies in Lithuania reached 77.9\nbillion euros in 2023, and seen a 2.6% year-to-year contraction. There were\nthe largest companies of Lithuania in 2023 financial year, by revenue:\n\nRank\n| Name | Headquarters | Revenue\n(bil. €) | Employees | Industry\n\n---|---|---|---|---|---\n01\\.  | Orlen Lietuva, AB | Mažeikiai | 6.427  | 1,545 | Oil, petrol\n02\\.  | Maxima LT, UAB | Vilnius | 2.143  | 11,704 | Retail\n03\\.  | Ignitis, UAB | Vilnius | 1.381  | 404 | Electric power industry\n04\\.  | Linas Agro [de; lt], AB | Panevėžys | 1.177  | 216 | Agribusiness\n06\\.  | Viada LT, UAB | Vilnius | 0.897  | 1,197 | Petrol stations\n05\\.  | Circle K Lietuva, UAB | Vilnius | 0.894  | 1.025\n07\\.  | Iki Lietuva, UAB | Vilnius | 0.887  | 5,650 | Retail\n09\\.  | Lidl Lietuva, UAB | Vilnius | 0.871  | 3,071\n08\\.  | Thermo Fisher Scientific Baltics, UAB | Vilnius | 0.821  | 1,556 | Biotechnology, pharmaceutical\n010\\.  | Sanitex [lt; de], UAB | Kaunas | 0.806  | 1,260 | Wholesale, logistics\n\n1. **^** In the VŽ list"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Most valuable companies",
    "text": "Largest Lithuanian companies by valuation (EUR € billions) according to 15min\n(2024).\n\nRank | Name | Headquarters | Valuation\n(bil. €) | Industry\n---|---|---|---|---\n01  | Maxima Group, UAB | Vilnius | 2.865  | Retail\n02  | Thermo Fisher Scientific Baltics, UAB | Vilnius | 2.404  | Life sciences\n03  | Avia Solutions Group, PLC | Vilnius | 2.394  | Aviation\n04  | Orlen Lietuva, AB | Mažeikiai | 2.196  | Oil, petrol\n05  | Luminor Bank, AS Lietuvos skyrius | Vilnius | 1.583  | Banking\n06  | Swedbank, AB | Vilnius | 1.441\n07  | Ignitis grupė, AB | Vilnius | 1.354  | Electric power\n08  | Baltic Classifieds Group, PLC | Vilnius | 1.284  | Web portal\n09  | SEB bankas, AB | Vilnius | 1.217  | Banking\n10  | Girteka Group, UAB | Vilnius | 1.097  | Logistics\n11  | Telia Lietuva, AB | Vilnius | 0.926  | Telecommunications\n12  | Tele2, UAB | Vilnius | 0.809\n13  | Lithuanian Railways, AB | Vilnius | 0.706  | Rail transport\n14  | Bitė Lietuva, UAB | Vilnius | 0.672  | Telecommunications"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Workforce",
    "text": "Population with higher education, 2001–2008 Salaries and unemployment,\n2001–2009\n\nThe number of the population aged 15 years and over is 1.45 million, activity\nrate was 60 percent in 2017.\n\nDuring the period of 1995–2017 average salary grew more than four times in\nLithuania. Despite this, labour costs in Lithuania are among the lowest in the\nEU. Average monthly net salary in IV quarter 2018 was EUR 800 and increased by\n9.5 percent. Unemployment in Lithuania has been volatile. Since the year 2001,\nthe unemployment rate has decreased from almost 20% to less than 4% in 2007\nthanks to two main reasons. Firstly, during the time of rapid economic\nexpansion, numerous work places were established. This caused a decrease in\nthe unemployment rate and a rise in staff expenses. Secondly, emigration has\nalso reduced unemployment problems since accession to the EU. However, the\neconomic crisis of year 2008 has lowered the need for workers, so the\nunemployment rate increased to 13.8% and then stabilized in the third quarter\nof 2009. Unemployment rate in I quarter of 2018 was 6.3 percent.\n\nLithuania is among the top 5 countries in the world by postsecondary\n(tertiary) education attainment.As of 2016[update], 54.9% of the population\naged 25 to 34, and 30.7% of the population aged 55 to 64 had completed\ntertiary education. The share of tertiary-educated 25–64-year-olds in STEM\n(Science, technology, engineering, and mathematics) fields in Lithuania were\nabove the OECD average (29% and 26% respectively), similarly to business,\nadministration and law (25% and 23% respectively).\n\nThe level of labour productivity in Lithuania today is about one-third below\nthe OECD average. Lithuania is ranked 15th in Employment Flexibility Index."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Largest employers by municipality",
    "text": "The following companies provided the most jobs (at least 1000 laborers) within\nthe specific municipalities in 2024. Employment agencies are excluded from the\nlist.\n\nMunicipality  | Company  | Industry  | No. Employees  | Perc. of workforce\n---|---|---|---|---\nVilnius | Maxima LT | Retail | 4,576  | 040%\nŠvenčionys | Intersurgical [de] | Health technology | 2,191  | 100%\nPanevėžys | PKC Group Lithuania [fi] | Automotive electronics | 2,094  |\nKlaipėda (district) | Vlantana [de] | Logistics | 1,909  | 079%\nKaunas (district) | Hoptransa  | Logistics  | 1,670  | 094%\nKaunas | Maxima LT  | Retail  | 1,634  | 014%\nMarijampolė | Mantinga  | Bakery | 1,603  | 100%\nVisaginas | Ignalina Nuclear Power Plant | Radioactive waste management | 1,599  | 100%\nMažeikiai | Orlen Lietuva | Oil, petrol | 1,467  | 100%\nVilnius (district) | Vilniaus paukštynas | Poultry farming | 1,296  | 100%\nŠiauliai | Trasis  | Logistics  | 1,239  | 078%\nTelšiai | Žemaitijos pienas | Dairy products | 1,239  | 100%\nUtena | Biovela-Utenos mėsa [lt] | Meat-packing | 1,196  | 100%\nJonava | Achema | Fertilizers | 1,157  | 100%\nKėdainiai | Krekenavos agrofirma  | Meat-packing  | 1,084  | 100%"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Income and wealth distribution",
    "text": "Lithuania belongs to high income group according to Credit Suisse Global\nWealth Report 2019. As of 2019, Lithuanian average wealth per adult was\n$50,254 (an increase of 82% from $27,507 in the year 2017) Household debt is\namong the lowest among EU countries – 49 percent of net disposable income in\n2015."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Municipalities by median home value",
    "text": "Lithuanian municipalities by median home value (government estimate), 2021 Neringa Municipality has highest home prices in Lithuania surpassing capital city by almost two times Didžiasalis, Ignalina District. In 1989 it had population of 2,600 while in 2021 it was only around 1,000. | Municipality  | Median home value (government estimate), Eur\n---|---\nNeringa | 111,000\nVilnius | 060,100\nKlaipėda | 047,400\nPalanga | 044,100\nKaunas (district) | 043,900\nKaunas | 040,700\nKlaipėda (district) | 039,800\nŠiauliai | 036,400\nVilnius (district) | 035,100\nDruskininkai | 030,200\nPanevėžys | 029,200\nBirštonas | 025,500\nTrakai | 025,100\nKretinga | 024,000\nTauragė | 023,500\nMarijampolė | 023,300\nAlytus | 020,800\nElektrėnai | 020,600\nUtena | 017,300\nJonava | 017,000\nMažeikiai | 015,000\nPlungė | 013,700\nTelšiai | 013,700\nŠiauliai (district) | 013,100\nRaseiniai | 012,600\nJurbarkas | 012,500\nŠilutė | 011,900\nŠirvintos | 011,800\nUkmergė | 011,100\nVilkaviškis | 010,700\n|  | Municipality  | Median home value (government estimate), Eur\n---|---\nKazlų Rūda | 10,300\nVisaginas | 10,000\nŠakiai | 09,900\nKėdainiai | 09,600\nKalvarija | 08,800\nKaišiadorys | 08,200\nRadviliškis | 07,900\nRietavas | 07,800\nJoniškis | 07,800\nŠilalė | 07,600\nSkuodas | 07,400\nŠvenčionys | 07,300\nPanevėžys (district) | 06,800\nŠalčininkai | 06,400\nLazdijai | 06,400\nPrienai | 06,300\nBiržai | 06,200\nAlytus (district) | 06,200\nMolėtai | 06,200\nPagėgiai | 06,000\nAkmenė | 05,700\nKelmė | 05,700\nPakruojis | 05,600\nRokiškis | 05,300\nVarėna | 05,100\nKupiškis | 05,000\nAnykščiai | 04,800\nPasvalys | 04,700\nZarasai | 04,200\nIgnalina | 03,700"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Infrastructure",
    "text": "The transport, storage, and communication sector has increased its importance\nto the economy of Lithuania. In 2008, it accounted for 12.1% of GDP compared\nto 9.1% in 1996."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Communications",
    "text": "Lithuania has a broadly developed radio, television, landline and mobile\nphone, as well as broadband internet networks.\n\nLithuanian National Radio and Television, the public broadcaster in Lithuania\noperates 3 television channels, including a satellite channel, as well as 3\nradio stations. Privately owned commercial TV and Radio broadcasters operate a\nmultitude national, regional and local channels.\n\nThere are four TIER III datacenters in Lithuania. Lithuania is 44th globally\nranked country on data center density according to Cloudscene.\n\nThe fixed landline network connects 625 thousand households and businesses\n(down from the record 845 thousand in 2005). The decline in subscription and\nutilization of the landline network has been driven by increased availability\nof mobile phone services. The mobile telephony penetration rate in Lithuania\n(of 151 per 100 population in 2013) has been one of the highest in the world.\nIn 2013, there were 13 providers of mobile phone services, with the three\nlargest ones – BITĖ Lietuva, Omnitel, and Tele2 – operating their own cellular\nnetworks.\n\nLithuanian retail internet sector is competitive, with more than 100 service\nproviders. Retail internet connectivity in Lithuania was among the cheapest in\nEurope; however, the internet penetration rate (64% of households using\ninternet in 2013) was lower than in other EU countries in the region – Estonia\n(79%), Latvia (70%) and Poland (69%). Lithuanian internet connection speeds\nhave been claimed to be among the fastest in the world based on user-initiated\ntests at Speedtest.net."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "7.2",
    "section_name": "Energy",
    "text": "Heating energy data\n\nThe utilities sector accounts for more than 3% of gross value added in\nLithuania. Electricity production exceeded 12 billion kWh in 2007, and\nconsumption exceeded 9.6 billion kWh. Surplus electricity is exported.\n\nLithuania operated a nuclear power plant in Visaginas, which produced 72% of\nelectricity in Lithuania. The plant was shut down on 31 December 2009 in line\nwith the commitments made when Lithuania joined EU in 2004. A new nuclear\npower plant in Visaginas has been proposed but the status of the project is\nuncertain after it was rejected by the voters in a referendum in 2012.\n\nThe supply of heating energy was modernized during the decade (1998–2008).\nTechnological loss in the heat energy system has decreased significantly from\n26.2% in the year 2000 to 16.7% in 2008. The amount of air pollution was\nreduced by one-third. The share of renewable energy resources in the total\nfuel balance for heat production increased to almost 20%.\n\nIn order to break down Gazprom's monopoly in the natural gas market of\nLithuania, the first large scale LNG import terminal (Klaipėda LNG FSRU) in\nthe Baltic region was built in the port of Klaipėda in 2014. The Klaipėda LNG\nterminal was called _Independence_ , thus emphasising the aim to diversify the\nenergy market of Lithuania. Norvegian company Equinor supplies 540 million\ncubic metres (19 billion cubic feet) of natural gas annually from 2015 until\n2020. The terminal is able to cover 100% of Lithuania's demand and 90% of\nLatvia's and Estonia's national demand in the future.\n\nKruonis Pumped Storage Plant operates as pumped-storage providing a spinning\nreserve of the power system, in order to regulate the load curve of the power\nsystem 24 hours a day. In 2015 Kruonis Industrial Park was established as a\nplace for data centers.\n\nIn 2018 synchronising the Baltic States' electricity grid with the Synchronous\ngrid of Continental Europe has started."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "7.3",
    "section_name": "Transport",
    "text": "Volume of goods transported, million tonne-kilometers Funding of roads\n\nLithuania forms part of the transport corridor between the East and the West.\nThe volume of goods transported by road transport has increased fivefold since\n1996. The total length of roadways is more than 80,000 km, and 90% of them are\npaved. The government spending on road infrastructure exceeded €0.5 billion in\n2008. Via Baltica highway passes through Kaunas, while membership in the\nSchengen Agreement allows for smooth border crossing to Poland and Latvia.\n\nRail transport in Lithuania provides long-distance passenger and cargo\nservices. Railways carry approximately 50 million tons of cargo and 7 million\npassengers a year. Direct rail routes link Lithuania with Russia, Belarus,\nLatvia, Poland, and Germany. Also, the main transit route between Russia and\nRussia's Kaliningrad Region passes through Lithuania. _Lithuanian Railways_ AB\ntransports about 44% of the freight carried through Lithuania. This is a very\nhigh indicator compared to other EU countries, where freight transportation by\nrail amounts to only 10% of the total.\n\nAn ice-free seaport of Klaipeda is located in the western part of Lithuania.\nThe port is an important regional transport hub connecting the sea, land and\nrailway routes from east and west. It handles roughly 7,000 ships and 30\nmillion tons of cargo every year, and accepts large-tonnage vessels (dry-cargo\nvessels up to 70,000 DWT, tankers up to 100,000 DWT and cruise ships up to 270\nmeters long). The seaport of Klaipėda is able to receive _Panamax_ -type\nvessels. One of the fastest growing segments of sea transport is passenger\ntraffic, which has increased fourfold since 2002. The inland river cargo port\nin Marvelė, linking Kaunas and Klaipėda, received first cargo in 2019.\n\nLithuania has four international airports – Vilnius Airport (VNO), Kaunas\nAirport (KUN), Šiauliai Airport (SQQ) and Palanga Airport (PLQ). More than 30\ndomestic airports being used by aeroclubs and amateur pilots."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "7.4",
    "section_name": "Storage",
    "text": "There are more than 600,000 m2 of modern logistics and warehousing facilities\nin Lithuania. The biggest supply of new, modern warehousing facilities is in\nthe capital city Vilnius (after the completion of several new projects in the\nthird quarter of 2009, the supply of modern warehousing premises has increased\nby nearly 12% in Vilnius and currently reaches 334,400 m2 of the rentable\narea). Kaunas is in the second place (around 200,000 m2), and Klaipėda in the\nthird (122,500 m2). Since the beginning of the year 2009, prices for\nwarehousing premises have dropped by 20–25% in Vilnius, Kaunas, and Klaipėda,\nand the current level of rents has reached the level of 2003. The costs for\nrenting new warehouses in Vilnius, Kaunas, and Klaipėda are similar and reach\n0.75 to 1.42 EUR/m2, while the rents of old warehouses are 0.35 to 0.67\nEUR/m2."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "International trade",
    "text": "Lithuanian economy is highly open and International trade is crucial. As a\nresult, the ratio of foreign trade to GDP for Lithuania has often exceeded\n100%.\n\nThe EU is the biggest trade partner of Lithuania with a 67% of total imports\nand 61.3% of total exports during 2015. The Commonwealth of Independent States\nis the second economic union that Lithuania trades the most with, with a share\nof imports of 25% and a share of exports of 23.9% during the same period. The\nvast majority of commodities, including oil, gas, and metals have to be\nimported, mainly from Russia, however in the recent years Lithuania's energy\ndependence has shifted towards other countries such as Norway and the US.\nMineral products constitute 25% of imports and 18% of exports, mainly driven\nby the presence of _ORLEN Lietuva_ oil refinery with a refining capacity of 9\nmillion tons a year, owned by Polish concern PKN Orlen. _Orlen Lietuva_ sold\nover €3.5 billion worth of products outside Lithuania, compared to the total\nLithuanian exports of €24 billion in 2014.\n\nSome sectors are directed mainly at export markets. Transport and logistics\nexport two-thirds of their products and/or services; the biotechnology\nindustry exports 80%; plastics export 52%; laser technologies export 86%;\nmetal processing, machinery and electric equipment export 64%; furniture and\nwood processing export 55%; textile and clothing export 76%; and the food\nindustry exports 36%.\n\n**Foreign trade partners, January–December 2022**\n(structure of the statistics is highly affected by oil refinery _ORLEN Lietuva_ importing and exporting big amounts of oil products)  Rank  | Country  | Combined\nshare  | Country  | Import  | Country  | Export  | Share of goods\nof Lithuanian origin\nin export\n---|---|---|---|---|---|---|---\n–  |  EU  | 62.7951%  |  EU  | 63.27%  |  EU  | 62.23%  | 65.72%\n1  |  Poland  | 10.46%  |  Poland  | 11.67%  |  Latvia  | 12.86%  | 41.86%\n2  |  Latvia  | 10.16%  |  Germany  | 11.62%  |  Poland  | 9.04%  | 61.42%\n3  |  Germany  | 9.93%  |  Latvia  | 7.87%  |  Germany  | 7.93%  | 75.47%\n4  |  United States  | 6.52%  |  United States  | 7.56%  |  Russia  | 6.16%  | 7.38%\n5  |  Russia  | 5.50%  |  Sweden  | 5.26%  |  Estonia  | 5.72%  | 52.23%\n6  |  Netherlands  | 4.93%  |  Russia  | 4.93%  |  Netherlands  | 5.44%  | 84.46%\n7  |  Sweden  | 4.73%  |  Norway  | 4.84%  |  United States  | 5.28%  | 91.10%\n8  |  Estonia  | 4.39%  |  Netherlands  | 4.50%  |  Sweden  | 4.11%  | 87.66%\n9  |  Norway  | 3.74%  |  Saudi Arabia  | 4.15%  |  United Kingdom  | 3.48%  | 86.66%\n10  |  United Kingdom  | 3.08%  |  China  | 3.78%  |  Belarus  | 3.27%  | 5.39%\n11  |  Italy  | 2.94%  |  Italy  | 3.66%  |  Ukraine  | 2.58%  | 70.47%\n12  |  France  | 2.45%  |  Estonia  | 3.26%  |  Norway  | 2.44%  | 84.71%\n13  |  Saudi Arabia  | 2.42%  |  United Kingdom  | 2.73%  |  France  | 2.29%  | 73.77%\n14  |  Belarus  | 2.29%  |  France  | 2.58%  |  Denmark  | 2.27%  | 84.41%\n15  |  China  | 2.15%  |  Finland  | 2.42%  |  Italy  | 2.08%  | 79.83%\n16  |  Finland  | 2.13%  |  Belgium  | 2.04%  |  Kazakhstan  | 1.96%  | 8.34%\n17  |  Belgium  | 1.80%  |  Czechia  | 1.83%  |  Finland  | 1.79%  | 71.15%\n18  |  Denmark  | 1.70%  |  Belarus  | 1.46%  |  Belgium  | 1.51%  | 80.10%\n19  |  Ukraine  | 1.69%  |  Spain  | 1.34%  |  Spain  | 1.44%  | 81.84%\n20  |  Czechia  | 1.52%  |  Denmark  | 1.23%  |  Turkey  | 1.42%  | 63.63%"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Foreign corporate taxpayers",
    "text": "**Monthly average number of foreign corporate taxpayers, June–December 2024** Country  | Corporates  | Share\n---|---|---\nGermany  | 15,308  |  28.8%\nPoland  | 05,108  |  9.6%\nItaly  | 03,800  |  7.2%\nNetherlands  | 03,735  |  7.0%\nUnited Kingdom  | 03,255  |  6.1%\nFrance  | 02,688  |  5.1%\nSpain  | 02,292  |  4.3%\nAustria  | 01,614  |  3.0%\nEstonia  | 01,457  |  2.7%\nLatvia  | 01,448  |  2.7%\nSweden  | 01,427  |  2.7%\nUnited States  | 01,132  |  2.1%\nCzechia  | 01,128  | 002.1%\nBelgium  | 00957  | 001.8%\nDenmark  | 00921  | 001.7%\nTotal  | 53,218  | 100%"
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Natural resources",
    "text": "The total value of natural resources in Lithuania is around €17 billion, or\naround one third of Lithuania's GDP. The most valuable natural resource in the\ncountry is subterranean water, which constitutes more than half of the total\nvalue of natural resources.\n\nIn 1990 Lithuania started petroleum production from onshore oil wells as a\nresponse to the Soviet economic blockade. Since 2001 the yearly production\ndeclined as Lithuanian government no longer supports development of new oil\nwells and banned any development of offshore oil rigs."
  },
  {
    "chapter_name": "Economy of Lithuania",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Macro-economic",
    "text": "The following table shows the main economic indicators in 2000–2020.\n\nYear  | GDP (in bil. US$ PPP) | GDP per capita (in US$ PPP) | GDP (in bil. US$ nominal) | GDP growth\n(real) | Inflation\n(in percent) | Unemployment rate\n(in percent) | Government debt\n(percentage of GDP)\n---|---|---|---|---|---|---|---\n2000  | 33.7  | 9,618  | 11.5  | 3.8%  | 1.0%  | 16.4%  | 23%\n2005  | 54.6  | 16,422  | 26.1  | 7.7%  | 2.7%  | 8.3%  | 18%\n2006  | 60.4  | 18,472  | 30.2  | 7.4%  | 3.8%  | 5.8%  | 17%\n2007  | 68.9  | 21,319  | 39.8  | 11.1%  | 5.8%  | 4.2%  | 16%\n2008  | 72.1  | 22,539  | 48.0  | 2.6%  | 11.2%  | 5.8%  | 15%\n2009  | 61.9  | 19,562  | 37.5  | −14.8%  | 4.2%  | 13.8%  | 29%\n2010  | 63.7  | 20,552  | 37.2  | 1.6%  | 1.2%  | 17.8%  | 36%\n2011  | 68.9  | 22,752  | 43.6  | 6.0%  | 4.1%  | 15.4%  | 37%\n2012  | 72.9  | 24,382  | 43.0  | 3.8%  | 3.2%  | 13.4%  | 40%\n2013  | 76.7  | 25,904  | 46.5  | 3.5%  | 1.2%  | 11.8%  | 39%\n2014  | 80.8  | 27,537  | 48.6  | 3.5%  | 0.2%  | 10.7%  | 41%\n2015  | 83.3  | 28,671  | 41.4  | 2.0%  | −0.7%  | 9.1%  | 43%\n2016  | 86.3  | 30,097  | 43.0  | 2.3%  | 0.7%  | 7.9%  | 40%\n2017  | 91.2  | 32,298  | 47.7  | 3.8%  | 3.7%  | 7.1%  | 39%\n2018  | 101.1  | 36,239  | 53.8  | 3.6%  | 2.5%  | 6.1%  | 34%\n2019  | 107.4  | 38,587  | 54.8  | 3.9%  | 2.2%  | 6.3%  | 38%\n2020  | 106.9  | 38,605  | 56.9  | −1.8%  | 1.2%  | 8.2%  | 48%"
  }
]