[
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Cuba is a planned economy dominated by state-run enterprises.\nThe Communist Party of Cuba maintains high levels of public sector control and\nexerts significant influence over the Cuban economy. The island has a low cost\nof living, inexpensive public transport, as well as subsidized education,\nhealthcare, and food. Cuba's economic growth has historically been weak due to\nhigh labour emigration, import dependency, an ongoing energy crisis, foreign\ntrade sanctions, and limited tourism in Cuba. The dual economy of Cuba has led\nto a series of financial crises. Since 2020, Cuba has been in an economic\nrecession, with high inflation, collective poverty, and food shortages.\n\nIn the 19th century, Cuba was one of the most prosperous pre-industrial Latin\nAmerican countries with the export of tobacco, sugar, and coffee. At the Cuban\nRevolution of 1953–1959, during the military dictatorship of Fulgencio\nBatista, Cuba's GDP per capita ranked seventh within Latin America. During the\nCold War, the Cuban economy was heavily subsidized – 10% to 40% of Cuban GDP\nin various years – by the Eastern Bloc, due to their geopolitical alignment\nwith the Soviet Union. Cuba endured severe economic downturn when the Soviet\nUnion collapsed, with GDP declining 33% between 1990 and 1993. A protracted\neconomic malaise known as the Special Period overcame Cuba from 1991 to 2001.\nThe Cuban economy rebounded with marginal liberalization and foreign support\nfrom Venezuela. The United States has maintained an economic embargo against\nCuba since 1958 due to geopolitical tensions.\n\nThe public sector contributes to the majority of economic activity, with the\nCuban government encouraging the formation of worker co-operatives and self-\nemployment since the 1990s. It later legalized limited private property and\nfree-market rights along with foreign direct investment in 2018. Public sector\nemployment remains high compared to the private sector but has steadily\ndecreased since the 1980s. All public and most private investment activity\nrequires government approval or oversight. Economic data published by the\nCuban government is not always independently verified, limiting Cuba's\ninclusion on economic rankings in Latin America.",
    "openai_summarised_points": [
      "• The economy of Cuba is characterized as a planned economy predominantly operated through state-run enterprises.",
      "• The Communist Party of Cuba maintains extensive control over the economy, exerting significant influence over economic policies and activities.",
      "• Cuba benefits from a low cost of living, inexpensive public transportation, and subsidized services including education, healthcare, and food.",
      "• The country's economic growth has historically been weak, hindered by high levels of labor emigration, dependence on imports, an ongoing energy crisis, foreign trade sanctions, and limited tourism.",
      "• Cuba's dual economy has contributed to a series of financial crises, reflecting structural economic challenges.",
      "• Since 2020, Cuba has been experiencing an economic recession characterized by high inflation, widespread poverty, and food shortages.",
      "• In the 19th century, Cuba was one of the most prosperous pre-industrial Latin American countries, exporting tobacco, sugar, and coffee.",
      "• During the Cuban Revolution (1953–1959), under the military dictatorship of Fulgencio Batista, Cuba's GDP per capita ranked seventh in Latin America.",
      "• Throughout the Cold War, Cuba's economy was heavily subsidized by the Eastern Bloc, with subsidies constituting between 10% and 40% of Cuba's GDP in various years, due to its geopolitical alignment with the Soviet Union.",
      "• The collapse of the Soviet Union led to a severe economic downturn in Cuba, with GDP declining by 33% between 1990 and 1993.",
      "• The period from 1991 to 2001, known as the Special Period, was marked by prolonged economic malaise, which was alleviated through marginal liberalization measures and foreign support, particularly from Venezuela.",
      "• The United States has maintained an economic embargo against Cuba since 1958, driven by ongoing geopolitical tensions.",
      "• The public sector accounts for the majority of economic activity in Cuba, with the government promoting the development of worker cooperatives and self-employment starting in the 1990s.",
      "• In 2018, Cuba legalized limited private property rights and free-market activities, as well as foreign direct investment, marking a shift towards economic liberalization.",
      "• Despite high employment levels in the public sector, private sector employment has been steadily decreasing since the 1980s.",
      "• All significant private and public investment activities require government approval or oversight, limiting market autonomy.",
      "• Economic data published by the Cuban government is not always independently verified, which hampers Cuba's inclusion in Latin American economic rankings."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:09.851506",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2232,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Historical GDP per capita development"
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Colonial and Republican period (1870-1959)",
    "text": "Although Cuba belonged to the high-income countries of Latin America since the\n1870s, income inequality was high, accompanied by capital outflows to foreign\ninvestors. The country's economy had grown rapidly in the early part of the\ncentury, fueled by the sale of sugar to the United States.\n\nBefore the Cuban Revolution, in 1958, Cuba had a per-capita GDP of $2,363,\nwhich placed it in the middle of Latin American countries. According to the\nUN, between 1950 and 1955, Cuba had a life expectancy of 59.4 years, which\nplaced it in 56th place in the global ranking.\n\nIts proximity to the United States made it a familiar holiday destination for\nwealthy Americans. Their visits for gambling, horse racing, and golfing made\ntourism an important economic sector. Tourism magazine _Cabaret Quarterly_\ndescribed Havana as \"a mistress of pleasure, the lush and opulent goddess of\ndelights\". Cuban dictator Fulgencio Batista had plans to line the Malecon,\nHavana's famous walkway by the water, with hotels and casinos to attract even\nmore tourists.\n\nIn the late 1950s, Cuba's oil sector was controlled by three large\ninternational oil companies: Standard Oil of New Jersey (Esso), Texaco, and\nRoyal Dutch Shell.",
    "openai_summarised_points": [
      "• Since the 1870s, Cuba was classified among the high-income countries of Latin America, yet it experienced significant income inequality and capital outflows to foreign investors.",
      "• The Cuban economy experienced rapid growth in the early 20th century, primarily driven by the export of sugar to the United States.",
      "• In 1958, just before the Cuban Revolution, Cuba's per-capita GDP was $2,363, positioning it in the middle range among Latin American countries.",
      "• According to the United Nations, between 1950 and 1955, Cuba had a life expectancy of 59.4 years, ranking 56th globally in this metric.",
      "• Cuba’s geographical proximity to the United States made it a popular holiday destination for wealthy Americans, with tourism centered around gambling, horse racing, and golfing activities.",
      "• The tourism magazine _Cabaret Quarterly_ described Havana as \"a mistress of pleasure, the lush and opulent goddess of delights,\" highlighting its reputation for leisure and entertainment.",
      "• Cuban dictator Fulgencio Batista planned to develop Havana’s Malecon, a famous waterfront walkway, by lining it with hotels and casinos to further attract tourists.",
      "• In the late 1950s, Cuba’s oil industry was dominated by three major international oil companies: Standard Oil of New Jersey (Esso), Texaco, and Royal Dutch Shell."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:13.761881",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1204,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Early economic planning (1959-1967)",
    "text": "On 3 March 1959, Fidel Castro seized control of the Cuban Telephone Company,\nwhich was a subsidiary of the International Telephone and Telecommunications\nCorporation. This was the first of many nationalizations made by the new\ngovernment; the assets seized totaled US$9 billion.\n\nAfter the 1959 Revolution, citizens were not required to pay a personal income\ntax (their salaries being regarded as net of any taxes). The government also\nbegan to subsidize healthcare and education for all citizens; this action\ncreated strong national support for the new revolutionary government.\n\nThe USSR and Cuba reestablished their diplomatic relations in May 1960. When\noil refineries like Shell, Texaco, and Esso refused to refine Soviet oil,\nCastro nationalized that industry as well, taking over the refineries on the\nisland. Days later in response, the United States cut the Cuban sugar quota\ncompletely; Eisenhower was quoted saying \"This action amounts to economic\nsanctions against Cuba. Now we must look ahead to other economic, diplomatic,\nand strategic moves.\" Cuba and the Soviet Union signed their first trade deal\nthat year, in which Cuba traded sugar to the Soviet Union in exchange for\nfuel.\n\nWhile the massive Soviet subsidies funded Cuba's enormous state budget, they\ndid not sufficiently develop a self-sustaining Cuban economy. Described by\neconomists as \"a relatively highly developed Latin American export economy\" in\n1959 and the early 1960s, Cuba's fundamental economic structure changed very\nlittle from the Revolution to 1990. Cigars and cigarettes were the only\nmanufactured products among Cuba's leading exports, produced mostly by pre-\nindustrial piecework. The economy remained inefficient and over-specialized in\na few commodities purchased by the Eastern Bloc countries. On 7 February 1962,\nKennedy expanded the United States embargo to cover almost all U.S. imports.\n\nBy the late 1960s, Cuba became dependent on Soviet economic, political, and\nmilitary aid. It was also around this time that Castro began privately\nbelieving that Cuba could bypass the various stages of socialism and progress\ndirectly to pure communism. General Secretary Leonid Brezhnev consolidated\nCuba's dependence on the USSR when, in 1973, Castro caved to Brezhnev's\npressure to become a full member of Council for Mutual Economic Assistance\n(Comecon). Comecon deemed Cuba one of its underdeveloped member countries and\ntherefore Cuba could obtain oil in direct exchange for sugar at a rate that\nwas highly favorable to Cuba. Hard currency Cuba obtained from re-exporting\noil facilitated Cuba's importation of goods from non-Comecon countries and\nfacilitated its investments in social services.",
    "openai_summarised_points": [
      "• On 3 March 1959, Fidel Castro seized control of the Cuban Telephone Company, a subsidiary of the International Telephone and Telecommunications Corporation, marking the beginning of widespread nationalizations; the assets seized totaled US$9 billion.",
      "• Following the 1959 Revolution, the Cuban government abolished personal income tax, with salaries considered net of taxes, and initiated subsidies for healthcare and education for all citizens, which garnered strong national support for the revolutionary government.",
      "• Cuba and the USSR reestablished diplomatic relations in May 1960, strengthening their political and economic ties.",
      "• When major oil refineries such as Shell, Texaco, and Esso refused to refine Soviet oil, Castro nationalized these industries on the island, taking control of the refineries.",
      "• In response to Cuba’s nationalizations, the United States completely cut the Cuban sugar quota days later; President Dwight D. Eisenhower characterized this action as \"economic sanctions against Cuba\" and indicated the need to consider other economic, diplomatic, and strategic measures.",
      "• In 1960, Cuba and the Soviet Union signed their first trade agreement, whereby Cuba exported sugar to the USSR in exchange for fuel, establishing a vital economic partnership.",
      "• Soviet subsidies financed Cuba’s large state budget but did not lead to the development of a self-sustaining economy; despite this, Cuba was described as \"a relatively highly developed Latin American export economy\" in 1959 and early 1960s.",
      "• Cuba’s primary exports remained cigars and cigarettes, produced mainly through pre-industrial piecework, with the economy characterized by inefficiency and over-specialization in a few commodities primarily sold to Eastern Bloc countries.",
      "• The Cuban economy remained largely unchanged from the Revolution until 1990, maintaining a structure heavily reliant on Soviet aid and exports.",
      "• On 7 February 1962, President John F. Kennedy expanded the U.S. embargo to include nearly all U.S. imports from Cuba, intensifying economic isolation.",
      "• By the late 1960s, Cuba had become dependent on Soviet economic, political, and military aid, with Castro privately believing that Cuba could bypass the traditional stages of socialism and move directly to pure communism.",
      "• In 1973, under pressure from Soviet leader Leonid Brezhnev, Castro agreed to Cuba’s full membership in the Council for Mutual Economic Assistance (Comecon), which classified Cuba as an underdeveloped member country.",
      "• As a Comecon member, Cuba obtained oil in exchange for sugar at highly favorable rates, facilitating the import of goods from non-Comecon countries and supporting investments in social services.",
      "• The favorable exchange rates and re-exporting of oil provided Cuba with hard currency, which was used to import goods from outside the Eastern Bloc and to finance social development initiatives."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:22.141273",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2687,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "1968-1990",
    "text": "In 1970 as part of the Revolutionary Offensive economic campaign, Fidel Castro\nattempted to motivate the Cuban people to harvest 10 million tons of sugar, in\nSpanish known as _La Zafra_ , to increase their exports and grow their\neconomy. Despite the help of most of the Cuban population, the country fell\nshort and produced only 7.56 million tons. In July 1970, after the harvest was\nover, Castro took responsibility for the failure, but later that same year,\nshifted the blame toward the Sugar Industry Minister saying \"Those\ntechnocrats, geniuses, super-scientists assured me that they knew what to do\nto produce the ten million tons. But it was proven, first, that they did not\nknow how to do it and, second, that they exploited the rest of the economy by\nreceiving large amounts of resources ... while there are factories that could\nhave improved with a better distribution of those resources that were\nallocated to the Ten-Million-Ton plan\".\n\nDuring the Revolutionary period, Cuba was one of the few developing countries\nto provide foreign aid to other countries. Foreign aid began with the\nconstruction of six hospitals in Peru in the early 1970s. Between 1970 and\n1985, Cuba sustained high rates of growth: \"Cuba had done remarkably well in\nterms of satisfying basic needs (especially education and health)\" and \"was\nactually following the World Bank recipe from the 1970s: redistribution with\ngrowth\". Foreign aid expanded later in the 1970s to the point where some 8000\nCubans worked in overseas assignments. Cubans built housing, roads, airports,\nschools, and other facilities in Angola, Ethiopia, Laos, Guinea, Tanzania, and\nother countries. By the end of 1985, 35,000 Cuban workers had helped build\nprojects in some 20 Asian, African, and Latin American countries.\n\nFor Nicaragua in 1982, Cuba pledged to provide over $130 million worth of\nagricultural and machinery equipment and some 4000 technicians, doctors, and\nteachers. Over the course of the 1980s, Cuba provided approximately 90,000\ntons of oil to Nicaragua per year to support the Sandinista revolution.\n\nIn 1986, Cuba defaulted on its $10.9 billion debt to the Paris Club. In 1987,\nCuba stopped making payments on that debt. In 2002, Cuba defaulted on $750\nmillion in Japanese loans.",
    "openai_summarised_points": [
      "• In 1970, as part of the Revolutionary Offensive economic campaign, Fidel Castro launched an initiative called _La Zafra_ with the goal of harvesting 10 million tons of sugar to boost exports and grow the Cuban economy.",
      "• Despite widespread participation from the Cuban population, the country fell short of this target, producing only 7.56 million tons of sugar in 1970.",
      "• After the harvest concluded in July 1970, Fidel Castro publicly took responsibility for the failure; however, later in the same year, he shifted blame to the Sugar Industry Minister, criticizing technocrats and scientists for overestimating their capabilities and for resource misallocation.",
      "• Castro accused the technocrats of claiming they knew how to produce 10 million tons, but failing to do so, and of exploiting the rest of the economy by receiving large resource allocations, which could have been better distributed to improve factory productivity.",
      "• During the revolutionary period, Cuba distinguished itself as one of the few developing countries to provide foreign aid to other nations, beginning with the construction of six hospitals in Peru in the early 1970s.",
      "• Between 1970 and 1985, Cuba experienced high growth rates, notably in satisfying basic needs such as education and health, following a development model aligned with the World Bank’s 1970s strategy of redistribution combined with growth.",
      "• Cuban foreign aid expanded significantly during the 1970s, with approximately 8,000 Cubans working in overseas assignments across various countries.",
      "• Cuban aid efforts included building housing, roads, airports, schools, and other infrastructure in Angola, Ethiopia, Laos, Guinea, Tanzania, and additional countries.",
      "• By the end of 1985, around 35,000 Cuban workers had contributed to development projects in approximately 20 countries across Asia, Africa, and Latin America.",
      "• In 1982, Cuba pledged over $130 million worth of agricultural and machinery equipment to Nicaragua, along with dispatching about 4,000 technicians, doctors, and teachers to support the Sandinista revolution.",
      "• Throughout the 1980s, Cuba supplied Nicaragua with approximately 90,000 tons of oil annually to support its revolutionary government.",
      "• In 1986, Cuba defaulted on its $10.9 billion debt owed to the Paris Club, and in 1987, it ceased making payments on this debt.",
      "• In 2002, Cuba defaulted on $750 million in loans from Japan, marking continued challenges in its international debt obligations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:29.921553",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2256,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Special Period (1991-1994)",
    "text": "The Cuban gross domestic product declined at least 35% between 1989 and 1993\ndue to the loss of 80% of its trading partners[_clarification needed_] and\nSoviet subsidies. This loss of subsidies coincided with a collapse in world\nsugar prices. Sugar had done well from 1985 to 1990, crashed precipitously in\n1990 and 1991 and did not recover for five years. Cuba had been insulated from\nworld sugar prices by Soviet price guarantees. However, the Cuban economy\nbegan to improve again following a rapid improvement in trade and diplomatic\nrelations between Cuba and Venezuela following the election of Hugo Chávez in\nVenezuela in 1998, who became Cuba's most important trading partner and\ndiplomatic ally.\n\nThis era was referred to as the \"Special Period in Peacetime\", later shortened\nto \"Special Period\". A _Canadian Medical Association Journal_ paper claimed,\n\"The famine in Cuba during the Special Period was caused by political and\neconomic factors similar to the ones that caused a famine in North Korea in\nthe mid-1990s because both countries were run by authoritarian regimes that\ndenied ordinary people the food to which they were entitled to when the public\nfood distribution collapsed and priority was given to the elite classes and\nthe military.\" Other reports painted an equally dismal picture, describing\nCubans having to resort to eating anything they could find, from Havana Zoo\nanimals to domestic cats. But although the collapse of centrally planned\neconomies in the Soviet Union and other countries of the Eastern bloc\nsubjected Cuba to severe economic difficulties, which led to a drop in\ncalories per day from 3052 in 1989 to 2600 in 2006, mortality rates were not\nstrongly affected thanks to the priority given on maintaining a social safety\nnet.",
    "openai_summarised_points": [
      "• The Cuban gross domestic product (GDP) declined by at least 35% between 1989 and 1993, marking a severe economic contraction during this period.",
      "• The economic decline was primarily due to the loss of approximately 80% of Cuba’s trading partners, significantly reducing trade volume and economic activity.",
      "• The collapse of Soviet subsidies, which had previously supported Cuba’s economy, coincided with this period of decline, exacerbating economic hardships.",
      "• The loss of subsidies from the Soviet Union occurred alongside a collapse in world sugar prices, which had been favorable from 1985 to 1990 but crashed precipitously in 1990 and 1991, remaining depressed for five years.",
      "• Prior to the collapse, Cuba had been insulated from fluctuations in world sugar prices through Soviet price guarantees, which shielded its economy from market volatility.",
      "• Following the deterioration of economic conditions, Cuba’s economy began to show signs of improvement after 1998, driven by a rapid improvement in trade and diplomatic relations with Venezuela.",
      "• The improvement was largely due to Venezuela, especially after the election of Hugo Chávez in 1998, who became Cuba’s most important trading partner and diplomatic ally.",
      "• The era of economic crisis during this period is referred to as the \"Special Period in Peacetime,\" later shortened to \"Special Period.\"",
      "• A study published in the _Canadian Medical Association Journal_ attributed the famine in Cuba during the Special Period to political and economic factors similar to those in North Korea in the mid-1990s, where authoritarian regimes denied ordinary people access to sufficient food.",
      "• The collapse of public food distribution systems and the prioritization of food for the elite classes and military contributed to widespread food shortages and famine conditions.",
      "• Reports from the period describe extreme measures taken by Cubans to survive, including eating anything available such as animals from Havana Zoo and domestic cats.",
      "• Despite severe economic difficulties, the collapse of centrally planned economies in the Soviet Union and Eastern Europe led to a significant drop in average daily caloric intake in Cuba, from 3052 calories in 1989 to 2600 calories in 2006.",
      "• Mortality rates in Cuba were not strongly affected during this period, largely due to the government’s efforts to maintain a social safety net and prioritize public health."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:34.531903",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1765,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Reforms and recovery (1994-2011)",
    "text": "The government undertook several reforms to stem excess liquidity, increase\nlabor incentives, and alleviate serious shortages of food, consumer goods, and\nservices. To alleviate the economic crisis, the government introduced a few\nmarket-oriented reforms, including opening to tourism, allowing foreign\ninvestment, legalizing the U.S. dollar, and authorizing self-employment for\nsome 150 occupations. (This policy was later partially reversed so that while\nthe U.S. dollar is no longer accepted in businesses, it remains legal for\nCubans to hold the currency.) These measures resulted in modest economic\ngrowth. The liberalized agricultural markets were introduced in October 1994,\nat which state and private farmers sell above-quota production at free market\nprices, broadened legal consumption alternatives, and reduced black market\nprices.\n\nGovernment efforts to lower subsidies to unprofitable enterprises and to\nshrink the money supply caused the semi-official exchange rate for the Cuban\npeso to move from a peak of 120 to the dollar in the summer of 1994 to 21 to\nthe dollar by year-end 1999. The drop in GDP halted in 1994 when Cuba reported\n0.7% growth, followed by increases of 2.5% in 1995 and 7.8% in 1996. Growth\nslowed again in 1997 and 1998 to 2.5% and 1.2% respectively. One of the key\nreasons was the failure to notice that sugar production had become uneconomic.\nReflecting on the Special Period, Cuban president Fidel Castro later admitted\nthat many mistakes had been made, \"The country had many economists, and it is\nnot my intention to criticize them, but I would like to ask why we hadn't\ndiscovered earlier that maintaining our levels of sugar production would be\nimpossible. The Soviet Union collapsed, oil cost $40 a barrel, and sugar\nprices were at basement levels, so why did we not rationalize the industry?\"\nLiving conditions in 1999 remained well below the 1989 level.\n\nHistorical evolution of GDP per capita of Cuba and some other Caribbean\ncountries, based on Maddison and current Cuban statistics Archived 13 November\n2011 at the Wayback Machine\n\nDue to the continued growth of tourism, growth began in 1999 with a 6.2%\nincrease in GDP.[_self-published source?_] Growth then picked up, with a\ngrowth in GDP of 11.8% in 2005 according to government figures. In 2007 the\nCuban economy grew by 7.5%, higher than the Latin American average.\nAccordingly, the cumulative growth in GDP since 2004 stood at\n42.5%.[_clarification needed_]\n\nHowever, starting in 1996, the government imposed income taxes on self-\nemployed Cubans. Cuba ranked third in the region in 1958 in GDP per capita,\nsurpassed only by Venezuela and Uruguay. It had descended to 9th, 11th, or\n12th place in the region by 2007. Cuban social indicators suffered less.\n\nEvery year the United Nations holds a vote asking countries to choose if the\nUnited States is justified in its economic embargo against Cuba and whether it\nshould be lifted. 2016 was the first year that the United States abstained\nfrom the vote, rather than voting no, \"since 1992 the US and Israel have\nconstantly voted against the resolution – occasionally supported by the\nMarshall Islands, Palau, Uzbekistan, Albania and Romania\". In its 2020 report\nto the United Nations, Cuba stated that the total cost to Cuba from the United\nStates embargo is $144 billion since its inception.",
    "openai_summarised_points": [
      "• The Cuban government implemented several reforms between 1994 and 2011 aimed at addressing excess liquidity, enhancing labor incentives, and mitigating shortages of food, consumer goods, and services.",
      "• To combat the economic crisis, reforms included opening the economy to tourism, permitting foreign investment, legalizing the U.S. dollar, and authorizing self-employment in approximately 150 occupations.",
      "• The policy of U.S. dollar legalization was later partially reversed; while the dollar is no longer accepted in businesses, it remains legal for Cubans to hold the currency.",
      "• These reforms led to modest economic growth during this period.",
      "• In October 1994, liberalized agricultural markets were introduced, allowing state and private farmers to sell above-quota production at free market prices, expanding legal consumption options, and reducing black market prices.",
      "• The Cuban government sought to reduce subsidies to unprofitable enterprises and contracted the money supply, causing the semi-official exchange rate for the Cuban peso to decline from a peak of 120 to the dollar in summer 1994 to 21 to the dollar by the end of 1999.",
      "• Cuba’s GDP growth was 0.7% in 1994, followed by 2.5% in 1995 and 7.8% in 1996; growth slowed to 2.5% in 1997 and 1.2% in 1998, primarily due to the failure to recognize the unprofitability of sugar production.",
      "• Fidel Castro later admitted that mistakes were made during the Special Period, questioning why the industry’s decline was not recognized earlier given the collapse of the Soviet Union, oil prices at $40 per barrel, and low sugar prices.",
      "• Living conditions in 1999 remained significantly below the levels of 1989.",
      "• The historical evolution of Cuba’s GDP per capita, based on Maddison and Cuban statistics, shows a decline relative to other Caribbean countries over time.",
      "• Tourism growth contributed to economic recovery, with GDP increasing by 6.2% in 1999 and further accelerating to 11.8% in 2005 according to government data.",
      "• In 2007, Cuba’s economy grew by 7.5%, surpassing the Latin American average, with cumulative GDP growth since 2004 reaching 42.5%.",
      "• Starting in 1996, the Cuban government imposed income taxes on self-employed individuals.",
      "• In 1958, Cuba ranked third in the Caribbean region in GDP per capita, behind Venezuela and Uruguay; by 2007, it had fallen to 9th, 11th, or 12th place in the region.",
      "• Despite economic challenges, Cuban social indicators experienced less deterioration compared to economic metrics.",
      "• The United Nations annually votes on whether the U.S. economic embargo against Cuba is justified and should be lifted; in 2016, the U.S. abstained from voting for the first time since 1992, having previously voted against the resolution along with Israel.",
      "• In its 2020 report, Cuba stated that the total economic cost of the U.S. embargo since its inception is approximately $144 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:22:44.975401",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3345,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Post-Fidel Castro reforms (2011-present)",
    "text": "> Either we change course or we sink.\n\n—President Raúl Castro, December 2010\n\nIn 2011, \"[t]he new economic reforms were introduced, effectively creating a\nnew economic system\", which the Brookings Institution dubbed the \"New Cuban\nEconomy\". Since then, over 400,000 Cubans have signed up to become\nentrepreneurs. As of 2012[update] the government listed 181 official jobs no\nlonger under their control—such as taxi driver, construction worker and\nshopkeeper. Workers must purchase licenses to work for some roles, such as a\nmule driver, palm-tree trimmer, or well digger. Despite these openings, Cuba\nmaintains nationalized companies for the distribution of all essential\namenities (water, power, etc.) and other essential services to ensure a\nhealthy population (education, health care).\n\nAround 2000, half the country's sugar mills closed. Before reforms, imports\nwere double exports, doctors earned £15 per month, and families supplemented\nincomes with extra jobs. After reforms, more than 150,000 farmers could lease\nland from the government for surplus crop production. Before the reforms, the\nonly real estate transactions involved homeowners swapping properties; reforms\nlegalized the buying and selling of real estate and created a real estate boom\nin the country. In 2012 a Havana fast-food burger/pizza restaurant, La\nPachanga, started in the owner's home; as of 2012[update] it served 1,000\nmeals on a Saturday at £3 each. Tourists can now ride factory steam\nlocomotives through closed sugar mills.\n\nIn 2008, Raúl Castro's administration hinted that the purchase of computers,\nDVD players, and microwaves would become legal;[_needs update_] however,\nmonthly wages remain less than 20 U.S. dollars. Mobile phones, which had been\nrestricted to Cubans working for foreign companies and government officials,\nwere legalized in 2008.\n\nIn 2010 Fidel Castro, in agreement with Raúl Castro's reformist sentiment,\nadmitted that the Cuban model based on the old Soviet centralized planning\nmodel was no longer sustainable. The brothers encouraged the development of a\ncooperative variant of socialism - where the state plays a less active role in\nthe economy - and the formation of worker-owned co-operatives and self-\nemployment enterprises.\n\nTo remedy Cuba's economic structural distortions and inefficiencies, the Sixth\nCongress approved an expansion of the internal market and access to global\nmarkets on 18 April 2011. A comprehensive list of changes is:\n\n* expenditure adjustments (education, healthcare, sports, culture)\n* change in the structure of employment; reducing inflated payrolls and increasing work in the non-state sector\n* legalizing 201 different personal business licenses\n* fallow state land in usufruct leased to residents\n* incentives for non-state employment, as a re-launch of self-employment\n* proposals for the formation of non-agricultural cooperatives\n* legalization of the sale and private ownership of homes and cars\n* greater autonomy for state firms\n* search for food self-sufficiency, the gradual elimination of universal rationing and change to targeting the poorest population\n* possibility to rent state-run enterprises (including state restaurants) to self-employed persons\n* separation of state and business functions\n* tax-policy update\n* easier travel for Cubans\n* strategies for external debt restructuring\n\nOn 20 December 2011, a new credit policy allowed Cuban banks to finance\nentrepreneurs and individuals wishing to make major purchases to make home\nimprovements in addition to farmers. \"Cuban banks have long provided loans to\nfarm cooperatives, they have offered credit to new recipients of farmland in\nusufruct since 2008, and in 2011 they began making loans to individuals for\nbusiness and other purposes\".\n\nThe system of rationed food distribution in Cuba was known as the _Libreta de\nAbastecimiento_ (\"Supplies booklet\"). As of 2012[update] ration books at\nbodegas still procured rice, oil, sugar, and matches above the government\naverage wage of £15 monthly. As of 2012[update], the country's public debt\ncomprised 35.3% of GDP, inflation (CDP) was 5.5%, and GDP growth was\n3%.[_needs update_]\n\nRaúl Castro signed Law 313 in September 2013 to set up a special economic\nzone, the first in the country, in the port city of Mariel. The zone is exempt\nfrom normal Cuban economic legislation.\n\nOn 22 October 2013, the government eventually announced its intention to end\nthe dual-currency system. The convertible peso (CUC) was no longer issued from\n1 January 2021 and ceased circulation on 30 December 2021.\n\nThe achievements of the radical social policy of socialist Cuba, which enabled\nsocial advancement for the formerly underprivileged classes, were curbed by\nthe economic crisis and the low wages of recent decades. The socialist\nleadership is reluctant to tackle this problem because it touches a core\naspect of its revolutionary legitimacy. As a result, Cuba's National Bureau of\nStatistics (ONE) publishes little data on the growing socio-economic divide. A\nnationwide scientific survey shows that social inequalities have become\nincreasingly visible in everyday life and that the Afro-Cuban population is\nstructurally disadvantaged. The report notes that while 58 percent of white\nCubans have incomes of less than $3,000 a year, that proportion reaches 95\npercent among Afro-Cubans. Afro-Cubans, moreover, receive a very limited\nportion of family remittances from the Cuban-American community in South\nFlorida, which is mostly white. Remittances from family members from abroad\nserve often as starting capital for the emerging private sector. The most\nlucrative branches of business, such as restaurants and lodgings, are run by\nwhite people in particular.\n\nIn February 2019, Cuban voters approved a new constitution granting the right\nto private property and greater access to free markets while also maintaining\nCuba's status as a socialist state. In June 2019, the 16th ExpoCaribe trade\nfair took place in Santiago. Since 2014, the Cuban economy has seen a dramatic\nuptick in foreign investment. In November 2019, Cuba's state newspaper,\n_Granma_ , published an article acknowledging that despite the deterioration\nin relations between the U.S. and Cuban governments, the Cuban government\ncontinued to make efforts to attract foreign investment in 2018. In December\n2018, the official Cuban News Agency reported that 525 foreign direct\ninvestment projects were reported in Cuba, a dramatic increase from the 246\nprojects reported in 2014.\n\nIn February 2021, the Cuban Cabinet authorized private initiatives in more\nthan 1,800 occupations.\n\nThe Cuban economy was negatively affected by the COVID-19 pandemic, as well as\nby additional sanctions from the United States imposed by the Trump\nadministration. In 2020, the country's economy declined by 11%, the country's\nworst decline in nearly 30 years. Cubans have faced shortages of basic goods\nas a result.",
    "openai_summarised_points": [
      "• In December 2010, President Raúl Castro stated, \"Either we change course or we sink,\" highlighting the urgent need for economic reforms in Cuba.",
      "• In 2011, Cuba introduced significant economic reforms creating a new economic system, referred to by the Brookings Institution as the \"New Cuban Economy.\"",
      "• Since the reform implementation, over 400,000 Cubans have registered as entrepreneurs, indicating a substantial shift toward private enterprise.",
      "• As of 2012, the Cuban government officially listed 181 jobs no longer under state control, including roles such as taxi driver, construction worker, and shopkeeper.",
      "• Workers in certain sectors are required to purchase licenses to work in roles like mule driver, palm-tree trimmer, or well digger, reflecting increased privatization.",
      "• Despite these reforms, Cuba maintains nationalized companies responsible for distributing essential amenities such as water and power, and providing healthcare and education to ensure public health.",
      "• Around 2000, approximately half of Cuba’s sugar mills closed, indicating a decline in the sugar industry.",
      "• Prior to reforms, Cuba’s imports were double its exports; doctors earned approximately £15 per month, and families supplemented incomes through additional jobs.",
      "• Post-reforms, over 150,000 farmers gained the ability to lease land from the government for surplus crop production, promoting agricultural privatization.",
      "• Real estate transactions, previously limited to property swaps, were legalized, leading to a real estate boom in Cuba.",
      "• In 2012, La Pachanga, a Havana-based fast-food restaurant started in the owner’s home, served 1,000 meals on a Saturday at £3 each, exemplifying small private enterprise growth.",
      "• Tourists can now ride factory steam locomotives through closed sugar mills, indicating increased tourism and private sector engagement with historical sites.",
      "• In 2008, Raúl Castro’s administration hinted at legalizing the purchase of computers, DVD players, and microwaves; however, monthly wages remained below 20 U.S. dollars.",
      "• Mobile phones, previously restricted to foreign workers and government officials, were legalized in 2008, expanding telecommunications access.",
      "• In 2010, Fidel Castro acknowledged that the Soviet-style centralized planning model was unsustainable, aligning with Raúl Castro’s reformist stance.",
      "• The Castro brothers promoted a cooperative form of socialism, emphasizing reduced state intervention and the development of worker-owned cooperatives and self-employment enterprises.",
      "• On 18 April 2011, Cuba’s Sixth Congress approved extensive reforms to address economic distortions, including:",
      "• expenditure adjustments in education, healthcare, sports, and culture;",
      "• restructuring employment to reduce inflated payrolls and boost non-state sector employment;",
      "• legalization of 201 different personal business licenses;",
      "• leasing of fallow state land to residents under usufruct rights;",
      "• incentives to promote non-state employment and re-launch self-employment;",
      "• proposals for forming non-agricultural cooperatives;",
      "• legalization of private sale and ownership of homes and cars;",
      "• granting greater autonomy to state firms;",
      "• strategies aimed at food self-sufficiency, reducing universal rationing, and targeting aid to the poorest;",
      "• allowing rent of state-run enterprises, including restaurants, to self-employed individuals;",
      "• separation of state and business functions;",
      "• updates to tax policies;",
      "• easing travel restrictions for Cubans;",
      "• strategies for external debt restructuring.",
      "• On 20 December 2011, a new credit policy was implemented, allowing Cuban banks to finance entrepreneurs, individuals for major purchases, home improvements, and farmers, building on existing credit provisions to farm cooperatives and farmland recipients since 2008.",
      "• The rationing system, known as _Libreta de Abastecimiento_, continued as of 2012, with ration books at bodegas providing rice, oil, sugar, and matches, often above the government’s average wage of £15 monthly.",
      "• As of 2012, Cuba’s public debt was 35.3% of GDP, inflation stood at 5.5%, and GDP growth was 3%, though these figures require updates.",
      "• In September 2013, Raúl Castro signed Law 313 to establish the Mariel Special Economic Zone, Cuba’s first zone exempt from standard economic legislation, located in the port city of Mariel.",
      "• On 22 October 2013, Cuba announced plans to end the dual-currency system; the convertible peso (CUC) ceased issuance from 1 January 2021 and circulation ended on 30 December 2021.",
      "• The socialist social policy, which facilitated social advancement for underprivileged classes, was challenged by economic crises and low wages, leading to increased socio-economic disparities.",
      "• The Cuban National Bureau of Statistics (ONE) reports that social inequalities are increasingly visible, with Afro-Cubans being particularly disadvantaged; 58% of white Cubans earn less than $3,000 annually, compared to 95% of Afro-Cubans, who also receive limited remittances from the Cuban-American community in South Florida.",
      "• Remittances are crucial for private sector development, especially in lucrative sectors like restaurants and lodging, which are predominantly run by white Cubans.",
      "• In February 2019, Cubans approved a new constitution granting rights to private property and greater access to free markets, while maintaining Cuba’s socialist identity.",
      "• The 16th ExpoCaribe trade fair took place in Santiago in June 2019, reflecting increased trade activity.",
      "• Since 2014, Cuba experienced a significant rise in foreign investment; by November 2019, 525 foreign direct investment projects were reported, up from 246 in 2014, despite deteriorating US-Cuba relations.",
      "• In February 2021, the Cuban Cabinet authorized private initiatives in over 1,800 occupations, expanding private sector opportunities.",
      "• The Cuban economy was severely impacted by the COVID-19 pandemic and additional US sanctions imposed by the Trump administration; in 2020, the economy contracted by 11%, its worst decline in nearly 30 years, causing shortages of basic goods."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:23:06.940819",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6918,
      "bullet_points_count": 44
    }
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.6.1",
    "section_name": "International debt negotiations",
    "text": "Raúl Castro's government began a concerted effort to restructure and to ask\nfor forgiveness of loans and debts with creditor countries, many in the\nbillions of dollars and long in arrears from loans and debts incurred under\nFidel Castro in the 1970s and 1980s.\n\nIn 2011, China forgave $6 billion in debt owed to it by Cuba.\n\nIn 2013, Mexico's Finance Minister Luis Videgaray announced a loan issued by\nMexico's foreign trade development bank Bancomext to Cuba more than 15 years\nprior was worth $487 million. The governments agreed to \"waive\" 70% of it,\napproximately $340.9 million. Cuba would repay the remaining $146.1 million\nover ten years.\n\nIn 2014, before making a diplomatic visit to Cuba, Russian President Vladimir\nPutin forgave over 90% of the debt owed to Russia by Cuba. The forgiveness\ntotaled $32 billion. A remaining $3.2 billion would be paid over ten years.\n\nIn 2015, Cuba entered into negotiations over its $11.1 billion debt to 14\nmembers of the Paris Club. In December 2015, the parties announced an\nagreement - Paris Club nations agreed to forgive $8.5 billion of the $11.1\nbillion total debt, mostly by waiving interest, service charges, and penalties\naccrued over the more than two decades of non-payment. The 14 countries party\nto the agreement were: Austria, Australia, Belgium, Canada, Denmark, Finland,\nFrance, Italy, Japan, Spain, Sweden, Switzerland, the Netherlands, and the\nUnited Kingdom. The payment for the remaining $2.6 billion would be made over\n18 years, with annual payments due by 31 October of every year. The payments\nwould phase in gradually, increasing from an initial 1.6 percent of the total\nowed until the last payment of 8.9 percent in 2033. Interest would be forgiven\nfrom 2015 to 2020, and just 1.5 percent of the total debt still be due\nthereafter. The agreement contained a penalty clause: should Cuba again not\nmake payments on schedule (by 31 October of any year), it would be charged 9\npercent interest until payment and late interest on the portion in arrears.\nThe regime viewed the agreement favorably to resolve the long-standing issues\nand build business confidence, increasing direct foreign investment and as a\npreliminary step to gaining access to credit lines in Europe.\n\nIn 2018, during a diplomatic visit to Cuba, the General Secretary of the\nCommunist Party of Vietnam Nguyễn Phú Trọng wrote off Cuba's official debt to\nVietnam. The forgiveness totaled $143.7 million.\n\nIn 2019, Cuba once again defaulted on its Paris Club debt. Of the estimated\npayment due in 2019 of $80 million, Cuba made only a partial payment that left\n$30 million owed for that year. Cuban Deputy Prime Minister Ricardo Cabrisas\nwrote a letter to Odile Renaud-Basso, president of the Paris Club, noting that\nCuba was aware that \"circumstances dictated that we were not able to honour\nour commitments with certain creditor countries as agreed in the multilateral\nMinute signed by the parties in December 2015\". He maintained that they had\n\"the intention of settling\" the payments in arrears by 31 May 2020.\n\nIn May 2020, with payments still not made, Deputy PM Cabrisas sent a letter to\nthe fourteen Paris Club countries in the agreement requesting \"a moratorium\n(of payments) for 2019, 2020 and 2021 and a return to paying in 2022\". As of\nAug 2023, payments had still not resumed with a new payment calendar still\nbeing negotiated."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Energy",
    "text": "As of 2011, 96% of electricity was produced from fossil fuels. Solar panels\nwere introduced in some rural areas to reduce blackouts, brownouts, and the\nuse of kerosene. Citizens were encouraged to swap inefficient lamps with newer\nmodels to reduce consumption. A power tariff reduced inefficient use.\n\nIn 2007, Cuba produced an estimated 16.89 billion kWh of electricity and\nconsumed 13.93 billion kWh with no exports or imports.\n\nAbout 25% of Cuba's electricity is generated on ships with floating power\nplants. As of 2023, eight powerships from Turkey provide 770 MW from burning\noil.\n\nThe Energy Revolution is a program begun by Cuba in 2005. This program focused\non developing the country's socioeconomic status and transitioning Cuba into\nan energy-efficient economy with diverse energy resources. Cuba's energy\nsector lacks the resources to produce optimal amounts of power. One of the\nissues the Energy Revolution program faces comes from Cuba's power production\nsuffering from the absence of investment and the ongoing trade sanctions\nimposed by the United States. Likewise, the energy sector has received a\nmultimillion-dollar investment distributed among a network of power resources.\nHowever, customers are experiencing rolling blackouts of power from energy\ncompanies to preserve electricity during Cuba's economic crisis. Furthermore,\nan outdated electricity grid that's been damaged by hurricanes caused the\nenergy crisis in 2004 and continued to be a major issue during the Energy\nRevolution. Cuba responded to this situation by providing a variety of\ndifferent types of energy resources. 6000 small diesel generators, 416 fuel\noil generators, 893 diesel generators, 9.4 million incandescent bulbs for\nenergy-saving lamps, 1.33 million fans, 5.5 million electric pressure cookers,\n3.4 million electric rice cookers, 0.2 million electric water pumps, 2.04\nmillion domestic refrigerators and 0.1 million televisions were distributed\namong territories. The electrical grid was restored to only 90% until 2009.\n\nThe country frequently suffers rolling blackouts due to fuel shortages, and\nmany plants are shut down due to a lack of fuel. In October 2024, the entire\ncountry suffered a multiday electricity blackout when the Antonio Guiteras\npower plant failed and efforts to restart the grid were not successful."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.7.1",
    "section_name": "Renewable energy",
    "text": "Renewable energy has become a major priority as the government has promoted\nwind and solar power. Under a March 2017 law, the Cuban government has begun\nto roll out solar panels to every home in Cuba. The crucial challenge the\nEnergy Revolution program will face is developing sustainable energy in Cuba\nbut, take into account a country that's continuing to develop, an economic\nsanction and the detrimental effects of hurricanes that hit this country.\n\nThe passage of Decree-Law 345 in 2019 permits Cubans to purchase photovoltaic\nsolar panels for private use and to sell surplus energy to state company Unión\nEléctrica.\n\nIn 2022, about 1.5% of electricity came from solar power."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.7.2",
    "section_name": "Oil and gas",
    "text": "As of August 2012, off-shore petroleum exploration of promising formations in\nthe Gulf of Mexico had been unproductive, with two failures reported.\nAdditional exploration is planned.\n\nIn both 2007 and 2008 estimates, the country produced 62,100 bbl/d of oil and\nconsumed 176,000 bbl/d with 104,800 bbl/d of imports, as well as 197,300,000\nbbl proved reserves of oil. Venezuela is Cuba's primary source of oil.\n\nIn 2017, Cuba produced and consumed an estimated 1189 million m3 of natural\ngas and has 70.79 billion m3 of proved reserves the nation did not export or\nimport any natural gas."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Agriculture",
    "text": "Cuba produces sugarcane, tobacco, citrus, coffee, rice, potatoes, beans, and\nlivestock. As of 2015, Cuba imported about 70–80% of its food and 80–84% of\nthe food it rations to the public. Raúl Castro ridiculed the bureaucracy that\nshackled the agriculture sector."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.9",
    "section_name": "Industry",
    "text": "Pumpjacks in Cuba\n\nIndustrial production accounted for almost 37% of Cuban GDP or US$6.9 billion\nand employed 24% of the population, or 2,671,000 people, in 1996. A rally in\nsugar prices in 2009 stimulated investment and development of sugar\nprocessing.\n\nIn 2003 Cuba's biotechnology and pharmaceutical industry was gaining in\nimportance. Among the products sold internationally are vaccines against\nvarious viral and bacterial pathogens. For example, the drug Heberprot-P was\ndeveloped as a cure for diabetic foot ulcer and had success in many developing\ncountries. Cuba has also done pioneering work on the development of drugs for\ncancer treatment.\n\nScientists such as V. Verez-Bencomo were awarded international prizes for\ntheir biotechnology and sugar cane contributions.[_self-published source?_]"
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.10",
    "section_name": "Biotechnology",
    "text": "Cuba's biotechnology sector developed in response to the limitations on\ntechnology transfer, international financing, and international trade\nresulting from the United States embargo. The Cuban biotechnology sector is\nentirely state-owned."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.10.1",
    "section_name": "Tourism",
    "text": "A white sand beach in Varadero, Cuba\n\nIn the mid-1990s, tourism surpassed sugar, the mainstay of the Cuban economy,\nas the primary source of foreign exchange. Havana devotes significant\nresources to building tourist facilities and renovating historic structures.\nCuban officials estimate roughly 1.6 million tourists visited Cuba in 1999,\nyielding about $1.9 billion in gross revenues. In 2000, 1,773,986 foreign\nvisitors arrived in Cuba. Revenue from tourism reached US$1.7 billion. By\n2012, some 3 million visitors brought nearly £2 billion yearly.\n\nThe growth of tourism has had social and economic repercussions. This led to\nspeculation of the emergence of a two-tier economy and the fostering of a\nstate of tourist apartheid. This situation was exacerbated by the influx of\ndollars during the 1990s, potentially creating a dual economy based on the\ndollar (the currency of tourists) on the one hand and the peso on the other.\nScarce imported goods – and even some local manufactures, such as rum and\ncoffee – could be had at dollar-only stores but were hard to find or\nunavailable at peso prices. As a result, Cubans who earned only in the peso\neconomy, outside the tourist sector, were at a disadvantage. Those with dollar\nincomes based upon the service industry began to live more comfortably. This\nwidened the gap between Cubans' material living standards, conflicting with\nthe Cuban government's long-term socialist policies."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.10.2",
    "section_name": "Retail",
    "text": "Cuba has a small retail sector. A few large shopping centers operated in\nHavana as of September 2012 but charged US prices. Pre-Revolutionary\ncommercial districts were largely shut down. Most stores are small dollar\nstores, bodegas, agro-mercados (farmers' markets), and street stands."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.11",
    "section_name": "Finance",
    "text": "The financial sector remains heavily regulated, and access to credit for\nentrepreneurial activity is seriously impeded by the shallowness of the\nfinancial market."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.12",
    "section_name": "Foreign investment and trade",
    "text": "in 2023, Canada receives the largest share of Cuban exports (30.6%), 70 to 80%\nof which go through Indiana Finance BV, a company owned by the Van 't Wout\nfamily, who have close personal ties with Fidel Castro. This trend can be seen\nin other colonial Caribbean communities with direct political ties with the\nglobal economy. Cuba's primary import partner is Venezuela. The second-largest\ntrade partner is China, with a 16.9% share of the Cuban export market.\n\nCuba began courting foreign investment in the Special Period. Foreign\ninvestors must form joint ventures with the Cuban government. The sole\nexception to this rule is Venezuelans, who can hold 100% ownership in\nbusinesses due to an agreement between Cuba and Venezuela. Cuban officials\nsaid in early 1998 that 332 joint ventures had begun. Many of these are loans\nor contracts for management, supplies, or services normally not considered\nequity investments in Western economies. Investors are constrained by the U.S.\nHelms–Burton Act that provides sanctions for those who traffic in property\nexpropriated from U.S. citizens.\n\nCuba's average tariff rate is 10 percent. As of 2014, the country's planned\neconomy deterred foreign trade and investment. At this point, the state\nmaintained strict capital and exchange controls. In 2017, however, the country\nreported a record 2 billion in foreign investment. It was also reported that\nforeign investment in Cuba had increased dramatically since 2014. In September\n2019, EU foreign policy chief Federica Mogherini stated during a three-day\nvisit to Cuba that the European Union is committed to helping Cuba develop its\neconomy\n\nA tobacco plantation in Pinar del Río"
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.13",
    "section_name": "Currencies",
    "text": "From 1994 until 2021, Cuba had two official currencies: the national peso (or\nCUP) and the convertible peso (or CUC, often called \"dollar\" in the spoken\nlanguage). In January 2021, however, a long-awaited process of currency\nunification began, with Cuban citizens being given six months to exchange\ntheir remaining CUCs at a rate of one to every 24 CUPs.\n\nIn 1994 the possession and use of US dollars were legalized, and by 2004 the\nUS dollar was in widespread use in the country. To capture the hard currency\nflowing into the island through tourism and remittances – estimated at\n$500–800 million annually – the government set up state-run \"dollar stores\"\nthroughout Cuba that sold \"luxury\" food, household, and clothing items,\ncompared with necessities, which could be bought using national pesos. As\nsuch, the standard of living diverged between those with access to dollars and\nthose without. Jobs that could earn dollar salaries or tips from foreign\nbusinesses and tourists became highly desirable. Meeting doctors, engineers,\nscientists, and other professionals working in restaurants or as taxicab\ndrivers was common.\n\nIn response to tighter economic sanctions by the US and because the\nauthorities were pleased with Cuba's economic recovery, the Cuban government\ndecided in October 2004 to remove US dollars from circulation. In its place,\nthe convertible peso was created, which, although not internationally traded,\nhad a value pegged to the US dollar 1:1. A 10% surcharge was levied for cash\nconversions from US dollars to the convertible peso, which did not apply to\nother currencies, thus acting as an encouragement for tourists to bring\ncurrencies such as euros, pounds sterling or Canadian dollars into Cuba. An\nincreasing number of tourist zones accept Euros."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "1.14",
    "section_name": "Private businesses",
    "text": "Owners of small private restaurants (_paladares_) originally could seat no\nmore than 12 people and can only employ family members. Set monthly fees must\nbe paid regardless of income earned, and frequent inspections yield stiff\nfines when any of the many self-employment regulations are violated. As of\n2023[update], public-sector employment was 65%, and private-sector employment\nwas 35%, compared to the 2000 ratio of 76% to 23% and the 1981 ratio of 91% to\n8%.\n\nAs of 2012, more than 150,000 farmers had signed up to lease land from the\ngovernment for bonus crops. Before, homeowners were only allowed to swap; once\nbuying and selling were allowed, prices rose.\n\nIn cities, \"urban agriculture\" farms small parcels. Growing organopónicos\n(organic gardens) in the private sector has been attractive to city-dwelling\nsmall producers who sell their products where they produce them, avoiding\ntaxes and enjoying a measure of government help from the Ministry of\nAgriculture (MINAGRI) in the form of seed houses and advisers.\n\nIn February 2021, the government said that it would allow the private sector\nto operate in most sectors of the economy, with only 124 activities remaining\nin the public sector, such as national security, health, and educational\nservices. In August 2021, the Cuban government started allowing citizens to\ncreate small and medium-sized private companies, which are allowed to employ\nup to 100 people. As of 2023, 8,000 companies have been registered in Cuba.\n\nIn 2021, Cuba's \"economic freedom\" score from the free-market oriented\nHeritage Foundation was 28.1, ranking Cuba's economy 176th (among the \"least\nfree\") on such measures as \"trade freedom, fiscal freedom, monetary freedom,\nfreedom, and business freedom\". Cuba ranked 31st among the 32 South and\nCentral America countries, with the Heritage Foundation rating Venezuela as a\n\"client state\" of Cuba's and one of the least free.[_better source needed_]"
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Wages, development, and pensions",
    "text": "Until June 2019, typical wages ranged from 400 non-convertible Cuban pesos a\nmonth, for a factory worker, to 700 per month for a doctor, or around 17–30 US\ndollars per month. However, the Human Development Index of Cuba still ranks\nmuch higher than the vast majority of Latin American nations. After Cuba lost\nSoviet subsidies in 1991, malnutrition resulted in an outbreak of diseases.\nDespite this, the poverty level reported by the government is one of the\nlowest in the developing world, ranking 6th out of 108 countries, 4th in Latin\nAmerica and 48th among all countries. According to a 2022 report from the\nCuban Human Rights Observatory (OCDH), 72 percent of Cubans live below the\npoverty line. 21 percent of Cubans who live below the poverty line frequently\ngo without breakfast, lunch or dinner due to a lack of money. Pensions are\namong the smallest in the Americas at $9.50/month. In 2009, Raúl Castro\nincreased minimum pensions by 2 dollars, which he said was to recompense for\nthose who have \"dedicated a great part of their lives to working ... and who\nremain firm in defense of socialism\". Cuba is known for its system of food\ndistribution, the _Libreta de Abastecimiento_ (\"Supplies booklet\"). The system\nestablishes the rations each person can buy through that system and the\nfrequency of supplies. Despite rumors of ending, the system still exists.\n\nIn June 2019, the government announced an increase in public sector wages,\nespecially for teachers and health personnel. The increase was about 300%. In\nOctober, the government opened stores where citizens could purchase, via\ninternational currencies (USD, euro, etc.) stored on electronic cards,\nhousehold supplies, and similar goods. These funds are provided by remittances\nfrom emigres. The government leaders recognized that the new measure was\nunpopular but necessary to contain the flight of capital to other countries,\nsuch as Panama, where Cuban citizens traveled and imported items to resell on\nthe island.\n\nOn 1 January 2021, the government launched the \"Tarea Ordenamiento\" (Ordering\nTask), previously announced on national television by President Miguel Díaz\nCanel and Gen. Raúl Castro, the then-first secretary of the Cuban Communist\nParty. This is an effort, years in the making, to end the use of the Cuban\nconvertible peso (CUC) and to solely use the Cuban peso (CUP), ostensibly to\nincrease economic efficiency. In February, the government created new\nrestrictions to the private sector, with prohibitions on 124 activities, in\nareas like national security, health, and educational services. Wages and\npensions were increased again, between 4 and 9 times, for all the sectors. For\nexample, a university instructor's salary went from 1500 to 5500 CUP.\nAdditionally, the dollar price was maintained by the Cuban central bank at 24\nCUP, but was unable to sell dollars to the population due to the drought of\nforeign currency created by the COVID-19 pandemic."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Public facilities",
    "text": "* Bodegas – Local shops offering basic products such as rice, sugar, salt, beans, cooking oil, matches, rum at low prices.\n* El coppelia – A government-owned facility offering ice cream, juice and sweets.\n* Paladar – A small, privately owned restaurant facility.\n* La farmacia – Low-priced medicine, with the lowest costs anywhere in the world.\n* ETECSA – National telephone service provider.\n* La feria – A weekly market (Sunday market-type) owned by the government.\n* Cervecería Bucanero – A beverage manufacturer providing both alcoholic and non-alcoholic beverages.\n* Ciego Montero – The main soft-drink and beverage distributor."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Connection with Venezuela",
    "text": "Cuba and Venezuela have agreements under which Venezuela provides cheap oil in\nexchange for the assistance of Cuban doctors in the Venezuelan health care\nsystem. As of 2015, Cuba had the third-highest number of physicians per capita\nworldwide (behind Monaco and Qatar) The country sends tens of thousands of\ndoctors to other countries as aid, and to obtain favorable trade terms.\nAccording to Carmelo Mesa-Lago, a Cuban-born US economist, in nominal terms,\nthe Venezuelan subsidy is higher than the subsidy which the Soviet Union gave\nto Cuba, with the Cuban state receiving cheap oil and the Cuban economy\nreceiving around $6 billion annually. In 2013 Carmelo Mesa-Lago said, \"If this\nhelp stops, industry is paralysed, transportation is paralysed and you'll see\nthe effects in everything from electricity to sugar mills\".\n\nFrom an economic standpoint, Cuba relies much more on Venezuela than Venezuela\ndoes on Cuba. As of 2012, Venezuela accounted for 20.8% of Cuba's GDP, while\nCuba only accounted for roughly 4% of Venezuela's. Because of this reliance,\nthe most recent economic crisis in Venezuela, with inflation nearing 800% and\nGDP shrinking by 19% in 2016, Cuba is not receiving their amount of payment\nand heavily subsidized oil. Further budget cuts are in the plans for 2018,\nmarking a third straight year.[_needs update_]"
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Taxes and revenues",
    "text": "As of 2009, Cuba had $47.08 billion in revenues and $50.34 billion in\nexpenditures, with 34.6% of GDP in public debt, an account balance of $513\nmillion, and $4.647 billion in reserves of foreign exchange and gold.\nGovernment spending is around 67 percent of GDP, and public debt is around 35\npercent of the domestic economy. Despite reforms, the government plays a large\nrole in the economy.\n\nThe top individual income tax rate is 50 percent. The top corporate tax rate\nis 30 percent (35 percent for wholly foreign-owned companies). Other taxes\ninclude a tax on property transfers and a sales tax. The overall tax burden is\n24.42 percent of GDP."
  },
  {
    "chapter_name": "Economy of Cuba",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Income and wealth",
    "text": "Its income distribution compared favorably with that of other Latin American\ncountries during the 19th century. However, \"available data must be viewed\ncautiously and assumed to portray merely a rough approximation of conditions\nat the time,\" according to Susan Eckstein. There were profound social\ninequalities between city and countryside and between whites and blacks, with\ntrade and unemployment problems. In 2021, Cuba ranked 83rd out of 191 on the\nHuman Development Index in the high human development category."
  }
]