[
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Djibouti** is derived in large part from its strategic\nlocation on the Red Sea. Djibouti is mostly barren, with little development in\nthe agricultural and industrial sectors. The country has a harsh climate, a\nlargely unskilled labour force, and limited natural resources. The country's\nmost important economic asset is its strategic location, connecting the Red\nSea and the Gulf of Aden. As such, Djibouti's economy is commanded by the\nservices sector, providing services as both a transit port for the region and\nas an international transshipment and refueling centre.\n\nFrom 1991 to 1994, Djibouti experienced a civil war which had devastating\neffects on the economy. Since then, the country has benefited from political\nstability. In recent years, Djibouti has seen significant improvement in\nmacroeconomic stability, with its annual gross domestic product improving at\nan average of over 3 percent since 2003. This comes after a decade of negative\nor low growth and is attributed to fiscal adjustment aimed at improving public\nfinancing, reforms in port management and foreign investment.\n\nDespite the recent modest and stable growth, Djibouti is faced with many\neconomic challenges, particularly job creation and poverty reduction. With an\naverage annual population growth rate of 2.5 percent, the economy cannot\nsignificantly benefit national income per capita growth. Unemployment is\nextremely high, with some estimates placing it at almost 60 percent, and is a\nmajor contributor to widespread poverty. In recent years, the country's\ndependence on Chinese investment and debt has also come under scrutiny.\n\nAccording to a 2020 report by the World bank, Djibouti was 112th among 190\neconomies when it comes to the ease of doing business.",
    "openai_summarised_points": [
      "• The economy of Djibouti is primarily based on its strategic geographic location along the Red Sea, which is a key asset for regional trade and transit activities.",
      "• Djibouti's landscape is mostly barren, with minimal development in its agricultural and industrial sectors, reflecting limited natural resources and a harsh climate.",
      "• The country possesses a largely unskilled labor force and has limited natural resources, which constrain economic diversification and growth.",
      "• The most significant economic asset of Djibouti is its strategic position connecting the Red Sea and the Gulf of Aden, facilitating its role as a regional transit hub.",
      "• The economy is predominantly driven by the services sector, which includes functioning as a transit port, an international transshipment center, and a refueling hub for ships passing through the region.",
      "• Djibouti experienced a devastating civil war from 1991 to 1994, which severely impacted its economic stability and development.",
      "• Since the end of the civil war, Djibouti has benefited from increased political stability, contributing to economic recovery and growth.",
      "• In recent years, Djibouti has achieved notable macroeconomic stability, with its annual gross domestic product (GDP) growing at an average rate of over 3 percent since 2003.",
      "• This growth follows a decade characterized by negative or low economic growth, and it is attributed to fiscal adjustments aimed at improving public finances, reforms in port management, and increased foreign investment.",
      "• Despite this modest and stable growth, Djibouti faces significant economic challenges, notably in job creation and poverty alleviation.",
      "• The country’s population growth rate is approximately 2.5 percent annually, which limits the impact of economic growth on increasing per capita income.",
      "• Unemployment rates are extremely high, with estimates reaching nearly 60 percent, significantly contributing to widespread poverty across the nation.",
      "• In recent years, Djibouti’s reliance on Chinese investment and debt has increased and has become a subject of concern and scrutiny.",
      "• According to a 2020 report by the World Bank, Djibouti ranked 112th out of 190 economies in terms of ease of doing business, indicating moderate challenges for business operations within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:28:44.849013",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1760,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic performance",
    "text": "Bus down the central market in Djibouti City.\n\nAfter experiencing armed conflict and economic hardship during the 1990s,\nDjibouti has experienced stable economic growth in recent years as a result of\nrelative political stability and achievements in macroeconomic adjustment\nefforts.\n\nFiscal adjustment measures included downsizing the civil service, implementing\na pension reform that placed the system on a much stronger financial footing,\nand strengthening public expenditure institutions. From 2003 to 2005, annual\nreal GDP growth averaged 3.1 percent in the mid-2000s, driven by good\nperformance in the services sector, strong consumption and reached a value as\nhigh as 7.8 percent in 2019. In the 21st century, Inflation has been kept low\nthrough fixed pegging of the Djibouti franc to the US dollar, but experienced\na sharp spike in the late 2000s, when it reached values three times higher\nthan the average of the last 20 years.\n\nDespite experiencing economic growth, the country continues to struggle with\nhigh unemployment. Official numbers put the unemployment rate at just over 10\npercent, but international estimates consider it to be closer to 60 percent.\nFurthermore, reliance on diesel-generated electricity and the need to import\nbasic necessities like food and water leave average consumers vulnerable to\nglobal price shocks.\n\nDjibouti's gross domestic product expanded by an average of more than 6\npercent per year, from US$341 million in 1985 to US$3.3 billion in 2019.\n\nLow tax revenue and high spending on public infrastructure has seen Djibouti\nstruggle with its budget deficit. Additionally, the country's public debt has\nincreased sharply—from 50.2 percent of GDP in 2015 to an expected 72.9 percent\nin 2020.",
    "openai_summarised_points": [
      "• Following armed conflict and economic hardship during the 1990s, Djibouti has experienced recent periods of stable economic growth attributed to relative political stability and successful macroeconomic adjustment efforts.",
      "• Fiscal adjustment measures implemented included downsizing the civil service, reforming pension systems to improve financial sustainability, and strengthening public expenditure institutions.",
      "• Between 2003 and 2005, Djibouti's annual real GDP growth averaged 3.1 percent, driven primarily by strong performance in the services sector and high consumption levels.",
      "• GDP growth reached a peak of 7.8 percent in 2019, indicating significant economic expansion in that year.",
      "• In the 21st century, inflation has been maintained at low levels due to the fixed peg of the Djibouti franc to the US dollar; however, inflation experienced a sharp spike in the late 2000s, reaching levels three times higher than the average of the previous 20 years.",
      "• Despite economic growth, Djibouti faces persistent high unemployment, with official figures indicating just over 10 percent, while international estimates suggest unemployment could be as high as 60 percent.",
      "• The country’s reliance on diesel-generated electricity and dependence on importing basic necessities such as food and water make consumers vulnerable to global price shocks.",
      "• Djibouti’s gross domestic product (GDP) increased from US$341 million in 1985 to US$3.3 billion in 2019, representing an average annual growth rate of over 6 percent.",
      "• The country’s budget deficit is exacerbated by low tax revenues coupled with high expenditure on public infrastructure projects.",
      "• Public debt has risen sharply from 50.2 percent of GDP in 2015 to an estimated 72.9 percent in 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:28:52.873136",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1732,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Balance of payments",
    "text": "Djibouti's merchandise trade balance has shown a large deficit. This is due to\nthe country's enormous need for imports and narrow base of exports. Although\nDjibouti runs a substantial surplus in its services balance, the surplus has\nbeen smaller than the deficit in the merchandise trade balance. As a result,\nDjibouti's has developed a high level of trade deficit, reaching a peak of 130\nbillion Djibouti francs in 2019.",
    "openai_summarised_points": [
      "• Djibouti's merchandise trade balance has historically exhibited a significant deficit, reflecting the country's substantial reliance on imports and a limited export base.",
      "• The large trade deficit is primarily attributed to Djibouti's enormous need for imports, which far exceeds its export capacity.",
      "• Despite the trade deficit in merchandise, Djibouti maintains a substantial surplus in its services balance, indicating a strong services sector, likely driven by port services, logistics, and related industries.",
      "• The surplus in the services balance, however, has been smaller than the merchandise trade deficit, resulting in an overall trade imbalance.",
      "• As a consequence of these trade dynamics, Djibouti has developed a high level of trade deficit, which reached a peak of 130 billion Djibouti francs in 2019."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:28:55.393174",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 421,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Regional situation",
    "text": "Positioned on a primary shipping lane between the Gulf of Aden and the Red\nSea, Djibouti holds considerable strategic value in the international trade\nand shipping industries. The facilities of the Port of Djibouti are important\nto sea transportation companies for fuel bunkering and refuelling. Its\ntransport facilities are used by several landlocked African countries for the\nre-export of their goods. Djibouti earns transit taxes and harbour fees from\nthis trade, these form the bulk of government revenue. Threats of pirates\npatrolling the Gulf of Aden, off the coast of Somalia, with the intentions of\ncapturing large cargo ships, oil, and chemical tankers has created the need\nfor larger nations such as the United States, France, and Japan to embed\nlogistics bases or military camps from which they can defend their freight\nfrom piracy.\n\nThe port of Djibouti functions as a small French naval facility, and the\nUnited States has also stationed hundreds of troops in Camp Lemonnier,\nDjibouti, its only African base, in an effort to counter terrorism in the\nregion.\n\nSince 2010 China has become an important trading and military partner for\nDjibouti, including it in its African Road and Belt Initiative through the\nconstruction of infrastructure projects like a railway link to Ethiopia and\nthe Doraleh port. In 2017, it also began operating a large naval base near de\nDoraleh port, which serves as China's first ever overseas military base. In\n2009, China overtook the United States in becoming Djibouti's largest trading\npartner. Between 57 percent and 70 percent of Djibouti's debt is made up of\nChinese loans.\n\nChinese influence in Djibouti, particularly through its military base and\nfinancial debt, has been criticized in recent years as being more beneficial\nto the stability of the current political regime than for the country as a\nwhole.",
    "openai_summarised_points": [
      "• Djibouti is strategically positioned on a primary shipping lane between the Gulf of Aden and the Red Sea, conferring significant strategic importance in international trade and maritime shipping industries.",
      "• The Port of Djibouti plays a crucial role in sea transportation, serving as a key hub for fuel bunkering and refuelling operations for shipping companies.",
      "• Djibouti's transport facilities are utilized by several landlocked African countries for the re-export of their goods, making it an essential logistical hub for the region.",
      "• The country derives the majority of its government revenue from transit taxes and harbour fees collected from maritime trade passing through its port facilities.",
      "• The Gulf of Aden, off the coast of Somalia, poses a piracy threat, with pirates patrolling the area with the intent of capturing large cargo ships, oil tankers, and chemical tankers, thereby increasing security concerns.",
      "• To counter piracy threats, larger nations such as the United States, France, and Japan have established logistics bases or military camps in Djibouti to defend their freight and ensure maritime security.",
      "• The port of Djibouti functions as a small French naval facility, reflecting historical military ties.",
      "• The United States has stationed hundreds of troops at Camp Lemonnier in Djibouti, which is its only military base in Africa, primarily to counter terrorism in the region.",
      "• Since 2010, China has emerged as an important trading and military partner for Djibouti, integrating into its infrastructure development through the African Road and Belt Initiative.",
      "• China has constructed significant infrastructure projects in Djibouti, including a railway link to Ethiopia and the Doraleh port, enhancing regional connectivity.",
      "• In 2017, China began operating a large naval base near the Doraleh port, marking its first overseas military base, which signifies a strategic military presence in the region.",
      "• In 2009, China surpassed the United States to become Djibouti's largest trading partner, indicating a shift in economic influence.",
      "• Approximately 57 percent to 70 percent of Djibouti's national debt is composed of Chinese loans, highlighting the extent of Chinese financial influence.",
      "• Chinese influence in Djibouti, particularly through its military base and extensive debt, has faced criticism, with concerns that it benefits the stability of the current political regime more than the country's broader interests."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:29:01.879410",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1853,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Macro-economic trend",
    "text": "The following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Governmentdebt\n(Pct. of GDP)\n---|---|---|---|---|---|---\n2000  | 1.73  | 3,354  | 0.8  | 0.7%  | 1.2%  | –\n2005  | 2.22  | 3,357  | 1.0  | 3.1%  | 3.3%  | –\n2010  | 3.02  | 3,604  | 1.5  | 4.1%  | 2.5%  | 27%\n2015  | 4.20  | 4,275  | 2.4  | 7.7%  | -0.8%  | 38%\n2016  | 4.39  | 4,446  | 2.6  | 6.9%  | 2.7%  | 43%\n2017  | 4.64  | 4,545  | 2.8  | 5.1%  | 0.5%  | 46%\n2018  | 5.15  | 4,796  | 2.9  | 8.5%  | 0.1%  | 46%\n2019  | 5.64  | 5,016  | 3.1  | 7.5%  | 3.3%  | 38%\n2020  | 5.65  | 4,830  | 3.2  | 1%  | 2.9%  | 41%\n2021  | 6.04  | 4,934  | 3.4  | 5%  | 2.4%  | 40%"
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Impact of COVID-19",
    "text": "Despite not being hit as hard as other countries by the COVID-19 pandemic,\nDjibouti's economy suffered the effects of the global slowdown in trade and\ndiminished traffic through the Doraleh port. Real GDP growth slumped to 1.4\npercent in 2020 from 7.8 percent in 2019. The pandemic also contributed to a\nsharp deceleration in investment, which increased by just 10.3 percent of GDP\nin 2020, compared to a 26.3 percent growth in 2019, as well as in the value\nadded by the services sector, which saw a modest 2 percent increase in 2020,\nafter growing by 8.2 percent in 2019.\n\nDjibouti's recovery projections are closely tied to the timeframe in which\nglobal shipping and trade will return to pre-pandemic levels, with a full\nrecovery expected to happen in the following couple of years, if the COVID-19\npandemic does not last beyond the second half of 2021."
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Background",
    "text": "European Quarter, Djibouti City\n\nDjibouti's economy is based on service activities connected with the country's\nstrategic location and status as a free trade zone in the Horn of Africa. Two-\nthirds of inhabitants live in the capital and the remainder of the populace is\nmostly nomadic herders. Low amounts of rainfall limit crop production to\nfruits and vegetables, and requiring most food to be imported. The government\nprovides services as both a transit port for the region and an international\ntransshipment and refueling centre. Djibouti has few natural resources and\nlittle industry. All of these factors contribute to its heavy dependence on\nforeign assistance to help support its balance of payments and to finance\ndevelopment projects.\n\nAn unemployment rate of 60 percent continues to be a major problem. Inflation\nis not a concern, however, because of the fixed tie of the franc to the US\ndollar. Per capita consumption dropped an estimated 35 percent over the last\nseven years because of recession, civil war, and a high population growth\nrate. Faced with a multitude of economic difficulties, the government has\nfallen in arrears on long-term external debt and has been struggling to meet\nthe stipulations of foreign aid donors.\n\nThe Djiboutian franc is pegged to the US dollars since 1949 through the use of\na currency board. The effectiveness of this longstanding and unique\ninstitution on the African continent has not been challenged since then.\n\nAccording to a financial risk assessment from 2018, the country has been\nsuffering from increasing corruption and a decline in international governance\nand transparency indices, growing debt and over-reliance on Ethiopia and China\nfor trade and FDI, respectively."
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Openness to foreign investment",
    "text": "Officially, the government of Djibouti welcomes all foreign direct investment.\nDjibouti's assets include a strategic geographic location, an open trade\nregime, a stable currency, substantial tax breaks and other incentives.\nPotential areas of investment include Djibouti's port and the\ntelecommunications sectors. President Ismail Omar Guellehh first elected in\n1999, has named privatization, economic reform, and increased foreign\ninvestment as top priorities for his government. The president pledged to seek\nthe help of the international private sector to develop the country's\ninfrastructure.[_citation needed_]\n\nDjibouti has no major laws that would discourage incoming foreign investment.\nIn principle there is no screening of investment or other discriminatory\nmechanisms. However, a number of hurdles to foreign investment in the country\nexist. For example, certain sectors, most notably public utilities, are state\nowned and some parts are not currently open to investors. In 2017, a law was\npassed granting the government the right to unilaterally alter or terminate\ncontracts with foreign entities. Conditions of the structural adjustment\nagreement recently signed by Djibouti and the International Monetary Fund\nstipulate increased privatization of parastatal and government-owned\nmonopolies. There are no patent laws in Djibouti.\n\nFurthermore, there are concerns about the rule of law, the independence of\ncourts, and how this affects the protection of investments in the country. A\nFreedom House report, for example, mentions the case of Dubai-based port\noperator DP World which has been embroiled in a legal battle with Djibouti\nsince 2012, \"when Djibouti sold part of its concession in the Doraleh\nContainer Terminal to a Chinese state-owned competitor of DP World, the\noriginal concession partner.\"\n\nIn 2018, Djibouti seized DP World's port assets, but ruling the\nnationalization illegal, the London Court of International Arbitration in 2019\nordered Djibouti to restore the rights and benefits of the concession to DP\nWorld. The country subsequently rejected the ruling and asked the Djibouti\nhigh court to unilaterally nullify the LCIA decision.\n\nA Santander report concluded that despite its strategic importance, FDI into\nDjibouti is hampered by \"mediocre governance, corruption, the lack of a sound\njudicial framework, an unstable regional geopolitical situation, a poorly\ndiversified economy with little resilience to outside shocks, and a fragile\necosystem prone to environmental crisis.\"\n\nAs in most African nations, access to licenses and approvals is complicated\nnot so much by law as by administrative procedures. In Djibouti, the\nadministrative process has been characterized as a form of 'circular\ndependency.' For example, the finance ministry will issue a license only if an\ninvestor possesses an approved investor visa, while the interior ministry will\nonly issue an investor visa to a licensed business. The Djiboutian government\nis increasingly realizing the importance of establishing a one-stop shop to\nfacilitate the investment process."
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Gender",
    "text": "In May 2015 Choukri Djibah, Director of Gender in the Department of Women and\nFamily, launched the project SIHA (Strategic Initiative for the Horn of\nAfrica) designed to support and reinforce the economic capacity of women in\nDjibouti, funded with a grant from the European Union of 28 Million Djibouti\nfrancs."
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Trade",
    "text": "A Saba Islamic Bank branch in Djibouti City\n\nPrincipal exports from the region transiting Djibouti are coffee, salt, hides,\ndried beans, cereals, other agricultural products, chalk, and wax. Djibouti\nitself has few exports, and the majority of its imports come from France. Most\nimports are consumed in Djibouti and the remainder goes to Ethiopia and\nSomalia. Djibouti's unfavorable balance of trade is offset partially by\ninvisible earnings such as transit taxes and harbor dues. In 1999, U.S.\nexports to Djibouti totalled $26.7 million while U.S. imports from Djibouti\nwere less than $1 million. The City of Djibouti has the only paved airport in\nthe republic."
  },
  {
    "chapter_name": "Economy of Djibouti",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Tourism",
    "text": "In 2013, 63,000 foreign tourists visited Djibouti, Djibouti City is the\nprincipal tourist destination for visitors, revenues from tourism fell just\nUS$43 million in 2013.[_citation needed_]"
  }
]