[
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of New Zealand** is a highly developed free-market economy. It\nis the 52nd-largest national economy in the world when measured by nominal\ngross domestic product (GDP) and the 63rd-largest in the world when measured\nby purchasing power parity (PPP). New Zealand has one of the most globalised\neconomies and depends greatly on international trade, mainly with China,\nAustralia, the European Union, the United States, Japan and Korea. New\nZealand's 1983 Closer Economic Relations agreement with Australia means that\nthe economy aligns closely with that of Australia. Among OECD nations, New\nZealand has a highly efficient and strong social security system; social\nexpenditure stood at roughly 19.4% of GDP.\n\nEconomy of New Zealand by sector and organisation type\n\nNew Zealand's diverse economy is made up of various types of informal and\nformal organisations, divided between the public and private sectors. It has a\nsizeable service sector, accounting for 73% of all GDP activity as of\n2024[update]. As a large island nation New Zealand has abundant natural\nresources and mineral wealth. Prominent manufacturing industries include\naluminium production, food processing, metal fabrication, wood and paper\nproducts. Goods-producing industries accounted for 20% of GDP as of\n2024[update]. The primary sector continues to dominate New Zealand's exports,\ndespite accounting for only 7% of GDP as of 2024[update]. The information\ntechnology sector is growing rapidly.\n\nThe major capital market is the New Zealand Exchange (NZX). As of February\n2023[update], NZX had a total of 338 listed securities, equity, debt and funds\nwith a combined market capitalisation of NZD $226 billion. New Zealand's\ncurrency, the New Zealand dollar, also circulates in four Pacific Island\nterritories. The New Zealand dollar is the 10th-most traded currency in the\nworld.",
    "openai_summarised_points": [
      "• The economy of New Zealand is characterized as a highly developed free-market economy.",
      "• It ranks as the 52nd-largest national economy globally by nominal gross domestic product (GDP).",
      "• When measured by purchasing power parity (PPP), New Zealand is the 63rd-largest economy in the world.",
      "• New Zealand possesses one of the most globalised economies worldwide, with a significant dependence on international trade.",
      "• The country's main trading partners include China, Australia, the European Union, the United States, Japan, and Korea.",
      "• The 1983 Closer Economic Relations agreement with Australia aligns New Zealand’s economy closely with that of Australia.",
      "• Among OECD nations, New Zealand maintains a highly efficient and strong social security system, with social expenditure at approximately 19.4% of GDP.",
      "• New Zealand’s economy comprises a diverse range of informal and formal organisations, divided between public and private sectors.",
      "• The service sector is the largest component of the economy, accounting for 73% of all GDP activity as of 2024.",
      "• As a large island nation, New Zealand benefits from abundant natural resources and mineral wealth.",
      "• Key manufacturing industries include aluminium production, food processing, metal fabrication, and wood and paper products.",
      "• Goods-producing industries represent 20% of GDP as of 2024.",
      "• Despite constituting only 7% of GDP as of 2024, the primary sector remains dominant in New Zealand’s export profile.",
      "• The information technology sector in New Zealand is experiencing rapid growth.",
      "• The major capital market in New Zealand is the New Zealand Exchange (NZX).",
      "• As of February 2023, the NZX listed a total of 338 securities, including equity, debt, and funds, with a combined market capitalisation of NZD $226 billion.",
      "• The New Zealand dollar circulates not only within New Zealand but also in four Pacific Island territories.",
      "• Globally, the New Zealand dollar ranks as the 10th-most traded currency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:03:34.849773",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1857,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Agriculture (especially dairy farming – such as for the Fonterra plant shown)\nis a major export earner An aerial view of the Kinleith Mill. Forestry exports\nare an important component of New Zealand's economy.\n\nFor many years New Zealand's economy was built on a narrow range of\nagricultural products, such as wool, meat and dairy. These products became New\nZealand's staple and most valuable exports, underpinning the success of the\neconomy, from the 1850s until the 1970s. For example, from 1920 to the late\n1930s, the dairy export quota was usually around 35% of New Zealand's total\nexports, and in some years made up almost 45%. Due to the high demand for\nthese primary products, manifested by the New Zealand wool boom of 1951, New\nZealand had one of the highest standards of living in the world for 70 years.\n\nIn the 1960s, prices for these traditional exports declined, and in 1973 New\nZealand lost its preferential trading position with the United Kingdom when\nthe latter joined the European Economic Community. Partly as a result, from\n1970 to 1990, the relative New Zealand GDP per capita adjusted for purchasing\npower declined from about 115% of the OECD average to 80%.\n\nBetween 1984 and 1993, New Zealand changed from a somewhat closed and\ncentrally controlled economy to one of the most open economies in the OECD. In\na process often referred to in New Zealand as Rogernomics, successive\ngovernments introduced policies which dramatically liberalised the economy.\n\nIn 2005, the World Bank praised New Zealand as the most business-friendly\ncountry in the world. The economy diversified and by 2008, tourism had become\nthe single biggest generator of foreign exchange.",
    "openai_summarised_points": [
      "• Agriculture, particularly dairy farming exemplified by facilities such as the Fonterra plant, is a major export earner for New Zealand, with forestry exports also constituting an important component of the national economy, as illustrated by the Kinleith Mill.",
      "• From the 1850s until the 1970s, New Zealand's economy was predominantly based on a narrow range of agricultural products, including wool, meat, and dairy, which served as the country's staple and most valuable exports, fundamentally supporting economic success.",
      "• Between 1920 and the late 1930s, dairy exports typically accounted for around 35% of New Zealand’s total exports, reaching nearly 45% in certain years, highlighting the sector’s significant contribution to the economy.",
      "• The high global demand for primary products, notably demonstrated by the New Zealand wool boom of 1951, contributed to New Zealand maintaining one of the highest standards of living worldwide for approximately 70 years.",
      "• In the 1960s, prices for traditional agricultural exports declined, and in 1973 New Zealand lost its preferential trading relationship with the United Kingdom following the UK’s accession to the European Economic Community, adversely affecting export markets.",
      "• As a consequence of these trade changes and other factors, New Zealand’s GDP per capita relative to the OECD average, adjusted for purchasing power, declined from about 115% in 1970 to 80% by 1990.",
      "• From 1984 to 1993, New Zealand underwent significant economic reforms, transitioning from a relatively closed and centrally controlled economy to one of the most open economies within the OECD, through a series of liberalization policies collectively known as Rogernomics.",
      "• Successive New Zealand governments during this period implemented policies that dramatically liberalized the economy, fostering increased openness and competitiveness in global markets.",
      "• By 2005, the World Bank recognized New Zealand as the most business-friendly country in the world, reflecting the success of its economic reforms and regulatory environment.",
      "• Economic diversification continued, and by 2008 tourism had emerged as the single largest generator of foreign exchange for New Zealand, marking a shift from traditional agricultural export dependence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:03:43.758832",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1680,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Early years",
    "text": "Prior to European settlement and colonisation of New Zealand, Māori had a\nsubsistence economy, the basic economic unit of which was the sub-tribe or\nhapū in which labour was divided. From the 1790s, the waters around New\nZealand were visited by British, French and American whaling, sealing and\ntrading ships. Their crews traded European goods, including guns and metal\ntools, for Māori food, water, wood, flax and sex. Their increasing lawlessness\nand plans for formal settlement by the New Zealand Company were two of the\ndrivers behind the signing of the Treaty of Waitangi in 1840, which\nestablished New Zealand as a colony. Settlers continued to be dependent on\nMāori for food until the 1860s. From then immigrants became self-sufficient in\nfarming, and started quarrying a variety of minerals including gold, which was\ndiscovered at Gabriel's Gully in Central Otago, leading to the Otago gold rush\nin 1861. Settlements flourished in areas where these quarries were\nestablished. In the 1880s, Dunedin became the richest city in the country\nlargely on the back of investments from the gold rush.\n\nSheep farming began in the Wairarapa but soon spread up and down the east\ncoast from Southland to the East Cape once rudimentary roads and transport\nbecame available. Much of the land used for farming was taken or leased from\nMāori. Sheep numbers grew quickly and by the mid-1850s, there were already a\nmillion sheep in New Zealand; by the early 1870s, there were 10 million. Wool\nbecame the first staple export, initially exported from the Wellington\nsettlement in the late 1850s, although unrefrigerated meat and dairy products\nwere exported as far as Australia.\n\nIn the 1870s, Julius Vogel was periodically both colonial treasurer and\npremier. He viewed New Zealand as a \"Britain of the South Seas\" and began the\ndevelopment of infrastructure in New Zealand investing heavily in roads,\nrailways, telegraphs and bridges funded by public borrowing. Progress slowed\nafter the collapse of the City of Glasgow Bank in 1878 which led to a\ncontraction in credit from London, the centre of the world's financial system\nat the time. Economic activity was depressed for some years afterwards, until\nrefrigeration was introduced in 1882. This enabled New Zealand to start\nexporting meat and other frozen products to the United Kingdom. Refrigeration\ntransformed and shaped the development of the economy but, in the process,\nestablished New Zealand's economic dependence on Britain.\n\nThe success of refrigeration was directly related to the growth and\ndevelopment of farming in the country. In the 19th century, the bulk of\neconomic activity was in the South Island of New Zealand. From around 1900,\ndairy farming became increasingly viable in areas which were less suitable for\nsheep, particularly in Northland, the Waikato and Taranaki. As dairying\ndeveloped, the North Island slowly became more important to the economy.\nBritain became the sole market for meat and animal products in New Zealand,\nowing to the increase in its land cultivation and farming. The dairy farming\ncan therefore be seen as a response to the powerful market demands in Europe,\ntransforming not only New Zealand's countryside, economy and production\ntechniques, but also causing migration in order to create the needed supply of\ndairy farming.",
    "openai_summarised_points": [
      "• Prior to European settlement and colonisation, Māori maintained a subsistence economy organized around the sub-tribe or hapū, within which labour was divided to meet basic needs.",
      "• From the 1790s, British, French, and American whaling, sealing, and trading ships frequented New Zealand waters, exchanging European goods such as guns and metal tools for Māori food, water, wood, flax, and sexual services.",
      "• The increasing lawlessness of these foreign crews and the New Zealand Company’s plans for formal settlement were significant factors leading to the signing of the Treaty of Waitangi in 1840, which established New Zealand as a British colony.",
      "• European settlers remained dependent on Māori for food supplies until the 1860s, after which immigrants became self-sufficient through farming and began exploiting mineral resources, including gold.",
      "• Gold was discovered at Gabriel's Gully in Central Otago, sparking the Otago gold rush in 1861, which led to the flourishing of settlements around mining areas.",
      "• By the 1880s, Dunedin had become the wealthiest city in New Zealand, largely due to investments and economic activity generated by the gold rush.",
      "• Sheep farming originated in the Wairarapa region and rapidly expanded along the east coast from Southland to the East Cape as rudimentary roads and transport infrastructure developed.",
      "• Much of the farmland used for sheep farming was either taken from or leased from Māori landowners.",
      "• Sheep numbers in New Zealand grew rapidly, reaching one million by the mid-1850s and escalating to 10 million by the early 1870s.",
      "• Wool emerged as New Zealand’s first staple export, initially shipped from the Wellington settlement in the late 1850s; unrefrigerated meat and dairy products were also exported, primarily to Australia.",
      "• In the 1870s, Julius Vogel served intermittently as both colonial treasurer and premier, envisioning New Zealand as a \"Britain of the South Seas\" and initiating extensive infrastructure development including roads, railways, telegraphs, and bridges.",
      "• Vogel’s infrastructure projects were heavily funded through public borrowing, but progress slowed significantly after the 1878 collapse of the City of Glasgow Bank, which caused a contraction of credit from London, the global financial center at the time.",
      "• Economic activity remained depressed for several years until the introduction of refrigeration technology in 1882, which enabled New Zealand to export frozen meat and other products to the United Kingdom.",
      "• The advent of refrigeration fundamentally transformed New Zealand’s economy, establishing a strong economic dependence on Britain as the primary export market.",
      "• The success of refrigeration was closely linked to the growth and development of farming, which dominated economic activity in the 19th century, particularly in the South Island.",
      "• Around 1900, dairy farming became increasingly viable in North Island regions less suited to sheep farming, including Northland, the Waikato, and Taranaki, leading to the gradual economic ascendancy of the North Island.",
      "• Britain became the exclusive market for New Zealand’s meat and animal products, driven by increased land cultivation and farming activities.",
      "• The expansion of dairy farming was a direct response to strong market demand from Europe, which not only transformed New Zealand’s rural landscape and agricultural production techniques but also influenced migration patterns to supply labor for the dairy industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:03:58.306307",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3313,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "20th century",
    "text": "The Reserve Bank of New Zealand was established as New Zealand's central bank\non 1 August 1934. Up until that time New Zealand's monetary policy had been\nset in the United Kingdom, and the New Zealand Pound was issued by private\nbanks. A separate central bank gave New Zealand's government control of\nmonetary policy for the first time, although New Zealand remained part of the\nsterling area by pegging its pound to the British pound sterling until the\nintroduction of the New Zealand dollar in 1967, after which the dollar was\ninstead pegged to the United States dollar, before being floated in 1985.\n\nBy the mid-20th century, pastoral-farming products made up more than 90% of\nNew Zealand's exports, 65% of which was going to Britain in the 1950s. As a\nformer colony, the United Kingdom provided New Zealand with preferential trade\nquotas. This also enabled New Zealand to impose high tariffs on imported goods\nfrom other countries. Tough import controls gave local manufacturers the\nability to produce similar products locally, broaden the base of jobs\navailable in New Zealand and still compete against higher priced imports.\n\nThis prosperity continued up to 1955 at which point Britain started phasing\nout preferential quotas. From then on, what New Zealand received was dictated\nby the free market. As a result, during the 1950s and 1960s the country's\nstandard of living began to slip as the export sector was no longer able to\npay for the level of imported goods required to meet the country's growing\nconsumerism.\n\nTiwai Point Aluminium Smelter, opened in 1971\n\nBritain applied to join the European Economic Community (EEC) in 1961, but was\nvetoed by the French. The government of Keith Holyoake reacted by attempting\nto diversify New Zealand's export markets, signing the first free trade\nagreement (Australia New Zealand Free Trade Agreement) in 1965, and opening\nnew diplomatic posts in Hong Kong, Jakarta, Saigon, Los Angeles and San\nFrancisco. Britain applied again to join the EEC in 1967, and entered into\nnegotiations for membership in 1970. Holyoake's deputy and successor, Jack\nMarshall, (briefly Prime Minister in 1972) negotiated continued access for New\nZealand exports to the United Kingdom under the so-called \"Luxembourg\nAgreement\".\n\nBritain gained full membership of the EEC on 1 January 1973, and all trade\nagreements with New Zealand came to an end, except the Luxembourg Agreement.\nBy the end of that year, only 26.8% of New Zealand's exports were to Britain.\nThis had a significant effect on the standard of living. In 1953, New Zealand\nhad the third highest standard in the world. By 1978, it had dropped to 22nd\nplace.\n\nHaving lost unrestricted access to its traditional market, New Zealand\ncontinued to search for alternative export markets and diversify its economy.\nThe Government of Norman Kirk, who succeeded Marshall, put greater emphasis on\nexpanding New Zealand's trade, especially with South East Asia. Following the\nYom Kippur War in October 1973, an oil embargo was put in place by the Middle\nEastern oil exporters, leading to the 1973 oil crisis. This compounded New\nZealand's dire economic situation further. Inflation greatly increased as the\ncost of transport and imported goods soared, causing standards of living to\ndecline.",
    "openai_summarised_points": [
      "• The Reserve Bank of New Zealand was established on 1 August 1934 as New Zealand's central bank, marking the first time the New Zealand government had control over its monetary policy, which had previously been set in the United Kingdom with the New Zealand Pound issued by private banks.",
      "• Despite establishing its own central bank, New Zealand remained part of the sterling area by pegging its pound to the British pound sterling until 1967, when the New Zealand dollar was introduced and initially pegged to the United States dollar before being floated in 1985.",
      "• By the mid-20th century, pastoral-farming products accounted for more than 90% of New Zealand’s exports, with 65% of these exports going to Britain during the 1950s, benefiting from preferential trade quotas as a former British colony.",
      "• The preferential trade quotas from the United Kingdom allowed New Zealand to impose high tariffs on imports from other countries, enabling local manufacturers to produce similar goods domestically, thereby broadening employment opportunities and allowing competition against higher-priced imports.",
      "• This period of economic prosperity continued until 1955, when Britain began phasing out preferential quotas, transitioning New Zealand’s export market access to free market conditions, which led to a decline in New Zealand’s standard of living during the 1950s and 1960s due to the export sector’s inability to finance the growing demand for imported consumer goods.",
      "• The Tiwai Point Aluminium Smelter was opened in 1971, representing a significant industrial development in New Zealand’s economy.",
      "• Britain’s initial application to join the European Economic Community (EEC) in 1961 was vetoed by France, prompting New Zealand’s government under Prime Minister Keith Holyoake to diversify export markets by signing the Australia New Zealand Free Trade Agreement in 1965 and establishing new diplomatic posts in Hong Kong, Jakarta, Saigon, Los Angeles, and San Francisco.",
      "• Britain reapplied for EEC membership in 1967 and entered negotiations in 1970; during this period, Holyoake’s deputy and successor, Jack Marshall (Prime Minister briefly in 1972), negotiated continued access for New Zealand exports to the UK through the \"Luxembourg Agreement.\"",
      "• Britain gained full membership of the EEC on 1 January 1973, terminating all trade agreements with New Zealand except the Luxembourg Agreement, resulting in a sharp decline of New Zealand exports to Britain to 26.8% by the end of 1973.",
      "• The loss of unrestricted access to the British market had a significant negative impact on New Zealand’s standard of living, which had ranked third highest globally in 1953 but fell to 22nd place by 1978.",
      "• In response to the loss of its traditional export market, New Zealand sought to diversify its economy and export markets, with the government of Norman Kirk placing greater emphasis on expanding trade with South East Asia.",
      "• The 1973 oil crisis, triggered by the Yom Kippur War and the subsequent oil embargo by Middle Eastern oil exporters, exacerbated New Zealand’s economic difficulties by causing inflation to rise sharply due to increased costs of transport and imported goods, further reducing the standard of living."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:04:04.138756",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3274,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.2.1",
    "section_name": "Think Big",
    "text": "Following the 1979 energy crisis resulting from the Iranian Revolution of that\nyear, Robert Muldoon, the prime minister between 1975 and 1984, instituted an\neconomic strategy known as Think Big. Large scale industrial plants were\nestablished based on New Zealand's abundant natural gas. A new range of\nproducts for export such as ammonia, urea fertilizer, methanol and petrol were\nproduced and with greater use of electricity (with the electrification of the\nNorth Island Main Trunk railway) with the goal that this would reduce New\nZealand's dependence on oil imports.\n\nOther projects included the Clyde Dam on the Clutha River, which was built to\nmeet a growing demand for electricity, and the expansion of the New Zealand\nSteel plant at Glenbrook.\n\nThe Tiwai Point Aluminium Smelter, which opened in 1971, was also upgraded as\npart of the Think Big strategy and now brings in approximately NZ$1 billion in\nexports every year.\n\nMost of these projects turned out to be ill-timed as they came on line at the\nsame time as oil prices dropped during the 1980s oil glut. The price of crude\nwent from more than US$90 a barrel in 1980, to about US$30 a few years later.\nBecause these Think Big projects required massive borrowing to get started,\npublic debt soared from $4.2 billion in 1975 when Muldoon became prime\nminister to $21.9 billion when he left office nine years later. Inflation\nremained rampant, averaging 11% in the 1980s. Once Labour came to power in\n1984, many of these projects were sold to private industry as part of a wider\nsale of state-assets.\n\nThe Muldoon Government did, however, make some moves towards deregulation. For\nexample, in 1982 it removed the transport licensing restrictions on road\ncarriers carting goods more than 150 km, and turned the Railways Department\ninto a statutory corporation.",
    "openai_summarised_points": [
      "• Following the 1979 energy crisis caused by the Iranian Revolution, Robert Muldoon, who served as New Zealand's prime minister from 1975 to 1984, implemented an economic strategy known as Think Big.",
      "• Think Big involved establishing large-scale industrial plants utilizing New Zealand's abundant natural gas resources to produce a new range of export products including ammonia, urea fertilizer, methanol, and petrol.",
      "• The strategy also emphasized increased electricity use, exemplified by the electrification of the North Island Main Trunk railway, aiming to reduce New Zealand's reliance on imported oil.",
      "• Key infrastructure projects under Think Big included the construction of the Clyde Dam on the Clutha River to meet rising electricity demand and the expansion of the New Zealand Steel plant located at Glenbrook.",
      "• The Tiwai Point Aluminium Smelter, originally opened in 1971, was upgraded as part of the Think Big initiative and currently generates approximately NZ$1 billion in exports annually.",
      "• Many Think Big projects were poorly timed, coming online during the 1980s oil glut when crude oil prices plummeted from over US$90 per barrel in 1980 to about US$30 a few years later, undermining their economic rationale.",
      "• The initiation of these projects required substantial borrowing, causing New Zealand’s public debt to escalate from $4.2 billion in 1975, when Muldoon became prime minister, to $21.9 billion by the end of his tenure in 1984.",
      "• Inflation remained high throughout the 1980s, averaging 11%, exacerbating economic challenges during the Think Big period.",
      "• After the Labour Party assumed power in 1984, many Think Big projects were privatized as part of a broader program of state asset sales.",
      "• Despite the overall interventionist approach, the Muldoon Government introduced some deregulatory measures, such as removing transport licensing restrictions in 1982 for road carriers transporting goods over distances greater than 150 km.",
      "• Additionally, the Railways Department was transformed into a statutory corporation during this period, marking a step towards deregulation within the transport sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:04:11.820566",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1818,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.2.2",
    "section_name": "Rogernomics",
    "text": "> Between 1984 and 1993, New Zealand underwent radical economic reform, moving\n> from what had probably been the most protected, regulated and state-\n> dominated system of any capitalist democracy to an extreme position at the\n> open, competitive, free-market end of the spectrum.\n\nThe Fourth Labour government, elected in July 1984, moved away from government\nintervention in the economy and allowed free market mechanisms to dominate.\nThese reforms became known as \"Rogernomics\", named after minister of finance\nfrom 1984 to 1988, Roger Douglas. The changes included making the Reserve Bank\nindependent of political decisions; performance contracts for senior civil\nservants; public sector finance reform based on accrual accounting; tax\nneutrality; subsidy-free agriculture; and industry-neutral competition\nregulation. Government subsidies including agricultural subsidies were\neliminated; import regulations were loosened up; the exchange rate was\nfloated; and controls on interest rates, wages, and prices were removed; and\npersonal rates of taxation were reduced. Tight monetary policy and major\nefforts to reduce the government budget deficit brought the inflation rate\ndown from an annual rate of more than 18% in 1987. The deregulation of\ngovernment-owned enterprises in the 1980s and 1990s reduced government's role\nin the economy and permitted the retirement of some public debt.\n\nNew Zealand Dollar / Australian Dollar exchange rate\n\nNZD / USD exchange rate\n\nThe new Government was faced with an exchange rate crisis the day after it was\nelected. Speculators expected the change of government to result in a 20%\ndevaluation of the New Zealand dollar, which led to the 1984 New Zealand\nconstitutional crisis due to Muldoon's refusal to devalue, worsening the\ncurrency crisis further. As a result, the dollar was floated on 4 March 1985,\nallowing for the value of the dollar to change with the market. Prior to the\ndollar being floated, the dollar was pegged against a basket of currencies.\n\nFinancial markets were deregulated and tariffs on imported goods lowered and\nphased out. At the same time subsidies to many industries, notably\nagriculture, were removed or significantly reduced. Income and company taxes\nwere reduced and the top marginal tax rate was reduced from 66% to 33%. These\nwere replaced by a comprehensive tax on goods and services (GST) initially set\nat 10%, then increased to 12.5% in 1989 and to 15% in 2010. A surtax on\nuniversal superannuation was also introduced. Many government departments were\ncorporatised, and from 1 April 1987 became State owned enterprises, required\nto make a profit. The new corporations shed thousands of jobs adding to\nunemployment; Electricity Corporation 3,000; Coal Corporation 4,000; Forestry\nCorporation 5,000; New Zealand Post 8,000.\n\nThe wage and price freeze of the early eighties coupled with the removal of\nfinancial restrictions and a lack of investment opportunities, led to a\nspeculative bubble on New Zealand's sharemarket, sharemarket crash of 1987, in\nwhich New Zealand's sharemarket shed 60% from its 1987 peak, and taking\nseveral years to recover.\n\nNew Zealand money supply and inflation\n\nM3 money supply increases\n\nHousing inflation\n\nConsumer price index\n\nInflation continued to be a major problem afflicting the New Zealand economy.\nBetween 1985 and 1992, inflation averaged 9% per year and the economy was in\nrecession. The unemployment rate rose from 3.6% to 11%, New Zealand's credit\nrating dropped twice, and foreign debt quadrupled. In 1989 the Reserve Bank\nAct 1989 was passed, creating strict monetary policy under the sole control of\nthe Reserve Bank Governor. From then on the Reserve Bank focused on keeping\ninflation low and stable, using the Official Cash Rate (OCR) – the price of\nborrowing money in New Zealand – as its primary means to do so. As a result,\ninflation rates fell to an average of 2.5% in the 1990s, compared to 12% in\nthe 1970s. However, the tightening of monetary policy contributed to rising\nunemployment in the early 1990s.\n\nThe Labour Party was greatly divided over Rogernomics, especially following\nthe 1987 sharemarket crash and its effect on the economy, which slumped along\nwith the rest of the world into recession in the early 1990s. The National\nParty was returned to power at the 1990 general election and Ruth Richardson\nbecame minister of finance under Prime Minister Jim Bolger. The new Government\nwas again thrown a major economic challenge, with the then state-owned Bank of\nNew Zealand needing a bail-out to stay operational.\n\nRichardson's first budget in 1991, nicknamed the 'Mother of all Budgets',\nattempted to address constant fiscal deficits and borrowing by cutting state\nspending. Unemployment and social welfare benefits were cut and 'market rents'\nwere introduced for state houses – in some cases tripling the rents of low-\nincome people. Richardson also introduced user-pays requirements in hospitals\nand schools. These reforms became known derisively as Ruthanasia.\n\nBy this time, New Zealand's economy faced serious social problems; the number\nof New Zealanders estimated to be living in poverty grew by at least 35%\nbetween 1989 and 1992; and the economic benefits of privatisation have been\nquestioned. Gross domestic product per capita stagnated between 1986–87 and\n1993–94, and by March 1992 unemployment rose to 11.1% Between 1985 and 1992,\nNew Zealand's economy grew by 4.7% during the same period in which the average\nOECD nation grew by 28.2%. From 1984 to 1993 inflation averaged 9% per year,\nNew Zealand's credit rating dropped twice, and foreign debt quadrupled.\nBetween 1986 and 1993, the unemployment rate rose from 3.6% to 11%.\n\nSince the deregulation of the postal sector, different postal operators can\ninstall mail collection boxes in New Zealand's streets\n\nDeregulation also created a business-friendly regulatory framework which has\nbenefited those able to take advantage of it. A 2008 survey in The Heritage\nFoundation and _The Wall Street Journal_ ranked New Zealand 99.9% in \"Business\nfreedom\", and 80% overall in \"Economic freedom\", noting that it takes, on\naverage, only 12 days to establish a business in New Zealand, compared with a\nworldwide average of 43 days.\n\nDeregulation has also been blamed for other significant negative effects. One\nof these was the leaky homes crisis, whereby the loosening up of building\nstandards (in the expectation that market forces would assure quality) led to\nmany thousands of severely deficient buildings, mostly residential homes and\napartments, being constructed over a period of a decade. The costs of fixing\nthe damage has been estimated at over NZ$11 billion (as at 2009[update])."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "21st century",
    "text": "New Zealand gross domestic product and net international debt\n\nUnemployment continued to fall from 1993 to 1994 fiscal year, until the onset\nof the 1997 Asian financial crisis again pushed the rate higher. By 2016 the\nunemployment rate decreased to 5.3 percent, the lowest level in 7 years.\n\nBetween 2000 and 2007, the New Zealand economy expanded by an average of 3.5%\na year driven primarily by private consumption and the buoyant housing market.\nDuring this period, inflation averaged only 2.6% a year, within the Reserve\nBank's target range of 1% to 3%. However, in early 2008 the economy entered\nrecession, before the effects of the Great Recession set in later that year. A\ndrought over the 2007/08 summer led to lower production of dairy products in\nthe first half of 2008. Domestic activity slowed sharply over 2008 as high\nfuel and food prices dampened domestic consumption, while high interest rates\nand falling house prices drove a rapid decline in residential investment.\n\nAround the world instability was developing in the finance sector. This\nreached a peak in September 2008 when the bankruptcy of Lehman Brothers\nsparked the 2008 financial crisis."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.3.1",
    "section_name": "Finance company collapses (2006–2012)",
    "text": "New Zealand bonds\nInverted yield curve in 1994–1998 and 2004–2008\n\n20 year\n\n10 year\n\n2 year\n\n3 month\n\n1 month\n\nDuring the 2008 financial crisis, business and consumer confidence in New\nZealand plummeted as dozens of finance companies collapsed. To try and stop a\nflight of funds from New Zealand institutions to those in Australia, the\nGovernment established the Crown Retail Deposit Guarantee Scheme to cover\ndepositors funds in the event that a bank or finance company went broke. This\nprotected some investors but nevertheless, at least 67 finance companies\ncollapsed within a short period of time. The largest of these was South\nCanterbury Finance which cost taxpayers NZ$1.58 billion when the company\ncollapsed in August 2010. The directors of many of these finance companies\nwere subsequently investigated for fraud and some high-profile directors went\nto prison.\n\nIn an attempt to stimulate the economy, the Reserve Bank lowered the Official\nCash Rate (OCR) from a high of 8.25% (July 2008) to an all-time low of 2.5% at\nthe end of April 2009.\n\nFortunately for New Zealand, the recession was relatively shallow compared to\nmany other nations in the OECD, it was sixth least affected out of the 34\nmember nations with negative real GDP growth totalling 3.5%. In 2009 the\neconomy picked up, led by strong demand from major trading partners Australia\nand China, and historically high prices for New Zealand's dairy and log\nexports. In 2010 the GDP grew by a modest 1.6%, but over the next couple of\nyears economic activity continued to improve, driven by the rebuild in\nCanterbury after the Christchurch earthquakes and recovery in domestic demand.\nThrough 2011, global conditions deteriorated and the terms of trade eased off\ntheir 2011 peak, continuing to moderate until September 2012."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.3.2",
    "section_name": "\"Rock star\" economy",
    "text": "In 2013, the economy grew 3.3%. HSBC chief economist for Australia and New\nZealand, Paul Bloxham, was so impressed that he predicted New Zealand's growth\nwould outpace most of its peers, and he described New Zealand as the \"rock\nstar economy of 2014\". Another financial commentator said the New Zealand\ndollar was the \"hottest\" currency of 2014. Only three months later, the New\nZealand Productivity Commission expressed concern about low living standards\nand problems affecting the long-term drivers of growth. Paul Conway, Director\nof Economics and Research at the Productivity Commission, wrote: \"New\nZealand's broad policy settings should generate GDP per capita 20 per cent\nabove the OECD average, but the actual result is more than 20 per cent below\naverage. We may be punching above our weight, but that's only because we are\nin the wrong weight division!\" In August, Bloxham admitted that \"the sharp\ndecline in dairy prices over the last six months has clouded the outlook\nsomewhat\". In December however Bloxham stated that he thought the New Zealand\neconomy would continue to grow strongly.\n\nIn 2014 increased attention was paid to the growing gap between rich and poor.\nIn _The Guardian_ , Max Rashbrook said policies implemented by both Labour and\nNational governments have increased inequality. He claims that for twenty\nyears outrage \"has been muted\", but \"Alarm bells are finally beginning to\nsound. Recent polling shows three-quarters of New Zealanders think theirs is\nno longer an egalitarian country\"."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.3.3",
    "section_name": "COVID-19 pandemic and recession (2020–22)",
    "text": "New Zealand recorded its first case of COVID-19 on 28 February 2020. In\nresponse to the pandemic, the country closed its borders to everyone except\nNew Zealand citizens and residents on 19 March, and went into full lockdown\nfrom 26 March to 27 April, followed by a partial lockdown from 28 April to 13\nMay.\n\nThe border closure combined with the lockdowns saw the retail, accommodation,\nhospitality, and transport sectors experiencing major declines. On 17\nSeptember 2020, New Zealand officially entered a recession, with the country's\ngross domestic product retracting by 12.2% in the June quarter. The GDP\nrebounded 14% in the September quarter to leave a 2.2% year-on-year\nretraction.\n\nAfter successfully containing the virus, the New Zealand economy had sharp\ngrowth in what is known as a V-shaped recovery and ended the year with an\noverall economic expansion of 0.4%, better than the predicted 1.7%\ncontraction. Unemployment also dropped to 4.9% in December 2020, down from a\npeak Covid effected rate of 5.3% in September.\n\nRestrictions returned in late 2021 after COVID-19 was again present in New\nZealand and continued until late 2023.\n\nBy 23 September 2021, the Restaurant Association's Chief executive Marisa\nBidois estimated that about 1,000 hospitality businesses nationwide had been\nforced to close as a result of the COVID-19 pandemic, leading to the loss of\n13,000 jobs. In response, the Association lobbied the Government for\nGovernment for continued wage subsidies and incentives to boost customer\nrates. On 13 November 2021, the _Bay of Plenty Times_ reported that 26,774\ncompanies had been liquidated during the first eight months of 2021.\n\nOn 27 January 2022, New Zealand's inflation rate hit a 30-year record high of\n5.9% at the end of 2021. According to figures released by Statistics New\nZealand, the rising cost of construction, petrol and rents pushed the consumer\nprice index up 1.4 per cent between October and December 2021. Statistics NZ\nalso recorded a two percent increase in household utilities expenses, which\nwas fuelled by the rising costs of new dwellings (which rose by 16% from 2020)\nand a 30 percent hike in fuel prices (from NZ $1.87 per litre to $2.45 per\nlitre). Prime Minister Jacinda Ardern attributed the sharp inflation rate to\nrising crude oil prices overseas. By contrast, the opposition National Party\nleader Christopher Luxon and Finance spokesperson Simon Bridges attributed\nrising inflation to the Government's \"wasteful\" spending.\n\nOn 1 February 2022, an annual report released by the Organisation of Economic\nCooperation and Development (OECD) identified the country's border\nrestrictions and declining house prices as the main risks facing New Zealand's\neconomy that year. While the OECD report credited New Zealand's elimination\nstrategy and macroeconomic stimuli such as wage and socio-economic subsidies\nwith helping the economy to bounce back to pre-COVID-19 levels, it also warned\nthat excessive Government spending was causing the economy to overheat and\nsubstantial increases in household and government debt. The OECD welcomed the\nReserve Bank's decision to raise interest rates but also urged the Government\nto raise the superannuation age, eliminate obstacles to building houses, and\nreduce government spending. The OECD also supported the introduction of a\nsocial insurance scheme for unemployed workers."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "1.3.4",
    "section_name": "Post COVID-19 pandemic (2023–present)",
    "text": "After the last COVID-19 restrictions were abandoned in 2023, New Zealand\nentered economic stagnation and recession. Continued inflation, interest rate\nrises and low consumer spending lead to low-to-negative economic growth from\n2022 through 2024."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Overview",
    "text": "New Zealand balance of payments and international investment position – net\ninternational debt\n\nIn 2015 the Social Progress Index, which covers such areas as basic human\nneeds, foundations of well-being, and the level of opportunity available to\ncitizens, ranked the New Zealand economy fifth in the world. However, the\noutlook includes some challenges. New Zealand income levels, which used to be\nabove those of many countries in Western Europe prior to the crisis of the\n1970s, dropped in relative terms and never recovered. As a result, the number\nof New Zealanders living in poverty has grown and income inequality has\nincreased dramatically.\n\nNew Zealand has also had persistent current-account deficits since the early\n1970s, peaking at −7.8% of GDP in 2006 but falling to −2.6% of GDP in FY\n2014\\. The CIA World Fact Book estimates New Zealand's 2017 public debt (that\nowed by the government) at 31.7% of GDP. Between 1984 and 2006, net external\nforeign debt increased 11-fold, to NZ$182 billion. As of 2018[update] gross\ncore crown debt was NZ$84,524 million or 29.5% of GDP and net core crown debt\nwas NZ$62,114 million or 21.7% of GDP.\n\nNew Zealand Government Gross Debt as percent of GDP 1860 to 2000 GDP per\ncapita development in Australia and New Zealand\n\nDespite New Zealand's persistent current-account deficits, the balance on\nexternal goods and services has generally been positive. In FY 2014, export\nreceipts exceeded imports by NZ$3.9 billion. There has been an investment\nincome imbalance or net outflow for debt-servicing of external loans. In FY\n2014, New Zealand's investment income from the rest of the world was NZ$7\nbillion, versus outgoings of NZ$16.3 billion, a deficit of NZ$9.3 billion. The\nproportion of the current-account deficit that is attributable to the\ninvestment income imbalance (a net outflow to the Australian-owned banking\nsector) grew from one third in 1997 to roughly 70% in 2008."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Taxation",
    "text": "At the national level the Inland Revenue Department (IRD) collects tax in New\nZealand on behalf of the New Zealand Government. New Zealanders pay national\ntaxes on personal and business income, and on the supply of goods and services\n(GST). There is no capital-gains tax, although certain \"gains\" such as profits\non the sale of patent rights are deemed to be income. Income tax does apply to\nproperty transactions in certain circumstances, particularly speculation.\nLocal authorities manage and collect local property taxes (rates). Some goods\nand services carry a specific tax, referred to as an  excise or a duty such as\nalcohol excise or gaming duty. These are collected by a range of government\nagencies such as the New Zealand Customs Service. There is no social security\n(payroll) tax or land tax in New Zealand.\n\nThe 2010 New Zealand budget announced cuts to personal tax-rates, with the top\npersonal tax-rate reduced from 38% to 33% The cuts gave New Zealand the\nsecond-lowest personal tax burden in the OECD. Only Mexico's citizens retained\na higher percentage-wise \"take home\" proportion of their salaries.\n\nThe cuts in income tax were estimated to reduce revenue by $2.46 billion. To\ncompensate, the National government raised GST from 12.5% to 15%. Treasury\nfigures show that top income-earners in New Zealand pay between 6% and 8% of\ntheir income on GST. Those at the bottom end, earning less than $356 a week,\nspend between 11% and 14% on GST. Based on these figures, _The New Zealand\nHerald_ predicted that putting GST up to 15% would increase living costs for\nthe poor more than twice as much as for the rich."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Corruption",
    "text": "New Zealand ranked 1st on the Transparency International Corruption\nPerceptions Index (CPI) of 2017 with a score of 89 out of 100. In 2018 New\nZealand ranked 2nd on the Corruption Perceptions Index with a score of 87 out\nof 100. In 2019, New Zealand ranked 1st on the Corruption Perceptions Index\nwith a score of 87 out of 100. Although New Zealand is one of the least\ncorrupt countries in the world, corruption still exists in New Zealand."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Regional economies",
    "text": "Map of regions of New Zealand\n\nIn March 2024, Statistics New Zealand published details of the break-down of\ngross domestic product in the regions of New Zealand for the year ended March\n2023:\n\nRegion (map reference)  | GDP 2023\n(NZ$ million)  | Share of\nnational GDP  | GDP per capita\n2023 (NZ$)  | GDP growth\n2022–23\n---|---|---|---|---\nNorthland (1)  | 10,061  | 2.6%  | 49,710  |  +6.4%\nAuckland (2)  | 148,732  | 38.2%  | 86,734  |  +10%\nWaikato (3)  | 34,613  | 8.9%  | 67,028  |  +8.2%\nBay of Plenty (4)  | 22,581  | 5.8%  | 64,462  |  +6.2%\nGisborne (5)  | 2,665  | 0.7%  | 50,955  |  +5.5%\nHawke's Bay (6)  | 11,385  | 2.9%  | 61,977  |  +7%\nTaranaki (7)  | 10,241  | 2.6%  | 80,072  |  +5.5%\nManawatū-Whanganui (8)  | 15,289  | 3.9%  | 59,010  |  +7.1%\nWellington (9)  | 47,465  | 12.2%  | 86,805  |  +6.9%\n**North Island** | **303,033** | **77.9%** | **76,645** | **+8.4%**\nTasman / Nelson (10 / 11)  | 7,100  | 1.8%  | 62,277  |  +8%\nMarlborough (12)  | 3,947  | 1.0%  | 76,049  |  +10.4%\nWest Coast (13)  | 2,095  | 0.5%  | 63,876  |  +7%\nCanterbury (14)  | 47,944  | 12.3%  | 72,620  |  +9%\nOtago (15)  | 16,755  | 4.3%  | 66,700  |  +9.8%\nSouthland (16)  | 8,271  | 2.1%  | 80,148  |  +6.3%\n**South Island** | **86,112** | **22.1%** | **70,973** | **+8.8%**\n**New Zealand** | **389,145** | **100.0%** | **75,311** | **+8.5%**\n\n1. **^** Nelson and Tasman are combined by Statistics New Zealand, but are separate regions.\n2. **^** Includes the Chatham Islands."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Unemployment",
    "text": "Prior to the economic shock created by Britain's decision to join the European\nEconomic Community (EEC) in 1973, which removed the UK as New Zealand's\nprimary market for exports, unemployment in New Zealand was very low. A\nrecession and a collapse in wool prices in 1966 led to unemployment rising by\n131%, but still represented only a 0.7% percentage point increase in the\nunemployment rate.\n\nAfter 1973, unemployment became a persistent economic and social issue in New\nZealand. Recessions from 1976 to 1978 and from 1982 to 1983 greatly increased\nunemployment again. Between 1985 and 2012 the unemployment rate averaged\n6.29%. After the stock market crash of 1987, unemployment rose 170% reaching\nan all-time high of 11.20% in September 1991. The 1997 Asian financial crisis\nsent unemployment upwards again, by 28%. By 2007 it had dropped again and the\nrate stood at 3.5% (December 2007), its lowest level since the current method\nof surveying began in 1986. This gave the country the 5th-best ranking in the\nOECD (with an OECD average at the time of 5.5%). The low numbers correlated\nwith a robust economy and a large backlog of job positions at all levels.\nUnemployment numbers are not always directly comparable between OECD nations,\nas members do not all keep labour market statistics in the same way.\n\nThe percentage of the population employed has also increased in recent years,\nto 68.8% of all inhabitants,[_when?_] with full-time jobs increasing slightly,\nand part-time occupations decreasing in turn. The increase in the working\npopulation percentage is attributed[_by whom?_] to increasing wages and higher\ncosts of living moving more people into employment.[_failed verification_] The\nlow unemployment also had some disadvantages, with many companies unable to\nfill jobs.\n\nStarting with the 2008 financial crisis, unemployment began to rise. This\ntrend continued until September 2012, reaching a high of 6.7%. It began to\nrecover after that point, sitting at 3.9% as of June 2019[update]."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Housing affordability",
    "text": "Shamubeel Eaqub, formerly a principal economist at the New Zealand Institute\nof Economic Research (NZIER), said in 2014 that thirty years prior, an average\nhouse in New Zealand cost two or three times the average household income.\nHouse prices rose dramatically in the first years of the 21st century and by\n2007, an average house cost more than six times household income.\nInternational surveys in 2013 showed that housing was unaffordable in all\neight of New Zealand's major markets – \"unaffordable\" being defined as house\nprices which are more than three times the median regional income.\n\nDemand for property has been strongest in Auckland. In 2014 the average sales\nprice there went from $619,136 to $696,047, a rise of 12% in that 12-month\nperiod alone. In 2015, prices rose another 14%. This made Auckland New\nZealand's least affordable market and one of the most expensive cities in the\nworld with houses costing 8 times the average income. Between 2012 and April\n2016, the average Auckland home increased in price by just over two-thirds\nreaching $931,000 – higher than the cost of an average home in Sydney.\n\nAs a result, more people are being priced out of the property market. Those on\nlow incomes are hardest hit, affecting many Maori and Pasifika. New Zealand's\nrelatively high mortgage-rates are exacerbating the problem making it\ndifficult for young people with steady jobs to buy their first home. According\nto a 2012 submission made to the Housing Affordability Inquiry, escalating\nhouse prices are also impacting on many middle income groups, especially those\nwith large families. Mortgage adviser Bruce Patten said the trend was\n\"disturbing\" and added to the gap between the \"haves and have-nots\".\n\nProperty-analysis company CoreLogic said[_when?_] that 45% of house purchases\nin New Zealand are now made by investors who already own a home, while another\n28% are made by people moving from one property to another. Approximately 8%\nof purchases go to overseas-based cash buyers – primarily Australians,\nChinese, and British – although most[_quantify_] economists believe that\nforeign investment is currently[_when?_] too small to have a significant\neffect on property prices.\n\nWhether purchases are made by New Zealanders or by foreigners, it is generally\nthose who are already well off who are buying the bulk of properties on the\nmarket. This has had a dramatic effect on home-ownership rates by Kiwis,\nnow[_when?_] at its lowest level since 1951. Even as recently as 1991, 76% of\nNew Zealand homes were occupied by their owners. By 2013, this had reduced to\n63%, indicating that more and more people are having to rent.[_citation\nneeded_] Raewyn Cox, chief executive of the Federation of Family Budgeting,\nsays: \"High prices and high interest rates (have) sentenced a rising number of\nNew Zealanders to be lifetime tenants\" where they are \"stuck in expensive\nrental situations, heading towards retirement\"."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Inequality",
    "text": "In the interwar and post-war periods, successive governments sponsored a\nmassive state housing programme\n\nBetween 1982 and 2011 New Zealand's gross domestic product grew by 35%. Almost\nhalf of that increase went to a small group who were already the richest in\nthe country. During this period, the average income of the top 10% of earners\nin New Zealand (those earning more than $72,000) almost doubled going from\n$56,300 to $100,200. The average income of the poorest tenth increased by 13%\nfrom $9700 to $11,000.\n\nStatistics New Zealand, which keeps track of income disparity using the P80/20\nratio, confirms the increase in income inequality. The ratio shows the\ndifference between high household incomes (those in the 80th percentile) and\nlow household incomes (those in the 20th percentile). The inequality ratio\nincreased between 1988 and 2004, and decreased until the onset of the Great\nRecession, increasing again to 2011 and then declining again from then. By\n2013 the disposable income of high-income households was more than two-and-a-\nhalf times larger than that of low-income households.\n\nIn 2020, the OECD gave New Zealand a Gini inequality coefficient of 0.320 or\n25th (out of 37) in the OECD."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Superannuation",
    "text": "New Zealand has a universal superannuation scheme. Only people who are aged 65\nyears old or over, are New Zealand citizens or permanent residents and who are\nresiding in New Zealand at the time of application are eligible. They must\nalso have lived in New Zealand for at least 10 years since they turned 20 with\nfive of those years being since they turned 50. Time spent overseas in certain\ncountries and for certain reasons may be counted for New Zealand\nsuperannuation. New Zealand superannuation is taxed, the rate of which depends\non superannuitants' other income. The amount of superannuation paid depends on\nthe person's household situation. For a married couple the net tax amount is\nset by legislation to be no less than 66% of net average wage.\n\nBecause of the growing number of elderly becoming eligible, superannuation\ncosts rose from $7.3 billion a year in 2008 to $10.2 billion in 2014. In 2011\nthere were twice as many children in New Zealand as elderly (65 and over); by\n2051 there are projected to be 60% more elderly than children. In the ten\nyears from 2014, the number of New Zealanders over the age of 65 was projected\nto grow by about 200,000.\n\nThis poses a significant problem for superannuation. The government gradually\nincreased the age of eligibility from 61 to 65 between 1993 and 2001. In that\nyear the Labour Government of Helen Clark introduced the New Zealand\nSuperannuation Fund (known as the \"Cullen Fund\" after Minister of Finance\nMichael Cullen) to part-fund the superannuation scheme into the future. As at\nOctober 2014, the fund managed NZ$27.11 billion, 15.9% of which it invested\nwithin New Zealand.\n\nIn 2007 the same Government introduced a new individual saving-scheme, known\nas KiwiSaver. KiwiSaver principally targets growing people's retirement\nsavings, but younger participants can also use it to save a deposit for their\nfirst home. The scheme is voluntary, work-based and managed by private-sector\ncompanies called \"KiwiSaver providers\". As of 2014[update] KiwiSaver had 2.3\nmillion active members (60.9% of New Zealand's population under 65). NZ$4\nbillion was contributed annually, and a total of NZ$19.1 billion has been\ncontributed since 2007."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Consumption",
    "text": "| This section **needs expansion**. You can help by adding to it. _( May\n2021)_\n---|---\n\nNew Zealanders see themselves as first-world consumers with first-world tastes\nand habits – mitigated only slightly by the country's remoteness from main\nglobal producers.\n\nIn 2023, New Zealand's Final Consumption Expenditure was 199.99 billion."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Infrastructure",
    "text": "According to the National Infrastructure Unit of the Treasury, New Zealand\n\"...continues to face challenges to its infrastructure; all forms of\ninfrastructure are long-term investments, and change does not come about\neasily or quickly.\" A report prepared for the Association of Consulting and\nEngineering New Zealand in 2020 claimed that there was an infrastructure\ndeficit of $75 billion (about one quarter of GDP), following decades of under-\ninvestment that began in the 1980s."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Transport",
    "text": "Highways, rail lines and an inter-island ferry in central Wellington\n\nNew Zealand's transport infrastructure is \"generally well developed.\""
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.1.1",
    "section_name": "Road network",
    "text": "The New Zealand state highway network consists of 11,000 km of road, with\n5981.3 km in the North Island and 4924.4 km in the South Island, built and\nmaintained by the NZ Transport Agency, and paid for from general taxation and\nfuel excise duty. Heavy road users must pay Road User Charges as well, there\nis limited use of tolling on state highways. There is also 83,000 km of local\nroads built and maintained by local authorities."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.1.2",
    "section_name": "Railway network",
    "text": "The railway network is owned by state-owned enterprise KiwiRail and consists\nof 3,898 km of railway line, built to the narrow gauge of 1,067 mm (3 ft 6\nin). Of this, 506 km is electrified."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.1.3",
    "section_name": "Airways",
    "text": "There are seven international airports and twenty-eight domestic airports. Air\nNew Zealand, 52% government-owned, is the national carrier and a state owned\nenterprise. Airways New Zealand, another state owned enterprise, provides air\ntraffic control and communications."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.1.4",
    "section_name": "Seaports",
    "text": "New Zealand has 14 international seaports."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Telecommunications",
    "text": "Telephone booths in Dunedin\n\nPresent-day telecommunications in New Zealand include telephony, radio,\ntelevision, and internet usage. A competitive telecommunications market has\nseen mobile prices drop to some of the lowest in the OECD. The copper wire and\nfibre cable networks are mostly owned by Chorus Limited, a publicly listed\ncompany. Chorus wholesales services to retail providers (such as Spark). In\nthe mobile sector, there are three operators: Spark, One NZ and 2degrees."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.2.1",
    "section_name": "Internet",
    "text": "New Zealand has a high rate of internet use. As of October 2014[update], there\nare 1,916,000 broadband connections and 65,000 dial-up connections in New\nZealand, of which 1,595,000 are residential and 386,000 are business or\ngovernment.\n\nThe Government has two plans to bring Ultra-Fast Broadband to 97.8% of the\npopulation by 2019, and is spending NZ$1.35 billion on public-private\npartnerships to roll out fibre-to-the-home connection in all main towns and\ncities with population over 10,000. The program aims to deliver ultra-fast\nbroadband capable of at least 100 Mbit/s download and 50 Mbit/s upload to 75%\nof New Zealanders by 2019. In total, 1,340,000 households in 26 towns and\ncities will be connected.\n\nGigabit internet (1000 Mbit/s download speeds) was made available to the\nentire Ultra-Fast Broadband (UFB) footprint on 1 October 2016, in an\nannouncement from Chorus.\n\nA$300 million Rural Broadband Initiative (RBI) has also been introduced by the\nGovernment, with the aim to bring broadband of at least 5 Mbit/s to 86% of\nrural customers by 2016."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Energy",
    "text": "From 1995 to 2013, the energy intensity of the economy per unit of GDP\ndeclined by 25 percent. A contributing factor is the growth of relatively less\nenergy-intensive service industries. New Zealand will be potentially among the\nmain winners after the global transition to renewable energy is completed; the\ncountry is placed very high – no. 5 among 156 countries – in the index of\ngeopolitical gains and losses after energy transition (GeGaLo Index)."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Electricity",
    "text": "The electricity market is regulated by the Electricity Industry Participation\nCode administered by the Electricity Authority (EA). The electricity sector\nuses mainly renewable energy sources such as hydropower, geothermal power and\nincreasingly wind energy.\n\nThe 83% share of renewable energy sources makes New Zealand one of the most\nsustainable economies in terms of electricity generation; in terms of total\nenergy consumption in the New Zealand economy, this represents the 30% that\ncomes from renewable sources. New Zealand suffers from a geographical\nimbalance between electricity production and consumption. The most substantial\nelectricity generation (both existing and as remaining potential) is located\non the South Island and to a lesser degree in the central North Island, while\nthe main demand (which is continuing to grow) is in the northern North Island,\nparticularly the Auckland Region. This requires electricity to be transmitted\nnorth through a power grid which is reaching its capacity more often."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Water",
    "text": "As of 2021, almost all of the three waters assets (drinking water, stormwater\nand wastewater) are owned by local councils and territorial authorities. There\nare currently 67 different asset-owning organisations in total.\n\nThe challenges for local government include funding infrastructure deficits\nand preparing for large re-investments that are estimated to require $110\nbillion over the next 30 to 40 years. There are also significant challenges in\nmeeting statutory requirements for the safety of drinking water, and the\nenvironmental expectations for management of stormwater and wastewater.\nClimate change adaptation, and providing for population growth add to these\nchallenges."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Trade",
    "text": "As of 2024, New Zealand largest trading partners are China, Australia, the\nEuropean Union, the United States and Japan. Together, these five partners\naccount for 63% of New Zealand's two-way trade with China alone accounting for\nover 30% of two-way trade. Total annual exports are worth over US $44 billion\nwell imports are worth over US $49 billion. New Zealand Trade and Enterprise\n(NZTE) offers strategic advice and support to New Zealand businesses wanting\nto export goods and services to other countries."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Trade agreements",
    "text": "New Zealand Free trade agreements in force Free trade agreements concluded but\nnot in force\n---\n\nSince 1960s New Zealand has pursued free trade agreements with many countries\nto diversify its export markets and increase the competitiveness of New\nZealand's exports to the world. As well as reducing barriers to trade, Trade\nAgreements New Zealand has entered into are designed to ensure existing access\nis maintained. Trade agreements establish rules by which trade can take place\nand ensure regulators and officials in countries New Zealand is trading with\nwork closely together."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "China",
    "text": "China is New Zealand's largest trading partner, buying primarily meat, dairy\nproducts and pine logs. In 2013, trade between New Zealand and China was worth\nNZ$16.8 billion. This has occurred primarily because of soaring demand for\nimported dairy products, following the Chinese milk scandal in 2008. Since\nthen demand for milk products has been so strong that in the 12 months to\nMarch 2014, there was a 51% increase in total exports to China. The increase\nwas facilitated by the New Zealand–China Free Trade Agreement which came into\nforce on 1 October 2008. Since that year exports to China have more than\ntripled."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Australia",
    "text": "Australia New Zealand Closer Economic Relations Trade Agreement 28 March 1983\n– signed by Laurie Francis & Lionel Brown\n\nAustralia was New Zealand's largest bilateral trading partner in 2013, when\ntrade between the two countries was worth NZ$25.6 billion, and before China\novertook Australia. Economic and trading links between Australia and New\nZealand are underpinned by the \"Closer Economic Relations\" (CER) agreement,\nwhich allows for free trade in goods and most services. Since 1990, CER has\ncreated a single market of more than 25 million people. Australia is now the\ndestination of 19% of New Zealand's exports, including light crude oil, gold,\nwine, cheese and timber, as well as a wide range of manufactured items.\n\nThe CER also creates a free labour market which allows New Zealand and\nAustralian citizens to live and work freely in each other's country together\nwith mutual recognition of professional qualifications. This means individuals\nwho are registered to practise an occupation in one country can register to\npractise an equivalent occupation in the other country. Banking regulation and\nsupervision are co-ordinated through the Trans-Tasman Council on Banking\nSupervision and there are also ongoing discussions about co-ordinating\nAustralian and New Zealand business law."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "European Union",
    "text": "The European Union is New Zealand's third largest trading partner. A growing\nnumber of New Zealand companies use the United Kingdom as a base to supply\ntheir products to the European market. However trade with the European Union\nis declining as demand from Asia continues to grow. The EU takes only 8% of\nNew Zealand exports but provides around 12% of imports.\n\nIn July 2014, negotiations on the Partnership Agreement on Relations and\nCooperation (PARC) between New Zealand and the European Union were concluded.\nThe agreement covers the trade and economic relationship between the EU and\nNew Zealand with a view to further liberalisation of trade and investment and\nacknowledges the intention of the European Union to upgrade its diplomatic\npresence in New Zealand with a resident ambassador. In 2024 a New Zealand-\nEuropean Union free trade agreement entered into force."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "United States",
    "text": "The United States was New Zealand's third largest trading partner in 2013,\nwhen bilateral trade between the two countries was valued at NZ$11.8 billion,\nand before it was overtaken by the EU. New Zealand's main exports to the\nUnited States are beef, dairy products and lamb. Imports from the US include\nspecialised machinery, pharmaceutical products, oil and fuel. In addition to\ntrade, there is a high level of corporate and individual investment between\nthe two countries and the US is a major source of tourists coming to New\nZealand. In March 2012, the United States had a total of $44 billion invested\nin New Zealand. A number of US companies have subsidiary branches in New\nZealand. Many operate through local agents, with some joint venture\nassociations. The United States Chamber of Commerce is active in New Zealand,\nwith a main office in Auckland and a branch committee in Wellington.\n\nAccording to the Ministry of Foreign Affairs, New Zealand and the United\nStates \"share a deep and longstanding friendship based on a common heritage,\nshared values and interests, and a commitment to promoting a free, democratic,\nsecure and prosperous world\". This common background has not translated into a\nfree trade agreement between the two countries."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Japan, Korea and other Asian economies",
    "text": "Japan is New Zealand's fourth largest trading partner. In the 21st century,\nAsian economies have been developing rapidly providing significant demand for\nNew Zealand's exports. Korea, as New Zealand's fifth largest trading partner,\nis also one of important sources of importation of New Zealand and considered\nas important export market for New Zealand.\n\nNew Zealand also trades with Taiwan, Hong Kong, Malaysia, Indonesia,\nSingapore, Thailand, India and the Philippines and this now accounts for\naround 16% of total exports. New Zealand initiated a free trade agreement with\nSingapore in September 2000 which was extended in 2005 to include Chile and\nBrunei and is now known as the P4 agreement."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "4.7",
    "section_name": "Relationship with Pacific Islands",
    "text": "The Pacific region with numerous islands is New Zealand's sixth largest\ntrading market and is growing every year. In 2011 exports to Pacific Islands\nwere worth over $1.5 billion up 12% on the previous year. Fiji is the biggest\nindividual market followed very closely by Papua New Guinea, French Polynesia\nand New Caledonia. Goods exported to the islands include refined oil,\nconstruction materials, medicines, sheep meat, milk, butter, fruit and\nvegetables. New Zealand also assists Pacific Islands with defence and regional\nsecurity, and with management of the environment and fisheries.\n\nBecause of their small size, the Pacific Islands are some of the most\nvulnerable environments in the world and are on the receiving end of numerous\ncyclones every year. When disasters occur, they often have severe social and\neconomic effects which last for years. Since 1992, New Zealand has co-operated\nwith Australia and France to respond to disasters in the Pacific. New Zealand\nprovides emergency supplies and transport, funding for roading and housing and\nthe deployment of specialists to affected areas.\n\nThrough the Ministry of Foreign Affairs and Trade, New Zealand also provides\ninternational aid and development funding to help stimulate sustainable\neconomic development in underdeveloped economies. The New Zealand Aid\nProgramme, allocated about $550m a year, is focused primarily on promoting\ndevelopment in the Pacific. The allocation of $550 million represents about\n0.26% of New Zealand's gross national income (GNI)."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Foreign investment",
    "text": "New Zealand welcomes and encourages foreign investment, which is overseen by\nthe Overseas Investment Office. In 2014 foreign direct investment totalled\nNZ$107.69 billion. Between 1989 and 2013, foreign investment increased from\nNZ$9.7 billion to NZ$101.4 billion – a change of over 1,000%. Between 1989 and\n2007, foreign ownership of the New Zealand sharemarket went from 19% to 41%\nbut has since dropped back to 33%. [_citation needed_]\n\nIn 2014, around 7% of all agriculturally productive land in New Zealand was\nforeign-owned. In 2011, economist Bill Rosenberg claimed that the figure was\ncloser to 9% when including foreign ownership of forestry land. In March 2013,\nthe financial sector, which includes the \"big-four\" Australian-owned banks,\nwas worth NZ$39.3 billion – the largest share of the NZ$101.4 billion of\nforeign ownership of New Zealand companies at the time."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Impact",
    "text": "Between 1997 and 2014, foreign investors made NZ$50.3 billion profit, 68% of\nwhich went overseas. The Campaign Against Foreign Control of Aotearoa (CAFCA)\nsays this has a negative impact on the economy, arguing that when foreign\ninvestors buy up New Zealand companies, they tend to cut staff and push down\nwages. It is also argued that growing foreign ownership has done nothing to\nreduce New Zealand's foreign debt. In 1984, private and public foreign debt\nwas NZ$16 billion (NZ$50 billion in March 2013 dollars), which was less than\nhalf New Zealand's GDP at the time. By March 2013, total foreign debt stood at\nNZ$251 billion, well over 100% of New Zealand's GDP.\n\nAt the Singapore International Energy Week (SIEW) conference, leaders from New\nZealand and Cambodia highlighted the challenge of maintaining public support\nfor clean energy transitions due to rising electricity costs. They emphasized\nthe importance of balancing affordability with sustainability to ensure long-\nterm success."
  },
  {
    "chapter_name": "Economy of New Zealand",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Data",
    "text": "Tourism, like here on the Milford Sound (special bus with viewing gallery), is\na major export earner for New Zealand\n\nThe following table shows the main economic indicators in 1980–2022 (with IMF\nstaff estimates in 2023–2026) from the May 2023 IMF World Economic Outlook\nreport. Inflation below 2% is green.\n\nYear  | GDP\n(bil. US$) | GDP per capita\n(US$) | GDP\n(bil. US$) | GDP per capita\n(US$) | GDP growth\n(real) | Inflation rate\n(%) | Unemployment\n(%) | Government debt\nas % of GDP\n---|---|---|---|---|---|---|---|---\n(PPP)  | (Nominal)\n1980  | 28.5  | 9,176.3  | 22.6  | 7,257.5  | 1.0%  | 17.1%  | 4.0%  | n/a\n1981  | 32.1  | 10,287.7  | 23.5  | 7,514.1  | 3.0%  | 15.5%  | 3.9%  | n/a\n1982  | 35.1  | 11,150.8  | 23.2  | 7,381.3  | 2.9%  | 16.1%  | 4.4%  | n/a\n1983  | 36.4  | 11,463.5  | 22.5  | 7,074.6  | -0.1%  | 7.4%  | 6.2%  | n/a\n1984  |  40.4  |  12,565.3  |  22.4  |  6,970.9  |  6.9%  |  6.1%  |  7.2%  | n/a\n1985  | 42.1  | 12,993.8  | 22.5  | 6,953.6  | 1.2%  | 15.4%  | 3.9%  | 64.1%\n1986  |  43.8  |  13,373.6  |  27.4  |  8,385.8  |  1.8%  |  13.2%  |  4.2%  |  68.5%\n1987  |  45.9  |  13,915.0  |  37.0  |  11,205.9  |  2.4%  |  15.8%  |  4.2%  |  62.9%\n1988  |  47.8  |  14,353.2  |  45.5  |  13,663.6  |  0.6%  |  6.4%  |  5.8%  |  54.7%\n1989  |  49.9  |  14,826.9  |  44.0  |  13,079.0  |  0.4%  |  5.7%  |  7.3%  |  55.0%\n1990  |  51.8  |  15,204.9  |  45.8  |  13,447.6  |  0.0%  |  6.1%  |  8.0%  |  55.4%\n1991  |  52.8  |  15,111.8  |  43.4  |  12,424.8  |  -1.3%  |  2.6%  |  10.6%  |  58.0%\n1992  |  54.4  |  15,401.1  |  41.5  |  11,752.0  |  0.7%  |  1.0%  |  10.7%  |  58.7%\n1993  |  58.6  |  16,401.4  |  44.8  |  12,537.7  |  5.2%  |  1.3%  |  9.8%  |  54.6%\n1994  |  63.2  |  17,452.4  |  52.9  |  14,612.4  |  5.6%  |  1.7%  |  8.4%  |  48.9%\n1995  |  67.7  |  18,414.5  |  62.2  |  16,932.7  |  4.9%  |  3.8%  |  6.5%  |  43.5%\n1996  |  71.7  |  19,212.1  |  69.1  |  18,506.4  |  4.1%  |  2.3%  |  6.3%  |  37.3%\n1997  |  74.8  |  19,763.8  |  68.9  |  18,206.2  |  2.4%  |  1.2%  |  6.9%  |  34.6%\n1998  |  75.9  |  19,893.4  |  56.8  |  14,889.8  |  0.4%  |  1.3%  |  7.7%  |  34.5%\n1999  |  80.4  |  20,961.2  |  58.9  |  15,348.8  |  4.5%  |  -0.1%  |  7.1%  |  32.0%\n2000  |  85.7  |  22,207.2  |  54.1  |  14,021.9  |  4.2%  |  2.6%  |  6.2%  |  30.0%\n2001  |  89.9  |  23,121.0  |  53.1  |  13,669.3  |  2.5%  |  2.6%  |  5.5%  |  28.2%\n2002  |  95.6  |  24,183.4  |  62.1  |  15,706.7  |  4.7%  |  2.7%  |  5.3%  |  26.4%\n2003  |  101.8  |  25,263.5  |  82.4  |  20,460.3  |  4.4%  |  1.8%  |  4.8%  |  24.7%\n2004  |  109.6  |  26,793.4  |  101.6  |  24,848.8  |  4.8%  |  2.3%  |  4.0%  |  22.5%\n2005  |  116.6  |  28,196.4  |  113.3  |  27,385.5  |  3.2%  |  3.0%  |  3.8%  |  20.8%\n2006  |  123.6  |  29,531.6  |  109.7  |  26,219.9  |  2.8%  |  3.4%  |  3.9%  |  18.4%\n2007  |  131.4  |  31,091.1  |  134.9  |  31,914.3  |  3.5%  |  2.4%  |  3.6%  |  16.3%\n2008  |  133.5  |  31,311.6  |  135.4  |  31,762.9  |  -0.4%  |  4.0%  |  4.0%  |  19.0%\n2009  |  132.8  |  30,843.0  |  121.7  |  28,270.4  |  -1.1%  |  2.1%  |  5.9%  |  24.3%\n2010  |  136.7  |  31,402.2  |  145.4  |  33,393.0  |  1.7%  |  2.3%  |  6.2%  |  29.7%\n2011  |  142.0  |  32,376.0  |  166.9  |  38,061.5  |  1.8%  |  4.0%  |  6.1%  |  34.7%\n2012  |  144.4  |  32,733.7  |  175.0  |  39,683.6  |  2.5%  |  1.1%  |  6.5%  |  35.7%\n2013  |  157.7  |  35,467.7  |  187.1  |  42,081.3  |  2.3%  |  1.1%  |  5.8%  |  34.6%\n2014  |  167.2  |  36,995.9  |  200.2  |  44,284.7  |  3.8%  |  1.2%  |  5.4%  |  34.2%\n2015  |  170.7  |  36,995.3  |  176.3  |  38,224.6  |  3.6%  |  0.3%  |  5.4%  |  34.2%\n2016  |  185.1  |  39,254.6  |  185.9  |  39,415.0  |  3.9%  |  0.6%  |  5.2%  |  33.4%\n2017  |  197.1  |  40,932.7  |  203.6  |  42,290.0  |  3.3%  |  1.9%  |  4.8%  |  31.1%\n2018  |  208.7  |  42,564.4  |  209.6  |  42,757.1  |  3.5%  |  1.6%  |  4.3%  |  28.1%\n2019  |  218.7  |  43,864.4  |  210.8  |  42,274.2  |  3.1%  |  1.6%  |  4.1%  |  31.8%\n2020  |  218.5  |  42,970.5  |  210.3  |  41,341.1  |  -1.4%  |  1.7%  |  4.6%  |  43.3%\n2021  |  241.4  |  47,235.7  |  249.7  |  48,861.5  |  5.6%  |  3.9%  |  3.8%  |  47.5%\n2022  |  264.6  |  51,622.6  |  242.4  |  47,284.1  |  2.4%  |  7.2%  |  3.3%  |  47.2%\nProjected\n2023  |  276.0  |  52,676.5  |  249.0  |  47,536.7  |  0.6%  |  5.7%  |  3.7%  |  45.9%\n2024  |  285.6  |  53,797.3  |  257.6  |  48,530.8  |  1.0%  |  3.1%  |  5.0%  |  47.4%\n2025  |  296.3  |  55,145.9  |  266.8  |  49,644.8  |  2.0%  |  2.5%  |  5.4%  |  48.7%\n2026  |  309.2  |  56,843.4  |  277.7  |  51,049.1  |  2.4%  |  2.4%  |  5.2%  |  48.8%\n\nIndustrial production growth rate\n\n5.9% (2004) / **1.5% (2007)**\nHousehold income or consumption by percentage share\n\n\n\n* Lowest 10%: **0.3% (1991)**\n* Highest 10%: **29.8% (1991)**\n\nAgriculture – products\n\nWheat, barley, potatoes, pulses, fruits, vegetables; wool, beef, dairy products; fish\nExports – commodities\n\nDairy products, meat, wood and wood products, fish, machinery\nImports – commodities\n\nMachinery and equipment, vehicles and aircraft, petroleum, electronics, textiles, plastics\nElectricity\n\n\n\n* Consumption: 34.88 TWh (2001) / **37.39TWh (2006)**\n* Production: 38.39 TWh (2004) / **42.06TWh (2006)**\n* Exports: **0kWh (2006)**\n* Imports: **0kWh (2006)**\n\nElectricity – production by source\n\n\n\n* Hydro: **60% (2020)**\n* Geothermal: **17% (2020)**\n* Wind: **5% (2020)**\n* Fossil fuel: **17% (2020)**\n* Nuclear: **0% (2020)**\n* Other: **3.4% (2010)**\n\nOil\n\n\n\n* Production: 42,160 barrels (6,703 m3) 2001 / **25,880 barrels (4,115 m 3) 2006**\n* Consumption: 132,700 barrels (21,100 m3) 2001 / **156,000 barrels (24,800 m 3) 2006**\n* Exports: 30,220 barrels (4,805 m3) 2001 / **15,720 barrels (2,499 m 3) 2004**\n* Imports: 119,700 barrels (19,030 m3) 2001 / **140,900 barrels (22,400 m 3) 2004**\n* Proven reserves: **89.62 million barrels (14,248,000 m 3) January 2002**\n\nExchange rates\n\n_New Zealand dollars (NZ$) per US$1_ – 1.4771 (2016), 1.2652 (2012), 1.3869 (2005), 1.5248 (2004), 1.9071 (2003), 2.1622 (2002), 2.3788 (2001), 2.2012 (2000), 1.8886 (1999), 1.8632 (1998), 1.5083 (1997), 1.4543 (1996), 1.5235 (1995)"
  }
]