[
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Canada is a highly developed mixed economy. It is the world's\nninth-largest as of 2024[update] with a nominal GDP of approximately US$2.117\ntrillion. Canada is one of the world's largest trading nations, with a highly\nglobalized economy. In 2021, Canadian trade in goods and services reached\n$2.016 trillion. Canada's exports totalled over $637 billion, while its\nimported goods were worth over $631 billion, of which approximately $391\nbillion originated from the United States. In 2018, Canada had a trade deficit\nin goods of $22 billion and a trade deficit in services of $25 billion. The\nToronto Stock Exchange is the tenth-largest stock exchange in the world by\nmarket capitalization, listing over 1,500 companies with a combined market\ncapitalization of over US$3 trillion.\n\nCanada has a strong cooperative banking sector, with the world's highest per-\ncapita membership in credit unions. It ranks low in the Corruption Perceptions\nIndex (12th in 2023) and \"is widely regarded as among the least corrupt\ncountries of the world\". It ranks high in the Global Competitiveness Report\n(14th in 2019) and Global Innovation Indexes (15th in 2022). Canada's economy\nranks above most Western nations on The Heritage Foundation's Index of\nEconomic Freedom and experiences a relatively low level of income disparity.\nThe country's average household disposable income per capita is \"well above\"\nthe OECD average. Canada ranks among the lowest of the most developed\ncountries for housing affordability[_dubious – discuss_] and foreign direct\ninvestment. Among OECD members, Canada has a highly efficient and strong\nsocial security system; social expenditure stood at roughly 23.1% of GDP.\n\nSince the early 20th century, the growth of Canada's manufacturing, mining,\nand service sectors has transformed the nation from a largely rural economy to\nan urbanized, industrial one. Like many other developed countries, the\nCanadian economy is dominated by the service industry, which employs about\nthree-quarters of the country's workforce. Among developed countries, Canada\nhas an unusually important primary sector, of which the forestry and petroleum\nindustries are the most prominent components. Many towns in northern Canada,\nwhere agriculture is difficult, are sustained by nearby mines or sources of\ntimber. Canada spends around 1.70% of GDP on advanced research and development\nacross various sectors of the economy.\n\nCanada's economic integration with the United States has increased\nsignificantly since World War II. The Automotive Products Trade Agreement of\n1965 opened Canada's borders to trade in the automobile manufacturing\nindustry. In the 1970s, concerns over energy self-sufficiency and foreign\nownership in the manufacturing sectors prompted the federal government to\nenact the National Energy Program (NEP) and the Foreign Investment Review\nAgency (FIRA). The government abolished the NEP in the 1980s and changed the\nname of FIRA to Investment in Canada to encourage foreign investment. The\nCanada – United States Free Trade Agreement (FTA) of 1988 eliminated tariffs\nbetween the two countries, while the North American Free Trade Agreement\n(NAFTA) expanded the free-trade zone to include Mexico in 1994 (later replaced\nby the Canada–United States–Mexico Agreement). As of 2023, Canada is a\nsignatory to 15 free trade agreements with 51 countries.\n\nCanada is one of the few developed nations that are net exporters of energy.\nAtlantic Canada possesses vast offshore deposits of natural gas, and Alberta\nhosts the fourth-largest oil reserves in the world. The vast Athabasca oil\nsands and other oil reserves give Canada 13 percent of global oil reserves,\nconstituting the world's third or fourth-largest. Canada is additionally one\nof the world's largest suppliers of agricultural products; the Canadian\nPrairies are one of the most important global producers of wheat, canola, and\nother grains. The country is a leading exporter of zinc, uranium, gold,\nnickel, platinoids, aluminum, steel, iron ore, coking coal, lead, copper,\nmolybdenum, cobalt, and cadmium. Canada has a sizeable manufacturing sector\ncentred in southern Ontario and Quebec, with automobiles and aeronautics\nrepresenting particularly important industries. The fishing industry is also a\nkey contributor to the economy.",
    "openai_summarised_points": [
      "• The economy of Canada is classified as a highly developed mixed economy, characterized by a combination of private and public enterprise.",
      "• As of 2024, Canada ranks as the ninth-largest economy in the world based on nominal GDP, which is approximately US$2.117 trillion.",
      "• Canada is one of the world's largest trading nations, with a highly globalized economy that facilitates extensive international commerce.",
      "• In 2021, Canada's total trade in goods and services reached US$2.016 trillion, reflecting significant economic activity.",
      "• Canadian exports in 2021 totaled over US$637 billion, while imports were valued at over US$631 billion, indicating a substantial trade volume.",
      "• Approximately US$391 billion of Canada's imported goods in 2021 originated from the United States, highlighting the close economic ties between the two countries.",
      "• In 2018, Canada experienced a trade deficit in goods of US$22 billion and a trade deficit in services of US$25 billion, illustrating trade imbalances.",
      "• The Toronto Stock Exchange (TSX) is the tenth-largest stock exchange globally by market capitalization, listing over 1,500 companies with a combined market value exceeding US$3 trillion.",
      "• Canada has a robust cooperative banking sector, with the highest per-capita membership in credit unions worldwide, emphasizing community-based financial services.",
      "• The country ranks 12th in the 2023 Corruption Perceptions Index, and is widely regarded as among the least corrupt nations globally.",
      "• Canada ranks 14th in the 2019 Global Competitiveness Report and 15th in the 2022 Global Innovation Index, indicating a strong position in global economic competitiveness and innovation.",
      "• The Canadian economy ranks above most Western nations on The Heritage Foundation's Index of Economic Freedom, reflecting a relatively open and free-market environment.",
      "• Canada maintains a relatively low level of income disparity, with the average household disposable income per capita being \"well above\" the OECD average.",
      "• The country ranks among the lowest in the OECD for housing affordability and foreign direct investment, suggesting challenges in these areas.",
      "• Canada's social security system is highly efficient and robust, with social expenditures constituting approximately 23.1% of GDP among OECD members.",
      "• Since the early 20th century, Canada's economic structure has shifted from predominantly rural to urbanized and industrial, driven by growth in manufacturing, mining, and services sectors.",
      "• The service industry now employs about 75% of Canada's workforce, reflecting its dominance in the economy.",
      "• Canada has an unusually significant primary sector among developed nations, with forestry and petroleum industries being the most prominent components.",
      "• Many northern towns, where agriculture is limited, rely on nearby mining or timber industries for economic sustenance.",
      "• Canada invests around 1.70% of its GDP in advanced research and development across various economic sectors.",
      "• The country's economic integration with the United States has grown markedly since World War II, facilitated by multiple trade agreements.",
      "• The 1965 Automotive Products Trade Agreement opened Canada's borders to automobile manufacturing trade, fostering industry growth.",
      "• In the 1970s, Canada enacted the National Energy Program (NEP) and established the Foreign Investment Review Agency (FIRA) to address energy independence and foreign ownership concerns.",
      "• The NEP was abolished in the 1980s, and FIRA was renamed Investment in Canada to promote foreign investment.",
      "• The 1988 Canada–United States Free Trade Agreement (FTA) eliminated tariffs between the two nations, boosting bilateral trade.",
      "• NAFTA, established in 1994, expanded the free-trade zone to include Mexico, later replaced by the Canada–United States–Mexico Agreement (CUSMA).",
      "• As of 2023, Canada is a signatory to 15 free trade agreements involving 51 countries, underscoring its commitment to international trade liberalization.",
      "• Canada is one of the few developed nations that are net energy exporters, with Atlantic Canada possessing extensive offshore natural gas deposits.",
      "• Alberta hosts the world's fourth-largest oil reserves, including the vast Athabasca oil sands, which contribute to Canada's 13% of global oil reserves, making it the third or fourth-largest globally.",
      "• Canada is a major global supplier of agricultural products, with the Canadian Prairies being key producers of wheat, canola, and other grains.",
      "• The country is a leading exporter of minerals and metals, including zinc, uranium, gold, nickel, platinum group metals, aluminum, steel, iron ore, coking coal, lead, copper, molybdenum, cobalt, and cadmium.",
      "• Canada's manufacturing sector is concentrated in southern Ontario and Quebec, with automobiles and aeronautics as particularly significant industries.",
      "• The fishing industry also plays a vital role in Canada's economy, contributing to employment and exports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:15.798866",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4309,
      "bullet_points_count": 33
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Part of a series on the\n---\nEconomy of Canada\nEconomic history\n\n* Banking history\n* Petroleum history\n* Energy policy of Canada\n* Canadian dollar\n\n\nSectors\n\nPrimary sector\n\n\n\n* Agriculture\n* Energy\n* Petroleum\n* Electricity\n* Mining\n* Fishing\n* Forestry\n\nSecondary sector\n\n\n\n* Automotives\n\nTertiary sector\n\n\n\n* Social programs\n* Transport\n* Tourism\n\nFinance\n\n\n\n* Central Bank\n* Banking in Canada\n* Stock exchanges\n\nCompanies\n\n\n\n* Companies listed on the TSX\n\n\nEconomy by province\n\n* Alberta\n* Ontario\n* Quebec\n* Saskatchewan\n* _more..._\n\n\nEconomy by city\n\n* Montreal\n* Toronto\n* Vancouver\n* _more..._\n\n\n\n* Canada portal\n\n\n\nWith the exception of a few island nations in the Caribbean, Canada is the\nonly North American country to use the parliamentary system of government. As\na result, Canada has developed its own social and political institutions,\ndistinct from most other countries in the world. Though the Canadian economy\nis closely integrated with the American economy, it has developed unique\neconomic institutions.\n\nThe Canadian economic system generally combines elements of private enterprise\nand public enterprise. Many aspects of public enterprise, most notably the\ndevelopment of an extensive welfare spending system to redress social and\neconomic inequities, were adopted after the end of World War II in 1945.\n\nApproximately 89% of Canada's land is Crown land. Canada has one of the\nhighest levels of economic freedom in the world. Today Canada closely\nresembles the U.S. in its market-oriented economic system and pattern of\nproduction. As of 2019, Canada has 56 companies in the Forbes Global 2000\nlist, ranking ninth just behind South Korea and ahead of Saudi Arabia.\nInternational trade makes up a large part of the Canadian economy,\nparticularly of its natural resources. In 2009, agriculture, energy, forestry\nand mining exports accounted for about 58% of Canada's total exports.\nMachinery, equipment, automotive products and other manufactures accounted for\na further 38% of exports in 2009. In 2009, exports accounted for about 30% of\nCanada's GDP. The United States is by far its largest trading partner,\naccounting for about 73% of exports and 63% of imports as of 2009. Canada's\ncombined exports and imports ranked 8th among all nations in 2006.\n\nAbout 4% of Canadians are directly employed in primary resource fields, and\nthey account for 6.2% of GDP. They are still paramount in many parts of the\ncountry. Many, if not most, towns in northern Canada, where agriculture is\ndifficult, exist because of a nearby mine or source of timber. Canada is a\nworld leader in the production of many natural resources such as gold, nickel,\nuranium, diamonds, lead, and in recent years, crude petroleum, which, with the\nworld's second-largest oil reserves, is taking an increasingly prominent\nposition in natural resources extraction. Several of Canada's largest\ncompanies are based in natural resource industries, such as Encana, Cameco,\nGoldcorp, and Barrick Gold. The vast majority of these products are exported,\nmainly to the United States. There are also many secondary and service\nindustries that are directly linked to primary ones. For instance one of\nCanada's largest manufacturing industries is the pulp and paper sector, which\nis directly linked to the logging business.\n\nThe reliance on natural resources has several effects on the Canadian economy\nand Canadian society. While manufacturing and service industries are easy to\nstandardize, natural resources vary greatly by region. This ensures that\ndiffering economic structures developed in each region of Canada, contributing\nto Canada's strong regionalism. At the same time the vast majority of these\nresources are exported, integrating Canada closely into the international\neconomy. Howlett and Ramesh argue that the inherent instability of such\nindustries also contributes to greater government intervention in the economy,\nto reduce the social impact of market changes.\n\nNatural resource industries also raise important questions of sustainability.\nDespite many decades as a leading producer, there is little risk of depletion.\nLarge discoveries continue to be made, such as the massive nickel find at\nVoisey's Bay. Moreover, the far north remains largely undeveloped as producers\nawait higher prices or new technologies as many operations in this region are\nnot yet cost effective. In recent decades Canadians have become less willing\nto accept the environmental destruction associated with exploiting natural\nresources. High wages and Aboriginal land claims have also curbed expansion.\nInstead, many Canadian companies have focused their exploration, exploitation\nand expansion activities overseas where prices are lower and governments more\namenable. Canadian companies are increasingly playing important roles in Latin\nAmerica, Southeast Asia, and Africa.\n\nThe depletion of renewable resources has raised concerns in recent years.\nAfter decades of escalating overutilization the cod fishery all but collapsed\nin the 1990s, and the Pacific salmon industry also suffered greatly. The\nlogging industry, after many years of activism, has in recent years moved to a\nmore sustainable model, or to other countries.",
    "openai_summarised_points": [
      "• The economy of Canada is part of a broader series on Canadian economic history, including topics such as banking history, petroleum history, energy policy, and the Canadian dollar.",
      "• Canada’s economy is divided into three main sectors: primary, secondary, and tertiary.",
      "• The primary sector includes agriculture, energy, petroleum, electricity, mining, fishing, and forestry, reflecting Canada's rich natural resource base.",
      "• The secondary sector primarily involves manufacturing industries such as automotives, which contribute to industrial production.",
      "• The tertiary sector encompasses services such as social programs, transportation, and tourism, which form a significant part of Canada's service-oriented economy.",
      "• Canada's financial system includes a central bank, a well-developed banking sector, and stock exchanges, with companies listed on the Toronto Stock Exchange (TSX).",
      "• Several major Canadian companies are listed on the TSX, representing key industries and economic sectors.",
      "• The Canadian economy varies by province, with notable economic centers in Alberta, Ontario, Quebec, Saskatchewan, among others.",
      "• Major cities contributing to the economy include Montreal, Toronto, and Vancouver, each serving as economic hubs.",
      "• Canada is unique in North America for using a parliamentary system of government, shared with few island nations in the Caribbean, which has influenced its social and political institutions.",
      "• Although closely integrated with the U.S. economy, Canada has developed distinct economic institutions and a mixed economy combining private and public enterprise elements.",
      "• Many aspects of public enterprise, especially welfare programs aimed at addressing social and economic inequalities, were established after World War II ended in 1945.",
      "• Approximately 89% of Canada's land is Crown land, which is owned by the government.",
      "• Canada ranks highly in global economic freedom, reflecting a market-oriented economic system similar to that of the United States.",
      "• As of 2019, Canada has 56 companies listed in the Forbes Global 2000, ranking ninth globally, just behind South Korea and ahead of Saudi Arabia.",
      "• International trade is vital to Canada's economy, especially in natural resources; in 2009, exports from agriculture, energy, forestry, and mining accounted for about 58% of total exports.",
      "• Machinery, equipment, automotive products, and other manufactured goods made up approximately 38% of Canadian exports in 2009.",
      "• In 2009, exports represented about 30% of Canada's GDP.",
      "• The United States is Canada's largest trading partner, accounting for approximately 73% of Canadian exports and 63% of imports as of 2009.",
      "• In 2006, Canada's total exports and imports ranked 8th among all nations.",
      "• About 4% of Canadians are directly employed in primary resource industries, which contribute approximately 6.2% to the GDP.",
      "• Many towns in northern Canada depend economically on nearby mines or timber sources, especially where agriculture is impractical.",
      "• Canada is a leading global producer of natural resources including gold, nickel, uranium, diamonds, lead, and increasingly crude petroleum, which has the second-largest oil reserves in the world.",
      "• Several large Canadian resource companies include Encana, Cameco, Goldcorp, and Barrick Gold.",
      "• The majority of natural resource products are exported mainly to the United States, with secondary and service industries linked to primary industries, such as the pulp and paper sector connected to logging.",
      "• The reliance on natural resources influences regional economic development, leading to diverse economic structures across different regions and contributing to strong regionalism.",
      "• Natural resources' export orientation makes Canada highly integrated into the international economy, but also introduces economic instability, prompting increased government intervention to mitigate social impacts.",
      "• Despite decades of resource extraction, concerns about sustainability persist; discoveries like the large nickel deposit at Voisey's Bay exemplify ongoing resource potential.",
      "• The far north remains largely undeveloped due to high costs, technological limitations, and waiting for higher prices or new technologies.",
      "• Environmental concerns have grown, with Canadians increasingly opposed to environmental degradation caused by resource exploitation, influenced by high wages and Aboriginal land claims.",
      "• Many Canadian resource companies are expanding exploration and exploitation activities overseas in regions such as Latin America, Southeast Asia, and Africa, where costs are lower and governments more accommodating.",
      "• The depletion of renewable resources has raised sustainability issues; for example, the cod fishery collapsed in the 1990s after decades of overfishing, and the Pacific salmon industry also suffered significant declines.",
      "• The logging industry has shifted toward more sustainable practices or relocated to other countries following years of activism and environmental concerns."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:30.967764",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5193,
      "bullet_points_count": 33
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Measuring productivity",
    "text": "Productivity measures are key indicators of economic performance and a key\nsource of economic growth and competitiveness. OECD's _Compendium of\nProductivity Indicators_ , published annually, presents a broad overview of\nproductivity levels and growth in member nations, highlighting key measurement\nissues. It analyses the role of \"productivity as the main driver of economic\ngrowth and convergence\" and the \"contributions of labour, capital and MFP in\ndriving economic growth\". According to the definition above \"MFP is often\ninterpreted as the contribution to economic growth made by factors such as\ntechnical and organisational innovation\". Measures of productivity include the\ngross domestic product (GDP) and total factor productivity.",
    "openai_summarised_points": [
      "• Productivity measures are essential indicators of economic performance, serving as key sources of economic growth and competitiveness.",
      "• The Organisation for Economic Co-operation and Development (OECD) publishes the _Compendium of Productivity Indicators_ annually, providing a comprehensive overview of productivity levels and growth among member nations.",
      "• The OECD report emphasizes key measurement issues related to productivity assessment.",
      "• It analyzes the role of productivity as the primary driver of economic growth and convergence across economies.",
      "• The report highlights the contributions of three main factors to economic growth: labour, capital, and multi-factor productivity (MFP).",
      "• Multi-factor productivity (MFP) is often interpreted as the contribution to economic growth resulting from factors such as technical innovation and organizational improvements.",
      "• Measures of productivity include gross domestic product (GDP) and total factor productivity (TFP)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:34.654006",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 740,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Multifactor productivity",
    "text": "Another productivity measure, used by OECD, is the long-term trend in\nmultifactor productivity (MFP) also known as total factor productivity (TFP).\nThis indicator assesses an economy's \"underlying productive capacity\n('potential output'), itself an important measure of the growth possibilities\nof economies and of inflationary pressures\". MFP measures the residual growth\nthat cannot be explained by the rate of change in the services of labour,\ncapital and intermediate outputs, and is often interpreted as the contribution\nto economic growth made by factors such as technical and organisational\ninnovation.\n\nAccording to OECD's annual economic survey of Canada in June 2012, Canada has\nexperienced weak growth of multi-factor productivity (MFP) and has been\ndeclining further since 2002. One of the ways MFP growth is raised is by\nboosting innovation and Canada's innovation indicators such as business R&D\nand patenting rates were poor. Raising MFP growth is \"needed to sustain rising\nliving standards, especially as the population ages\".\n\nSince 2010, productivity growth has picked up, almost entirely driven by above\naverage multifactor productivity growth. However, productivity on the whole\nstill lags behind the upper half of OECD countries such as the United States.\nCanada's productivity is now around the median OECD productivity, close to\nthat of Australia. More can be done to increase productivity, such as\nincreasing the productivity of capital through improving the capital stock to\noutput ratio and capital quality. This could be achieved through the\nliberalization of internal trade barriers, as suggested in the OECD's latest\nCanadian economic survey.",
    "openai_summarised_points": [
      "• Multifactor productivity (MFP), also known as total factor productivity (TFP), is a long-term trend measure used by the OECD to evaluate an economy’s underlying productive capacity or potential output, which is a key indicator of economic growth prospects and inflationary pressures.",
      "• MFP assesses the residual growth in an economy that cannot be explained by changes in the services of labour, capital, and intermediate outputs, and is often interpreted as the contribution of technological and organizational innovation to economic growth.",
      "• According to the OECD’s annual economic survey of Canada published in June 2012, Canada has experienced weak growth in MFP, which has been declining further since 2002.",
      "• One method to increase MFP growth is by boosting innovation; however, Canada's innovation indicators, such as business R&D expenditure and patenting rates, have been poor.",
      "• Enhancing MFP growth is essential for sustaining rising living standards, particularly in the context of an aging population.",
      "• Since 2010, Canada’s productivity growth has improved, driven almost entirely by above-average multifactor productivity growth.",
      "• Despite recent improvements, Canada's overall productivity still lags behind the upper half of OECD countries, such as the United States.",
      "• Currently, Canada's productivity level is approximately at the OECD median, comparable to that of Australia.",
      "• To further increase productivity, Canada can focus on improving the productivity of capital by enhancing the capital stock to output ratio and capital quality.",
      "• Suggested strategies for improving capital productivity include the liberalization of internal trade barriers, as recommended in the OECD’s latest Canadian economic survey."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:40.696738",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1671,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Bank of Canada",
    "text": "The mandate of the central bank—the Bank of Canada is to conduct monetary\npolicy that \"preserves the value of money by keeping inflation low and\nstable\".",
    "openai_summarised_points": [
      "• The Bank of Canada is the central bank of Canada, responsible for conducting monetary policy within the country.",
      "• Its primary mandate is to \"preserve the value of money by keeping inflation low and stable.\"",
      "• The overarching goal of the Bank of Canada's monetary policy is to maintain price stability, which supports economic growth and employment.",
      "• The Bank of Canada aims to keep inflation close to a target rate of 2%, with a control range typically between 1% and 3%.",
      "• The institution uses various tools to implement monetary policy, including setting the target for the overnight rate, conducting open market operations, and influencing the money supply.",
      "• The Bank of Canada’s decisions on interest rates directly impact borrowing costs, consumer spending, and investment in the economy.",
      "• The Bank’s monetary policy framework emphasizes transparency and accountability, with regular reports and communications to inform the public and markets.",
      "• The Bank of Canada was established in 1934 and operates independently from the government to ensure objective monetary policy decisions.",
      "• Its operations are guided by the Bank of Canada Act, which outlines its responsibilities and mandates.",
      "• The Bank’s monetary policy decisions are made by the Governing Council, which meets approximately eight times per year.",
      "• The Bank also plays a role in issuing and distributing Canada’s banknotes and maintaining the stability of the financial system.",
      "• The Bank of Canada’s monetary policy actions are aimed at achieving its inflation target while supporting economic stability and confidence in the Canadian dollar."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:46.115665",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 153,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Monetary Policy Report",
    "text": "The Bank of Canada issues its bank rate announcement through its Monetary\nPolicy Report which is released eight times a year. The Bank of Canada, a\nfederal crown corporation, has the responsibility of Canada's monetary system.\nUnder the inflation-targeting monetary policy that has been the cornerstone of\nCanada's monetary and fiscal policy since the early 1990s, the Bank of Canada\nsets an inflation target The inflation target was set at 2 per cent, which is\nthe midpoint of an inflation range of 1 to 3 per cent. They established a set\nof inflation-reduction targets to keep inflation \"low, stable and predictable\"\nand to foster \"confidence in the value of money\", contribute to Canada's\nsustained growth, employment gains and improved standard of living.\n\nIn a January 9, 2019 statement on the release of the Monetary Policy Report,\nBank of Canada Governor Stephen S. Poloz summarized major events since the\nOctober report, such as \"negative economic consequences\" of the US-led trade\nwar with China. In response to the ongoing trade war \"bond yields have fallen,\nyield curves have flattened even more and stock markets have repriced\nsignificantly\" in \"global financial markets\". In Canada, low oil prices will\nimpact Canada's \"macroeconomic outlook\". Canada's housing sector is not\nstabilizing as quickly as anticipated.",
    "openai_summarised_points": [
      "• The Bank of Canada issues its bank rate announcement through its Monetary Policy Report, which is released eight times annually.",
      "• The Bank of Canada is a federal crown corporation responsible for overseeing Canada's monetary system.",
      "• Since the early 1990s, Canada has adopted an inflation-targeting monetary policy, which has been the cornerstone of its monetary and fiscal policy framework.",
      "• The Bank of Canada sets an inflation target of 2 percent, which is the midpoint of an established inflation range of 1 to 3 percent.",
      "• The inflation-targeting policy aims to keep inflation \"low, stable and predictable,\" thereby fostering confidence in the value of money.",
      "• The policy also seeks to contribute to Canada's sustained economic growth, employment gains, and improved standard of living.",
      "• On January 9, 2019, Bank of Canada Governor Stephen S. Poloz issued a statement summarizing major events since the October 2018 Monetary Policy Report.",
      "• Key events included the \"negative economic consequences\" of the US-led trade war with China.",
      "• In response to the trade war, global financial markets experienced falling bond yields, more flattened yield curves, and significant re-pricing of stock markets.",
      "• In Canada, low oil prices are expected to negatively impact the country's macroeconomic outlook.",
      "• Canada's housing sector has not been stabilizing as quickly as anticipated, indicating ongoing vulnerabilities in the housing market."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:01:51.596916",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1326,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Inflation targeting",
    "text": "During the period that John Crow was Governor of the Bank of Canada—1987 to\n1994—there was a worldwide recession and the bank rate rose to around 14% and\nunemployment topped 11%. Although since that time inflation-targeting has been\nadopted by \"most advanced-world central banks\", in 1991 it was innovative and\nCanada was an early adopter when the then-Finance Minister Michael Wilson\napproved the Bank of Canada's first inflation-targeting in the 1991 federal\nbudget. The inflation target was set at 2 per cent. Inflation is measured by\nthe total consumer price index (CPI). In 2011 the Government of Canada and the\nBank of Canada extended Canada's inflation-control target to December 31,\n2016. The Bank of Canada uses three unconventional instruments to achieve the\ninflation target: \"a conditional statement on the future path of the policy\nrate\", quantitative easing, and credit easing.\n\nAs a result, interest rates and inflation eventually came down along with the\nvalue of the Canadian dollar. From 1991 to 2011 the inflation-targeting regime\nkept \"price gains fairly reliable\".\n\nFollowing the Great Recession, the narrow focus of inflation-targeting as a\nmeans of providing stable growth in the Canadian economy was questioned. By\n2011, the then-Bank of Canada Governor Mark Carney argued that the central\nbank's mandate would allow for a more flexible inflation-targeting in specific\nsituations where he would consider taking longer \"than the typical six to\neight quarters to return inflation to 2 per cent\".\n\nOn July 15, 2015, the Bank of Canada announced that it was lowering its target\nfor the overnight rate by another one-quarter percentage point, to 0.5 per\ncent \"to try to stimulate an economy that appears to have failed to rebound\nmeaningfully from the oil shock woes that dragged it into decline in the first\nquarter\". According to the Bank of Canada announcement, in the first quarter\nof 2015, the total Consumer price index (CPI) inflation was about 1 per cent.\nThis reflects \"year-over-year price declines for consumer energy products\".\nCore inflation in the first quarter of 2015 was about 2 per cent with an\nunderlying trend in inflation at about 1.5 to 1.7 per cent.\n\nIn response to the Bank of Canada's July 15, 2015 rate adjustment, Prime\nMinister Stephen Harper explained that the economy was \"being dragged down by\nforces beyond Canadian borders such as global oil prices, the European debt\ncrisis, and China's economic slowdown\" which has made the global economy\n\"fragile\".\n\nThe Chinese stock market had lost about US$3 trillion of wealth by July 2015\nwhen panicked investors sold stocks, which created declines in the commodities\nmarkets, which in turn negatively impacted resource-producing countries like\nCanada.\n\nThe Bank's main priority has been to keep inflation at a moderate level. As\npart of that strategy, interest rates were kept at a low level for almost\nseven years. Since September 2010, the key interest rate (overnight rate) was\n0.5%. In mid 2017, inflation remained below the Bank's 2% target, (at 1.6%)\nmostly because of reductions in the cost of energy, food and automobiles; as\nwell, the economy was in a continuing spurt with a predicted GDP growth of 2.8\npercent by year end. Early on July 12, 2017, the bank issued a statement that\nthe benchmark rate would be increased to 0.75%.\n\nFollowing the COVID-19 pandemic, critics have pointed out that the Bank of\nCanada's inflation-targeting has had unintended consequences, such as fuelling\nan increase in home prices and contributing to wealth inequalities by\nsupporting higher equity values."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Key industries",
    "text": "In 2020, the Canadian economy had the following relative weighting by the\nindustry as a percentage value of GDP:\n\nIndustry | Share of GDP\n---|---\nReal estate and rental and leasing | 13.01%\nManufacturing | 10.37%\nMining, quarrying, and oil and gas extraction | 8.21%\nFinance and insurance | 7.06%\nConstruction | 7.08%\nHealth care and social assistance | 6.63%\nPublic administration | 6.28%\nWholesale trade | 5.78%\nRetail trade | 5.60%\nProfessional, scientific and technical services | 5.54%\nEducational services | 5.21%\nTransportation and warehousing | 4.60%\nInformation and cultural industries | 3.00%\nAdministrative and support, waste management, and remediation services | 2.46%\nUtilities | 2.21%\nAccommodation and food services | 2.15%\nOther services (except public administration) | 1.89%\nAgriculture, forestry, fishing, and hunting | 1.53%\nArts, entertainment and recreation | 0.77%\nManagement of companies and enterprises | 0.62%"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Real estate, rental, and leasing",
    "text": "Canada's real estate market is the backbone of the economy, comprising over\n13% of the GDP by sector in 2020. In 2021, housing investment accounted for\n21% of national wealth. It is difficult to discern the actual contribution of\nother sectors (Construction, Investment and Financial Services, Manufacturing,\nForestry, etc.) to Real Estate, Rental and Leasing, as these industries are\nintrinsically linked in a complex economy. The Bank of Canada has increased\nits mortgage bond holdings to target 50% of the fixed-rate primary issuances."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Service sector",
    "text": "The service sector in Canada is vast and multifaceted, employing about three\nquarters of Canadians and accounting for 70% of GDP. The largest employer is\nthe retail sector, employing almost 12% of Canadians. The retail industry is\nconcentrated mainly in a small number of chain stores clustered together in\nshopping malls. In recent years, there has been an increase in the number of\nbig-box stores, such as Walmart (of the United States), Real Canadian\nSuperstore, and Best Buy (of the United States). This has led to fewer workers\nin this sector and the migration of retail jobs to the suburbs.\n\nThe Financial District in Downtown Vancouver. Canadian business services are\nlargely concentrated in large urban areas of Canada.\n\nThe second-largest portion of the service sector is the business service, and\nit employs only a slightly smaller percentage of the population. This includes\nthe financial services, real estate, and communications industries. This\nportion of the economy has been rapidly growing in recent years. It is largely\nconcentrated in the major urban centres, especially Toronto, Montreal and\nVancouver (see Banking in Canada).\n\nThe education and health sectors are two of Canada's largest, but both are\nprimarily under the influence of the government. The health care industry has\nbeen quickly growing and is the third-largest in Canada.\n\nCanada has an important high tech industry, and a burgeoning film, television,\nand entertainment industry creating content for local and international\nconsumption (see Media in Canada). Tourism is of ever increasing importance,\nwith the vast majority of international visitors coming from the United\nStates. Casino gaming is currently the fastest-growing component of the\nCanadian tourism industry, contributing $5 billion in profits for Canadian\ngovernments and employing 41,000 Canadians as of 2001."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Manufacturing",
    "text": "Ford's Oakville Assembly in the Greater Toronto Area. Central Canada is home\nto several auto factories of the major American and Japanese automakers.\n\nThe general pattern of development for wealthy nations was a transition from a\nraw material production-based economy to a manufacturing-based economy and\nthen to a service-based economy. At its World War II peak in 1944, Canada's\nmanufacturing sector accounted for 29% of GDP, declining to 10.37% in 2017.\nCanada has not suffered as greatly as most other rich, industrialized nations\nfrom the pains of the relative decline in the importance of manufacturing\nsince the 1960s. A 2009 study by Statistics Canada also found that, while\nmanufacturing declined as a relative percentage of GDP from 24.3% in the 1960s\nto 15.6% in 2005, manufacturing volumes between 1961 and 2005 kept pace with\nthe overall growth in the volume index of GDP. Manufacturing in Canada\ndeclined significantly during the Great Recession. As of 2017, manufacturing\naccounts for 10% of Canada's GDP, a relative decline of more than 5% of GDP\nsince 2005.\n\nCentral Canada is home to branch plants to all the major American and Japanese\nautomobile makers and many parts factories owned by Canadian firms such as\nMagna International and Linamar Corporation."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.3.1",
    "section_name": "Steel",
    "text": "ArcelorMittal Dofasco, view from Burlington Street\n\nCanada was the world's nineteenth-largest steel exporter in 2018. In year-to-\ndate 2019 (through March), further referred to as YTD 2019, Canada exported\n1.39 million metric tons of steel, a 22 percent decrease from 1.79 million\nmetric tons in YTD 2018. Based on available data, Canada's exports represented\nabout 1.5 percent of all steel exported globally in 2017. By volume, Canada's\n2018 steel exports represented just over one-tenth the volume of the world's\nlargest exporter, China. In value terms, steel represented 1.4 percent of the\ntotal goods Canada exported in 2018. The growth in exports in the decade since\n2009 has been 29%. The largest producers in 2018 were ArcelorMittal, Essar\nSteel Algoma, and the first of those alone accounted for roughly half of\nCanadian steel production through its two subsidiaries. The top two markets\nfor Canada's exports were its NAFTA partners, and by themselves accounted for\n92 percent of exports by volume. Canada sent 83 percent of its steel exports\nto the United States in YTD 2019. The gap between domestic demand and domestic\nproduction increased to −2.4 million metric tons, up from −0.2 million metric\ntons in YTD 2018. In YTD 2019, exports as a share of production decreased to\n41.6 percent from 53 percent in YTD 2018.\n\nIn 2017, heavy industry accounted for 10.2% of Canada's greenhouse gas\nemissions."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Mining",
    "text": "Canada is one of the largest producers of metals (as of 2019):\n\nMetal  | World rank  | Ref.\n---|---|---\nPlatinum | 4  |\nGold | 5  |\nNickel | 5  |\nCopper | 10  |\nIron (ore)  | 8  |\nTitanium | 4  |\nPotash | 1  |\nNiobium | 2  |\nMolybdenum | 7 |\nCobalt | 7 |\nLithium | 8 |\nZinc | 8 |\n\nIn 2019, the country was also the 4th largest world producer of sulfur; the\n13th largest world producer of gypsum; the 14th worldwide producer of\nantimony; the world's 10th largest producer of graphite; in addition to being\nthe 6th largest world producer of salt. It was the 2nd largest producer in the\nworld of uranium in 2018."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Energy",
    "text": "Canada has access to cheap sources of energy because of its geography. This\nhas enabled the creation of several important industries, such as the large\naluminum industries in British Columbia and Quebec. Canada is also one of the\nworld's highest per capita consumers of energy."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.5.1",
    "section_name": "Electricity",
    "text": "The electricity sector in Canada has played a significant role in the economic\nand political life of the country since the late 19th century. The sector is\norganized along provincial and territorial lines. In a majority of provinces,\nlarge government-owned integrated public utilities play a leading role in the\ngeneration, transmission and distribution of electricity. Ontario and Alberta\nhave created electricity markets in the last decade in order to increase\ninvestment and competition in this sector of the economy. In 2017, the\nelectricity sector accounted for 10% of total national greenhouse gas\nemissions. Canada has substantial electricity trade with the neighbouring\nUnited States amounting to 72 TWh exports and 10 TWh imports in 2017.\n\nHydroelectricity accounted for 59% of all electric generation in Canada in\n2016, making Canada the world's second-largest producer of hydroelectricity\nafter China. Since 1960, large hydroelectric projects, especially in Quebec,\nBritish Columbia, Manitoba and Newfoundland and Labrador, have significantly\nincreased the country's generation capacity.\n\nThe second-largest single source of power (15% of the total) is nuclear power,\nwith several plants in Ontario generating more than half of that province's\nelectricity and one generator in New Brunswick. This makes Canada the world's\nsixth-largest electricity producer generated by nuclear power, producing 95\nTWh in 2017.\n\nFossil fuels provide 19% of Canadian electric power, about half as coal (9% of\nthe total), and the remainder a mix of natural gas and oil. Only five\nprovinces use coal for electricity generation. Alberta, Saskatchewan, and Nova\nScotia rely on coal for nearly half of their generation, while other provinces\nand territories use little or none. Alberta and Saskatchewan also use a\nsubstantial amount of natural gas. Remote communities, including all of\nNunavut and much of the Northwest Territories, produce most of their\nelectricity from diesel generators at high economic and environmental costs.\nThe federal government has set up initiatives to reduce dependence on diesel-\nfired electricity.\n\nNon-hydro renewables are a fast-growing portion of the total, at 7% in\n2016.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.5.2",
    "section_name": "Oil and gas",
    "text": "Syncrude's Mildred Lake plant site at the Athabasca oil sands in Alberta\n\nCanada possesses extensive oil and gas resources centered in Alberta, and the\nNorthern Territories but is also present in neighboring British Columbia and\nSaskatchewan. The vast Athabasca oil sands give Canada the world's third-\nlargest reserves of oil after Saudi Arabia and Venezuela, according to USGS.\nThe oil and gas industry represents 27% of Canada's total greenhouse gas\nemissions, an increase of 84% since 1990, mostly due to the development of the\noil sands.\n\nHistorically, an important issue in Canadian politics is the interplay between\nthe oil and energy industry in Western Canada and the industrial heartland of\nSouthern Ontario. Foreign investment in Western oil projects has fueled\nCanada's rising dollar. This has raised the price of Ontario's manufacturing\nexports and made them less competitive, a problem similar to the decline of\nthe manufacturing sector in the Netherlands.\n\nThe National Energy Policy of the early 1980s attempted to make Canada oil-\nsufficient and to ensure equal supply and price of oil in all parts of Canada,\nespecially for the eastern manufacturing base. This policy proved deeply\ndivisive as it forced Alberta to sell low-priced oil to eastern Canada. The\npolicy was eliminated 5 years after it was first announced amid a collapse of\noil prices in 1985. The new Prime Minister Brian Mulroney had campaigned\nagainst the policy in the 1984 Canadian federal election. One of the most\ncontroversial sections of the Canada–United States Free Trade Agreement of\n1988 was a promise that Canada would never charge the United States more for\nenergy than fellow Canadians."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Agriculture",
    "text": "An inland grain terminal along the Yellowhead Highway in Saskatchewan\n\nCanada is one of the world's largest suppliers of agricultural products,\nparticularly wheat and other grains. Canada is a major exporter of\nagricultural products, to the United States and Asia. As with all other\ndeveloped nations, the proportion of the population and GDP devoted to\nagriculture fell dramatically over the 20th century. The agriculture and agri-\nfood manufacturing sector created $49.0 billion to Canada's GDP in 2015,\naccounting for 2.6% of total GDP. This sector also accounts for 8.4% of\nCanada's Greenhouse gas emissions.\n\nThe Canadian agriculture industry receives significant government subsidies\nand support as with other developed nations. However, Canada has strongly\nsupported reducing market influencing subsidies through the World Trade\nOrganization.[_citation needed_] In 2000, Canada spent approximately CDN$4.6\nbillion on support for the industry.[_citation needed_] $2.32 billion was\nclassified under the WTO designation of \"green box\" license, meaning it did\nnot directly influence the market, such as money for research or disaster\nrelief.[_citation needed_] All but $848.2 million were subsidies worth less\nthan 5% of the value of the crops they were provided for.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Free-trade agreements",
    "text": "Canada\n\nFree-trade areas"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Free-trade agreements in force",
    "text": "Source:\n\n* Canada–Israel Free Trade Agreement (Entered into force January 1, 1997, modernization ongoing)\n* Canada–Chile Free Trade Agreement (Entered into force July 5, 1997)\n* Canada–Costa Rica Free Trade Agreement (Entered into force November 1, 2002, modernization ongoing)\n* Canada–European Free Trade Association Free Trade Agreement (Iceland, Norway, Switzerland and Liechtenstein; entered into force July 1, 2009)\n* Canada–Peru Free Trade Agreement (Entered into force August 1, 2009)\n* Canada–Colombia Free Trade Agreement (Signed November 21, 2008, entered into force August 15, 2011; Canada's ratification of this FTA had been dependent upon Colombia's ratification of the \"Agreement Concerning Annual Reports on Human Rights and Free Trade Between Canada and the Republic of Colombia\" signed on May 27, 2010)\n* Canada–Jordan Free Trade Agreement (Signed on June 28, 2009, entered into force October 1, 2012)\n* Canada–Panama Free Trade Agreement (Signed on May 14, 2010, entered into force April 1, 2013)\n* Canada–South Korea Free Trade Agreement (Signed on March 11, 2014, entered into force January 1, 2015)\n* Canada–Ukraine Free Trade Agreement (Signed 11 July 2016, entered into force August 1, 2017)\n* Comprehensive Economic and Trade Agreement with the European Union (EU) (signed 30 October 2016, entered into force 21 September 2017)\n* Comprehensive and Progressive Agreement for Trans-Pacific Partnership (signed March 8, 2018, entered into force December 30, 2018)\n* Canada–United States–Mexico Agreement (signed November 30, 2018, entered into force July 1, 2020)\n* Canada–UK Trade Continuity Agreement (signed 9 December 2020, entered into force 1 April 2021)"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Free-trade agreements no longer in force",
    "text": "Source:\n\n* Canada–U.S. Free Trade Agreement (signed October 12, 1987, entered into force January 1, 1989, later superseded by NAFTA)\n* Trans-Pacific Partnership (concluded October 5, 2015, superseded by CPTPP)\n* North American Free Trade Agreement (entered into force January 1, 1994, later superseded by USMCA)"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Ongoing free-trade agreements negotiations",
    "text": "Source:\n\nCanada is negotiating bilateral FTAs with the following countries respectively\ntrade blocs:\n\n* Caribbean Community (CARICOM)\n* Guatemala, Nicaragua and El Salvador\n* Dominican Republic\n* India\n* Japan\n* Morocco\n* Singapore\n* Andean Community (FTA's are already in force with Peru and Colombia)\n\nCanada has been involved in negotiations to create the following regional\ntrade blocks:\n\n* Canada and Central American Free Trade Agreement\n* Free Trade Area of the Americas (FTAA)"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Canada–United States trade relations",
    "text": "Canada and the United States share a common trading relationship. Canada's job\nmarket continues to perform well along with the US, reaching a 30-year low in\nthe unemployment rate in December 2006, following 14 consecutive years of\nemployment growth.\n\nFlags of Canada and the United States\n\nThe United States is by far Canada's largest trading partner, with more than\n$1.7 billion CAD in trade per day in 2005. In 2009, 73% of Canada's exports\nwent to the United States, and 63% of Canada's imports were from the United\nStates. Trade with Canada makes up 23% of the United States' exports and 17%\nof its imports. By comparison, in 2005 this was more than U.S. trade with all\ncountries in the European Union combined, and well over twice U.S. trade with\nall the countries of Latin America combined. Just the two-way trade that\ncrosses the Ambassador Bridge between Michigan and Ontario equals all U.S.\nexports to Japan. Canada's importance to the United States is not just a\nborder-state phenomenon: Canada is the leading export market for 35 of 50 U.S.\nstates, and is the United States' largest foreign supplier of energy.\n\nBilateral trade increased by 52% between 1989, when the U.S.–Canada Free Trade\nAgreement (FTA) went into effect, and 1994, when the North American Free Trade\nAgreement (NAFTA) superseded it. Trade has since increased by 40%. NAFTA\ncontinues the FTA's moves toward reducing trade barriers and establishing\nagreed-upon trade rules. It also resolves some long-standing bilateral\nirritants and liberalizes rules in several areas, including agriculture,\nservices, energy, financial services, investment, and government procurement.\nNAFTA forms the largest trading area in the world, embracing the 405 million\npeople of the three North American countries.\n\nThe largest component of U.S.–Canada trade is in the commodity sector.\n\nThe U.S. is Canada's largest agricultural export market, taking well over half\nof all Canadian food exports. Nearly two-thirds of Canada's forest products,\nincluding pulp and paper, are exported to the United States; 72% of Canada's\ntotal newsprint production also is exported to the U.S.\n\nAt $73.6 billion in 2004, U.S.-Canada trade in energy is the largest U.S.\nenergy trading relationship, with the overwhelming majority ($66.7 billion)\nbeing exports from Canada. The primary components of U.S. energy trade with\nCanada are petroleum, natural gas, and electricity. Canada is the United\nStates' largest oil supplier and the fifth-largest energy producing country in\nthe world. Canada provides about 16% of U.S. oil imports and 14% of total U.S.\nconsumption of natural gas. The United States and Canada's national\nelectricity grids are linked, and both countries share hydropower facilities\non the western borders.\n\nWhile most of U.S.-Canada trade flows smoothly, there are occasionally\nbilateral trade disputes, particularly in the agricultural and cultural\nfields.[_citation needed_] Usually these issues are resolved through bilateral\nconsultative forums or referral to World Trade Organization (WTO) or NAFTA\ndispute resolution.[_citation needed_] In May 1999, the U.S. and Canadian\ngovernments negotiated an agreement on magazines that provides increased\naccess for the U.S. publishing industry to the Canadian market. The United\nStates and Canada also have resolved several major issues involving fisheries.\nBy common agreement, the two countries submitted a Gulf of Maine boundary\ndispute to the International Court of Justice in 1981; both accepted the\ncourt's October 12, 1984 ruling which demarcated the territorial sea boundary.\nA current issue between the United States and Canada is the ongoing softwood\nlumber dispute, as the U.S. alleges that Canada unfairly subsidizes its\nforestry industry.[_citation needed_]\n\nIn 1990, the United States and Canada signed a bilateral Fisheries Enforcement\nAgreement, which has served to deter illegal fishing activity and reduce the\nrisk of injury during fisheries enforcement incidents. The U.S. and Canada\nsigned a Pacific Salmon Agreement in June 1999 that settled differences over\nimplementation of the 1985 Pacific Salmon Treaty for the next decade.\n\nCanada and the United States signed an aviation agreement during Bill\nClinton's visit to Canada in February 1995, and air traffic between the two\ncountries has increased dramatically as a result. The two countries also share\nin operation of the St. Lawrence Seaway, connecting the Great Lakes to the\nAtlantic Ocean.\n\nThe U.S. remains Canada's largest foreign investor and the most popular\ndestination for Canadian foreign investments. In 2018, the stock of U.S.\ndirect investment in Canada totaled $406 billion, while the stock of Canadian\ninvestment in the U.S. totaled $595 billion, or 46% of the overall CDIA stock\nfor 2018. This made Canada the second largest investing country in the U.S.\nfor 2018 US investments are primarily directed at Canada's mining and smelting\nindustries, petroleum, chemicals, the manufacture of machinery and\ntransportation equipment, and finance, while Canadian investment in the United\nStates is concentrated in manufacturing, wholesale trade, real estate,\npetroleum, finance, insurance and other services."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Debt",
    "text": "Canada bonds\n\nInverted yield curve in 2006–2007 and 2019\n\n30 year\n\n10 year\n\n2 year\n\n1 year\n\n3 month\n\n1 month"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Canadian government debt",
    "text": "Canadian government debt, also called Canada's public debt, is the liabilities\nof the government sector. For 2019 (the fiscal year ending 31 March 2020),\ntotal financial liabilities or gross debt was $2.434 trillion for the\nconsolidated Canadian general government (federal, provincial, territorial,\nand local governments combined). This corresponds to 105.3% as a ratio of GDP\n(GDP was $2.311 trillion). Of the $2.434 trillion, $1.146 trillion or 47% was\nfederal (central) government liabilities (49.6% as a ratio of GDP). Provincial\ngovernment liabilities comprise most of the remaining liabilities."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Household debt",
    "text": "Household debt, the amount of money that all adults in the household owe\nfinancial institutions, includes consumer debt and mortgage loans. In March\n2015, the International Monetary Fund reported that Canada's high household\ndebt was one of two vulnerable domestic areas in Canada's economy; the second\nis its overheated housing market.\n\nAccording to Statistics Canada, total household credit as of July 2019 was\nCAD$2.2 trillion. According to Philip Cross of the Fraser Institute, in May\n2015, while the Canadian household debt-to-income ratio is similar to that in\nthe US, however lending standards in Canada are tighter than those in the\nUnited States to protect against high-risk borrowers taking out unsustainable\ndebt."
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Mergers and acquisitions",
    "text": "Since 1985, 63,755 deals in- and outbound Canada have been announced,[_when?_]\nwith an overall value of US$3.7 billion. Almost 50% of the targets of Canadian\ncompanies (outbound deals) have a parent company in the US. Inbound deals are\n82% percent from the US.\n\nHere is a list of the biggest deals in Canadian history:\n\nRank  | Date announced  | Acquiror name  | Acquiror nation  | Target name  | Target nation  | Value (in bil. USD)\n---|---|---|---|---|---|---\n1  | January 26, 2000  | Spin-off  | Canada  | Nortel Networks Corp  | Canada  | 59.97\n2  | June 20, 2000  | Vivendi SA  | France  | Seagram Co Ltd  | Canada  | 40.43\n3  | December 7, 2007  | Rio Tinto Canada Holdings Inc  | Canada  | Alcan Inc  | Canada  | 37.63\n4  | June 9, 2016  | Enbridge Inc  | Canada  | Spectra Energy Corp  | United States  | 28.29\n5  | March 12, 2014  | Enbridge Income Fund  | Canada  | Enbridge Inc-Liquids  | Canada  | 24.79\n6  | November 5, 2008  | Shareholders  | Canada  | Cenovus Energy Inc  | Canada  | 20.26\n7  | July 23, 2012  | CNOOC Canada Holding Ltd  | Canada  | Nexen Inc  | Canada  | 19.12\n8  | May 15, 2006  | Xstrata PLC  | Switzerland  | Falconbridge Ltd  | Canada  | 17.40\n9  | November 8, 2006  | Cia Vale do Rio Doce SA  | Brazil  | Inco Ltd  | Canada  | 17.15\n10  | March 23, 2009  | Suncor Energy Inc  | Canada  | Petro-Canada  | Canada  | 15.58\n11  | July 29, 2008  | Teck Cominco Ltd  | Canada  | Fording Canadian Coal Trust  | Canada  | 13.60"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Raw data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates for 2022–2027). Inflation below 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 288.7  | 11,798.2  | 276.1  | 11,281.4  | 2.2%  | 10.2%  | 7.5%  | 44.6%\n1981  | 327.1  | 13,197.5  | 307.2  | 12,396.7  | 3.5%  | 12.5%  | 7.6%  | 46.1%\n1982  | 336.2  | 13,404.9  | 314.6  | 12,543.9  | -3.2%  | 10.8%  | 11.1%  | 51.7%\n1983  | 358.5  | 14,149.5  | 341.9  | 13,493.2  | 2.6%  | 5.8%  | 12.0%  | 57.2%\n1984  | 393.4  | 15,380.2  | 356.7  | 13,947.4  | 5.9%  | 4.3%  | 11.4%  | 60.2%\n1985  | 425.0  | 16,466.0  | 366.2  | 14,185.9  | 4.7%  | 4.0%  | 10.5%  | 65.2%\n1986  | 442.9  | 16,990.4  | 379.0  | 14,539.8  | 2.1%  | 4.2%  | 9.6%  | 69.3%\n1987  | 472.3  | 17,893.0  | 433.1  | 16,408.1  | 4.1%  | 4.4%  | 8.8%  | 69.8%\n1988  | 510.6  | 19,085.3  | 509.4  | 19,041.2  | 4.4%  | 4.0%  | 7.8%  | 69.7%\n1989  | 542.9  | 19,947.7  | 567.2  | 20,842.5  | 2.3%  | 5.0%  | 7.5%  | 71.0%\n1990  | 564.1  | 20,415.1  | 596.1  | 21,572.1  | 0.2%  | 4.8%  | 8.2%  | 73.7%\n1991  | 571.0  | 20,403.3  | 612.5  | 21,885.6  | -2.1%  | 5.6%  | 10.3%  | 81.7%\n1992  | 589.3  | 20,805.6  | 594.4  | 20,984.8  | 0.9%  | 1.5%  | 11.2%  | 88.2%\n1993  | 619.3  | 21,615.6  | 579.1  | 20,210.5  | 2.7%  | 1.9%  | 11.4%  | 94.7%\n1994  | 661.0  | 22,823.8  | 579.9  | 20,024.6  | 4.5%  | 0.2%  | 10.4%  | 97.5%\n1995  | 693.0  | 23,682.4  | 605.9  | 20,706.7  | 2.7%  | 2.1%  | 9.5%  | 100.1%\n1996  | 717.1  | 24,252.2  | 630.6  | 21,325.7  | 1.6%  | 1.6%  | 9.6%  | 100.2%\n1997  | 760.7  | 25,469.8  | 655.0  | 21,930.5  | 4.3%  | 1.6%  | 9.1%  | 95.3%\n1998  | 799.3  | 26,532.4  | 634.0  | 21,046.6  | 3.9%  | 1.0%  | 8.3%  | 93.3%\n1999  | 852.4  | 28,068.8  | 678.4  | 22,340.6  | 5.2%  | 1.7%  | 7.6%  | 89.0%\n2000  | 916.8  | 29,914.7  | 744.6  | 24,296.7  | 5.2%  | 2.7%  | 6.8%  | 80.4%\n2001  | 954.2  | 30,810.5  | 739.0  | 23,859.7  | 1.8%  | 2.5%  | 7.2%  | 81.5%\n2002  | 998.4  | 31,887.8  | 760.1  | 24,279.2  | 3.0%  | 2.3%  | 7.7%  | 79.6%\n2003  | 1,036.4  | 32,794.3  | 895.6  | 28,338.7  | 1.8%  | 2.8%  | 7.6%  | 75.9%\n2004  | 1,097.1  | 34,390.0  | 1,026.5  | 32,176.6  | 3.1%  | 1.9%  | 7.2%  | 71.9%\n2005  | 1,167.7  | 36,260.7  | 1,173.5  | 36,439.6  | 3.2%  | 2.2%  | 6.8%  | 70.6%\n2006  | 1,235.5  | 37,980.7  | 1,319.4  | 40,558.9  | 2.6%  | 2.0%  | 6.3%  | 69.9%\n2007  | 1,295.2  | 39,428.2  | 1,468.9  | 44,717.0  | 2.1%  | 2.1%  | 6.1%  | 66.9%\n2008  | 1,333.3  | 40,159.1  | 1,552.9  | 46,773.8  | 1.0%  | 2.4%  | 6.2%  | 67.9%\n2009  | 1,302.5  | 38,788.0  | 1,376.5  | 40,990.6  | -2.9%  | 0.3%  | 8.4%  | 79.3%\n2010  | 1,358.9  | 40,017.6  | 1,617.3  | 47,627.3  | 3.1%  | 1.8%  | 8.1%  | 81.2%\n2011  | 1,430.8  | 41,716.4  | 1,793.3  | 52,285.9  | 3.1%  | 2.9%  | 7.6%  | 81.8%\n2012  | 1,468.1  | 42,351.1  | 1,828.4  | 52,744.0  | 1.8%  | 1.5%  | 7.4%  | 85.4%\n2013  | 1,554.1  | 44,360.4  | 1,846.6  | 52,708.6  | 2.3%  | 0.9%  | 7.1%  | 86.1%\n2014  | 1,621.4  | 45,812.0  | 1,805.8  | 51,020.8  | 2.9%  | 1.9%  | 7.0%  | 85.6%\n2015  | 1,594.9  | 44,702.5  | 1,556.5  | 43,626.5  | 0.7%  | 1.1%  | 6.9%  | 91.2%\n2016  | 1,678.4  | 46,554.1  | 1,528.0  | 42,382.6  | 1.0%  | 1.4%  | 7.1%  | 91.8%\n2017  | 1,776.9  | 48,688.1  | 1,649.3  | 45,192.0  | 3.0%  | 1.6%  | 6.4%  | 88.9%\n2018  | 1,869.8  | 50,531.6  | 1,725.3  | 46,625.9  | 2.8%  | 2.3%  | 5.9%  | 88.9%\n2019  | 1,939.0  | 51,652.6  | 1,742.0  | 46,404.0  | 1.9%  | 1.9%  | 5.8%  | 87.2%\n2020  | 1,859.7  | 48,946.8  | 1,645.4  | 43,306.6  | -5.2%  | 0.7%  | 9.6%  | 117.8%\n2021  | 2,025.0  | 52,973.0  | 1,988.3  | 52,015.1  | 4.5%  | 3.4%  | 7.4%  | 112.9%\n2022  | 2,240.4  | 57,827.5  | 2,200.4  | 56,794.0  | 3.3%  | 6.9%  | 5.3%  | 102.2%\n2023  | 2,353.9  | 59,872.2  | 2,326.6  | 59,179.0  | 1.5%  | 4.2%  | 5.9%  | 98.7%\n2024  | 2,441.8  | 61,274.7  | 2,420.7  | 60,745.3  | 1.6%  | 2.4%  | 6.2%  | 96.3%\n2025  | 2,544.9  | 63,042.6  | 2,531.2  | 62,703.5  | 2.3%  | 1.9%  | 6.1%  | 93.3%\n2026  | 2,642.5  | 64,649.4  | 2,630.3  | 64,352.5  | 1.9%  | 1.9%  | 6.0%  | 90.9%\n2027  | 2,739.4  | 66,221.6  | 2,728.4  | 65,954.5  | 1.7%  | 2.0%  | 6.0%  | 88.7%"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Unemployment & Participation rate",
    "text": "Province  | Unemployment rate\npercentage of labour force\nas of April 2025  | Participation Rate  | Employment\n---|---|---|---\nAlberta | 7.1%  | 68.5%  | 2,565,800\nBritish Columbia | 6.2%  | 65.1%  | 2,950,900\nManitoba | 5.3%  | 66.4%  | 736,000\nNewfoundland and Labrador | 9.6%  | 58.3%  | 248,100\nNew Brunswick | 6.9%  | 59.8%  | 400,400\nNova Scotia | 7.2%  | 61.0%  | 516,400\nOntario | 7.8%  | 65.0%  | 8,195,200\nPrince Edward Island | 6.6%  | 65.9%  | 94,300\nQuebec | 6.0%  | 65.3%  | 4,645,600\nSaskatchewan | 4.3%  | 66.8%  | 616,000\n**Canada (national)** | 6.9%  | 65.3%  | **20,969,300**"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Export trade",
    "text": "Export trade from Canada measured in US dollars. In 2021, Canada exported\nUS$503.4 billion.\n\nThat dollar amount reflects a 19.5% gain since 2017 and a 29.1% increase from\n2020 to 2021.\n\nPartner  | Value  | Fraction\n---|---|---\nUnited States | $380.4 billion  | 75.6%\nChina | $23 billion  | 4.6%\nUnited Kingdom | $12.9 billion  | 2.6%\nJapan | $11.5 billion  | 2.3%\nMexico | $6.5 billion  | 1.3%\nGermany | $5.5 billion  | 1.1%\nSouth Korea | $4.5 billion  | 0.9%\nNetherlands | $3.8 billion  | 0.8%\nFrance | $3.2 billion  | 0.6%\nBelgium | $3.0 billion  | 0.6%\nHong Kong | $2.8 billion  | 0.6%\nNorway | $2.5 billion  | 0.5%\nSwitzerland | $1.6 billion  | 0.5%\nIndia | $2.35 billion  | 0.5%\nItaly | $2.1 billion  | 0.4%"
  },
  {
    "chapter_name": "Economy of Canada",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "Import trade",
    "text": "Import trade in 2017 measured in US dollars.\n\nPartner  | Value  | Fraction\n---|---|---\nUnited States | $222.0 billion  | 51.3%\nChina | $54.7 billion  | 12.7%\nMexico | $27.4 billion  | 6.3%\nGermany | $13.8 billion  | 3.2%\nJapan | $13.5 billion  | 3.1%\nUnited Kingdom | $6.9 billion  | 1.6%\nSouth Korea | $6.7 billion  | 1.5%\nItaly | $6.3 billion  | 1.5%\nFrance | $4.8 billion  | 1.1%\nVietnam | $3.9 billion  | 0.9%"
  }
]