[
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of the Comoros** is based on subsistence agriculture and\nfishing. Comoros has inadequate transportation links, a young and rapidly\nincreasing population, and few natural resources. The low educational level of\nthe labor force contributes to a subsistence level of economic activity, high\nunemployment, and a heavy dependence on foreign grants and technical\nassistance. The Comoros, with an estimated gross domestic product (GDP) per\ncapita income of about $700, is among the world's poorest and least developed\nnations. Although the quality of the land differs from island to island, most\nof the widespread lava-encrusted soil formations are unsuited to agriculture.\nAs a result, most of the inhabitants make their living from subsistence\nagriculture and fishing. Average wages in 2007 hover around $3–4 per day.\n\nAgriculture, including fishing, hunting, and forestry, is the leading sector\nof the economy. It contributes 40% to GDP, employs 80% of the labor force, and\nprovides most of the exports. The country is not self-sufficient in food\nproduction; rice, the main staple, accounts for the bulk of imports.\n\nThe government is working to upgrade education and technical training, to\nprivatize commercial and industrial enterprises, to improve health services,\nto diversify exports, to promote tourism, and to reduce the high population\ngrowth rate. Continued foreign support is essential if the goal of 4% annual\nGDP growth is to be met. At 24 percent of GDP, remittances constitute an\nimportant source of inflows for the Comorian economy.\n\nThe GDP per capita of the Comoros grew 55% in the 1980s. But this proved\nunsustainable and it consequently shrank by 42% in the 1990s."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "GDP per capita development, since 1950\n\nDuring the colonial period, the French and local leading citizens established\nplantations to grow cash crops for export. Even after independence, French\ncompanies, such as Société Bambao and Établissements Grimaldi — and other\nconcerns, such as Kalfane and Company and later, President Abdallah's\nÉtablissements Abdallah et Fils—dominated the Comoran economy. These firms\ndiverted most of their profits overseas, investing little in the\ninfrastructure of the islands beyond what was needed for profitable management\nof the plantations, or what could benefit these businesses' associates or\nrelated concerns. A serious consequence of this approach has been the\nlanguishing of the food-crop agricultural sector and the resultant dependence\non overseas food imports, particularly rice. In 1993 the Comoros remained\nhostage to fluctuating prices on the international market for such crops as\nvanilla, ylang-ylang, and cloves.\n\nThe Comoros is one of the world's poorest countries; its per capita gross\nnational product (GNP—see Glossary) was estimated at US$400 in 1994, following\nthe January devaluation of the Comorian franc. Although GNP increased in real\nterms at an average annual rate of 3.1 percent during the 1980s, rapid\npopulation growth effaced these gains and caused an average annual decrease in\nper capita GNP of 0.6 percent. Gross domestic product (GDP—see Glossary) grew\nin real terms by 4.2 percent per year from 1980 to 1985, 1.8 percent from 1985\nto 1988, and 1.5 percent in 1990. In 1991, because of its balance of payments\ndifficulties, the Comoros became eligible for the IDA's Special Program of\nAssistance for debt-distressed countries of sub-Saharan Africa.\n\nThe economy is based on private ownership, frequently by foreign investors.\nNationalization, even during the Soilih years, has been limited. Soilih did\nexpropriate the facilities of a foreign oil company, but only after the\ngovernment of Madagascar took over the company's plants in that country. The\nAbdallah government, despite its openness to foreign participation in the\neconomy, nationalized the Société Bambao and another French-capitalized firm,\nthe Comoran Meat Company (Société Comorienne des Viandes—Socovia), which\nspecialized in sales of meat and other foods in the islands. The\nnationalization was short-lived, however, because Socovia and other\ngovernment-held enterprises were either liquidated or privatized as part of\neconomic restructuring efforts in 1992.\n\nFollowing the Abdallah regime's rapprochement with France in 1978, the Comoran\neconomy became increasingly dependent on infusions of French aid, along with\nassistance from other governments and international organizations. By 1990,\nthe year the Comoros concluded negotiations with the IMF for an economic\nrestructuring program, the republic's total external public debt was US$162.4\nmillion, an amount equal to about three-quarters of GNP. The government\ndelayed implementing the structural adjustment plan and was directed by the\nWorld Bank and the IMF to do so by September 1992. The plan recommendations\nentailed discharging about 2,800 of 9,000 civil servants, among other\nunpopular measures. The IMF granted the Comoros a new credit for US$1.9\nmillion in March 1994 under the Structural Adjustment Facility. For the period\n1994–96, the Comoros sought an economic growth rate of 4 percent as well as an\ninflation rate of 4 percent for 1995–96. The growth rate for 1994, however,\nwas estimated only at 0.7 percent and the inflation rate at 15 percent.\nMeanwhile, in a move designed to encourage private enterprise and reduce\nunemployment, in May 1993 the UN Development Programme had given the Comoros a\ncredit of US$2 million for programs in these areas. In January 1994, the\nEuropean Development Fund (EDF) granted 1.3 million European Currency Units\n(ECUs; for value, see Glossary) to the Comoros to develop small businesses.\nThe Comoros also received 5.7 million French francs from the French Aid and\nCooperation Fund for agriculture and rural development.\n\nThe results of foreign aid to the Comoros have been mixed at best. The\npurposes of the aid ranged from helping the government cover its payroll for\nsuch huge, seemingly endless projects as expanding the seaport at Moroni and\ndeveloping a new port at Mutsamuda on Nzwani. Neither project had shown much\npromise by early 1994. Meanwhile, the islands have been unable to develop\nlocal resources or create the infrastructure needed for economic development.\nThe few successes included the creation of national news media and limited\nimprovements in public health, education, and telecommunications.\nDevelopmental assistance from the United States, which totaled US$700,000 in\nfiscal year (FY—see Glossary) 1991, was administered by CARE, the\nnongovernmental organization, and focused primarily on reforestation, soil\nconservation, and sustainable agriculture.\n\nThe Comoros has officially participated in the African Franc Zone (Communauté\nFinancière Africaine—CFA; see Glossary) since 1979. The CFA franc was qualed\none French franc.\n\nA national labor organization, the Union of Comoran Workers (Union des\nTravailleurs des Comores), also had headquarters in Moroni. Strikes and worker\ndemonstrations often occurred in response to political crises, economic\nrestructuring mandated by international financial organizations, and the\nfailure of the government — occasionally for months at a time — to pay civil\nservants. Mean wages were $0.80 per man-hour in 2009."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture, fishing, and forestry",
    "text": "Agriculture, involving more than 80% of the population and 40% of the gross\ndomestic product, provides virtually all foreign exchange earnings. Services\nincluding tourism, construction, and commercial activities constitute the\nremainder of the GDP. Plantations engage a large proportion of the population\nin producing the islands' major cash crops for export: vanilla, cloves,\nperfume essences, and copra. The Comoros is the world's leading producer of\nessence of ylang-ylang, used in manufacturing perfume. It also is the world's\nsecond-largest producer of vanilla, after Madagascar. Principal food crops are\ncoconuts, bananas, and cassava. Foodstuffs constitute 32% of total imports."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture and livestock",
    "text": "Agriculture supported about 80 percent of the population and supplied about 95\npercent of exports in the early 1990s. Two agricultural zones are generally\ndefined: the coastal area, which ranges in elevation from sea level to 400\nmeters and which supports cash crops such as vanilla, ylang-ylang, and cloves;\nand the highlands, which support cultivation of crops for domestic\nconsumption, such as cassava, bananas, rain rice, and sweet potatoes. As the\npopulation increased, food grown for domestic use met fewer and fewer of\nComorans' needs. Data collected by the World Bank showed that food production\nper capita fell about 12 percent from 1980 to 1987. The republic imported\nvirtually all its meat and vegetables; rice imports alone often accounted for\nup to 30 percent of the value of all imports.\n\nCloves ready to be dried\n\nThe Comoros is the world's principal producer of ylang-ylang essence, an\nessence derived from the flowers of a tree originally brought from Indonesia\nthat is used in manufacturing perfumes and soaps. Ylang-ylang essence is a\nmajor component of Chanel No. 5, the popular scent for women. The republic is\nthe world's second largest producer of vanilla, after Madagascar. Cloves are\nalso an important cash crop. A total of 237 tons of vanilla was exported in\n1991, at a price of about CF19 per kilogram. A total of 2,750 tons of cloves\nwas exported in 1991, at a price of CF397 per kilogram. That year forty-three\ntons of ylang-ylang essence were exported at a price of about CF23,000 per\nkilogram. The production of all three commodities fluctuates wildly, mainly in\nresponse to changes in global demand and natural disasters such as cyclones.\nProfits—and therefore, government receipts—likewise skyrocket and plummet,\nwreaking havoc with government efforts to predict revenues and plan\nexpenditures. Stabex (Stabilization of Export Earnings—see Glossary), a system\nof the EC, provides aid to the Comoros and other developing countries to\nmitigate the effects of fluctuations in the prices of export commodities.\n\nLong-term prospects for the growth and stabilization of the markets for\nvanilla and ylang-ylang did not appear strong in the early 1990s. Vanilla\nfaced increased competition from synthetic flavorings, and the preferences of\nperfume users were moving away from the sweet fragrance provided by ylang-\nylang essence. Copra, the dried coconut meat that yields coconut oil, once an\nimportant Comoran export, had ceased to be a significant factor in the economy\nby the late 1980s, when the world's tastes shifted from high-fat coconut oil\ntoward \"leaner\" substances such as palm oil. Although clove production and\nrevenues also experienced swings, in the early 1990s cloves did not appear to\nface the same sorts of challenges confronting vanilla and ylang-ylang. Most\nComoran vanilla is grown on Njazidja; Nzwani is the source of most ylangylang.\n\nNumerous international programs have attempted to reduce the country's\ndependence on food imports, particularly of rice, a major drain on export\nearnings. Organizations initiating these rural development programs have\nincluded the EDF, the IFAD, the World Food Program, the Arab Bank for Economic\nDevelopment in Africa, the UN Food and Agriculture Organization, and the\ngovernments of France and the United States. Despite these international\nefforts, which numbered as many as seventeen in 1984, food production per\ncapita actually declined in the Comoros during the 1980s. The major clove and\nvanilla growers, whose plantations occupy the islands' fertile coastal lands,\ngenerally resisted these restructuring efforts, as did rice-importing firms,\nincluding the country's largest, Établissements Abdallah et Fils.\n\nCrowded onto the mountain slopes by the cash crop plantations, food-crop\nfarmers have caused deforestation and the erosion of the highlands' thin,\nfragile soil. In response, aid providers have dedicated an increasing amount\nof agricultural assistance to reforestation, soil restoration, and\nenvironmentally sensitive means of cultivation. For example, all United States\nagricultural aid in 1991 (US$700,000) was directed to such projects, as was a\nUS$4 million loan from the IFAD to help initiate a small producers' support\nprogram on Nzwani.\n\nThe livestock sector is small—some 47,000 cattle, 120,000 goats, 13,000 sheep,\nand 4,000 asses in 1990. The Comoros continues to import most domestically\nconsumed meat."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Fishing",
    "text": "Since the latter part of the 1980s, the Comoros has made headway in developing\nfisheries as a source of export earnings. In 1988 the government concluded a\nthree-year agreement with the EC by which forty French and Spanish vessels\nwould be permitted to fish in Comoran waters, primarily for tuna. In return,\nthe Comoros would receive ECU300,000, and ECU50,000 would be invested in\nfisheries research. In addition, fishing vessel operators would pay ECU20 per\nton of tuna netted. Although the deep waters outside the islands' reefs do not\nabound in fish, it has been estimated that up to 30,000 tons of fish could be\ntaken per year from Comoran waters (which extend 320 kilometers offshore). The\ntotal catch in 1990 was 5,500 tons. Japan has also provided aid to the fishing\nindustry. Fisheries development is overseen by a state agency, the Development\nCompany for Small-Scale Fisheries of the Comoros (Société de Développement de\nla Pêche Artisanale des Comores)."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Forestry",
    "text": "Forested areas amounted to about 8,000 hectares (20,000 acres) in 2000.\nNumerous fruit trees and tropical hardwoods are found. Some timber is\nproduced, notably on the island of Grande Comore, which has about half the\nremaining forest. Roundwood production in 2003 amounted to 9,000 cu m (300,000\ncu ft)."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Industry",
    "text": "Location of the Comoros Islands. Informal sector: two men repairing\nelectronical device.\n\nIndustrial activities are responsible for only a tiny portion of Comoran\neconomic activity—about 5 percent of GDP in 1994. Principal industries are\nthose that involve processing cash crops for export: preparing vanilla and\ndistilling ylang-ylang into perfume essence. These activities were once\ncontrolled almost entirely by French companies, but as they closed\nunprofitable plantations, individual farmers set up many small, inefficient\ndistilleries.\n\nComorans also produce handicrafts for export.\n\nOther industries are small and geared to internal markets: sawmills, printing,\ncarpentry, and the production of shoes, plastics, yogurt, handicrafts (such as\nthe jewelry exchanged as part of the grand marriage), and small fishing boats.\n\nSeveral factors provide major obstacles to the growth of industry: the\nislands' geographically isolated position, their distance from each other, a\nscarcity of raw materials and skilled labor, and the high cost of electricity\n(energy is produced by hydropower, imported petroleum, and wood products) and\ntransportation. Value added in industry slowly declined throughout the 1980s."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Tourism",
    "text": "Perhaps the primary outcome of South African penetration of the Comoran\neconomy during Ahmed Abdallah's regime was the development of tourism.\nAlthough South African investors built or renovated several hotels during the\n1980s (with assistance from the South African and Comoran governments), only\none resort, the 182-room Galawa Beach on Njazidja, was operating by late 1992.\nAbout 100 other hotel rooms were available on the islands. Political\ninstability, a declining South African interest in the islands as the\napartheid regime was disassembled and other tropical tourism venues became\nmore welcoming, and the need to import most construction materials and\nconsumable supplies inhibited the growth of tourism, despite the islands'\nphysical beauty. Nonetheless, in large part thanks to Galawa Beach, which had\nbeen closed during 1990, tourism increased from 7,627 visitors in 1990 to\n16,942 in 1991. Most of these tourists were Europeans, primarily French (see\nHistorical Setting, this ch.)."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Infrastructure",
    "text": "The country lacks the infrastructure necessary for development. Some villages\nare not linked to the main road system or at best are connected by tracks\nusable only by four-wheel-drive vehicles. The islands' ports are rudimentary,\nalthough a deepwater facility was recently completed on Anjouan. Only small\nvessels can approach the existing quays in Moroni on Grande Comore, despite\nrecent improvements. Long-distance, ocean-going ships must lie offshore and be\nunloaded by smaller boats; during the cyclone season, this procedure is\ndangerous, and ships are reluctant to call at the island. Most freight is sent\nfirst to Mombasa or Réunion and transshipped from there.\n\nThe banking system consists of the Central Bank of the Comoros (Banque\nCentrale des Comores) established in 1981 that had three offices (Moroni\n(Grande-Comore), Mutsamudu (Anjouan) and Fomboni (Mohéli)); the Banque pour\nl'Industrie et le Commerce des Comores, a commercial bank established in 1990\nthat had six branches in 1993 and was a subsidiary of the Banque Nationale de\nParis; the Development Bank of the Comoros (Banque de Développement des\nComores), established in 1982, which provided support for small and midsize\ndevelopment projects, the Federal Bank of Commerce (Banque Fédérale de\nCommerce) and the Exim Bank Comores Ltd. Most of the shares in the Development\nBank of the Comoros were held by the Comoran government and the central bank;\nthe rest were held by the European Investment Bank and the Caisse Centrale de\nCoopération Économique, a development agency of the French government. All of\nthese banks had headquarters in Moroni."
  },
  {
    "chapter_name": "Economy of the Comoros",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "External trade",
    "text": "France, the Comoros' major trading partner, finances small projects only. The\nUnited States receives a growing percentage of the Comoros' exports but\nsupplies only a negligible fraction of its imports (less than 1%).\n\nThe overall effect of the republic's dependence on aid has been perennial\ntrade deficits accompanied by chronic budget deficits. In 1992 total exports\nhad a value of US$21 million, and total imports were valued at US$50 million.\nIn 1991 receipts totaled about US$34.7 million (CF9.7 trillion; CF—Comoran\nfranc; for value of the Comoran franc—see Glossary) whereas expenditures\ntotaled about US$93.8 million (CF26.2 trillion). The shortfall, which equaled\nabout 170 percent of receipts, was financed by international grants and loans,\nby draws upon existing lines of credit, and by debt rescheduling.\n\nIn 1991 France received 55 percent of Comoran exports, followed by the United\nStates (19 percent) and Germany (16 percent). The main export products were\nvanilla, ylang-ylang, and cloves. The republic's primary suppliers were France\n(56 percent of imports), the Belgium-Luxembourg economic union (11 percent),\nand Japan (5 percent). Imports consisted of basic foodstuffs (rice and meat),\npetroleum, and construction materials.\n\nComoros has an international airport (Prince Said Ibrahim International\nAirport) at Hahaya on Grande Comore. It is a member of the franc zone with an\nexchange rate of 491.9677 Comorian francs (KMF) = 1 [Euro]."
  }
]