[
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Change in per capita GDP of Angola, 1950–2018. Figures are inflation-adjusted\nto 2011 International dollars.\n\nAngola has a semi-planned economy, in which central planning directs the\neconomy with the participation of private enterprises. The **economy of\nAngola** remains heavily influenced by the effects of four decades of conflict\nin the last part of the 20th century, the war for independence from Portugal\n(1961–75) and the subsequent civil war (1975–2002). Poverty since 2002 is\nreduced over 50% and a third of the population relies on subsistence\nagriculture. Since 2002, when the 27-year civil war ended, government policy\nprioritized the repair and improvement of infrastructure and strengthening of\npolitical and social institutions. During the first decade of the 21st\ncentury, Angola's economy was one of the fastest-growing in the world, with\nreported annual average GDP growth of 11.1 percent from 2001 to 2010. High\ninternational oil prices and rising oil production contributed to strong\neconomic growth, although with high inequality, at that time. 2022 trade\nsurplus was $30 billion, compared to $48 billion in 2012.\n\nCorruption is rife throughout the economy and the country remains heavily\ndependent on the oil sector, which in 2017 accounted for over 90 percent of\nexports by value and 64 percent of government revenue. With the end of the oil\nboom, from 2015 Angola entered into a period of economic contraction.",
    "openai_summarised_points": [
      "• The change in per capita GDP of Angola from 1950 to 2018 is depicted with figures adjusted for inflation to 2011 International dollars, illustrating long-term economic fluctuations.",
      "• Angola has a semi-planned economy characterized by central planning that guides economic activities alongside private enterprise participation.",
      "• The country's economy has been heavily influenced by four decades of conflict, including the war for independence from Portugal (1961–1975) and the subsequent civil war (1975–2002).",
      "• Since the end of the civil war in 2002, poverty has been reduced by over 50%, and approximately one-third of the population depends on subsistence agriculture.",
      "• Post-2002 government policies focused on repairing and improving infrastructure and strengthening political and social institutions following the 27-year civil war.",
      "• During the first decade of the 21st century, Angola experienced one of the world's fastest economic growth rates, with an average annual GDP growth of 11.1 percent from 2001 to 2010.",
      "• The rapid economic growth during this period was primarily driven by high international oil prices and increasing oil production, although it was accompanied by significant inequality.",
      "• In 2022, Angola's trade surplus was valued at $30 billion, a decrease from $48 billion in 2012, indicating a decline in trade balance surplus over that decade.",
      "• Corruption remains widespread throughout Angola's economy, undermining economic integrity and development efforts.",
      "• The country remains heavily dependent on the oil sector, which in 2017 accounted for over 90 percent of exports by value and 64 percent of government revenue.",
      "• Following the end of the oil boom, starting in 2015, Angola entered a period of economic contraction, reflecting reduced oil prices and production challenges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:41.965817",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1434,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "The Angolan economy has been dominated by the production of raw materials and\nthe use of cheap labor since European rule began in the sixteenth century. The\nPortuguese used Angola principally as a source for the thriving slave trade\nacross the Atlantic; Luanda became the greatest slaving port in Africa. After\nthe Portuguese Empire abolished the slave trade in Angola in 1858, it began\nusing concessional agreements, granting exclusive rights to a private company\nto exploit land, people, and all other resources within a given territory. In\nMozambique, this policy spawned a number of companies notorious for their\nexploitation of local labor. But in Angola, only Diamang showed even moderate\nsuccess. At the same time, Portuguese began emigrating to Angola to establish\nfarms and plantations (_fazendas_) to grow cash crops for export. Although\nthese farms were only partially successful before World War II, they formed\nthe basis for the later economic growth.\n\nThe principal exports of the post-slave economy in the 19th century were\nrubber, beeswax, and ivory. Prior to the First World War, exportation of\ncoffee, palm kernels and oil, cattle, leather and hides, and salt fish joined\nthe principal exports, with small quantities of gold and cotton also being\nproduced. Grains, sugar, and rum were also produced for local consumption. The\nprincipal imports were foodstuffs, cotton goods, hardware, and British coal.\nLegislation against foreign traders was implemented in the 1890s. The\nterritory's prosperity, however, continued to depend on plantations worked by\nlabor \"indentured\" from the interior.\n\nBefore World War II, the Portuguese government was concerned primarily with\nkeeping its colonies self-sufficient and therefore invested little capital in\nAngola's local economy. It built no roads until the mid-1920s, and the first\nrailroad, the Benguela railway, was not completed until 1929. Between 1900 and\n1940, only 35,000 Portuguese emigrants settled in Angola, and most worked in\ncommerce in the cities, facilitating trade with Portugal. In the rural areas,\nPortuguese settlers often found it difficult to make a living because of\nfluctuating world prices for sugarcane and sisal and the difficulties in\nobtaining cheap labor to farm their crops. As a result, they often suspended\ntheir operations until the market prices rose and instead marketed the produce\nof Angolan farmers.\n\nBut in the wake of World War II, the rapid growth of industrialization\nworldwide and the parallel requirements for raw materials led Portugal to\ndevelop closer ties with its colonies and to begin actively developing the\nAngolan economy. In the 1930s, Portugal started to develop closer trade ties\nwith its colonies, and by 1940 it absorbed 63 percent of Angolan exports and\naccounted for 47 percent of Angolan imports, up from 39 percent and 37\npercent, respectively, a decade earlier. When the price of Angola's principal\ncrops—coffee and sisal—jumped after the war, the Portuguese government began\nto reinvest some profits inside the country, initiating a series of projects\nto develop infrastructure. During the 1950s, Portugal built dams,\nhydroelectric power stations, and transportation systems. In addition,\nPortuguese citizens were encouraged to emigrate to Angola, where planned\nsettlements (_colonatos_) were established for them in the rural areas.\nFinally, the Portuguese initiated mining operations for iron ore, manganese,\nand copper to complement industrial activities at home, and in 1955 the first\nsuccessful oil wells were drilled in Angola. By 1960 the Angolan economy had\nbeen completely transformed, boasting a successful commercial agricultural\nsector, a promising mineral and petroleum production enterprise, and an\nincipient manufacturing industry.\n\nYet by 1976, these encouraging developments had been reversed. The economy was\nin complete disarray in the aftermath of the war of independence and the\nsubsequent internal fighting of the liberation movements. According to the\nruling MPLA-PT, in August 1976 more than 80 percent of the agricultural\nplantations had been abandoned by their Portuguese owners; only 284 out of 692\nfactories continued to operate; more than 30,000 medium-level and high-level\nmanagers, technicians, and skilled workers had left the country; and 2,500\nenterprises had been closed (75 percent of which had been abandoned by their\nowners). Furthermore, only 8,000 vehicles remained out of 153,000 registered,\ndozens of bridges had been destroyed, the trading network was disrupted,\nadministrative services did not exist, and files and studies were missing.\n\nAngola's economic ills can also be traced to the legacy of Portuguese colonial\ndevelopment. Many of the white settlers had come to Angola after 1950 and were\nunderstandably quick to repatriate during the war of independence. During\ntheir stay, however, these settlers had appropriated Angolan lands, disrupting\nlocal peasant production of cash and subsistence crops. Moreover, Angola's\nindustries depended on trade with Portugal—the colony's overwhelmingly\ndominant trade partner—for both markets and machinery. Only the petroleum and\ndiamond industries boasted a wider clientele for investment and markets. Most\nimportant, the Portuguese had not trained Angolans to operate the larger\nindustrial or agricultural enterprises, nor had they actively educated the\npopulation. Upon independence Angola thus found itself without markets or\nexpertise to maintain even minimal economic growth.\n\nAs a result, the government intervened, nationalizing most businesses and\nfarms abandoned by the Portuguese. It established state farms to continue\nproducing coffee, sugar, and sisal, and it took over the operations of all\nfactories to maintain production. These attempts usually failed, primarily\nbecause of the lack of experienced managers and the continuing disruptions in\nrural areas caused by the UNITA insurgency. Only the petroleum sector\ncontinued to operate successfully, and by 1980 this sector had helped the\ngross domestic product reach US$3.6 billion, its highest level up to 1988. In\nthe face of serious economic problems and the continuing war throughout the\ncountryside, in 1987 the government announced plans to liberalize economic\npolicies and promote private investment and involvement in the economy.",
    "openai_summarised_points": [
      "• The Angolan economy has historically been dominated by the production of raw materials and the utilization of cheap labor since European colonization began in the sixteenth century.",
      "• Portugal primarily used Angola as a source for the transatlantic slave trade, with Luanda becoming the largest slaving port in Africa.",
      "• The Portuguese abolished the slave trade in Angola in 1858 and shifted to concessional agreements, granting exclusive rights to private companies to exploit land, people, and resources within designated territories.",
      "• In Mozambique, this policy led to exploitation by several companies, whereas in Angola, only Diamang achieved moderate success.",
      "• Concurrently, Portuguese emigrants established farms and plantations (_fazendas_) to grow cash crops for export; these farms were only partially successful before World War II but laid the groundwork for future economic growth.",
      "• In the 19th century, Angola’s principal exports included rubber, beeswax, and ivory; before World War I, exports expanded to coffee, palm kernels and oil, cattle, leather and hides, and salt fish, with small quantities of gold and cotton also produced.",
      "• Local consumption included grains, sugar, and rum.",
      "• Major imports comprised foodstuffs, cotton goods, hardware, and British coal.",
      "• Legislation against foreign traders was enacted in the 1890s, yet the economy remained reliant on plantations worked by indentured labor from the interior.",
      "• Prior to World War II, the Portuguese government prioritized self-sufficiency in its colonies, investing minimally in Angola’s local infrastructure—no roads were built until the mid-1920s, and the Benguela railway was completed in 1929.",
      "• Between 1900 and 1940, only 35,000 Portuguese emigrants settled in Angola, mostly working in urban commerce, facilitating trade with Portugal.",
      "• Rural Portuguese settlers struggled due to fluctuating world prices for sugarcane and sisal and difficulties in obtaining cheap labor, often suspending operations until market prices rose, then marketing local produce.",
      "• Post-World War II, Portugal intensified efforts to develop Angola’s economy, driven by global industrialization and increased demand for raw materials.",
      "• In the 1930s, Portugal strengthened trade ties with its colonies; by 1940, Portugal absorbed 63% of Angola’s exports and accounted for 47% of its imports, up from 39% and 37%, respectively, a decade earlier.",
      "• After the war, the rise in prices for coffee and sisal prompted Portuguese reinvestment in infrastructure, including dams, hydroelectric power stations, and transportation systems during the 1950s.",
      "• Portuguese citizens were encouraged to emigrate to Angola, where planned settlements (_colonatos_) were established in rural areas.",
      "• Mining operations for iron ore, manganese, and copper commenced, and in 1955, the first successful oil wells were drilled in Angola.",
      "• By 1960, Angola’s economy was transformed, featuring a successful commercial agricultural sector, emerging mineral and petroleum industries, and an incipient manufacturing industry.",
      "• Following independence and the subsequent internal conflicts, by August 1976, Angola’s economy was in severe disarray: over 80% of plantations had been abandoned, only 284 of 692 factories remained operational, and more than 30,000 skilled workers had left the country.",
      "• Additionally, 2,500 enterprises had closed, with 75% abandoned by owners; only 8,000 vehicles remained out of 153,000 registered; numerous bridges were destroyed; the trading network was disrupted; administrative services were non-existent; and files and studies were missing.",
      "• The economic decline was partly due to the legacy of Portuguese colonial development, where settlers had appropriated land, disrupting local peasant production, and Angola’s industries depended heavily on trade with Portugal for markets and machinery.",
      "• Only the petroleum and diamond industries had a broader client base for investment and markets.",
      "• Portuguese had not trained Angolans to operate large industrial or agricultural enterprises nor actively educated the population, leaving Angola without the skills or markets needed for sustained economic growth post-independence.",
      "• The Angolan government responded by nationalizing most businesses and farms abandoned by the Portuguese, establishing state farms for crops like coffee, sugar, and sisal, and taking over factory operations to sustain production.",
      "• These nationalization efforts largely failed due to the lack of experienced managers and ongoing rural disruptions caused by the UNITA insurgency.",
      "• The petroleum sector remained the only consistently successful industry, and by 1980, it contributed to a GDP of US$3.6 billion, the highest until 1988.",
      "• Amid ongoing economic challenges and rural warfare, the Angolan government announced plans in 1987 to liberalize economic policies and promote private investment and involvement in the economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:54.980484",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6311,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "1990s",
    "text": "United Nations Angola Verification Mission III and MONUA spent US$1.5 billion\noverseeing implementation of the Lusaka Protocol, a 1994 peace accord that\nultimately failed to end the civil war. The protocol prohibited UNITA from\nbuying foreign arms, a provision the United Nations largely did not enforce,\nso both sides continued to build up their stockpile. UNITA purchased weapons\nin 1996 and 1997 from private sources in Albania and Bulgaria, and from Zaire,\nSouth Africa, Republic of the Congo, Zambia, Togo, and Burkina Faso. In\nOctober 1997 the UN imposed travel sanctions on UNITA leaders, but the UN\nwaited until July 1998 to limit UNITA's exportation of diamonds and freeze\nUNITA bank accounts. While the U.S. government gave US$250 million to UNITA\nbetween 1986 and 1991, UNITA made US$1.72 billion between 1994 and 1999\nexporting diamonds, primarily through Zaire to Europe. At the same time the\nAngolan government received large amounts of weapons from the governments of\nBelarus, Brazil, Bulgaria, China, and South Africa. While no arms shipment to\nthe government violated the protocol, no country informed the U.N. Register on\nConventional Weapons as required.\n\nDespite the increase in civil warfare in late 1998, the economy grew by an\nestimated 4% in 1999. The government introduced new currency denominations in\n1999, including a 1 and 5 kwanza note.\"Central Bank governor explains\narrangements for new currency\". BBC Selected Transcripts: Africa. November 1,\n1999. Retrieved October 10, 2017.",
    "openai_summarised_points": [
      "• The United Nations Angola Verification Mission III and MONUA collectively spent approximately US$1.5 billion to oversee the implementation of the Lusaka Protocol, a peace agreement signed in 1994 aimed at ending the Angolan civil war.",
      "• The Lusaka Protocol prohibited UNITA from purchasing foreign arms; however, the United Nations largely failed to enforce this provision, allowing both sides to continue accumulating weapon stockpiles.",
      "• UNITA acquired weapons in 1996 and 1997 from private sources in Albania and Bulgaria, as well as from Zaire, South Africa, the Republic of the Congo, Zambia, Togo, and Burkina Faso.",
      "• In October 1997, the UN imposed travel sanctions on UNITA leaders; however, it was not until July 1998 that the UN took further action to limit UNITA’s diamond exports and froze UNITA bank accounts.",
      "• Between 1986 and 1991, the U.S. government provided approximately US$250 million to UNITA; during the period from 1994 to 1999, UNITA exported diamonds worth an estimated US$1.72 billion, primarily through Zaire to Europe.",
      "• The Angolan government received large quantities of weapons from the governments of Belarus, Brazil, Bulgaria, China, and South Africa; despite no arms shipments violating the protocol, no country officially informed the U.N. Register on Conventional Weapons as required.",
      "• Despite escalating civil warfare in late 1998, Angola’s economy experienced an estimated growth of 4% in 1999.",
      "• In 1999, the Angolan government introduced new currency denominations, including a 1 kwanza note and a 5 kwanza note, as part of monetary reforms.",
      "• The Central Bank governor explained the arrangements for the new currency in a BBC transcript titled \"Selected Transcripts: Africa,\" published on November 1, 1999, and retrieved on October 10, 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:14:01.063782",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1509,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "21st century",
    "text": "The Angolan government has been trying to prosecute Isabel dos Santos, a\ndaughter of a former Angolan president, for corruption which may have led to\nAngola's recession\n\nAn economic reform effort was launched in 1998.[_citation needed_] Angola\nranked 160 of 174 nations in the United Nations Human Development Index in\n2000. In April 2000 Angola started an International Monetary Fund (IMF) Staff-\nMonitored Program (SMP). The program formally lapsed in June 2001, but the IMF\nremains engaged. In this context the Government of Angola has succeeded in\nunifying exchange rates and has raised fuel, electricity, and water rates. The\nCommercial Code, telecommunications law, and Foreign Investment Code are being\nmodernized. A privatization effort, prepared with World Bank assistance, has\nbegun with the BCI bank. Nevertheless, a legacy of fiscal mismanagement and\ncorruption persists.[_citation needed_] The civil war internally displaced 3.8\nmillion people, 32% of the population, by 2001. The security brought about by\nthe 2002 peace settlement has led to the resettlement of 4 million displaced\npersons, thus resulting in large-scale increases in agriculture\nproduction.[_citation needed_]\n\nAngola produced over 3 million carats (600 kilograms) of diamonds in 2003, and\nproduction was expected to grow to 10 million carats (2,000 kilograms) per\nyear by 2007. In 2004, China's Eximbank approved a $2 billion line of credit\nto Angola to rebuild infrastructure. The economy grew 18% in 2005 and growth\nwas expected to reach 26% in 2006 and stay above 10% for the rest of the\ndecade. By 2020, Angola had a national debt of $76 billion, of which $20\nbillion is to China.\n\nThe construction industry is taking advantage of the growing economy, with\nvarious housing projects stimulated by the government such as the _Angola\nInveste_ program and the _Casa Feliz_ or _Meña_ projects. Not all public\nconstruction projects are functional. For example, Kilamba Kiaxi, where a\nwhole new satellite town of Luanda, consisting of housing facilities for\nseveral hundreds of thousands of people, was completely uninhabited for over\nfour years because of skyrocketing prices, but completely sold out after the\ngovernment decreased the original price and created mortgage plans at around\nthe election time and thus made it affordable for middle-class people.\nChevronTexaco started pumping 50 kbbl/d (7.9×10~~^~~ 3 m3/d) from Block 14 in\nJanuary 2000, but production decreased to 57 kbbl/d (9.1×10~~^~~ 3 m3/d) in\n2007 due to poor-quality oil. Angola joined the Organization of the Petroleum\nExporting Countries on January 1, 2007. Cabinda Gulf Oil Company found\nMalange-1, an oil reservoir in Block 14, on August 9, 2007.",
    "openai_summarised_points": [
      "• The Angolan government has been actively pursuing the prosecution of Isabel dos Santos, the daughter of a former Angolan president, on charges of corruption, which is believed to have contributed to Angola's economic recession.",
      "• An economic reform initiative was launched in 1998 aimed at stabilizing and modernizing the economy.",
      "• In 2000, Angola ranked 160th out of 174 nations on the United Nations Human Development Index, indicating a low level of human development.",
      "• In April 2000, Angola commenced an International Monetary Fund (IMF) Staff-Monitored Program (SMP), which formally lapsed in June 2001; however, the IMF continued to engage with Angola afterward.",
      "• During this period, the Angolan government succeeded in unifying its exchange rates and increased tariffs on fuel, electricity, and water to boost revenue.",
      "• Legal and regulatory reforms included modernization of the Commercial Code, telecommunications law, and Foreign Investment Code.",
      "• A privatization effort, supported by the World Bank, was initiated with the sale of the BCI bank, among other assets.",
      "• Despite reforms, a legacy of fiscal mismanagement and corruption persisted within the government.",
      "• The Angolan civil war had displaced approximately 3.8 million people, representing 32% of the population, by 2001.",
      "• Following the 2002 peace settlement, security improvements facilitated the resettlement of 4 million displaced persons, leading to significant increases in agricultural production.",
      "• In 2003, Angola produced over 3 million carats (600 kilograms) of diamonds, with projections to increase production to 10 million carats (2,000 kilograms) annually by 2007.",
      "• In 2004, China’s Eximbank approved a $2 billion line of credit to Angola aimed at rebuilding infrastructure.",
      "• The Angolan economy experienced an 18% growth rate in 2005, with expectations to reach 26% in 2006 and maintain above 10% growth throughout the decade.",
      "• By 2020, Angola's national debt had reached $76 billion, with $20 billion owed to China.",
      "• The construction sector expanded significantly, driven by government-led housing initiatives such as the Angola Investe program and the Casa Feliz (Meña) projects.",
      "• Not all public construction projects achieved full functionality; for example, Kilamba Kiaxi, a new satellite town in Luanda built to house hundreds of thousands, remained uninhabited for over four years due to high prices but was later sold out after the government reduced prices and introduced mortgage plans around election time, making housing affordable for the middle class.",
      "• ChevronTexaco began oil production in Block 14 in January 2000, initially pumping 50,000 barrels per day (7.9×10³ m³/d), but production declined to 57,000 barrels per day (9.1×10³ m³/d) by 2007 due to poor-quality oil.",
      "• Angola joined the Organization of the Petroleum Exporting Countries (OPEC) on January 1, 2007.",
      "• The Cabinda Gulf Oil Company discovered the Malange-1 oil reservoir in Block 14 on August 9, 2007."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:14:08.728098",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2702,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Overview",
    "text": "Despite its abundant natural resources, output per capita is among the world's\nlowest. Subsistence agriculture provides the main livelihood for 85% of the\npopulation. Oil production and the supporting activities are vital to the\neconomy, contributing about 45% to GDP and 90% of exports. Growth is almost\nentirely driven by rising oil production which surpassed 1.4 million barrels\nper day (220×10~~^~~ 3 m3/d) in late-2005 and which is expected to grow to 2\nmillion barrels per day (320×10~~^~~ 3 m3/d) by 2007. Control of the oil\nindustry is consolidated in Sonangol Group, a conglomerate owned by the\nAngolan government. With revenues booming from oil exports, the government has\nstarted to implement ambitious development programs to build roads and other\nbasic infrastructure for the nation.[_citation needed_]\n\nIn the last decade of the colonial period, Angola was a major African food\nexporter but now imports almost all its food. Severe wartime conditions,\nincluding extensive planting of landmines throughout the countryside, have\nbrought agricultural activities to a near-standstill. Some efforts to recover\nhave gone forward, however, notably in fisheries. Coffee production, though a\nfraction of its pre-1975 level, is sufficient for domestic needs and some\nexports. Expanding oil production is now almost half of GDP and 90% of\nexports, at 800 thousand barrels per day (130×10~~^~~ 3 m3/d). Diamonds\nprovided much of the revenue for Jonas Savimbi's UNITA rebellion through\nillicit trade. Other rich resources await development: gold, forest products,\nfisheries, iron ore, coffee, and fruits.\n\nThis is a chart of trend of nominal gross domestic product of Angola at market\nprices using International Monetary Fund data; figures are in millions of\nunits.\n\nYear | Gross Domestic Product (*$1,000,000) | US Dollar Exchange | Per Capita Income\n(as % of USA)\n---|---|---|---\n1980 |  |  | 6.33\n1985 |  |  | 4.46\n1990 |  |  | 4.42\n1995 | 5,066 | 14 Angolan Kwanza | 1.58\n2000 | 9,135 | 91,666 Angolan Kwanza | 1.96\n2005 | 28,860 | 2,515,452 Angolan Kwanza | 4.73\n\nThe following table shows the main economic indicators in 1980–2023. Inflation\nbelow 5% is in green.\n\nYear  | GDP\n(in bn. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP (in bn. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---\n1980  | 10.9  | 1,317  | 6.6  | 2.4%  | 46.7%  | n/a\n1981  | 11.4  | 1,341  | 6.2  | −4.4%  | 1.3%  | n/a\n1982  | 12.1  | 1,388  | 6.2  | 0.0%  | 1.8%  | n/a\n1983  | 13.1  | 1,464  | 6.5  | 4.2%  | 1.8%  | n/a\n1984  | 14.4  | 1,567  | 6.9  | 6.0%  | 1.8%  | n/a\n1985  | 15.4  | 1,484  | 8.5  | 3.5%  | 1.8%  | n/a\n1986  | 16.1  | 1,515  | 7.9  | 2.9%  | 1.8%  | n/a\n1987  | 17.2  | 1,576  | 9.1  | 4.1%  | 1.8%  | n/a\n1988  | 18.9  | 1,685  | 9.8  | 6.1%  | 1.8%  | n/a\n1989  | 19.6  | 1,705  | 11.4  | 0.0%  | 1.8%  | n/a\n1990  | 19.7  | 1,664  | 12.6  | −3.5%  | 1.8%  | n/a\n1991  | 22.8  | 1,865  | 12.2  | 1.0%  | 85.3%  | n/a\n1992  | 26.0  | 2,057  | 9.4  | 11.4%  | 299.1%  | n/a\n1993  | 29.6  | 2,067  | 6.8  | 10.7%  | 1,379.5%  | n/a\n1994  | 33.3  | 2,475  | 5.0  | 10.5%  | 949.8%  | n/a\n1995  | 37.5  | 2,698  | 6.2  | 10.4%  | 2,672.2%  | n/a\n1996  | 42.5  | 2,955  | 8.0  | 11.2%  | 4,146.0%  | n/a\n1997  | 46.4  | 3,120  | 9.4  | 7.3%  | 221.9%  | n/a\n1998  | 49.1  | 3,196  | 8.0  | 4.7%  | 107.4%  | n/a\n1999  | 50.9  | 3,207  | 7.5  | 2.2%  | 248.2%  | n/a\n2000  | 53.6  | 3,272  | 11.2  | 3.1%  | 325.0%  | 133.9%\n2001  | 57.2  | 3,373  | 10.9  | 4.2%  | 152.6%  | 133.5%\n2002  | 66.0  | 3,766  | 15.3  | 13.7%  | 108.9%  | 73.7%\n2003  | 69.3  | 3,823  | 17.8  | 3.0%  | 98.2%  | 58.0%\n2004  | 78.9  | 4,205  | 23.6  | 11.0%  | 43.5%  | 47.7%\n2005  | 93.7  | 4,815  | 37.0  | 15.0%  | 23.0%  | 33.5%\n2006  | 107.7  | 5,341  | 52.4  | 11.5%  | 13.3%  | 18.7%\n2007  | 126.1  | 6,030  | 65.3  | 14.0%  | 12.2%  | 21.0%\n2008  | 142.9  | 6,586  | 88.5  | 11.2%  | 12.5%  | 31.4%\n2009  | 145.0  | 6,443  | 70.3  | 0.9%  | 13.7%  | 56.2%\n2010  | 153.9  | 6,586  | 83.8  | 4.9%  | 14.5%  | 37.2%\n2011  | 162.5  | 6,700  | 111.8  | 3.5%  | 13.5%  | 29.6%\n2012  | 186.1  | 7,389  | 128.1  | 8.5%  | 10.3%  | 26.7%\n2013  | 199.9  | 7,644  | 136.7  | 5.0%  | 8.8%  | 33.1%\n2014  | 220.4  | 8,123  | 145.7  | 4.8%  | 7.3%  | 39.8%\n2015  | 204.6  | 7,274  | 116.2  | 0.9%  | 9.2%  | 57.1%\n2016  | 204.9  | 7,027  | 101.1  | −2.6%  | 30.7%  | 75.7%\n2017  | 217.8  | 7,210  | 122.0  | −0.2%  | 29.8%  | 69.3%\n2018  | 220.1  | 7,038  | 101.4  | −1.3%  | 16.6%  | 93.0%\n2019  | 222.5  | 6,877  | 84.5  | −0.7%  | 17.1%  | 113.6%\n2020  | 212.7  | 6,362  | 57.1  | −5.6%  | 22.3%  | 138.9%\n2021  | 224.9  | 6,518  | 74.9  | 1.2%  | 25.8%  | 86.8%\n2022  | 248.1  | 6,944  | 122.8  | 3.0%  | 21.4%  | 66.7%\n2023  | 260.3  | 7,077  | 93.8  | 1.3%  | 13.1%  | 84.9%"
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Angola produced, in 2018:\n\n* 8.6 million tons of cassava (8th largest producer in the world);\n* 3.5 million tons of banana (7th largest producer in the world, or the 10th largest, if we consider together with plantain);\n* 2.2 million tons of maize;\n* 1.2 million tons of sweet potato (10th largest producer in the world);\n* 806 thousand tons of potato;\n* 597 thousand tons of pineapple (13th largest producer in the world);\n* 572 thousand tons of sugarcane;\n* 355 thousand tons of cabbage;\n* 314 thousand tons of beans;\n* 280 thousand tons of palm oil;\n* 154 thousand tons of peanut;\n\nIn addition to smaller productions of other agricultural products, like coffee\n(16 thousand tons)."
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Foreign trade",
    "text": "Exports in 2004 reached US$10,530,764,911. The vast majority of Angola's\nexports, 92% in 2004, are petroleum products. US$785 million worth of\ndiamonds, 7.5% of exports, were sold abroad that year. Nearly all of Angola's\noil goes to the United States, 526 kbbl/d (83.6×10~~^~~ 3 m3/d) in 2006,\nmaking it the eighth largest supplier of oil to the United States, and to\nChina, 477 kbbl/d (75.8×10~~^~~ 3 m3/d) in 2006. In the first quarter of 2008,\nAngola became the main exporter of oil to China. The rest of its petroleum\nexports go to Europe and Latin America. U.S. companies account for more than\nhalf the investment in Angola, with Chevron-Texaco leading the way. The U.S.\nexports industrial goods and services, primarily oilfield equipment, mining\nequipment, chemicals, aircraft, and food, to Angola, while principally\nimporting petroleum.[_citation needed_] Trade between Angola and South Africa\nexceeded US$300 million in 2007. From the 2000s, many Chinese have settled and\nstarted up businesses."
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Petroleum",
    "text": "Angola produces and exports more petroleum than any other nation in sub-\nSaharan Africa, surpassing Nigeria first in the 2000s, then in 2022. In\nJanuary 2007 Angola became a member of OPEC, before leaving in December 2023,\nas they wanted to expand their oil production. Under the Lourenço since 2017,\nthe country has made efforts to incentive investments and reverse declining\nproduction, resulting in fresh investments made by international oil\ncompanies.\n\nPetrol price in 2019\n\nChevron Corporation, TotalEnergies., ExxonMobil, Eni, and BP all operate in\nthe country and represent a vast majority of daily production.\n\nBlock 17, operated by TotalEnergies, is Angola's biggest producing asset and\nis known as the Golden Block. The French major is currently executing several\nsubsea tieback projects there, including CLOV 3 and Begonia, whose final\ninvestment decisions (FIDs) were taken in 2022.\n\nThe United Nations has criticized the Angolan government for using torture,\nrape, summary executions, arbitrary detention, and disappearances, actions\nwhich Angolan government has justified on the need to maintain oil output.\n\nAngola is the third-largest trading partner of the United States in Sub-\nSaharan Africa, largely because of its petroleum exports. The U.S. imports 7%\nof its oil from Angola, about three times as much as it imported from Kuwait\njust prior to the Gulf War in 1991. The U.S. Government has invested US$4\nbillion in Angola's petroleum sector.\n\nOil makes up over 90% of Angola's exports."
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Diamonds",
    "text": "Angola is the third largest producer of diamonds in Africa and has only\nexplored 40% of the diamond-rich territory within the country, but has had\ndifficulty in attracting foreign investment because of corruption, human\nrights violations, and diamond smuggling. Production rose by 30% in 2006 and\nEndiama, the national diamond company of Angola, expects production to\nincrease by 8% in 2007 to 10 million carats annually. The government is trying\nto attract foreign companies to the provinces of Bié, Malanje and Uíge.\n\nThe Angolan government loses $375 million annually from diamond smuggling. In\n2003, the government began Operation Brilliant, an anti-smuggling\ninvestigation that arrested and deported 250,000 smugglers between 2003 and\n2006. Rafael Marques, a journalist and human rights activist, described the\ndiamond industry in his 2006 _Angola's Deadly Diamonds_ report as plagued by\n\"murders, beatings, arbitrary detentions and other human rights violations.\"\nMarques called on foreign countries to boycott Angola's \"conflict diamonds\".\nIn December 2014, the Bureau of International Labor Affairs issued a _List of\nGoods Produced by Child Labor or Forced Labor_ that classified Angola as one\nof the major diamond-producing African countries relying on both child labor\nand forced labor. The U.S. Department of Labor reported that \"there is little\npublicly available information on [Angola's] efforts to enforce child labor\nlaw\". Diamonds accounted for 1.48% of Angolan exports in 2014."
  },
  {
    "chapter_name": "Economy of Angola",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Iron",
    "text": "Under Portuguese rule, Angola began mining iron in 1957, producing 1.2 million\ntons in 1967 and 6.2 million tons by 1971. In the early 1970s, 70% of\nPortuguese Angola's iron exports went to Western Europe and Japan. After\nindependence in 1975, the Angolan Civil War (1975–2002) destroyed most of the\nterritory's mining infrastructure. The redevelopment of the Angolan mining\nindustry started in the late 2000s."
  }
]