[
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Mauritius** is a mixed developing economy based on\nagriculture, exports, financial services, and tourism. Since the 1980s, the\ngovernment of Mauritius has sought to diversify the country's economy beyond\nits dependence on just agriculture, particularly sugar production.",
    "openai_summarised_points": [
      "• The economy of Mauritius is characterized as a mixed developing economy, incorporating elements of agriculture, exports, financial services, and tourism.",
      "• Since the 1980s, the government of Mauritius has actively pursued economic diversification to reduce the country's reliance on agriculture, with a particular focus on moving beyond sugar production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:31:41.778572",
      "openai_model": "gpt-4.1-mini",
      "content_length": 287,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Sugarcane. Working in the salt marshes.\n\nIn 1961, Professor James Meade painted a bleak picture of the economic\nprospects of Mauritius, which then had a population of 650,000. All the\ndisadvantages associated with smallness of island states weighed heavily in\nhis conviction that Mauritius was caught in a Malthusian trap and, therefore,\nif economic progress could at all be achieved, it would be to a very limited\nextent.[_citation needed_] Since independence in 1968, Mauritius has developed\nfrom a low-income, agriculturally based economy to an upper-middle income\ndiversified economy with growing industrial, financial, ICT and tourist\nsectors. For most of the period, annual growth has been roughly 4%. This\ncompares very favourably with other sub-Saharan African countries and is\nlargely due to sustained progress in economic conditions; between 1977 and\n2008, growth averaged 4.6% compared with a 2.9% average in sub-Saharan Africa.\nAlso important is that it has achieved what few fast growing economies\nachieve, a more equitable income distribution and inequality (as measured by\nthe Gini coefficient) fell from 45.7 to 38.9 between 1980 and 2006. This\nremarkable achievement has been reflected in increased life expectancy,\nlowered infant mortality, and a much-improved infrastructure. Sugarcane is\ngrown on about 90% of the cultivated land area and accounts for 25% of export\nearnings.[_citation needed_] The government's development strategy centres on\nexpanding local financial institutions and building a domestic information\ntelecommunications industry. Mauritius has attracted more than 9,000 offshore\nentities, many aimed at commerce in India and South Africa, and investment in\nthe banking sector alone has reached over $1 billion. Mauritius, with its\nstrong textile sector, has been well poised to take advantage of the Africa\nGrowth and Opportunity Act (AGOA).[_citation needed_]\n\nWith a well-developed legal and commercial infrastructure and a tradition of\nentrepreneurship and representative government, Mauritius is one of the\ndeveloping world's most successful democracies. The economy has shown a\nconsiderable degree of resilience, and an environment already conducive to\ndynamic entrepreneurial activity has moved further toward economic freedom.\nThe island's institutional advantages are noticeable. A transparent and well-\ndefined investment code and legal system have made the foreign investment\nclimate in Mauritius one of the best in the region.[_citation needed_]\nTaxation is competitive and efficient. The economy is increasingly\ndiversified, with significant private-sector activity in sugar, tourism,\neconomic processing zones, and financial services, particularly in offshore\nenterprises.[_citation needed_] The government is trying to modernize the\nsugar and textile industries, which in the past were overly dependent on trade\npreferences, while promoting diversification into such areas as information\nand communications technology, financial and business services, seafood\nprocessing and exports, and free trade zones. Agriculture and industry have\nbecome less important to the economy, and services, especially tourism,\naccounted for over 72 percent of GDP.[_when?_] The government still owns\nutilities and controls imports of rice, flour, petroleum products, and\ncement.[_citation needed_]\n\nEurope and the United States are the traditional export markets of Mauritius;\npreferential trading deals with partners such as the European Union and the\nUnited States in some economic sectors, such as the sugar industry and in\ntextile and clothing sectors, resulted in the significant growth of the total\nexports of Mauritius, especially from the 1970s to the 1990s. Clothing and\ntextile industry in Mauritius started in the 1970s, when foreign investors\n(mainly coming from Hong Kong) started setting up firms which would assemble\nimported textiles into clothing; most of those activities happed in the export\nprocessing zones (EPZs). The clothing and textile sector spearheaded the\nindustrialization process in Mauritius; in 2019 it represented around 43% of\nexports.",
    "openai_summarised_points": [
      "• In 1961, Professor James Meade predicted bleak economic prospects for Mauritius, then with a population of 650,000, due to disadvantages typical of small island states and a perceived Malthusian trap limiting economic progress.",
      "• Since gaining independence in 1968, Mauritius transformed from a low-income, agriculture-based economy into an upper-middle-income diversified economy with expanding industrial, financial, information and communications technology (ICT), and tourism sectors.",
      "• Mauritius has maintained an average annual economic growth rate of roughly 4%, outperforming many sub-Saharan African countries; specifically, from 1977 to 2008, its growth averaged 4.6% compared to a 2.9% average in sub-Saharan Africa.",
      "• The country achieved notable improvements in income distribution, with the Gini coefficient declining from 45.7 in 1980 to 38.9 in 2006, reflecting more equitable wealth distribution than typically seen in fast-growing economies.",
      "• Social indicators improved alongside economic growth, including increased life expectancy, reduced infant mortality, and enhanced infrastructure development.",
      "• Sugarcane cultivation occupies approximately 90% of Mauritius’s cultivated land and contributes about 25% of the country’s export earnings.",
      "• The government’s development strategy focuses on expanding local financial institutions and developing a domestic information telecommunications industry.",
      "• Mauritius has attracted over 9,000 offshore entities, many targeting commerce with India and South Africa, with banking sector investments surpassing $1 billion.",
      "• The country’s strong textile sector positioned it well to benefit from the Africa Growth and Opportunity Act (AGOA).",
      "• Mauritius is recognized as one of the developing world’s most successful democracies, supported by a well-developed legal and commercial infrastructure and a tradition of entrepreneurship and representative government.",
      "• The economy has demonstrated resilience and increased economic freedom, fostering a dynamic entrepreneurial environment.",
      "• Mauritius benefits from institutional advantages including a transparent and well-defined investment code and legal system, which contribute to one of the best foreign investment climates in the region.",
      "• The taxation system is competitive and efficient, further supporting economic diversification.",
      "• The economy is increasingly diversified, with significant private-sector involvement in sugar, tourism, economic processing zones (EPZs), and financial services, especially offshore enterprises.",
      "• The government is actively modernizing the sugar and textile industries, which historically depended heavily on trade preferences, while promoting diversification into ICT, financial and business services, seafood processing and exports, and free trade zones.",
      "• Agriculture and industry have declined in relative economic importance, with services—particularly tourism—accounting for over 72% of GDP (date unspecified).",
      "• The government retains ownership of utilities and controls imports of essential commodities such as rice, flour, petroleum products, and cement.",
      "• Europe and the United States have traditionally been Mauritius’s main export markets.",
      "• Preferential trade agreements with the European Union and the United States in sectors like sugar and textiles significantly boosted Mauritius’s export growth from the 1970s through the 1990s.",
      "• The clothing and textile industry began in the 1970s, initiated by foreign investors mainly from Hong Kong who established firms assembling imported textiles into garments, primarily within export processing zones (EPZs).",
      "• The clothing and textile sector led Mauritius’s industrialization process and accounted for approximately 43% of exports in 2019."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:31:58.160595",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4102,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "History",
    "text": "The Mauritian economy has undergone remarkable transformations since\nindependence. From a poor country with high unemployment exporting mainly\nsugar and buffeted by the vagaries of world demand, Mauritius has become\nrelatively prosperous and diverse, although not without problems.\n\nThe 1970s were marked by a strong government commitment to diversify the\neconomy and to provide more high-paying jobs to the population. The promotion\nof tourism and the creation of the EPZs did much to attain these goals.\nBetween 1971 and 1977, about 64,000 jobs were created. However, in the rush to\nmake work, the government allowed EPZ firms to deny their workers fair wages,\nthe right to organize and strike, and the health and social benefits afforded\nother Mauritian workers. The boom in the mid-1970s was also fuelled by\nincreased foreign aid and exceptional sugar crops, coupled with high world\nprices.\n\nThe economic situation deteriorated in the late 1970s. Petroleum prices rose,\nthe sugar boom ended, and the balance of payments deficit steadily rose as\nimports outpaced exports; by 1979 the deficit amounted to a staggering US$111\nmillion. Mauritius approached the IMF and the World Bank for assistance. In\nexchange for loans and credits to help pay for imports, the government agreed\nto institute certain measures, including cutting food subsidies, devaluing the\ncurrency, and limiting government wage increases.\n\nBy the 1980s, thanks to a widespread political consensus on broad policy\nmeasures, the economy experienced steady growth, declining inflation, high\nemployment, and increased domestic savings. The EPZ with investment\nprincipally from China, Hong Kong and Taiwan, and came into its own,\nsurpassing sugar as the principal export-earning sector and employing more\nworkers than the sugar industry and the government combined, previously the\ntwo largest employers. In 1986 Mauritius had its first trade surplus in twelve\nyears. Tourism also boomed, with a concomitant expansion in the number of\nhotel beds and air flights. An aura of optimism accompanied the country's\neconomic success and prompted comparisons with other Asian countries that had\ndynamic economies, including Hong Kong, Singapore, Taiwan, and South Korea.\n\nThe economy had slowed down by the late 1980s and early 1990s, but the\ngovernment was optimistic that it could ensure the long-term prosperity of the\ncountry by drawing up and implementing prudent development plans. A stock\nexchange opened in Port Louis in 1989. As of 1993, Mauritius had a gross\ndomestic product (GDP) estimated at US$8.6 billion, with a growth rate of 5.5\npercent, and an inflation rate of 10.5 percent.\n\nMauritius has always depended on external financial flows, such as tourism\nrevenues, offshore financing and foreign aid.",
    "openai_summarised_points": [
      "• Since gaining independence, the Mauritian economy has transformed from a poor nation with high unemployment and an economy reliant mainly on sugar exports, vulnerable to fluctuations in global demand, into a relatively prosperous and diversified economy, albeit with ongoing challenges.",
      "• During the 1970s, the Mauritian government demonstrated a strong commitment to economic diversification and the creation of higher-paying jobs for its population, focusing on promoting tourism and establishing Export Processing Zones (EPZs) to achieve these objectives.",
      "• Between 1971 and 1977, approximately 64,000 jobs were created in Mauritius, largely due to government initiatives promoting tourism and EPZ development.",
      "• In the rapid expansion of employment through EPZ firms, the government permitted these firms to deny workers fair wages, the right to organize and strike, and access to health and social benefits that were otherwise available to other Mauritian workers.",
      "• The mid-1970s economic boom was supported by increased foreign aid, exceptional sugar crop yields, and high world sugar prices.",
      "• The economic situation worsened in the late 1970s due to rising petroleum prices, the end of the sugar boom, and a growing balance of payments deficit caused by imports exceeding exports; by 1979, this deficit reached US$111 million.",
      "• Facing economic difficulties, Mauritius sought assistance from the International Monetary Fund (IMF) and the World Bank, agreeing to implement austerity measures including cutting food subsidies, devaluing the currency, and limiting government wage increases in exchange for loans and credits to finance imports.",
      "• In the 1980s, a broad political consensus on economic policies facilitated steady economic growth, reduced inflation, high employment levels, and increased domestic savings in Mauritius.",
      "• The EPZ sector, with significant investment from China, Hong Kong, and Taiwan, became the leading export-earning sector in Mauritius during the 1980s, surpassing sugar exports and employing more workers than the sugar industry and government combined, which had previously been the two largest employers.",
      "• In 1986, Mauritius recorded its first trade surplus in twelve years, marking a significant economic milestone.",
      "• The tourism sector experienced substantial growth in the 1980s, accompanied by an expansion in hotel capacity and increased air traffic, contributing to the country’s economic optimism.",
      "• Mauritius’s economic success in the 1980s led to comparisons with dynamic Asian economies such as Hong Kong, Singapore, Taiwan, and South Korea.",
      "• Economic growth slowed in the late 1980s and early 1990s, but the Mauritian government remained optimistic about ensuring long-term prosperity through prudent development planning.",
      "• A stock exchange was established in Port Louis in 1989, enhancing the country’s financial infrastructure.",
      "• By 1993, Mauritius had an estimated gross domestic product (GDP) of US$8.6 billion, a growth rate of 5.5 percent, and an inflation rate of 10.5 percent.",
      "• Mauritius’s economy has consistently relied on external financial inflows, including revenues from tourism, offshore financial services, and foreign aid, to support its development and economic stability."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:08.709435",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2773,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Policies for success",
    "text": "Recent reports on progress on the Millennium Development Goals by the Overseas\nDevelopment Institute indicated four key reasons for economic success.\n\n1. Heterodox liberalisation and diversification\n2. Concerted strategy of nation building\n3. Strong and inclusive institutions\n4. High levels of equitable public investment",
    "openai_summarised_points": [
      "• Recent reports on progress regarding the Millennium Development Goals, published by the Overseas Development Institute, identified four principal factors contributing to the economic success of Mauritius.",
      "• The first key reason is heterodox liberalisation and diversification, indicating that Mauritius adopted unconventional or non-traditional approaches to liberalizing its economy and diversifying its economic activities.",
      "• The second factor is a concerted strategy of nation building, reflecting deliberate and coordinated efforts by the government and stakeholders to foster national unity and socio-economic development.",
      "• The third reason involves the presence of strong and inclusive institutions, emphasizing the role of robust governance structures that incorporate broad participation and equitable representation in economic and political processes.",
      "• The fourth and final factor is the implementation of high levels of equitable public investment, signifying substantial and fairly distributed government spending aimed at promoting inclusive growth and development across different sectors and populations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:12.497082",
      "openai_model": "gpt-4.1-mini",
      "content_length": 322,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Heterodox liberalisation and diversification",
    "text": "Mauritius has followed a pragmatic development strategy in which\nliberalisation process was sequenced and tailored to its competitive\nadvantages and weaknesses. The export-orientated approach has encouraged\nliberalisation supported by strong state involvement as a facilitator (of the\nenabling environment for the private sector); as operator (to encourage\ncompetition); and as regulator (to protect the economy as well as vulnerable\ngroups and sectors from shocks). Strategies were evidence-based and adapted\naccording to results. There has been consistency and stability, regardless of\nwhich political party is in power.\n\nLiberalisation occurred in phases that were initiated to build on advantages\nthe economy enjoyed on the international market.\n\n* 1970s: Mauritius profited from sugar rents, established an export processing zone EPZ and successfully attracted capital and foreign investment in manufacturing, from China, Hong Kong and Taiwan.\n* 1980s–1990s: EPZ expanded and led to a significant increase in foreign direct investment (FDI) and tourism. Preferential access to sugar and clothing markets amounted to 7% of GDP in the 1980s and 4.5% in the 1990s, capital and current accounts were liberalised, contributing to an investment and employment boom and the high inflow of FDI brought with it managerial skills.\n* 1990s–2010: Further diversification, liberalisation and investment as Chinese investors left to pursue investments in Africa and China.",
    "openai_summarised_points": [
      "• Mauritius has implemented a pragmatic development strategy characterized by a sequenced and tailored liberalisation process aligned with its competitive advantages and weaknesses, emphasizing an export-oriented approach.",
      "• The liberalisation strategy in Mauritius has been supported by strong state involvement, with the government acting as a facilitator by creating an enabling environment for the private sector, as an operator to encourage competition, and as a regulator to protect the economy and vulnerable groups and sectors from shocks.",
      "• Strategic decisions regarding liberalisation and economic policies in Mauritius have been evidence-based and adapted according to outcomes, ensuring consistency and stability irrespective of the ruling political party.",
      "• The liberalisation process in Mauritius occurred in distinct phases, each designed to capitalize on the country’s existing international market advantages.",
      "• In the 1970s, Mauritius benefited significantly from sugar rents and established an Export Processing Zone (EPZ), successfully attracting capital and foreign investment in manufacturing from investors originating from China, Hong Kong, and Taiwan.",
      "• During the 1980s and 1990s, the EPZ expanded substantially, resulting in a marked increase in foreign direct investment (FDI) and growth in the tourism sector.",
      "• Preferential access to sugar and clothing markets during the 1980s accounted for approximately 7% of Mauritius’s GDP, decreasing to 4.5% in the 1990s.",
      "• Throughout the 1980s and 1990s, Mauritius liberalised its capital and current accounts, which contributed to an investment and employment boom; the high inflow of FDI during this period also facilitated the transfer of managerial skills to the local economy.",
      "• Between the 1990s and 2010, Mauritius pursued further economic diversification, liberalisation, and investment initiatives, coinciding with the withdrawal of Chinese investors who redirected their investments toward Africa and China."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:21.204100",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1463,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Concerted strategy of nation building",
    "text": "A concerted strategy of nation building since Independence created the\nfoundations for sustained growth. Partnerships across ethnic groups allowed\neconomic redistribution to be negotiated and the resulting better balance of\neconomic and political power allowed strong and independent institutions. The\nemerging political system encouraged a consultative approach to policy\nformation that allowed strategies for growth to be continued regardless of\nchanges in the parties in power.",
    "openai_summarised_points": [
      "• Since Independence, Mauritius implemented a concerted strategy of nation building that established the foundations for sustained economic growth.",
      "• Strategic partnerships were formed across different ethnic groups, facilitating negotiated economic redistribution.",
      "• This redistribution led to a more balanced allocation of economic and political power among the population.",
      "• The improved balance of power enabled the development of strong and independent institutions within the country.",
      "• The emerging political system promoted a consultative approach to policy formation, fostering inclusive dialogue among stakeholders.",
      "• Such a consultative framework ensured continuity of growth strategies despite changes in the ruling political parties."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:24.478754",
      "openai_model": "gpt-4.1-mini",
      "content_length": 480,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Strong and inclusive institutions",
    "text": "Strong institutions are critical in ensuring country's competitiveness,\neconomic resilience and stability. They have supported development strategies\nand ensured that export earnings are reinvested in strategic and productive\nsectors. In the financial sector, they have built a regulated and well-\ncapitalised banking and financial system that protected it from toxic assets\nprior to the 2008 financial crisis.",
    "openai_summarised_points": [
      "• Strong institutions are essential for maintaining a country's competitiveness, economic resilience, and stability.",
      "• These institutions have played a pivotal role in supporting development strategies in Mauritius.",
      "• They have ensured that export earnings are systematically reinvested into strategic and productive sectors of the economy.",
      "• In the financial sector, these institutions have established a regulated and well-capitalised banking and financial system.",
      "• This robust financial system effectively shielded Mauritius from exposure to toxic assets prior to the 2008 global financial crisis."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:28.241294",
      "openai_model": "gpt-4.1-mini",
      "content_length": 410,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Corruption laws",
    "text": "In 2002, the government adopted the Prevention of Corruption Act, which led to\nthe setting up of an Independent Commission Against Corruption (ICAC) a few\nmonths later. The ICAC has the power to detect and investigate corruption and\nmoney-laundering offences and can also confiscate the proceeds of corruption\nand money laundering. Corruption is not seen as an obstacle to foreign direct\ninvestment. Mauritius ranks 55th out of 168 countries in Transparency\nInternational’s Corruption Perceptions Index for 2023.",
    "openai_summarised_points": [
      "• In 2002, the government of Mauritius adopted the Prevention of Corruption Act, establishing a legal framework to combat corruption within the country.",
      "• Following the enactment of the Prevention of Corruption Act, the Independent Commission Against Corruption (ICAC) was established a few months later to enforce anti-corruption measures.",
      "• The ICAC is empowered to detect and investigate offences related to corruption and money laundering, ensuring comprehensive oversight of illicit financial activities.",
      "• In addition to investigative powers, the ICAC has the authority to confiscate proceeds derived from corruption and money laundering, thereby disrupting financial incentives for such crimes.",
      "• Despite concerns about corruption in many countries, corruption is not perceived as a significant obstacle to foreign direct investment (FDI) in Mauritius.",
      "• According to Transparency International’s Corruption Perceptions Index for 2023, Mauritius is ranked 55th out of 168 countries, reflecting its relative standing in terms of perceived corruption levels globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:32:32.981580",
      "openai_model": "gpt-4.1-mini",
      "content_length": 512,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "High levels of equitable public investment",
    "text": "Mauritius has a strong human capital foundation developed through consistent\nand equitable investment in human development. This enabled Mauritius to\nexploit advantages, learn from expertise brought in through FDI and maintain\ncompetitiveness in a fast evolving international market. Education and health\nservices are free and have been expanded in recent years, in order to create\nfurther employment opportunities and ensuring inclusive growth. The educated\nand adaptable workforce were essential elements of 1980s export-orientated\ngrowth. Around 90% of entrepreneurs in the export processing zone (EPZ) and in\nthe manufacturing sector were eventually Mauritian nationals, businesspeople\nhad the human capital, education and knowledge needed to exploit market\nopportunities. According to the Government of Mauritius the general outlook\nfor the manufacturing sector is positive, as the country offers many\nopportunities to entrepreneurs across the various value chains but\ninsufficient skilled labour and limited research and development will remain\nimpediments to potentially higher growth in this sector."
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Financial services",
    "text": "Mauritius provides an environment for banks, insurance and reinsurance\ncompanies, captive insurance managers, trading companies, ship owners or\nmanagers, fund managers and professionals to conduct their international\nbusiness. The economic success achieved in the 1980s engendered the rapid\ngrowth of the financial services sector in Mauritius. The following types of\noffshore activities can be conducted in Mauritius:\n\n* Offshore Banking\n* Offshore Insurance\n* Offshore Funds Management\n* International Financial Services\n* Operational Headquarters\n* International Consultancy Services\n* Shipping and Ship Management\n* Aircraft Financing and Leasing\n* International Licensing and Franchising\n* International Data Processing and Information Technology Services\n* Offshore Pension Funds\n* International Trading\n* International Assets Management"
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Information and communication technology",
    "text": "Since 2002, Mauritius has invested heavily into the development of a hub in\ninformation and communication technology (ICT). The contribution of the ICT\nsector accounts for 5.7% of the GDP. The ICT Sector employs 15,390 people.\nMauritius has also contributed to the development of post quantum cryptography\nby contributing to GnuTLS with an implementation of MLKEM-1024 and\nSecP384R1MLKEM1024."
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Macroeconomic statistics",
    "text": "Name  | Source  | Year  | Notes  | Ref\n---|---|---|---|---\nGDP (PPP)\nInternational Monetary Fund | 2012  | GDP (PPP) is $20.200 billion  | [1]\nWorld Bank | 2012  | GDP (PPP) is $19,245,631,329  | [2]\n[3]\nThe World Factbook | 2012  | GDP (PPP) is $20,950,000,000  | [4]\nGDP (PPP) per capita\nInternational Monetary Fund | 2012  | GDP (PPP) per capita is $15,591.974  | [5]\nWorld Bank | 2012  | GDP (PPP) per capita is $14,902  | [6]\nThe World Factbook | 2013  | GDP (PPP) per capita is $16,100  | [7]\nGDP (PPP) per person employed\nWorld Bank | 1990-2010  |  | [8]\nThe World Factbook | 2012  |  | [9] Archived 2013-05-10 at the Wayback Machine\nGDP (nominal)\nUnited Nations | 2012  | GDP (nominal) is $10,086,649,093  | [10]\nInternational Monetary Fund | 2013  | GDP (nominal) is US$11.930 billion  | [11]\nWorld Bank | 2012  | GDP (nominal) is $10,486,037,634  | [12]\n[13]\nThe World Factbook | 2013  | GDP (nominal) is $11.9 billion  | [14] Archived 2018-12-24 at the Wayback Machine\nGDP (nominal) per capita\nUnited Nations | 2012  |  | [15]\nInternational Monetary Fund | 2013  | GDP (nominal) per capita is US$9,159.681  | [16]\nWorld Bank | 2012  |  | [17]\nThe World Factbook | 2013  |  | [18] Archived 2018-12-24 at the Wayback Machine\nGross national income (Atlas method) | World Bank | 2012  | Gross national income is US$11,070 million  | [19]\nGNI per capita (Atlas method and PPP) | World Bank | 2012  | Average national income (PPP) of US$8,570 per person/Year  | [20]\n\n**Household income or consumption by percentage share** :\n\n**Distribution of family income – Gini index** : 39 (2006 estimate)\n\n**Agriculture – products** : sugarcane, tea, corn, potatoes, bananas, pulses;\ncattle, goats; fish\n\n**Industrial production growth rate** : 8% (2000 estimate)\n\n**Electricity – production** : 1,836 GWh (2002)\n\n**Electricity – consumption** : 1,707 GWh (2002)\n\n**Oil – consumption** : 21,000 bbl/d (3,300 m3/d) (2003 estimate)\n21,000 bbl/d (3,300 m3/d) (2001 estimate)\n\n**Current account balance** : $1,339 million (2011 estimate)\n$799.4 million (2010 estimate)\n\n**Reserves of foreign exchange and gold** : $2,797 billion (2012 estimate)\n$2,601 billion (2010 estimate)\n\n**2013 Index of Economic Freedom rank** : 8th[_citation needed_]\n\n**Exchange rates** : Mauritian rupees per US dollar – 30.12 (26 March 2014),\n30.99 (1 February 2010), 32.86 (2006), 29.14 (2005), 27.50 (2004), 27.90\n(2003), 29.96 (2002), 29.13 (2001)"
  },
  {
    "chapter_name": "Economy of Mauritius",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Climate change and the economy",
    "text": "Mauritius faces significant environmental challenges such as flash floods and\ncoastal erosion, which have substantial economic implications. In June 2024,\nthe government announced plans to introduce a 2% climate levy on company\nprofits to finance projects that combat climate change and restore the natural\necosystem. Companies with sales of less than 50 million rupees ($1.06 million)\nwill be exempt from this levy. The proceeds from this corporate responsibility\nlevy will be used to support national initiatives to protect, manage, invest\nin, and restore the country's natural ecosystem and combat the effects of\nclimate change. The nation of 1.26 million people is experiencing more climate\nchange-related events and needs to mobilize 300 billion rupees to meet its\nadaptation and mitigation goals.\n\nIn 2024, flash floods brought the capital, Port Louis, to a halt, causing\nsignificant disruptions in banking and market activities. Tourism, a crucial\nsource of foreign currency for Mauritius, is expected to generate over $2\nbillion in earnings from visitors this year. However, more than 37 kilometres\n(23 mi) of the coastline have been affected by erosion, posing a threat to\nthis vital industry. In response, the government has allocated 3.2 billion\nrupees to the new climate fund, which will be used to rehabilitate\napproximately 26 kilometres (16 mi) of shoreline and 30 degraded sites. For\nthe fiscal year ending in June 2025, Mauritius' government expenditure is\nprojected to rise by 17% to 237.3 billion rupees, with revenue expected to\ngrow by 20% to 210.5 billion rupees. This will narrow the fiscal gap to 3.4%\nof GDP from 3.9% in 2024. Borrowing requirements will increase to 38 billion\nrupees from 30.7 billion rupees, including 14 billion rupees in foreign\nfinancing. Despite higher borrowing, public debt as a percentage of GDP is\nprojected to decrease to 71.5% from 74.5% in 2024, though in absolute terms,\nit will rise to 567.49 billion rupees from 524.6 billion rupees. Additionally,\na government-support agreement is expected to unlock over 15 billion rupees in\nprivate-sector investment in renewable energy projects, demonstrating the\ngovernment's commitment to sustainable development and economic resilience."
  }
]