[
  {
    "chapter_name": "Economy of Benin",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Benin\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( June 2014)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nThe **economy of Benin** remains underdeveloped and dependent on subsistence\nagriculture and cotton. Cotton accounts for 40% of Benin's GDP and roughly 80%\nof official export receipts. There is also production of textiles, palm\nproducts, and cocoa beans. Maize (corn), beans, rice, peanuts, cashews,\npineapples, cassava, yams, and other various tubers are grown for local\nsubsistence. Benin began producing a modest quantity of offshore oil in\nOctober 1982. Production ceased in recent years but exploration of new sites\nis ongoing.\n\nA modest fishing fleet provides fish and shrimp for local subsistence and\nexport to Europe. Formerly government-owned commercial activities are now\nprivatized. A French brewer acquired the former state-run brewery. Smaller\nbusinesses are privately owned by Beninese citizens, but some firms are\nforeign owned, primarily French and Lebanese. The private commercial and\nagricultural sectors remain the principal contributors to growth.",
    "openai_summarised_points": [
      "• The economy of Benin is characterized as underdeveloped and heavily reliant on subsistence agriculture and cotton production.",
      "• Cotton constitutes approximately 40% of Benin's Gross Domestic Product (GDP).",
      "• Cotton also accounts for roughly 80% of the country's official export receipts.",
      "• In addition to cotton, Benin produces textiles, palm products, and cocoa beans for economic activity.",
      "• The country cultivates various crops for local subsistence, including maize (corn), beans, rice, peanuts, cashews, pineapples, cassava, yams, and other tubers.",
      "• Benin began offshore oil production in October 1982, marking a modest start in its energy sector.",
      "• Oil production in Benin ceased in recent years, though exploration activities for new offshore sites are ongoing.",
      "• The country maintains a modest fishing fleet that supplies fish and shrimp primarily for local consumption and export to Europe.",
      "• Formerly state-owned commercial enterprises have been privatized; for example, a French brewery acquired the former state-run brewery.",
      "• Smaller businesses in Benin are privately owned by local Beninese citizens, while some firms are foreign-owned, predominantly by French and Lebanese investors.",
      "• The private sector, encompassing commercial and agricultural activities, remains the main driver of economic growth in Benin."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:43:24.313008",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1328,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Benin",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic development",
    "text": "Since the transition to a democratic government in 1990, Benin has undergone\nan economic recovery. A large injection of external investment from both\nprivate and public sources has alleviated the economic difficulties of the\nearly 1990s caused by global recession and persistently low commodity prices\n(although the latter continues to affect the economy). The manufacturing\nsector is confined to some light industry, which is mainly involved in\nprocessing primary products and the cow production of consumer goods. A\nplanned joint hydroelectric project with neighboring Togo is intended to\nreduce Benin's dependence on imported energy mostly from Ghana, which\ncurrently accounts for a significant proportion of the country's imports.\n\nThe service sector has grown quickly, stimulated by economic liberalization\nand fiscal reform, and the use of modern technology such as automobiles and\ncomputers has grown considerably as a result. Membership of the CFA Franc Zone\noffers reasonable currency stability as well as access to French economic\nsupport. Benin sells its products mainly to France and, in smaller quantities,\nto the Netherlands, Korea, Japan, and India. France is Benin's leading source\nfor imports. Benin is also a member of the Economic Community of West African\nStates (ECOWAS).\n\nDespite its rapid growth, the economy of Benin still remains underdeveloped\nand dependent on subsistence agriculture, cotton production, and regional\ntrade. Growth in real output averaged a sound 5% since 1996, but a rapid\npopulation rise offset much of this growth on a per capita basis. Inflation\nhas subsided over the past several years. Commercial and transport activities,\nwhich make up a large part of GDP, are vulnerable to developments in Nigeria,\nparticularly fuel shortages.\n\nAlthough trade unions in Benin represent up to 75% of the formal workforce,\nthe large informal economy has been noted by the International Trade Union\nConfederation (ITCU) to contain ongoing problems, including a lack of women's\nwage equality, the use of child labour, and the continuing issue of forced\nlabour.\n\nIn December 2014, the Bureau of International Labor Affairs issued a _List of\nGoods Produced by Child Labor or Forced Labor_ in which the Republic of Benin\nwas mentioned among 74 other countries where significant instances of child\nlabor were observed. Two major products involved such working conditions in\nBenin: cotton and crushed granite.",
    "openai_summarised_points": [
      "• Since the transition to a democratic government in 1990, Benin has experienced an economic recovery characterized by increased external investment from both private and public sources.",
      "• This influx of investment has helped alleviate the economic difficulties faced in the early 1990s, which were primarily caused by the global recession and persistently low commodity prices, although the impact of low commodity prices continues to affect Benin’s economy.",
      "• The manufacturing sector in Benin is limited to some light industries, mainly engaged in processing primary products and producing consumer goods, including cow production.",
      "• A planned joint hydroelectric project with neighboring Togo aims to reduce Benin’s dependence on imported energy, which is currently largely sourced from Ghana and constitutes a significant portion of the country’s imports.",
      "• The service sector has experienced rapid growth, driven by economic liberalization and fiscal reforms, leading to increased adoption and use of modern technologies such as automobiles and computers.",
      "• Membership in the CFA Franc Zone provides Benin with currency stability and access to economic support from France.",
      "• Benin primarily exports its products to France and, in smaller quantities, to the Netherlands, Korea, Japan, and India; France is the leading source of imports for Benin.",
      "• The country is a member of the Economic Community of West African States (ECOWAS).",
      "• Despite rapid economic growth, Benin’s economy remains underdeveloped and heavily reliant on subsistence agriculture, cotton production, and regional trade.",
      "• Since 1996, Benin’s real GDP growth has averaged approximately 5% annually; however, rapid population growth has offset much of this growth on a per capita basis.",
      "• Inflation in Benin has decreased over the past several years, contributing to economic stability.",
      "• Commercial and transport activities, which constitute a large part of GDP, are vulnerable to developments in Nigeria, especially fuel shortages.",
      "• Trade unions in Benin represent up to 75% of the formal workforce; however, the large informal economy presents ongoing challenges such as lack of women’s wage equality, child labor, and forced labor.",
      "• The International Trade Union Confederation (ITCU) has noted these issues within Benin’s informal economy.",
      "• In December 2014, the Bureau of International Labor Affairs included Benin among 75 countries with significant instances of child labor or forced labor, specifically citing cotton and crushed granite as major products associated with these conditions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:43:31.932038",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2435,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Benin",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture",
    "text": "Benin produced in 2018:\n\n* 3.8 million tons of cassava (17th largest producer in the world);\n* 2.7 million tons of yam (4th largest producer in the world, losing only to Nigeria, Ghana and Ivory Coast);\n* 1.5 million tons of maize;\n* 758 thousand tons of cotton (12th largest producer in the world);\n* 598 thousand tons of palm oil;\n* 459 thousand tons of rice;\n* 372 thousand tons of pineapple;\n* 319 thousand tons of sorghum;\n* 253 thousand tons of tomato;\n* 225 thousand tons of peanut;\n* 221 thousand tons of soy;\n* 215 thousand tons of cashew nuts (5th largest producer in the world, losing only to Vietnam, India, Ivory Coast and Philippines);\n\nIn addition to smaller productions of other agricultural products."
  },
  {
    "chapter_name": "Economy of Benin",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Financial Sector",
    "text": "| This article **relies largely or entirely on asingle source**. Relevant\ndiscussion may be found on the talk page. Please help improve this article by\nintroducing citations to additional sources.\n_Find sources:_ \"Economy of Benin\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( June 2014)_\n---|---\n\nBenin's financial sector is dominated by banks, and in general remains\nshallow. However, a series of reforms were undertaken in the 1990s, which\nresulted in the consolidation of the banking sector and in the privatization\nof all state banks.\n\nA legal framework regarding licensing, bank activities, organizational and\ncapital requirements, inspections and sanctions (all applicable to all\ncountries of the Union) is in place and underwent significant reforms in 1999.\nThere is no customer deposit insurance system.\n\nBenin has a lively and diversified microfinance sector. Data from 2003 by the\nCentral Bank stated a penetration rate of microfinance services of almost 60\npercent. In 2006 the Ministry of Microfinance and Employment of Youth and\nWomen counted 762 organizations with 1308 branches, including Cooperatives,\nNGOs, Savings/Credit Associations and government projects. Programmes for\nstrengthening the sector are carried out on national and regional levels, such\nas the PRAFIDE (Programme Régional d’Appui à la finance Décentralisée). The\nmicrofinance sector is also subject to supervision through the Central Bank as\nwell as the responsible Ministry for Microfinance and Employment of Youth and\nWomen.\n\nBenin is member of the Bourse Regionale des Valeures Mobilières (BRVM) located\nin Abidjan, Côte d'Ivoire. Stocks were issued by a number of companies in the\nregion. Listed bonds were partly issued by companies and partly by governments\nof the West African Monetary and Economic Union (UEMOA).\n\nThe payment and settlement system and clearing mechanisms were reformed in\n2004 through the BCEAO and offer RTGS and SWIFT access to banks, financial\ninstitutions, the stock exchange as well as the Central bank and special\nbanks.\n\n* Banque Internationale du Bénin (BI.BE)\n* Bank of Africa Benin\n* Continental Bank Benin\n* Diamond Bank Benin (DBB)\n* Ecobank\n* Financial Bank\n* Finadev\n* Caisse Nationale d'Epargne\n* Credit du Bénin\n* Equibail\n* United Bank of Africa\n* Africa Bank for the Industry and the trade\n* Sahelo-Saharian Bank of the Industry and Trade Development"
  },
  {
    "chapter_name": "Economy of Benin",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in billion US$\nPPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in billion US$\nnominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 3.75  | 1,000  | 2.30  | 9.3%  | 9.6%  | n/a\n1985  | 5.15  | 1,170  | 1.58  | 4.3%  | 1.2%  | n/a\n1990  | 6.62  | 1,290  | 2.89  | 9.0%  | 1.1%  | n/a\n1995  | 9.18  | 1,519  | 2.99  | 6.0%  | 14.5%  | n/a\n2000  | 12.64  | 1,806  | 3.52  | 5.9%  | 4.0%  | 39.6%\n2005  | 17.16  | 2,106  | 6.57  | 1.7%  | 4.7%  | 27.0%\n2006  | 18.39  | 2,189  | 7.03  | 3.9%  | 5.2%  | 8.4%\n2007  | 20.02  | 2,315  | 8.17  | 6.0%  | 1.3%  | 14.3%\n2008  | 21.40  | 2,403  | 9.79  | 4.9%  | 6.8%  | 18.3%\n2009  | 22.04  | 2,402  | 9.73  | 2.3%  | 0.7%  | 18.7%\n2010  | 22.78  | 2,411  | 9.54  | 2.1%  | 2.3%  | 21.0%\n2011  | 23.93  | 2,461  | 10.69  | 3.0%  | 2.8%  | 21.9%\n2012  | 25.55  | 2,552  | 11.15  | 4.8%  | 7.0%  | 19.5%\n2013  | 27.86  | 2,702  | 12.52  | 7.2%  | 1.0%  | 18.5%\n2014  | 30.14  | 2,840  | 13.29  | 6.4%  | −1.1%  | 22.3%\n2015  | 30.96  | 2,832  | 11.39  | 1.8%  | 0.2%  | 30.9%\n2016  | 32.30  | 2,869  | 11.82  | 3.3%  | −0.8%  | 35.9%\n2017  | 34.75  | 2,996  | 12.70  | 5.7%  | 1.8%  | 39.6%\n2018  | 36.69  | 3,073  | 14.26  | 6.7%  | 0.8%  | 41.1%\n2019  | 40.08  | 3,261  | 14.39  | 6.9%  | −0.9%  | 41.2%\n2020  | 42.41  | 3,354  | 15.67  | 3.8%  | 3.0%  | 46.1%\n2021  | 46.47  | 3,575  | 17.70  | 7.2%  | 1.7%  | 50.3%\n2022  | 52.89  | 3,961  | 17.44  | 6.3%  | 1.4%  | 54.2%\n2023  | 58.28  | 4,244  | 19.68  | 6.4%  | 2.8%  | 54.5%\n2024  | 63.54  | 4,501  | 21.32  | 6.5%  | 2.0%  | 54.0%"
  }
]