[
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of India** is a developing mixed economy with a notable public\nsector in strategic sectors. It is the world's fourth-largest economy by\nnominal GDP and the third-largest by purchasing power parity (PPP); on a per\ncapita income basis, India ranked 136th by GDP (nominal) and 119th by GDP\n(PPP). From independence in 1947 until 1991, successive governments followed\nthe Soviet model and promoted protectionist economic policies, with extensive\nSovietization, state intervention, demand-side economics, natural resources,\nbureaucrat-driven enterprises and economic regulation. This is characterised\nas dirigism, in the form of the Licence Raj. The end of the Cold War and an\nacute balance of payments crisis in 1991 led to the adoption of a broad\neconomic liberalisation in India and indicative planning. India has about\n1,900 public sector companies, with the Indian state having complete control\nand ownership of railways and highways. The Indian government has major\ncontrol over banking, insurance, farming, fertilizers and chemicals, airports,\nessential utilities. The state also exerts substantial control over\ndigitalization, telecommunication, supercomputing, space, port and shipping\nindustries, which were effectively nationalised in the mid-1950s but has seen\nthe emergence of key corporate players.\n\nNearly 70% of India's GDP is driven by domestic consumption; the country\nremains the world's fourth-largest consumer market. Aside private consumption,\nIndia's GDP is also fueled by government spending, investments, and exports.\nIn 2022, India was the world's 10th-largest importer and the 8th-largest\nexporter. India has been a member of the World Trade Organization since 1\nJanuary 1995. It ranks 63rd on the ease of doing business index and 40th on\nthe Global Competitiveness Index. India has one of the world's highest number\nof billionaires along with extreme income inequality. Economists and social\nscientists often consider India a welfare state. India's overall social\nwelfare spending stood at 8.6% of GDP in 2021-22, which is much lower than the\naverage for OECD nations. With 586 million workers, the Indian labour force is\nthe world's second-largest. Despite having one of the longest working hours,\nIndia has one of the lowest workforce productivity levels in the world.\nEconomists say that due to structural economic problems, India is experiencing\njobless economic growth.\n\nDuring the Great Recession, the economy faced a mild slowdown. India endorsed\nKeynesian policy and initiated stimulus measures (both fiscal and monetary) to\nboost growth and generate demand. In subsequent years, economic growth\nrevived.\n\nIn 2021–22, the foreign direct investment (FDI) in India was $82 billion. The\nleading sectors for FDI inflows were the Finance, Banking, Insurance and R&D.\nIndia has free trade agreements with several nations and blocs, including\nASEAN, SAFTA, Mercosur, South Korea, Japan, Australia, the United Arab\nEmirates, and several others which are in effect or under negotiating stage.\n\nThe service sector makes up more than 50% of GDP and remains the fastest\ngrowing sector, while the industrial sector and the agricultural sector\nemploys a majority of the labor force. The Bombay Stock Exchange and National\nStock Exchange are some of the world's largest stock exchanges by market\ncapitalisation. India is the world's sixth-largest manufacturer, representing\n2.6% of global manufacturing output. Nearly 65% of India's population is\nrural, and contributes about 50% of India's GDP. India faces high\nunemployment, rising income inequality, and a drop in aggregate demand.\nIndia's gross domestic savings rate stood at 29.3% of GDP in 2022.",
    "openai_summarised_points": [
      "• The economy of India is classified as a developing mixed economy characterized by a significant public sector involvement in strategic industries.",
      "• India is the world's fourth-largest economy by nominal GDP and the third-largest by purchasing power parity (PPP).",
      "• On a per capita income basis, India ranked 136th by nominal GDP and 119th by GDP (PPP).",
      "• From independence in 1947 until 1991, successive Indian governments adhered to the Soviet model, promoting protectionist economic policies, extensive Sovietization, state intervention, demand-side economics, natural resource exploitation, bureaucrat-driven enterprises, and economic regulation.",
      "• This protectionist approach is typified by the Licence Raj, a system of extensive licensing and regulation.",
      "• The end of the Cold War and a severe balance of payments crisis in 1991 prompted India to adopt broad economic liberalization policies and indicative planning measures.",
      "• India has approximately 1,900 public sector companies, with the Indian state maintaining complete control and ownership of railways and highways.",
      "• The Indian government exerts major control over sectors including banking, insurance, farming, fertilizers, chemicals, airports, and essential utilities.",
      "• The state also maintains substantial control over digitalization, telecommunication, supercomputing, space, ports, and shipping industries, which were effectively nationalized in the mid-1950s but have seen the emergence of key corporate players.",
      "• Nearly 70% of India's GDP is driven by domestic consumption, making India the world's fourth-largest consumer market.",
      "• Aside from private consumption, India's GDP is fueled by government spending, investments, and exports.",
      "• In 2022, India was the world's 10th-largest importer and the 8th-largest exporter.",
      "• India has been a member of the World Trade Organization since 1 January 1995.",
      "• India ranks 63rd on the ease of doing business index and 40th on the Global Competitiveness Index.",
      "• India has one of the world's highest numbers of billionaires and exhibits extreme income inequality.",
      "• Economists and social scientists often consider India a welfare state, with social welfare spending amounting to 8.6% of GDP in 2021-22, which is significantly lower than the OECD average.",
      "• The Indian labor force comprises 586 million workers, making it the second-largest globally.",
      "• Despite long working hours, India has one of the lowest workforce productivity levels worldwide.",
      "• Structural economic problems have led economists to describe India’s growth as jobless economic growth.",
      "• During the Great Recession, India experienced a mild economic slowdown and endorsed Keynesian policies, implementing fiscal and monetary stimulus measures to stimulate demand and growth.",
      "• Economic growth revived in subsequent years following the recession.",
      "• In 2021–22, foreign direct investment (FDI) in India reached $82 billion, with the leading sectors being finance, banking, insurance, and research & development.",
      "• India maintains free trade agreements with several nations and blocs, including ASEAN, SAFTA, Mercosur, South Korea, Japan, Australia, the United Arab Emirates, and others either in effect or under negotiation.",
      "• The service sector accounts for over 50% of India’s GDP and remains the fastest-growing sector.",
      "• The industrial and agricultural sectors employ the majority of India's labor force.",
      "• The Bombay Stock Exchange and National Stock Exchange are among the world's largest stock exchanges by market capitalization.",
      "• India is the sixth-largest manufacturer globally, contributing approximately 2.6% to global manufacturing output.",
      "• About 65% of India's population resides in rural areas, contributing roughly 50% to the national GDP.",
      "• India faces challenges including high unemployment, rising income inequality, and declining aggregate demand.",
      "• The gross domestic savings rate in India was 29.3% of GDP in 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:23.214224",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3681,
      "bullet_points_count": 30
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "For a continuous duration of nearly 1700 years from the year 1 CE, India was\nthe world's largest economy, constituting 35 to 40% of the world GDP. The\ncombination of protectionist, import-substitution, Fabian socialism, and\nsocial democratic-inspired policies governed India for sometime after the end\nof British rule. The economy was then characterised as Dirigism, It had\nextensive regulation, protectionism, public ownership of large monopolies,\npervasive corruption and slow growth. Since 1991, continuing economic\nliberalisation has moved the country towards a market-based economy. By 2008,\nIndia had established itself as one of the world's faster-growing economies.",
    "openai_summarised_points": [
      "• From approximately 1 CE for nearly 1700 years, India was the world's largest economy, accounting for 35 to 40% of the global GDP during that period.",
      "• After the end of British rule, India adopted a series of economic policies influenced by protectionism, import substitution, Fabian socialism, and social democratic principles.",
      "• The post-independence Indian economy was characterized by Dirigism, featuring extensive regulation, protectionist measures, and public ownership of large monopolies.",
      "• The economy during this period was also marked by pervasive corruption and slow economic growth.",
      "• Since 1991, India has undergone continuous economic liberalization, shifting towards a market-based economy.",
      "• By the year 2008, India had established itself as one of the world's faster-growing economies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:29.664370",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 673,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.0.1",
    "section_name": "Indus Valley Civilisation",
    "text": "The citizens of the Indus Valley civilisation, a permanent settlement that\nflourished between 2800 BCE and 1800 BCE, practised agriculture, domesticated\nanimals, used uniform weights and measures, made tools and weapons, and traded\nwith other cities. Evidence of well-planned streets, a drainage system, and\nwater supply reveals their knowledge of urban planning, which included the\nfirst-known urban sanitation systems and the existence of a form of municipal\ngovernment.",
    "openai_summarised_points": [
      "• The Indus Valley Civilisation was a permanent settlement that flourished approximately between 2800 BCE and 1800 BCE.",
      "• The citizens engaged in various economic activities including agriculture, domestication of animals, and trade with other cities.",
      "• They utilized uniform weights and measures, indicating a standardized system for trade and commerce.",
      "• The inhabitants manufactured tools and weapons, demonstrating technological skills and craftsmanship.",
      "• Archaeological evidence shows that they traded with other cities, suggesting a well-developed trade network.",
      "• The urban infrastructure included well-planned streets and a sophisticated drainage system, reflecting advanced urban planning.",
      "• The water supply systems in their cities indicate knowledge of water management and sanitation.",
      "• Their urban planning included the first-known urban sanitation systems, showcasing early innovations in public health infrastructure.",
      "• The civilization exhibited the existence of a form of municipal government, implying organized civic administration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:32.210151",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 472,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.0.2",
    "section_name": "West Coast",
    "text": "Maritime trade was carried out extensively between southern regions of India\nand Southeast Asia and West Asia from early times until around the fourteenth\ncentury CE. Both the Malabar and Coromandel Coasts were the sites of important\ntrading centres from as early as the first century BCE, used for import and\nexport as well as transit points between the Mediterranean region and\nsoutheast Asia. Over time, traders organised themselves into associations\nwhich received state patronage. This state patronage for overseas trade came\nto an end by the thirteenth century CE, when it was largely taken over by the\nlocal Parsi, Jewish, Syrian Christian, and Muslim communities, initially on\nthe Malabar and subsequently on the Coromandel coast.",
    "openai_summarised_points": [
      "• Maritime trade between southern India, Southeast Asia, and West Asia was extensive from early times until approximately the fourteenth century CE.",
      "• The Malabar and Coromandel Coasts served as significant trading centers from as early as the first century BCE.",
      "• These coasts functioned as key import and export hubs, as well as transit points connecting the Mediterranean region with Southeast Asia.",
      "• Over time, traders organized themselves into associations that received patronage from the state, facilitating and regulating overseas trade activities.",
      "• The system of state patronage for overseas trade declined by the thirteenth century CE.",
      "• After the decline of direct state involvement, local communities—specifically Parsi, Jewish, Syrian Christian, and Muslim groups—began to largely take over the management of overseas trade.",
      "• This shift in control initially occurred on the Malabar Coast and later extended to the Coromandel Coast."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:38.487548",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 738,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.0.3",
    "section_name": "Silk Route",
    "text": "Other scholars suggest trading from India to West Asia and Eastern Europe was\nactive between the 14th and 18th centuries. During this period, Indian traders\nsettled in Surakhani, a suburb of greater Baku, Azerbaijan. These traders\nbuilt a Hindu temple, which suggests commerce was active and prosperous for\nIndians by the 17th century.\n\nFurther north, the Saurashtra and Bengal coasts played an important role in\nmaritime trade, and the Gangetic plains and the Indus valley housed several\ncentres of river-borne commerce. Most overland trade was carried out via the\nKhyber Pass connecting the Punjab region with Afghanistan and onward to the\nMiddle East and Central Asia. Although many kingdoms and rulers issued coins,\nbarter was prevalent. Villages paid a portion of their agricultural produce as\nrevenue to the rulers, while their craftsmen received a part of the crops at\nharvest time for their services.",
    "openai_summarised_points": [
      "• Scholars suggest that active trade between India and West Asia and Eastern Europe occurred from the 14th to the 18th centuries.",
      "• During this period, Indian traders established settlements in Surakhani, a suburb of greater Baku, Azerbaijan.",
      "• The construction of a Hindu temple by Indian traders in Surakhani indicates that commerce was both active and prosperous for Indians by the 17th century.",
      "• The coasts of Saurashtra and Bengal played significant roles in maritime trade routes during this era.",
      "• The Gangetic plains and the Indus valley contained several centers of river-borne commerce, facilitating regional trade.",
      "• Most overland trade was conducted via the Khyber Pass, which connected the Punjab region with Afghanistan and extended onward to the Middle East and Central Asia.",
      "• While many kingdoms and rulers issued coins, barter remained a prevalent form of trade exchange.",
      "• Villages paid a portion of their agricultural produce as revenue to their rulers.",
      "• Craftsmen received a share of the crops at harvest time in exchange for their services, indicating a system of reciprocal economic relations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:46.885699",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 908,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mughal, Rajput, and Maratha eras (1526–1820)",
    "text": "The Indian economy was the largest and most prosperous throughout world\nhistory and would continue to be under the Mughal Empire, up until the 18th\ncentury. Sean Harkin estimates that China and India may have accounted for 60\nto 70 percent of world GDP in the 17th century. The Mughal economy functioned\non an elaborate system of coined currency, land revenue and trade. Gold,\nsilver and copper coins were issued by the royal mints which functioned on the\nbasis of free coinage. The political stability and uniform revenue policy\nresulting from a centralized administration under the Mughals, coupled with a\nwell-developed internal trade network, ensured that India–before the arrival\nof the British–was to a large extent economically unified, despite having a\ntraditional agrarian economy characterised by a predominance of subsistence\nagriculture. Agricultural production increased under Mughal agrarian reforms,\nwith Indian agriculture being advanced compared to Europe at the time, such as\nthe widespread use of the seed drill among Indian peasants before its adoption\nin European agriculture, and possibly higher per-capita agricultural output\nand standards of consumption than 17th century Europe.\n\nThe Mughal Empire had a thriving industrial manufacturing economy, with India\nproducing about 25% of the world's industrial output up until 1750, making it\nthe most important manufacturing centre in international trade. Manufactured\ngoods and cash crops from the Mughal Empire were sold throughout the world.\nKey industries included textiles, shipbuilding, and steel, and processed\nexports included cotton textiles, yarns, thread, silk, jute products,\nmetalware, and foods such as sugar, oils and butter. Cities and towns boomed\nunder the Mughal Empire, which had a relatively high degree of urbanization\nfor its time, with 15% of its population living in urban centres, higher than\nthe percentage of the urban population in contemporary Europe at the time and\nhigher than that of British India in the 19th century.\n\nIn early modern Europe, there was significant demand for products from Mughal\nIndia, particularly cotton textiles, as well as goods such as spices, peppers,\nindigo, silks, and saltpeter (for use in munitions). European fashion, for\nexample, became increasingly dependent on Mughal Indian textiles and silks.\nFrom the late 17th century to the early 18th century, Mughal India accounted\nfor 95% of British imports from Asia, and the Bengal Subah province alone\naccounted for 40% of Dutch imports from Asia. In contrast, there was very\nlittle demand for European goods in Mughal India, which was largely self-\nsufficient. Indian goods, especially those from Bengal, were also exported in\nlarge quantities to other Asian markets, such as Indonesia and Japan. At the\ntime, Mughal Bengal was the most important centre of cotton textile\nproduction.\n\nIn the early 18th century the Mughal Empire declined, as it lost western,\ncentral and parts of south and north India to the Maratha Empire, which\nintegrated and continued to administer those regions. The decline of the\nMughal Empire led to decreased agricultural productivity, which in turn\nnegatively affected the textile industry. The subcontinent's dominant economic\npower in the post-Mughal era was the Bengal Subah in the east., which\ncontinued to maintain thriving textile industries and relatively high real\nwages. However, the former was devastated by the Maratha invasions of Bengal\nand then British colonization in the mid-18th century. After the loss at the\nThird Battle of Panipat, the Maratha Empire disintegrated into several\nconfederate states, and the resulting political instability and armed conflict\nseverely affected economic life in several parts of the country – although\nthis was mitigated by localised prosperity in the new provincial kingdoms. By\nthe late eighteenth century, the British East India Company had entered the\nIndian political theatre and established its dominance over other European\npowers. This marked a determinative shift in India's trade, and a less-\npowerful effect on the rest of the economy.",
    "openai_summarised_points": [
      "• The Indian economy was historically the largest and most prosperous in the world, maintaining this status until the 18th century under the Mughal Empire.",
      "• Sean Harkin estimates that in the 17th century, China and India together may have accounted for 60 to 70 percent of the world's GDP.",
      "• The Mughal economy operated on an elaborate system involving coined currency, land revenue, and trade, with gold, silver, and copper coins issued by royal mints based on free coinage.",
      "• Political stability and a uniform revenue policy under centralized Mughal administration, along with a well-developed internal trade network, contributed to India's economic unity prior to British colonization, despite its predominantly agrarian economy characterized by subsistence agriculture.",
      "• Agricultural production increased during Mughal reforms, with Indian agriculture being more advanced than European agriculture at the time, exemplified by the widespread use of the seed drill among Indian peasants before its adoption in Europe.",
      "• India possibly had higher per-capita agricultural output and standards of consumption compared to 17th-century Europe.",
      "• The Mughal Empire had a thriving industrial manufacturing sector, producing approximately 25% of the world's industrial output until 1750, making India the leading manufacturing hub in international trade.",
      "• Mughal India exported manufactured goods and cash crops globally, including textiles, shipbuilding, and steel industries.",
      "• Key manufactured exports included cotton textiles, yarns, thread, silk, jute products, metalware, and foodstuffs such as sugar, oils, and butter.",
      "• Urbanization was relatively high for its time, with 15% of Mughal India's population living in cities and towns, surpassing the urbanization levels of contemporary Europe and 19th-century British India.",
      "• European demand in early modern Europe was significant for Mughal products, especially cotton textiles, spices, peppers, indigo, silks, and saltpeter (used in munitions).",
      "• Mughal India, particularly from the late 17th to early 18th century, supplied 95% of British imports from Asia, with Bengal Subah alone accounting for 40% of Dutch imports from Asia.",
      "• Mughal India was largely self-sufficient, with minimal demand for European goods, but exported large quantities of Indian goods, especially textiles from Bengal, to other Asian markets like Indonesia and Japan.",
      "• Bengal was the most important center of cotton textile production during this period.",
      "• In the early 18th century, the Mughal Empire declined as it lost western, central, and parts of southern and northern India to the Maratha Empire, which integrated and administered those regions.",
      "• The decline led to reduced agricultural productivity, adversely affecting the textile industry and overall economic vitality.",
      "• Post-Mughal India saw Bengal Subah as the dominant economic power in the east, maintaining thriving textile industries and relatively high wages until it was devastated by Maratha invasions and British colonization in the mid-18th century.",
      "• The Maratha Empire disintegrated after the Third Battle of Panipat, leading to political instability and armed conflicts that severely impacted economic life, though some local prosperity persisted in provincial kingdoms.",
      "• By the late 18th century, the British East India Company had established dominance over other European powers in India, marking a pivotal shift in Indian trade and exerting a less direct influence on the broader economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:38:53.440340",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4103,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "British era (1793–1947)",
    "text": "> There is no doubt that our grievances against the British Empire had a sound\n> basis. As the painstaking statistical work of the Cambridge historian Angus\n> Maddison has shown, India's share of world income collapsed from 22.6% in\n> 1700, almost equal to Europe's share of 23.3% at that time, to as low as\n> 3.8% in 1952. Indeed, at the beginning of the 20th century, \"the brightest\n> jewel in the British Crown\" was the poorest country in the world in terms of\n> per capita income.\n>\n> — Manmohan Singh\n\nThe global contribution to world's GDP by major economies from 1 CE to 2003 CE\naccording to Angus Maddison's estimates. Up until the 18th century, China and\nIndia were the two largest economies by GDP output.\n\nFrom the beginning of the 19th century, the British East India Company's\ngradual expansion and consolidation of power brought a major change in\ntaxation and agricultural policies, which tended to promote commercialisation\nof agriculture with a focus on trade, resulting in decreased production of\nfood crops, mass impoverishment and destitution of farmers, and in the short\nterm, led to numerous famines. The economic policies of the British Raj caused\na severe decline in the handicrafts and handloom sectors, due to reduced\ndemand and dipping employment. After the removal of international restrictions\nby the Charter of 1813, Indian trade expanded substantially with steady\ngrowth. The result was a significant transfer of capital from India to\nBritain, which, due to the colonial policies of the British, led to a massive\ndrain of revenue rather than any systematic effort at modernisation of the\ndomestic economy. The economy of the Indian subcontinent was the largest in\nthe world for most of recorded history up until the onset of colonialism in\nearly 19th century.\n\nEstimated GDP per capita of India and United Kingdom during 1700–1950 in 1990\nUS$according to Maddison. However, Maddison's estimates for 18th-century India\nhave been criticized as gross underestimates, Bairoch estimates India had a\nhigher GDP per capita in the 18th century, and Parthasarathi's findings show\nhigher real wages in 18th-century Bengal and Mysore. But there is consensus\nthat India's per capita GDP and income stagnated during the colonial era,\nstarting in the late 18th century.\n\nUnder British rule, India's share of the world economy declined from 24.4% in\n1700 down to 4.2% in 1950. India's GDP (PPP) per capita was stagnant during\nthe Mughal Empire and began to decline prior to the onset of British rule.\nIndia's share of global industrial output declined from 25% in 1750 down to 2%\nin 1900. At the same time, Britain's share of the world economy rose from 2.9%\nin 1700 up to 9% in 1870. The British East India Company, following their\nconquest of Bengal in 1757, had forced open the large Indian market to British\ngoods, which could be sold in India without tariffs or duties, compared to\nlocal Indian producers who were heavily taxed, while in Britain protectionist\npolicies such as bans and high tariffs were implemented to restrict Indian\ntextiles from being sold there, whereas raw cotton was imported from India\nwithout tariffs to British factories which manufactured textiles from Indian\ncotton and sold them back to the Indian market. British economic policies gave\nthem a monopoly over India's large market and cotton resources. India served\nas both a significant supplier of raw goods to British manufacturers and a\nlarge captive market for British manufactured goods.\n\nBritish territorial expansion in India throughout the 19th century created an\ninstitutional environment that, on paper, guaranteed property rights among the\ncolonisers, encouraged free trade, and created a single currency with fixed\nexchange rates, standardised weights and measures and capital markets within\nthe company-held territories. It also established a system of railways and\ntelegraphs, a civil service that aimed to be free from political interference,\na common-law, and an adversarial legal system. This coincided with major\nchanges in the world economy – industrialisation, and significant growth in\nproduction and trade. However, at the end of colonial rule, India inherited an\neconomy that was one of the poorest in the developing world, with industrial\ndevelopment stalled, agriculture unable to feed a rapidly growing population,\na largely illiterate and unskilled labour force, and extremely inadequate\ninfrastructure.\n\nThe 1872 census revealed that 91.3% of the population of the region\nconstituting present-day India resided in villages. This was a decline from\nthe earlier Mughal era, when 85% of the population resided in villages and 15%\nin urban centres under Akbar's reign in 1600. Urbanisation generally remained\nsluggish in British India until the 1920s, due to the lack of\nindustrialisation and absence of adequate transportation. Subsequently, the\npolicy of discriminating protection (where certain important industries were\ngiven financial protection by the state), coupled with the Second World War,\nsaw the development and dispersal of industries, encouraging rural-urban\nmigration, and in particular, the large port cities of Bombay, Calcutta and\nMadras grew rapidly. Despite this, only one-sixth of India's population lived\nin cities by 1951.\n\nThe effect of British rule on India's economy is a controversial topic.\nLeaders of the Indian independence movement and economic historians have\nblamed colonial rule for India's poor economic performance following\nindependence and argued that the capital required for the Industrial\nRevolution in Britain came from India. At the same time, other historians have\ncountered that India's poor economic performance was due to various sectors\nbeing in a state of growth and decline due to changes brought in by\ncolonialism and a world that was moving towards industrialisation and economic\nintegration.\n\nSeveral economic historians have argued that Indian real wages declined in the\nearly 19th century, or possibly beginning in the very late 18th century,\nlargely as a result of British colonial rule. According to Prasannan\nParthasarathi and Sashi Sivramkrishna, the grain wages of Indian weavers were\nlikely comparable to that of their British counterparts and their average\nincome was around five times the subsistence level, which was comparable to\nadvanced parts of Europe. However they concluded that due to the scarcity of\ndata, it was hard to draw definitive conclusions and that more research was\nrequired. It has also been argued that India went through a period of\ndeindustrialization in the latter half of the 18th century as an indirect\noutcome of the collapse of the Mughal Empire.",
    "openai_summarised_points": [
      "• The grievances against the British Empire's economic policies in India are well-founded, supported by statistical evidence showing a drastic decline in India's share of world income from 22.6% in 1700 to 3.8% in 1952, as demonstrated by Cambridge historian Angus Maddison.",
      "• In 1700, India's share of global income was nearly equal to Europe's (India at 22.6%, Europe at 23.3%), but by 1952, India's share had diminished significantly, reflecting severe economic decline.",
      "• At the start of the 20th century, India was considered \"the brightest jewel in the British Crown\" yet was also the poorest country in the world in terms of per capita income.",
      "• Angus Maddison's estimates of global GDP contributions from 1 CE to 2003 CE show China and India as the two largest economies until the 18th century, after which shifts occurred due to colonial and industrial developments.",
      "• The expansion and consolidation of the British East India Company from the early 19th century led to major changes in Indian taxation and agricultural policies, promoting commercialization focused on trade, which resulted in decreased food crop production, widespread impoverishment, and famines.",
      "• British policies caused a severe decline in India's handicrafts and handloom sectors due to reduced demand and employment, exacerbating economic hardship.",
      "• Following the Charter of 1813, international restrictions were removed, leading to substantial expansion of Indian trade and a significant transfer of capital from India to Britain, which primarily resulted in revenue drain rather than systematic economic modernization.",
      "• Historically, the Indian subcontinent had the largest economy in the world until early 19th-century colonialism, with a GDP per capita during the Mughal Empire that was stagnant and declining before British rule.",
      "• According to Maddison, India's share of the world economy decreased from 24.4% in 1700 to 4.2% in 1950, with GDP (PPP) per capita stagnating during the Mughal period and declining before British dominance.",
      "• India's share of global industrial output fell from 25% in 1750 to 2% in 1900, while Britain's share increased from 2.9% in 1700 to 9% in 1870, illustrating Britain's rising economic dominance.",
      "• The British East India Company, after conquering Bengal in 1757, monopolized India's large market and cotton resources, facilitating the sale of British manufactured textiles in India and restricting Indian producers through tariffs and taxes.",
      "• Britain imposed protectionist policies such as bans and high tariffs to restrict Indian textiles in Britain, while importing raw cotton from India tariff-free, enabling British textile industries to flourish using Indian raw materials.",
      "• Colonial economic policies created a monopoly over India's market and resources, turning India into both a raw material supplier and a captive market for British goods.",
      "• British territorial expansion in India established an institutional environment that guaranteed property rights among colonizers, promoted free trade, created a single currency with fixed exchange rates, standardized weights and measures, and developed infrastructure such as railways and telegraphs.",
      "• The colonial administration established a civil service aimed to be free from political interference, a common-law legal system, and an adversarial legal framework, aligning with global industrialization trends.",
      "• Despite these infrastructural and institutional developments, at the end of colonial rule, India inherited an economy characterized by extreme poverty, stalled industrial development, agriculture unable to sustain a rapidly growing population, a largely illiterate and unskilled labor force, and inadequate infrastructure.",
      "• The 1872 census indicated that 91.3% of the population in present-day India resided in villages, a slight decline from 85% rural population during Mughal rule under Akbar in 1600, with urbanization remaining sluggish until the 1920s.",
      "• Post-1920s, policies of protectionism and the impact of World War II spurred industrial growth and rural-urban migration, leading to rapid development of port cities like Bombay, Calcutta, and Madras, but only one-sixth of India's population was urban by 1951.",
      "• The colonial period's economic impact remains controversial; Indian independence leaders and historians blame colonial rule for poor post-independence economic performance and argue that colonial revenues fueled Britain's Industrial Revolution.",
      "• Conversely, some historians contend that India's economic decline was due to internal sectoral shifts and global industrialization trends, not solely colonial policies.",
      "• Several economic historians suggest that Indian real wages declined in the early 19th century, possibly starting in the late 18th century, largely attributable to British colonial policies.",
      "• Prasannan Parthasarathi and Sashi Sivramkrishna estimate that Indian weavers' grain wages were comparable to British wages and about five times the subsistence level, similar to wages in advanced Europe, but acknowledge data limitations hinder definitive conclusions.",
      "• It is argued that India experienced deindustrialization in the late 18th century, partly as an indirect consequence of the collapse of the Mughal Empire, which affected traditional industries and economic structures."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:39:28.032846",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6660,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Pre-liberalisation period (1947–1991)",
    "text": "Navi Mumbai built during pre-liberalization\n\nIndian economic policy after independence was influenced by the colonial\nexperience, which was seen as exploitative by Indian leaders exposed to the\nplanned economy of the Soviet Union. Domestic policy tended towards\nprotectionism, with a strong emphasis on import substitution\nindustrialisation, economic interventionism, a large government-run public\nsector, business regulation, and central planning, while trade and foreign\ninvestment policies were relatively liberal. Five-Year Plans of India\nresembled central planning in the Soviet Union. Steel, mining, machine tools,\ntelecommunications, insurance, and power plants, among other industries, were\neffectively nationalised in the mid-1950s. The Indian economy of this period\nis characterised as Dirigism.\n\nChange in per capita GDP of India, 1820–2015. Figures are inflation-adjusted\nto 1990 International Geary-Khamis dollars.\n\n> Never talk to me about profit, Jeh, it is a dirty word.\n>\n> — Nehru, India's Fabian Socialism-inspired first prime minister to\n> industrialist J. R. D. Tata, when Tata suggested state-owned companies\n> should be profitable\n\nJawaharlal Nehru, the first prime minister of India, along with the\nstatistician Prasanta Chandra Mahalanobis, formulated and oversaw economic\npolicy during the initial years of the country's independence. They expected\nfavourable outcomes from their strategy, involving the rapid development of\nheavy industry by both public and private sectors, and based on direct and\nindirect state intervention, rather than the more extreme Soviet-style central\ncommand system. The policy of concentrating simultaneously on capital- and\ntechnology-intensive heavy industry and subsidising manual, low-skill cottage\nindustries was criticised by economist Milton Friedman, who thought it would\nwaste capital and labour, and retard the development of small manufacturers.\n\n> I cannot decide how much to borrow, what shares to issue, at what price,\n> what wages and bonus to pay, and what dividend to give. I even need the\n> government's permission for the salary I pay to a senior executive.\n>\n> — J. R. D. Tata, on the Indian regulatory system, 1969\n\nSince 1965, the use of high-yielding varieties of seeds, increased fertilisers\nand improved irrigation facilities collectively contributed to the Green\nRevolution in India, which improved the condition of agriculture by increasing\ncrop productivity, improving crop patterns and strengthening forward and\nbackward linkages between agriculture and industry. However, it has also been\ncriticised as an unsustainable effort, resulting in the growth of capitalistic\nfarming, ignoring institutional reforms and widening income disparities.\n\nIn 1984, Rajiv Gandhi promised economic liberalization, he made V. P. Singh\nthe finance minister, who tried to reduce tax evasion and tax receipts rose\ndue to this crackdown although taxes were lowered. This process lost its\nmomentum during the later tenure of Mr. Gandhi as his government was marred by\nscandals.",
    "openai_summarised_points": [
      "• Indian economic policy after independence was heavily influenced by the colonial experience, which was perceived as exploitative by Indian leaders who had been exposed to the planned economy of the Soviet Union.",
      "• The domestic policy framework favored protectionism, emphasizing import substitution industrialization, economic interventionism, a large government-run public sector, business regulation, and central planning.",
      "• Conversely, trade and foreign investment policies during this period were relatively liberal, allowing for some openness to external markets.",
      "• India’s Five-Year Plans closely resembled the central planning model of the Soviet Union, focusing on state-directed economic development.",
      "• In the mid-1950s, key industries such as steel, mining, machine tools, telecommunications, insurance, and power plants were effectively nationalized, consolidating state control over critical sectors.",
      "• The overall economic approach of this period is characterized as Dirigism, indicating a dirigiste or state-directed economy.",
      "• A visual representation (not included here) shows the change in India’s per capita GDP from 1820 to 2015, inflation-adjusted to 1990 International Geary-Khamis dollars.",
      "• Jawaharlal Nehru, India’s first prime minister, along with statistician Prasanta Chandra Mahalanobis, formulated and oversaw the initial economic policies post-independence, aiming for rapid development of heavy industry through both public and private sectors.",
      "• Their strategy relied on direct and indirect state intervention rather than the extreme Soviet-style central command economy, with a focus on capital- and technology-intensive heavy industries and subsidized manual, low-skill cottage industries.",
      "• This approach faced criticism from economist Milton Friedman, who argued that it would waste capital and labor and hinder the growth of small manufacturers.",
      "• Nehru is famously quoted as saying, “Never talk to me about profit, Jeh, it is a dirty word,” reflecting the socialist-inspired ethos of his government.",
      "• J. R. D. Tata, in 1969, expressed frustration with India’s regulatory system, stating, “I cannot decide how much to borrow, what shares to issue, at what price, what wages and bonus to pay, and what dividend to give,” highlighting the bureaucratic constraints faced by industry leaders.",
      "• Since 1965, India experienced the Green Revolution, characterized by the adoption of high-yielding seed varieties, increased use of fertilizers, and improved irrigation, which collectively enhanced agricultural productivity, crop patterns, and the linkage between agriculture and industry.",
      "• The Green Revolution was criticized for being unsustainable, promoting capitalistic farming, neglecting institutional reforms, and widening income disparities among farmers.",
      "• In 1984, Prime Minister Rajiv Gandhi pledged to pursue economic liberalization, appointing V. P. Singh as finance minister, who attempted to reduce tax evasion; this effort led to increased tax revenues despite lowering tax rates.",
      "• However, the momentum of economic liberalization waned during Gandhi’s later tenure due to government scandals and political instability."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:39:37.996416",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3040,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Post-liberalisation period (since 1991)",
    "text": "The collapse of the Soviet Union, which was India's major trading partner, and\nthe Gulf War, which caused a spike in oil prices, resulted in a major balance-\nof-payments crisis for India, which found itself facing the prospect of\ndefaulting on its loans. India asked for a $1.8 billion bailout loan from the\nInternational Monetary Fund (IMF), which in return demanded de-regulation.\n\nIn response, the Narasimha Rao government, including Finance Minister Manmohan\nSingh, initiated economic reforms in 1991. The reforms did away with the\nLicence Raj, reduced tariffs and interest rates and ended many public\nmonopolies, allowing automatic approval of foreign direct investment in many\nsectors. Since then, the overall thrust of liberalisation has remained the\nsame, although no government has tried to take on powerful lobbies such as\ntrade unions and farmers, on contentious issues such as reforming labour laws\nand reducing agricultural subsidies. This has been accompanied by increases in\nlife expectancy, literacy rates, and food security, although urban residents\nhave benefited more than rural residents.\n\nGDP grows exponentially, almost doubling every five years. Indian GDP growth\nrate from 1985 to 2016 in red, compared to that of China in green\n\nFrom 2010, India has risen from ninth-largest to the fifth-largest economies\nin the world by nominal GDP in 2019 by surpassing UK, France, Italy and\nBrazil.\n\nIndia started recovery in 2013–14 when the GDP growth rate accelerated to 6.4%\nfrom the previous year's 5.5%. The acceleration continued through 2014–15 and\n2015–16 with growth rates of 7.5% and 8.0% respectively. For the first time\nsince 1990, India grew faster than China which registered 6.9% growth in\n2015.[_needs update_] However the growth rate subsequently decelerated, to\n7.1% and 6.6% in 2016–17 and 2017–18 respectively, partly because of the\ndisruptive effects of 2016 Indian banknote demonetisation and the Goods and\nServices Tax (India).\n\nIndia is ranked 63rd out of 190 countries in the World Bank's 2020 ease of\ndoing business index, up 14 points from the last year's 100 and up 37 points\nin just two years. In terms of dealing with construction permits and enforcing\ncontracts, it is ranked among the 10 worst in the world, while it has a\nrelatively favourable ranking when it comes to protecting minority investors\nor getting credit. The strong efforts taken by the Department of Industrial\nPolicy and Promotion (DIPP) to boost ease of doing business rankings at the\nstate level is said to affect the overall rankings of India.",
    "openai_summarised_points": [
      "• The collapse of the Soviet Union, India's major trading partner, and the Gulf War, which caused a spike in oil prices, led to a significant balance-of-payments crisis for India, raising fears of default on its loans.",
      "• In response to this crisis, India requested a $1.8 billion bailout loan from the International Monetary Fund (IMF), which in turn demanded economic deregulation as a condition for the bailout.",
      "• The Narasimha Rao government, including Finance Minister Manmohan Singh, initiated comprehensive economic reforms in 1991 to address the crisis.",
      "• These reforms abolished the Licence Raj system, reduced tariffs and interest rates, and ended many public monopolies, facilitating the automatic approval of foreign direct investment (FDI) in numerous sectors.",
      "• Since the 1991 reforms, the overall trajectory of liberalization has remained consistent, although successive governments have avoided confronting powerful lobbies such as trade unions and farmers on contentious issues like labor law reforms and agricultural subsidies.",
      "• The post-liberalization period has seen improvements in life expectancy, literacy rates, and food security, with urban residents benefiting more significantly than rural populations.",
      "• India's GDP has experienced exponential growth, nearly doubling every five years, with a comparative growth trend from 1985 to 2016 shown against China's in the relevant data.",
      "• From 2010 onwards, India advanced from the ninth-largest to the fifth-largest economy in the world by nominal GDP in 2019, surpassing the United Kingdom, France, Italy, and Brazil.",
      "• India began a recovery phase in 2013–14, with GDP growth accelerating to 6.4% from 5.5% in the previous year, and continued to grow at 7.5% in 2014–15 and 8.0% in 2015–16.",
      "• In 2015, India grew faster than China for the first time since 1990, with China’s growth rate at 6.9%.",
      "• Subsequently, India’s growth rate decelerated to 7.1% in 2016–17 and 6.6% in 2017–18, partly due to the disruptive effects of the 2016 demonetisation of banknotes and the implementation of the Goods and Services Tax (GST).",
      "• According to the World Bank's 2020 ease of doing business index, India ranked 63rd out of 190 countries, improving by 14 points from 100 in the previous year and by 37 points over two years.",
      "• India’s ranking is among the top 10 worst globally in dealing with construction permits and enforcing contracts but is relatively better in protecting minority investors and facilitating credit.",
      "• The Department of Industrial Policy and Promotion (DIPP) has undertaken strong efforts to improve India’s ease of doing business rankings at the state level, positively influencing the overall national ranking."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:39:57.850439",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2557,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "COVID-19 pandemic and aftermath (2020–present)",
    "text": "During the COVID-19 pandemic, numerous rating agencies downgraded India's GDP\npredictions for FY21 to negative figures, signalling a recession in India, the\nmost severe since 1979. The Indian Economy contracted by 6.6 percent which was\nlower than the estimated 7.3 percent decline. In 2022, the ratings agency\nFitch Ratings upgraded India's outlook to stable similar to S&P Global Ratings\nand Moody's Investors Service's outlooks. In the first quarter of financial\nyear 2022–2023, the Indian economy grew by 13.5%.",
    "openai_summarised_points": [
      "• During the COVID-19 pandemic, numerous rating agencies downgraded India's GDP predictions for FY21 to negative figures, indicating a recession in India, the most severe since 1979.",
      "• The Indian economy contracted by 6.6 percent in FY21, which was lower than the initially estimated 7.3 percent decline.",
      "• In 2022, Fitch Ratings upgraded India's economic outlook to stable, aligning with the outlooks of S&P Global Ratings and Moody's Investors Service.",
      "• In the first quarter of the financial year 2022–2023, India’s economy experienced a growth of 13.5 percent."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:39:59.895956",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 514,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2024 (with IMF\nstaff estimates in 2025–2029). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund finds them unreliable.\n\nYear  | GDP\n(in Bil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 366.4  | 526.9  | 189.4  | 271.0  | 6.74%  | 11.3%  | n/a  | n/a\n1981  | 431.5  | 603.2  | 196.5  | 274.7  | 6.01%  | 12.7%  | n/a  | n/a\n1982  | 474.1  | 647.5  | 203.5  | 278.0  | 3.5%  | 7.7%  | n/a  | n/a\n1983  | 528.6  | 705.3  | 222.0  | 296.3  | 7.3%  | 12.6%  | n/a  | n/a\n1984  | 568.6  | 741.4  | 215.6  | 281.1  | 3.8%  | 5.2%  | n/a  | n/a\n1985  | 617.4  | 787.1  | 237.6  | 302.9  | 5.3%  | 5.56%  | n/a  | n/a\n1986  | 659.9  | 822.8  | 252.8  | 315.2  | 4.8%  | 7.8%  | n/a  | n/a\n1987  | 703.0  | 857.7  | 283.8  | 346.2  | 4.0%  | 9.1%  | n/a  | n/a\n1988  | 797.9  | 952.7  | 299.6  | 357.8  | 10.18%  | 7.2%  | n/a  | n/a\n1989  | 878.5  | 1,027.0  | 301.2  | 352.2  | 5.9%  | 4.6%  | n/a  | n/a\n1990  | 961.8  | 1,101.3  | 326.6  | 374.0  | 5.5%  | 11.2%  | n/a  | n/a\n1991  | 1,004.8  | 1,127.4  | 274.8  | 308.4  | 1.1%  | 13.5%  | 6.8%  | 75.3%\n1992  | 1,084.1  | 1,192.2  | 293.3  | 322.5  | 5.5%  | 9.9%  | 6.8%  | 77.4%\n1993  | 1,162.5  | 1,253.5  | 284.2  | 306.4  | 4.8%  | 7.3%  | 6.8%  | 77.0%\n1994  | 1,266.4  | 1,339.2  | 333.0  | 352.2  | 6.7%  | 10.3%  | 6.8%  | 73.5%\n1995  | 1,390.8  | 1,442.9  | 366.6  | 380.3  | 7.6%  | 10.0%  | 7%  | 69.7%\n1996  | 1,523.2  | 1,550.6  | 399.8  | 407.0  | 7.6%  | 9.4%  | 7.2%  | 66.0%\n1997  | 1,612.3  | 1,610.8  | 423.2  | 422.8  | 4.1%  | 6.8%  | 7.3%  | 67.8%\n1998  | 1,731.2  | 1,698.1  | 428.8  | 420.6  | 6.2%  | 13.1%  | 7.5%  | 68.1%\n1999  | 1,904.2  | 1,834.4  | 466.9  | 449.8  | 8.5%  | 5.7%  | 7.7%  | 70.0%\n2000  | 2,024.7  | 1,916.3  | 476.6  | 451.1  | 4.0%  | 3.8%  | 7.8%  | 73.6%\n2001  | 2,172.7  | 2,021.1  | 494.0  | 459.5  | 4.9%  | 4.3%  | 8%  | 78.7%\n2002  | 2,292.8  | 2,097.1  | 524.0  | 479.2  | 3.9%  | 4.0%  | 8.2%  | 82.9%\n2003  | 2,523.8  | 2,270.6  | 618.4  | 556.3  | 7.9%  | 3.9%  | 8.4%  | 84.4%\n2004  | 2,795.0  | 2,474.2  | 721.6  | 638.8  | 7.8%  | 3.8%  | 8.5%  | 83.4%\n2005  | 3,066.0  | 2.655.3  | 834.2  | 726.9  | 9.3%  | 4.4%  | 8.7%  | 81.0%\n2006  | 3,415.2  | 2,913.1  | 949.1  | 814.4  | 9.3%  | 6.7%  | 8.6%  | 77.2%\n2007  | 3,776.5  | 3,174.3  | 1,238.7  | 1,046.9  | 10.3%  | 6.2%  | 8.5%  | 74.1%\n2008  | 3,968.1  | 3,288.3  | 1,224.1  | 1,019.5  | 3.9%  | 9.1%  | 8.5%  | 72.8%\n2009  | 4,306.4  | 3,519.4  | 1,365.4  | 1,121.2  | 7.9%  | 12.3%  | 8.4%  | 71.5%\n2010  | 4,729.2  | 3,812.0  | 1,708.5  | 1,384.2  | 8.5%  | 10.5%  | 8.3%  | 66.4%\n2011  | 5,079.8  | 4,039.1  | 1,823.1  | 1,458.1  | 6.6%  | 9.5%  | 8.2%  | 68.6%\n2012  | 5,456.7  | 4,281.4  | 1,827.6  | 1,443.9  | 5.5%  | 10.0%  | 8.1%  | 68.0%\n2013  | 5,904.0  | 4,572.7  | 1,856.7  | 1,449.6  | 6.4%  | 9.4%  | 8.1%  | 67.7%\n2014  | 6,451.9  | 4,935.5  | 2,039.1  | 1,573.9  | 7.4%  | 5.8%  | 8%  | 67.1%\n2015  | 7,032.5  | 5,316.1  | 2,103.6  | 1,605.6  | 8.0%  | 4.9%  | 7.9%  | 69.0%\n2016  | 7,685.5  | 5,741.2  | 2,294.8  | 1,732.6  | 8.3%  | 4.5%  | 7.8%  | 68.9%\n2017  | 8,354.7  | 6,169.5  | 2,702.9  | 1,958.0  | 6.8%  | 3.6%  | 7.7%  | 69.7%\n2018  | 9,230.8  | 6,742.7  | 2,702.9  | 1,974.4  | 6.5%  | 3.4%  | 7.7%  | 70.4%\n2019  | 9,932.8  | 7,181.5  | 2,835.6  | 2,050.2  | 4.2%  | 4.8%  | 6.5%  | 75.0%\n2020  | 9,771.0  | 6,997,4  | 2,674.8  | 1,915.6  | -5.8%  | 6.1%  | 7.9%  | 88.5%\n2021  | 11,384.4  | 8,088.0  | 3,167.3  | 2,250.1  | 9.7%  | 5.5%  | 6.4%  | 83.7%\n2022  | 13,048.1  | 9,207.2  | 3,389.7  | 2,391.9  | 7.6%  | 6.7%  | 4.8%  | 81.0%\n2023  | 14,619.8  | 10,233.4  | 3,567.5  | 2,497.2  | 9.2%  | 5.5%  | 4.7%  | 81.9%\n2024  | 16,020.0  | 11,111.7  | 3,889.1  | 2,697.6  | 7.0%  | 4.6%  | n/a  | 83.0%\n2025  | 17,364.8  | 11,937.8  | 4,271.9  | 2,936.8  | 6.5%  | 4.1%  | n/a  | 82.6%\n2026  | 18,831.4  | 12,834.6  | 4,710.4  | 3,210.4  | 6.5%  | 4.1%  | n/a  | 81.8%\n2027  | 20,420.1  | 13,801.3  | 5,193.5  | 3,510.1  | 6.5%  | 4.0%  | n/a  | 80.7%\n2028  | 22,143.7  | 14,844.9  | 5,723.2  | 3,836.8  | 6.5%  | 4.0%  | n/a  | 80.0%\n2029  | 24,015.1  | 15,973.1  | 6,307.2  | 4,195.1  | 6.5%  | 4.0%  | n/a  | 78.4%",
    "openai_summarised_points": [
      "• The table presents key economic indicators of India from 1980 to 2024, with IMF staff estimates extending from 2025 to 2029.",
      "• Inflation rates below 5% are highlighted in green within the table.",
      "• The annual unemployment rate data is sourced from the World Bank; however, the IMF considers these figures unreliable.",
      "• In 1980, India's GDP was approximately 366.4 billion US dollars (PPP), with a per capita GDP of 526.9 US dollars (PPP).",
      "• Nominal GDP in 1980 was about 189.4 billion US dollars, with a per capita nominal GDP of 271.0 US dollars.",
      "• India's GDP growth rate in 1980 was 6.74%, with an unemployment rate of 11.3%.",
      "• Data for government debt as a percentage of GDP is not available for 1980–1984.",
      "• Over the years, India’s GDP (PPP) increased from 366.4 billion US dollars in 1980 to an estimated 24,015.1 billion US dollars in 2029.",
      "• The GDP per capita (PPP) rose from 526.9 US dollars in 1980 to an estimated 15,973.1 US dollars in 2029.",
      "• Nominal GDP grew from 189.4 billion US dollars in 1980 to approximately 6,307.2 billion US dollars in 2029.",
      "• Nominal GDP per capita increased from 271.0 US dollars in 1980 to an estimated 4,195.1 US dollars in 2029.",
      "• India’s real GDP growth fluctuated over the decades, with notable peaks such as 10.3% in 2007 and a significant contraction of -5.8% in 2020.",
      "• Inflation rates varied, with a high of 13.1% in 1998 and a low of 3.4% in 2018; inflation below 5% is marked in green.",
      "• The unemployment rate has generally ranged between approximately 3.4% (2018) and 13.5% (1991), with some years showing rates above 10%.",
      "• Government debt as a percentage of GDP was 75.3% in 1991, peaking at 84.4% in 2003, and decreasing to around 78.4% in 2029.",
      "• From 2001 onwards, India experienced consistent GDP growth, with annual increases often exceeding 6%, reaching 9.7% in 2021.",
      "• The period from 2010 to 2024 shows a steady upward trend in GDP (PPP), from 4,729.2 billion US dollars in 2010 to an estimated 16,020.0 billion US dollars in 2024.",
      "• The same period indicates growth in GDP per capita (PPP) from 3,812.0 US dollars in 2010 to approximately 11,111.7 US dollars in 2024.",
      "• Nominal GDP during 2010–2024 increased from 1,708.5 billion US dollars to an estimated 3,889.1 billion US dollars in 2024.",
      "• Nominal GDP per capita rose from 1,384.2 US dollars in 2010 to approximately 2,697.6 US dollars in 2024.",
      "• The projected GDP growth rate for 2025–2029 remains stable at around 6.5%, with inflation rates decreasing from 4.6% in 2024 to 4.1% in 2026.",
      "• Government debt as a percentage of GDP is estimated to decline gradually from 83.0% in 2024 to 78.4% in 2029."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:40:14.746237",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4475,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "GDP (nominal) past and forecasts",
    "text": "The top 15 largest economies in the world (GDP nominal from 1990-2030 in billions USD)  Country  | 1990  | Country  | 2000  | Country  | 2010  | Country  | 2020  | Country  | 2030\n---|---|---|---|---|---|---|---|---|---\nUnited States | 5,963  |  United States | 10,250  |  United States | 15,048  |  United States | 21,354  |  United States | 37,153\nJapan | 3,185  |  Japan | 4,968  |  China | 6,138  |  China | 15,103  |  China | 25,827\nGermany | 1,604  |  Germany | 1,967  |  Japan | 5,759  |  Japan | 5,054  |  India | 6,769\nFrance | 1,260  |  United Kingdom | 1,668  |  Germany | 3,470  |  Germany | 3,936  |  Germany | 5,575\nUnited Kingdom | 1,197  |  France | 1,361  |  France | 2,648  |  United Kingdom | 2,698  |  Japan | 4,994\nItaly | 1,164  |  China | 1,220  |  United Kingdom | 2,487  |  India | 2,674  |  United Kingdom | 4,955\nCanada | 596  |  Italy | 1,150  |  Brazil | 2,208  |  France | 2,645  |  France | 3,754\nIran | 581  |  Canada | 744  |  Italy | 2,146  |  Italy | 1,905  |  Canada | 2,792\nSpain | 536  |  Mexico | 742  |  India | 1,675  |  South Korea | 1,744  |  Italy | 2,779\nBrazil | 455  |  Brazil | 655  |  South Africa | 1,633  |  Canada | 1,655  |  Brazil | 2,679\nChina | 397  |  Spain | 598  |  Canada | 1,617  |  South Africa | 1,488  |  South Africa | 2,384\nAustralia | 324  |  South Korea | 597  |  Spain | 1,429  |  Brazil | 1,476  |  Spain | 2,201\nNetherlands | 321  |  India | 468  |  Australia | 1,254  |  Australia | 1,362  |  Australia | 2,181\nIndia | 320  |  Netherlands | 417  |  South Korea | 1,192  |  Spain | 1,288  |  Mexico | 2,151\nMexico | 307  |  Australia | 400  |  Mexico | 1,105  |  Mexico | 1,121  |  South Korea | 2,149",
    "openai_summarised_points": [
      "• The provided data illustrates the top 15 largest economies in the world based on nominal Gross Domestic Product (GDP) from the years 1990, 2000, 2010, 2020, and projected for 2030, measured in billions of USD.",
      "• In 1990, the United States had the largest nominal GDP at $5,963 billion, followed by Japan at $3,185 billion, and Germany at $1,604 billion.",
      "• By 2000, the United States' GDP increased to $10,250 billion, maintaining its position as the world's largest economy, with Japan at $4,968 billion and Germany at $1,967 billion.",
      "• In 2010, the United States' GDP further grew to $15,048 billion, with China emerging as the third-largest economy at $6,138 billion, overtaking Japan, which was at $5,759 billion.",
      "• The 2020 data shows the United States' GDP reaching $21,354 billion, with China significantly expanding to $15,103 billion, becoming the second-largest economy, and Japan declining to $5,054 billion.",
      "• Projections for 2030 indicate the United States maintaining its leading position with an estimated GDP of $37,153 billion, while China is expected to grow to $25,827 billion, and India is forecasted to reach $6,769 billion, surpassing Germany, which is projected at $5,575 billion.",
      "• The 2010 ranking saw Japan as the third-largest economy, but by 2020, it had fallen to the fifth position, with a GDP of $4,994 billion, while India rose to the third position with $2,674 billion.",
      "• Germany's GDP increased from $1,604 billion in 1990 to an estimated $5,575 billion in 2030, maintaining its position among the top economies.",
      "• The data reveals significant growth in China's economy from $397 billion in 1990 to a projected $25,827 billion in 2030, marking a substantial rise in global economic rankings.",
      "• Other notable changes include the United Kingdom's GDP rising from $1,197 billion in 1990 to an estimated $4,955 billion in 2030, and France's from $1,260 billion to $3,754 billion over the same period.",
      "• The economic landscape shows emerging economies like India and China gaining prominence, with India moving from 15th place in 1990 to the 3rd in 2030, reflecting rapid growth and development.",
      "• The data underscores the shifting dynamics of global economic power, with the United States maintaining dominance but China and India experiencing substantial growth, reshaping the hierarchy of the world's largest economies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:40:19.459020",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1672,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Regional economies",
    "text": "India's regional economies vary significantly in terms of output, industrial\ncomposition, and development levels. Maharashtra has the largest state\neconomy, contributing over 13% to the national GDP, followed by Tamil Nadu,\nKarnataka, Gujarat, and Uttar Pradesh. These five states collectively account\nfor nearly half of India's economic output. Southern states such as Tamil\nNadu, Karnataka, and Telangana are known for strong performance in services\nand manufacturing, while western states like Gujarat and Maharashtra are\nindustrial powerhouses. In contrast, eastern and central states such as Bihar,\nJharkhand, and Chhattisgarh exhibit lower GDPs, reflecting ongoing challenges\nin industrialisation and infrastructure. Union Territories like Delhi and\nChandigarh, though smaller in size, have high per capita incomes due to urban-\ncentric service-driven economies. This economic landscape highlights both\ngrowth opportunities and regional disparities, underscoring the need for\ntailored economic strategies across states.\n\nGross State Domestic Product (GSDP) of Indian States and UTs for 2024–25 (Nominal)  S.No | State/UT | GSDP\n(₹ Lakh Crore) | GSDP\n(Billion USD) | Share % | Equivalent Country\n(Nominal GDP)\n---|---|---|---|---|---\n1 | Maharashtra | 42.67 | 497.86 | 13.17% |  Austria\n2 | Tamil Nadu | 30.97 | 361.45 | 9.56% |  Denmark\n3 | Karnataka | 28.13 | 328.17 | 8.68% |  Malaysia\n4 | Gujarat | 27.99 | 326.54 | 8.64% |  Singapore\n5 | Uttar Pradesh | 26.63 | 310.88 | 8.22% |  Philippines\n6 | West Bengal | 18.76 | 219.01 | 5.79% |  New Zealand\n7 | Rajasthan | 17.13 | 199.79 | 5.29% |  Hungary\n8 | Andhra Pradesh | 15.81 | 184.53 | 4.88% |  Romania\n9 | Telangana | 15.26 | 178.00 | 4.71% |  Ukraine\n10 | Madhya Pradesh | 15.12 | 176.37 | 4.67% |  Ukraine\n11 | Kerala | 12.31 | 143.64 | 3.80% |  Slovakia\n12 | Haryana | 12.19 | 142.24 | 3.76% |  Ecuador\n13 | Delhi | 11.33 | 132.23 | 3.50% |  Kenya\n14 | Bihar | 9.76 | 113.96 | 3.01% |  Sri Lanka\n15 | Odisha | 9.42 | 109.94 | 2.91% |  Croatia\n16 | Punjab | 8.91 | 104.00 | 2.75% |  Luxembourg\n17 | Assam | 6.46 | 75.39 | 2.00% |  Bulgaria\n18 | Chhattisgarh | 5.80 | 67.68 | 1.59% |  Serbia\n19 | Jharkhand | 4.82 | 56.25 | 1.32% |  Ethiopia\n20 | Uttarakhand | 3.80 | 44.34 | 1.05% |  Latvia\n21 | Jammu & Kashmir | 2.63 | 30.69 | 0.70% |  Nepal\n22 | Himachal Pradesh | 2.45 | 28.59 | 0.65% |  Georgia\n23 | Goa | 1.14 | 13.30 | 0.35% |  Mali\n24 | Andaman & Nicobar Islands | 1.02 | 11.90 | 0.31% |  Malawi\n25 | Chandigarh | 0.56 | 6.54 | 0.17% |  Fiji\n26 | Sikkim | 0.54 | 6.30 | 0.17% |  Montenegro\n27 | Meghalaya | 0.54 | 6.30 | 0.17% |  Montenegro\n28 | Manipur | 0.52 | 6.07 | 0.16% |  Liberia\n29 | Puducherry | 0.45 | 5.25 | 0.14% |  Lesotho\n30 | Arunachal Pradesh | 0.44 | 5.13 | 0.14% |  Lesotho\n31 | Nagaland | 0.43 | 5.02 | 0.13% |  Belize\n32 | Mizoram | 0.42 | 4.90 | 0.13% |  Belize\n33 | Tripura | 0.31 | 3.62 | 0.10% |  Bhutan\n**Total India (2024–25)** | **324.11** | **3780.00** | **100%** | **India**",
    "openai_summarised_points": [
      "• India's regional economies display significant variation in terms of economic output, industrial composition, and development levels, reflecting diverse regional characteristics.",
      "• Maharashtra holds the position of the largest state economy in India, contributing over 13% to the national GDP, making it a major economic hub.",
      "• The second-largest economy is Tamil Nadu, followed by Karnataka, Gujarat, and Uttar Pradesh, with these five states collectively accounting for nearly 50% of India's total economic output.",
      "• Southern states such as Tamil Nadu, Karnataka, and Telangana are recognized for their strong performance in the services and manufacturing sectors, indicating a focus on industrial and service-driven growth.",
      "• Western states like Gujarat and Maharashtra are considered industrial powerhouses, contributing significantly to India's manufacturing and industrial output.",
      "• Eastern and central states, including Bihar, Jharkhand, and Chhattisgarh, exhibit comparatively lower GDP figures, reflecting ongoing challenges related to industrialization and infrastructure development.",
      "• Union Territories such as Delhi and Chandigarh, despite their smaller geographical size, have high per capita incomes due to their urban-centric, service-driven economies.",
      "• The economic landscape underscores regional disparities, highlighting both growth opportunities and areas requiring targeted development strategies.",
      "• The Gross State Domestic Product (GSDP) for 2024–25 (nominal) is detailed for Indian states and Union Territories, with Maharashtra leading at ₹42.67 lakh crore (approximately 497.86 billion USD), representing 13.17% of the total GSDP.",
      "• Tamil Nadu's GSDP is ₹30.97 lakh crore (361.45 billion USD), accounting for 9.56% of the national total, followed by Karnataka at ₹28.13 lakh crore (328.17 billion USD) with an 8.68% share.",
      "• Gujarat's GSDP is ₹27.99 lakh crore (326.54 billion USD), representing 8.64% of India's GDP, and Uttar Pradesh's GSDP is ₹26.63 lakh crore (310.88 billion USD), with an 8.22% share.",
      "• West Bengal's GSDP stands at ₹18.76 lakh crore (219.01 billion USD), comprising 5.79% of the total, while Rajasthan's is ₹17.13 lakh crore (199.79 billion USD), with a 5.29% share.",
      "• Other notable states include Andhra Pradesh (₹15.81 lakh crore, 4.88%), Telangana (₹15.26 lakh crore, 4.71%), and Madhya Pradesh (₹15.12 lakh crore, 4.67%).",
      "• States with lower GSDPs include Kerala (₹12.31 lakh crore, 3.80%), Haryana (₹12.19 lakh crore, 3.76%), and Delhi (₹11.33 lakh crore, 3.50%).",
      "• The list also includes Bihar (₹9.76 lakh crore, 3.01%), Odisha (₹9.42 lakh crore, 2.91%), Punjab (₹8.91 lakh crore, 2.75%), and other smaller states and Union Territories.",
      "• Union Territories such as Delhi and Chandigarh, despite their small size, have high per capita incomes driven by urban service economies.",
      "• The total GSDP of India for 2024–25 is ₹324.11 lakh crore (approximately 3,780 billion USD), constituting 100% of the national economy.",
      "• The data illustrates the economic contribution of each state and Union Territory relative to the entire country, emphasizing regional disparities and growth patterns."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:40:43.317427",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2974,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Sectors",
    "text": "Sectoral shares % in GDP (at constant basic prices)  Sectors  | FY 2011-12  | FY 2012-13  | FY 2013-14  | FY 2014-15  | FY 2015-16  | FY 2016-17  | FY 2017-18  | FY 2018-19  | FY 2019-20  | FY 2020-21  | FY 2021-22  | FY 2022-23  | FY 2023-24\n---|---|---|---|---|---|---|---|---|---|---|---|---|---\nPrimary |  21.7  |  21.3  |  21.4  |  20.9  |  20.1  |  20.4  |  20.4  |  19.8  |  20.3  |  22.1  |  21.0  |  20.1  |  19.7\nSecondary |  29.3  |  28.7  |  27.9  |  27.3  |  27.6  |  27.0  |  27.0  |  26.9  |  25.0  |  25.6  |  26.8  |  25.6  |  25.9\nTertiary |  49.0  |  50.0  |  50.6  |  51.8  |  52.3  |  52.6  |  52.5  |  53.3  |  54.8  |  52.3  |  52.2  |  54.3  |  54.4",
    "openai_summarised_points": [
      "• The sectoral shares of GDP at constant basic prices in India are categorized into primary, secondary, and tertiary sectors, with data spanning from FY 2011-12 to FY 2023-24.",
      "• In FY 2011-12, the primary sector contributed 21.7% to GDP, which slightly decreased to 19.7% by FY 2023-24, indicating a gradual decline in its relative share over the period.",
      "• The secondary sector accounted for 29.3% of GDP in FY 2011-12, decreasing to 25.9% by FY 2023-24, reflecting a declining trend in its contribution to the overall economy.",
      "• The tertiary sector showed the most significant increase, comprising 49.0% of GDP in FY 2011-12 and rising to 54.4% in FY 2023-24, highlighting the growing importance of services in India's economy.",
      "• Between FY 2011-12 and FY 2014-15, the primary sector's share fluctuated around 21%, peaking at 22.1% in FY 2020-21, then declining again to 19.7% by FY 2023-24.",
      "• The secondary sector experienced a steady decline from 29.3% in FY 2011-12 to approximately 25.9% in FY 2023-24, with minor fluctuations, indicating a gradual shift away from manufacturing and industry.",
      "• The tertiary sector's share increased consistently from 49.0% in FY 2011-12 to over 54% in FY 2013-14 and remained above 52% in subsequent years, reaching 54.4% in FY 2023-24.",
      "• The data reflects structural transformation in the Indian economy, with a decreasing reliance on primary and secondary sectors and an expanding tertiary sector, especially in services.",
      "• The fluctuations in sectoral shares over the years demonstrate economic adjustments and shifts in growth patterns, with the tertiary sector becoming the dominant contributor to GDP.",
      "• The primary sector's contribution peaked at 22.1% in FY 2020-21, likely influenced by specific economic factors during that period, before declining again.",
      "• The secondary sector's lowest recorded share was 25.0% in FY 2019-20, with slight increases thereafter, maintaining its position as the second-largest sector.",
      "• The tertiary sector consistently maintained the highest share among the three sectors throughout the period, emphasizing the importance of services such as information technology, finance, and communication in India's economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:40:57.651856",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 673,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Agriculture, forest, and fishing",
    "text": "Agriculture and allied sectors like forestry, logging and fishing accounted\nfor 18.4% of the GDP, the sector employed 51.2 crore persons or 45.5% of the\nworkforce in India are employed in agriculture. India is major agriculture\nproducing country and has the most arable land in the world followed by the\nUnited States. However, agricultural output lags far behind its potential.\nAgriculture's contribution to GDP has steadily declined from 1951 to 2023,\nshifting from 52% to 15% of India's GDP yet it is still the country's largest\nemployment provider sector . Crop-yield-per-unit-area of all crops has grown\nsince 1950, due to the special emphasis placed on agriculture in the five-year\nplans and steady improvements in irrigation, technology, application of modern\nagricultural practices and provision of agricultural credit and subsidies\nsince the Green Revolution in India. However, international comparisons reveal\nthe average yield in India is generally 30% to 50% of the highest average\nyield in the world. The states of Uttar Pradesh, Punjab, Haryana, Madhya\nPradesh, Andhra Pradesh, Telangana, Bihar, West Bengal, Gujarat and\nMaharashtra are key contributors to Indian agriculture.\n\nIndia receives an average annual rainfall of 1,208 millimetres (47.6 in) and a\ntotal annual precipitation of 4,000 billion cubic metres, with the total\nutilisable water resources, including surface and groundwater, amounting to\n1,123 billion cubic metres. 546,820 square kilometres (211,130 sq mi) of the\nland area, or about 39% of the total cultivated area, is irrigated. India's\ninland water resources and marine resources provide employment to nearly 6\nmillion people in the fisheries sector. In 2023, according to the Ministry of\nFisheries, India is the 3rd largest fish producing and 2nd largest aquaculture\nproducing nation in the world.\n\nIndia exports more than 100,000 tonnes (98,000 long tons; 110,000 short tons)\nof processed cashew kernels every year. There are more than 600 cashew\nprocessing units in Kollam alone.\n\nIndia is the largest producer of milk, jute and pulses, and has the world's\nlargest cattle population with 303 million animals in 2023. It is the second-\nlargest producer of rice, wheat, sugarcane, cotton and groundnuts, as well as\nthe second-largest fruit and vegetable producer, accounting for 10.9% and 8.6%\nof the world fruit and vegetable production, respectively, but only for 1% of\nglobal fruits and vegetables trade. India is also the second-largest producer\nand the largest consumer of silk, producing 77,000 tonnes (76,000 long tons;\n85,000 short tons) in 2005. India is the second-largest exporter of cashew\nkernels and cashew nut shell liquid (CNSL). Foreign exchange earned by the\ncountry through the export of cashew kernels during FY 2023 reached 356M$.\n76,624 tonnes (75,414 long tons; 84,464 short tons) of kernels were exported\nduring 2023. There are about 600 cashew processing units in Kollam, Kerala.\n\nIndia's foodgrain production stagnant at approximately 316 megatonnes (311\nmillion long tons; 348 million short tons) during 2020–21. India exports\nseveral agriculture products, such as Basmati rice, wheat, cereals, spices,\nfresh fruits, dry fruits, cotton, tea, coffee, milk products and other cash\ncrops to the Asian, African and other countries.\n\nSugarcane weighing at a Pravara Sahakari Sakhar Karkhana Ltd in Maharashtra\n\nThe low productivity in India is a result of several factors.Over-regulation\nof agriculture has increased costs, price risks and uncertainty, and\ngovernmental intervention in labour, land, and credit are hurting the market.\nInfrastructure such as rural roads, electricity, ports, food storage, retail\nmarkets and services remain inadequate. The average size of land holdings is\nvery small, with 70% of holdings being less than one hectare (2.5 acres) in\nsize. Irrigation facilities are inadequate, as revealed by the fact that only\n46% of the total cultivable land was irrigated as of 2016,[update] resulting\nin farmers still being dependent on rainfall, specifically the monsoon season,\nwhich is often inconsistent and unevenly distributed across the country. In an\neffort to bring an additional 20,000,000 hectares (49,000,000 acres) of land\nunder irrigation, various schemes have been attempted, including the\nAccelerated Irrigation Benefit Programme (AIBP) which was provided ₹800\nbillion (equivalent to ₹1.2 trillion or US$14 billion in 2023) in the Union\nBudget. Farming incomes are also hampered by lack of food storage and\ndistribution infrastructure; a third of India's agricultural production is\nlost from spoilage.",
    "openai_summarised_points": [
      "• Agriculture and allied sectors such as forestry, logging, and fishing contributed 18.4% to India's GDP and employed 51.2 crore persons, accounting for 45.5% of the total workforce in India.",
      "• India is a major agricultural producing country with the largest arable land in the world, followed by the United States, although its agricultural output remains below its potential.",
      "• The contribution of agriculture to India's GDP has declined steadily from 52% in 1951 to 15% in 2023, yet it remains the largest employment sector in the country.",
      "• Since 1950, crop-yield-per-unit-area across all crops has increased due to emphasis in five-year plans, improvements in irrigation, technological advancements, modern agricultural practices, and the provision of agricultural credit and subsidies post-Green Revolution.",
      "• International comparisons show that India's average crop yield is generally 30% to 50% of the highest global yields.",
      "• Key states contributing significantly to Indian agriculture include Uttar Pradesh, Punjab, Haryana, Madhya Pradesh, Andhra Pradesh, Telangana, Bihar, West Bengal, Gujarat, and Maharashtra.",
      "• India receives an average annual rainfall of 1,208 millimetres (47.6 inches) and a total annual precipitation of approximately 4,000 billion cubic metres.",
      "• The total utilisable water resources, including surface and groundwater, amount to 1,123 billion cubic metres.",
      "• About 39% of India's total cultivated area, equating to 546,820 square kilometres (211,130 sq mi), is irrigated.",
      "• The fisheries sector employs nearly 6 million people, supported by inland water and marine resources.",
      "• In 2023, India ranked as the 3rd largest fish producer and 2nd largest aquaculture producer globally, according to the Ministry of Fisheries.",
      "• India exports over 100,000 tonnes (98,000 long tons; 110,000 short tons) of processed cashew kernels annually, with over 600 cashew processing units located in Kollam alone.",
      "• India is the largest producer of milk, jute, and pulses, and has the world's largest cattle population with 303 million animals as of 2023.",
      "• It is the second-largest producer of rice, wheat, sugarcane, cotton, and groundnuts, and the second-largest fruit and vegetable producer, contributing 10.9% and 8.6% respectively to global fruit and vegetable production, but accounts for only 1% of global fruit and vegetable trade.",
      "• India is the second-largest producer and the largest consumer of silk, producing 77,000 tonnes (76,000 long tons; 85,000 short tons) in 2005.",
      "• The country is the second-largest exporter of cashew kernels and cashew nut shell liquid (CNSL), with foreign exchange earnings from cashew kernel exports reaching $356 million in FY 2023.",
      "• During 2023, India exported 76,624 tonnes (75,414 long tons; 84,464 short tons) of cashew kernels.",
      "• India's foodgrain production was stagnant at approximately 316 megatonnes (311 million long tons; 348 million short tons) during 2020–21.",
      "• Major exports include Basmati rice, wheat, cereals, spices, fresh and dry fruits, cotton, tea, coffee, milk products, and other cash crops to Asian, African, and other countries.",
      "• Low productivity in Indian agriculture results from factors such as over-regulation, increased costs, price risks, and governmental intervention in labor, land, and credit markets.",
      "• Infrastructure deficits include inadequate rural roads, electricity, ports, food storage, retail markets, and services.",
      "• The average landholding size is very small, with 70% of holdings being less than one hectare (2.5 acres).",
      "• As of 2016, only 46% of cultivable land was irrigated, making farmers dependent on rainfall, especially the monsoon, which is often inconsistent and unevenly distributed.",
      "• Various schemes, including the Accelerated Irrigation Benefit Programme (AIBP), have aimed to irrigate an additional 20 million hectares (49 million acres), with ₹800 billion (approximately ₹1.2 trillion or US$14 billion in 2023) allocated in the Union Budget.",
      "• Food storage and distribution infrastructure deficiencies cause about one-third of India's agricultural produce to be lost due to spoilage."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:10.909222",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4596,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Automobile industry",
    "text": "The automotive industry in India is one of the largest and fastest-growing\nglobally, contributing significantly to the country’s economy, employment, and\nexport performance. As of 2023, India ranked as the fourth-largest automobile\nproducer in the world, following China, United States and Japan. The sector\naccounts for approximately 7.1% of India's GDP and employs over 37 million\npeople directly and indirectly. As of April 2022[update], India's auto\nindustry is worth more than US$100 billion and accounts for 8% of the\ncountry's total exports and 7.1% of India's GDP.\n\nIndia's automotive market comprises both domestic and international\nmanufacturers. Key passenger vehicle producers include Maruti Suzuki, Hyundai\nMotor India, Tata Motors, Mahindra & Mahindra, Kia India, and Toyota Kirloskar\nMotor. In the two-wheeler segment, leading companies are Hero MotoCorp, Honda\nMotorcycle and Scooter India, TVS Motor, and Bajaj Auto. The commercial\nvehicle space is dominated by Tata Motors, Ashok Leyland, and Mahindra &\nMahindra.\n\nProduction & sale of vehicles in India  Type  |  | 2019-20  | 2020-21  | 2021-22  | 2022-23  | 2023-24  | 2024-25\n---|---|---|---|---|---|---|---\nPassenger Vehicles  | Production  | 3,424,564  | 3,062,280  | 3,650,698  | 4,587,116  | 4,901,840  | 5,061,164\nDomestic Sales  | 2,773,519  | 2,711,457  | 3,069,523  | 3,890,114  | 4,218,750  | 4,301,848\nExport Sales  | 662,118  | 404,397  | 577,875  | 662,891  | 672,105  | 770,364\nCommercial Vehicles  | Production  | 756,725  | 624,939  | 805,527  | 1,035,626  | 1,067,504  | 1,032,645\nDomestic Sales  | 717,593  | 568,559  | 716,566  | 962,468  | 968,770  | 956,671\nExport Sales  | 60,379  | 50,334  | 92,297  | 78,645  | 65,818  | 80,986\nThree wheelers  | Production  | 1,132,982  | 614,613  | 758,669  | 855,696  | 996,159  | 1,050,020\nDomestic Sales  | 637,065  | 219,446  | 261,385  | 488,768  | 694,801  | 741,420\nExport Sales  | 501,651  | 393,001  | 499,730  | 365,549  | 299,977  | 306,914\nTwo wheelers  | Production  | 21,032,927  | 18,349,941  | 17,821,111  | 19,459,009  | 21,468,527  | 23,883,857\nDomestic Sales  | 17,416,432  | 15,120,783  | 13,570,008  | 15,862,771  | 17,974,365  | 19,607,332\nExport Sales  | 3,519,405  | 3,282,786  | 4,443,131  | 3,652,122  | 3,458,416  | 4,198,403",
    "openai_summarised_points": [
      "• The automotive industry in India is among the largest and fastest-growing globally, making significant contributions to the country's economy, employment, and export performance.",
      "• As of 2023, India ranked as the fourth-largest automobile producer in the world, following China, the United States, and Japan.",
      "• The sector accounts for approximately 7.1% of India's Gross Domestic Product (GDP).",
      "• The industry employs over 37 million people both directly and indirectly.",
      "• As of April 2022, India's auto industry was valued at more than US$100 billion.",
      "• The industry contributes to 8% of India's total exports and 7.1% of the country's GDP.",
      "• India's automotive market includes both domestic and international manufacturers.",
      "• Key passenger vehicle manufacturers in India are Maruti Suzuki, Hyundai Motor India, Tata Motors, Mahindra & Mahindra, Kia India, and Toyota Kirloskar Motor.",
      "• Leading companies in the two-wheeler segment include Hero MotoCorp, Honda Motorcycle and Scooter India, TVS Motor, and Bajaj Auto.",
      "• The commercial vehicle segment is dominated by Tata Motors, Ashok Leyland, and Mahindra & Mahindra.",
      "• Vehicle production and sales data from 2019-20 to 2024-25 show the following trends:",
      "• Passenger vehicle production increased from 3,424,564 units in 2019-20 to an estimated 5,061,164 units in 2024-25.",
      "• Domestic passenger vehicle sales grew from 2,773,519 units in 2019-20 to an estimated 4,301,848 units in 2024-25.",
      "• Passenger vehicle export sales rose from 662,118 units in 2019-20 to an estimated 770,364 units in 2024-25.",
      "• Commercial vehicle production increased from 756,725 units in 2019-20 to an estimated 1,032,645 units in 2024-25.",
      "• Domestic commercial vehicle sales grew from 717,593 units in 2019-20 to an estimated 956,671 units in 2024-25.",
      "• Commercial vehicle export sales varied, from 60,379 units in 2019-20 to an estimated 80,986 units in 2024-25.",
      "• Three-wheeler production rose from 1,132,982 units in 2019-20 to an estimated 1,050,020 units in 2024-25.",
      "• Domestic three-wheeler sales increased from 637,065 units in 2019-20 to an estimated 741,420 units in 2024-25.",
      "• Three-wheeler export sales declined from 501,651 units in 2019-20 to an estimated 306,914 units in 2024-25.",
      "• Two-wheeler production decreased from 21,032,927 units in 2019-20 to 17,821,111 units in 2021-22, then increased to an estimated 23,883,857 units in 2024-25.",
      "• Domestic two-wheeler sales fell from 17,416,432 units in 2019-20 to 13,570,008 units in 2021-22, then rose to an estimated 19,607,332 units in 2024-25.",
      "• Two-wheeler export sales were 3,519,405 units in 2019-20, dipped to 3,282,786 units in 2020-21, then increased to an estimated 4,198,403 units in 2024-25."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:23.047044",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2281,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Micro, Small, and Medium Enterprises (MSME)",
    "text": "India began its first few steps during the years 1978-80 when early conditions\nfor SMEs or entrepreneurship were hostile too. 63 million MSMEs in India which\ncontribute _35% to the country's GDP_ provides employment to 111.4 million\npersons and accounts for more than 40% of India's exports and are hailed as\nthe ‘growth engines’ of the economy.China has been creating 16,000-18,000 new\nenterprises per day for the last 5 years. When you compare that with India, it\nis about 1000-1100 per day.\n\nMicro and small enterprises have the potential to resolve India's unemployment\ncrisis provided the constraints impeding the growth of the sector are\nresolved.According to Annual MSME Report 2021-22, over 90 per cent of India's\n6.3 crore MSMEs are in the micro-segment. Within the micro sector, 62 per cent\nfirms are self-employments which no workers, another 32 per cent have two or\nthree workers and just 6-7 per cent have four workers or above (up to 19). In\n2023, SME IPOs set a record-breaking year with 179 listings.\n\nIn Budget 2023, The government has implemented a number of reforms aimed at\nboosting MSMEs' growth in India while also improving their international\ncompetitiveness.",
    "openai_summarised_points": [
      "• India’s initial efforts to develop Micro, Small, and Medium Enterprises (MSMEs) began between 1978 and 1980, during which the environment for SMEs and entrepreneurship was initially hostile.",
      "• As of the latest data, India has approximately 63 million MSMEs, which contribute about 35% to the country's Gross Domestic Product (GDP).",
      "• MSMEs in India provide employment to approximately 111.4 million persons, making them a significant source of livelihood.",
      "• These enterprises account for over 40% of India’s exports, highlighting their critical role in the national economy and being regarded as the ‘growth engines’ of India’s economic development.",
      "• In comparison, China has been creating between 16,000 and 18,000 new enterprises daily over the past five years, whereas India has been generating approximately 1,000 to 1,100 new enterprises per day.",
      "• Micro and small enterprises possess substantial potential to address India’s unemployment crisis, contingent upon resolving existing constraints that hinder sector growth.",
      "• According to the Annual MSME Report 2021-22, over 90% of India’s 6.3 crore (63 million) MSMEs are classified within the micro-segment.",
      "• Within the micro sector, 62% of firms are self-employed with no additional workers, 32% employ two or three workers, and only 6-7% have four or more workers, with some firms employing up to 19 workers.",
      "• The year 2023 marked a record-breaking year for SME Initial Public Offerings (IPOs), with a total of 179 listings.",
      "• The Indian government, in its Budget 2023, introduced several reforms aimed at fostering MSME growth and enhancing their international competitiveness."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:28.986735",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1183,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Machinery, Tools and equipment",
    "text": "Machinery and equipment market is expected to grow 8% from 2024 to 2029.\nIndia's Industrial Machinery Equipment and Tools market size is expected to be\n$210 billion in 2023.The rise in R&D and large number of startups has led to\nincrease in investment in tools, industrial equipment, robotics, industrial\nautomation, pharmaceutical machinery, mining & construction equipment.\n\nIndian Government has launched an initiative in promoting electrification of\nfossil-fuel based equipment hence reducing carbon footprint and leading to new\ninnovations.",
    "openai_summarised_points": [
      "• The machinery and equipment market in India is projected to grow at an annual rate of 8% from 2024 to 2029.",
      "• The size of India's Industrial Machinery, Equipment, and Tools market was estimated to be $210 billion in 2023.",
      "• The increase in research and development activities, along with a large number of startups, has contributed to heightened investment in various sectors including tools, industrial equipment, robotics, industrial automation, pharmaceutical machinery, and mining & construction equipment.",
      "• The Indian government has launched initiatives aimed at promoting the electrification of fossil-fuel-based equipment, with the goal of reducing the country's carbon footprint.",
      "• These government initiatives are also fostering new technological innovations within the machinery and equipment sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:31.239664",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 545,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.1",
    "section_name": "Mining",
    "text": "an NLC India mine\n\nIndia has, in 2022, a reported 1,319 mines of which reporting mines for\nmetallic minerals were estimated at 545 and non-metallic minerals at 775.\n\nMining contributed to 1.75% of GDP and employed directly or undirecly 11\nmillion people in 2021. India's mining industry was the fourth-largest\nproducer of minerals in the world by volume, and eighth-largest producer by\nvalue in 2009. In 2013, it mined and processed 89 minerals, of which four were\nfuel, three were atomic energy minerals, and 80 non-fuel. The public sector\naccounted for 68% of mineral production by volume in 2011–12. India has the\nworld's fourth-largest natural resources, with the mining sector contributing\n11% of the country's industrial GDP and 2.5% of total GDP.\n\nNearly 50% of India's mining industry, by output value, is concentrated in\neight states: Odisha, Rajasthan, Chhattisgarh, Andhra Pradesh, Telangana,\nJharkhand, Madhya Pradesh and Karnataka. Another 25% of the output by value\ncomes from offshore oil and gas resources. India operated about 3,000 mines in\n2010, half of which were coal, limestone and iron ore. On output-value basis,\nIndia was one of the five largest producers of mica, chromite, coal, lignite,\niron ore, bauxite, barite, zinc and manganese; while being one of the ten\nlargest global producers of many other minerals. India was the fourth-largest\nproducer of steel in 2013, and the seventh-largest producer of aluminium.\n\nIndia's mineral resources are vast. However, its mining industry has declined\n– contributing 2.3% of its GDP in 2010 compared to 3% in 2000, and employed\n2.9 million people – a decreasing percentage of its total labour. India is a\nnet importer of many minerals including coal. India's mining sector decline is\nbecause of complex permit, regulatory and administrative procedures,\ninadequate infrastructure, shortage of capital resources, and slow adoption of\nenvironmentally sustainable technologies.",
    "openai_summarised_points": [
      "• In 2022, India reported a total of 1,319 mines, with 545 mines designated for metallic minerals and 775 for non-metallic minerals.",
      "• The mining sector contributed approximately 1.75% to India's Gross Domestic Product (GDP) in 2021.",
      "• It employed directly or indirectly around 11 million people as of 2021.",
      "• India was the fourth-largest producer of minerals in the world by volume in 2009 and the eighth-largest by value in the same year.",
      "• In 2013, India mined and processed a total of 89 minerals, comprising four fuel minerals, three atomic energy minerals, and 80 non-fuel minerals.",
      "• The public sector accounted for 68% of mineral production by volume during the fiscal year 2011–12.",
      "• India possesses the world's fourth-largest natural resources reserve, with the mining sector contributing 11% to the country's industrial GDP and 2.5% to the total GDP.",
      "• Nearly 50% of India's mining output value is concentrated in eight states: Odisha, Rajasthan, Chhattisgarh, Andhra Pradesh, Telangana, Jharkhand, Madhya Pradesh, and Karnataka.",
      "• An additional 25% of mineral output value is derived from offshore oil and gas resources.",
      "• In 2010, India operated approximately 3,000 mines, with about half of these mines focused on coal, limestone, and iron ore extraction.",
      "• On the basis of output value, India was among the top five global producers of mica, chromite, coal, lignite, iron ore, bauxite, barite, zinc, and manganese.",
      "• India was also among the top ten largest producers worldwide for many other minerals.",
      "• In 2013, India ranked as the fourth-largest producer of steel and the seventh-largest producer of aluminium globally.",
      "• Despite its vast mineral resources, India’s mining industry has experienced decline, with its contribution to GDP decreasing from 3% in 2000 to 2.3% in 2010.",
      "• The sector employed approximately 2.9 million people, representing a decreasing share of the total Indian labor force.",
      "• India is a net importer of several minerals, including coal.",
      "• The decline of India's mining sector is attributed to complex permit, regulatory, and administrative procedures, inadequate infrastructure, shortage of capital resources, and slow adoption of environmentally sustainable technologies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:35.868065",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1941,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.2",
    "section_name": "Cement",
    "text": "Indian cement industry is the 2nd largest cement producing country in the\nworld, next only to China. At present, the Installed Capacity of Cement in\nIndia is 500 MTPA with production of 298 million tonnes per annum. Majority of\nthe cement plants installed capacity (about 35%) is located in the states of\nsouth India. In PAT scheme, Total Installed Capacity of Cement in India is 325\nMTPA which contributes to 65% coverage of total installed capacity in India.",
    "openai_summarised_points": [
      "• The Indian cement industry is the second-largest cement producer in the world, surpassed only by China.",
      "• The current installed capacity of cement in India is 500 million tonnes per annum (MTPA).",
      "• The actual cement production in India is approximately 298 million tonnes per annum.",
      "• About 35% of the total installed capacity is concentrated in the states of South India.",
      "• Under the PAT (Perform, Achieve, and Trade) scheme, the total installed capacity of cement in India is 325 MTPA.",
      "• The capacity covered by the PAT scheme accounts for approximately 65% of the total installed capacity in India."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:37.981349",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 460,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.3",
    "section_name": "Iron and steel",
    "text": "Bokaro Steel Plant (BSL) alone contributes 45% of SAIL's profit and it\nproduces highly diversified steel portfolio\n\nIndia surpassed Japan as the second largest steel producer in January 2019. As\nper worldsteel, India's crude steel production in 2018 was at 106.5 tonnes\n(104.8 long tons; 117.4 short tons), 4.9% increase from 101.5 tonnes (99.9\nlong tons; 111.9 short tons) in 2017, which means that India overtook Japan as\nthe world's second largest steel production country.\n\nAccording to data presented by PIB(FY2021-22), there are more than 900 steel\nplants in India that produce crude steel. These are owned by PSUs, large-scale\ncompanies as well as small and medium enterprises (SMEs). In the year 2021–22,\nthe total capacity of these plants stood at 154.06 million tonnes.\n\nThe total market value of the Indian steel sector stood at US$57.8 billion in\n2011 and is predicted to touch US$95.3 billion by 2016.Growth of crude steel\nproduction in India has not kept pace with the growth in capacity of\nproduction, according to the report. As per this report, steel sector\ncontributes 2 per cent to India's GDP and employs half a million people\ndirectly and 2 million people indirectly. The Indian steel sector has been\nvibrant, growing at a compounded rate of 6% year-on-year.",
    "openai_summarised_points": [
      "• The Bokaro Steel Plant (BSL) alone contributes approximately 45% of Steel Authority of India Limited's (SAIL) profit and produces a highly diversified steel portfolio.",
      "• India surpassed Japan to become the world's second-largest steel producer in January 2019.",
      "• According to worldsteel data, India's crude steel production in 2018 was 106.5 million tonnes (104.8 long tons; 117.4 short tons), representing a 4.9% increase from 101.5 million tonnes (99.9 long tons; 111.9 short tons) in 2017.",
      "• This increase in production in 2018 led India to overtake Japan as the second-largest steel-producing country globally.",
      "• As per data presented by the Press Information Bureau (PIB) for the fiscal year 2021–22, India has more than 900 steel plants producing crude steel.",
      "• These steel plants are owned by Public Sector Undertakings (PSUs), large-scale companies, as well as small and medium enterprises (SMEs).",
      "• The total installed capacity of these steel plants in 2021–22 was approximately 154.06 million tonnes.",
      "• The total market value of the Indian steel sector was valued at US$57.8 billion in 2011 and was projected to reach US$95.3 billion by 2016.",
      "• Despite growth in capacity, the growth of crude steel production in India has not kept pace with capacity expansion, according to industry reports.",
      "• The steel sector contributes about 2% to India’s Gross Domestic Product (GDP).",
      "• The sector employs approximately 500,000 people directly and around 2 million people indirectly.",
      "• The Indian steel industry has been vibrant, growing at a compounded annual rate of 6% year-on-year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:42.402361",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1279,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.4",
    "section_name": "Petroleum",
    "text": "MRPL Refinery in Mangalore\n\nPetroleum products and chemicals are a major contributor to India's industrial\nGDP, and together they contribute over 34% of its export earnings. India hosts\nmany oil refinery and petrochemical operations developed with help of Soviet\ntechnology such as Barauni Refinery and Gujarat Refinery, it also includes the\nworld's largest refinery complex in Jamnagar that processes 1.24 million\nbarrels of crude per day. By volume, the Indian chemical industry was the\nthird-largest producer in Asia, and contributed 5% of the country's GDP. India\nis one of the five-largest producers of agrochemicals, polymers and plastics,\ndyes and various organic and inorganic chemicals. Despite being a large\nproducer and exporter, India is a net importer of chemicals due to domestic\ndemands. India's chemical industry is extremely diversified and estimated at\n$178 billion.",
    "openai_summarised_points": [
      "• Petroleum products and chemicals are a significant component of India's industrial GDP, contributing over 34% of the country's export earnings.",
      "• India hosts numerous oil refinery and petrochemical operations, many developed with Soviet technology, including the Barauni Refinery and Gujarat Refinery.",
      "• The Jamnagar refinery complex is the world's largest refinery, processing 1.24 million barrels of crude oil per day.",
      "• The Indian chemical industry is the third-largest producer in Asia by volume and contributes approximately 5% to India's GDP.",
      "• India ranks among the five largest producers globally of agrochemicals, polymers and plastics, dyes, and various organic and inorganic chemicals.",
      "• Despite being a major producer and exporter, India is a net importer of chemicals due to high domestic demand.",
      "• The chemical industry in India is highly diversified and has an estimated total value of $178 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:44.755105",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 884,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.5",
    "section_name": "Chemicals and fertilizer",
    "text": "The chemical industry contributed $163 billion to the economy in FY18 and is\nexpected to reach $300–400 billion by 2025. The industry employed 17.33\nmillion people (4% of the workforce) in 2016.\n\nAt present, 57 large fertilizer units are manufacturing a wide number of\nnitrogen fertilizers. These include 29 urea-producing units and 9 ammonia\nsulfate-producing units as a by-product. Besides, there are 64 small-scale\nproducing units of single super phosphate.\n\nAccording to the latest data released by the WTO, India has emerged as the\nsecond largest exporter of agrochemicals in the world. The rank was sixth, 10\nyears ago.The Indian agrochemical industry fetches valuable trade surplus\nevery year. The trade surplus sharply increased from Rs. 8,030 crores in\n2017–18 to Rs. 28,908 crores in the last fiscal. India's agrochemicals export\nhas doubled in the last 6 years from $2.6 bn in 2017–18 to $5.4 bn in the last\nfinancial year according to the data recently released by Ministry of\nCommerce. It has grown at an impressive CAGR of 13% which is among the highest\nin the manufacturing sector.\n\nMillions of farmers in over 130 countries trust Indian agrochemicals for their\nhigh quality and affordable prices, said an industry observer. With the global\nagrochemicals market estimated at $78 billion, predominantly comprising post-\npatent products, India is rapidly becoming a preferred global hub for sourcing\nsuch agrochemicals. To bolster domestic production and reduce imports, the\nCrop Care Federation of India (CCFI) has recommended specific measures to the\nGovernment of India.",
    "openai_summarised_points": [
      "• The chemical industry in India contributed $163 billion to the economy in FY18 and is projected to reach between $300 billion and $400 billion by 2025.",
      "• In 2016, the industry employed approximately 17.33 million people, accounting for 4% of the total workforce.",
      "• Currently, India has 57 large fertilizer units manufacturing a wide range of nitrogen fertilizers, including 29 units producing urea and 9 units producing ammonia sulfate as a by-product.",
      "• Additionally, there are 64 small-scale units producing single super phosphate fertilizer.",
      "• According to the latest data from the World Trade Organization (WTO), India has become the second-largest exporter of agrochemicals globally, a significant rise from the sixth position held ten years prior.",
      "• The Indian agrochemical industry generates a substantial trade surplus annually, which increased sharply from Rs. 8,030 crores in 2017–18 to Rs. 28,908 crores in the most recent fiscal year.",
      "• India's agrochemical exports doubled over the past six years, rising from $2.6 billion in 2017–18 to $5.4 billion in the last financial year, as per data from the Ministry of Commerce.",
      "• The industry has achieved an impressive compound annual growth rate (CAGR) of 13%, making it one of the fastest-growing sectors within Indian manufacturing.",
      "• Millions of farmers across over 130 countries rely on Indian agrochemicals for their high quality and affordability, according to industry observers.",
      "• The global agrochemicals market is estimated at $78 billion, predominantly consisting of post-patent products, with India rapidly emerging as a preferred global sourcing hub for such agrochemicals.",
      "• To promote domestic production and reduce reliance on imports, the Crop Care Federation of India (CCFI) has recommended specific measures to the Government of India."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:41:48.237404",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1586,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.6",
    "section_name": "Railways and Logistics",
    "text": "Vande Bharat train\n\nThe Indian Railways contributes to ~3% of the country's gross domestic product\n(GDP) and has social obligations pegged at $5.3 billion annually. Indian\nRailways revenue has grown at 5% CAGR in the past 5 years but profitability\nhas reduced drastically in the past 4 years, due to growing infrastructure and\nmodernization expenses. With a workforce of 1.31 million people, the IR is\nalso one of the country's largest employers. The railways is a major\ncontributor to jobs, GDP, and mobility.\n\nIndian Railways has decided to revise its 2022–23 rolling stock production\nplan upwards. The Ministry's new plan targets the production of 8,429 units\nfor the coming financial year. Production for 2022–23 has been raised by 878\nunits from the earlier planned 7,551, according to the revised targets. Indian\nRailways has targeted to manufacture 475 new Vande Bharat trainsets for the\nnext four years as a part of its modernization plan. It is about Rs 40,000\ncrore($5 billion) business opportunity that would also create 15,000 jobs and\nseveral spin-off benefits. Indian Railway's CORE aims to electrify all of its\nbroad gauge network by 31 March 2024. The entire electrified mainline rail\nnetwork in India uses 25 kV AC; DC is used only for metros.As of July 2023,\nIndia currently has 90% of total train tracks fully electrified.\n\nUnder the eleventh Five Year Plan of India (2007–12), the Ministry of Railways\nstarted constructing a new Dedicated Freight Corridor (DFC) in two long\nroutes, namely the Eastern and Western freight corridors. The two routes cover\na total length of 3,260 kilometres (2,030 mi), with the _Eastern Dedicated\nFreight Corridor_ stretching from Ludhiana in Punjab to Dankuni in West Bengal\nand the _Western Dedicated Freight Corridor_ from Jawaharlal Nehru Port in\nMumbai (Maharashtra) to Dadri in Uttar Pradesh. The DFC will generate around\n42,000 jobs and provide long term employment to many people in public sector\nand private sector.[_citation needed_]",
    "openai_summarised_points": [
      "• The Indian Railways contributes approximately 3% to India's gross domestic product (GDP).",
      "• It has social obligations valued at $5.3 billion annually.",
      "• Over the past five years, Indian Railways' revenue has grown at a compound annual growth rate (CAGR) of 5%.",
      "• Despite revenue growth, profitability has significantly declined over the last four years due to increasing infrastructure and modernization expenses.",
      "• Indian Railways employs about 1.31 million people, making it one of the largest employers in India.",
      "• The railway sector is a major contributor to employment, GDP, and mobility within the country.",
      "• Indian Railways has revised its 2022–23 rolling stock production plan upward, setting a new target of 8,429 units for the financial year.",
      "• The production target for 2022–23 has been increased by 878 units from the previous plan of 7,551 units.",
      "• As part of its modernization efforts, Indian Railways aims to manufacture 475 new Vande Bharat trainsets over the next four years.",
      "• The Vande Bharat trainset project represents a business opportunity valued at approximately Rs 40,000 crore ($5 billion), expected to generate around 15,000 jobs and various spin-off benefits.",
      "• Indian Railways' CORE (Central Organisation for Railway Electrification) plans to electrify the entire broad gauge network by 31 March 2024.",
      "• Currently, 90% of India's total train tracks are fully electrified as of July 2023.",
      "• The entire electrified mainline network in India uses 25 kV AC; DC electrification is limited to metro systems.",
      "• During the eleventh Five Year Plan (2007–2012), the Ministry of Railways initiated the construction of the Dedicated Freight Corridor (DFC) across two major routes: the Eastern and Western freight corridors.",
      "• The combined length of these corridors is 3,260 kilometers (2,030 miles).",
      "• The Eastern Dedicated Freight Corridor runs from Ludhiana in Punjab to Dankuni in West Bengal.",
      "• The Western Dedicated Freight Corridor extends from Jawaharlal Nehru Port in Mumbai, Maharashtra, to Dadri in Uttar Pradesh.",
      "• The DFC is projected to generate around 42,000 jobs and provide long-term employment opportunities in both the public and private sectors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:00.937355",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1994,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.7",
    "section_name": "Rapid Transit",
    "text": "As of 2024, India is having third largest metro system in the world\n\nIndia is developing modern mass rapid transit systems to meet present and\nfuture urban requirements. A modern metro rail system is already in place in\nthe cities of Navi Mumbai, Delhi, Mumbai, Bangalore, Kolkata, Hyderabad,\nKochi, Gurgaon, Jaipur, Noida, Pune, Nagpur, Kanpur, Ahmedabad and Lucknow.\nSimilar mass transit systems are intended for Agra, Bhopal, Indore, Surat,\nPatna, Bhubaneswar Tri-city, Chandigarh Tri-city, Gwalior, Mysore, Nashik,\nPrayagraj, Varanasi, Ranchi, Thane and Trivandrum. Former Prime Minister Atal\nBihari Vajpayee has been credited with success of the metro systems in India\nand every metro has followed Delhi Metro model generating lot of real estate\nwealth in India specially in smaller cities like Gurgaon and Noida. For\nElevated corridor, there is no need for land acquisition as pillars are built\nabove Median strip of a road.[_citation needed_] Land prices in tier-II cities\nsuch as Lucknow, Patna, Jaipur, Ahmedabad, Pune, Kochi, and Coimbatore have\ngone up by almost 8-10 percent following the introduction of a metro corridor\nin these cities, an assessment by JLL has said.\n\nIndia is also developing modern RRTS system to replace the old MRTS system\nwhich will provide connectivity in Delhi Metropolitan Area and Mumbai\nMetropolitan Region which will serve the suburbs of these big cities at 80–100\nkm of distance from city centre.[_citation needed_]",
    "openai_summarised_points": [
      "• As of 2024, India possesses the third largest metro system in the world, reflecting significant urban transit development.",
      "• The country is actively developing modern mass rapid transit systems to address current and future urban transportation needs.",
      "• Existing modern metro rail systems are operational in the cities of Navi Mumbai, Delhi, Mumbai, Bangalore, Kolkata, Hyderabad, Kochi, Gurgaon, Jaipur, Noida, Pune, Nagpur, Kanpur, Ahmedabad, and Lucknow.",
      "• Plans are underway to establish similar mass transit systems in additional cities including Agra, Bhopal, Indore, Surat, Patna, Bhubaneswar, Tri-city areas (Gwalior, Mysore, Nashik), Prayagraj, Varanasi, Ranchi, Thane, and Trivandrum.",
      "• Former Prime Minister Atal Bihari Vajpayee is credited with the success of India’s metro systems, which have largely followed the Delhi Metro model.",
      "• The Delhi Metro model has generated substantial real estate wealth, especially in smaller cities such as Gurgaon and Noida.",
      "• Elevated metro corridors do not require land acquisition because their pillars are constructed above the median strip of roads.",
      "• Land prices in tier-II cities like Lucknow, Patna, Jaipur, Ahmedabad, Pune, Kochi, and Coimbatore have increased by approximately 8-10 percent following the introduction of metro corridors, according to an assessment by JLL.",
      "• India is also developing modern Regional Rapid Transit Systems (RRTS) to replace older MRTS systems, aimed at improving connectivity in the Delhi Metropolitan Area and Mumbai Metropolitan Region.",
      "• The RRTS will serve suburban areas located 80–100 km from the city centers of Delhi and Mumbai, enhancing regional connectivity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:11.481270",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1458,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.8",
    "section_name": "Aviation",
    "text": "India is the fourth-largest civil aviation market in the world recording an\nair traffic of 158 million passengers in 2017. The market is estimated to have\n800 aircraft by 2020, which would account for 4.3% of global volumes, and is\nexpected to record annual passenger traffic of 520 million by 2037. IATA\nestimated that aviation contributed $30 billion to India's GDP in 2017, and\nsupported 7.5 million jobs – 390,000 directly, 570,000 in the value chain, and\n6.2 million through tourism.\n\nAs of 2024, There are 75 new airports have been built in the last ten years,\ntaking the total count to 149 airports (include helipads and aerodromes).\nGovernment vision is to take this milestone 149 to 220 airports in the next 5\nto 7 years and Government of India has a Rs 1 lakh crore capex plan to spend\non Airport infrastructure.",
    "openai_summarised_points": [
      "• India is the fourth-largest civil aviation market globally, with an air traffic volume of 158 million passengers recorded in 2017.",
      "• The Indian civil aviation market is projected to have approximately 800 aircraft by the year 2020, which would constitute about 4.3% of the global aircraft fleet.",
      "• By 2037, India is expected to record an annual passenger traffic of around 520 million passengers.",
      "• The International Air Transport Association (IATA) estimated that in 2017, aviation contributed approximately $30 billion to India's Gross Domestic Product (GDP).",
      "• In 2017, the aviation sector supported around 7.5 million jobs in India, including 390,000 direct jobs, 570,000 jobs within the value chain, and 6.2 million jobs generated through tourism.",
      "• As of 2024, India has constructed 75 new airports over the past ten years, bringing the total number of airports—including helipads and aerodromes—to 149.",
      "• The Government of India aims to increase the total number of airports from 149 to 220 within the next 5 to 7 years.",
      "• The Indian government has allocated a capital expenditure (capex) plan of Rs 1 lakh crore specifically for airport infrastructure development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:18.528663",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 822,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.9",
    "section_name": "Shipbuilding",
    "text": "INS Vikrant under construction at Cochin Shipyard\n\nThe Shipbuilding Financial Assistance Policy (SBFAP) was introduced in 2016,\nprovides financial assistance to Indian shipyards for shipbuilding contracts.\nAccording to the ministry of ports, shipping and waterways, under SBFAP, a\ntotal of 313 domestic and export vessel orders were procured by 39 shipyards\nsince the inception of the scheme, with the total value standing at about\n₹10,500 crore($1.26 billion).\n\nIndia has multiple ship building companies such as Cochin Shipyard, Hindustan\nShipyard and Swan Defence and Heavy Industries, mainly produces ships for\nEuropean, South American and African shipping companies. Cochin shipyard is\nthe pioneer in autonomous electric propulsion ships.",
    "openai_summarised_points": [
      "• The Shipbuilding Financial Assistance Policy (SBFAP) was introduced in 2016 to provide financial support to Indian shipyards for shipbuilding contracts.",
      "• Since its inception, under SBFAP, a total of 313 domestic and export vessel orders have been procured by 39 Indian shipyards.",
      "• The total value of these shipbuilding orders amounts to approximately ₹10,500 crore, which is equivalent to about $1.26 billion.",
      "• The Ministry of Ports, Shipping and Waterways reports these figures, indicating active government support for the Indian shipbuilding industry.",
      "• India hosts multiple shipbuilding companies, including Cochin Shipyard, Hindustan Shipyard, and Swan Defence and Heavy Industries.",
      "• These companies primarily produce ships for European, South American, and African shipping companies.",
      "• Cochin Shipyard is notable for being a pioneer in the development of autonomous electric propulsion ships.",
      "• The INS Vikrant, an Indian aircraft carrier, is under construction at Cochin Shipyard, highlighting the shipyard’s significant role in national defense and advanced shipbuilding."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:24.898360",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 743,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.10",
    "section_name": "Datacentre and cloud",
    "text": "India has emerged as the leading data centre hub in the Asia-Pacific region\n(excluding China), surpassing established players like Singapore, Australia,\nSouth Korea, Japan, and Hong Kong in installed capacity. This reflects the\nescalating demand for data services in one of the world's fastest-growing\nmajor economies. With a current installed capacity of 950 MW and projections\nindicating an additional 850 MW by 2026, India is poised to solidify its\nposition as a key player in the Asia-Pacific data centre landscape.\n\nIn Hyderabad, The largest datacentre is spread over 1. 31 lakh square feet,\nthe proposed rated-4 (tier-4) data centre will be equipped with 1,600 racks\nand powered by 18MW of electricity.\n\nIndia's overall public cloud services market is projected to hit US $13\nbillion by 2026, expanding at a CAGR of 23.1% in 2021-26. The market's revenue\ntotaled US $2.8 billion for the first half of 2022.",
    "openai_summarised_points": [
      "• India has become the leading data centre hub in the Asia-Pacific region, excluding China, surpassing established markets such as Singapore, Australia, South Korea, Japan, and Hong Kong in terms of installed capacity.",
      "• This growth reflects the increasing demand for data services driven by India’s status as one of the world's fastest-growing major economies.",
      "• India’s current installed data centre capacity is 950 MW, with projections indicating an additional 850 MW of capacity expected to be added by 2026, positioning India as a significant player in the Asia-Pacific data centre sector.",
      "• In Hyderabad, the largest data centre spans over 1.31 lakh square feet (131,000 square feet).",
      "• The proposed data centre in Hyderabad is rated as a Tier-4 (rated-4) facility, which will be equipped with 1,600 racks and powered by an 18 MW electricity supply.",
      "• India’s overall public cloud services market is projected to reach US $13 billion by 2026, demonstrating a compound annual growth rate (CAGR) of 23.1% during the period from 2021 to 2026.",
      "• The revenue generated from public cloud services in India totaled US $2.8 billion in the first half of 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:30.223077",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 912,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.11",
    "section_name": "Telecommunications",
    "text": "INSAT-1B satellite: broadcasting sector in India is highly dependent on INSAT\nsystem.\n\nThe telecommunication sector generated ₹2.20 trillion (US$26 billion) in\nrevenue in 2014–15, accounting for 1.94% of total GDP. Telecom equipment\nmanufacturing and exports are becoming a new success story following the\nsuccess of smartphone exports. In the financial year 2024, the telecom\nequipment production exceeded the milestone of Rs 45,000 crore with exports\ntotaling approximately Rs 10,500 crore. India is the second-largest market in\nthe world by number of telephone users (both fixed and mobile phones) with\n1.053 billion subscribers as of 31 August 2016.[update] It has one of the\nlowest call-tariffs in the world, due to fierce competition among telecom\noperators. India has the world's third-largest Internet user-base. As of 31\nMarch 2016,[update] there were 342.65 million Internet subscribers in the\ncountry. India's telecommunication industry is the world's second largest by\nthe number of mobile phone, smartphone, and internet users. It is the world's\n24th-largest oil producer and the third-largest oil consumer.\n\nIndustry estimates indicate that there are over 554 million TV consumers in\nIndia as of 2012.[update] India is the largest direct-to-home (DTH) television\nmarket in the world by number of subscribers. As of May 2016,[update] there\nwere 84.80 million DTH subscribers in the country.",
    "openai_summarised_points": [
      "• The broadcasting sector in India is highly dependent on the INSAT-1B satellite system, which plays a crucial role in satellite-based broadcasting services.",
      "• The telecommunication sector in India generated ₹2.20 trillion (US$26 billion) in revenue during the fiscal year 2014–15, representing approximately 1.94% of the country's total Gross Domestic Product (GDP).",
      "• The manufacturing and export of telecom equipment in India are emerging as a new success story, particularly following the notable success of smartphone exports.",
      "• In the financial year 2024, India's telecom equipment production surpassed Rs 45,000 crore, with exports reaching approximately Rs 10,500 crore, marking significant growth in the sector.",
      "• India is the second-largest global market in terms of the number of telephone users, both fixed-line and mobile, with a total of 1.053 billion subscribers as of 31 August 2016.",
      "• The country has some of the lowest call-tariffs worldwide, driven by intense competition among telecom operators.",
      "• India ranks as the third-largest Internet user-base in the world, with 342.65 million Internet subscribers as of 31 March 2016.",
      "• The Indian telecommunication industry is the second-largest globally in terms of the number of mobile phone users, smartphone users, and Internet users.",
      "• India is the 24th-largest oil producer in the world and the third-largest oil consumer.",
      "• Industry estimates from 2012 indicate there are over 554 million television consumers in India.",
      "• India holds the distinction of being the largest direct-to-home (DTH) television market globally by the number of subscribers.",
      "• As of May 2016, the country had 84.80 million DTH subscribers, reflecting the significant growth and penetration of DTH services in India."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:40.361527",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1403,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.12",
    "section_name": "Defence",
    "text": "PAFC AIP fuel-cell module developed by the DRDO of India to power marine\ntransport\n\nWith over 1.3 million active personnel, the Indian Army is the third-largest\nmilitary force and the largest volunteer army. Defence expenditure was pegged\nat US$70.12 billion for fiscal year 2022–23 and, increased 9.8% than previous\nfiscal year. India is the world's second largest arms importer; between 2016\nand 2020, it accounted for 9.5% of the total global arms imports. India\nexported military hardware worth ₹159.2 billion (US$1.9 billion) in the\nfinancial year 2022–23, the highest ever and a notable tenfold increase since\n2016–17.",
    "openai_summarised_points": [
      "• The PAFC AIP fuel-cell module, developed by the Defence Research and Development Organisation (DRDO) of India, is designed to power marine transport, indicating advancements in India's defense technology for maritime applications.",
      "• The Indian Army maintains over 1.3 million active personnel, making it the third-largest military force globally and the largest volunteer army in the world.",
      "• India's defense expenditure for the fiscal year 2022–23 was approximately US$70.12 billion, representing a 9.8% increase compared to the previous fiscal year.",
      "• India is the world's second-largest arms importer, accounting for 9.5% of the total global arms imports between 2016 and 2020.",
      "• During the financial year 2022–23, India exported military hardware worth ₹159.2 billion (US$1.9 billion), marking the highest export value ever recorded and a tenfold increase since the fiscal year 2016–17."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:42:46.298730",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 624,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.4.13",
    "section_name": "Diversified Energy sector",
    "text": "An IPHWR-700 reactor undergoing construction in Kakrapar Nuclear Plant started\nin 1984\n\nPrimary energy consumption of India is the third-largest after China and US\nwith 5.3% global share in the year 2015. Coal and crude oil together account\nfor 85% of the primary energy consumption of India. India's oil reserves meet\n25% of the country's domestic oil demand. As of April 2015,[update] India's\ntotal proven crude oil reserves are 763.476 megatonnes (751.418 million long\ntons; 841.588 million short tons), while gas reserves stood at 1,490 billion\ncubic metres (53 trillion cubic feet). Oil and natural gas fields are located\noffshore at Ashoknagar Oil Field, Bombay High, Krishna Godavari Basin, Mangala\nArea and the Cauvery Delta, and onshore mainly in the states of West Bengal,\nAssam, Gujarat and Rajasthan. India is the fourth-largest consumer of oil and\nnet oil imports were nearly ₹8.2 trillion (US$97 billion) in 2014–15, which\nhad an adverse effect on the country's current account deficit. The petroleum\nindustry in India mostly consists of public sector companies such as Oil and\nNatural Gas Corporation (ONGC), Hindustan Petroleum Corporation Limited\n(HPCL), Bharat Petroleum Corporation Limited (BPCL) and Indian Oil Corporation\nLimited (IOCL). There are some major private Indian companies in the oil\nsector such as Reliance Industries Limited (RIL) which operates the world's\nlargest oil refining complex.\n\nIndia became the world's third-largest producer of electricity in 2013 with a\n4.8% global share in electricity generation, surpassing Japan and Russia. By\nthe end of calendar year 2015, India had an electricity surplus with many\npower stations idling for want of demand. The utility electricity sector had\nan installed capacity of 303 GW as of May 2016[update] of which thermal power\ncontributed 69.8%, hydroelectricity 15.2%, other sources of renewable energy\n13.0%, and nuclear power 2.1%. India meets most of its domestic electricity\ndemand through its 106 gigatonnes (104 billion long tons; 117 billion short\ntons) of proven coal reserves. India is also rich in certain alternative\nsources of energy with significant future potential such as solar, wind and\nbiofuels (jatropha, sugarcane). India's dwindling uranium reserves stagnated\nthe growth of nuclear energy in the country for many years. Recent discoveries\nin the Tummalapalle belt may be among the top 20 natural uranium reserves\nworldwide,[_needs update_] and an estimated reserve of 846,477 tonnes (833,108\nlong tons; 933,081 short tons) of thorium – about 25% of world's reserves –\nare expected to fuel the country's ambitious nuclear energy programme in the\nlong run. The Indo-US nuclear deal has also paved the way for India to import\nuranium from other countries."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Infrastructure sector",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( June 2023)_\n---|---\nVizhinjam International Seaport Thiruvananthapuram, the first _Mother Port_ in\nthe world, with harbor depth of 24 metres\n\nIndia's infrastructure and transport sector contributes about 5% of its GDP.\nIndia has a road network of over 5,472,144 kilometres (3,400,233 mi) as of 31\nMarch 2015,[update] the second-largest road network in the world only behind\nUnited States. At 1.66 km of roads per square kilometre of land (2.68 miles\nper square mile), the quantitative density of India's road network is higher\nthan that of Japan (0.91) and United States (0.67), and far higher than that\nof China (0.46), Brazil (0.18) or Russia (0.08). Qualitatively, India's roads\nare a mix of modern highways and narrow, unpaved roads, and are being\nimproved. As of 31 March 2015,[update] 87.05% of Indian roads were paved. It\nis upgrading its infrastructure. As of May 2014,[update] India had completed\nover 22,600 kilometres (14,000 mi) of 4- or 6-lane highways, connecting most\nof its major manufacturing, commercial and cultural centres. India's road\ninfrastructure carries 60% of freight and 87% of passenger traffic.\n\nDelhi-Meerut Expressway is the 2nd widest 14 lane expressway after Dwarka\nExpressway\n\nIndia has a coastline of 7,500 kilometres (4,700 mi) with 13 major ports, 15\nbig private ports and 60 operational non-major ports, which together handle\n95% of the country's external trade by volume and 70% by value (most of the\nremainder handled by air). Kandla Port, New Kandla is the largest public port\nestablished in early 1960's, while Mundra is the largest private sea port. The\nairport infrastructure of India includes 125 airports, of which 66 airports\nare licensed to handle both passengers and cargo. India has multiple global\ninfrastructure companies such as Afcons Infrastructure, Adani Group, JSW\nInfrastructure, Larsen & Toubro etc.\n\nThe construction industry contributed $288 billion (13% of GDP) and employed\n60.42 million people (14% of the workforce) in 2016. The construction and real\nestate sector ranks third among the 14 major sectors in terms of direct,\nindirect, and induced effects in all sectors of the economy.\n\nThe real estate sector will provide huge business opportunities, employment\nand big avenues for startup ecosystem. The 2023 Union budget of India also\nfocused significantly on infrastructure with nearly ₹10 trillion direct\ninvestment of central government.\n\nIndia has MGNREGA scheme which provides employment to 80 million people and as\nwell as provides large infrastructure development. India is massively\nprivatizing airports, ports, bus stands, railway stations, dams, dam wind\npark, solar parks, floating solar plants, power transmission, highways,\nthermal power and other utilizes."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5.1",
    "section_name": "Banking and financial services",
    "text": "Bank of India HQ in BKC India bonds\n\n30 year\n\n10 year\n\n2 year\n\n1 year\n\n3 month\n\nThe financial services industry contributed $809 billion (37% of GDP) and\nemployed 14.17 million people (3% of the workforce) in 2016, and the banking\nsector contributed $407 billion (19% of GDP) and employed 5.5 million people\n(1% of the workforce) in 2016. The Indian money market is classified into the\norganised sector, comprising private, public and foreign-owned commercial\nbanks and cooperative banks, together known as 'scheduled banks'; and the\nunorganised sector, which includes individual or family-owned indigenous\nbankers or money lenders and non-banking financial companies. The unorganised\nsector and microcredit are preferred over traditional banks in rural and sub-\nurban areas, especially for non-productive purposes such as short-term loans\nfor ceremonies.\n\nPrime Minister Indira Gandhi nationalised 14 banks in 1969, followed by six\nothers in 1980, and made it mandatory for banks to provide 40% of their net\ncredit to priority sectors including agriculture, small-scale industry, retail\ntrade and small business, to ensure that the banks fulfilled their social and\ndevelopmental goals. Since then, the number of bank branches has increased\nfrom 8,260 in 1969 to 72,170 in 2007 and the population covered by a branch\ndecreased from 63,800 to 15,000 during the same period. The total bank\ndeposits increased from ₹59.1 billion (equivalent to ₹2.8 trillion or US$33\nbillion in 2023) in 1970–71 to ₹38.31 trillion (equivalent to ₹96 trillion or\nUS$1.1 trillion in 2023) in 2008–09. Despite an increase of rural branches –\nfrom 1,860 or 22% of the total in 1969 to 30,590 or 42% in 2007 – only 32,270\nof 500,000 villages are served by a scheduled bank.\n\nIndia's gross domestic savings in 2006–07 as a percentage of GDP stood at a\nhigh 32.8%. More than half of personal savings are invested in physical assets\nsuch as land, houses, cattle, and gold. The government-owned public-sector\nbanks hold over 75% of total assets of the banking industry, with the private\nand foreign banks holding 18.2% and 6.5% respectively. Since liberalisation,\nthe government has approved significant banking reforms. While some of these\nrelate to nationalised banks – such as reforms encouraging mergers, reducing\ngovernment interference and increasing profitability and competitiveness –\nother reforms have opened the banking and insurance sectors to private and\nforeign companies."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5.2",
    "section_name": "Retail",
    "text": "Surat Diamond City Aerial View\n\nThe retail industry, excluding wholesale, contributed $793 billion (10% of\nGDP) and employed 35 million people (8% of the workforce) in 2020. The\nindustry is the second largest employer in India, after agriculture. The\nIndian retail market is estimated to be US$600 billion and one of the top-five\nretail markets in the world by economic value. India has one of the fastest-\ngrowing retail markets in the world, and is projected to reach $1.3 trillion\nby 2020. India has retail market worth $1.17 trillion, which contributes over\n10% of India's GDP. It also has one of the world's fastest growing e-commerce\nmarkets. The e-commerce retail market in India was valued at $32.7 billion in\n2018, and is expected to reach $71.9 billion by 2022.\n\nIndia's retail industry mostly consists of local mom-and-pop stores, owner-\nstaffed shops and street vendors. Retail supermarkets are expanding, with a\nmarket share of 4% in 2008. In 2012, the government permitted 51% FDI in\nmulti-brand retail and 100% FDI in single-brand retail. However, a lack of\nback-end warehouse infrastructure and state-level permits and red tape\ncontinue to limit growth of organised retail. Compliance with over thirty\nregulations such as \"signboard licences\" and \"anti-hoarding measures\" must be\nmade before a store can open for business. There are taxes for moving goods\nfrom state to state, and even within states.\n\nScenic view from Harangi Elephant Camp & Tree Park in Coorg"
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5.3",
    "section_name": "Tourism",
    "text": "Ayodhya became the top destination in 2024\n\nThe World Travel & Tourism Council calculated that tourism generated ₹15.24\ntrillion (US$180 billion) or 9.4% of the nation's GDP in 2017 and supported\n41.622 million jobs, 8% of its total employment. The sector is predicted to\ngrow at an annual rate of 6.9% to ₹32.05 trillion (US$380 billion) by 2028\n(9.9% of GDP). Over 10 million foreign tourists arrived in India in 2017\ncompared to 8.89 million in 2016, recording a growth of 15.6%. The tourism\nindustry contributes about 9.2% of India's GDP and employs over 42 million\npeople. India earned $21.07 billion in foreign exchange from tourism receipts\nin 2015. International tourism to India has seen a steady growth from 2.37\nmillion arrivals in 1997 to 8.03 million arrivals in 2015. Bangladesh is the\nlargest source of international tourists to India, while European Union\nnations and Japan are other major sources of international tourists. In 2024,\nAyodhya, particularly with the Ram Temple became Uttar Pradesh's top tourist\ndestination, attracting more domestic and international visitors. Less than\n10% of international tourists visit the Taj Mahal, with the majority visiting\nother cultural, thematic and holiday circuits. Over 12 million Indian citizens\ntake international trips each year for tourism, while domestic tourism within\nIndia adds about 740 million Indian travellers. India has a fast-growing\nmedical tourism sector of its health care economy, offering low-cost health\nservices and long-term care. In October 2015, the medical tourism sector was\nestimated to be worth US$3 billion. It is projected to grow to $7–8 billion by\n2020. In 2014, 184,298 foreign patients traveled to India to seek medical\ntreatment."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5.4",
    "section_name": "Wedding Industry",
    "text": "India's wedding industry has a size of $75 billion, second largest after\nChina. It is the fourth largest industry in India. The wedding industry saw\nsignificant growth in 2023 as weddings became larger and more extravagant post\nthe pandemic blues. Average guest size grew by nearly 15%, from 270 guests in\n2022 to 310 in 2023. Celebrations also expanded, with couples now hosting an\naverage of 4.2 functions, up from 3.2.A significant 27 lakh weddings fall in\nthe ₹10-25 lakh range, reflecting the popularity of mid-range wedding budgets.\nSmaller budgets like ₹3 lakh and ₹6 lakh account for 10 lakh weddings each,\nwhile high-end weddings costing ₹1 crore or more make up 50,000 weddings.\n\nIndia hosts the highest number of weddings in the world each year, as per\ninvestment banking and capital market firm Jefferies. However, in terms of\nmarket size, the Indian wedding industry is still smaller than China's but\nalmost twice as big as the US's."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "4.5.5",
    "section_name": "Films, entertainment and music industry",
    "text": "The Indian cinema industry is expected to garner a revenue of around Rs 16,198\ncrore by 2026, of which Rs 15,849 would be Box office revenue and the rest Rs\n349 crore from advertising, the report added. India's Recorded Music industry\n(which is a key sub-segment) is making steady progress at a CAGR of 13.6\npercent, thanks to streaming models."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Security markets",
    "text": "The National Stock Exchange of India (NSE) is the biggest stock exchange in\nIndia by trading volume as 96% trading occurs in NSE\n\nThe development of Indian security markets began with the launch of the Bombay\nStock Exchange (BSE) in July 1875 and the Ahmedabad Stock Exchange in 1894.\nSince then, 22 other exchanges have traded in Indian cities. In 2014, India's\nstock exchange market became the 10th largest in the world by market\ncapitalisation, just above those of South Korea and Australia. India's two\nmajor stock exchanges, BSE and the National Stock Exchange of India, had a\nmarket capitalisation of US$1.71 trillion and US$1.68 trillion as of February\n2015,[update] according to the World Federation of Exchanges, which grew to\n$3.36 trillion and $3.31 trillion respectively by September 2021.\n\nThe initial public offering (IPO) market in India has been small compared to\nNYSE and NASDAQ, raising US$300 million in 2013 and US$1.4 billion in 2012.\nErnst & Young stated that the low IPO activity reflects market conditions,\nslow government approval processes, and complex regulations. Before 2013,\nIndian companies were not allowed to list their securities internationally\nwithout first completing an IPO in India. In 2013, these security laws were\nreformed and Indian companies can now choose where they want to list first:\noverseas, domestically, or both concurrently. Further, security laws have been\nrevised to ease overseas listings of already-listed companies, to increase\nliquidity for private equity and international investors in Indian companies."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Foreign trade and investment",
    "text": "A map showing the global distribution of Indian exports in 2006 as a\npercentage of the top market (US at $20.9 billion)"
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Major Trade Partners",
    "text": "The following table shows the largest trading partners for India in 2024-25 by\ntotal trade value in billions of USD.\n\nCountry  | Export Value  | Import Value  | Total Trade Value  | Balance\n---|---|---|---|---\nUnited States | 88.02  | 43.01  | 130.3  | 45.01\nChina | 16.66  | 101.75  | 118.41  | -85.09\nUnited Arab Emirates | 35.63  | 48.02  | 83.65  | -12.39\nRussia | 4.26  | 61.43  | 65.69  | -57.17\nSaudi Arabia | 11.56  | 31.81  | 43.37  | -20.25\nSingapore | 14.41  | 21.20  | 35.61  | -6.79\nIraq | 3.35  | 30.00  | 33.35  | -26.65\nIndonesia | 5.99  | 23.41  | 29.40  | -17.42\nHong Kong | 8.24  | 20.45  | 28.69  | -12.21\nSouth Korea | 6.42  | 21.14  | 27.56  | -14.72"
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Foreign trade",
    "text": "India's main trading partners in FY 2024-25"
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.2.1",
    "section_name": "India's foreign trade by year",
    "text": "Year  | Total Trade\n(in USD billion) | Exports\n(in USD billion) | Imports\n(in USD billion) | Trade Deficit\n(in USD billion)\n---|---|---|---|---\n2024  | 1,631.48  | 776.68  | 854.80  | -78.12\n2023  | 1,662.36  | 770.18  | 892.18  | -122.00\n2022  | 1,436.59  | 676.53  | 760.06  | -83.53\n2021  | 1,032  | 420  | 612  | -192.00\n2020  | 781.5  | 314.31  | 467.19  | -158.88\n2019  | 844.14  | 330.07  | 514.07  | -184\n2018  | 769.1  | 303.52  | 465.58  | -162.05\n2017  | 660.1  | 275.8  | 384.3  | -108.5\n2016  | 643.3  | 262.3  | 381  | -118.7\n2015  | 758.2  | 310.3  | 447.9  | -137.6\n2014  | 781.1  | 318.2  | 462.9  | -144.7\n2013  | 780.7  | 313.2  | 467.5  | -154.3\n2012  | 798.8  | 298.4  | 500.4  | -202.0\n2011  | 760.8  | 299.4  | 461.4  | -162.0\n2010  | 528.1  | 201.1  | 327.0  | -125.9\n2009  | 442.5  | 168.2  | 274.3  | -106.1\n2008  | 481.9  | 176.4  | 305.5  | -129.1\n2007  | 212.9  | 112.0  | 100.9  | 11.1\n2006  | 189.33  | 76.23  | 113.1  | -36.87\n2005  | 158.51  | 69.18  | 89.33  | -20.15\n2004  | 131.39  | 57.24  | 74.15  | -16.91\n2003  | 109.9  | 48.3  | 61.6  | -13.3\n2002  | 98.3  | 44.5  | 53.8  | -9.3\n2001  | 97  | 42.5  | 54.5  | -12.0\n2000  | 103.9  | 43.1  | 60.8  | -17.7\n1999  | 86.5  | 36.3  | 50.2  | -13.9\n\nUntil the liberalisation of 1991, India was largely and intentionally isolated\nfrom world markets, to protect its economy and to achieve self-reliance.\nForeign trade was subject to import tariffs, export taxes and quantitative\nrestrictions, while foreign direct investment (FDI) was restricted by upper-\nlimit equity participation, restrictions on technology transfer, export\nobligations and government approvals; these approvals were needed for nearly\n60% of new FDI in the industrial sector. The restrictions ensured that FDI\naveraged only around $200 million annually between 1985 and 1991; a large\npercentage of the capital flows consisted of foreign aid, commercial borrowing\nand deposits of non-resident Indians. India's exports were stagnant for the\nfirst 15 years after independence, due to general neglect of trade policy by\nthe government of that period; imports in the same period, with early\nindustrialisation, consisted predominantly of machinery, raw materials and\nconsumer goods. Since liberalisation, the value of India's international trade\nhas increased sharply, with the contribution of total trade in goods and\nservices to the GDP rising from 16% in 1990–91 to 47% in 2009–10. Foreign\ntrade accounted for 48.8% of India's GDP in 2015. Globally, India accounts for\n1.44% of exports and 2.12% of imports for merchandise trade and 3.34% of\nexports and 3.31% of imports for commercial services trade. India's major\ntrading partners are the European Union, China, United States and United Arab\nEmirates. In 2006–07, major export commodities included engineering goods,\npetroleum products, chemicals and pharmaceuticals, gems and jewellery,\ntextiles and garments, agricultural products, iron ore and other minerals.\nMajor import commodities included crude oil and related products, machinery,\nelectronic goods, gold and silver. In November 2010, exports increased 22.3%\nyear-on-year to ₹851 billion (equivalent to ₹1.9 trillion or US$23 billion in\n2023), while imports were up 7.5% at ₹1.25 trillion (equivalent to ₹2.8\ntrillion or US$33 billion in 2023). The trade deficit for the same month\ndropped from ₹469 billion (equivalent to ₹1.2 trillion or US$14 billion in\n2023) in 2009 to ₹401 billion (equivalent to ₹900 billion or US$11 billion in\n2023) in 2010.\n\nIndia is a founding-member of General Agreement on Tariffs and Trade (GATT)\nand its successor, the WTO. While participating actively in its general\ncouncil meetings, India has been crucial in voicing the concerns of the\ndeveloping world. For instance, India has continued its opposition to the\ninclusion of labour, environmental issues and other non-tariff barriers to\ntrade in WTO policies.\n\nIndia secured 43rd place in competitiveness index."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.3",
    "section_name": "Balance of payments",
    "text": "Cumulative current account balance 1980–2008 based on IMF data\n\nSince independence, India's balance of payments on its current account has\nbeen negative. Since economic liberalisation in the 1990s, precipitated by a\nbalance-of-payment crisis, India's exports rose consistently, covering 80.3%\nof its imports in 2002–03, up from 66.2% in 1990–91. However, the global\neconomic slump followed by a general deceleration in world trade saw the\nexports as a percentage of imports drop to 61.4% in 2008–09. India's growing\noil import bill is seen as the main driver behind the large current account\ndeficit, which rose to $118.7 billion, or 11.11% of GDP, in 2008–09. Between\nJanuary and October 2010, India imported $82.1 billion worth of crude oil. The\nIndian economy has run a trade deficit every year from 2002 to 2012, with a\nmerchandise trade deficit of US$189 billion in 2011–12. Its trade with China\nhas the largest deficit, about $31 billion in 2013.\n\nIndia's reliance on external assistance and concessional debt has decreased\nsince liberalisation of the economy, and the debt service ratio decreased from\n35.3% in 1990–91 to 4.4% in 2008–09. In India, external commercial borrowings\n(ECBs), or commercial loans from non-resident lenders, are being permitted by\nthe government for providing an additional source of funds to Indian\ncorporates. The Ministry of Finance monitors and regulates them through ECB\npolicy guidelines issued by the Reserve Bank of India (RBI) under the Foreign\nExchange Management Act of 1999. India's foreign exchange reserves have\nsteadily risen from $5.8 billion in March 1991 to ₹38,832.21 billion (US$540\nbillion) in July 2020. In 2012, United Kingdom announced an end to all\nfinancial aid to India, citing the growth and robustness of Indian economy.\n\nIndia's current account deficit reached an all-time high in 2013. India has\nhistorically funded its current account deficit through borrowings by\ncompanies in the overseas markets or remittances by non-resident Indians and\nportfolio inflows. From April 2016 to January 2017, RBI data showed that, for\nthe first time since 1991, India was funding its deficit through foreign\ndirect investment inflows. _The Economic Times_ noted that the development was\n\"a sign of rising confidence among long-term investors in Prime Minister\nNarendra Modi's ability to strengthen the country's economic foundation for\nsustained growth\"."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.4",
    "section_name": "Foreign direct investment",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( October 2015)_\n---|---\n**Share of top five investing countries in FDI inflows (2000–2010)** Rank | Country | Inflows\n(million US$) | Inflows (%)\n---|---|---|---\n1 | Mauritius | 50,164 | 42.00\n2 | Singapore | 11,275 | 9.00\n3 | US | 8,914 | 7.00\n4 | UK | 6,158 | 5.00\n5 | Netherlands | 4,968 | 4.00\n\nAs the third-largest economy in the world in PPP terms, India has attracted\nforeign direct investment (FDI). During the year 2011, FDI inflow into India\nstood at $36.5 billion, 51.1% higher than the 2010 figure of $24.15 billion.\nIndia has strengths in telecommunication, information technology and other\nsignificant areas such as auto components, chemicals, apparels,\npharmaceuticals, and jewellery. Despite a surge in foreign investments, rigid\nFDI policies were a significant hindrance. Over time, India has adopted a\nnumber of FDI reforms. India has a large pool of skilled managerial and\ntechnical expertise. The size of the middle-class population stands at 300\nmillion and represents a growing consumer market.\n\nIndia liberalised its FDI policy in 2005, allowing up to a 100% FDI stake in\nventures. Industrial policy reforms have substantially reduced industrial\nlicensing requirements, removed restrictions on expansion and facilitated easy\naccess to foreign technology and investment. The upward growth curve of the\nreal-estate sector owes some credit to a booming economy and liberalised FDI\nregime. In March 2005, the government amended the rules to allow 100% FDI in\nthe construction sector, including built-up infrastructure and construction\ndevelopment projects comprising housing, commercial premises, hospitals,\neducational institutions, recreational facilities, and city- and regional-\nlevel infrastructure. Between 2012 and 2014, India extended these reforms to\ndefence, telecom, oil, retail, aviation, and other sectors.\n\nFrom 2000 to 2010, the country attracted $178 billion as FDI. The inordinately\nhigh investment from Mauritius is due to routing of international funds\nthrough the country given significant tax advantages – double taxation is\navoided due to a tax treaty between India and Mauritius, and Mauritius is a\ncapital gains tax haven, effectively creating a zero-taxation FDI channel. FDI\naccounted for 2.1% of India's GDP in 2015.\n\nAs the government has eased 87 foreign investment direct rules across 21\nsectors in the last three years, FDI inflows hit $60.1 billion between 2016\nand 2017 in India."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.4.1",
    "section_name": "Outflows",
    "text": "Since 2000, Indian companies have expanded overseas, investing FDI and\ncreating jobs outside India. From 2006 to 2010, FDI by Indian companies\noutside India amounted to 1.34 per cent of its GDP. Indian companies have\ndeployed FDI and started operations in United States, Europe and Africa. The\nIndian conglomerate Tata Group is United Kingdom's largest manufacturer and\nprivate-sector employer."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.5",
    "section_name": "Remittances",
    "text": "In 2015, a total of US$68.91 billion was made in remittances to India from\nother countries, and a total of US$8.476 billion was made in remittances by\nforeign workers in India to their home countries. UAE, US, and Saudi Arabia\nwere the top sources of remittances to India, while Bangladesh, Pakistan, and\nNepal were the top recipients of remittances from India. Remittances to India\naccounted for 3.32% of the country's GDP in 2015."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "6.6",
    "section_name": "Mergers and acquisitions",
    "text": "Between 1985 and 2018 20,846 deals have been announced in, into (inbound) and\nout of (outbound) India. This cumulates to a value of US$618 billion. In terms\nof value, 2010 has been the most active year with deals worth almost 60 bil.\nUSD. Most deals have been conducted in 2007 (1,510).\n\nHere is a list of the top 10 deals with Indian companies participating:\n\n**Acquiror Name** | **Acquiror Mid Industry** | **Acquiror Nation** | **Target Name** | **Target Mid Industry** | **Target Nation** | **Value of Transaction ($mil)**\n---|---|---|---|---|---|---\nPetrol Complex Pte Ltd  | Oil & Gas  | Singapore  | Essar Oil Ltd  | Oil & Gas  | India  | 12,907.25\nVodafone Grp Plc  | Wireless  | United Kingdom  | Hutchison Essar Ltd  | Telecommunications Services  | India  | 12,748.00\nVodafone Grp PLC-Vodafone Asts  | Wireless  | India  | Idea Cellular Ltd-Mobile Bus  | Wireless  | India  | 11,627.32\nBharti Airtel Ltd  | Wireless  | India  | MTN Group Ltd  | Wireless  | South Africa  | 11,387.52\nBharti Airtel Ltd  | Wireless  | India  | Zain Africa BV  | Wireless  | Nigeria  | 10,700.00\nBP PLC  | Oil & Gas  | United Kingdom  | Reliance Industries Ltd-21 Oil  | Oil & Gas  | India  | 9,000.00\nMTN Group Ltd  | Wireless  | South Africa  | Bharti Airtel Ltd  | Wireless  | India  | 8,775.09\nShareholders  | Other Financials  | India  | Reliance Inds Ltd-Telecom Bus  | Telecommunications Services  | India  | 8,063.01\nOil & Natural Gas Corp Ltd  | Oil & Gas  | India  | Hindustan Petro Corp Ltd  | Petrochemicals  | India  | 5,784.20\nReliance Commun Ventures Ltd  | Telecommunications Services  | India  | Reliance Infocomm Ltd  | Telecommunications Services  | India  | 5,577.18"
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Currency",
    "text": "The Reserve Bank of India's headquarters in Mumbai, India\n\n**• EXCHANGE RATES**\n\nYear | INR₹ per US$\n(_annual average_) | INR₹ per Pound(£)\n(_annual average_)\n---|---|---\n1947 | 3.31 | 13.33\n1950 | 4.76 | —\n1967 | 7.50 | 17.76\n1975 | 9.4058 | —\n1980 | 7.88 | —\n1985 | 12.364 | —\n1987 | — | 21.18\n1990 | 17.4992 | 31.07\n1995 | 32.4198 | 51.17\n2000 | 44.9401 | 67.99\n2005 | 44.1000 | 80.15\n2010 | 45.7393 | 70.65\n2015 | 64.05 | 98.0101\n2016 | 67.09 | 90.72\n2017 | 64.14 | 87.56\n2018  | 69.71 | 98.51\n2019  | 70.394 | 95.06\n2020  | 72.97 | 100.05\n2021  | 74.98 | 101.56\n2022  | 81.35 | 96.23\n2023  | 81.94 | 100.95\n\nThe Indian rupee (₹) is the only legal tender in India, and is also accepted\nas legal tender in neighbouring Nepal and Bhutan, both of which peg their\ncurrency to that of the Indian rupee. The rupee previously was divided into\n100 paise, which no longer exist. The highest-denomination banknote was the\n₹2,000 note until 30 September 2023 after which it was scrapped and ₹500 note\nbecame the highest denomination; the lowest-denomination coin in circulation\nis the ₹1 coin. In 2017, demonetisation was announced in which ₹500 and ₹1000\nnotes were withdrawn and new ₹500 notes were issued. India's monetary system\nis managed by the Reserve Bank of India (RBI), the country's central bank.\nEstablished on 1 April 1935 and nationalised in 1949, the RBI serves as the\nnation's monetary authority, regulator and supervisor of the monetary system,\nbanker to the government, custodian of foreign exchange reserves, and as an\nissuer of currency. It is governed by a central board of directors, headed by\na governor who is appointed by the Government of India. The benchmark interest\nrates are set by the Monetary Policy Committee.\n\nThe rupee was linked to the British pound from 1927 to 1946, and then to US\ndollar until 1975 through a fixed exchange rate. It was devalued in September\n1975 and the system of fixed par rate was replaced with a basket of four major\ninternational currencies: the British pound, US dollar, the Japanese yen and\nthe Deutsche Mark. In 1991, after the collapse of its largest trading partner,\nthe Soviet Union, India faced the major foreign exchange crisis and the rupee\nwas devalued by around 19% in two stages on 1 and 2 July. In 1992, a\nLiberalized Exchange Rate Mechanism (LERMS) was introduced. Under LERMS,\nexporters had to surrender 40 percent of their foreign exchange earnings to\nthe RBI at the RBI-determined exchange rate; the remaining 60% could be\nconverted at the market-determined exchange rate. In 1994, the rupee was\nconvertible on the current account, with some capital controls.\n\nAfter the sharp devaluation in 1991 and transition to current account\nconvertibility in 1994, the value of the rupee has been largely determined by\nmarket forces. The rupee has been fairly stable during the decade 2000–2010.\nIn October 2022, rupee touched an all-time low 83.29 to US dollar."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Income and consumption",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( March 2022)_\n---|---\nIndia vs world by nominal GDP per capita in 2025 Gini index of India compared\nto other countries per World Bank data tables as of 2018[update]\n\nIndia's gross national income per capita had experienced high growth rates\nsince 2002. It tripled from ₹19,040 in 2002–03 to ₹53,331 in 2010–11,\naveraging 13.7% growth each of these eight years, with peak growth of 15.6% in\n2010–11 and, growth in the inflation-adjusted per-capita income of the nation\nslowed to 5.6% in 2010–11, down from 6.4% in the previous year. These\nconsumption levels are on an individual basis. The average family income in\nIndia was $6,671 per household in 2011.\n\nAccording to 2011 census data, India has about 330 million houses and 247\nmillion households. The household size in India has dropped in recent years,\nthe 2011 census reporting 50% of households have four or fewer members, with\nan average of 4.8 members per household including surviving grandparents.\nThese households produced a GDP of about $1.7 trillion. Consumption patterns\nnote: approximately 67% of households use firewood, crop residue, or cow-dung\ncakes for cooking purposes; 53% do not have sanitation or drainage facilities\non premises; 83% have water supply within their premises or 100 metres (330\nft) from their house in urban areas and 500 metres (1,600 ft) from the house\nin rural areas; 67% of the households have access to electricity; 63% of\nhouseholds have landline or mobile telephone service; 43% have a television;\n26% have either a two- or four-wheel motor vehicle. Compared to 2001, these\nincome and consumption trends represent moderate to significant improvements.\nOne report in 2010 claimed that high-income households outnumber low-income\nhouseholds.\n\nCountries by nominal GNI per capita according to the Atlas method (2016)\n\nNew World Wealth publishes reports tracking the total wealth of countries,\nwhich is measured as the private wealth held by all residents of a country.\nAccording to New World Wealth, India's total wealth increased from $3,165\nbillion in 2007 to $8,230 billion in 2017, a growth rate of 160%. India's\ntotal wealth decreased by 1% from $8.23 trillion in 2017 to $8.148 trillion in\n2018, making it the sixth wealthiest nation in the world. There are 20,730\nmultimillionaires (7th largest in the world) and 118 billionaires in India\n(3rd largest in the world). With 327,100 high net-worth individuals (HNWI),\nIndia is home to the 9th highest number of HNWIs in the world. Mumbai is the\nwealthiest Indian city and the 12th wealthiest in the world, with a total net\nworth of $941 billion in 2018. Twenty-eight billionaires reside in the city,\nranked ninth worldwide. As of December 2016,[update] the next wealthiest\ncities in India were Delhi ($450 billion), Bengaluru ($320 billion), Hyderabad\n($310 billion), Kolkata ($290 billion), Chennai ($200 billion), and Gurugram\n($110 billion).\n\nThe _Global Wealth Migration Review_ _2019_ report, published by New World\nWealth, found that 5,000 HNWI's emigrated from India in 2018, or about 2% of\nall HNWIs in the country. Australia, Canada, and United States were among the\ntop destination countries. The report also projected that private wealth in\nIndia would grow by around 180% to reach $22,814 billion by 2028."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Poverty",
    "text": "Poverty rate map of India by prevalence in 2012, among its states and union\nterritories\n\nIn May 2014, the World Bank reviewed and proposed revisions to its poverty\ncalculation methodology of 2005 and purchasing-power-parity basis for\nmeasuring poverty. According to the revised methodology, the world had 872.3\nmillion people below the new poverty line, of which 179.6 million lived in\nIndia. With 17.5% of the total world's population, India had a 20.6% share of\nthe world's poorest in 2013. According to a 2005–2006 survey, India had about\n61 million children under the age of 5 who were chronically malnourished. A\n2011 UNICEF report stated that between 1990 and 2010, India achieved a 45\npercent reduction in mortality rates under the age of 5, and now ranks 46th of\n188 countries on this metric.\n\nSince the early 1960s, successive governments have implemented various schemes\nto alleviate poverty, under central planning, that have met with partial\nsuccess. In 2005, the government enacted the Mahatma Gandhi National Rural\nEmployment Guarantee Act (MGNREGA), guaranteeing 100 days of minimum wage\nemployment to every rural household in all the districts of India. In 2011, it\nwas widely criticised and beset with controversy for corrupt officials,\ndeficit financing as the source of funds, poor quality of infrastructure built\nunder the programme, and unintended destructive effects. Other studies suggest\nthat the programme has helped reduce rural poverty in some cases. Yet other\nstudies report that India's economic growth has been the driver of sustainable\nemployment and poverty reduction, though a sizeable population remains in\npoverty. India lifted 271 million people out of poverty between 2006 and 2016,\nrecording the fastest reductions in the multidimensional poverty index values\nduring the period with strong improvements in areas such as assets, cooking\nfuel, sanitation, and nutrition.\n\nOn the 2019 Global Hunger Index India ranked 102nd (out of 117 countries) with\na score of 30.3, being categorized as 'serious' in severity. In 2024, India\nranked 105 (out of 127 countries) with a score of 27.3, indicating an\nimprovement in its hunger situation."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Employment",
    "text": "India: extreme poverty rates from 1977 to 2021\n\nAgricultural and allied sectors accounted for about 52% of the total workforce\nin 2009–10. While agriculture employment has fallen over time in percentage of\nlabour employed, services which include construction and infrastructure have\nseen a steady growth accounting for 20.3% of employment in 2012–13. Of the\ntotal workforce, 7% is in the organised sector, two-thirds of which are in the\ngovernment-controlled public sector. About 51.2% of the workforce in India is\nself-employed. Despite having one of the longest working hours, India has one\nof the lowest workforce productivity levels in the world. According to a\n2005–06 survey, there is a gender gap in employment and salaries. In rural\nareas, both men and women are primarily self-employed, mostly in agriculture.\nIn urban areas, salaried work was the largest source of employment for both\nmen and women in 2006."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Unemployment",
    "text": "Unemployment in India is characterised by chronic (disguised) unemployment.\nGovernment schemes that target eradication of both poverty and unemployment –\nwhich in recent decades has sent millions of poor and unskilled people into\nurban areas in search of livelihoods – attempt to solve the problem by\nproviding financial assistance for starting businesses, honing skills, setting\nup public sector enterprises, reservations in governments, etc. The decline in\norganised employment, due to the decreased role of the public sector after\nliberalisation, has further underlined the need for focusing on better\neducation and created political pressure for further reforms. India's labour\nregulations are heavy, even by developing country standards, and analysts have\nurged the government to abolish or modify them to make the environment more\nconducive for employment generation. The 11th five-year plan has also\nidentified the need for a congenial environment to be created for employment\ngeneration, by reducing the number of permissions and other bureaucratic\nclearances required. Inequalities and inadequacies in the education system\nhave been identified as an obstacle, which prevents the benefits of increased\nemployment opportunities from reaching all sectors of society."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Child labour",
    "text": "Child labour is a complex problem that is rooted in poverty. Since the 1990s,\nthe government has implemented a variety of programs to eliminate child\nlabour. These have included setting up schools, launching free school lunch\nprograms, creating special investigation cells, etc. Author Sonalde Desai\nstated that recent studies on child labour in India have found some pockets of\nindustries in which children are employed, but overall, relatively few Indian\nchildren are employed. Child labour below the age of 10 is now rare. In the\n10–14 age group, the latest surveys find only 2% of children working for wage,\nwhile another 9% work within their home or rural farms assisting their parents\nin times of high work demand such as sowing and harvesting of crops."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.3",
    "section_name": "Diaspora remittance",
    "text": "India has the largest diaspora around the world, an estimated 32 million\npeople according to the Ministry of External Affairs (India), many of whom\nwork overseas and remit funds back to their families. The Middle East region\nis the largest source of employment for expat Indians. The crude oil\nproduction and infrastructure industry of Saudi Arabia employs over 2 million\nexpat Indians. Cities such as Dubai and Abu Dhabi in United Arab Emirates have\nemployed another 2 million Indians during the construction boom in recent\ndecades. In 2009–10, remittances from Indian migrants overseas stood at ₹2.5\ntrillion (equivalent to ₹5.6 trillion or US$66 billion in 2023), the highest\nin the world, but their share in FDI remained low at around 1%."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.4",
    "section_name": "Trade unions",
    "text": "In India, the Trade Union movement is generally divided on political lines.\nAccording to provisional statistics from the Ministry of Labour, trade unions\nhad a combined membership of 24,601,589 in 2002. As of 2008, there are 12\nCentral Trade Union Organisations (CTUO) recognized by the Ministry of Labour.\nThe forming of these unions was a big deal in India. It led to a big push for\nmore regulatory laws which gave workers a lot more power.\n\nAITUC is the oldest trade union in India. It is a left supported organization.\nA trade union with nearly 2,000,000 members is the Self Employed Women's\nAssociation (SEWA) which protects the rights of Indian women working in the\ninformal economy. In addition to the protection of rights, SEWA educates,\nmobilizes, finances, and exalts their members' trades. Multiple other\norganizations represent workers. These organizations are formed upon different\npolitical groups. These different groups allow different groups of people with\ndifferent political views to join a Union."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.5",
    "section_name": "Corruption",
    "text": "A map depicting Corruption Perceptions Index in other countries as compared to\nIndia in 2023; a higher score indicates lower levels of corruption\n\n100 – 90\n\n89 – 80\n\n79 – 70\n\n69 – 60\n\n59 – 50\n\n49 – 40\n\n39 – 30\n\n29 – 20\n\n19 – 10\n\n9 – 0\n\nNo data\n\nCorruption has been a pervasive problem in India. A 2005 study by Transparency\nInternational (TI) found that more than half of those surveyed had first-hand\nexperience of paying a bribe or peddling influence to get a job done in a\npublic office in the previous year. A follow-up study in 2008 found this rate\nto be 40 percent. In 2011, TI ranked India at 95th place amongst 183 countries\nin perceived levels of public sector corruption. By 2016, India saw a\nreduction in corruption, and its ranking improved to 79th place.\n\nIn 1996, red tape, bureaucracy, and the Licence Raj were suggested as a cause\nfor the institutionalised corruption and inefficiency. More recent reports\nsuggest the causes of corruption include excessive regulations and approval\nrequirements, mandated spending programs, monopoly of certain goods and\nservice providers by government-controlled institutions, bureaucracy with\ndiscretionary powers, and lack of transparent laws and processes.\n\nComputerisation of services, various central and state vigilance commissions,\nand the 2005 Right to Information Act – which requires government officials to\nfurnish information requested by citizens or face punitive action – have\nconsiderably reduced corruption and opened avenues to redress grievances.\n\nIn 2011, the Indian government concluded that most spending fails to reach its\nintended recipients, as the large and inefficient bureaucracy consumes\nbudgets. India's absence rates are among the worst in the world; one study\nfound that 25% of public sector teachers and 40% of government-owned public-\nsector medical workers could not be found at the workplace. Similarly, many\nissues are facing Indian scientists, with demands for transparency, a\nmeritocratic system, and an overhaul of the bureaucratic agencies that oversee\nscience and technology.\n\nIndia has an underground economy, with a 2006 report alleging that India\ntopped the worldwide list for black money with almost $1,456 billion stashed\nin Swiss banks. This would amount to 13 times the country's total external\ndebt. These allegations have been denied by the Swiss Banking Association.\nJames Nason, the Head of International Communications for the Swiss Banking\nAssociation, suggested \"The (black money) figures were rapidly picked up in\nthe Indian media and in Indian opposition circles, and circulated as gospel\ntruth. However, this story was a complete fabrication. The Swiss Bankers\nAssociation never published such a report. Anyone claiming to have such\nfigures (for India) should be forced to identify their source and explain the\nmethodology used to produce them.\" A Step was taken by Prime Minister Modi, on\n8 November 2016, involved the demonetization of all 500 and 1000 rupee bank\nnotes (replaced by new 500 and 2000 rupee notes) to return black money into\nthe economy followed by criticism that the measure was deemed ineffective by\neconomists and negatively affected the poorest people of India. This\ndemonetisation together with the introduction of The goods and services\ntax(GST) is believed to be responsible for the slowdown in growth."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.6",
    "section_name": "Education",
    "text": "University of Calcutta, established in 1857, was the first multidisciplinary\nand secular Western-style institution in Asia.\n\nIndia has made progress in increasing the primary education attendance rate\nand expanding literacy to approximately three-fourths of the population.\nIndia's literacy rate had grown from 52.2% in 1991 to 74.04% in 2011. The\nright to education at the elementary level has been made one of the\nfundamental rights under the Eighty-Sixth Amendment of 2002, and legislation\nhas been enacted to further the objective of providing free education to all\nchildren. However, the literacy rate of 74% is lower than the worldwide\naverage, and the country suffers from a high drop-out rate. Literacy rates and\neducational opportunities vary by region, gender, urban and rural areas, and\namong different social groups."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.7",
    "section_name": "Economic disparities",
    "text": "Economic disparities among the states and union territories of India, on GDP\nper capita, PPP basis, and GDP per capita basis in 2011\n\n> Poverty rates in India's poorest states are three to four times higher than\n> those in the more advanced states. While India's average annual per capita\n> income was $1,410 in 2011 – placing it among the poorest of the world's\n> middle-income countries – it was just $436 in Uttar Pradesh (which has more\n> people than Brazil) and only $294 in Bihar, one of India's poorest states.\n>\n> — World Bank: India Country Overview 2013\n\nA critical problem facing India's economy is the sharp and growing regional\nvariations among India's different states and territories in terms of poverty,\navailability of infrastructure, and socio-economic development. Six low-income\nstates – Assam, Chhattisgarh, Nagaland, Madhya Pradesh, Odisha, and Uttar\nPradesh – are home to more than one-third of India's population. Severe\ndisparities exist among states in terms of income, literacy rates, life\nexpectancy, and living conditions. The four states of Maharashtra, Tamil Nadu,\nGujarat and Karnataka alone are projected to account for almost 50% of India's\nGDP by 2030; the five South Indian states are projected to contribute 35% of\nIndia's GDP by 2030 despite currently having 20% of India's population.\n\nThe five-year plans, especially in the pre-liberalisation era, attempted to\nreduce regional disparities by encouraging industrial development in the\ninterior regions and distributing industries across states. The results have\nbeen discouraging as these measures increased inefficiency and hampered\neffective industrial growth. The more advanced states have been better placed\nto benefit from liberalisation, with well-developed infrastructure and an\neducated and skilled workforce, which attract the manufacturing and service\nsectors. Governments of less-advanced states have tried to reduce disparities\nby offering tax holidays and cheap land and focused on sectors like tourism,\nwhich can develop faster than other sectors. India's income Gini coefficient\nis 33.9, according to the United Nations Development Programme (UNDP),\nindicating overall income distribution to be more uniform than East Asia,\nLatin America, and Africa. The _Global Wealth Migration Review_ _2019_ report,\npublished by New World Wealth, estimated that 48% of India's total wealth was\nheld by high-net-worth individuals. According to a 2021 report by the Pew\nResearch Center, India has roughly 1.2 billion lower-income individuals, 66\nmillion middle-income individuals, 16 million upper-middle-income individuals,\nand 2 million in the high-income group. As per _The Economist_ , 78 million of\nIndia's population are considered middle class as of 2017, if defined using\nthe cutoff of those making more than $10 per day, a standard used by the\nIndia's National Council of Applied Economic Research.\n\nThere is a continuing debate on whether India's economic expansion has been\npro-poor or anti-poor. Studies suggest that economic growth has been pro-poor\nand has reduced poverty in India."
  },
  {
    "chapter_name": "Economy of India",
    "chapter_id": "1",
    "section_number": "9.8",
    "section_name": "Climate change",
    "text": "Several banks including State Bank of India, Axis Bank, ICICI Bank and HDFC\nBank have taken the lead in funding green projects even as the Reserve Bank of\nIndia comes up with norms for lenders to disclose their actions on climate\nrisk. RBI in an earlier report in 2022, had said that climate change would\nrequire \"intensive capital mobilisation\" for that India needs $17.77 trillion.\n\nThe RBI recommends that regulated entities rely upon the Task Force on\nClimate-related Financial Disclosures (TCFD) framework, the most prominent\nclimate disclosure framework globally, at least at the initial stage.\n\nIndia is home to 75 per cent of the world's wild tiger population.The big cats\nlike lion, tiger, leopard, cheetah, snow leopard, jaguar and puma were on the\nbrink of extinction. With hunting and encroachment, their numbers dropped to a\nmere 20. Efforts to save the lion started before Independence but it was in\n1965 that the Indian Forest Service stepped in to set up a conservation\nprogramme.Researchers believe a combination of factors is driving the\nunprecedented migration in tigers. Rising temperatures due to climate change\nare making the lower foothills less hospitable."
  }
]