[
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Eswatini\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( November 2009)__(Learn how and when to remove\nthis message)_  \n---|---  \n  \nThe **economy of Eswatini** is fairly diversified. Agriculture, forestry and\nmining account for about 13 percent of Eswatini's GDP whereas manufacturing\n(textiles and sugar-related processing) represent 37 percent of GDP. Services\n– with government services in the lead – constitute the other 50 percent of\nGDP.",
    "openai_summarised_points": [
      "• The economy of Eswatini is described as fairly diversified, indicating a range of different economic sectors contributing to national income.",
      "• Agriculture, forestry, and mining collectively account for approximately 13 percent of Eswatini's Gross Domestic Product (GDP).",
      "• The manufacturing sector, primarily comprising textiles and sugar-related processing, represents about 37 percent of the country's GDP.",
      "• The services sector constitutes the remaining 50 percent of Eswatini's GDP, with government services being the leading component within this sector.",
      "• The article notes that the information requires additional citations for verification, emphasizing the need for reliable sources to substantiate the data presented.",
      "• Suggested sources for further information include news outlets, newspapers, books, scholarly articles, and JSTOR, with a specific call to action to improve the article's credibility as of November 2009."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:18.452253",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 679,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "Title Deed lands, where the bulk of high-value crops are grown (sugar,\nforestry, and citrus) are characterized by high levels of investment and\nirrigation, and high productivity. Nevertheless, the majority of the\npopulation – about 75 percent—is employed in subsistence agriculture on Swazi\nNation Land, which, in contrast, suffers from low productivity and investment.\nThis dual nature of the Swazi economy, with high productivity in textile\nmanufacturing and in the industrialized agricultural title deed lands on the\none hand, and declining productivity subsistence agriculture on Swazi Nation\nLand on the other, may well explain the country's overall low growth, high\ninequality and unemployment.[_citation needed_]",
    "openai_summarised_points": [
      "• Title Deed lands in Eswatini are primarily used for high-value crops such as sugar, forestry, and citrus, characterized by significant levels of investment and irrigation.",
      "• These Title Deed lands exhibit high productivity due to substantial investment and modern agricultural practices.",
      "• The majority of Eswatini’s population, approximately 75 percent, are employed in subsistence agriculture on Swazi Nation Land.",
      "• Swazi Nation Land is marked by low levels of investment and productivity, leading to subsistence farming with limited economic output.",
      "• The dual structure of the Eswatini economy features high productivity sectors, including textile manufacturing and industrialized agricultural Title Deed lands, contrasted with declining productivity in subsistence agriculture on Swazi Nation Land.",
      "• This disparity between productive and less productive sectors is believed to contribute to Eswatini’s overall low economic growth.",
      "• The economic structure also results in high levels of inequality and unemployment within the country.",
      "• The contrasting agricultural systems and land tenure arrangements are central to understanding the economic challenges faced by Eswatini."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:21.729774",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 719,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic growth",
    "text": "Economic growth in Eswatini has lagged behind that of its neighbors. Real GDP\ngrowth since 2001 has averaged 2.8 percent, nearly 2 percentage points lower\nthan growth in other Southern African Customs Union (SACU) member countries.\nLow agricultural productivity in the Swazi nation lands, repeated droughts,\nthe effect of HIV/AIDS, and an overly large[_clarification needed_] and\ninefficient government sector are likely contributing factors. Eswatini's\npublic finances deteriorated in the late 1990s following\nsizeable[_clarification needed_] surpluses a decade earlier. A combination of\ndeclining revenues and increased spending led to significant[_clarification\nneeded_] budget deficits. The considerable[_clarification needed_] spending\nhas not led to more economic growth and has not benefitted the poor to the\nsame extent as regional comparators, although the poverty headcount has\nshifted slightly during the first decade of the 2000s (SHIES 2010). Much of\nthe increased spending has gone to current expenditures related to wages,\ntransfers, and subsidies. The wage bill today[_when?_] constitutes over 15\npercent of GDP and 55 percent of total public spending; these are some of the\nhighest levels on the African continent. The recent[_when?_] rapid growth in\nSACU revenues has, however, reversed the fiscal situation, and a\nsizeable[_clarification needed_] surplus was recorded in 2006/07 and 2012/13.\nSACU revenues today[_when?_] account for over 50 percent of total government\nrevenues. On the positive side, the external debt burden has declined\nmarkedly[_clarification needed_] over the last 20 years,[_when?_] and domestic\ndebt is almost negligible; external debt as a percent of GDP was less than 20\npercent in 2006.",
    "openai_summarised_points": [
      "• Economic growth in Eswatini has lagged behind that of its neighboring countries, with an average real GDP growth of 2.8 percent since 2001, which is nearly 2 percentage points lower than the growth rate of other Southern African Customs Union (SACU) member countries.",
      "• Contributing factors to the slow growth include low agricultural productivity in Swazi lands, recurrent droughts, the impact of HIV/AIDS, and an overly large and inefficient government sector.",
      "• Eswatini's public finances deteriorated in the late 1990s after experiencing sizable budget surpluses a decade earlier, indicating a reversal in fiscal health.",
      "• The decline in revenues coupled with increased government spending led to significant budget deficits, which have persisted despite efforts to stabilize finances.",
      "• Increased government expenditure has not translated into proportional economic growth nor has it significantly benefited the poor, although the poverty headcount ratio experienced slight shifts during the early 2000s (as reported by SHIES 2010).",
      "• A substantial portion of the increased government spending has been allocated to current expenditures, notably wages, transfers, and subsidies.",
      "• The wage bill currently accounts for over 15 percent of GDP and constitutes 55 percent of total public spending, making it one of the highest levels on the African continent.",
      "• Rapid growth in SACU revenues in recent years has reversed the fiscal decline, resulting in a sizeable surplus recorded in the fiscal years 2006/07 and 2012/13.",
      "• SACU revenues now constitute over 50 percent of total government revenues, highlighting the country's dependence on regional revenue sharing.",
      "• Over the past 20 years, Eswatini has seen a marked decline in its external debt burden, with external debt as a percentage of GDP falling below 20 percent in 2006, and domestic debt remaining almost negligible."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:24.791223",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1731,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Trade partners",
    "text": "The Swazi economy is very closely linked to the economy of South Africa, from\nwhich it receives over 90 percent of its imports and to which it sends about\n70 percent of its exports. Eswatini has great resources making a good trading\npartner. Eswatini's other key trading partners are the United States and the\nEU, from whom the country has received trade preferences for apparel exports\n(under the African Growth and Opportunity Act – AGOA – to the US) and for\nsugar (to the EU). Under these agreements, both apparel and sugar exports did\nwell, with rapid growth and a strong inflow of foreign direct investment.\nTextile exports grew by over 200 percent between 2000 and 2005 and sugar\nexports increasing by more than 50 percent over the same period. The continued\nvibrancy of the export sector is threatened by the removal of trade\npreferences for textiles, the accession to similar preferences for East Asian\ncountries, and the phasing out of preferential prices for sugar to the EU\nmarket. Eswatini will thus have to face the challenge of remaining competitive\nin a changing global environment. A crucial factor in addressing this\nchallenge is the investment climate. The recently concluded Investment Climate\nAssessment provides some positive findings in this regard, namely that\nEswatini firms are among the most productive in Sub-Saharan Africa, although\nthey are less productive than firms in the most productive middle-income\ncountries in other regions. They compare more favorably with firms from lower\nmiddle income countries, but are hampered by inadequate governance\narrangements and infrastructure.[_citation needed_]\n\nEswatini, Lesotho, Botswana, Namibia, and the Republic of South Africa form\nthe Southern African Customs Union (SACU), where import duties apply uniformly\nto member countries. Eswatini, Lesotho, Namibia, and South Africa also are\nmembers of the Common Monetary Area (CMA) in which repatriation and\nunrestricted funds are permitted. Eswatini issues its own currency, the Swazi\nlilangeni (plural: emalangeni), which is at par with the South African rand.",
    "openai_summarised_points": [
      "• The economy of Eswatini is highly dependent on South Africa, receiving over 90 percent of its imports from South Africa and exporting approximately 70 percent of its goods to South Africa.",
      "• Eswatini benefits from its abundant resources, making it a significant and advantageous trading partner.",
      "• The country's other major trading partners include the United States and the European Union (EU).",
      "• Eswatini has received trade preferences from these partners, notably under the African Growth and Opportunity Act (AGOA) for apparel exports to the US and for sugar exports to the EU.",
      "• Under these preferential agreements, both apparel and sugar exports experienced significant growth, with apparel exports growing by over 200 percent between 2000 and 2005, and sugar exports increasing by more than 50 percent over the same period.",
      "• The export sector's growth is threatened by the potential removal of trade preferences for textiles, the accession of East Asian countries to similar preferences, and the phasing out of preferential prices for sugar in the EU market.",
      "• Eswatini faces the challenge of maintaining competitiveness in a changing global environment due to these potential trade disruptions.",
      "• An important factor in addressing this challenge is improving the investment climate; a recent Investment Climate Assessment highlighted that Eswatini firms are among the most productive in Sub-Saharan Africa.",
      "• Despite this, Eswatini firms are less productive than firms in the most productive middle-income countries elsewhere but compare favorably with firms from lower middle-income countries.",
      "• The productivity of Eswatini firms is hindered by inadequate governance arrangements and infrastructure.",
      "• Eswatini is a member of the Southern African Customs Union (SACU), along with Lesotho, Botswana, Namibia, and South Africa, where import duties are uniformly applied across member countries.",
      "• Eswatini, Lesotho, Namibia, and South Africa are also part of the Common Monetary Area (CMA), which allows for the repatriation of funds and unrestricted movement of capital.",
      "• Eswatini issues its own currency, the Swazi lilangeni (plural: emalangeni), which is pegged at par with the South African rand."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:30.019705",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2084,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Infrastructure",
    "text": "Eswatini enjoys well-developed road links with South Africa. Eswatini Railways\noperates its railroads that run east to west and north to south. The older\neast–west link, called the Goba line, makes it possible to export bulk goods\nfrom Eswatini through the Port of Maputo in Mozambique. Until recently, most\nof Eswatini's imports were shipped through this port. Conflict in Mozambique\nin the 1980s diverted many Swazi exports to ports in South Africa. A\nnorth–south rail link, completed in 1986, provides a connection between the\nEastern Transvaal (now Mpumalanga) rail network and the South African ports of\nRichards Bay and Durban. From the mid-1980s foreign investment in the\nmanufacturing sector boosted economic growth rates significantly. Since\nmid-1985, the depreciated value of the currency has increased the\ncompetitiveness of Swazi exports and moderated the growth of imports,\ngenerating trade surpluses. During the 1990s, the country often ran small\ntrade deficits.[_citation needed_]",
    "openai_summarised_points": [
      "• Eswatini has well-developed road infrastructure with strong connectivity to South Africa.",
      "• Eswatini Railways operates the country's rail network, which runs in both east–west and north–south directions.",
      "• The older east–west rail link, known as the Goba line, facilitates the export of bulk goods from Eswatini through the Port of Maputo in Mozambique.",
      "• Historically, most of Eswatini's imports were shipped via the Port of Maputo until recent years.",
      "• The Mozambique conflict in the 1980s caused many Swazi exports to be diverted to South African ports.",
      "• A north–south rail link, completed in 1986, connects the Eastern Transvaal (currently Mpumalanga) rail network with South African ports of Richards Bay and Durban.",
      "• Foreign investment in Eswatini's manufacturing sector increased significantly from the mid-1980s, contributing to higher economic growth rates.",
      "• Since mid-1985, the depreciation of the Swazi currency has enhanced the competitiveness of Swazi exports.",
      "• The currency depreciation has also moderated the growth of imports, leading to trade surpluses.",
      "• During the 1990s, Eswatini frequently experienced small trade deficits, indicating periods where imports exceeded exports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:32.993963",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 995,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Sugar industry",
    "text": "Eswatini is the fourth largest producer of sugar in Africa and is 25th in\nproduction in the world. This demonstrates the immense focus of the industry\nin order to continue to grow their economy. Eswatini's GDP was $8.621 billion\n(US dollars) in 2014 based on purchasing power parity and of that 7.2% of that\nis from the agriculture sector and of that sector, sugarcane and sugar\nproducts have the largest impact on GDP. According to the World CIA Factbook,\nwood pulp and sugarcane were the largest exports of Eswatini until the wood\npulp producer closed in January 2010. This left the sugarcane industry as the\nsole main export. The largest company that produces sugar in Eswatini is the\nRoyal Eswatini Sugar Corporation (RES Corporation) and it produces a little\nunder two-thirds of total sugar in the country and produces over 3,000 jobs\nfor the people of Eswatini. The RES Corporation is composed of two main sugar\nmill producers, Mhlume and Simunye, which produce a combined 430,000 tons of\ncane per season. The second largest sugarcane company is Ubombo Sugar Limited\nwhich has grown from producing 5,600 tons in 1958 to approximately 230,000\ntons of sugar annually. The third largest sugarcane producer is the Tambankulu\nEstate (largest independent sugar estate) and it produces 62,000 tons of sugar\nannually on 3,816 hectares of land.\n\nThe largest export partners of Eswatini and the larger Southern African\nDevelopment Community (SADC) is the European Union. The SADC is a group of\nmany southern African countries who have banded together in order to try to\nimprove their individual socioeconomic status. In 2014-2015 the sugar\nproduction of Eswatini was 680,881 metric tons and of this about 355,000\nmetric tons of sugar was shipped to the European Union, larger than any other\nexport partner. Another trade partner for Eswatini was the United States where\nthey shipped 34,000 metric tons of sugar in the 2014-2015 year under the\nTariff Rate Quota. These numbers are up from past years and continue to rise.\nThe expected output based on the 2015-2016 post forecast predictions are that\nEswatini will produce 705,000 metric tons, a new record for the country that\ncan be attributed to an increase in land being available for sugar\ncultivation. Of this predicted figure about 390,000 metric tons will go to the\nEuropean Union as part of a new Economic Partnership Agreement (EPA). This new\nagreement between the EU and SADC means that members like Eswatini can sell\ntheir sugar on a duty-free and quota-free basis.\n\nThe quotas that the EU and the United States fill is similar to the Sugar\nProtocol which began in 1975. The goal of the Sugar Protocol was for the EU to\npurchase and import specific quantities from countries in Africa, the\nCaribbean and the Pacific. These prices and quantities guaranteed production\nand were well above the world price, which translated into substantial profits\nfor these mostly impoverished countries. This agreement reached an end in 2009\nbecause the EU could no longer support the pre-determined demands. The Sugar\nProtocol came to an immediate end and was replaced with separate Economic\nPartnerships with the varying countries and regions. Even though the demands\nwill be just as high as under the Sugar Protocol, the prices will drop\nsignificantly. In the case of Eswatini, they have received good reassurance\nthat their product will still be bought by the EU.",
    "openai_summarised_points": [
      "• Eswatini is the fourth largest producer of sugar in Africa and ranks 25th globally in sugar production, highlighting the industry's significant role in the country's economic growth.",
      "• The country's GDP was valued at $8.621 billion USD in 2014 based on purchasing power parity (PPP), with 7.2% of this GDP derived from the agriculture sector, where sugarcane and sugar products have the largest economic impact.",
      "• According to the CIA World Factbook, wood pulp and sugarcane were Eswatini’s primary exports until the closure of the wood pulp producer in January 2010, leaving sugarcane as the sole major export commodity.",
      "• The Royal Eswatini Sugar Corporation (RES Corporation) is the largest sugar producer in the country, accounting for just under two-thirds of total sugar production and providing over 3,000 jobs to Eswatini’s population.",
      "• RES Corporation comprises two main sugar mills, located in Mhlume and Simunye, which together produce approximately 430,000 tons of sugarcane per season.",
      "• Ubombo Sugar Limited is the second-largest sugarcane producer, having expanded from producing 5,600 tons in 1958 to approximately 230,000 tons of sugar annually.",
      "• The third largest sugarcane producer is Tambankulu Estate, the largest independent sugar estate, which produces 62,000 tons of sugar annually on 3,816 hectares of land.",
      "• The European Union (EU) is Eswatini’s largest export partner within the Southern African Development Community (SADC), which is a regional group of southern African countries aiming to improve socioeconomic conditions collectively.",
      "• During 2014-2015, Eswatini produced 680,881 metric tons of sugar, with about 355,000 metric tons exported to the EU, making it the largest export destination for Eswatini’s sugar.",
      "• The United States was another significant trade partner, with Eswatini exporting 34,000 metric tons of sugar in the 2014-2015 fiscal year under the Tariff Rate Quota system.",
      "• Sugar exports from Eswatini are increasing, with projections for 2015-2016 indicating a record high production of approximately 705,000 metric tons, driven by increased land availability for cultivation.",
      "• Of the projected 705,000 metric tons for 2015-2016, about 390,000 metric tons are expected to be exported to the EU under a new Economic Partnership Agreement (EPA), which allows duty-free and quota-free access for Eswatini’s sugar.",
      "• The EU and the United States historically filled quotas similar to the Sugar Protocol initiated in 1975, which guaranteed specific import quantities and prices for African, Caribbean, and Pacific countries, ensuring above-world market prices and substantial profits for these nations.",
      "• The Sugar Protocol ended in 2009 because the EU could no longer sustain the pre-determined demands, leading to the replacement with separate Economic Partnerships that maintain high demand but significantly lower prices for sugar.",
      "• Despite the end of the Sugar Protocol, Eswatini has received assurances that its sugar will continue to be purchased by the EU under the new agreements, maintaining its export market stability."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:41.187681",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3406,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Mining",
    "text": "Currently, Eswatini's mineral sector is governed under a policy drawn up prior\nto Eswatini's independence. In response to the sector's recent decline, a new\nmining policy is being drafted by consultants, paid for by a grant from China,\nand legislation to facilitate small-scale mining has also been proposed.\n\nThe country's main source of foreign exchange is the Bulembu asbestos mine,\nhowever production has hit a steep decline. Diamond, iron ore and gold have\nalso been found in the past, however a lack of investment and development\npolicy has seen the region's potential falter.\n\nAlthough fewer than 1,000 Swazis are directly employed in the mining sector,\nmany workers from Eswatini processed timber from the country's extensive pine\npopulations for mines in South Africa, and around 10,000–15,000 Swazis were\nemployed in South African mines. Their contributions to Eswatini's economy\nthrough wage repatriation have been diminished, though, by the collapse of the\ninternational gold market and layoffs in South Africa.",
    "openai_summarised_points": [
      "• Eswatini's mineral sector is currently governed by a policy established prior to the country's independence, indicating outdated regulatory frameworks.",
      "• In response to recent declines in the mineral sector, a new mining policy is under development, with consultants being paid for by a grant from China, highlighting international involvement and support.",
      "• Legislation aimed at facilitating small-scale mining has also been proposed to potentially revitalize the sector and promote local participation.",
      "• The Bulembu asbestos mine serves as the country's primary source of foreign exchange; however, its production has experienced a significant decline, impacting national revenue.",
      "• Historically, Eswatini has been known to possess deposits of diamonds, iron ore, and gold, but these resources have not been fully exploited due to insufficient investment and underdeveloped policies.",
      "• The lack of investment and effective development policies has hindered the realization of the region’s mineral potential, leading to underperformance in resource extraction.",
      "• Fewer than 1,000 Swazis are directly employed within the formal mining sector, indicating limited local employment opportunities in mining activities.",
      "• Many Swazi workers have historically processed timber from Eswatini’s extensive pine forests for mines located in South Africa, demonstrating regional economic interdependence.",
      "• An estimated 10,000 to 15,000 Swazis were employed in South African mines, contributing to Eswatini's economy through wage remittances.",
      "• The contribution of Swazi workers to the national economy has diminished due to the collapse of the international gold market and subsequent layoffs in South African mining industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:00:45.587966",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1023,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Eswatini",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Other economic statistics",
    "text": "The following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 0.90  | 1,653  | 0.75  | −3.8 %  | 18.2%  | ...\n1985  | 1.50  | 2,359  | 0.50  | 3.8%  | 20.5%  | ...\n1990  | 2.95  | 3,793  | 1.24  | 8.9%  | 13.1%  | ...\n1995  | 3.84  | 4,421  | 1.93  | 4.0%  | 12.3%  | 12%\n2000  | 4.83  | 5,033  | 1.74  | 2.6%  | 12.2%  | 17%\n2005  | 6.52  | 6,537  | 3.18  | 5.5%  | 1.8%  | 13%\n2006  | 7.06  | 7,000  | 3.29  | 5.2%  | 5.2%  | 14%\n2007  | 7.54  | 7,387  | 3.47  | 3.9%  | 8.1%  | 15%\n2008  | 7.90  | 7,658  | 3.30  | 2.8%  | 12.7%  | 14%\n2009  | 8.32  | 7,978  | 3.60  | 4.5%  | 7.4%  | 10%\n2010  | 8.72  | 8,268  | 4.44  | 3.5%  | 4.5%  | 14%\n2011  | 9.07  | 8,502  | 4.83  | 2.0%  | 6.1%  | 14%\n2012  | 9.56  | 8,853  | 4.89  | 3.5%  | 8.9%  | 15%\n2013  | 10.18  | 9,317  | 4.60  | 3.5%  | 5.6%  | 15%\n2014  | 10.74  | 9,712  | 4.43  | 3.6%  | 5.7%  | 14%\n2015  | 10.97  | 9,807  | 4.06  | 1.0%  | 5.0%  | 18%\n2016  | 11.11  | 9,814  | 3.82  | 0.0%  | 8.0%  | 25%\n2017  | 11.34  | 9,884  | 4.41  | 0.2%  | 6.3%  | 29%\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ 1.6%\n_highest 10%:_ 40.7% (2001)\n\n**Industrial production growth rate:** 1% (2001 est.)\n\n**Electricity – production:** 470 GWh (2008), 420 GWh (1998)\n\n**Electricity – consumption:** 1,207 GWh (2008), 962.9 GWh (2001), 1.078 GWh\n(1998)\n\n**Electricity – exports:** 0 kWh (2009, 2001, 1998)\n\n**Electricity – imports:** 768 GWh (2009), 639 GWh (2001), 687 GWh (1998)\n_note:_ imports about 60% of its electricity from South Africa (2009)\n\n**Currency:** 1 lilangeni (E) = 100 cents\n\n**Exchange rates:** emalangeni (E) per US$1 – 7.3 (2011), 7.32 (2010), 8.42\n(2009), 7.75 (2008), 7.4 (2007), 10.5407 (2002), 8.6092 (2001), 6.9398 (2000),\n6.1087 (1999), 5.4807 (1998), 4.6032 (1997), 4.2706 (1996), 3.6266 (1995);\nnote – the lilangeni is at par with the South African rand",
    "openai_summarised_points": [
      "• The section presents a comprehensive overview of Eswatini's main economic indicators from 1980 to 2017, highlighting trends and changes over nearly four decades.",
      "• In 1980, Eswatini's GDP measured approximately 0.90 billion US dollars in Purchasing Power Parity (PPP), with a GDP per capita of 1,653 US dollars PPP, and a nominal GDP of 0.75 billion US dollars.",
      "• The economy experienced a decline in 1980 with a real GDP growth rate of -3.8%, accompanied by an inflation rate of 18.2%.",
      "• By 1985, GDP increased to 1.50 billion US dollars PPP, with a per capita income of 2,359 US dollars PPP, and a nominal GDP of 0.50 billion US dollars, reflecting economic growth.",
      "• The GDP growth rate in 1985 was positive at 3.8%, and inflation rose slightly to an unspecified percentage, with government debt at 20.5% of GDP.",
      "• In 1990, GDP further increased to 2.95 billion US dollars PPP, with a per capita income of 3,793 US dollars PPP, and a nominal GDP of 1.24 billion US dollars, with a significant real GDP growth of 8.9%.",
      "• Inflation in 1990 was 13.1%, and government debt decreased to 13.1% of GDP.",
      "• The mid-1990s saw continued growth: in 1995, GDP reached 3.84 billion US dollars PPP, with a per capita income of 4,421 US dollars PPP, and a nominal GDP of 1.93 billion US dollars; GDP growth was 4.0%, and government debt was 12.3%.",
      "• By 2000, GDP was 4.83 billion US dollars PPP, with a per capita income of 5,033 US dollars PPP, and a nominal GDP of 1.74 billion US dollars; growth slowed to 2.6%, with government debt at 12.2%.",
      "• The period from 2005 to 2008 shows steady economic expansion: in 2005, GDP was 6.52 billion US dollars PPP, with a per capita income of 6,537 US dollars PPP, and a nominal GDP of 3.18 billion US dollars; GDP growth was 5.5%, and government debt was 1.8%.",
      "• In 2006, GDP increased to 7.06 billion US dollars PPP, with a per capita income of 7,000 US dollars PPP, and a nominal GDP of 3.29 billion US dollars; growth was 5.2%, government debt at 5.2%.",
      "• The 2007 data shows GDP at 7.54 billion US dollars PPP, with a per capita income of 7,387 US dollars PPP, and a nominal GDP of 3.47 billion US dollars; GDP growth was 3.9%, government debt at 8.1%.",
      "• In 2008, GDP reached 7.90 billion US dollars PPP, with a per capita income of 7,658 US dollars PPP, and a nominal GDP of 3.30 billion US dollars; growth slowed to 2.8%, with government debt at 12.7%.",
      "• The 2009 figures show GDP at 8.32 billion US dollars PPP, with a per capita income of 7,978 US dollars PPP, and a nominal GDP of 3.60 billion US dollars; GDP growth was 4.5%, government debt decreased to 7.4%.",
      "• By 2010, GDP increased to 8.72 billion US dollars PPP, with a per capita income of 8,268 US dollars PPP, and a nominal GDP of 4.44 billion US dollars; growth was 3.5%, government debt at 4.5%.",
      "• In 2011, GDP was 9.07 billion US dollars PPP, with a per capita income of 8,502 US dollars PPP, and a nominal GDP of 4.83 billion US dollars; GDP growth slowed to 2.0%, government debt at 6.1%.",
      "• The 2012 data indicates GDP at 9.56 billion US dollars PPP, with a per capita income of 8,853 US dollars PPP, and a nominal GDP of 4.89 billion US dollars; growth was 3.5%, government debt at 8.9%.",
      "• In 2013, GDP reached 10.18 billion US dollars PPP, with a per capita income of 9,317 US dollars PPP, and a nominal GDP of 4.60 billion US dollars; GDP growth was 3.5%, government debt at 5.6%.",
      "• The 2014 figures show GDP at 10.74 billion US dollars PPP, with a per capita income of 9,712 US dollars PPP, and a nominal GDP of 4.43 billion US dollars; growth was 3.6%, government debt at 5.7%.",
      "• In 2015, GDP was 10.97 billion US dollars PPP, with a per capita income of 9,807 US dollars PPP, and a nominal GDP of 4.06 billion US dollars; growth slowed to 1.0%, government debt increased to 5.0%.",
      "• The 2016 data shows GDP at 11.11 billion US dollars PPP, with a per capita income of 9,814 US dollars PPP, and a nominal GDP of 3.82 billion US dollars; GDP growth was 0.0%, government debt at 8.0%.",
      "• In 2017, GDP reached 11.34 billion US dollars PPP, with a per capita income of 9,884 US dollars PPP, and a nominal GDP of 4.41 billion US dollars; GDP growth was 0.2%, and government debt rose to 29%.",
      "• Household income or consumption distribution indicates that in 2001, the lowest 10% held 1.6% of household income or consumption, while the highest 10% held 40.7%.",
      "• Industrial production growth rate was estimated at 1% in 2001.",
      "• Electricity production was 470 GWh in 2008, up from 420 GWh in 1998, reflecting growth in energy output.",
      "• Electricity consumption increased from 962.9 GWh in 2001 to 1,078 GWh in 1998, and further to 1,207 GWh in 2008.",
      "• Electricity exports were zero kilowatt-hours in 2009, 2001, and 1998, indicating no electricity exports during these years.",
      "• Electricity imports were 768 GWh in 2009, 639 GWh in 2001, and 687 GWh in 1998, with about 60% of imports sourced from South Africa as of 2009.",
      "• The national currency is the lilangeni (E), subdivided into 100 cents.",
      "• Exchange rates fluctuated over the years, with the lilangeni pegged at par with the South African rand; notable rates include 7.3 emalangeni per US dollar in 2011, 7.32 in 2010, 8.42 in 2009, and 6.9398 in 2000.",
      "• Other exchange rates include 10.5407 in 2002, 8.6092 in 2001, 6.1087 in 1999, and 4.6032 in 1997, reflecting currency stability and fluctuations over time."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:01:09.038495",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2077,
      "bullet_points_count": 31
    }
  }
]