[
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Historical GDP per capita development\n\nThe **economy of Uruguay** features an export-oriented agricultural sector and\na well-educated workforce, along with high levels of social spending. Tourism\nand banking are also prominent sectors; Uruguay acts as a regional hub for\ninternational finance and tourism. The country also has a history and\nrepresentation of advanced workers-rights protection, with unions and the\neight-hour work-day protected at the beginning of the 20th century.\n\n90% of the country's population is urbanized, while most of the industry and\nover half of the population is concentrated in the capital Montevideo.\n\nAfter averaging growth of 5% annually during 1996–98, Uruguay's economy\nsuffered a major downturn in 1999–2002, stemming largely from the spillover\neffects of the economic problems of its large neighbors; Argentina and Brazil.\nIn 2001–02, Argentine citizens made massive withdrawals of dollars deposited\nin Uruguayan banks after bank deposits in Argentina were frozen, which led to\na plunge in the Uruguayan peso, causing the 2002 Uruguay banking crisis.",
    "openai_summarised_points": [
      "• The economy of Uruguay is characterized by an export-oriented agricultural sector and a well-educated workforce, supported by high levels of social spending.",
      "• Key economic sectors in Uruguay include tourism and banking, with the country serving as a regional hub for international finance and tourism.",
      "• Uruguay has a historical tradition of advanced workers’ rights protections, including strong union representation and the establishment of the eight-hour workday at the beginning of the 20th century.",
      "• Approximately 90% of Uruguay’s population is urbanized, with the majority of industry and over half of the population concentrated in the capital city, Montevideo.",
      "• Between 1996 and 1998, Uruguay experienced an average annual economic growth rate of 5%.",
      "• From 1999 to 2002, Uruguay’s economy underwent a significant downturn primarily due to the spillover effects of economic crises in its neighboring countries, Argentina and Brazil.",
      "• During 2001–2002, a banking crisis occurred in Uruguay when Argentine citizens withdrew large amounts of dollars from Uruguayan banks following the freezing of bank deposits in Argentina.",
      "• The massive withdrawals by Argentines led to a sharp depreciation of the Uruguayan peso, culminating in the 2002 Uruguay banking crisis."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:28.014479",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1087,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "19th century",
    "text": "In the 19th century, the country had similar characteristics to other Latin\nAmerican countries: caudillismo, civil wars and permanent instability (40\nrevolts between 1830 and 1903), foreign capitalism's control of important\nsectors of the economy, a high percentage of illiterate people (more than half\nthe population in 1900). Among foreign investments, investors from Great\nBritain controlled 22% of the land and many majors parts of the industrial\ninfrastructure, including meatpacking and leather industry, infrastructure for\nwater and gas, and transport systems like trolley and 1100 miles of rail.\n\nIn 1857, the first nationally owned bank, Banco Comercial, was founded.",
    "openai_summarised_points": [
      "• In the 19th century, Uruguay exhibited characteristics common to many Latin American countries, including caudillismo (strongman rule), frequent civil wars, and ongoing political instability, evidenced by 40 revolts occurring between 1830 and 1903.",
      "• Foreign capitalism exerted significant control over key sectors of Uruguay's economy during this period, influencing the development and ownership of major industries and infrastructure.",
      "• Illiteracy was a major social issue, with more than half of Uruguay's population being illiterate by the year 1900.",
      "• British investors were prominent among foreign capitalists, owning approximately 22% of Uruguay’s land and controlling significant portions of the country's industrial infrastructure.",
      "• British investments extended to critical industries such as meatpacking and the leather industry, as well as essential utilities including water and gas services.",
      "• The British also dominated transportation infrastructure, owning trolley systems and approximately 1,100 miles of railway lines within Uruguay.",
      "• In 1857, Uruguay established its first nationally owned bank, the Banco Comercial, marking a significant development in the country’s financial sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:25.123774",
      "openai_model": "gpt-4.1-mini",
      "content_length": 676,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Reforms after Batlle",
    "text": "José Batlle y Ordóñez, President from 1903 to 1907 and again from 1911 to\n1915, set the pattern for Uruguay's modern political development and dominated\nthe political scene until he died in 1929. Batlle introduced widespread\npolitical, social, and economic reforms such as a welfare program, government\nparticipation in many facets of the economy, and a new constitution.\n\nBatlle nationalized foreign-owned companies and created a modern social\nwelfare system. Income tax for lower incomes was abolished in 1905, secondary\nschools established in every city (1906), telephone network nationalized,\nunemployment benefits were introduced (1914), eight-hour working day\nintroduced (1915), etc. By 1929, 84% of manufacturing was concentrated in a\nhandful of industries: meatpacking, leather and wool. Industrial policies\nfurther encouraging migration from rural to urban communities, as well as\nwaves of immigrants from southern and eastern Europe. Investment in urban\ninfrastructure in Montevideo and a growing economy, was capped by hosting the\nfirst 1930 FIFA World Cup.\n\nClaudio Williman who served between Batlle's two terms was his supporter and\ncontinued all his reforms, as did the next President Baltasar Brum\n(1919–1923). Around 1900 infant mortality rates (IMR) in Uruguay were among\nthe world's lowest, indicating a very healthy population.\n\nUruguay was hit hard by the Great Depression, ending an era of export-led\neconomic growth."
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Mid-20th century",
    "text": "The Uruguay economy shifted from an agriculture-dominated economy to an\nindustrial economy from the period 1930 to 1955. This shift led to a sluggish\neconomy, as Uruguay neglected its comparative advantage, diverting resources\naway from a productive agricultural sector to an inefficient, unproductive\nmanufacturing sector. The government sought to bolster its manufacturing\nsector with import substitution industrialization, disincentivizing imports.\nFrom the 1950s onwards, the Uruguay economy was in decline.\n\nAnthropology professor Daniel Renfrew describes both the 50s and 60s and\ndictatorship period (70s and 80s) as economic downturn periods, followed by\nfurther economic degradation caused by neoliberalism. Economist Jamie Mezzera\ndisagrees with this interpretation, arguing that between 1968 and 1972,\nUruguay was one of the most regulated capitalist economies in the world. In\nthis period, the government massively increased import tariffs and had near-\ntotal wage and price controls. The government instituted these policies to\navoid the political pressure that would come if they were to devalue their\ncurrency. Between 1955 and 1972, economic output in Uruguay stagnated. After\nthe price and wage controls were largely removed in 1973, growth increased by\n4.3% per year until 1979.\n\nThe policies of the Colorado Party under Julio María Sanguinetti and Jorge\nBatlle during the 90s and early 2000s, following global trends of neo-\nliberalization, facilitated a shift from manufacturing and small-scale\nagriculture, towards increasing monoculture agriculture and services like\nfinance and tourism. However, these policies faded as the regional economic\nproblems in Argentina and Brazil caused a downturn and unemployment from 1998\nto 2003. The economic and social crises that followed allowed for the election\nof the Broad Front a leftist coalition against the neoliberal policies.",
    "openai_summarised_points": [
      "• Between 1930 and 1955, Uruguay's economy transitioned from being agriculture-dominated to industrial, resulting in a sluggish economic performance due to neglecting its comparative advantage in agriculture and diverting resources to an inefficient manufacturing sector.",
      "• The Uruguayan government implemented import substitution industrialization policies during this period, aiming to strengthen the manufacturing sector by disincentivizing imports.",
      "• From the 1950s onward, Uruguay experienced economic decline.",
      "• Anthropology professor Daniel Renfrew characterizes the 1950s, 1960s, and the dictatorship period of the 1970s and 1980s as times of economic downturn, followed by further economic degradation attributed to neoliberalism.",
      "• Economist Jamie Mezzera contests Renfrew’s view, asserting that between 1968 and 1972, Uruguay was among the most regulated capitalist economies globally, with the government imposing massive increases in import tariffs and near-total wage and price controls.",
      "• These regulatory policies were instituted to avoid political pressure that would arise from currency devaluation.",
      "• From 1955 to 1972, Uruguay’s economic output stagnated.",
      "• After the removal of most price and wage controls in 1973, Uruguay’s economic growth accelerated to an average of 4.3% per year until 1979.",
      "• During the 1990s and early 2000s, the Colorado Party, led by Julio María Sanguinetti and Jorge Batlle, pursued neoliberal policies aligned with global trends, facilitating a shift away from manufacturing and small-scale agriculture toward monoculture agriculture and service sectors such as finance and tourism.",
      "• These neoliberal policies lost momentum due to regional economic problems in Argentina and Brazil, which caused an economic downturn and rising unemployment in Uruguay from 1998 to 2003.",
      "• The ensuing economic and social crises contributed to the election of the Broad Front, a leftist coalition opposing neoliberal policies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:25.534298",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1892,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Currency",
    "text": "Uruguay has a partially dollarized economy. As of August 2008[update] almost\n60% of bank loans use United States dollars, but most transactions use the\nUruguayan peso. Today, the Uruguayan peso is minted in coins of 1, 2, 5, 10,\nand 50 pesos and in banknotes of 20, 50, 100, 200, 500, 1000, and 2000 pesos.",
    "openai_summarised_points": [
      "• Uruguay operates a partially dollarized economy, indicating the coexistence of the Uruguayan peso and the United States dollar in financial transactions.",
      "• As of August 2008, approximately 60% of bank loans in Uruguay were denominated in United States dollars, reflecting significant reliance on the dollar for credit.",
      "• Despite the prevalence of dollar-denominated loans, the majority of everyday transactions in Uruguay are conducted using the Uruguayan peso.",
      "• The Uruguayan peso is currently minted in coin denominations of 1, 2, 5, 10, and 50 pesos, facilitating small-value transactions.",
      "• Banknotes of the Uruguayan peso are issued in denominations of 20, 50, 100, 200, 500, 1000, and 2000 pesos, supporting a wide range of monetary exchanges."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:26.458256",
      "openai_model": "gpt-4.1-mini",
      "content_length": 306,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture, textiles and leather",
    "text": "Throughout Uruguay's history, their strongest exporting industries have been\nbeef and wool. In the case of beef exports, they have been boosted since\nUruguay joined the Mercosur agreement in 1991 and the country has been able\ntrade with more distant markets, such as Japan. In 2018, it produced 589\nthousand tons of beef. In the case of wool exports, they have not been doing\nso well in recent years suffering from other competitors in the market like\nNew Zealand and the fluctuations of its demand during the 2008 recession in\nthe developed world.\n\nAs timber refining is being kept within the country, forestry has become a\ngrowth industry in recent years. In 2018, the country produced 1.36 million\ntons of rice, 1.33 million tons of soy, 816 thousand tons of maize, 637\nthousand tons of barley, 440 thousand tons of wheat, 350 thousand tons of\nsugar cane, 106 thousand tons of orange, 104 thousand tons of grape, 90\nthousand tons of rapeseed, 87 thousand tons of potato, 76 thousand tons of\nsorghum, 71 thousand tons of tangerine, 52 thousand tons of oats, 48 thousand\ntons of apple, in addition to smaller yields of other agricultural products.\n\nLiebig Extract of Meat Company ran a very large and influential beef extract\nfactory in Fray Bentos for 100 years.",
    "openai_summarised_points": [
      "• Throughout Uruguay's history, the country's strongest exporting industries have been beef and wool, forming the backbone of its agricultural export economy.",
      "• Uruguay's beef exports have significantly benefited since the country joined the Mercosur trade agreement in 1991, enabling access to more distant markets, including Japan.",
      "• In 2018, Uruguay produced 589 thousand tons of beef, reflecting the continued importance of this sector to the national economy.",
      "• Wool exports from Uruguay have faced challenges in recent years due to increased competition from countries such as New Zealand and demand fluctuations caused by the 2008 recession in developed economies.",
      "• Forestry has emerged as a growth industry in Uruguay in recent years, partly because timber refining processes are maintained domestically, adding value within the country.",
      "• In 2018, Uruguay's agricultural production included: 1.36 million tons of rice, 1.33 million tons of soy, 816 thousand tons of maize, 637 thousand tons of barley, 440 thousand tons of wheat, 350 thousand tons of sugar cane, 106 thousand tons of oranges, 104 thousand tons of grapes, 90 thousand tons of rapeseed, 87 thousand tons of potatoes, 76 thousand tons of sorghum, 71 thousand tons of tangerines, 52 thousand tons of oats, and 48 thousand tons of apples, alongside smaller quantities of other agricultural products.",
      "• The Liebig Extract of Meat Company operated a large and influential beef extract factory in Fray Bentos, Uruguay, for a century, marking a significant historical industrial presence in the country's meat processing sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:29.375474",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1264,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Energy",
    "text": "Wind turbines in Tacuarembó DepartmentEnergy in Uruguay describes energy and\nelectricity production, consumption and import in Uruguay. As part of climate\nmitigation measures and an energy transformation, Uruguay has converted over\n98% of its electrical grid to sustainable energy sources (primarily solar,\nwind, and hydro). Fossil fuels are primarily imported into Uruguay for\ntransportation, industrial uses and applications like domestic cooking. Four\nhydroelectric dams provide much of the country's energy supply.",
    "openai_summarised_points": [
      "• Uruguay’s energy sector encompasses the production, consumption, and importation of energy and electricity within the country.",
      "• As a significant component of its climate mitigation strategy and energy transformation efforts, Uruguay has successfully converted over 98% of its electrical grid to sustainable energy sources.",
      "• The primary sustainable energy sources contributing to Uruguay’s electrical grid are solar power, wind power, and hydroelectric power.",
      "• Fossil fuels in Uruguay are mainly imported and utilized for transportation purposes, industrial applications, and domestic cooking.",
      "• The country’s energy supply is substantially supported by four hydroelectric dams, which provide a large portion of Uruguay’s electricity.",
      "• Wind turbines are notably present in the Tacuarembó Department, indicating regional investment in wind energy infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:29.219387",
      "openai_model": "gpt-4.1-mini",
      "content_length": 518,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Software",
    "text": "During the last decades the software industry has developed considerably. Many\nstart-ups have been very successful, such is the case of PedidosYa and DLocal.\nUruguay also exports software; the similar geographic longitude to that of the\nUnited States makes it attractive for companies to outsource software\ndevelopment to Uruguayan companies. Other notable Uruguayan software\nenterprises are: Genexus, Códigos del Sur, Overactive.",
    "openai_summarised_points": [
      "• Over the last several decades, Uruguay's software industry has experienced significant development and growth.",
      "• Numerous start-ups originating in Uruguay have achieved considerable success, with PedidosYa and DLocal being prominent examples.",
      "• Uruguay is an exporter of software services, leveraging its geographic longitude, which closely aligns with that of the United States, making it an attractive destination for companies seeking to outsource software development.",
      "• Additional notable Uruguayan software companies include Genexus, Códigos del Sur, and Overactive, highlighting the diversity and strength of the national software sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:27.168771",
      "openai_model": "gpt-4.1-mini",
      "content_length": 430,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Mining",
    "text": "Although this is a sector that does not make substantial contributions to the\ncountry's economy, in recent years there has been some activity in gold and\ncement production, and also in the extraction of granite.\n\nArtigas Department is well known for its amethyst and agate quartz varieties\nmining. During 2010s 20 thousand tons of minerals were extracted with a value\nof 9 million of US dollars, exported to Germany, United States, Brazil and\nChina."
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Plastics",
    "text": "In 2011, plastics were the second-largest non-agricultural industrial export\nof the country.",
    "openai_summarised_points": [
      "• In 2011, plastics constituted the second-largest non-agricultural industrial export of Uruguay."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:27.879151",
      "openai_model": "gpt-4.1-mini",
      "content_length": 92,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Telecommunications",
    "text": "Despite having poor levels of investment in the fixed-line sector, the small\nsize of Uruguay's population has enabled them to attain one of the highest\ntelecommunication density levels in South America and reach a 100%\ndigitalization of main lines. Although the telecommunications sector has been\nunder a state monopoly for some years, provisions have been made to introduce\nliberalization and to allow for the entry of more firms into the cellular\nsector.[_citation needed_]",
    "openai_summarised_points": [
      "• Uruguay has achieved one of the highest telecommunication density levels in South America despite having poor levels of investment in the fixed-line sector.",
      "• The small size of Uruguay's population has facilitated reaching a 100% digitalization of main telephone lines.",
      "• The telecommunications sector in Uruguay has been under a state monopoly for several years.",
      "• Provisions have been made to introduce liberalization in the telecommunications sector.",
      "• These provisions aim to allow the entry of more firms into the cellular telecommunications market."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:30.141385",
      "openai_model": "gpt-4.1-mini",
      "content_length": 475,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Travel and tourism",
    "text": "In 2013, travel and tourism accounted for 9.4% of the country's GDP. Their\ntourist industry is mainly characterized for attracting visitors from\nneighboring countries. Currently Uruguay's major attraction is the interior,\nparticularly located in the region around Punta del Este.",
    "openai_summarised_points": [
      "• In 2013, travel and tourism contributed 9.4% to Uruguay's Gross Domestic Product (GDP), highlighting the sector's significant role in the national economy.",
      "• Uruguay's tourist industry is predominantly characterized by attracting visitors from neighboring countries, indicating a regional focus in its tourism market.",
      "• The primary tourist attraction in Uruguay is the interior region, with particular emphasis on the area surrounding Punta del Este, which is recognized as a major destination within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:27:30.546719",
      "openai_model": "gpt-4.1-mini",
      "content_length": 279,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Specialties",
    "text": "* Cattle were introduced to Uruguay before its independence by Hernando Arias de Saavedra, the Spanish Governor of Buenos Aires in 1603. Beef exports in 2006 amounted to around 37% of Uruguayan exports.\n* Wool is a traditional product exported mainly to America, followed by the UK and India.\n* Milk and dairy products. Conaprole, National Cooperative of Milk Producers is the main exporter of dairy products in Latin America (in 2006). The area of the country dedicated to dairy food is located mainly in the southwest.\n* Rice. Fine varieties are produced in the lowlands in the east of the country close to Merin lake on the Uruguay-Brazil border. The national company Saman claims to be the main exporter in Latin America. Countries it exports to include Brazil, Iran, Peru, South Africa, Chile, Senegal, Argentina, Paraguay, Bolivia, Ecuador, USA, Canada and China.\n* Tourism: Several seaside resorts, like Punta del Este or Punta del Diablo in the south-eastern departments of Maldonado and Rocha, regarded as a jet-set resort in South America, are main attractions of Uruguay. International cruises call at Montevideo from October to March every year. Also, Uruguay hosts many year-round international conferences. (The original GATT Uruguay Round concerning trade was, as its name suggests, hosted in Uruguay). Montevideo is home to the headquarters (secretariat) of [Mercosur], the Common Market of the South, whose full members are Uruguay, Argentina, Brazil, Paraguay and Venezuela, associate members Bolivia, Chile, Colombia, Ecuador and Peru.\n* Software and consulting. Uruguay's well-educated workforce and lower-than-international wages have put Uruguay on the IT map. A product named GeneXus, originally created in Uruguay by a company called ArTech, is noteworthy. Other important developers and consultants include De Larrobla & Asociados, Greycon and Quanam. Tata Consultancy Services has its headquarters for the Spanish speaking world in Uruguay. Many of these companies have established in [1].\n\n> \"With a population of only three million, Uruguay has rapidly become Latin\n> America's outsourcing hub. In partnership with one of India's largest\n> technology consulting firms, engineers in Montevideo work while their\n> counterparts in Mumbai sleep.\" - The New York Times, Sep 22, 2006.\n\n* Banking Services. Banking has traditionally been one of the strongest service export sectors in the country. Uruguay was once dubbed \"the Switzerland of America\", mainly for its banking sector and stability. The largest bank in Uruguay is Banco República, or BROU, which is state-owned; another important state bank is the BHU. Almost 20 private banks, most of the branches of international banks, operate in the country (Banco Santander, ABN AMRO, Citibank, among others). There is also a myriad of brokers and financial-services bureaus, among them Ficus Capital, Galvin Sociedad de Bolsa, Europa Sociedad de Bolsa, Darío Cukier, GBU, Hordeñana & Asociados Sociedad de Bolsa, etc. Uruguay has fully recovered from the financial crisis that caused a run on its banks.[_citation needed_]\n* Public Sector: The state in Uruguay has an important role in the economy, Uruguay resisted the trend of privatization in Utilities and state-owned enterprises in the region. Several Referendums supported the state being in control of the most important utilities and energy companies. Some of the companies have a full monopoly warranted by law (like landline telephony, water), others compete freely with private operators (Insurance, mobile telephony, Banks). Most of them are dominant in the local market. There is strong debate in the Uruguayan society about their role and future. Some of them contributed to the Uruguay state treasury.[_citation needed_]\n* The most important state-owned companies are: Republica AFAP (Pension Fund), AFE (Railways), ANCAP (Energy), ANCO (Mail), Administracion Nacional de Puertos (Ports), ANTEL (Telecommunications: Telephony, Mobiles (ANCEL and Data ANTELDATA)), BHU (Mortgage Bank), BROU (Bank), BSE (Insurance), OSE (Water & Sewage), UTE (Electricity). These companies operate under public law, using a legal entity defined in the Uruguayan Constitution called 'Ente Autonomo' (Meaning Autonomic Entity). The government also owns parts of other companies operating under private law like the National Airline Carrier PLUNA and others owned totally or partially by the CND National Development Corporation.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Trade agreements",
    "text": "**Currently in force (Free Trade Agreements / Economic Complementation\nAgreements)**\n---\nMercosur (signed and effective November 1991)\nECA N.º 36 MERCOSUR with  Bolivia (signed December 1996 and effective February\n1997)\nFTA with  Mexico (signed November 2003 and effective July 2004)\nECAa N.º 59 with  Ecuador (signed October 2004 and effective April 2005)\nECA N.º 58 MERCOSUR with  Peru (signed August 2005 and effective December\n2005)\nECA N.º 62 MERCOSUR with  Cuba (signed July 2006 and effective September 2008)\nComercial Preference Agreement MERCOSUR with  India (signed January 2004 and\neffective June 2009)\nFTA MERCOSUR with  Israel (signed December de 2007 and effective December\n2009)\nPartial Agreement N.º 63 with  Venezuela (signed December 2012 and effective\nMarch 2013)\nComercial Preference Agreement MERCOSUR with SACU (signed September 2011 and\neffective April 2016)\nFTA MERCOSUR with  Egypt (signed December 2015 and effective September 2017)\nECA N.º 72 MERCOSUR with  Colombia (signed July 2017 and effective December\n2017)\nFTA with  Chile signed October 2016 and effective December 2018)\n**Concluded (not in force)**\nFTA MERCOSUR with  State of Palestine (signed December 2011)"
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 10% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 14.8  | 5,050.0  | 12.2  | 4,139.9  | 6.0%  | 63.5%  | n/a  | n/a\n1981  | 16.6  | 5,594.3  | 13.6  | 4,589.0  | 1.9%  | 34.0%  | n/a  | n/a\n1982  | 15.9  | 5,347.4  | 11.1  | 3,727.4  | -9.4%  | 19.0%  | n/a  | n/a\n1983  | 15.6  | 5,198.1  | 6.1  | 2,033.0  | -5.9%  | 49.2%  | 14.5%  | n/a\n1984  | 15.9  | 5,273.5  | 5.8  | 1,920.9  | -1.5%  | 55.3%  | 14.0%  | n/a\n1985  | 16.5  | 5,422.0  | 5.7  | 1,865.1  | 0.3%  | 72.2%  | 13.1%  | n/a\n1986  | 18.0  | 5,912.7  | 7.0  | 2,302.5  | 7.5%  | 76.4%  | 10.1%  | n/a\n1987  | 19.6  | 6,381.1  | 8.8  | 2,864.7  | 5.9%  | 63.6%  | 9.1%  | n/a\n1988  | 20.4  | 6,599.9  | 9.1  | 2,946.4  | 0.5%  | 62.2%  | 8.6%  | n/a\n1989  | 21.4  | 6,896.1  | 9.6  | 3,088.0  | 1.1%  | 80.4%  | 8.0%  | n/a\n1990  | 22.3  | 7,136.0  | 11.2  | 3,573.1  | 0.3%  | 112.5%  | 8.5%  | n/a\n1991  | 23.8  | 7,594.2  | 13.4  | 4,281.1  | 3.5%  | 102.0%  | 8.9%  | n/a\n1992  | 26.3  | 8,333.4  | 15.5  | 4,890.2  | 7.9%  | 68.5%  | 9.0%  | n/a\n1993  | 27.7  | 8,705.4  | 18.0  | 5,659.5  | 2.7%  | 54.1%  | 8.3%  | n/a\n1994  | 30.3  | 9,449.3  | 21.0  | 6,530.0  | 7.3%  | 44.7%  | 9.2%  | n/a\n1995  | 30.5  | 9,448.7  | 23.2  | 7,176.4  | -1.4%  | 42.2%  | 10.3%  | n/a\n1996  | 32.8  | 10,095.7  | 24.6  | 7,580.6  | 5.6%  | 28.3%  | 11.9%  | n/a\n1997  | 35.0  | 10,665.0  | 26.0  | 7,925.9  | 5.0%  | 19.8%  | 11.6%  | n/a\n1998  | 37.0  | 11,183.4  | 27.6  | 8,329.1  | 4.5%  | 10.8%  | 10.1%  | n/a\n1999  | 36.8  | 11,042.6  | 26.1  | 7,814.5  | -1.9%  | 5.7%  | 11.2%  | n/a\n2000  | 36.9  | 11,030.1  | 24.8  | 7,406.0  | -1.9%  | 4.8%  | 13.4%  | n/a\n2001  | 36.3  | 10,837.5  | 22.7  | 6,776.8  | -3.8%  | 4.4%  | 15.2%  | n/a\n2002  | 34.0  | 10,170.0  | 14.8  | 4,425.1  | -7.7%  | 14.0%  | 16.8%  | n/a\n2003  | 35.0  | 10,480.1  | 13.1  | 3,926.7  | 0.8%  | 19.4%  | 17.2%  | n/a\n2004  | 37.7  | 11,289.8  | 14.9  | 4,456.8  | 5.0%  | 9.2%  | 13.3%  | n/a\n2005  | 41.8  | 12,471.6  | 18.9  | 5,638.0  | 7.5%  | 4.7%  | 12.1%  | n/a\n2006  | 44.9  | 13,360.9  | 21.3  | 6,347.3  | 4.1%  | 6.4%  | 10.8%  | n/a\n2007  | 49.1  | 14,616.2  | 25.5  | 7,587.9  | 6.5%  | 8.1%  | 9.4%  | n/a\n2008  | 53.6  | 15,945.2  | 33.0  | 9,808.9  | 7.2%  | 7.9%  | 7.9%  | 46.4%\n2009  | 56.3  | 16,653.9  | 34.4  | 10,181.7  | 4.2%  | 7.1%  | 7.8%  | 46.4%\n2010  | 61.4  | 18,069.7  | 43.8  | 12,899.7  | 7.8%  | 6.7%  | 7.0%  | 40.8%\n2011  | 65.9  | 19,306.8  | 52.3  | 15,331.1  | 5.2%  | 8.1%  | 6.3%  | 41.6%\n2012  | 66.8  | 19,489.1  | 55.6  | 16,213.8  | 3.5%  | 8.1%  | 6.3%  | 49.8%\n2013  | 70.4  | 20,475.3  | 62.1  | 18,049.7  | 4.6%  | 8.6%  | 6.5%  | 50.1%\n2014  | 74.2  | 21,491.9  | 61.9  | 17,908.8  | 3.2%  | 8.9%  | 6.6%  | 50.8%\n2015  | 74.9  | 21,614.5  | 57.4  | 16,565.8  | 0.4%  | 8.7%  | 7.5%  | 57.8%\n2016  | 76.9  | 22,092.5  | 57.2  | 16,448.8  | 1.7%  | 9.6%  | 7.9%  | 55.8%\n2017  | 79.1  | 22,637.3  | 64.4  | 18,431.4  | 1.6%  | 6.2%  | 7.9%  | 56.7%\n2018  | 81.4  | 23,204.0  | 64.3  | 18,338.8  | 0.5%  | 7.6%  | 8.4%  | 58.3%\n2019  | 83.1  | 23,617.2  | 61.0  | 17,341.4  | 0.4%  | 7.9%  | 8.9%  | 61.0%\n2020  | 79.0  | 22,361.7  | 53.7  | 15,208.0  | -6.1%  | 9.8%  | 10.4%  | 68.3%\n2021  | 85.9  | 24,233.1  | 59.3  | 16,735.3  | 4.4%  | 7.7%  | 9.4%  | 65.1%\n2022  | 96.8  | 27,232.8  | 71.2  | 20,017.6  | 5.3%  | 9.1%  | 7.9%  | 61.2%\n2023  | 103.8  | 29,109.3  | 73.0  | 20,463.9  | 3.6%  | 7.8%  | 7.9%  | 62.6%\n2024  | 108.9  | 30,425.7  | 74.8  | 20,919.5  | 2.7%  | 6.4%  | 7.9%  | 63.9%\n2025  | 113.7  | 31,668.3  | 77.6  | 21,620.1  | 2.5%  | 5.8%  | 7.9%  | 64.1%\n2026  | 118.4  | 32,882.5  | 79.6  | 22,122.0  | 2.2%  | 4.5%  | 7.9%  | 64.9%\n2027  | 123.3  | 34,153.7  | 82.0  | 22,710.1  | 2.2%  | 4.5%  | 7.9%  | 64.7%\n\n* **Industrial production growth rate:** 12.6% (2006 est.)\n* **Electricity - production:** 9,474 GWh (1998)\n* _fossil fuel:_ 3.91%\n* _hydro:_ 95.62%\n* _nuclear:_ 0%\n* _other:_ 0.47% (1998)\n* **Electricity - consumption:** 6,526 GWh (1998)\n* **Electricity - exports:** 2,363 GWh (1998)\n* **Electricity - imports:** 78 GWh (1998)\n* **Agriculture - products:** wheat, rice, barley, maize, sorghum; livestock; fish\n* **Exchange rates:** Uruguayan pesos per US dollar - 24.048 (2006), 24.479 (2005), 28.704 (2004), 28.209 (2003), 21.257 (2002)"
  },
  {
    "chapter_name": "Economy of Uruguay",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Uruguay in the world",
    "text": "The following table shows the economic rankings of Uruguay compared to the\nworld:\n\nIndex  | Source  | Rank  | Published\n---|---|---|---\nQuality of Life Index | Numbeo  | 42°  | 2024\nHuman Development Index | UNDP  | 52°  | 2022\nDemocracy Index | _Economist Intelligence Unit_ | 11°  | 2022\nGlobal Peace Index | Vision of Humanity  | 46°  | 2020-2022\nProsperity Index | Legatum  | 37°  | 2021\nCorruption Perceptions Index | Transparency  | 14°  | 2023\nEconomic Freedom Index | Heritage  | 34°  | 2022\nGlobal Competitiveness Report | World Economic Forum  | 54°  | 2019\nCost of Living Index  | Expatistan  | 30°  | 2023\nDebt Rating  | Moodys  | BAA2  | 2021\nS&P  | BBB  | 2017\nFitch  | BBB-  | 2020\nDeveloped Country Recognition  | World Bank  | High Income  | 2023\nUnited Nations  | Very High HDI  | 2021 (2022 report)\nIndex of Geopolitical Gains and Losses after Energy Transition (GeGaLo Index)  | Overland et al.  | 6 out of 156  | 2019"
  }
]