[
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The labour productivity level of Luxembourg is one of the highest in Europe.\nOECD, 2012.\n\nThe **economy ofLuxembourg** is largely dependent on the banking, steel, and\nindustrial sectors. Citizens of Luxembourg enjoy the highest per capita gross\ndomestic product in the world, according to an IMF estimate in 2022. Among\nOECD nations, Luxembourg has a highly efficient and strong social security\nsystem; social welfare expenditure stood at roughly 21.9% of GDP.\n\nPrior to the mid-19th century, Luxembourg was primarily rural and mostly\nisolated from commerce with neighboring economies. In the late 19th century,\nLuxembourg's dominant sector was steel industry. Over time, the main economic\nsector became finance. Due to its reputation for secrecy, it has become an\nattractive location for individuals and businesses to hold assets for tax\navoidance and tax evasion purposes.",
    "openai_summarised_points": [
      "• Luxembourg's labour productivity level is among the highest in Europe, as reported by the OECD in 2012.",
      "• The economy of Luxembourg is predominantly reliant on the banking, steel, and industrial sectors.",
      "• According to an International Monetary Fund (IMF) estimate in 2022, Luxembourg's citizens have the highest per capita gross domestic product (GDP) in the world.",
      "• Luxembourg possesses a highly efficient and robust social security system compared to other OECD nations, with social welfare expenditure accounting for approximately 21.9% of its GDP.",
      "• Before the mid-19th century, Luxembourg was primarily a rural country with limited commercial interaction with neighboring economies.",
      "• In the late 19th century, the steel industry was the dominant economic sector in Luxembourg.",
      "• Over time, the financial sector became the main economic driver of Luxembourg’s economy.",
      "• Luxembourg’s financial sector gained a reputation for secrecy, making it an attractive location for individuals and businesses to hold assets for purposes of tax avoidance and tax evasion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:16:57.015016",
      "openai_model": "gpt-4.1-mini",
      "content_length": 874,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "From 1715 to 1791, Luxembourg was under Austro-Hungarian rule. At the time, it\nwas predominantly rural. It has been described as largely isolated. It had no\nroad connections to Brussels, which limited its ability to trade with\nneighbors. Towards the end of the 18th century, long-distance paved roads were\nconstructed, which integrated Luxembourg with neighboring markets.\n\nThe first land survey in Luxembourg was conducted after a decree by Maria-\nTheresa in 1766. The land survey was part of a broader reform effort to\nabolish certain feudal privileges and encourage more egalitarianism.\n\nFull abolition of feudalism in Luxembourg took place in 1795 when Luxembourg\nwas made part of the French revolutionary regime. It was part of Napoleonic\nFrance until 1815 when the Congress of Vienna gave the Eastern part of\nLuxembourg to Prussia while the remainder formed the Grand Duchy of Luxembourg\nunder Dutch rule. Under Dutch rule, new taxes and customs tariffs were\nintroduced, which harmed commerce in Luxembourg and contributed to it\nremaining a rural country.\n\nThe 1839 Treaty of London divided part of Luxembourg into a province of newly\nindependent Belgium while the remainder became the independent Grand Duchy of\nLuxembourg. During the first half of the 19th century, Luxembourg remained\nrural, although there was an emergence of a textile industry. In the second\nhalf of the 19th century, Luxembourg developed a steel industry, which would\nbecome the dominant sector.",
    "openai_summarised_points": [
      "• From 1715 to 1791, Luxembourg was under Austro-Hungarian rule and was predominantly rural and largely isolated during this period.",
      "• Luxembourg had no road connections to Brussels, which significantly limited its ability to trade with neighboring regions.",
      "• Towards the end of the 18th century, the construction of long-distance paved roads began, integrating Luxembourg with neighboring markets and improving trade opportunities.",
      "• The first land survey in Luxembourg was conducted following a decree by Maria Theresa in 1766, as part of broader reforms aimed at abolishing certain feudal privileges and promoting greater egalitarianism.",
      "• Full abolition of feudalism in Luxembourg occurred in 1795 when Luxembourg became part of the French revolutionary regime.",
      "• Luxembourg remained part of Napoleonic France until 1815, after which the Congress of Vienna divided the territory: the eastern part was given to Prussia, while the remainder formed the Grand Duchy of Luxembourg under Dutch rule.",
      "• Under Dutch administration, new taxes and customs tariffs were introduced, which negatively impacted commerce and contributed to Luxembourg remaining predominantly rural.",
      "• The 1839 Treaty of London further divided Luxembourg, with part becoming a province of the newly independent Belgium, and the remainder continuing as the independent Grand Duchy of Luxembourg.",
      "• During the first half of the 19th century, Luxembourg remained largely rural, although a textile industry began to emerge.",
      "• In the second half of the 19th century, Luxembourg developed a steel industry, which eventually became the dominant sector of its economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:04.592488",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1474,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Sectors",
    "text": "In 2013 the GDP was $60.54 billion of which services, including the financial\nsector, produced 86%. The financial sector comprised 36% of GDP, industry\ncomprised 13.3% and agriculture only 0.3%.",
    "openai_summarised_points": [
      "• In 2013, Luxembourg's Gross Domestic Product (GDP) was valued at $60.54 billion.",
      "• The services sector, which includes the financial sector, accounted for 86% of the GDP in 2013.",
      "• The financial sector alone constituted 36% of Luxembourg's GDP in 2013.",
      "• The industrial sector represented 13.3% of the GDP in the same year.",
      "• Agriculture contributed a minimal 0.3% to Luxembourg's GDP in 2013."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:09.204511",
      "openai_model": "gpt-4.1-mini",
      "content_length": 194,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.0.1",
    "section_name": "Banking",
    "text": "Luxembourg has been part of the eurozone since 1999.\n\nBanking is the largest sector in the Luxembourg economy. In the 2019 Global\nFinancial Centres Index, Luxembourg was ranked as having the 25th most\ncompetitive financial center in the world, and third most competitive in\nEurope after London and Zürich. The country has specialised in the cross-\nborder fund administration business. As Luxembourg's domestic market is\nrelatively small, the country's financial centre is predominantly\ninternational. At the end of March 2009, there were 152 banks in Luxembourg,\nwith over 27,000 employees. Political stability, good communications, easy\naccess to other European centres, skilled multilingual staff, a tradition of\nbanking secrecy and cross-border financial expertise have all contributed to\nthe growth of the financial sector. These factors have contributed to a\nCorruption Perceptions Index of 8.3 and a DAW Index ranking of 10 in 2012; the\nlatter the highest in Europe. Germany accounts for the largest-single grouping\nof banks, with Scandinavian, Japanese, and major US banks also heavily\nrepresented. Total assets exceeded €929 billion at the end of 2008. More than\n9,000 holding companies are established in Luxembourg. The European Investment\nBank—the financial institution of the European Union—is also located there.\n\nLuxembourg enterprises expected negative investment in 2023 due to slowing\neconomic growth and tighter monetary policy. The net balance of enterprises\nanticipating an increase in investment minus those expecting a fall is\nnegative at -4%, far lower than the EU average of 14%.",
    "openai_summarised_points": [
      "• Luxembourg has been a member of the eurozone since 1999, integrating its economy with the euro currency system.",
      "• Banking constitutes the largest sector within Luxembourg's economy, highlighting its critical role in national economic activities.",
      "• In the 2019 Global Financial Centres Index, Luxembourg was ranked as the 25th most competitive financial center globally and the third most competitive in Europe, following London and Zürich.",
      "• The country has developed a specialization in cross-border fund administration, leveraging its strategic position in international finance.",
      "• Due to Luxembourg's relatively small domestic market, its financial center primarily serves an international clientele and market.",
      "• As of the end of March 2009, Luxembourg hosted 152 banks employing over 27,000 individuals, indicating a significant banking workforce.",
      "• Several factors have contributed to the growth of Luxembourg's financial sector, including political stability, effective communications infrastructure, easy access to other European financial centers, a skilled multilingual workforce, a tradition of banking secrecy, and expertise in cross-border financial services.",
      "• These positive attributes have resulted in Luxembourg achieving a Corruption Perceptions Index score of 8.3 and a DAW Index ranking of 10 in 2012, the latter being the highest ranking in Europe.",
      "• Germany represents the largest single national grouping of banks operating in Luxembourg, with substantial representation also from Scandinavian, Japanese, and major US banks.",
      "• By the end of 2008, total banking assets in Luxembourg exceeded €929 billion, reflecting the sector's substantial financial scale.",
      "• Luxembourg is home to more than 9,000 holding companies, underscoring its role as a hub for corporate structures and investment vehicles.",
      "• The European Investment Bank, the financial institution of the European Union, is headquartered in Luxembourg, emphasizing the country's importance in EU financial operations.",
      "• In 2023, Luxembourg enterprises anticipated negative investment trends due to slowing economic growth and tighter monetary policy conditions.",
      "• The net balance of enterprises expecting an increase in investment minus those expecting a decrease was negative at -4% in 2023, which is significantly lower than the European Union average of 14%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:19.345931",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1603,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.0.2",
    "section_name": "Holdings",
    "text": "Since the Holding Act of 1929, Luxembourg has been an attractive location for\ntax avoidance. A network of lawyers, bankers and political elites have since\nthen maintained an infrastructure of regulatory codes, legal expertise and\nshell companies that enable tax avoidance. Concern about Luxembourg's banking\nsecrecy laws, and its reputation as a tax haven, led in April 2009 to it being\nadded to a \"grey list\" of nations with questionable banking arrangements by\nthe G20, a list from which it was removed in 2009. This concern has led\nLuxembourg to modify its tax legislation to avoid conflict with the tax\nauthorities of European Union Members. For example, the classic tax exempt\n1929 Holding Company was outlawed 31 December 2010, as it was deemed an\nillegal state aid by the European Commission.\n\nNearly 90 percent of companies operating in Luxembourg are foreign.\nApproximately 40 percent of Luxembourg companies do not engage in any\nmeaningful economic activity in Luxembourg: they just hold assets in\nLuxembourg.",
    "openai_summarised_points": [
      "• Since the enactment of the Holding Act of 1929, Luxembourg has established itself as an attractive location for tax avoidance strategies.",
      "• A collaborative network comprising lawyers, bankers, and political elites in Luxembourg has developed and maintained an infrastructure of regulatory codes, legal expertise, and shell companies that facilitate tax avoidance.",
      "• Due to concerns regarding Luxembourg's banking secrecy laws and its reputation as a tax haven, the G20 included Luxembourg on a \"grey list\" of nations with questionable banking arrangements in April 2009.",
      "• Luxembourg was subsequently removed from the G20 \"grey list\" within the same year, 2009.",
      "• In response to international scrutiny and to align with the tax authorities of European Union member states, Luxembourg has modified its tax legislation.",
      "• A significant legislative change was the outlawing of the classic tax-exempt 1929 Holding Company as of 31 December 2010, following a European Commission ruling that deemed it illegal state aid.",
      "• Approximately 90 percent of companies operating in Luxembourg are foreign-owned entities.",
      "• Around 40 percent of companies registered in Luxembourg do not conduct any substantive economic activity within the country and primarily serve as asset-holding entities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:26.018184",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1019,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.0.2.1",
    "section_name": "The early beginnings of the financial center",
    "text": "Contrary to the belief of a large number of national historians, the financial\ncenter of Luxembourg was not a product that simply saw success out of nowhere\nin the 70s. In their article, Calabrese and Majerus argue that the Holding Law\nof 1929 (H29) was more than just a historical side note, but rather a\nfoundation that laid the future of the country’s financial success. In essence\nthe law was a legal tool that would help companies in avoiding double taxation\non financial assets, mainly by creating a dummy corporations and profiting\nfrom the low taxes the country offered for these kinds of companies. The newly\nintroduced Holding regime was successful. Within a span of three years, the\ncapital estimations for the holding companies not only met but exceeded\nexpectations, reaching a total surpassing 2 billion Luxembourg francs. Among\nthe biggest holdings was The Ford Investment Company set up in early 1930. The\nHolding, enabled by the legislation, could avoid UK tax on the dividends of\nits subsidiary companies in Europe. This type of company could however, also\nbe used to loan money or make investments, like in the case of Ford by buying\nfactories for European subsidiaries for example. The Law was accompanied by\nthe creation of the Luxembourg Stock Exchange a year earlier, which would\nconstitute another important institution to round off the construction of a\nnational financial center. In the interwar period, the role these Holding\ncompanies played as a source of revenue started to materialize. While the\ndiscussions on the adoption of the Holding Law saw opposition members argue\nagainst it, discussions on later modifications on the Law would not see a\nstrong opposition anymore due to its contribution to the state’s tax revenues.\n\nH29 also enabled the creation of networks and practices. Following its\nimplementation, Luxembourg experienced the establishment of a network\ninvolving lawyers, banks, and notaries closely associated with the local\npolitical elite. This network successfully developed and maintained an\ninfrastructure comprising regulatory codes, legal expertise, and shell\ncompanies, rendering it appealing within the European market for tax\navoidance. Additionally, H29 majorly contributed to the establishment of a\nlegal framework that would pave the way for the future use of investment\nfunds, by establishing a positive reputation among investors and proving\nitself to be a competent key-player on the market. As a result, Luxembourg was\nchosen in 1963 to list the first and a large part of the Eurobonds on the\nLuxembourg Stock Exchange, a choice that only could have been made with the\nawareness of a financial center that could keep up with others such as London,\nwhich were also used in the case of Eurobonds.\n\nConsequently, the Holding Law of 1929 had a large and long lasting impact on\nthe construction of a domestic financial place, an impact that should not be\ndisregarded when presenting the economic history of the country.",
    "openai_summarised_points": [
      "• The financial center of Luxembourg was not an accidental success emerging solely in the 1970s, contrary to common belief among many national historians.",
      "• Calabrese and Majerus argue that the Holding Law of 1929 (H29) was a foundational legal framework that significantly contributed to Luxembourg’s future financial success.",
      "• The Holding Law of 1929 served as a legal instrument enabling companies to avoid double taxation on financial assets, primarily by establishing dummy corporations that benefited from Luxembourg’s low tax rates.",
      "• The Holding regime introduced by H29 proved successful rapidly; within three years, the capital estimations for holding companies exceeded expectations, surpassing 2 billion Luxembourg francs.",
      "• One of the largest holding companies established under this regime was The Ford Investment Company, founded in early 1930.",
      "• The Ford Investment Company utilized the Holding Law to avoid UK tax on dividends from its European subsidiaries and also engaged in activities such as lending money and investing, including purchasing factories for its European subsidiaries.",
      "• The Holding Law was complemented by the creation of the Luxembourg Stock Exchange in 1928, which became a crucial institution in establishing Luxembourg’s national financial center.",
      "• During the interwar period, holding companies became an important source of state revenue, and although the initial adoption of the Holding Law faced opposition, subsequent modifications encountered little resistance due to its fiscal contributions.",
      "• H29 facilitated the development of a network comprising lawyers, banks, and notaries closely linked to Luxembourg’s political elite, which created and maintained a regulatory infrastructure, legal expertise, and shell companies attractive for European tax avoidance.",
      "• The Holding Law significantly contributed to establishing a legal framework that supported the future development of investment funds, enhancing Luxembourg’s reputation among investors as a competent and reliable financial market player.",
      "• Luxembourg’s financial center gained international recognition when, in 1963, it was selected to list the first and a substantial portion of Eurobonds on the Luxembourg Stock Exchange, demonstrating its ability to compete with established financial centers like London.",
      "• The Holding Law of 1929 had a profound and enduring impact on the construction of Luxembourg’s domestic financial center and is a critical element in understanding the country’s economic history."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:30.611976",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2977,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Steel",
    "text": "A key event in the economic history of Luxembourg was the 1876 introduction of\nEnglish metallurgy[_citation needed_]. The refining process led to the\ndevelopment of the steel industry in Luxembourg and founding of the Arbed\ncompany in 1911.\n\nThe restructuring of the industry and increasing government ownership in ARBED\n(31%) began as early as 1974.\n\nIn 2001, Arbed merged with Aceralia and Usinor to form Arcelor, which, in\n2007, merged with Mittal Steel Company to form ArcelorMittal.",
    "openai_summarised_points": [
      "• In 1876, the introduction of English metallurgy marked a pivotal event in Luxembourg's economic history, initiating the development of its steel industry.",
      "• The advancement in refining processes during this period directly contributed to the establishment of the Arbed company in 1911, a major player in Luxembourg's steel sector.",
      "• Beginning in 1974, the steel industry underwent significant restructuring, accompanied by an increase in government ownership of Arbed, which reached 31%.",
      "• In 2001, Arbed merged with Spanish company Aceralia and French company Usinor to create Arcelor, a major steel manufacturing entity.",
      "• Subsequently, in 2007, Arcelor merged with Mittal Steel Company, resulting in the formation of ArcelorMittal, which became a global leader in the steel industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:35.019078",
      "openai_model": "gpt-4.1-mini",
      "content_length": 487,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Telecommunications",
    "text": "Government policies promote the development of Luxembourg as an audiovisual\nand communications center. Radio-Television-Luxembourg is Europe's premier\nprivate radio and television broadcaster. The government-backed Luxembourg\nsatellite company SES (formerly Société Européenne des Satellites) was created\nin 1986 to install and operate a satellite telecommunications system for\ntransmission of television programs throughout Europe. The first SES Astra\nsatellite, the 16-channel RCA 4000 Astra 1A, was launched by the Ariane Rocket\nin December 1988. SES presently [when?] constitutes the world largest\nsatellite services company in terms of revenue.\n\n67% of Luxembourg enterprises use innovative digital technologies. Luxembourg\nfirms choose robots (74%), IoT (43%), and digital platforms (42%), over other\ndigital technologies.",
    "openai_summarised_points": [
      "• The government of Luxembourg actively promotes the development of the country as a center for audiovisual and communications industries.",
      "• Radio-Television-Luxembourg is recognized as Europe's premier private broadcaster for both radio and television services.",
      "• The Luxembourg satellite company SES, originally named Société Européenne des Satellites, was established in 1986 with government support to install and operate a satellite telecommunications system for the transmission of television programs across Europe.",
      "• The first SES Astra satellite, known as the 16-channel RCA 4000 Astra 1A, was launched in December 1988 by the Ariane Rocket.",
      "• SES currently holds the position as the world’s largest satellite services company in terms of revenue, although the specific date of this status is not provided.",
      "• Approximately 67% of enterprises in Luxembourg utilize innovative digital technologies in their operations.",
      "• Among Luxembourg firms adopting digital technologies, 74% use robots, 43% employ Internet of Things (IoT) technologies, and 42% utilize digital platforms, indicating a preference for these technologies over other digital innovations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:39.726845",
      "openai_model": "gpt-4.1-mini",
      "content_length": 828,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Tourism",
    "text": "Tourism is an important component of the national economy, representing about\n8.3% of GDP in 2009 and employing some 25,000 people or 11.7% of the working\npopulation. Despite the current crisis, the Grand Duchy still welcomes over\n900,000 visitors a year who spend an average of 2.5 nights in hotels, hostels\nor on camping sites. Business travel is flourishing representing 44% of\novernight stays in the country and 60% in the capital, up 11% and 25% between\n2009 and 2010.",
    "openai_summarised_points": [
      "• Tourism constituted approximately 8.3% of Luxembourg's Gross Domestic Product (GDP) in the year 2009, highlighting its significant role in the national economy.",
      "• The tourism sector employed around 25,000 individuals in 2009, accounting for 11.7% of Luxembourg's total working population.",
      "• Despite facing an economic crisis during the period referenced, Luxembourg continued to attract over 900,000 visitors annually.",
      "• Visitors to Luxembourg typically stayed an average of 2.5 nights in accommodations such as hotels, hostels, or camping sites.",
      "• Business travel was a prominent segment of tourism, representing 44% of all overnight stays across the country.",
      "• In Luxembourg City, the capital, business travel accounted for an even higher proportion of overnight stays, at 60%.",
      "• Between 2009 and 2010, overnight stays related to business travel increased by 11% nationwide.",
      "• Specifically in the capital, Luxembourg City, business travel overnight stays grew by 25% between 2009 and 2010."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:48.942561",
      "openai_model": "gpt-4.1-mini",
      "content_length": 473,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Agriculture",
    "text": "Luxembourg's small but productive agricultural sector is highly subsidized,\nmainly by the EU and the government. It employs about 1–3% of the workforce.\nMost farmers are engaged in dairy and meat production. Vineyards in the\nMoselle Valley annually produce about 15 million litres of dry white wine,\nmost of which is consumed within Luxembourg and also in Germany, France, and\nBelgium on a lesser scale.[_citation needed_]",
    "openai_summarised_points": [
      "• Luxembourg's agricultural sector is small in scale but highly productive, benefiting from substantial subsidies primarily provided by the European Union and the national government.",
      "• The agricultural sector employs approximately 1 to 3 percent of Luxembourg's total workforce, indicating a relatively minor role in overall employment.",
      "• The majority of farmers in Luxembourg specialize in dairy and meat production, reflecting the primary focus areas within the agricultural industry.",
      "• The Moselle Valley region in Luxembourg is notable for its vineyards, which produce around 15 million litres of dry white wine annually.",
      "• Most of the dry white wine produced in the Moselle Valley is consumed domestically within Luxembourg, with additional smaller quantities exported and consumed in neighboring countries including Germany, France, and Belgium."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:17:53.347792",
      "openai_model": "gpt-4.1-mini",
      "content_length": 422,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Data",
    "text": "In 2022, the sector with the highest number of companies registered in\nLuxembourg is Finance, Insurance, and Real Estate with 89,748 companies\nfollowed by Services and Retail Trade with 31,658 and 6,571 companies\nrespectively.\n\nThe following table shows the main economic indicators in 1980–2017. Inflation\nunder 2% is in green.\n\nYear  | GDP\n(in Bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP (in bil. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---\n1980  | 5.7  | 15,611  | 6.4  | 3.2%  | 6.3%  | 0.7%  | n/a\n1981  | 6.3  | 17,153  | 5.5  | 0.8%  | 8.1%  | 1.0%  | n/a\n1982  | 6.7  | 18,391  | 4.6  | 1.0%  | 9.4%  | 1.3%  | n/a\n1983  | 7.1  | 19,478  | 4.5  | 1.9%  | 8.7%  | 1.6%  | n/a\n1984  | 7.7  | 21,106  | 4.4  | 4.7%  | 5.6%  | 1.7%  | n/a\n1985  | 8.4  | 22,956  | 4.5  | 5.6%  | 14.8%  | 1.7%  | n/a\n1986  | 9.4  | 25,638  | 6.6  | 10.0%  | 0.3%  | 1.5%  | n/a\n1987  | 10.1  | 27,155  | 8.2  | 4.0%  | −0.1%  | 1.7%  | n/a\n1988  | 11.3  | 30,223  | 9.3  | 8.5%  | 1.4%  | 1.5%  | n/a\n1989  | 12.9  | 34,137  | 9.9  | 9.8%  | 3.4%  | 1.4%  | n/a\n1990  | 14.1  | 36,863  | 12.6  | 5.3%  | 3.7%  | 1.3%  | n/a\n1991  | 15.8  | 40,826  | 13.7  | 8.6%  | 3.1%  | 1.4%  | n/a\n1992  | 16.5  | 41,943  | 15.3  | 1.8%  | 3.2%  | 1.6%  | n/a\n1993  | 17.6  | 44,115  | 15.7  | 4.2%  | 3.6%  | 2.1%  | n/a\n1994  | 18.6  | 46,104  | 17.5  | 3.8%  | 2.2%  | 2.7%  | n/a\n1995  | 19.3  | 47,516  | 20.6  | 1.4%  | 1.9%  | 3.0%  | 8.9%\n1996  | 19.9  | 48,412  | 20.5  | 1.5%  | 1.2%  | 3.2%  | 8.6%\n1997  | 21.5  | 51,502  | 18.4  | 5.9%  | 1.4%  | 3.3%  | 8.5%\n1998  | 23.1  | 54,757  | 19.3  | 6.5%  | 1.0%  | 3.1%  | 8.1%\n1999  | 25.4  | 59,529  | 21.1  | 8.4%  | 1.0%  | 2.9%  | 7.1%\n2000  | 28.8  | 65,079  | 21.2  | 8.4%  | 3.8%  | 2.2%  | 6.5%\n2001  | 29.6  | 67,331  | 21.4  | 2.5%  | 2.4%  | 2.0%  | 6.9%\n2002  | 31.2  | 70,249  | 23.6  | 3.8%  | 2.1%  | 2.5%  | 6.8%\n2003  | 32.3  | 72,127  | 29.7  | 1.6%  | 2.5%  | 3.3%  | 6.8%\n2004  | 34.4  | 75,663  | 35.0  | 3.6%  | 3.2%  | 4.0%  | 7.3%\n2005  | 36.7  | 79,480  | 37.7  | 3.2%  | 3.7%  | 4.0%  | 7.4%\n2006  | 39.7  | 84,722  | 42.9  | 5.2%  | 3.0%  | 4.0%  | 7.8%\n2007  | 44.2  | 92,837  | 51.6  | 8.4%  | 2.7%  | 4.0%  | 7.7%\n2008  | 44.5  | 91,977  | 58.8  | −1.3%  | 4.1%  | 4.1%  | 14.9%\n2009  | 42.9  | 86,894  | 54.4  | −4.4%  | 0.0%  | 5.6%  | 15.7%\n2010  | 45.5  | 90,662  | 56.3  | 4.9%  | 2.8%  | 6.0%  | 19.8%\n2011  | 47.6  | 92,970  | 61.7  | 2.5%  | 3.7%  | 6.0%  | 18.7%\n2012  | 48.3  | 92,102  | 59.8  | −0.4%  | 2.9%  | 6.1%  | 21.7%\n2013  | 50.9  | 94,824  | 65.2  | 3.7%  | 1.7%  | 6.8%  | 23.7%\n2014  | 54.8  | 99,738  | 68.8  | 5.8%  | 0.7%  | 7.1%  | 22.7%\n2015  | 57.0  | 101,255  | 60.1  | 2.9%  | 0.1%  | 6.8%  | 22.0%\n2016  | 59.5  | 103,286  | 62.2  | 3.1%  | 0.0%  | 6.3%  | 20.8%\n2017  | 62.8  | 106,373  | 65.7  | 3.5%  | 2.1%  | 5.8%  | 23.0%",
    "openai_summarised_points": [
      "• In 2022, the sector with the highest number of companies registered in Luxembourg was Finance, Insurance, and Real Estate, comprising 89,748 companies.",
      "• The second largest sector by number of registered companies in Luxembourg in 2022 was Services, with 31,658 companies.",
      "• Retail Trade was the third largest sector in terms of registered companies in Luxembourg in 2022, with 6,571 companies.",
      "• From 1980 to 2017, Luxembourg's GDP in billion US dollars (PPP) increased from 5.7 in 1980 to 62.8 in 2017, showing substantial economic growth over the period.",
      "• GDP per capita in Luxembourg rose from $15,611 (PPP) in 1980 to $106,373 (PPP) in 2017, indicating significant improvement in average economic output per person.",
      "• The nominal GDP in billion US dollars grew from $6.4 billion in 1980 to $65.7 billion in 2017.",
      "• Real GDP growth rates fluctuated annually, with notable peaks such as 10.0% in 1986 and 8.4% in 2007, and declines including −4.4% in 2009 during the global financial crisis.",
      "• Inflation rates varied over the years, with several years recording inflation under 2%, highlighted in green in the original data; for example, 0.8% in 1981, 1.0% in 1982, and 1.4% in 1998.",
      "• Unemployment rates in Luxembourg ranged from a low of 0.0% in 2009 and 2016 to a high of 14.8% in 1985, reflecting varying labor market conditions over the decades.",
      "• Government debt as a percentage of GDP was not available for years before 1995 but ranged from 8.9% in 1995 to a peak of 23.7% in 2013, then slightly declined to 23.0% in 2017.",
      "• Specific annual data highlights include:",
      "• 1980: GDP $5.7 billion (PPP), GDP per capita $15,611, nominal GDP $6.4 billion, 3.2% GDP growth, 6.3% inflation, 0.7% unemployment.",
      "• 1995: GDP $19.3 billion (PPP), GDP per capita $47,516, nominal GDP $20.6 billion, 1.4% GDP growth, 1.9% inflation, 3.0% unemployment, 8.9% government debt.",
      "• 2007: GDP $44.2 billion (PPP), GDP per capita $92,837, nominal GDP $51.6 billion, 8.4% GDP growth, 2.7% inflation, 4.0% unemployment, 7.7% government debt.",
      "• 2009: GDP $42.9 billion (PPP), GDP per capita $86,894, nominal GDP $54.4 billion, −4.4% GDP growth, 0.0% inflation, 5.6% unemployment, 15.7% government debt.",
      "• 2017: GDP $62.8 billion (PPP), GDP per capita $106,373, nominal GDP $65.7 billion, 3.5% GDP growth, 2.1% inflation, 5.8% unemployment, 23.0% government debt.",
      "• The data reflects Luxembourg's transition to a high-income economy with strong growth in GDP and GDP per capita, low inflation rates mostly under 2%, and generally low unemployment rates over the nearly four decades covered.",
      "• Government debt as a percentage of GDP increased notably after 2008, coinciding with the global financial crisis, before stabilizing around 22-23% in the mid-2010s."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:18:13.009554",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2940,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Energy",
    "text": "In 1978, Luxembourg tried to build a 1,200 MW nuclear reactor but dropped the\nplans after threats of major protests. Luxembourg uses imported oil and\nnatural gas for the majority of its energy generation.",
    "openai_summarised_points": [
      "• In 1978, Luxembourg initiated plans to construct a nuclear reactor with a capacity of 1,200 megawatts (MW).",
      "• The proposed nuclear reactor project was ultimately abandoned due to anticipated significant public protests against its development.",
      "• Currently, Luxembourg relies predominantly on imported oil and natural gas to meet the majority of its energy generation needs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:18:15.446913",
      "openai_model": "gpt-4.1-mini",
      "content_length": 204,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Spaceflight and space resource extraction",
    "text": "Luxembourg is a member of the European Space Agency where Luxembourg\ncontributed 23 million Euros in 2015.\n\nThe world's biggest satellite operator (SES) has its origin and headquarters\nin Betzdorf, Luxembourg.\n\nIn February 2016, the Government of Luxembourg announced that it would attempt\nto \"jump-start an industrial sector to mine asteroid resources in space\" by,\namong other things, creating a \"legal framework\" and regulatory incentives for\ncompanies involved in the industry. By June 2016, announced that it would\n\"invest more than US$200 million in research, technology demonstration, and in\nthe direct purchase of equity in companies relocating to Luxembourg.\" By April\n2017, three space mining corporations had established headquarters in\nLuxembourg.\n\nLuxembourg's new law took effect in August 2017, ensuring that private\noperators can be confident about their rights on resources they extract in\nspace. The law provides that space resources can be owned by anyone, not just\nby Luxembourg citizens or companies.\"",
    "openai_summarised_points": [
      "• Luxembourg is a member of the European Space Agency (ESA) and contributed 23 million Euros to the agency in 2015.",
      "• The world's largest satellite operator, SES, originated in Luxembourg and maintains its headquarters in Betzdorf, Luxembourg.",
      "• In February 2016, the Government of Luxembourg announced plans to initiate an industrial sector focused on mining asteroid resources in space by establishing a legal framework and regulatory incentives to support companies involved in space resource extraction.",
      "• By June 2016, Luxembourg declared it would invest more than US$200 million in research, technology demonstration, and the direct purchase of equity in companies relocating to Luxembourg to support the space mining industry.",
      "• By April 2017, three space mining corporations had established their headquarters in Luxembourg, reflecting the country’s growing role in the space resource extraction sector.",
      "• Luxembourg enacted a new law in August 2017 that guarantees private operators the rights to resources they extract in space, allowing ownership of space resources by any entity regardless of nationality, not limited to Luxembourg citizens or companies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:18:21.678392",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1022,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Luxembourg",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Transportation",
    "text": "Luxembourg has efficient road, rail and air transport facilities and services.\nThe road network has been significantly modernised in recent years with 147 km\nof motorways connecting the capital to adjacent countries. The advent of the\nhigh-speed TGV link to Paris has led to renovation of the city's railway\nstation while a new passenger terminal at Luxembourg Airport has recently been\nopened. The airport has known a sustained growth in passenger numbers during\nthe last years (2015: 2.7 mio, 2020 : 4 mio expected), and the second stage of\nexpansion is on its way.\n\nTrams have been reintroduced to the capital (first core line operative in end\n2017) and further lines are planned, including a tram/light-rail to Esch-sur-\nAlzette. In 2019, almost all public transport was made free to use for both\nresidents and visitors."
  }
]