[
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Saudi Arabia\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( February 2022)__(Learn how and when to remove\nthis message)_  \n---|---  \n  \nThe economy of Saudi Arabia is highly reliant on its petroleum sector. Oil\naccounts for approximately 30% of Saudi GDP and 55% of government revenue,\nwith substantial fluctuations depending on oil prices each year.\n\nThe kingdom has the second-largest proven petroleum reserves, and the fourth-\nlargest measured natural gas reserves. Saudi Arabia is currently the largest\nexporter of petroleum in the world. Other major parts of the economy include\nrefining and chemical manufacturing from the oil reserves, much of which is\nvertically integrated in the state-owned enterprise, Saudi Aramco. Saudi\nArabia is a permanent and founding member of OPEC.\n\nIn 2016, the Saudi government launched its Saudi Vision 2030 program to reduce\nits dependency on oil and diversify its economic resources. By 2022, Saudi\nArabia had only modestly reduced its dependence on oil.\n\nMonetary policy in Saudi Arabia is anchored by the fixed exchange rate of the\nSaudi Riyal to the U.S. Dollar.\n\nNearly every major business in Saudi Arabia has extensive ties to the Saudi\nstate."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic overview",
    "text": "Saudi oil reserves are the second largest in the world (after\nBrazilian–Venezuelan oil reserves), and Saudi Arabia is the world's leading\noil exporter and second-largest oil producer. Proven reserves, according to\nfigures provided by the Saudi government, are estimated to be 260 billion\nbarrels (41 km3), which is about one-quarter of the world oil reserves.\nPetroleum in Saudi Arabia is not only plentiful but also located under\npressure close to the earth's surface, which makes it less expensive and more\nprofitable to extract compared to other places. The petroleum sector accounts\nfor roughly 87% of Saudi budget revenues, 90% of export earnings, and 42% of\nGDP. Saudi Arabia's oil reserves and production are largely managed by the\nstate-owned corporation Saudi Aramco.\n\nAnother 40% of the GDP comes from the private sector. An estimated 7.5 (2013)\nmillion foreigners work legally in Saudi Arabia and play a crucial role in\ndeveloping the Saudi economy, for example in the oil and service sectors. The\ngovernment has been encouraging the growth of the private sector for many\nyears to decrease the kingdom's dependence on oil and to increase employment\nopportunities for the swelling Saudi population. In recent decades, the\ngovernment started allowing private sector activity and foreign investor\nparticipation in certain sectors, such as power generation and\ntelecommunications, and acceded to the World Trade Organization. During much\nof the 2000s, high oil prices allowed the government to post budget surpluses\nand boost spending on job training and education, infrastructure development,\nand government salaries.\n\nWith its absolute monarchy, large state sector, and supply of welfare\nbenefits, the Saudi economy has been described asː\n\n> A bewildering (at least to outsiders) combination of a feudal fealty system\n> and a more modern political patronage one. At every level in every sphere of\n> activity, Saudis maneuver through life manipulating individual privileges,\n> favours, obligations, and connections. By the same token, the government\n> bureaucracy is a maze of overlapping or conflicting power centers under the\n> patronage of various royal princes with their own priorities and agendas to\n> pursue and dependents to satisfy.\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation under 5% is in green.\n\nYear  | GDP (in billion Int$ PPP) | GDP per capita (in Int$ PPP) | GDP (in billion US$ nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in percent) | Unemployment (in percent) | Gov. debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 418.1  | 44,859.5  | 164.5  | 17,655.1  | 5.7%  | 4.4%  | n/a  | n/a\n1981  | 466.5  | 47,671.8  | 184.3  | 18,832.1  | 1.9%  | 3.6%  | n/a  | n/a\n1982  | 392.7  | 38,212.2  | 153.2  | 14,912.7  | -20.7%  | 1.9%  | n/a  | n/a\n1983  | 342.5  | 31,746.0  | 129.2  | 11,972.2  | -16.1%  | 0.6%  | n/a  | n/a\n1984  | 338.4  | 29,864.0  | 119.6  | 10,558.7  | -4.7%  | -0.7%  | n/a  | n/a\n1985  | 314.9  | 26,466.2  | 103.9  | 8,732.8  | -9.8%  | -2.3%  | n/a  | n/a\n1986  | 375.9  | 30,086.7  | 86.9  | 6,955.1  | 17.0%  | -3.1%  | n/a  | n/a\n1987  | 359.6  | 27,414.1  | 85.6  | 6,524.2  | -6.6%  | -2.4%  | n/a  | n/a\n1988  | 421.1  | 30,571.4  | 88.1  | 6,398.8  | 13.1%  | -0.4%  | n/a  | n/a\n1989  | 435.4  | 30,103.8  | 95.2  | 6,583.3  | -0.5%  | 1.2%  | n/a  | n/a\n1990  | 520.3  | 34,260.8  | 117.5  | 7,735.0  | 15.2%  | -1.1%  | n/a  | n/a\n1991  | 618.7  | 38,793.7  | 132.0  | 8,280.2  | 15.0%  | 3.9%  | n/a  | 39.4%\n1992  | 658.0  | 38,823.1  | 136.9  | 8,077.7  | 4.0%  | -1.0%  | n/a  | 47.8%\n1993  | 664.4  | 38,455.7  | 132.8  | 7,686.0  | -1.4%  | 1.2%  | n/a  | 58.6%\n1994  | 682.4  | 38,550.2  | 135.0  | 7,626.4  | 0.6%  | 1.4%  | n/a  | 67.9%\n1995  | 698.2  | 38,497.0  | 143.2  | 7,893.4  | 0.2%  | 5.1%  | n/a  | 74.2%\n1996  | 729.7  | 39,271.8  | 158.5  | 8,527.7  | 2.6%  | 0.3%  | n/a  | 75.2%\n1997  | 750.5  | 39,422.1  | 165.7  | 8,706.3  | 1.1%  | -0.2%  | n/a  | 76.7%\n1998  | 780.9  | 40,036.4  | 146.8  | 7,525.3  | 2.9%  | -0.4%  | n/a  | 101.5%\n1999  | 762.1  | 38,136.5  | 161.7  | 8,092.7  | -3.8%  | -2.1%  | 4.3%  | 103.0%\n2000  | 823.2  | 40,207.4  | 189.5  | 9,256.5  | 5.6%  | -1.0%  | 4.6%  | 86.7%\n2001  | 831.5  | 39,642.3  | 184.1  | 8,778.4  | -1.2%  | -1.1%  | 4.6%  | 93.1%\n2002  | 820.7  | 38,187.7  | 189.6  | 8,822.5  | -2.8%  | 0.1%  | 5.3%  | 96.4%\n2003  | 931.0  | 42,278.8  | 215.8  | 9,800.5  | 11.2%  | 0.5%  | 5.6%  | 81.6%\n2004  | 1,032.1  | 45,739.0  | 258.7  | 11,467.1  | 8.0%  | 0.3%  | 5.8%  | 62.9%\n2005  | 1,123.7  | 48,168.2  | 328.2  | 14,068.2  | 5.6%  | 0.6%  | 6.1%  | 37.3%\n2006  | 1,190.7  | 49,362.7  | 376.4  | 15,604.0  | 2.8%  | 1.9%  | 6.3%  | 25.8%\n2007  | 1,245.5  | 49,936.8  | 415.7  | 16,666.6  | 1.8%  | 5.0%  | 5.6%  | 17.1%\n2008  | 1,348.7  | 52,301.7  | 519.8  | 20,157.3  | 6.3%  | 6.1%  | 5.2%  | 12.1%\n2009  | 1,329.4  | 49,863.3  | 429.1  | 16,094.7  | -2.1%  | 4.3%  | 5.4%  | 14.0%\n2010  | 1,413.2  | 51,270.0  | 528.2  | 19,163.3  | 5.0%  | 3.7%  | 5.5%  | 8.4%\n2011  | 1,586.7  | 55,918.0  | 671.2  | 23,654.9  | 10.0%  | 3.7%  | 5.8%  | 5.4%\n2012  | 1,672.5  | 57,284.5  | 736.0  | 25,208.2  | 5.4%  | 2.9%  | 5.5%  | 3.0%\n2013  | 1,680.2  | 56,015.9  | 746.6  | 24,893.0  | 2.7%  | 3.5%  | 5.6%  | 2.1%\n2014  | 1,722.9  | 56,785.5  | 756.4  | 24,929.3  | 3.7%  | 2.2%  | 5.7%  | 1.6%\n2015  | 1,541.8  | 49,637.2  | 654.3  | 21,063.3  | 4.1%  | 1.2%  | 5.6%  | 5.8%\n2016  | 1,475.7  | 46,422.9  | 644.9  | 20,288.9  | 1.7%  | 2.1%  | 5.6%  | 13.1%\n2017  | 1,565.9  | 48,014.6  | 688.6  | 21,114.0  | -0.7%  | -0.8%  | 6.0%  | 17.2%\n2018  | 1,643.6  | 49,189.7  | 816.6  | 24,438.5  | 2.5%  | 2.5%  | 6.0%  | 18.3%\n2019  | 1,678.6  | 49,055.7  | 803.6  | 23,485.1  | 0.3%  | -2.1%  | 5.7%  | 22.5%\n2020  | 1,628.5  | 46,511.7  | 703.4  | 20,088.5  | -4.1%  | 3.4%  | 7.4%  | 32.4%\n2021  | 1,751.2  | 49,386.2  | 833.5  | 23,507.3  | 3.2%  | 3.1%  | 6.7%  | 30.0%\n2022  | 2,018.3  | 55,802.3  | 1,010.6  | 27,941.5  | 7.6%  | 2.7%  | n/a  | 24.8%\n2023  | 2,166.9  | 58,736.3  | 996.4  | 27,008.8  | 3.7%  | 2.2%  | n/a  | 25.1%\n2024  | 2,277.1  | 60,513.7  | 1,016.7  | 27,018.7  | 2.9%  | 2.0%  | n/a  | 24.6%\n2025  | 2,386.6  | 62,180.3  | 1,044.2  | 27,206.4  | 2.9%  | 2.0%  | n/a  | 24.0%\n2026  | 2,503.7  | 63,953.2  | 1,077.6  | 27,525.0  | 2.9%  | 2.0%  | n/a  | 23.2%\n2027  | 2,629.4  | 65,847.1  | 1,116.1  | 27,950.0  | 3.0%  | 2.0%  | n/a  | 22.4%"
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "History",
    "text": "Dammam No. 7 on March 4, 1938, the day the well struck oil in commercial\nquantities, becoming the first in the kingdom to do so\n\nSaudi Arabia was a subsistence economy until the 1930s. In 1933, the Saudi\ngovernment signed an oil concession agreement with the Standard Oil Company of\nCalifornia; five years later, commercial volumes of oil were discovered in the\nkingdom. The development of oil fields continued in Saudi Arabia, managed\nmainly by Arabian American Oil Company (Aramco), a company formed by the\npartnership of Texaco and Chevron. In 1951, the first offshore field in the\nMiddle East was established by Aramco at Raʾs Al-Saffāniyyah area. By 1949,\nSaudi oil production reached 500,000 barrels per day (bpd) and rose rapidly to\n1 million bpd in 1954. Moreover, in 1951, Aramco started operating the Trans-\nArabian Pipeline that moved oil from the eastern region of Saudi Arabia to the\nMediterranean Sea through Jordan, Syria, and Lebanon. However, in 1981, this\nline was no longer used after a new line began operations that linked Jubail\non the Persian Gulf and Yanbu on the Red Sea. The new pipe contributed greatly\nto speed up oil transport. In 1960, OPEC was established, with Saudi Arabia as\none of its founding members. During the 1973 oil crisis, the price of oil rose\nfrom $3 per barrel to nearly $12, and the Saudi economy started growing\nrapidly, with GDP increasing from approximately $15 billion in 1973 to almost\n$184 billion by 1981. After gradually purchasing Aramco assets, the Saudi\ngovernment nationalized the company in 1980. In 1988, Saudi Aramco was\nestablished to take over the responsibilities of Aramco.\n\nIn 1980, the price of oil peaked, and demand started decreasing as a result of\nrecessions in industrialized nations and more efficient oil use, which\nproduced surpluses. This created a worldwide oil glut, with the price of oil\ndropping from approximately $36 per barrel in 1980 to approximately $14 by\n1986. Saudi oil production, which had increased to almost 10 million barrels\n(1,600,000 m3) per day during 1980–81, fell 80% to about 2 million barrels per\nday (320,000 m3/d) in 1985. Budgetary deficits developed, and the government\ndrew down its foreign assets. As a result of the oil glut and the pressure\nfrom declines in production, after 1985 Saudi Arabia started enforcing\nproduction quotas more harshly for the OPEC members.\n\nIn June 1993, Saudi Aramco absorbed the state marketing and refining company\n(SAMAREC), becoming the world's largest fully integrated oil company. Most\nSaudi oil is exported by tankers from oil terminals at Ras Tanura and Ju'aymah\nin the Persian Gulf.\n\nA map of world oil reserves according to OPEC, 2013\n\nIn the 1990s, Saudi Arabia experienced a significant contraction of oil\nrevenues combined with a high rate of population growth. Per capita income\nfell from a high of $11,700 at the height of the oil boom in 1981 to $6,300 in\n1998. Taking into account the impact of the real oil price changes on the\nkingdom's real gross domestic income, the real command-basis GDP was computed\nto be 330.381 billion 1999 USD in 2010. Increases in oil prices in the early\n2000s helped boost per capita GDP to $17000 in 2007 dollars (about $7,400\nadjusted for inflation), but have declined since oil price drop in mid-2014.\n\nHowever, beginning in late 1997, Saudi Arabia again faced the challenge of low\noil prices. Because of a combination of factors—the East Asian economic\ncrises, a warm winter in the West caused by El Niño, and an increase in non-\nOPEC oil production—demand for oil decreased and pulled oil prices down by\nmore than one-third.\n\nSaudi Arabia was a key player in coordinating the successful 1999 campaign of\nOPEC and other oil-producing countries to raise the oil price to its highest\nlevel since the (Persian) Gulf War by managing petroleum supply and\nproduction. That same year, Saudi Arabia established the Supreme Economic\nCouncil to formulate and better coordinate economic development policies to\naccelerate institutional and industrial reforms.\n\nSaudi Arabia joined the World Trade Organization (WTO) in 2005 after many\nyears of negotiations."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Foreign investment",
    "text": "Before 2000, there were strict limits placed on foreign direct investment in\nSaudi Arabia. The 1979 Foreign Investment Act prohibited foreign ownership in\nsome sectors of the economy, allowed foreign investment only if the investor\nqualified for a license based on their expertise, and gave priority to\nbusinesses that were Saudi-owned or partially Saudi-owned.\n\nHowever, in the mid-1990s, foreign ownership rules were relaxed, with\ninvestment sought in telecommunications, utilities, and financial services.\nThe 2000 Foreign Direct Investment Act made substantial changes to the rules\non foreign investment, including allowing projects to be run by 100% foreign-\nowned companies for the first time.\n\nAccording to UNCTAD's June 2018 report, Saudi Arabia's foreign direct\ninvestment was only $1.4 billion in 2017, down from $7.5 billion the year\nbefore and as much as $12.2 billion in 2012. The fall in investment is\nattributed to negative intra-company loans by foreign multinationals and\nvarious divestments. In the first quarter of 2018, net capital outflows were\nrunning at approximately 5% of GDP, compared to less than 2% of GDP in late\n2016. However, according to a report published in Trading Economics, in the\nsecond quarter of 2018, foreign direct investment in the country raised by\n$882 million. Moreover, SAGIA's data indicate that licenses provided to\nforeign investment increased by 130% in the first quarter of 2018 as a result\nof reforms in the economy.\n\nAs Saudi oil income declined in the late 2010s, the kingdom's international\ndebt soared. In December 2018, Saudi Arabia announced it would be issuing\nbonds worth approximately 120 billion riyals ($32 billion) to cover its 4.2%\nGDP deficit of 131 billion riyals. In January 2019, the kingdom sold bonds\nworth $7.5 billion. In almost two and a half years, bonds worth $60 billion\nwere sold by Saudi, which became one of the biggest borrowers globally.\n\nIn September 2018, the Public Investment Fund completed a deal with a group of\nglobal lenders for a loan of $11 billion. The deal raised more than initially\nplanned and was the first time the PIF had incorporated loans and debt\ninstruments into its funding. According to data from Fitch Ratings, over two\nyears starting from May 2016 Saudi Arabia went from having zero debt to\nraising $68 billion in dollar-denominated bonds and syndicated loans—one of\nthe fastest rates among emerging economies.\n\nForeign investments in the kingdom witnessed a rapid increase in the first\nquarter of 2019. The number of new licenses approved for foreign businesses\ngrew 70% over 2018. Most licenses were approved for British and Chinese\ncompanies, which drove the increase. In the first quarter of 2019, foreign\ninvestment in Saudi Arabia jumped by 28%."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Diversification and the development plans",
    "text": "All the Saudi government's five-year plan since 1970 have called for\ndiversifying the economy beyond oil, but with marginal success.\n\nThe government has sought to allocate its petroleum income to transform its\nrelatively undeveloped, oil-based economy into a modern industrial state,\nwhile maintaining the kingdom's traditional Islamic values and customs.\nAlthough economic planners have not achieved all their goals, the economy has\nprogressed rapidly. Oil wealth has increased the standard of living of most\nSaudis. However, significant population growth has strained the government's\nability to finance further improvements in the country's standard of living.\nHeavy dependence on petroleum revenue continues, but industry and agriculture\nnow account for a larger share of economic activity. The mismatch between the\njob skills of Saudi graduates and the needs of the private job market at all\nlevels remains the principal obstacle to economic diversification and\ndevelopment; about 4.6 million non-Saudis are employed in the economy.\n\nSaudi Arabia first began to diversify its economy to reduce dependency on oil\nin the 1970s as part of its first five-year development plan. Basic\npetrochemical industries using petroleum byproducts as feedstock were\ndeveloped. The fishing villages of al-Jubail on the Persian Gulf and Yanbu on\nthe Red Sea were developed. However, their effect on Saudi Arabia's economic\nfortunes has been small.\n\nSaudi Arabia's first two development plans, covering the 1970s, emphasized\ninfrastructure. The results were impressive—the total length of paved highways\ntripled, power generation increased by a factor of 28, and the capacity of the\nseaports grew by a factor of 10. For the third plan (1980–85), the emphasis\nchanged. Spending on infrastructure declined, shifting instead to education,\nhealth, and social services. The share for diversifying and expanding\nproductive sectors of the economy (primary industry) did not rise as planned,\nbut the two industrial cities of Jubail and Yanbu—which were built around the\nuse of the country's oil and gas to produce steel, petrochemicals, fertilizer,\nand refined oil products—were largely completed.\n\nIn the fourth plan (1985–90), the country's basic infrastructure was viewed as\nlargely complete, but education and training remained areas of concern.\nPrivate enterprise was encouraged, and foreign investment in the form of joint\nventures with Saudi public and private companies was welcomed. The private\nsector became more important, rising to 70% of non-oil GDP by 1987. While\nstill concentrated in trade and commerce, private investment increased in\nindustry, agriculture, banking, and construction companies. These private\ninvestments were supported by generous government financing and incentive\nprograms. The objective was for the private sector to have 70% to 90%\nownership in most joint venture enterprises.\n\nThe fifth plan (1990–95) emphasized consolidation of the country's defences;\nimproved and more efficient government social services; regional development;\nand, most importantly, creating greater private-sector employment\nopportunities for Saudis by reducing the number of foreign workers.\n\nThe sixth plan (1996–2000) focused on lowering the cost of government services\nwithout cutting them and sought to expand educational training programs. The\nplan called for reducing the kingdom's dependence on the petroleum sector by\ndiversifying economic activity, particularly in the private sector, with\nspecial emphasis on industry and agriculture. It also continued the effort to\n\"Saudize\" the labour force.\n\nThe seventh plan (2000–2004) focused more on economic diversification and a\ngreater role of the private sector in the Saudi economy. For 2000–04, the\ngovernment aimed at an average GDP growth rate of 3.16% each year, with\nprojected growths of 5.04% for the private sector and 4.01% for the non-oil\nsector. The government also set a target of creating 817,300 new jobs for\nSaudi nationals. By 2007, advertising expenditures had reached new peaks due\nto emphasis on value-added manufacturing.[_failed verification_]\n\nIn 2016, the main investing countries in Saudi Arabia were the US, UAE,\nFrance, Singapore, Kuwait, and Malaysia. They mainly invested in chemical\nindustry, real estate, tourism, fossil fuels, automobiles, and machinery. As\npart of its diversification, Saudi Arabia arranged major refinery contracts\nwith Chinese and other companies.\n\nAfter Saudi Arabia became a member of the World Trade Organization (WTO) in\n2005, the overall foreign investment environment in Saudi Arabia improved\nthanks to the kingdom's stable economy, massive oil reserves, high power of\nexpenditure, developed infrastructure, reinforced finance, and banking system.\nSince then, and pursuant to its commitment to the WTO, Saudi Arabia has been\ndeveloping trade-related policies and legislations. Moreover, foreign\ninvestment has been highly encouraged by Saudi Vision 2030 and its economic\ndiversification.\n\nSince 2017, to boost the economy and decrease the country's dependency on oil,\nCrown Prince Mohammed bin Salman has introduced multiple changes, such as\nraising the prices of gasoline and electricity, levying new taxes, and\nprioritizing Saudi workers over foreign workers. However, some government\nofficials claimed the policies were causing serious ill effects on the\neconomy. Saudi businessmen reported a decline in sales for 2018, and a few\nblamed the government.\n\nIn 2019, the _Financial Times_ reported that the plans to float state-owned\noil beneficiary Saudi Aramco were stranded between the company's attachment to\nthe oil ministry and the desire to meet international standards. However,\nEnergy Minister Khalid Al Falih has long maintained that Aramco's association\nwith the state is a \"win-win policy\" for both parties.\n\nSaudi Arabia made plans to launch six \"economic cities\" (e.g., King Abdullah\nEconomic City) in an effort to diversify the economy and provide jobs. At a\ntotal construction cost of $60 billion (2013), they were \"expected to\ncontribute $150bn to the economy\". However, these cities have failed to\nattract either the population or the financial investment that the government\nclaimed they would.\n\nThe privatization program Saudi Vision 2030 is running behind schedule. Oil\nprices have doubled since the government began to consider the program in\n2015. Delay in Aramco's initial public offering further demonstrated a lack of\nurgency to privatize, even though in July 2018, the International Monetary\nFund urged accelerating the process.\n\nAccording to many reports, the Saudi government is interested in granting more\nliberties to the foreign investment system and giving a 100% allowance to\nforeign investors to work in the wholesale and retail sector in certain cases.\nThe Saudi Ministry of Commerce and Investment expected that the kingdom would\nsee an increase in the GDP per capita from US$20,700 to $33,500 by 2020.\nHowever, the GDP per capita by 2020 had stagnated at $US20,000."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Employment",
    "text": "As of 2008, roughly two-thirds of workers employed in Saudi Arabia were\nforeigners, and in the private sector the proportion was approximately 90%. In\nJanuary 2014, the Saudi government claimed it had lowered the 90% rate,\ndoubling the number of Saudi citizens working in the private sector to 1.5\nmillion (compared to 10 million foreign expatriates working in the kingdom).\n\nAccording to Reuters, economists \"estimate only 30–40 percent of working-age\nSaudis hold jobs or actively seek work\", although the official unemployment\nrate is only around 12 percent. Most Saudis with jobs are employed by the\ngovernment, but the International Monetary Fund has warned that the government\ncannot support such a large payroll in the long term. The government has\nannounced a succession of plans since 2000 to deal with the imbalance by\n\"Saudization\" of the economy, but the foreign workforce and unemployment has\ncontinued to grow. Since the beginning of 2017, however, Saudi Arabia has seen\nrecord numbers of foreign workers leaving the country as the Saudi government\nimposed higher fees on expatriate workers, with more than 677,000 foreigners\nleaving the kingdom. This has done little to lower the unemployment rate,\nwhich rose to 12.9 percent, the highest on record.\n\nEach year, about a quarter-million young Saudis enter the job market. With the\nfirst phase of Saudization into effect, 70% of sales jobs are expected to be\nfilled by Saudis. However, the private sector still remains hugely dominated\nby foreigners. The rate of local unemployment is 12.9%, its highest in more\nthan a decade. According to a report published by Bloomberg Economics in 2018,\nthe government needs to produce 700000 jobs by 2020 to meet its 9%\nunemployment target.\n\nOne obstacle is social resistance to certain types of employment. Jobs in\nservice and sales are considered totally unacceptable for citizens of Saudi\nArabia—both to potential employees and customers."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Non-petroleum resources sector",
    "text": "Saudi Arabia has natural resources other than oil, including small mineral\ndeposits of gold, silver, iron, copper, zinc, manganese, tungsten, lead,\nsulfur, phosphate, soapstone, and feldspar. The country has a small\nagricultural sector, primarily in the southwest where annual rainfall averages\n400 mm (16 in). The country is one of the world's largest producers of dates.\nPrior to 2009, wheat was grown using desalinated water for irrigation, but was\nphased out by 2016 due to costly water usage. As of 2009, the livestock\npopulation amounted to 7.4 million sheep, 4.2 million goats, half a million\ncamels, and a quarter of a million cattle.\n\nAlthough the jobs created by the roughly two million annual Hajj pilgrims do\nnot last long, they employ more people than the oil industry—40,000 temporary\njobs (butchers, barbers, coach drivers, etc.)—and generates US$2–3 billion in\nrevenue.\n\nIn 2008, the \"Initiative for Saudi Agricultural Investment Abroad\" was\nlaunched, leading to extensive billion-dollar purchases of large tracts of\nland around the world, including in Ethiopia, Indonesia, Mali, Senegal, and\nSudan. Described as land-grabbing by critics, in various instances these\npurchases have also led to uproars in the respective countries. Competing\nindustrializing nations with food security problems seeking agricultural land\ninclude China, South Korea, and India, as well as the Persian Gulf States of\nKuwait, Qatar, and the UAE."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Automotive",
    "text": "KSU Gazal-1\n\nIn 2010, the KSU Gazal-1, an SUV built by students at King Saud University,\nbecame the first mass-produced vehicle manufactured domestically in Saudi\nArabia. In 2022, the US car company Lucid Motors announced plans to build an\nelectric vehicle manufacturing plant in Jeddah. Construction began in May\n2022, and the plant will have capacity for 150,000 vehicles.\n\nToyota is the leading brand in Saudi Arabia, accounting for 30% of car sales\nin the country; they are followed by Kia and Hyundai who together make up 26%,\nand Renault/Nissan/Mitsubishi at 9%. The American Big Three auto makers (Ford,\nGM, and Chrysler) comprise the remainder. As for the quantity of vehicle units\nsold, in the first half of 2023, Toyota had the highest in the country with\n112,584 and the second-most was the Hyundai badge with 47,218."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Private sector",
    "text": "Saudi Arabia's private sector is dominated by a handful of big businesses in\nthe service sector, primarily in construction and real estate, such as Olayan,\nZamil, Almarai, Mobily, STC, SABIC, Sadara, Halliburton, Baker Hughes, Flynas,\nHilton, Zain, Yanbu Cement, Alhokair, MBC, Mahfouz, Al Rajhi, and Alfanar.\nThese firms are \"heavily dependent on government spending\", which is dependent\non oil revenues.\n\nFrom 2003 to 2013, \"several key services\" were privatized—municipal water\nsupply, electricity, telecommunications—and parts of education and health\ncare, traffic control, and car accident reporting were also privatized.\nAccording to Arab News columnist Abdel Aziz Aluwaisheg, \"in almost every one\nof these areas, consumers have raised serious concerns about the performance\nof these privatized entities.\"\n\nA relatively small sector until a boom in the 1980s, the food service industry\nin Saudi Arabia today is valued at around $13 billion.\n\nTo provide the best support for the private sector and entrepreneurs, the\nkingdom announced a decision approved by the Saudi Cabinet in July 2019\nallowing businesses in the country to be given the option to remain open 24\nhours a day. As of 2023, the average monthly salary for Saudis working in the\nprivate sector is SR9600, up 45% from SR6600 in the year 2018."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Regional GDP",
    "text": "Data are for the year 2022. Data calculated by dividing total GDP with\nprovided percentage.\n\nRanking  | Province | GDP (billion\nUS$)  | Percentage\nof total GDP\n---|---|---|---\n1  | Eastern | 243.793  | 22%\n2  | Riyadh | 243.793  | 22%\n3  | Mecca | 144.059  | 13%\n4  | _Rest of provinces_ | _476.504_ | _43%_\n5  |  Saudi Arabia | 1,108.149  | 100%"
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Trade",
    "text": "Saudi Arabian exports in 2006\n\nIn April 2000, the government established the Saudi Arabian General Investment\nAuthority to encourage foreign direct investment in Saudi Arabia. Saudi Arabia\nmaintains a negative list of sectors in which foreign investment is\nprohibited, but the government planned to open some closed sectors such as\ntelecommunications, insurance, and power transmission/distribution over time.\n\nSaudi Arabia became a full World Trade Organization (WTO) member on 11\nDecember 2005. In 2019, the government established the General Authority for\nForeign Trade to enhance the kingdom's international commercial and investment\nactivities.\n\nIn early July 2020, Saudi Arabia announced the nomination of its former\nMinister of Economy and Saudi royal court adviser, Mohammad Al-Tuwaijri, for\nthe role of WTO's director-general. The nominations were made public about a\nmonth after the WTO reported the kingdom for copyrights infringement following\ndistribution of pirated sports broadcasting content on the state-owned\nbroadcast service, BeoutQ. The nomination of al-Tuwaijri received criticism\nfrom human rights groups in mid-August 2020, demanding the rejection of the\nSaudi nominee due to the kingdom's violation of human rights in addition to\nhis silence over it. On 7 October 2020, Al-Tuwaijri, along with other nominees\nfrom the UK and Kenya, lost the bid for the role due to lack of support, as\ncompared to the nominees from Nigeria and South Korea who qualified for the\nfinal round of selection.\n\nSaudi Arabia is part of the following trade organizations:\n\n* World Trade Organization (WTO)\n* International Monetary Fund (IMF)\n* International Chamber of Commerce (ICC)\n* International Organization for Standardization (ISO)\n* World Customs Organization (WCO)"
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Challenges",
    "text": "Among the challenges to the Saudi economy include halting or reversing the\ndecline in per capita income, improving education to prepare youth for the\nworkforce and providing them with employment, diversifying the economy,\nstimulating the private sector and housing construction, and diminishing\ncorruption and inequality. In answer to the question of why the Saudi economy\nis so dependent on foreign labor, the UN Arab Human Development Report blamed\nstunted social and economic development inhibited by lack of personal freedom,\npoor education, government hiring based on factors other than merit, and the\nexclusion of women."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Income drop",
    "text": "Despite possessing the second largest petroleum reserves in the world, per\ncapita income dropped from approximately $18,000 at the height of the oil boom\n(1981) to $7,000 in 2001, according to one estimate. As of 2013, due to the\nrapid population growth of Saudi Arabia, per capita income in Saudi was \"a\nfraction of that of smaller Persian gulf neighbors\", even less than petroleum-\npoor Bahrain.\n\nUnlike most developed countries, where GDP growth is a function of increases\nin productivity and inputs such as employment, in Saudi Arabia the fluctuation\nof oil prices is the most important factor in the growth or decline of\ndomestic production. \"Saudi reserves are steadily being depleted, and no\nsignificant new discoveries have been found to replace them,\" according to\nMiddle East journalist Karen House.[_as of?_] Saudi population grew sevenfold\nfrom 1960 to 2010, and petrol prices are subsidized and cost users less than\nequivalent quantities of bottled water. With production stagnant, growth in\npopulation and domestic energy consumption means a decline in per capita\nincome unless oil prices rise to match that growth.\n\nAfter 2015, Saudi Arabia embarked on several initiatives, including Vision\n2030, aimed at reducing its dependency on oil by investing in other sectors\nsuch as tourism, entertainment, and technology. [] . Despite a decline in oil\nGDP, Saudi Arabia's GDP is expected to grow due to the increase in non-oil\nGDP. In the second quarter of 2024, Saudi Arabia's GDP contracted by 0.4%\nyear-on-year, primarily due to an 8.5% decline in oil-related activities.\nHowever, non-oil activities grew by 4.4%, contributing to a seasonally\nadjusted growth of 1.4% compared to the previous quarter.\n\nAs of 2024, Saudi Arabia's GDP per capita has surpassed all other GCC\ncountries except Qatar and the United Arab Emirates. Saudi Arabia's GDP per\ncapita is estimated to be approximately $33,040 in nominal terms, ranking it\n35th globally, and $70,333 in purchasing power parity (PPP) terms, ranking it\nas the 15th highest in the world []"
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Demographics",
    "text": "The Saudi population is young. About 51% of the total population are under the\nage of 25 (as of February 2012). According to a 2013 report by the\nInternational Monetary Fund, up to 1.6 million young nationals of the Persian\nGulf countries (of which Saudi Arabia is the largest) will enter the workforce\nfrom 2013 to 2018, but the economies of those countries will have jobs in the\nprivate sector for less than half (approximately 600,000)."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.3",
    "section_name": "Education",
    "text": "According to _The Economist_ , the Saudi government has attempted in past\nyears to raise employment by forcing \"companies to fill at least 30% of their\npositions\" with Saudi citizens. However, \"employers complained bitterly about\nthe lack of skills among young locals; years of rote-learning and religious\ninstruction fail to prepare them for the job market.\" However, many argue that\nyoung Saudis couldn't compete with foreigners due to the low compensation and\nsalaries most companies had used to offer for employees from Asian, Indian\nsubcontinent, and other Arab poor countries, which this cheap labor happily\naccepts; in addition to the bad work conditions, culture, and environment\npresent in most of the Saudi private sector, largely due to the fact that it\nwas initially modeled to accommodate very-low-income employees from other\nnations, not the Saudi medium-income and somewhat highly educated population.\nAs a consequence, \"the quota has now been dropped and replaced with a more\nflexible system\".\n\nAccording to scholar David Commins, the kingdom depends \"on huge numbers of\nexpatriate workers to fill technical and administrative positions\" in part\nbecause of an educational system that, despite \"generous budgets\", has\nsuffered from \"poorly trained teachers, low retention rates, lack of rigorous\nstandards, weak scientific and technical instruction and excessive attention\nto religious subjects\".\n\nA 2015 survey conducted by Bayt.com showed that over a quarter (28%) of\nprofessionals in North Africa and the Middle East believe that there is a\nskills shortage in their country of residence. This belief was even more\nprominent among respondents in Saudi Arabia (39%)."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.4",
    "section_name": "Innovation",
    "text": "Saudi has not been a hotbed of technological innovation. The number of Saudi\npatents registered in the United States between 1977 and 2010 came to 382—less\nthan twelve per year—compared to 84,840 patents for South Korea or 20,620 for\nIsrael during that period. However, in 2017 Saudi Arabia was granted 664\npatents by the United States Patent and Trademark Office, ranking 23rd among\n92 countries. The number of granted patents was double that of all Arab\ncountries combined during the same period."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.5",
    "section_name": "Bureaucracy",
    "text": "Business journalist Karen House criticized the Saudi bureaucracy, explaining\nthat someone seeking to start a business in Saudi Arabia:\n\n> has to complete innumerable applications and documents at multiple layers of\n> multiple ministries, which invariably requires seeking favours from various\n> patronage networks and accumulating obligations along the way, most probably\n> including having to hire less-than-competent dependents of his patrons.\n> Then, for any business of any size, government contracts, not private\n> competition, are the financial lifeblood. So this means more patrons, more\n> favours, and more obligations. Not surprisingly, Saudi businesses that can\n> compete outside the protected Saudi market are few."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.6",
    "section_name": "Corruption",
    "text": "The cost of maintaining the Royal Family is estimated by some to be about\nUS$10 billion per year.\n\nA 2005 survey by the Riyadh Chamber of Commerce found that 77% of businessmen\npolled felt they had to 'bypass' the law to conduct their operations. By 2012,\n\"businessmen say it has only gotten worse\". Saudi Arabia has been severely\ncriticized for failing to tackle money laundering and international terrorism\nfinancing. A report released by the Financial Action Task Force on 24\nSeptember 2018, says, \"Saudi Arabia is not effectively investigating and\nprosecuting individuals involved in larger scale or professional [money\nlaundering] activity\" and is \"not effectively confiscating the proceeds of\ncrime\"."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.7",
    "section_name": "Poverty",
    "text": "Estimates of the number of Saudis below the poverty line range from between\n12.7% and 25%. Press reports and private estimates as of 2013 \"suggest that\nbetween 2 million and 4 million\" of the country's native Saudis live on \"less\nthan about $530 a month\" – about $17 a day – considered the poverty line in\nSaudi Arabia.\n\n\nAccording to UNESCWA Oman and Saudi Arabia have the highest poverty rates\namong GCC nations, at 10.1% and 13.6% respectively and Saudi Arabia saw a\nnotable decline in poverty from 18.2% in 2010 to 13.6% in 2021.\n\nThe Saudi state discourages calling attention to or complaining about poverty.\nIn December 2011, days after the Arab Spring uprisings, the Saudi interior\nministry detained reporter Feros Boqna and two colleagues (Hussam al-Drewesh\nand Khaled al-Rasheed) and held them for almost two weeks for questioning\nafter they uploaded a 10-minute video on the topic (_Mal3ob 3alena_ , or 'We\nare being cheated') to YouTube. Authors of the video claim that 22% of Saudis\nare considered to be poor (2009) and 70% of Saudis do not own their houses.\nStatistics on the issue are not available through the UN resources because the\nSaudi government does not issue poverty figures. Observers researching the\nissue prefer to stay anonymous because of the risk of being arrested, like\nFeras Boqna."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.8",
    "section_name": "Housing",
    "text": "50% of Saudi Arabia's citizens owned their own home in 2017, a rise from 30%\nin 2011 but below the international average rate of 70%. In 2011, analysts\nestimated 500,000 new homes per year were needed to match the growth in Saudi\npopulation, but as of early 2014 only 300,000 to 400,000 houses per year were\nbeing built.\n\nOne problem is that the government Real Estate Development Fund (REDF)—which\nprovides 81% of all loans for housing—had an 18-year waiting list for loans\ndue to pent-up demand. Another is that the REDF's maximum loan is 500,000 SR\n($133,000), while in 2012 the average price for a small free-standing home in\nRiyadh is more than double that—1.23 million SR ($328,000). However, as part\nof the economic reforms undertaken by the government to enhance national\nliving standards, new funding solutions have been established to boost the\nmortgages for existing and new borrowers to help finance their housing plans.\nThis was announced in August 2018 by the Minister of Housing, Mr. Majed Al-\nHogail.\n\nA major reason for the high cost of housing is the high cost of land. In urban\nareas, the price of land has been bid up because nearly all of it is owned by\nthe Saudi elite (members of the royal family or other wealthy Saudis), who\nhave lobbied the government for land \"giveaways\". Landlords have seen prices\nrocket by 50% from 2011 to 2013. The owners benefit from these price increases\nas they hold the land for future development. To deal with the key \"land\nbanking\" issue, the Minister of Housing suggested in 2013 that vacant property\nwithin city limits could be subject to a tax. However, no firm plans for any\ntax have been unveiled."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "9.9",
    "section_name": "Private sector growth",
    "text": "In 2018, the imposition of a 5% value-added tax (VAT) brought private-sector\ngrowth to a halt. Consumer spending was also restrained after a sharp increase\nin prices for energy, electricity, and water earlier in 2018. The kingdom\nwitnessed a mass departure of around 750,000 foreign workers after imposing\nnew government levies on ex-pat workers. The government is also forcing small-\nbusiness owners to hire Saudi nationals at comparatively higher wages than\nforeign workers. Gaining money from large, direct foreign investments is also\nnot working in favor of the government. Rich Saudis are reluctant to invest\nwithin the kingdom due to the fear of triggering government scrutiny.\n\nOn 11 May 2020, the government announced that it would triple the kingdom's\nVAT on goods and services, raising it from 5% to 15%. It also stated that the\nincrease in VAT—introduced due to the country's current financial crisis due\nto plummeting oil prices and impact of coronavirus—would also be followed by a\ncut in monthly allowance for state workers worth approximately $266, and\nfinancial benefits for contractors. Aramco decreased the production of its\nArab Light grade of crude oil by a significant amount[_by how much?_] to be\nshipped to Asia. The firm also cut down oil pricing for its US buyers\nfollowing wavering demand for fuel due to the global relapse of the\ncoronavirus pandemic.\n\nAccording to the General Authority for Statistics, Saudi Arabia's inflation\naccelerated to 6.2% in August 2020, as compared to the same month last year.\nThe report states that the annual inflation rate increased from only 0.5% (in\nJune) to 6.1% (in July), before the increase of VAT to 15% from 5% was\nintroduced, effective from 1 July 2020."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Investment",
    "text": "Saudi Arabia has two stock exchanges, the Tadawul and The Saudi Parallel\nMarket (Nomu), whose financial markets are regulated by the Capital Market\nAuthority. The stock market capitalization of listed companies in Saudi Arabia\nis valued at $2.22 trillion. According to the International Institute for\nManagement Development, Saudi Arabia experienced the largest improvement in\nbusiness competitiveness of all countries in 2019; the kingdom rose 13 places\nto 26th in the world."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "10.1",
    "section_name": "Doing business",
    "text": "Saudi Arabia is among the countries with the most notable improvement in doing\nbusiness, according to the World Bank Group's \"Doing Business\" 2020 report.\nThe country jumped 30 places to rank 62nd in ease of doing business, compared\nto the previous year. Previously, the kingdom had been declining in the\noverall rankings, from 22nd in 2013 to 92nd in 2018.\n\nAccording to the World Bank in 2019, Saudi Arabia had conducted reforms in\neight areas of business: (1) starting a business, (2) getting construction\npermits, (3) getting electricity, (4) getting credit, (5) protecting minority\ninvestors, (6) trading across borders, (7) enforcing contracts, and (8)\nresolving insolvency.\n\nSaudi Arabian companies dominate 2009's \"MEED 100\", with companies listed on\nthe Tadawul accounting for 29 out of the region's 100 biggest publicly quoted\ncompanies ranked by market capitalization. Just three of the 20 companies that\nhave dropped out of the top 100 over the past year are listed on the Saudi\nstock exchange.\n\nForeigners are allowed to wholly own limited liability companies in the\nmajority of industries. Non-Saudi nationals are required to obtain a foreign\ncapital investment license from the Saudi Arabian General Investment\nAuthority.\n\nWith a total of 291 foreign investor licenses issued in the second quarter of\n2019, the kingdom has witnessed an increase in international investment,\nreflecting the economic reforms under the Saudi Vision 2030. Obtaining a\nforeign investor license became more straightforward as it requires only two\ndocuments, and it is processed in three hours."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "10.1.1",
    "section_name": "Saudi Aramco",
    "text": "Saudi Aramco (officially the Saudi Arabian Oil Co.) is Saudi Arabia's national\noil, petroleum, and natural gas company headquartered in Dhahran. Saudi Aramco\nwas listed for public trading on 10 December 2019 and had a valuation as of\nUS$2 trillion as of 12 December 2019.\n\nSaudi Aramco has both the second largest proven crude oil reserves, which it\nclaims to be more than 260 billion barrels (4.1×1010 m3), and the largest\ndaily oil production. The company operates the world's largest single\nhydrocarbon network, the Master Gas System. Its yearly production is 3.479\nbillion barrels (553,100,000 m3), and it manages over 100 oil and gas fields\nin Saudi Arabia, including 284.8 trillion standard cubic feet (scf) of natural\ngas reserves. Saudi Aramco owns the Ghawar Field, the world's largest oil\nfield, and the Shaybah Field, another one of the world's largest oil fields.\n\nOn 16 November 2020, Saudi Aramco announced hiring banks to sell dollar-\ndenominated bonds with the aim of improving finances after the coronavirus\npandemic caused a sharp fall in the global demand for crude oil. Aramco's\nmulti-tranche offer was set to run between 3 and 50 years, depending on the\nmarket conditions. The banks hired for the transaction included Citi Bank,\nGoldman Sachs International, HSBC, JP Morgan, Morgan Stanley and NCB Capital.\nOther banks involved in the deal included BNP Paribas, BOC International, BofA\nSecurities, Credit Agricole, First Abu Dhabi Bank, Mizuho, MUFG, SMBC Nikko\nand Societe Generale.\n\nIn 2021, Saudi Aramco made a net-income of 95.5 billion riyals ($25.5 billion)\nin the second quarter alone, which was the highest level since 2018."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "10.1.2",
    "section_name": "SABIC",
    "text": "The Saudi Arabian Basic Industries Corporation (SABIC) was established by a\nroyal decree in 1976 to produce chemicals, polymers, and fertilizers. In 2008,\nSABIC was Asia's largest (in terms of market capitalization) and most\nprofitable publicly listed non-oil company, the world's fourth-largest\npetrochemical company, the second-largest producer of ethylene glycol and\nmethanol in the world, the third-largest producer of polyethylene and overall\nthe fourth-largest producer of polypropylene and polyolefin. It ranked 186th\nas the world's largest corporation on the Fortune Global 500 for 2009.\nStandard & Poor's and Fitch Ratings claimed SABIC to be the world's largest\nproducer of polymers and the Persian Gulf region's largest steel producer for\n2005 and assigned SABIC an \"A\" corporate credit rating. In 2008, Fortune 500\nranking records SABIC revenues at $40.2 billion, profits at $5.8 billion, and\nassets standing at $72.4 billion."
  },
  {
    "chapter_name": "Economy of Saudi Arabia",
    "chapter_id": "1",
    "section_number": "10.1.3",
    "section_name": "Ma'aden (company)",
    "text": "Ma'aden was formed as a Saudi joint stock company on 23 March 1997 for the\npurpose of facilitating the development of Saudi Arabia's mineral resources.\nMa'aden's activities have focused on its active gold business which has grown\nin recent years to include the operation of five gold mines: Mahd Ad Dahab, Al\nHajar, Sukhaybarat, Bulghah, and Al Amar. Ma'aden is now expanding its\nactivities beyond its gold business with the development of phosphates,\naluminium, and other projects. In addition, since its formation, Ma'aden\n(through the Ministry of Petroleum and Mineral Resources) has collaborated\nwith the government and local legislators to develop a regulatory framework\nfor the governance of the mining industry."
  }
]