[
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article **needs additional citations forverification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  \n_Find sources:_ \"Economy of Colombia\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( July 2024)__(Learn how and when to remove this\nmessage)_  \n---|---  \n| This article's **factual accuracy may be compromised due to out-of-date\ninformation**. Please help update this article to reflect recent events or\nnewly available information. _( March 2013)_  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nThe **economy of Colombia** is the fourth largest in Latin America as measured\nby gross domestic product and the third-largest economy in South America.\nThroughout most of the 20th century, Colombia was Latin America's 4th and 3rd\nlargest economy when measured by nominal GDP, real GDP, GDP (PPP), and real\nGDP at chained PPPs. Between 2012 and 2014, it became the third largest in\nLatin America by nominal GDP. As of 2024, the GDP (PPP) per capita has\nincreased to over US$19,000, and real gross domestic product at chained PPPs\nincreased from US$250 billion in 1990 to over US$1 trillion in 2024. Poverty\nlevels were as high as 65% in 1990, but decreased to under 30% by 2014, and\n27% by 2018. They decreased by an average of 1.35% per year since 1990.\n\nPetroleum is Colombia's main export, representing over 45% of Colombia's\nexports. Manufacturing represents nearly 12% of Colombia's exports and grows\nat a rate of over 10% a year. Colombia has the fastest growing information\ntechnology industry in the world, and has the longest fibre optic network in\nLatin America. Colombia also has one of the largest shipbuilding industries in\nthe world outside Asia.\n\nModern industries like shipbuilding, electronics, automobile, tourism,\nconstruction, and mining grew dramatically during the 2000s and 2010s.\nHowever, most of Colombia's exports are still commodity-based. Colombia is\nLatin America's 2nd-largest producer of domestically made electronics and\nappliances, following Mexico.\n\nSince the early 2010s, the Colombian government has shown interest in\nexporting modern Colombian pop culture to the world (which includes video\ngames, music, films, television shows, fashion, cosmetics, and food) as a way\nof diversifying the economy and entirely changing the image of Colombia. This\nhas inspired a national campaign similar to the Korean Wave. Colombia is only\nbehind Mexico in cultural exports and is already a regional leader in cosmetic\nand beauty exports.\n\nWealth is poorly distributed and Colombia is among the most unequal societies\nin the world, with a Gini index of approximately 0.̟6. For example, according\nto the World Bank, in 2010, the richest 20% of the population owned 60.2% of\nthe wealth and the poorest 20% only 3%, and 15.8% of Colombians lived on less\nthan $2 a day. In 2021, more than 54% of Colombian families are food insecure\nand more than 560,000 children under the age of five are chronically\nundernourished.\n\nThe informal economy is estimated at 47% in 2020. There is no welfare state in\nColombia, which has almost no unemployment or pension insurance system. As a\nresult, only one million elderly people have pensions (and five million are\nwithout) and social assistance is very low. Many people in their 70s and 80s\nare forced to continue working or beg. The country is said to be the most\nunequal in the Organisation for Economic Co-operation and Development (OECD).",
    "openai_summarised_points": [
      "• The economy of Colombia is the fourth largest in Latin America based on gross domestic product (GDP) and the third-largest in South America.",
      "• Throughout most of the 20th century, Colombia ranked as Latin America's 4th and 3rd largest economy when measured by nominal GDP, real GDP, GDP (PPP), and real GDP at chained PPPs.",
      "• Between 2012 and 2014, Colombia became the third-largest economy in Latin America by nominal GDP.",
      "• As of 2024, Colombia's GDP (PPP) per capita has surpassed US$19,000.",
      "• Colombia's real gross domestic product at chained PPPs increased from approximately US$250 billion in 1990 to over US$1 trillion in 2024.",
      "• Poverty levels in Colombia were as high as 65% in 1990, but decreased to under 30% by 2014, and further to 27% by 2018.",
      "• The annual average reduction in poverty since 1990 has been approximately 1.35%.",
      "• Petroleum is Colombia's main export, accounting for over 45% of the country's total exports.",
      "• Manufacturing constitutes nearly 12% of Colombia's exports and has been growing at a rate exceeding 10% annually.",
      "• Colombia has the fastest-growing information technology industry in the world and possesses the longest fibre optic network in Latin America.",
      "• The country has one of the largest shipbuilding industries outside Asia.",
      "• Modern industries such as shipbuilding, electronics, automobile manufacturing, tourism, construction, and mining experienced dramatic growth during the 2000s and 2010s.",
      "• Despite industrial growth, most of Colombia's exports remain commodity-based.",
      "• Colombia is Latin America's second-largest producer of domestically made electronics and appliances, following Mexico.",
      "• Since the early 2010s, the Colombian government has aimed to export modern Colombian pop culture—including video games, music, films, television shows, fashion, cosmetics, and food—as a strategy to diversify the economy and improve Colombia's international image.",
      "• This cultural export initiative is inspired by a campaign similar to the Korean Wave.",
      "• Colombia ranks only behind Mexico in cultural exports within Latin America and is a regional leader in cosmetic and beauty exports.",
      "• Wealth distribution in Colombia is highly unequal, with a Gini index of approximately 0.6, making it one of the most unequal societies globally.",
      "• According to the World Bank in 2010, the richest 20% of the population owned 60.2% of the wealth, while the poorest 20% owned only 3%.",
      "• In 2010, 15.8% of Colombians lived on less than US$2 per day.",
      "• By 2021, over 54% of Colombian families experienced food insecurity, and more than 560,000 children under five suffered from chronic undernutrition.",
      "• The informal economy in Colombia was estimated at 47% in 2020.",
      "• Colombia lacks a comprehensive welfare state, with minimal unemployment and pension insurance systems.",
      "• Only about one million elderly people receive pensions, leaving five million without any pension coverage.",
      "• Social assistance in Colombia is very limited, forcing many elderly individuals in their 70s and 80s to continue working or beg.",
      "• Colombia is considered the most unequal country among OECD members."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:15:31.107908",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3681,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "16th–19th centuries",
    "text": "European explorers reached what is now Colombian territory as early as 1510 in\nSanta María Antigua del Darién (in present-day Chocó department). For the next\ncouple of decades Colombia, and South America in general, remained largely\nunexplored. From 1533 to 1600, Europeans began expeditions into the interior\nof current Colombia. The in of these expeditions was mainly to conquer new\nlands and exploit village resources. Legends of El Dorado that reached\nSpaniard explorers continued to fuel exploration and raiding of Indian\nvillages.\n\nIn the 17th century, Spanish conquerors explored Colombia and made the first\nsettlements, and this was the beginning of Colombia's modern economic history.\nMajor conquistadors from this period were Pedro de Heredia, Gonzalo Jimenez de\nQuesada, Sebastián de Belalcazar, and Nikolaus Federmann.\n\nDuring the 16th and 17th centuries, the colonial settlements in Colombia\nserved purposes of extraction of precious metals and other natural resources,\nand later slavery trade. This economic arrangement left the Colony with little\nroom for building solid institutionality for economic development. The main\nnon-extractive institutions emerging in this centuries were the fortified port\nof Cartagena and the Viceroyalty of New Granada. Cartagena developed military\ndefenses mainly out of necessity from frequently having to deal with pirate\nattacks. A primitive form of colonial administration was organized in Santa fé\nde Bogotá with the Viceroyalty of New Granada, especially under the tenure of\nJosé Solís Folch de Cardona (1753–1761), who conducted a census and built\nroads, bridges and aqueducts.\n\nFollowing the Thousand Days' War (1899–1902), Colombia experienced a coffee\nboom that catapulted the country into the modern period, bringing the\nattendant benefits of transportation, particularly railroads, communications\ninfrastructure, and the first major attempts at manufacturing.",
    "openai_summarised_points": [
      "• European explorers first reached what is now Colombian territory in 1510, specifically in Santa María Antigua del Darién, located in present-day Chocó department.",
      "• For the subsequent decades, Colombia and South America in general remained largely unexplored by Europeans.",
      "• Between 1533 and 1600, European expeditions into the interior of present-day Colombia increased, primarily aimed at conquering new lands and exploiting local village resources.",
      "• Legends of El Dorado, which reached Spanish explorers, continued to motivate further exploration and raiding of indigenous villages during this period.",
      "• In the 17th century, Spanish conquerors explored Colombia extensively and established the first settlements, marking the beginning of Colombia's modern economic history.",
      "• Major conquistadors involved in this period included Pedro de Heredia, Gonzalo Jiménez de Quesada, Sebastián de Belalcázar, and Nikolaus Federmann.",
      "• During the 16th and 17th centuries, colonial settlements in Colombia primarily focused on the extraction of precious metals and other natural resources, as well as later engaging in the transatlantic slave trade.",
      "• This extractive economic model limited the development of robust institutional structures for sustained economic growth within the colony.",
      "• The main non-extractive institutions established during these centuries were the fortified port of Cartagena and the Viceroyalty of New Granada.",
      "• Cartagena developed significant military defenses mainly due to frequent pirate attacks, reflecting its strategic importance and security concerns.",
      "• A primitive colonial administrative system was organized in Santa Fé de Bogotá under the Viceroyalty of New Granada, especially during the tenure of José Solís Folch de Cardona (1753–1761).",
      "• Under José Solís Folch de Cardona’s administration, efforts included conducting a census and constructing infrastructure such as roads, bridges, and aqueducts.",
      "• Following the Thousand Days' War (1899–1902), Colombia experienced a coffee boom that significantly contributed to modernizing the country.",
      "• The coffee boom facilitated improvements in transportation infrastructure, notably railroads, and communications, alongside initial efforts to develop manufacturing industries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:15:36.662215",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1918,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "20th century",
    "text": "Colombia's consistently sound economic policies and aggressive promotion of\nfree trade agreements in recent years have bolstered its ability to weather\nexternal shocks. Real GDP has grown more than 4% per year for the past three\nyears, continuing almost a decade of strong economic performance.\n\nIn 1990, the administration of President César Gaviria Trujillo (1990–94)\ninitiated economic liberalism policies or \"apertura economica\" and this has\ncontinued since then, with tariff reductions, financial deregulation,\nprivatization of state-owned enterprises, and adoption of a more liberal\nforeign exchange rate. Almost all sectors became open to foreign investment\nalthough agricultural products remained protected.\n\nThe original idea of his then Minister of Finance, Rudolf Homes, was that the\ncountry should import agricultural products in which it was not competitive,\nlike maize, wheat, cotton and soybeans and export the ones in which it had an\nadvantage, like fruits and flowers. In ten years, the sector lost 7,000 km2 to\nimports, with a critical impact on employment in rural areas. Still, this\npolicy makes food cheaper for the average Colombian than it would be if\nagricultural trade were more restricted.\n\nUntil 1997, Colombia had enjoyed a fairly stable economy. The first five years\nof liberalization were characterized by high economic growth rates of between\n4% and 5%. The Ernesto Samper administration (1994–98) emphasized social\nwelfare policies which targeted Colombia's lower income population. These\nreforms led to higher government spending which increased the fiscal deficit\nand public sector debt, the financing of which required higher interest rates.\nAn over-valued peso inherited from the previous administration was maintained.\n\nThe economy slowed, and by 1998 GDP growth was only 0.6%. In 1999, the country\nfell into its first recession since the Great Depression. The economy shrank\nby 4.5% with unemployment at over 20%. While unemployment remained at 20% in\n2000, GDP growth recovered to 3.1%. Unemployment in 2020 has improved compared\nto two decades ago to 12.20%.\n\nThe administration of President Andrés Pastrana Arango, when it took office on\n7 August 1998, faced an economy in crisis, with the difficult internal\nsecurity situation and global economic turbulence additionally inhibiting\nconfidence. As evidence of a serious recession became clear in 1999, the\ngovernment took a number of steps. It engaged in a series of controlled\ndevaluations of the peso, followed by a decision to let it float. Colombia\nalso entered into an agreement with the International Monetary Fund which\nprovided a $2.7 billion guarantee (extended funds facility), while committing\nthe government to budget discipline and structural reforms.",
    "openai_summarised_points": [
      "• Colombia's robust economic policies and proactive promotion of free trade agreements in recent years have enhanced its resilience to external shocks.",
      "• Real GDP growth has exceeded 4% annually for the past three years, continuing nearly a decade of strong economic performance.",
      "• In 1990, President César Gaviria Trujillo (1990–94) initiated economic liberalism policies known as \"apertura economica,\" which included tariff reductions, financial deregulation, privatization of state-owned enterprises, and adoption of a more liberal foreign exchange rate.",
      "• These liberalization policies resulted in almost all sectors becoming open to foreign investment, with the exception of agricultural products, which remained protected.",
      "• The original strategy, devised by Minister of Finance Rudolf Homes, was for Colombia to import agricultural products in which it was not competitive (such as maize, wheat, cotton, and soybeans) and to export products where it had an advantage (such as fruits and flowers).",
      "• Over ten years, this policy led to the loss of 7,000 km² of agricultural land to imports, significantly impacting employment in rural areas.",
      "• Despite these changes, the policy made food cheaper for the average Colombian compared to a scenario with more restricted agricultural trade.",
      "• Until 1997, Colombia maintained a relatively stable economy, with the first five years of liberalization experiencing high growth rates of 4% to 5%.",
      "• The Ernesto Samper administration (1994–98) prioritized social welfare policies targeting lower-income populations, which increased government spending, fiscal deficit, and public sector debt, necessitating higher interest rates for financing.",
      "• An over-valued peso, inherited from previous administrations, was maintained during this period.",
      "• By 1998, GDP growth had slowed to only 0.6%, and the country entered its first recession since the Great Depression, with a GDP shrinkage of 4.5% and unemployment exceeding 20%.",
      "• In 2000, unemployment remained at 20%, but GDP growth recovered to 3.1%.",
      "• As of 2020, unemployment had improved to 12.20%, indicating progress over two decades.",
      "• President Andrés Pastrana Arango took office on 7 August 1998, facing an economy in crisis compounded by internal security issues and global economic turbulence, which undermined confidence.",
      "• In response to the recession, the government implemented controlled devaluations of the peso, eventually allowing it to float freely.",
      "• Colombia entered into an agreement with the International Monetary Fund (IMF), securing a $2.7 billion Extended Fund Facility (EFF), which mandated fiscal discipline and structural reforms."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:15:45.031905",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2755,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "21st century",
    "text": "By early 2000 there had been the beginning of an economic recovery, with the\nexport sector leading the way, as it enjoyed the benefit of the more\ncompetitive exchange rate, as well as strong prices for petroleum, Colombia's\nleading export product. Prices of coffee, the other principal export product,\nhave been more variable.\n\nEconomic growth reached 3.1% during 2000 and inflation 9.0%. Inflation by 2021\nhas stabilized at 3.30%. Colombia's international reserves remained stable at\naround $8.35 billion in the year 2000 growing to $58.57 billion by 2021, and\nColombia has successfully remained in international capital markets.\nColombia's total foreign debt at the end of 1999 was $34.5 billion with $14.7\nbillion in private sector and $19.8 billion in public sector debt. Major\ninternational credit rating organizations had dropped Colombian sovereign debt\nbelow investment grade, primarily as a result of large fiscal deficits, which\ncurrent policies are seeking to close. As of 2021 Colombia has recovered its\ninvestment grade rating.\n\nFormer president Álvaro Uribe (elected 7 August 2002) introduced several\nneoliberal economic reforms, including measures designed to reduce the public-\nsector deficit below 2.5% of GDP in 2004. The government's economic policy and\ncontroversial democratic security strategy have engendered a growing sense of\nconfidence in the economy, particularly within the business sector, and GDP\ngrowth in 2003 was among the highest in Latin America, at over 4%. This growth\nrate was maintained over the next decade, averaging 4.8% from 2004 to 2014.\n\nAccording to figures from Dane, monetary poverty went from 37.2% in 2010 to\n26.9% in 2017, which indicates a higher income for the most vulnerable\nhouseholds. During the Santos government, there was an inflationary period\nthat was also a response to the strong external shock of the fall in oil\nprices. It was a period of contained instability, although inflation\nincreased, no company declared bankruptcy and there was no instability in the\nfinancial system.\n\nThe Santos period managed an increase in GDP of 4% in 2010, which peaked in\n2011 to 6.6%. Thereafter it remained at 4% in 2012, 4.9% in 2013 and 4.4% in\n2014. In 2011, Colombia recovered its BBB− investment grade, which was raised\nin 2013 to BBB. As a result of sustained growth, during the eight years of the\nSantos government, 3.5 million jobs were created, while 5.4 million people\nwere lifted out of poverty.\n\nThe focus of Santos' second term was to reach a peace agreement with the FARC\nwhose economic effects, according to assumptions, could imply a GDP growth of\nup to two additional percentage points. Santos' best legacy is precisely the\none related to security since this will have an effect in the medium and long\nterm in terms of investment decisions, job creation, and the beginning of a\ngreat revolution in the country's infrastructure: war prevented development in\nthe most affected areas for centuries.\n\nColombia's President Iván Duque withdrew a controversial tax reform bill\nfollowing four weeks of huge protests across the country starting 28 April\n2021. In 2021, Colombia registered an increase in Gross Domestic Product of\nmore than 10%, as a result of a rebound effect that derived from the 6.8%\ncollapse a year earlier, caused by the economic closures decreed to stop the\ncoronavirus pandemic. The pandemic exacerbated poverty. In 2021, official\nfigures showed that 39% of Colombians – out of a population of 51.6 million\ninhabitants – were in a condition of monetary poverty. Although it shows a\nslight improvement compared to 2020 (42.5%), it meant a setback of at least a\ndecade.\n\nThe greatest increase in the value of the debt also occurred in the Duque\ngovernment, according to figures from the Bank of the Republic. Between 2020\nand 2021 the balance increased by 17 billion dollars, and from 2019 to 2020 it\nincreased by 16 billion. That figure, which corresponds to a deficit of 7.1\npercent of GDP, was the debt that the Central National Government or GNC (the\nState without its companies or regional entities) had in 2021, according to\nthe fiscal closing bulletin.\n\nIn the Duque government, specifically between May and June 2020, 66.7 percent\nof the country's gold reserves were sold, which went from 710.5 to 237.4\nmillion dollars. The decision was made by the Bank of the Republic. The sale\nreceived criticism because although it was done at a time of rising prices –\nafter five years in which this did not happen – it was before gold reached a\nrecord price.\n\nThe COVID-19 recession had a profound impact on Colombia's economy, with\nsignificant disruptions to GDP components, unemployment, and inflation.\nHousehold consumption, which is a key driver of the economy, saw the sharpest\ndecline, dropping by 20% in the second quarter of 2020 due to lockdowns,\nincome uncertainty, and limited mobility. Despite a partial recovery in Q3\n2020, high unemployment (peaking at 19.9%) and ongoing uncertainties slowed\nthe recovery of consumer spending. Investment also decreased during the\npandemic, with businesses reducing capital expenditures amid uncertainty\n(-31.6%). Although investment exhibited a significant recovery in Q3 2020,\nreaching 26%, the drop in global demand for Colombia's exports—particularly\noil and coal—influenced a slow recovery as indicated by 10% growth rate of\nreal GDP following a 16% trough. Government spending rose in response to the\npandemic, driven by fiscal stimulus and social aid programs, helping to\nstabilize the economy.\n\nThe deterioration of the labor market severely affected sectors such as\nretail, hospitality, and informal employment, deepening the economic\ncontraction. Although unemployment gradually decreased to 14.75% by early\n2021, it stayed significantly above the pre-pandemic levels. Inflation, on the\nother hand, remained low in Q1 2020, but turned into deflation for the\nremaining of 2020 and the first quarter of 2021, signaling a significant\nweakened aggregate demand. Overall, Colombia's real GDP contracted by about\n16% in Q2 2020, due to declines in household consumption and investment. While\nthere were modest signs of recovery by early 2021, the combination of high\nunemployment and deflation continued to hinder the full economic rebound.",
    "openai_summarised_points": [
      "• By early 2000, Colombia experienced the beginning of an economic recovery, primarily driven by the export sector, which benefited from a more competitive exchange rate and strong petroleum prices, its leading export product.",
      "• Prices of coffee, the second principal export product, remained variable during this period.",
      "• Colombia's economic growth reached 3.1% in 2000, with inflation at 9.0%; by 2021, inflation stabilized at 3.30%.",
      "• International reserves remained stable at approximately $8.35 billion in 2000 and increased significantly to $58.57 billion by 2021, reflecting successful participation in international capital markets.",
      "• Colombia's total foreign debt at the end of 1999 was $34.5 billion, comprising $14.7 billion in private sector debt and $19.8 billion in public sector debt.",
      "• Major international credit rating agencies downgraded Colombian sovereign debt below investment grade due to large fiscal deficits, but by 2021, Colombia recovered its investment grade rating.",
      "• Former President Álvaro Uribe, elected on 7 August 2002, implemented neoliberal economic reforms aimed at reducing the public-sector deficit below 2.5% of GDP by 2004.",
      "• Uribe's economic policies and the controversial democratic security strategy fostered increased confidence in the economy, with GDP growth in 2003 exceeding 4%, one of the highest in Latin America.",
      "• From 2004 to 2014, Colombia maintained an average GDP growth rate of 4.8%.",
      "• According to Dane, monetary poverty decreased from 37.2% in 2010 to 26.9% in 2017, indicating improved income levels among the most vulnerable households.",
      "• During the Santos administration, there was an inflationary period triggered by external shocks such as falling oil prices; despite inflation increases, no companies declared bankruptcy, and the financial system remained stable.",
      "• Under Santos, GDP growth was 4% in 2010, peaking at 6.6% in 2011; subsequent years saw growth rates of 4% in 2012, 4.9% in 2013, and 4.4% in 2014.",
      "• Colombia regained its BBB− investment grade rating in 2011, which was upgraded to BBB in 2013.",
      "• Over the eight years of Santos's presidency, approximately 3.5 million jobs were created, and 5.4 million people were lifted out of poverty.",
      "• Santos's second term prioritized reaching a peace agreement with FARC, with the expectation that peace could boost GDP growth by up to two additional percentage points, fostering long-term investment, job creation, and infrastructure development.",
      "• President Iván Duque withdrew a controversial tax reform bill on 28 April 2021 following four weeks of nationwide protests.",
      "• In 2021, Colombia's GDP grew by over 10%, rebounding from a 6.8% contraction in 2020 caused by COVID-19 pandemic restrictions.",
      "• The pandemic worsened poverty levels, with official data indicating 39% of Colombians (out of a population of 51.6 million) were in monetary poverty in 2021, a slight improvement from 42.5% in 2020 but representing a setback of at least a decade.",
      "• The greatest increase in Colombia’s debt occurred during Duque's government, with the total debt rising by $17 billion between 2020 and 2021, and by $16 billion from 2019 to 2020, reaching a deficit of 7.1% of GDP in 2021.",
      "• Between May and June 2020, the Bank of the Republic sold 66.7% of Colombia's gold reserves, reducing holdings from $710.5 million to $237.4 million, a decision criticized for timing, as gold prices were rising but before reaching record highs.",
      "• The COVID-19 recession caused a significant economic downturn, with GDP components, unemployment, and inflation all affected; household consumption declined sharply by 20% in Q2 2020 due to lockdowns and income uncertainty.",
      "• Despite partial recovery in Q3 2020, high unemployment (peaking at 19.9%) and ongoing uncertainties slowed economic rebound; investment decreased by 31.6%, though it recovered to 26% in Q3 2020.",
      "• Global demand for Colombia's exports, especially oil and coal, declined, contributing to a slow recovery with a 10% growth rate of real GDP after a 16% trough.",
      "• Government spending increased as a response to the pandemic, driven by fiscal stimulus and social aid programs, which helped stabilize the economy.",
      "• The labor market deterioration heavily impacted sectors such as retail, hospitality, and informal employment, deepening the economic contraction.",
      "• Unemployment gradually decreased to 14.75% by early 2021 but remained significantly above pre-pandemic levels.",
      "• Inflation was low in early 2020, turning into deflation for the remainder of 2020 and early 2021, indicating weakened aggregate demand.",
      "• Overall, Colombia's real GDP contracted by approximately 16% in Q2 2020, primarily due to declines in household consumption and investment; signs of recovery appeared by early 2021 but were hindered by high unemployment and deflation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:16:01.314889",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6270,
      "bullet_points_count": 28
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "| This section **is inlist format but may read better as prose**. You can help\nby converting this section, if appropriate. Editing help is available. _( July\n2016)_\n---|---\n\nIn the early 21st century, the Colombian economy grew in part because of\naustere government budgets, focused efforts to reduce public debt levels, an\nexport-oriented growth strategy, an improved security situation in the\ncountry, and high commodity prices. Growth slowed to 1.4 percent in 2017, and\nthen increased to 3.3 percent in 2019.\n\nPresident Uribe, who was in office from 2002 to 2010, examined opportunities\nincluding reforming the pension system, reducing high unemployment, achieving\ncongressional passage of a fiscal transfers reform, and exploring for new oil\nor producing ethanol. Colombia's Gini coefficient, a measure of inequality,\nwas one of the highest in South America. International and domestic financial\nanalysts warned of the growing central government deficit, which hovered at 5%\nof GDP. Nonetheless, confidence in the economy grew.\n\nThe middle class will represent 25% of the population in 2020 according to a\nsurvey by the daily newspaper _El Tiempo_. Official data indicate that 42.5%\nof the population lives below the poverty line. The social elevator is one of\nthe slowest in the world, as it takes an average of eleven generations for a\nfamily to rise out of poverty.\n\nThe tax system is one of the causes of Colombia's deep social inequalities.\nThe income tax (IRPP) is not very progressive (almost all taxpayers pay it at\na rate of between 19% and 28%, and the rate rises only slightly thereafter)\nand is levied mainly on salaries, with other categories of income being\nlargely underreported. Redistribution through the Colombian tax system is thus\nthe lowest in Latin America, even though it is on average very limited.",
    "openai_summarised_points": [
      "• In the early 21st century, the Colombian economy experienced growth driven by several factors, including austere government budgets, efforts to reduce public debt levels, an export-oriented growth strategy, an improved security situation, and high commodity prices.",
      "• The economic growth rate slowed to 1.4% in 2017, but increased to 3.3% in 2019.",
      "• President Álvaro Uribe, who served from 2002 to 2010, explored opportunities such as reforming the pension system, reducing high unemployment, passing a fiscal transfers reform through Congress, and exploring new oil production or ethanol development.",
      "• Colombia's Gini coefficient, a measure of income inequality, was among the highest in South America.",
      "• International and domestic financial analysts warned of a growing central government deficit, which hovered around 5% of GDP.",
      "• Despite fiscal concerns, confidence in the Colombian economy increased during this period.",
      "• The middle class was projected to constitute 25% of the population in 2020, according to a survey by the daily newspaper _El Tiempo_.",
      "• Official data indicated that 42.5% of the Colombian population lived below the poverty line.",
      "• The social mobility process in Colombia is notably slow, with an average of eleven generations required for a family to rise out of poverty.",
      "• The tax system is identified as a significant factor contributing to Colombia’s deep social inequalities.",
      "• The income tax (IRPP) in Colombia is relatively non-progressive, with most taxpayers paying between 19% and 28%, and only slight increases in the rate beyond this range.",
      "• Income tax is primarily levied on salaries, while other income categories are largely underreported.",
      "• Redistribution through the Colombian tax system is the lowest in Latin America, and overall redistribution efforts are very limited on average."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:16:06.826882",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1826,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Development of main indicators",
    "text": "The following table shows the main economic indicators in 1980–2019 (with IMF\nstaff stimtates in 2020–2025). Inflation below 5% is in green.\n\nYear | GDP\n(in bil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bil. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in percent) | Unemployment\n(in percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980 | 78.5 | 2,840.6 | 46.5 | 1,681.7 | 4.4% | 25.9% | 5.4% | n/a\n1981 | 87.9 | 3,110.9 | 50.6 | 1,792.3 | 2.3% | 27.4% | 6.6% | n/a\n1982 | 94.2 | 3,262.8 | 54.2 | 1,878.1 | 0.9% | 24.9% | 7.1% | n/a\n1983 | 99.4 | 3,371.2 | 53.9 | 1,827.2 | 1.6% | 19.5% | 8.7% | n/a\n1984 | 106.5 | 3,534.9 | 53.2 | 1,767.2 | 3.4% | 16.3% | 9.0% | n/a\n1985 | 113.3 | 3,785.6 | 48.6 | 1,623.0 | 3.1% | 23.9% | 8.7% | n/a\n1986 | 122.3 | 4,003.7 | 48.6 | 1,592.2 | 5.8% | 18.8% | 7.7% | n/a\n1987 | 132.0 | 4,234.3 | 50.6 | 1,623.4 | 5.4% | 23.3% | 7.4% | n/a\n1988 | 142.2 | 4,468.2 | 54.6 | 1,714.2 | 4.1% | 28.1% | 6.5% | n/a\n1989 | 152.9 | 4,704.3 | 55.0 | 1,693.4 | 3.4% | 25.9% | 6.8% | n/a\n1990 | 165.4 | 4,987.8 | 56.0 | 1,690.4 | 4.3% | 29.1% | 6.6% | n/a\n1991 | 175.0 | 5,171.3 | 57.9 | 1,711.7 | 2.4% | 30.3% | 6.4% | n/a\n1992 | 186.8 | 5,411.2 | 68.6 | 1,985.7 | 4.4% | 27.0% | 5.9% | n/a\n1993 | 202.2 | 5,746.1 | 77.7 | 2,208.3 | 5.7% | 22.4% | 5.0% | n/a\n1994 | 217.1 | 6,061.4 | 97.6 | 2,725.7 | 5.1% | 22.9% | 4.9% | n/a\n1995 | 233.2 | 6,401.5 | 110.5 | 3,034.1 | 5.2% | 20.9% | 5.6% | n/a\n1996 | 242.3 | 6,546.2 | 116.1 | 3,135.8 | 2.1% | 20.8% | 7.8% | 23.3%\n1997 | 255.0 | 6,798.3 | 127.4 | 3,398.0 | 3.4% | 18.5% | 7.9% | 25.3%\n1998 | 259.3 | 6,808.2 | 117.7 | 3,089.7 | 0.6% | 18.7% | 9.7% | 27.5%\n1999 | 251.9 | 6,530.5 | 103.1 | 2,672.6 | -4.2% | 10.9% | 13.1% | 34.0%\n2000 | 265.1 | 6,772.2 | 99.2 | 2,534.5 | 2.9% | 9.2% | 13.3% | 38.0%\n2001 | 275.7 | 6,951.6 | 97.6 | 2,460.3 | 1.7% | 8.0% | 15.0% | 41.1%\n2002 | 287.0 | 7,146.5 | 97.3 | 2,423.4 | 2.5% | 6.4% | 15.6% | 47.5%\n2003 | 304.1 | 7,479.0 | 94.0 | 2,312.6 | 3.9% | 7.1% | 14.1% | 45.0%\n2004 | 328.9 | 7,990.2 | 116.3 | 2,826.0 | 5.3% | 5.9% | 13.7% | 41.5%\n2005 | 355.2 | 8,523.9 | 145.6 | 3,494.0 | 4.7% | 5.0% | 11.8% | 38.5%\n2006 | 390.8 | 9,266.3 | 161.8 | 3,836.7 | 6.7% | 4.3% | 12.0% | 36.0%\n2007 | 428.4 | 10,041.6 | 206.2 | 4,834.4 | 6.7% | 5.5% | 11.2% | 32.7%\n2008 | 450.9 | 10,453.7 | 242.5 | 5,622.1 | 3.3% | 7.0% | 11.3% | 32.4%\n2009 | 459.0 | 10,524.8 | 232.5 | 5,330.8 | 1.1% | 4.2% | 12.0% | 35.4%\n2010 | 485.4 | 11,009.5 | 286.5 | 6,498.6 | 4.5% | 2.3% | 11.8% | 36.5%\n2011 | 529.9 | 11,893.0 | 335.0 | 7,518.3 | 6.9% | 3.4% | 10.8% | 35.8%\n2012 | 553.8 | 12,305.5 | 370.7 | 8,237.3 | 3.9% | 3.2% | 10.4% | 34.0%\n2013 | 591.8 | 13,024.8 | 382.1 | 8,409.7 | 5.1% | 2.0% | 9.7% | 37.6%\n2014 | 625.0 | 13,627.1 | 381.2 | 8,312.1 | 4.5% | 2.9% | 9.1% | 43.3%\n2015 | 630.4 | 13,611.5 | 293.5 | 6,337.0 | 3.0% | 5.0% | 8.9% | 50.4%\n2016 | 672.1 | 14,351.7 | 282.7 | 6,037.1 | 2.1% | 7.5% | 9.2% | 49.8%\n2017 | 700.1 | 14,763.9 | 311.9 | 6,577.3 | 1.4% | 4.3% | 9.4% | 49.4%\n2018 | 735.2 | 15,234.6 | 334.1 | 6,923.6 | 2.6% | 3.2% | 9.7% | 53.6%\n2019 | 772.9 | 15,647.2 | 323.4 | 6,546.6 | 3.3% | 3.5% | 10.5% | 52.3%\n2020 | 729.1 | 14,473.4 | 271.6 | 5,390.9 | -6.8% | 2.5% | 16.1% | 65.4%\n2021 | 812.8 | 15,921.8 | 300.8 | 5,892.1 | 7.6% | 3.2% | 14.5% | 66.7%\n2022 | 867.2 | 16,802.9 | 319.3 | 6,186.7 | 3.8% | 3.5% | 13.8% | 67.6%\n2023 | 916.7 | 17,576.6 | 336.2 | 6,446.9 | 3.3% | 3.0% | 13.1% | 69.7%\n2024 | 969.6 | 18,401.4 | 354.3 | 6,723.4 | 3.4% | 3.0% | 12.4% | 68.3%\n2025 | 1,024.8 | 19,257.0 | 373.4 | 7,016.1 | 3.4% | 3.0% | 11.8% | 66.7%\n2026 | 1,082.6 | 20,148.7 | 393.7 | 7,326.7 | 3.5% | 3.0% | 11.1% | 64.7%",
    "openai_summarised_points": [
      "• The table presents key economic indicators for Colombia from 1980 to 2019, with IMF staff estimates extending from 2020 to 2026.",
      "• Inflation rates below 5% are highlighted in green within the dataset.",
      "• In 1980, Colombia's GDP measured approximately 78.5 billion US dollars in PPP terms, with a per capita GDP of 2,840.6 US dollars PPP.",
      "• The nominal GDP in 1980 was 46.5 billion US dollars, with a per capita nominal GDP of 1,681.7 US dollars.",
      "• The country's real GDP growth rate in 1980 was 4.4%, and inflation was notably high at 25.9%.",
      "• Unemployment rate in 1980 stood at 5.4%, with government debt at an unspecified level (n/a).",
      "• Over the 1980s, Colombia's GDP in PPP terms increased from 78.5 billion US dollars in 1980 to 132.0 billion in 1987, reflecting steady economic growth.",
      "• During the same period, GDP per capita in PPP terms rose from 2,840.6 to 4,234.3 US dollars, indicating improving individual economic conditions.",
      "• Nominal GDP grew from 46.5 billion to 50.6 billion US dollars between 1980 and 1987, with nominal GDP per capita increasing from 1,681.7 to 1,623.4 US dollars.",
      "• Inflation rates fluctuated, reaching a high of 28.1% in 1988, and unemployment varied around 5-7% during the late 1980s.",
      "• The early 1990s saw continued growth, with GDP in PPP terms reaching 175.0 billion US dollars in 1991 and 186.8 billion in 1992.",
      "• GDP per capita in PPP terms increased from 5,171.3 US dollars in 1991 to 5,411.2 US dollars in 1992.",
      "• Nominal GDP rose from 57.9 billion in 1991 to 68.6 billion in 1992; nominal GDP per capita increased from 1,711.7 to 1,985.7 US dollars.",
      "• The mid-1990s experienced steady growth: GDP in PPP terms reached 242.3 billion US dollars in 1996, with GDP per capita in PPP of 6,546.2 US dollars.",
      "• During 1996–1999, Colombia's GDP in PPP terms grew from 242.3 billion to 251.9 billion US dollars, while GDP per capita in PPP increased from 6,546.2 to 6,530.5 US dollars.",
      "• The nominal GDP in 1999 was approximately 103.1 billion US dollars, with a nominal GDP per capita of 2,672.6 US dollars, and the economy experienced a negative real growth rate of -4.2%.",
      "• The early 2000s marked recovery and expansion: in 2000, GDP in PPP was 265.1 billion US dollars, with a per capita PPP of 6,772.2 US dollars, and a real growth rate of 2.9%.",
      "• From 2002 onward, Colombia's GDP in PPP terms surpassed 287 billion US dollars, reaching 390.8 billion in 2006, with consistent growth in GDP per capita.",
      "• The economy's nominal GDP increased from 97.3 billion in 2002 to 161.8 billion in 2006; nominal GDP per capita rose from 2,423.4 to 3,836.7 US dollars.",
      "• The period from 2007 to 2010 saw continued growth, with GDP in PPP terms reaching 485.4 billion US dollars in 2010, and GDP per capita in PPP rising to 11,009.5 US dollars.",
      "• Inflation rates fluctuated, with notable lows such as 1.1% in 2009 and 2.3% in 2010, while unemployment decreased from 13.3% in 2000 to around 11.8% in 2010.",
      "• From 2011 onward, Colombia's GDP in PPP terms grew from 529.9 billion US dollars in 2011 to 916.7 billion in 2019, with GDP per capita in PPP increasing from 11,893.0 to 17,576.6 US dollars.",
      "• Nominal GDP in 2019 was approximately 323.4 billion US dollars, with a nominal GDP per capita of 6,546.6 US dollars.",
      "• The economy experienced moderate growth rates around 3-4% annually from 2013 to 2019, with inflation maintained close to or below 3% in recent years, indicating stable price levels.",
      "• In 2020, due to the COVID-19 pandemic, GDP contracted by -6.8%, with GDP in PPP decreasing to 729.1 billion US dollars and per capita PPP dropping to 14,473.4 US dollars.",
      "• Unemployment increased to 16.1%, and government debt as a percentage of GDP rose sharply to 65.4%.",
      "• The economic recovery from 2021 to 2026 shows a rebound: GDP in PPP is projected to grow from 812.8 billion US dollars in 2021 to 1,082.6 billion in 2026, with per capita PPP rising from 15,921.8 to 20,148.7 US dollars.",
      "• Nominal GDP is expected to increase from 300.8 billion in 2021 to 393.7 billion in 2026, and nominal GDP per capita from 5,892.1 to 7,326.7 US dollars.",
      "• Real GDP growth rates are projected around 3.4% annually from 2023 to 2026, with inflation maintained at approximately 3%, and unemployment gradually decreasing to about 11.1% by 2026.",
      "• Government debt as a share of GDP is forecasted to decline from 66.7% in 2021 to 64.7% in 2026, indicating fiscal consolidation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:16:21.281484",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3709,
      "bullet_points_count": 30
    }
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Graphics",
    "text": "| Composition of the Colombian GDP by demand side. Second quarter of 2015.\n---\n|  |\nHousehold final consumption expenditure |  | 64.72%\nGovernment final consumption expenditure |  | 17.24%\nGross fixed capital formation |  | 28.30%\nInventory investment |  | 0.41%\nExports |  | 15.32%\nImports |  | 26.98%\n\nColombia – macroeconomic indicators 2002–2011"
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Labor rights",
    "text": "On 8 June 2020, the newly formed Employment Mission _(Misión de Empleo)_ met\nfor the first time to discuss labor reforms that it intended to propose to\nCongress. Some of these reforms had been desired for years, and others had\ncome into starker view during the coronavirus pandemic.\n\nThe legal working hours are 48 hours per week. However, the informal economy\naccounts for almost half of the workers, who are therefore not covered by\nlabor laws."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Palm plantation in Magdalena. Colombia is one of the top five producers of\npalm oil in the world. Sugar cane in Valle del Cauca. Colombia is one of the\ntop 10 sugarcane producers in the world.\n\nColombia is one of the five largest producers in the world of coffee, avocado\nand palm oil, and one of the 10 largest producers in the world of sugarcane,\nbanana, pineapple and cocoa.\n\nColombia produced, in 2018, 36.2 million tons of sugarcane (7th largest\nproducer in the world), 5.8 million tons of palm oil (5th largest producer in\nthe world), 3.7 million tons of banana (11th largest producer in the world)\nand 720 thousand tons of coffee (4th largest producer in the world, behind\nBrazil, Vietnam and Indonesia). Although its neighbor Brazil is the largest\nproducer of coffee in the world (3.5 million tons produced in the same year),\nthe advertising carried out by the country for decades suggests that Colombian\ncoffee is of higher quality, which generates greater added value to the\ncountry's product. In the same year, Colombia produced 3.3 million tons of\nrice, 3.1 million tons of potato, 2.2 million tons of cassava, 1.3 million\ntons of maize, 900 thousand tons of pineapple, 670 thousand tons of onion, 527\nthousand tons of tomato, 419 thousand tons of yam, 338 thousand tons of mango,\n326 thousand tons of avocado, in addition to smaller productions of other\nagricultural products such as orange, tangerine, lemon, papaya, beans, carrot,\ncoconut, watermelon etc. As of October 2024, Colombia is the tenth largest\nproducer of cacao in the global market. Its top importers include the United\nStates, Chile, Ecuador, and Venezuela.\n\nThe share of agriculture in GDP has fallen consistently since 1945, as\nindustry and services have expanded. However, Colombia's agricultural share of\nGDP decreased during the 1990s by less than in many of the world's countries\nat a similar level of development, even though the share of coffee in GDP\ndiminished in a dramatic way. Agriculture has nevertheless remained an\nimportant source of employment, providing a fifth of Colombia's jobs in 2006.\n\nAgriculture in Colombia is particularly vulnerable to climate-induced events\nlike La Niña, leading to droughts and heavy rains. Soil aridity, erosion, and\ndesertification are already pressing issues in Colombian agriculture, expected\nto worsen with climate change. Despite representing only 0.4 percent of global\ngreenhouse gas emissions, 71.3 percent of Colombia's domestic emissions stem\nfrom agriculture and land use. Colombia's revised National Determined\nContributions (NDCs) aim to reduce emissions by 51% by 2030, with a focus on\nagriculture. Strategies include reducing greenhouse gas emissions in cocoa,\nrice, coffee, forestry, and cattle production. The country also aims to\nprovide agroclimatic information to 1 million producers by 2030."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Livestock",
    "text": "Livestock in Córdoba. Colombia is one of the 20 largest producers of beef in\nthe world.\n\nIn the production of beef and chicken meat, Colombia is among the 20 largest\nproducers in the world.\n\nIn Colombia, the exploitation and breeding of cattle is carried out on small\nfarms and large farms. Black-eared white, casanareño, coastal with horns,\nromosinuano, chino santandereano and hartón del Valle, are the Colombian\nbreeds with the highest production.\n\nIn 2013, livestock occupied 80% of productive land in Colombia. The livestock\nsector is one of the most outstanding in areas such as Caribbean Region, where\nseven departments have livestock as their primary vocation. Also in Antioquia,\nwhere there is the largest cattle inventory in the country, the department had\nthat year 11% of the head of cattle in Colombia, and according to the\nlivestock inventory, in 2012 Antioqueños counted around 2,268,000 head of\ncattle.\n\nAlso in 2013, the bovine herd in Colombia reached 20.1 million head of cattle,\nof which 2.5 million (12.5%) were milking cows. In addition, the country's\ntotal milk production was 13.1 million liters.\n\nOn the other hand, the increase in imports of pork meat, the high prices of\ninputs and the slowdown in the national economy, produced a crisis in the\nraising of pork in Colombia in 2015."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Industry",
    "text": "The World Bank lists the main producing countries each year, based on the\ntotal value of production. According to the 2019 list, Colombia has the 46th\nmost valuable industry in the world (US$35.4 billion), behind Mexico, Brazil,\nVenezuela and Argentina, but ahead of Peru and Chile."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "5.0.1",
    "section_name": "Domestic appliances",
    "text": "Although Colombia has been producing domestic appliances since the 1930s, it\nwasn't until the late 1990s that Colombian corporations began exporting to\nneighboring countries. One of Colombia's largest producers of domestic\nappliances, HACEB has been producing refrigeration since 1940. Some domestic\ncorporations include: Challenger, Kalley, HACEB, Imusa, and Landers. In 2011,\nGroupe SEB acquired Imusa as a form to expand to the Latin American market.\nColombia also manufactures for foreign companies as well, such as Whirlpool\nand GE. LG has also been interested in building a plant in Colombia. Colombia\nis also Latin America's 3rd largest producer of appliances behind Mexico and\nBrazil and is growing rapidly."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "5.0.2",
    "section_name": "Electronics",
    "text": "Colombia is a major producer of electronics in Latin America, and is South\nAmerica's 2nd largest high-tech market. Colombia is also the 2nd largest\nproducer and exporter of electronics made by domestic companies in Latin\nAmerica. Since the early 2000s, major Colombian corporations began exporting\naggressively to foreign markets. Some of these companies include: Challenger,\nPcSmart, Compumax, Colcircuirtos, and Kalley. Colombia is the first country in\nLatin America to manufacture a domestically made 4K television. In 2014, the\nColombian Government launched a national campaign to promote IT and Electronic\nsectors, as well as investing in Colombia's own companies. Although innovation\nremains low on the global scale, the government sees heavy potential in the\nhigh tech industry and is investing heavily in education and innovation\ncenters all across the nation. Because of this, Colombia could become a major\nglobal manufacturer of electronics and play an important role in the global\nhigh tech industry in the near future. In 2014, the Colombian government\nreleased another national campaign to help Colombian companies have a bigger\nshare of the national market."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "5.0.3",
    "section_name": "Construction",
    "text": "Construction recently[_when?_]has played a vital role in the economy, and is\ngrowing rapidly at almost 20% annually. As a result, Colombia is seeing a\nhistoric building boom. The Colombian government is investing heavily in\ntransport infrastructure through a plan called \"Fourth Generation Network\".\nThe target of the Colombian government is to build 7,000 km of roads for the\n2016–2020 period and reduce travel times by 30% and transport costs by 20%. A\ntoll road concession program will comprise 40 projects, and is part of a\nlarger strategic goal to invest nearly $50bn in transport infrastructure,\nincluding: railway systems; making the Magdalena river navigable again;\nimproving port facilities; as well as an expansion of Bogotá's airport. Long-\nterm plans include building a national high-speed train network, to vastly\nimprove competitiveness."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Mining and energy",
    "text": "Emeralds are one of the most valuable and exported natural products in the\ncountry.\n\nColombia is well-endowed with minerals and energy resources. It has the\nlargest coal reserves in Latin America, and is second to Brazil in\nhydroelectric potential. Estimates of petroleum reserves in 1995 were 3.1\nbillion barrels (490,000,000 m3). It also possesses significant amounts of\nnickel, gold, silver, platinum, and emeralds.\n\nThe country was the 12th largest producer of coal in the world in 2018. In\n2019, Colombia was the 20th largest petroleum producer in the world, with 791\nthousand barrels / day. In mining, Colombia is the world's largest producer of\nemerald.\n\nThe discovery of 2 billion barrels (320,000,000 m3) of high-quality oil at the\nCusiana and Cupiagua fields, about 200 kilometres (120 mi) east of Bogotá, has\nenabled Colombia to become a net oil exporter since 1986. The Transandino\npipeline transports oil from Orito in the Department of Putumayo to the\nPacific port of Tumaco in the Department of Nariño. Total crude oil production\naverages 620 thousand barrels per day (99,000 m3/d); about 184 thousand\nbarrels per day (29,300 m3/d) is exported. The Pastrana government has\nsignificantly liberalized its petroleum investment policies, leading to an\nincrease in exploration activity. Refining capacity cannot satisfy domestic\ndemand, so some refined products, especially gasoline, must be imported. Plans\nfor the construction of a new refinery are under development.\n\nWhile Colombia has vast hydroelectric potential, a prolonged drought in 1992\nforced severe electricity rationing throughout the country until mid-1993. The\nconsequences of the drought on electricity-generating capacity caused the\ngovernment to commission the construction or upgrading of ten thermoelectric\npower plants. Half will be coal-fired, and half will be fired by natural gas.\nThe government also has begun awarding bids for the construction of a natural\ngas pipeline system that will extend from the country's extensive gas fields\nto its major population centers. Plans call for this project to make natural\ngas available to millions of Colombian households by the middle of the next\ndecade.\n\nAs of 2004, Colombia has become a net energy exporter, exporting electricity\nto Ecuador and developing connections to Peru, Venezuela and Panama to export\nto those markets as well. The Trans-Caribbean pipeline connecting western\nVenezuela to Panama through Colombia is also under construction, thanks to\ncooperation between presidents Álvaro Uribe of Colombia, Martín Torrijos of\nPanama and Hugo Chávez of Venezuela. Coal is exported to Turkey.\n\nOil and coal account for 47% of goods exports in 2021."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Human rights abuses in mining zones",
    "text": "The oil pipelines are a frequent target of extortion and bombing campaigns by\nthe National Liberation Army (ELN) and, more recently, the Revolutionary Armed\nForces of Colombia (FARC).[_citation needed_] The bombings, which have\noccurred on average once every 5 days, have caused substantial environmental\ndamage, often in fragile rainforests and jungles, as well as causing\nsignificant loss of life.[_citation needed_] In April 1999 in Cartagena de\nIndias, Clinton's Secretary of Energy Bill Richardson spoke before investors\nfrom the United States, Canada and other countries. He expressed his\ngovernment's willingness to use military aid to support the investment that\nthey and their allies were going to make in Colombia, especially in\nstrategically important sectors like mining and energy.[_citation needed_]\n\nIn 2001 there were 170 attacks on the Caño Limón–Coveñas pipeline. The\npipeline was out of operation for over 200 days of that year; the government\nestimates that these bombings reduced Colombia's GDP by 0.5%.[_citation\nneeded_] The government of the United States increased military aid, in 2003,\nto Colombia to assist in the effort to defend the pipeline. Occidental\nPetroleum privately contracted mercenaries who flew Skymaster planes, from\nAirScan International Inc., to patrol the Cano Limon-Covenas pipeline. Many of\nthese operations used helicopters, equipment and weapons provided by the U.S.\nmilitary and anti-narcotics aid programs.[_citation needed_]\n\nMining and natural exploitation has had environmental consequences. The region\nof Guajira is undergoing an accelerated desertification with the\ndisappearances of forests, land, and water sources, due to the increase in\ncoal production. Social consequences or lack of development in resource rich\nareas is common. 11 million Colombians survive on less than one dollar a day.\nOver 65% of these live in mining zones. There are 3.5 million children out of\nschool, and the most critical situation is in the mining zone of Choco,\nBolivar, and Sucre.[_citation needed_]\n\nEconomic consequences of privatization and liberal institutions have meant\nchanges in taxation to attract foreign investment. Colombia will lose another\n$800 million over the next 90 years that Glencore International operates in El\nCerrejon Zona Media, if the company continues to produce coal at a rate of 5\nmillion tons/year, because of the reduction of the royalty tax from 10 to 15%\nto .04%.[_citation needed_] If the company, as is plausible, doubles or\ntriples its production, the losses will be proportionally greater.[_citation\nneeded_] The operational losses from the three large mining projects (El\nCerrejon, La Loma, operated by Drummond, and Montelíbano, which produces\nferronickel) for Colombia to more than 12 billion. [_citation needed_]\n\nCoal production has grown rapidly, from 22.7 million tons in 1994 to 50.0\nmillion tons in 2003. Over 90% of this amount was exported, making Colombia\nthe world's sixth largest coal exporter, behind Australia, China, Indonesia,\nSouth Africa and Russia. From the mid-1980s the center of coal production was\nthe Cerrejón mines in the Guajira department.[_citation needed_] However, the\ngrowth in output at La Loma in neighboring Cesar Department made this area the\nleader in Colombian coal production since 2004.[_citation needed_] Production\nin other departments, including Boyacá, Cundinamarca and Norte de Santander,\nforms about 13% of the total.[_citation needed_] The coal industry is largely\ncontrolled by international mining companies, including a consortium of BHP,\nAnglo American and Glencore at Cerrejón, and Conundrum Company at La Loma,\nwhich is undergoing a lawsuit in the U.S. District Court in Alabama for union\nassassinations and alleged paramilitary links.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Foreign investment",
    "text": "Various attempts to open up the economy during the 1993-2023 period have been\ndescribed by Portafolio as being \"half-hearted\". In 1990, to attract foreign\ninvestors and promote trade, an experiment from the International Monetary\nFund known as \"La Apertura\" was adopted by the government, this policy was to\nmodernize different sectors of the economy to increase the overall efficiency\nof production so as to bring down prices to internationally competitive\nlevels. Although the analyses of the results are not clear,[_citation needed_]\nthe fact is that the agricultural sector was severely impacted by this policy.\n\nIn 1991 and 1992, the government passed laws to stimulate foreign investment\nin nearly all sectors of the economy. The only activities closed to foreign\ndirect investment are defense and national security, disposal of hazardous\nwastes, and real estate—the last of these restrictions is intended to hinder\nmoney laundering. Colombia established a special entity—Converter—to assist\nforeigners in making investments in the country. Foreign investment flows for\n1999 were $4.4 billion, down from $4.8 billion in 1998.\n\nMajor foreign investment projects underway include the $6 billion development\nof the Cusiana and Cupiagua oil fields, development of coal fields in the\nnorth of the country, and the recently concluded licensing for establishment\nof cellular telephone service. The United States accounted for 26.5% of the\ntotal $19.4 billion stock of non-petroleum foreign direct investment in\nColombia at the end of 1998.\n\nOn 21 October 1995, under the International Emergency Economic Powers Act\n(IEEPA), President Clinton signed an Executive Order barring U.S. entities\nfrom any commercial or financial transactions with four Colombian drug\nkingpins and with individuals and companies associated with the traffic in\nnarcotics, as designated by the Secretary of the Treasury in consultation with\nthe Secretary of State and the Attorney General. The list of designated\nindividuals and companies is amended periodically and is maintained by the\nOffice of Foreign Asset Control at the Department of the Treasury, tel. (202)\n622-0077 (ask for Document #1900). The document also is available at the\nDepartment of Treasury website.\n\nColombia is the United States' fifth-largest export market in Latin\nAmerica—behind Mexico, Brazil, Venezuela, and Argentina—and the 26th-largest\nmarket for U.S. products worldwide. The United States is Colombia's principal\ntrading partner, with two-way trade from November 1999 through November 2000\nexceeding $9.5 billion--$3.5 billion U.S. exports and $6.0 billion U.S.\nimports. Colombia benefits from duty-free entry—for a 10-year period, through\n2001—for certain of its exports to the United States under the Andean Trade\nPreferences Act. Colombia improved protection of intellectual property rights\nthrough the adoption of three Andean Pact decisions in 1993 and 1994, but the\nU.S. remains concerned over deficiencies in licensing, patent regulations, and\ncopyright protection.\n\nColombia is also the largest export partner of the Dutch constituent country\nof Aruba (39.4%).\n\nThe petroleum and natural gas coal mining, chemical, and manufacturing\nindustries attract the greatest U.S. investment interest. U.S. investment\naccounted for 37.8% ($4.2 billion) of the total $11.2 billion in foreign\ndirect investment at the end of 1997, excluding petroleum and portfolio\ninvestment. Worker rights and benefits in the U.S.-dominated sectors are more\nfavorable than general working conditions. Examples include shorter-than-\naverage working hours, higher wages, and compliance with health and safety\nstandards above the national average."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Tertiary industries",
    "text": "The services sector dominates Colombia's GDP, contributing 58 percent of GDP\nin 2007, and, given worldwide trends, its dominance will probably continue.\nThe sector is characterized by its heterogeneity, being the largest for\nemployment (61 percent), in both the formal and informal sectors."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Arts and music",
    "text": "Since the early 2010s, the Colombian government has shown interest in\nexporting modern Colombian pop culture to the world (which includes video\ngames, music, movies, TV shows, fashion, cosmetics, and food) as a way of\ndiversifying the economy and changing the image of Colombia. In the Hispanic\nworld, Colombia is only behind Mexico in cultural exports at US$750 million\nannually, and is already a regional leader in cosmetic and beauty exports."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Travel and tourism",
    "text": "Tourism in Colombia is an important sector in the country's economy.[_citation\nneeded_] Colombia has major attractions as a tourist destination, such as\nCartagena and its historic surroundings, which are on the UNESCO World\nHeritage List; the insular department of San Andrés, Providencia y Santa\nCatalina; Santa Marta, Cartagena and the surrounding area. Fairly recently,\nBogotá, the nation's capital, has become Colombia's major tourist destination\nbecause of its improved museums and entertainment facilities and its major\nurban renovations, including the rehabilitation of public areas, the\ndevelopment of parks, and the creation of an extensive network of cycling\nroutes. With its very rich and varied geography, which includes the Amazon and\nAndean regions, the llanos, the Caribbean and Pacific coasts, and the deserts\nof La Guajira, and its unique biodiversity, Colombia also has major potential\nfor ecotourism.\n\nThe direct contribution of Travel & Tourism to GDP in 2013 was COP11,974.3mn\n(1.7% of GDP). This is forecast to rise by 7.4% to COP12,863.4mn in 2014. This\nprimarily reflects the economic activity generated by industries such as\nhotels, travel agents, airlines and other passenger transportation services\n(excluding commuter services). But it also includes, for example, the\nactivities of the restaurant and leisure industries directly supported by\ntourists. The direct contribution of Travel & Tourism to GDP is expected to\ngrow by 4.1% pa to COP19,208.4mn (1.8% of GDP) by 2024.\n\nThe number of tourists in Colombia grows by over 12% every year. Colombia is\nprojected to have over 15 million tourists by 2023."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.2.1",
    "section_name": "Eco-tourism",
    "text": "Eco-tourism is very promising in Colombia. Colombia has vast coastlines,\nmountainous areas, and tropical jungles. There are volcanoes and waterfalls as\nwell. This makes Colombia a biodiverse country with many attractions for\nforeign visitors.\n\nThe Colombian coffee growing axis (Spanish: Eje Cafetero), also known as the\nCoffee Triangle (Spanish: Triángulo del Café), is a part of the Colombian\nPaisa region in the rural area of Colombia, which is famous for growing and\nproduction of a majority of Colombian coffee, considered by some as the best\ncoffee in the world. There are three departments in the area: Caldas, Quindío\nand Risaralda. These departments are among the smallest departments in\nColombia with a total combined area of 13,873 km2 (5,356 sq mi), about 1.2% of\nthe Colombian territory. The combined population is 2,291,195 (2005 census)."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "Transportation and telecommunications",
    "text": "Colombia's geography, with three cordilleras of the Andes running up the\ncountry from south to north, and jungle in the Amazon and Darién regions,\nrepresents a major obstacle to the development of national road networks with\ninternational connections. Thus, the basic nature of the country's\ntransportation infrastructure is not surprising. In the spirit of the 1991\nconstitution, in 1993 the Ministry of Public Works and Transportation was\nreorganized and renamed the Ministry of Transportation. In 2000 the new\nministry strengthened its role as the planner and regulator within the sector."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.3.1",
    "section_name": "Air transportation",
    "text": "Colombia was a pioneer in promoting airlines in an effort to overcome its\ngeographic barriers to transportation. The Colombian Company of Air\nNavigation, formed in 1919, was the second commercial airline in the world. It\nwas not until the 1940s that Colombia's air transportation began growing\nsignificantly in the number of companies, passengers carried, and kilometers\ncovered. In the early 2000s, an average of 72 percent of the passengers\ntransported by air go to national destinations, while 28 percent travel\ninternationally. One notable feature is that after the reforms of the\nbeginning of the 1990s, the number of international passengers tripled by\n2003. In 1993 the construction, administration, operation, and maintenance of\nthe main airports transferred to departmental authorities and the private\nsector, including companies specializing in air transportation. Within this\nprocess, in 2006 the International Airport Operator (Opain), a Swiss-Colombian\nconsortium, won the concession to manage and develop Bogotá's El Dorado\nInternational Airport. El Dorado is the largest airport in Latin America in\nterms of cargo traffic (33rd worldwide), with 622,145 metric tons in 2013,\nsecond in terms of traffic movements (45th worldwide) and third in terms of\npassengers (50th among the busiest airports in the world). In addition to El\nDorado, Colombia's international airports are Palo Negro in Bucaramanga, Simón\nBolívar in Santa Marta, Cortissoz in Barranquilla, Rafael Núñez in Cartagena,\nJosé María Córdova in Rionegro near Medellín, Alfonso Bonilla Aragón in Cali,\nAlfredo Vásquez Cobo in Leticia, Matecaña in Pereira, Gustavo Rojas Pinilla in\nSan Andrés, and Camilo Daza in Cúcuta. In 2006 Colombia was generally reported\nto have a total of 984 airports, of which 103 had paved runways and 883 were\nunpaved. The Ministry of Transportation listed 581 airports in 2007, but it\nmay have used a different methodology for counting them."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.3.2",
    "section_name": "Poverty and inequality",
    "text": "After a large crisis in 1999, poverty in Colombia has had a decreasing trend.\nThe share of Colombians below the income-based poverty line fell from 50% in\n2002 to 28% in 2016. The share of Colombians below the extreme income-based\npoverty line fell from 18% to 9% in the same period. Multidimensional poverty\nfell from 30% to 18% between 2010 and 2016.\n\nColombia has a Gini coefficient of 51.7."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "8.4",
    "section_name": "Retail",
    "text": "Hypermarkets and big-box stores are losing market participation in Colombian\nretail."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Debt",
    "text": "Between 1976 and 2006, Colombia's debt doubled every 10 years: in 1976 it was\nabout $3.6 billion, in 1986 it was $7.2 billion, in 1996 it was over $16\nbillion and in 2006 it was over $36 billion. Since 2006, the growth of the\ndebt has accelerated: it reached $72 billion in 2011 and reached $124 billion\nin 2017, which means that in less than 10 years Colombia's foreign debt has\ntripled. About a quarter of Colombia's annual budget, or $20 billion, goes to\npay off the public debt."
  },
  {
    "chapter_name": "Economy of Colombia",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Corruption",
    "text": "Corruption in public management in Colombia is widespread and structural in\nnature. This situation generates losses for the country estimated at 15\nbillion dollars. Colombia has not escaped the scandals involving millions of\ndollars in bribes from the Brazilian construction company Odebrecht, as well\nas the Cartagena refinery, a case of embezzlement of public funds that came to\nlight in 2016 and involved members of the governments of Álvaro Uribe\n(2002–2010) and Juan Manuel Santos (2010–2018)."
  }
]