[
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of El Salvador\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( May 2015)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nThe **economy of El Salvador** has experienced relatively low rates of GDP\ngrowth, in comparison to other developing countries. Rates have not risen\nabove the low single digits in nearly two decades. The Salvadoran economy is\ncharacterized by income inequality, with 37.8% of the population below the\npoverty line.\n\nThe Salvadoran government undertook a monetary integration plan beginning 1\nJanuary 2001, by which the U.S. dollar became legal tender alongside the\ncolón, and all formal accounting was undertaken in U.S. dollars. This way, the\ngovernment has formally limited its possibility of implementing open market\nmonetary policies to influence short term variables in the economy. Since\n2004, the colón stopped circulating and is now never used in the country for\nany type of transaction; however some stores still have prices in both colons\nand U.S. dollars. The change to the dollar precipitated a trend toward lower\ninterest rates in El Salvador, helping many to secure credit in order to buy a\nhouse or a car. Over time, displeasure with the change has largely\ndisappeared, though the issue resurfaces as a political tool when elections\nare on the horizon.\n\nIn June 2021, president Nayib Bukele said he would introduce legislation to\nmake Bitcoin legal tender in El Salvador. The Bitcoin Law was passed by the\nLegislative Assembly on 9 June 2021, with a majority vote of 62 out of 84.\nBitcoin officially became legal tender ninety days after the publication of\nthe law in the official gazette. As part of the law, foreigners can gain\npermanent residence in El Salvador if they invest 3 Bitcoin into the country.\nIn January 2022, The International Monetary Fund (IMF) urged El Salvador to\nreverse its decision to make cryptocurrency Bitcoin legal tender. Bitcoin had\nrapidly lost about half of its value, meaning economic difficulties for El\nSalvador. President Bukele had announced his plans to build a Bitcoin city at\nthe base of a volcano in El Salvador. In the first 18 months of Bitcoin\nadoption, the cryptocurrency was rarely used by the local population or\ntourists, leaving USD the de facto standard for transactions. The Bitcoin\nexperiment was largely a failure.\n\nIn 2021, El Salvador received a $40 million loan for small enterprises and\nprojects for climate action, from the European Investment Bank to the\ncountry's development bank, Banco de Desarollo de el Salvador. $20 million\nwill be used to assist investments in renewable energy projects, specifically\nphotovoltaics, biogas, and micro hydro projects. Up to 50% of the loan line\nwill be used to assist small and medium-sized enterprises who were affected by\nthe COVID-19 pandemic.",
    "openai_summarised_points": [
      "• The economy of El Salvador has experienced relatively low GDP growth rates compared to other developing countries, with growth not exceeding the low single digits for nearly twenty years.",
      "• Income inequality is a significant characteristic of the Salvadoran economy, with approximately 37.8% of the population living below the poverty line.",
      "• On January 1, 2001, the Salvadoran government initiated a monetary integration plan that made the U.S. dollar legal tender alongside the Salvadoran colón, with all formal accounting conducted in U.S. dollars.",
      "• The adoption of the U.S. dollar limited the government's ability to implement open market monetary policies aimed at influencing short-term economic variables.",
      "• By 2004, the Salvadoran colón ceased circulating and is no longer used in any transactions; however, some stores still display prices in both colons and U.S. dollars.",
      "• The switch to the U.S. dollar contributed to a trend of declining interest rates in El Salvador, facilitating easier access to credit for purchasing homes and vehicles.",
      "• Discontent with dollarization has largely diminished over time, though it occasionally resurfaces as a political issue during election periods.",
      "• In June 2021, President Nayib Bukele announced plans to introduce legislation to make Bitcoin legal tender in El Salvador.",
      "• The Bitcoin Law was passed by the Legislative Assembly on June 9, 2021, with a majority vote of 62 out of 84 members.",
      "• Bitcoin officially became legal tender in El Salvador ninety days after the law's publication in the official gazette.",
      "• The law permits foreigners to obtain permanent residence in El Salvador if they invest 3 Bitcoin into the country.",
      "• In January 2022, the International Monetary Fund (IMF) urged El Salvador to reverse its decision to adopt Bitcoin as legal tender, citing rapid depreciation of Bitcoin’s value by about 50% and resulting economic difficulties.",
      "• President Bukele announced plans to build a Bitcoin city at the base of a volcano in El Salvador as part of the cryptocurrency initiative.",
      "• During the first 18 months of Bitcoin adoption, the cryptocurrency was rarely used by locals or tourists, with the U.S. dollar remaining the de facto standard for transactions, indicating the Bitcoin experiment was largely unsuccessful.",
      "• In 2021, El Salvador received a $40 million loan from the European Investment Bank via the country's development bank, Banco de Desarollo de El Salvador, aimed at supporting small enterprises and climate action projects.",
      "• Of the $40 million loan, $20 million was allocated to investments in renewable energy projects, including photovoltaics, biogas, and micro-hydro initiatives.",
      "• Up to 50% of the loan line was designated to aid small and medium-sized enterprises impacted by the COVID-19 pandemic."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T21:54:40.429625",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3024,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Historically, El Salvador had inequitable distribution of land, with most of\nit concentrated among the so-called Fourteen Families. Whereas other states in\nLatin America had implemented land reforms, El Salvador still had a highly\ninequitable land system by the middle of the 20th century. El Salvador has\nbeen characterized as an oligarchic agro-export economy.\n\nEl Salvador had an economic boom in the 1920s, which was brought to an end\nwith the onset of the Great Depression, which brought coffee prices down. Over\nthe period 1926 to 1932, income from exports were halved."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Public sector",
    "text": "* Departments of El Salvador\n\n* Centro Financiero Gigante (CFG) is a full five tower complex of office buildings located in San Salvador\n\n* Cuscatlan Bank is headquartered at Torre Cuscatlán\n\n* Banco Agrícola headquarter in San Salvador\n\n* Lifestyle Center La Gran Via is one of many giant malls in El Salvador\n\n* An Athena Bitcoin ATM in El Salvador\n\n* Salvadorans using an Athena Bitcoin ATM\n\nFiscal policy has been one of the biggest challenges for the Salvadoran\ngovernment. In December 1999, net international reserves equaled US$1.8\nbillion. Having this hard currency buffer to work with, the Salvadoran\ngovernment undertook a monetary integration plan beginning in January 2001 by\nwhich the U.S. dollar became legal tender alongside the Salvadoran colón, and\nall formal accounting was done in U.S. dollars. With the adoption of the U.S.\ndollar, El Salvador lost control over monetary policy. Any counter-cyclical\npolicy response to the downturn must be through fiscal policy, which is\nconstrained by legislative requirements for a two-thirds majority to approve\nany international financing.\n\nThe 1992 peace accords committed the government to heavy expenditures for\ntransition programs and social services. The stability adjustment programs\n(PAE, for the initials in Spanish) initiated by president Cristiani's\nadministration committed the government to the privatization of banks, the\npension system, electric and telephone companies. The total privatization of\nthe pension system has implied a serious burden for the public finances,\nbecause the newly created private Pension Association Funds did not absorb\ncoverage of retired pensioners covered in the old system. As a result, in July\n2017, the Government of El Salvador wanted to take $500 million from the\nprivatized pension system to cover retired pensioners from the old not\nprivatized system, but the Supreme Court of El Salvador declared this move\nunconstitutional. The government lost the revenues from contributors and\nabsorbed completely the costs of coverage of retired pensioners. This has been\nthe main source of fiscal imbalance. ARENA governments have financed this\ndeficit with the emission of bonds, something the leftist party FMLN has\nopposed. Debates surrounding the emission of bonds have stalled the approval\nof the national budget for many months on several occasions, reason for which\nin 2006 the government will finance the deficit by reducing expenditure in\nother posts. The emission of bonds and the approval of a loans need a\nqualified majority (3/4 of the votes) in the parliament. If the deficit is not\nfinanced through a loan it is enough with a simple majority to approve the\nbudget (50% of the votes plus 1). This would facilitate an otherwise long\nprocess in Salvadoran politics.\n\nDespite such challenges to keep public finances in balance, El Salvador still\nhas one of the lowest tax burdens in the American continent (around 11% of\nGDP). The government has focused on improving the collection of its current\nrevenues with a focus on indirect taxes. Leftist politicians criticize such a\nstructure since indirect taxes (like the value added tax) affect everyone\nalike, whereas direct taxes can be weighed according to levels of income and\nare therefore more punitive toward productive people. However, some basic\ngoods are exempt from the indirect taxes. A value-added tax (VAT) of 10%,\nimplemented in September 1992, was raised to 13% in July 1995. The VAT is the\nbiggest source of revenue for the government, accounting for about 52.3% of\ntotal tax revenues in 2004.\n\nAs of 3 November 2014, the IMF reports official reserve assets to be $3.192B.\nForeign currency reserves (in convertible foreign currencies) are $2.675B.\nSecurities are $2.577B with total currency and deposits at $94.9M. Securities\nwith other national central banks (BIS and IMF) are $81.10M. Securities with\nbanks headquartered outside the reporting country $13.80M. SDRs are at\n$245.5M. Gold reserves (including gold deposits and, if appropriate, gold\nswapped) reported at $271.4M with volume in millions of fine Troy ounces at\n$200k. Other reserve assets are financial derivatives valued at $2.7M."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Remittances",
    "text": "Salvadoran American population in the United States\n\nRemittances from Salvadorans working in the United States sent to family\nmembers are a major source of foreign income and offset the substantial trade\ndeficit of around $2.9 billion. Remittances have increased steadily in the\nlast decade and reached an all-time high of $2.9 billion in 2005—approximately\n17.1% of gross national product (GNP).\n\nRemittances have had positive and negative effects on El Salvador. In 2005,\nthe number of people living in extreme poverty in El Salvador was 20%,\naccording to a United Nations Development Program report. While Salvadoran\neducation levels have gone up, wage expectations have risen faster than\nproductivity. This has led to an influx of Hondurans and Nicaraguans who are\nwilling to work for the prevailing wage. Also, the local propensity for\nconsumption has increased. Money from remittances has increased prices for\ncertain commodities such as real estate. With much higher wages, many\nSalvadorans abroad can afford higher prices for houses in El Salvador and thus\npush up the prices that all Salvadorans must pay."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture",
    "text": "* A cotton field, Usulután Department.\n\n* Dark roasted coffee beans from Coffee production in El Salvador\n\nIn 2018, El Salvador produced 7 million tons of sugarcane, being heavily\ndependent on this product. In addition to sugarcane, the country produced 685\nthousand tons of maize, 119 thousand tons of coconut, 109 thousand tons of\nsorghum, 93 thousand tons of beans, 80 thousand tons of coffee, 64 thousand\ntons of orange, in addition to smaller yields of other agricultural products\nsuch as watermelon, yautia, apple, manioc, mango, banana, rice etc.\n\nThe ultimate goal was to develop a rural middle class with a stake in a\npeaceful and prosperous future for El Salvador. At least 525,000 people—more\nthan 12% of El Salvador's population at the time and perhaps 25% of the rural\npoor—benefited from agrarian reform, and more than 22% of El Salvador's total\nfarmland was transferred to those who previously worked the land but did not\nown it. But when agrarian reform ended in 1990, about 150,000 landless\nfamilies still had not benefited from the reform actions.\n\nThe 1992 peace accords made provisions for land transfers to all qualified ex-\ncombatants of both the FMLN and ESAF, as well as to landless peasants living\nin former conflict areas. The United States undertook to provide $300 million\nfor a national reconstruction plan. This included $60 million for land\npurchases and $17 million for agricultural credits. USAID remains actively\ninvolved in providing technical training, access to credit, and other\nfinancial services for many of the land beneficiaries."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Energy",
    "text": "* Geothermal power plant in Ahuachapan Department\n\n* Geothermal power center in the Usulután Department\n\n* Central hydroelectricity dam over the Lempa River\n\nEl Salvador's energy industry is diversified across fossil fuels, hydro, other\nrenewables (mainly geothermal) for local electricity production, along with a\nreliance on imports for oil. El Salvador has an installed capacity of 1,983 MW\ngenerating 5,830 GWh of electricity per year, 52% of this comes from renewable\nsources including 29% from geothermal (produced from the country's many\nvolcanoes), 23% from hydro and the rest is from fossil fuels.\n\nAccording to the National Energy Commission, 94.4% of total injections during\nJanuary 2021 came from hydroelectric plants (28.5% - 124.43 GWh), geothermal\n(27.3% - 119.07 GWh), biomass (24.4% 106.43 GWh), photovoltaic solar (10.6% -\n46.44 GWh) and wind (3.6% - 15.67 GWh).\n\nForms of energy | 2021\n(GWh) | %\n---|---|---\nHydroelectric energy | 124.43 | 28.5\nGeothermal energy | 119.07 | 27.3\nBiomass | 106.43 | 24.4\nSolar photovoltaic | 46.44 | 10.6\nWind | 15.67 | 3.6\nTotal | 412.04 | 94.4"
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Manufacturing",
    "text": "El Salvador historically has been the most industrialized state in Central\nAmerica, though a decade of war eroded this position. In 1999, manufacturing\naccounted for 22% of GDP. The industrial sector has shifted since 1993 from a\nprimarily domestic orientation to include free zone (maquiladora)\nmanufacturing for export. Maquila exports have led the growth in the export\nsector and in the last 3 years[_when?_] have made an important contribution to\nthe Salvadoran economy."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Mining",
    "text": "Mining in El Salvador expanded in scope from artisanal mining to industrial\nmining at the San Sebastián mine in the 1970s. Chemicals from that mine\npolluted the San Sebastián River.\n\nMining ceased during the Salvadoran Civil War. After the war, the country's\nright-wing government proposed 33 mining zones, issuing exploration licences\nto American, Australian, and Canadian companies. The plan was met with\nopposition of many local community and community leaders, who successfully\nblocked exploration in Chalatenango in 2005.\n\nPacific Rim Mining Corporation obtained a permit to explore the El Dorado gold\nmine in 2002, but were denied a license to mine in 2008, following local\nopposition.\n\nMining for metal was banned in 2017, although the creation of a mining\nregulator in 2021 and the arrest of anti-mining activists in 2023 prompted\npublic speculation that the government is considering resuming mining."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Telecommunications",
    "text": "El Salvador has 0.9 million fixed telephone lines, 0.5 million fixed broadband\nlines and 9.4 million mobile cellular subscriptions. Much of the population is\nable to access the internet through their smartphones and mobile networks,\nwhich liberal government regulation promotes mobile penetration over fixed\nline including the deployment of 5G coverage (which testing of began in 2020).\nTransition to digital transmission of TV/radio networks was done in 2018 with\nthe adaptation of the ISDB-T standard. There are hundreds of privately owned\nnational TV networks, cable TV networks (that also carry international\nchannels), and radio stations available; while there is also 1 government\nowned broadcast station.\n\nEl Salvador's IT Industry's history started early with several IT outsourcing\ncompanies such as Gpremper and an early search engine that predated Google in\n1995 called \"Buscaniguas\". The industry has since expanded with companies such\nas Creativa Consultores, Applaudo Studios, and Elaniin providing software and\nwebsite design services to clients globally while employing thousands of\npeople. Canadian Telus International, a major global IT outsourcing and\nsoftware development firm, has a significant workforce in the country\nemploying nearly 1,500 people in high tech and customer service roles. The\nstartup scene has also been growing with firms such as HugoApp employing 600\nlocals and providing delivery and ride sharing services to nearly 1 million\nusers in the Central American/CAFTA region. In 2020, the government announced\nits \"Digital Agenda 2020\" a plan to digitize government services, digitize\nidentities, make it easier to start businesses, attract foreign investment and\nimprove the education system. Finally, the passing of the Bitcoin Law in 2021\nmade El Salvador the first country in the world to adopt a cryptocurrency\n(Bitcoin) as legal tender, this move seeks to improve access to financial\nservices to the non-banked and under banked while also making El Salvador a\nhub for innovation."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Services",
    "text": "In the 21st century, numerous call centers serving North American markets have\nbeen developed in El Salvador, including Ubiquity Global Services and Synnex.\nThe industry benefits from the availability of a large English speaking work\nforce, composed of deportees from the United States."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Trade",
    "text": "Exports to  | Imports from\n---|---\nCountry  | %  | Country  | %\nUnited States  | 66%  | United States  | 43.4%\nCaribbean region  | 26%  | Guatemala | 8.2%\nMexico  | 1%  | Mexico  | 7.8%\nSpain  | 1%  | European Union  | 7.0%\nOthers  | 6%  | Others  | 33.6%\nTorre Futura at World Trade Center San Salvador\n\nA challenge in El Salvador has been developing new growth sectors for a more\ndiversified economy. As many other former colonies, for many years El Salvador\nwas considered a mono exporter economy. This means, an economy that depended\nheavily on one type of export. During colonial times, the Spanish decided that\nEl Salvador would produce and export indigo, but after the invention of\nsynthetic dyes in the 19th century, Salvadoran authorities and the newly\ncreated modern state turned to coffee as the main export of the economy.\n\nSince the cultivation of coffee required the highest lands in the country,\nmany of these lands were expropriated from indigenous reserves and given or\nsold cheaply to those that could cultivate coffee. The government provided\nlittle or no compensation to the indigenous peoples. On occasions this\ncompensation implied merely the right to work for seasons in the newly created\ncoffee farms and to be allowed to grow their own food. Such policies provided\nthe basis of conflicts that would shape the political situation of El Salvador\nin the years to come.\n\nARENA governments have followed policies that intend to develop other\nexporting industries in the country as textiles and sea products. Tourism is\nanother industry Salvadoran authorities regard as a possibility for the\ncountry. But rampant crime rates, lack of infrastructure and inadequate social\ncapital have prevented these possibilities from being properly exploited. The\ngovernment is also developing ports and infrastructure in La Unión in the east\nof the country, in order to use the area as a \"dry canal\" for transporting\ngoods from Gulf of Fonseca in the Pacific Ocean to Honduras and the Atlantic\nOcean in the north. Currently there are fifteen free trade zones in El\nSalvador. The largest beneficiary has been the maquila industry, which\nprovides 88,700 jobs directly, and consists primarily of cutting and\nassembling clothes for export to the United States.\n\nEl Salvador signed the Central American Free Trade Agreement (CAFTA),\nnegotiated by the five countries of Central America and the Dominican\nRepublic, with the United States in 2004. In order to take advantage of CAFTA-\nDR, the Salvadoran government is challenged to conduct policies that guarantee\nbetter conditions for entrepreneurs and workers to transfer from declining to\ngrowing sectors in the economy. El Salvador has already signed free trade\nagreements with Mexico, Chile, the Dominican Republic, and Panama, and\nincreased its exports to those countries. El Salvador, Guatemala, Honduras,\nand Nicaragua also are negotiating a free trade agreement with Canada, and\nnegotiations started on 2006 for a free trade agreement with Colombia.\n\nEl Salvador's balance of payments continued to show a net surplus. Exports in\n1999 grew 1.9% while imports grew 3%, narrowing El Salvador's trade deficit.\nAs in the previous year, the large trade deficit was offset by foreign aid and\nfamily remittances. Remittances are increasing at an annual rate of 6.5%, and\nan estimated $1.35 billion will enter the national economy during 1999.\n\nPrivate foreign capital continued to flow in, though mostly as short-term\nimport financing and not at the levels of previous years. The Central American\nCommon Market continued its dynamic reactivation process, now with most\nregional commerce duty-free. In September 1996, El Salvador, Guatemala, and\nHonduras opened free trade talks with Mexico. This trade alliance is also\nknown as the Northern Triangle in relation to the Central American economies\nthat are grouped together by proximity and location.[3] Although tariff cuts\nthat were expected in July 1996 were delayed until 1997, the government of El\nSalvador is committed to a free and open economy.\n\nTotal U.S. exports to El Salvador reached $2.1 billion in 1999, while El\nSalvador exported $1.6 billion to the United States. U.S. support for El\nSalvador's privatization of the electrical and telecommunications markets has\nmarkedly expanded opportunities for U.S. investment in the country. More than\n300 U.S. companies have established either a permanent commercial presence in\nEl Salvador or work through representative offices in the country. The\nDepartment of State maintains a country commercial guide for U.S. businesses\nseeking detailed information on business opportunities in El Salvador."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Official corruption and foreign investment",
    "text": "In an analysis of ARENA's electoral defeat in 2009, the U.S. Embassy in San\nSalvador pointed to official corruption under the Saca administration as a\nsignificant reason for public rejection of continued ARENA government.\n\nSubsequent policies under Funes administrations improved El Salvador to\nforeign investment, and the World Bank in 2014 rated El Salvador 109, a little\nbetter than Belize (118) and Nicaragua (119) in the World Bank's annual \"Ease\nof doing business\" index.\n\nAs per Santander Trade, a Spanish think tank in foreign investment, \"Foreign\ninvestment into El Salvador has been steadily growing during the last few\nyears. In 2013, the influx of FDI increased. Nevertheless, El Salvador\nreceives less FDI than other countries of Central America. The government has\nmade little progress in terms of improving the business climate. In addition\nto this, the limited size of its domestic market, weak infrastructures and\ninstitutions, as well as the high level of criminality have been real\nobstacles to investors. However, El Salvador is the second most 'business\nfriendly' country in South America in terms of business taxation. It also has\na young and skilled labour force and a strategic geographical position. The\ncountry's membership in the DR-CAFTA, as well as its reinforced integration to\nthe C4 countries (producers of cotton) should lead to an increase of FDI.\"\n\nForeign companies have lately resorted to arbitration in international trade\ntribunals in total disagreement with Salvadoran government policies. In 2008,\nEl Salvador sought international arbitration against Italy's Enel Green Power,\non behalf of Salvadoran state-owned electric companies for a geothermal\nproject Enel had invested in. Four years later, Enel indicated it would seek\narbitration against El Salvador, blaming the government for technical problems\nthat prevent it from completing its investment. The government came to its\ndefence claiming that Art 109 of the constitution does not allow any\ngovernment (regardless of the party they belong), to privatize the resources\nof the national soil (in this case geothermic energy). The dispute came to an\nend in December 2014 when both parties came to a settlement, from which no\ndetails have been released. The small country had yielded to pressure from the\nWashington-based powerful ICSID.\n\nA 2008 report by the United Nations Conference on Trade and Development\nindicates that one third of the generation of electricity in El Salvador was\npublicly owned while two thirds was in American hands and other foreign\nownership.\n\nIn terms of how people perceived the levels of public corruption in 2014, El\nSalvador ranks 80 out of 175 countries as per the Corruption Perception Index.\nEl Salvador's rating compares relatively well with Panama (94 of 175) and\nCosta Rica (47 of 175)."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Natural disasters: Hurricane Mitch (1998) and the earthquakes (2001)",
    "text": "Hurricane Mitch hit El Salvador in late October 1998, generating extreme\nrainfall of which caused widespread flooding and landslides. Roughly 650 km2\nwere flooded, and the Salvadoran Government pronounced 374 people dead or\nmissing. In addition, approximately 55,900 people were rendered homeless. The\nareas that suffered the most were the low-lying coastal zones, particularly in\nthe floodplain of the Lempa and San Miguel Grande Rivers. Three major bridges\nthat cross the Lempa were swept away, restricting access to the eastern third\nof the country and forcing the emergency evacuation of many communities. The\nheavy rainfall, flooding, and mudslides caused by Hurricane Mitch also\nseverely damaged El Salvador's road network. Along with the three major\nbridges over the Lempa River, 12 other bridges were damaged or destroyed by\nthe Mitch flooding.\n\nThe largest single-affected sector was El Salvador's agriculture. Nearly 18%\nof the total 1998–99 basic grain harvest was lost. Coffee production was hit\nparticularly hard; 3% of the harvest was lost in addition to 8.2% that was\nlost earlier in the year due to El Niño. Major losses of sugarcane, totaling\n9% of the estimated 1998–99 production, were sustained primarily in the\ncoastal regions. Livestock losses amounted to $1 million, including 2,992 head\nof cattle. In addition to these losses, El Salvador also had to face the\nthreat of disease outbreak. The Ministry of Health recorded a total of 109,038\nmedical cases related to Hurricane Mitch between 31 October and 18 November\n1998; 23% of these cases were respiratory infections, followed by skin\nailments, diarrhea, and conjunctivitis.\n\nReconstruction from Mitch was still underway when, in early 2001, the country\nexperienced a series of devastating earthquakes that left nearly 2,000 people\ndead or missing, 8,000 injured, and caused severe dislocations across all\nsectors of Salvadoran society. Nearly 25% of all private homes in the country\nwere either destroyed or badly damaged, and 1.5 million persons were left\nwithout housing. Hundreds of public buildings were damaged or destroyed, and\nsanitation and water systems in many communities put out service. The total\ncost of the damage was estimated at between $1.5 billion and $2 billion, and\nthe devastation thought to equal or surpass that of the 1986 quake that struck\nSan Salvador. Given the magnitude of the disaster, reconstruction and economic\nrecovery will remain the primary focus of the Salvadoran Government for some\ntime to come.\n\nThe Hurricane Mitch disaster prompted a tremendous response from the\ninternational community governments, nongovernmental organizations (NGOs), and\nprivate citizens alike. Sixteen foreign governments—including the U.S., 19\ninternational NGOs, 20 Salvadoran embassies and consulates, and 20 private\nfirms and individuals provided El Salvador with in-kind assistance. The\nGovernment of El Salvador reports that 961 tons of goods and food were\nreceived. The Ministry of Foreign Affairs estimates that contribution in cash\ngiven directly to the Salvadoran Government totaled $4.3 million. The U.S.\nGovernment has provided $37.7 million in assistance through USAID and the U.S.\nDepartments of Agriculture and Defense.\n\nFollowing the 2001 earthquakes, the U.S. embassy assumed a leading role in\nimplementing U.S.-sponsored assistance. The U.S. Government responded\nimmediately to the emergency, with military helicopters active in initial\nrescue operations, delivering emergency supplies, rescue workers, and damage\nassessment teams to stricken communities all over the country. USAIDs Office\nof Foreign Disaster Assistance had a team of experts working with Salvadoran\nrelief authorities immediately after both quakes, and provided assistance\ntotaling more than $14 million. In addition, the Department of Defense\nprovided an initial response valued at more than $11 million. For long-term\nreconstruction, the international community offered a total aid package of\n$1.3 billion, over $110 million of it from the United States."
  },
  {
    "chapter_name": "Economy of El Salvador",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Macro-economic trend",
    "text": "The following table shows the main economic indicators in 1980–2024. Inflation\nunder 10% is in green.\n\nYear  | GDP (in billion US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in billion US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1980  | 11.2  | 2,305  | 3.9  | -8.6%  | 17.4%  | n/a\n1981  | 11.5  | 2,352  | 3.4  | -5.7%  | 14.8%  | n/a\n1982  | 11.5  | 2,321  | 3.4  | -6.3%  | 11.7%  | n/a\n1983  | 12.1  | 2,435  | 3.3  | 1.5%  | 13.1%  | n/a\n1984  | 12.7  | 2,541  | 2.4  | 1.3%  | 11.7%  | n/a\n1985  | 13.2  | 2,616  | 2.3  | 0.6%  | 22.3%  | n/a\n1986  | 13.5  | 2,647  | 2.3  | 0.2%  | 31.9%  | n/a\n1987  | 14.2  | 2,748  | 2.4  | 2.5%  | 24.8%  | n/a\n1988  | 14.9  | 2,858  | 2.8  | 1.9%  | 19.8%  | n/a\n1989  | 15.7  | 2,952  | 3.2  | 1.0%  | 17.7%  | n/a\n1990  | 17.0  | 3,155  | 4.8  | 4.8%  | 28.3%  | n/a\n1991  | 17.9  | 3,266  | 5.3  | 1.5%  | 14.4%  | 43%\n1992  | 19.6  | 3,526  | 5.8  | 7.0%  | 11.2%  | 36%\n1993  | 21.2  | 3,766  | 6.7  | 5.8%  | 18.5%  | 32%\n1994  | 22.7  | 3,983  | 7.7  | 4.7%  | 10.6%  | 31%\n1995  | 24.2  | 4,218  | 8.9  | 4.7%  | 10.0%  | 28%\n1996  | 24.9  | 4,294  | 9.6  | 0.8%  | 9.8%  | 29%\n1997  | 26.1  | 4,470  | 10.2  | 3.1%  | 4.5%  | 28%\n1998  | 27.1  | 4,607  | 10.9  | 2.7%  | 2.5%  | 26%\n1999  | 28.1  | 4,742  | 11.3  | 2.2%  | 0.5%  | 28%\n2000  | 29.0  | 4,875  | 11.8  | 1.1%  | 2.3%  | 30%\n2001  | 30.0  | 5,004  | 12.3  | 0.9%  | 3.7%  | 38%\n2002  | 30.9  | 5,142  | 12.7  | 1.6%  | 1.9%  | 44%\n2003  | 32.0  | 5,312  | 13.2  | 1.6%  | 2.1%  | 46%\n2004  | 33.2  | 5,495  | 13.7  | 0.9%  | 4.5%  | 47%\n2005  | 35.1  | 5,819  | 14.7  | 2.7%  | 4.7%  | 46%\n2006  | 37.8  | 6,262  | 16.0  | 4.3%  | 4.0%  | 53%\n2007  | 39.5  | 6,541  | 17.0  | 1.9%  | 4.6%  | 52%\n2008  | 41.2  | 6,782  | 18.0  | 2.1%  | 7.3%  | 54%\n2009  | 40.5  | 6,656  | 17.6  | -2.1%  | 0.5%  | 66%\n2010  | 41.9  | 6,853  | 18.4  | 2.1%  | 1.2%  | 67%\n2011  | 44.4  | 7,234  | 20.3  | 3.8%  | 5.1%  | 66%\n2012  | 46.5  | 7,547  | 21.4  | 2.8%  | 1.7%  | 70%\n2013  | 48.3  | 7,816  | 22.0  | 2.2%  | 0.8%  | 70%\n2014  | 50.0  | 8,057  | 22.6  | 1.7%  | 1.1%  | 72%\n2015  | 51.7  | 8,297  | 23.4  | 2.4%  | -0.7%  | 73%\n2016  | 53.5  | 8,563  | 24.2  | 2.5%  | 0.6%  | 75%\n2017  | 55.7  | 8,889  | 25.0  | 2.3%  | 1.0%  | 77%\n2018  | 57.2  | 9,121  | 26.0  | 2.4%  | 1.1%  | 77%\n2019  | 60.7  | 9,667  | 26.9  | 2.4%  | 0.1%  | 78%\n2020  | 58.6  | 9,306  | 24.9  | -7.9%  | -0.4%  | 95%\n2021  | 67.6  | 10,710  | 29.0  | 11.9%  | 3.5%  | 88%\n2022  | 74.5  | 11,753  | 32.0  | 2.8%  | 7.2%  | 83%\n2023  | 79.9  | 12,547  | 34.0  | 3.5%  | 4.0%  | 85%\n2024  | 84.2  | 13,173  | 35.8  | 3.0%  | 1.0%  | 85%"
  }
]