[
  {
    "chapter_name": "Economy of Kiribati",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The Republic of Kiribati's per capita Gross National Product of US$1,420\n(2010) makes it the poorest country in Oceania. Phosphates had been profitably\nexported from Banaba Island since the turn of the 20th century, but the\ndeposits were exhausted in 1979. The economy now depends on foreign assistance\nand revenue from fishing licenses to finance its imports and development\nbudget.\n\nThe Asian Development Bank’s assessment of Kiribati’s growth potential point\nidentifies constraints imposed by “(i) land area, (ii) geographic dispersion\nacross 5,000 km of ocean, (ii) remoteness from major markets with associated\nhigh external transport costs, (iii) high vulnerability to natural forces\nincluding climate change and sea level rise, and (iv) scarce natural\nresources.”",
    "openai_summarised_points": [
      "• The Republic of Kiribati had a per capita Gross National Product (GNP) of US$1,420 in 2010, making it the poorest country in Oceania.",
      "• Phosphates were profitably exported from Banaba Island since the early 20th century; however, these deposits were exhausted in 1979.",
      "• The current Kiribati economy primarily relies on foreign assistance and revenue generated from fishing licenses to fund its imports and development budget.",
      "• The Asian Development Bank’s assessment of Kiribati’s growth potential highlights several constraints, including:"
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:24.017211",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 770,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Kiribati",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Government revenue",
    "text": "The expiration of phosphate deposits in 1979 had a devastating impact on the\neconomy. Receipts from phosphates had accounted for roughly 80% of export\nearnings and 50% of government revenue. Per capita GDP was more than cut in\nhalf between 1979 and 1981. A sovereign wealth fund financed by phosphate\nearnings was established in 1956. In 2008, the Revenue Equalization Reserve\nFund was valued at US$ 400 million. Prudent management of the Reserve Fund\nwill be vital for the long-term welfare of the country.\n\nIn 2009 the RERF was valued at A$570.5 million. The RERF assets declined from\nA$637 million (420 percent of GDP) in 2007 to A$570.5 million (350 percent of\nGDP) in 2009. Due to the 2008 financial crisis, the RERF was reduced due to\nfailed Icelandic banks, as well as withdrawals made by the government of\nKiribati to finance budgetary shortfalls.\n\nIn May 2011 the IMF country report described the impact of the GFC as being\nthat “Kiribati has been affected by the global crisis through a fall in\nremittances and large decline in the value of its wealth and pension funds—the\nRevenue Equalization Reserve Fund (RERF) and the Kiribati Provident Fund. The\nspike in food and fuel prices in 2008 has already taken a toll on economic\nactivity. Vulnerabilities to climate change, including coastline erosion, have\nalso worsened.”\n\nIn one form or another, Kiribati gets a large portion of its income from\nabroad. Examples include fishing licenses, development assistance, worker\nremittances, and tourism. Given Kiribati's limited domestic production\nability, it must import nearly all of its essential foodstuffs and\nmanufactured items; it depends on these external sources of income for\nfinancing .[_citation needed_]\n\nFishing fleets from South Korea, Japan, People's Republic of China, Taiwan,\nand the United States pay a licensing fee in order to operate in Kiribati's\nterritorial waters. These licenses produced A$25.4 million in 2007, A$32.2\nmillion in 2008 and A$29.5 million in 2009. The existence of El Niño climatic\nconditions boosted the local catch. Due to its small size and spread-out\nnature, however, Kiribati also loses untold millions of income per year from\nillegal, unlicensed fishing in its exclusive economic zone.\n\nVisitor arrivals are predominantly business-related with total visitor\narrivals of 3,380 in 2008 and 3,915 in 2009. These visitors provide $5–$10\nmillion in revenue. Tourism attractions include World War II battle sites,\ngame fishing, ecotourism, and Caroline Island, situated just inside the\nInternational Date Line and the first place on earth to celebrate every New\nYear.\n\nMost islanders engage in subsistence activities ranging from fishing to the\ngrowing of food crops like bananas, breadfruit, and papaya. The leading export\nis the coconut product copra, which accounts for about two-thirds of export\nrevenue. Other exports include pet fish, shark fins, and seaweed. Kiribati's\nprincipal trading partner is Australia.\n\nRemittances from Kiribati seamen working on foreign flagged ships provided\nA$11.6 million in 2009.\n\nIn May 2011 the IMF country report assessment of the Economy of Kiribati is\nthat: “After two years of contraction, the economy recovered in the second\nhalf of 2010 and inflation pressure dissipated. It is estimated to have grown\nby 1¾ percent for the year. Despite a weather-related drop in copra\nproduction, private sector activity appears to have picked up, especially in\nretail. Tourist arrivals rebounded by 20 percent compared to 2009, although\nfrom a very low base. Despite the rise in world food and fuel prices,\ninflation has bounced from 2008 crisis-highs into negative territory,\nreflecting the strong appreciation of the Australian dollar, which is used as\nthe domestic currency, and a decline in the world price of rice. Credit growth\nin the overall economy declined in 2009 as economic activity stalled. But it\nstarted to pick up in the second half of 2010 as the recovery gained\ntraction.”",
    "openai_summarised_points": [
      "• The expiration of phosphate deposits in 1979 had a devastating impact on Kiribati's economy, as phosphate revenues previously accounted for approximately 80% of export earnings and 50% of government revenue.",
      "• Between 1979 and 1981, Kiribati's per capita GDP was more than halved due to the loss of phosphate income.",
      "• A sovereign wealth fund financed by phosphate earnings was established in 1956 to manage resource revenues.",
      "• In 2008, the Revenue Equalization Reserve Fund (RERF) was valued at US$400 million, emphasizing its importance for the country's long-term economic stability.",
      "• The management of the RERF is considered crucial for Kiribati’s future welfare, highlighting the need for prudent financial stewardship.",
      "• In 2009, the RERF was valued at A$570.5 million, representing a decline from A$637 million in 2007, which was 420% of Kiribati’s GDP, to 350% of GDP in 2009.",
      "• The decline of the RERF assets was attributed to the 2008 global financial crisis, including losses from failed Icelandic banks and government withdrawals to cover budget shortfalls.",
      "• The IMF country report of May 2011 described the impact of the Global Financial Crisis (GFC) on Kiribati as a fall in remittances and a significant decline in the value of its wealth and pension funds, specifically the RERF and the Kiribati Provident Fund.",
      "• The 2008 spike in food and fuel prices adversely affected Kiribati’s economic activity, compounding vulnerabilities caused by climate change issues such as coastline erosion.",
      "• Kiribati derives a substantial portion of its income from abroad through sources such as fishing licenses, development assistance, worker remittances, and tourism.",
      "• Due to limited domestic production capacity, Kiribati relies heavily on imports for essential foodstuffs and manufactured goods, making external income sources vital for its economy.",
      "• Fishing license fees from fleets from South Korea, Japan, China, Taiwan, and the United States generated A$25.4 million in 2007, A$32.2 million in 2008, and A$29.5 million in 2009.",
      "• El Niño climatic conditions temporarily boosted local fish catches, increasing revenue from fishing licenses.",
      "• Kiribati also loses significant income annually from illegal, unlicensed fishing within its exclusive economic zone, due to its small size and dispersed islands.",
      "• Visitor arrivals, primarily for business, totaled 3,380 in 2008 and increased to 3,915 in 2009, generating between $5 million and $10 million in revenue.",
      "• Tourism attractions include World War II battle sites, game fishing, ecotourism, and Caroline Island, notable for being the first place on Earth to celebrate New Year due to its position just inside the International Date Line.",
      "• Most islanders engage in subsistence activities such as fishing and cultivating food crops like bananas, breadfruit, and papaya.",
      "• The leading export of Kiribati is copra, a coconut product, which accounts for about two-thirds of export revenue.",
      "• Additional exports include pet fish, shark fins, and seaweed.",
      "• Australia is Kiribati’s principal trading partner.",
      "• Remittances from Kiribati seamen working on foreign-flagged ships amounted to A$11.6 million in 2009.",
      "• The May 2011 IMF report noted that after two years of economic contraction, Kiribati’s economy recovered in the second half of 2010 with an estimated growth of 1¾ percent for the year.",
      "• Despite a weather-related decrease in copra production, private sector activity, especially in retail, showed signs of recovery.",
      "• Tourist arrivals increased by 20 percent in 2010 compared to 2009, although from a very low base.",
      "• Inflation, which had peaked during the 2008 crisis, declined into negative territory due to the appreciation of the Australian dollar (used as the domestic currency) and a decrease in the global price of rice.",
      "• Credit growth in Kiribati’s economy declined in 2009 amid stalled economic activity but began to recover in the latter half of 2010 as economic conditions improved."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:34.577946",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3965,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Kiribati",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Financial sector",
    "text": "A supermarket in Kiribati\n\nThe financial institution in Kiribati are the Development Bank of Kiribati\n(DBK) that is wholly government-owned and ANZ Bank (Kiribati) Limited\n(formerly known as Bank of Kiribati), which is the sole commercial bank in\nKiribati. Insurance services are provided by another government financial\ninstitution, the Kiribati Insurance Corporation. The Kiribati Provident Fund\n(KPF), also government-owned, manages the assets of the pension system, about\n60 percent of GDP in 2010."
  },
  {
    "chapter_name": "Economy of Kiribati",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "International development assistance",
    "text": "The economy of Kiribati benefits from international development assistance\nprograms. The multilateral donors providing development assistance in 2009\nwere the European Union (A$9 million), the United Nations Development Program\n(A$3.7 million), and the World Health Organization (A$100,000). The bilateral\ndonors providing development assistance in 2009 were Australia (A$11 million),\nJapan (A$2 million), New Zealand (A$6.6 million), Taiwan (A$10.6 million), and\nother donors providing A$16.2 million, including technical assistance grants\nfrom the Asian Development Bank.\n\nThe major donors in 2010/2011 were Australia (A$15 million), Taiwan (A$11\nmillion); New Zealand (A$6 million), the World Bank (A$4 million), and the\nAsian Development Bank.\n\nKiribati joined the Asian Development Bank (AsDB) in 1974. The AsDB has\nprovided US$27.14 million over seven project loans to Kiribati from Asian\nDevelopment Fund (ADF). The AsDB has also provided technical assistance\nfunding of US$13.9 million for 41 projects.\n\nAustralia continues as the largest donor to Kiribati and has committed to\nprovide A$28.2 million in development assistance in 2011-12. The Australia-\nKiribati Partnership for Development (signed in January 2009), provides to\nAustralian aid to focus on improving basic education standards, developing\nworkforce skills, and strengthening economic governance. The development\nassistance from Australia is allocated to: AusAID country program A$18.3\nmillion (2011–12 est.); Regional assistance estimate A$9.9 million (2011–12\nest.)\n\nNew Zealand has committed to provide NZ$14.3 million in development assistance\nin 2011-12, which is allocated primarily through the NZAID bilateral programme\nto projects related to economic development, education and developing\nworkforce skills, and addressing vulnerabilities in Kiribati.\n\nKiribati became a member of the World Bank in 1986. On 1 March 2011, the World\nBank announced a Country Assistance Strategy (CAS) for Kiribati, which is\nstructured around the themes of: (i) addressing the existential threat posed\nby climate change; and, (ii) mitigating the effects of geographic isolation.\nThe CAS is intended to be implemented through grants and trust fund\ninvestments of up to US$50 million during the period 2011 to 2014."
  },
  {
    "chapter_name": "Economy of Kiribati",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "GDP and other economic performance indicators",
    "text": "This article incorporates public domain material from _The World Factbook_.\nCIA.\n\nFurther information sourced from: \"Kiribati: 2011 Article IV Consultation-\nStaff Report, Informational Annexes, Debt Sustainability Analysis, Public\nInformation Notice on the Executive Board Discussion, and Statement by the\nExecutive Director for Kiribati\". International Monetary Fund Country Report\nNo. 11/113. 24 May 2011. Retrieved 10 September 2011.\n\n\"Kiribati: Statistical Appendix\". International Monetary Fund Country Report\nNo. 11/114. 24 May 2011. Retrieved 10 September 2011.\n\n**GDP \\- purchasing power parity:** US$618 million (2010 est.)\n\n**GDP \\- official exchange rate:** US$147 million (2010 est.)\n\n**GDP \\- real growth rate:** -0.7% (2009); 1.8% (2010 est.) 3% (2011 proj.)\n\n**GDP \\- per capita:** US$1,420 (2010)\n\n**GDP \\- composition by sector:** (2002)\n\nAgriculture: 8.9%\n\nIndustry: 24.2%\n\nServices: 66.8%\n\n**Inflation rate (consumer prices):** 8.8 (2009), -2.8% (2010)\n\n**Total population:** 103,280 (July 2011 est.)\n\n**Labour force:** 7,870 economically active, not including subsistence farmers\n(2001 est.)\n\n**Unemployment rate:** N/A\n\n**Budget:**\n(millions) Total revenues and grants: A$124.4 million (2010 budget); A$136.9\n(2010 est.)\n\nTotal expenditures: A$143.3 million (2010 budget); A$150.1 (2010 est.)\n\n**Electricity - production by source:**\n_fossil fuel:_ 100%\n_other:_ 0% (1998)\n\n**Electricity - production:** 14 million kWh (2007 est.)\n\n**Electricity - consumption:** 13.02 kWh (2007 est.)\n\n**Agriculture - products:** copra, taro, breadfruit, sweet potatoes,\nvegetables; fish\n\n**Currency:** 1 Australian dollar ($A) = 100 cents\n\n**Exchange rates:** Australian dollars ($A) per US$1 – 1.0902 (2010), 1.2822\n(2009), 1.2059 (2008), 1.2137 (2007), 1.3285 (2006)\n\nThe Australian dollar (A$) is the currency of Kiribati."
  }
]