[
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Lilongwe market.\n\nThe **economy ofMalawi** is $7.522 billion by gross domestic product as of\n2019, and is predominantly agricultural, with about 80% of the population\nliving in rural areas. The landlocked country in south central Africa ranks\namong the world's least developed countries and poorest countries.\nApproximately 50% of the population lives below the national poverty line,\nwith 25% living in extreme poverty.\n\nIn 2017, agriculture accounted for about one-third of GDP and about 80% of\nexport revenue. The economy depends on substantial inflows of economic\nassistance from the IMF, the World Bank, and individual donor nations. The IMF\nand World Bank has spearheaded structural reforms in Malawi for decades.\n\nThe government faces strong challenges: to spur exports, to improve\neducational and health facilities, to face up to environmental problems of\ndeforestation and erosion, and to deal with the problem of HIV/AIDS in Africa."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "Malawi's most important export crop is tobacco, which accounted for a third\n(30%) of export revenue in 2012. In 2000, the country was the tenth-largest\nproducer in the world. The country's heavy reliance on tobacco places a heavy\nburden on the economy as world prices decline and the international community\nincreases pressure to limit tobacco production. Malawi's dependence on tobacco\nis growing, with the product jumping from 53% to 70% of export revenues\nbetween 2007 and 2008.\n\nA Malawi tea estate\n\nThe country also relies heavily on tea, sugarcane and coffee, with these three\nplus tobacco making up more than 90% of Malawi's export revenue. Tea was first\nintroduced in 1878. Most of it is grown in Mulanje and Thyolo. Other crops\ninclude cotton, corn, potatoes, sorghum, cattle and goats. Tobacco and sugar\nprocessing are notable secondary industries.\n\nTraditionally Malawi has been self-sufficient in its staple food, maize\n(corn), and during the 1980s it exported substantial quantities to its\ndrought-stricken neighbors. Nearly 90% of the population engages in\nsubsistence farming. Smallholder farmers produce a variety of crops, including\nmaize, beans, rice, cassava, tobacco, and groundnuts (peanuts). Financial\nwealth is generally concentrated in the hands of a small elite. Malawi's\nmanufacturing industries are situated around the city of Blantyre.\n\nLake Malawi and Lake Chilwa provide most of the fish for the region. For many\nMalawians, fish is the most important source of proteins. Dried fish is not\nonly consumed locally, but also exported to neighboring countries. Most\nfishing is done on small scale by hand. However, Maldeco Fisheries owns\nseveral commercial fishing boats and operates fish farms in the southern part\nof Lake Malawi.\n\nDried fish on Likoma Island\n\nMalawi has few exploitable mineral resources. A South-African Australian\nconsortium exploits uranium at a mine near Karonga. Coal is being extracted in\nMzimba District. Malawi's economic reliance on the export of agricultural\ncommodities renders it particularly vulnerable to external shocks such as\ndeclining terms of trade and drought. High transport costs, which can comprise\nover 30% of its total import bill, constitute a serious impediment to economic\ndevelopment and trade. Malawi must import all its fuel products. Other\nchallenges include a paucity of skilled labor, difficulty in obtaining\nexpatriate employment permits, bureaucratic red tape, corruption, and\ninadequate and deteriorating road, electricity, water, and telecommunications\ninfrastructure which hinder economic development in Malawi. However, recent\ngovernment initiatives targeting improvements in the road infrastructure,\ntogether with private sector participation in railroad and telecommunications,\nhave begun to render the investment environment more attractive.\n\nRoadside vendor in Blantyre\n\nThe following are Malawi's top 20 agricultural production values and volumes\nfor 2009. (Unofficial figures derived from FAO statistics)\n\nCommodity  | Production in International dollars (1000)  | Production in tonnes | FAO source\n---|---|---|---\nMaize | 462,330  | 3,582,500  |\nCassava | 404,764  | 3,823,240  |\nTobacco | 331,542  | 208,155  |\nGroundnuts | 116,638  | 275,176  |\nBananas (excluding plantains)  | 95,152  | 400,000  | F\nSugar cane | 82,093  | 2,500,000  | F\nIndigenous cattle meat | 80,688  | 0  |\nPigeon peas | 80,274  | 184,156  |\nBeans, dry | 75,706  | 164,712  |\nFresh fruit | 74,456  | 213,321  | Im\nPlantains | 72,634  | 351,812  | Im\nIndigenous pig meat | 68,788  | 0  |\nTea | 55,895  | 52,559  | P\nIndigenous goat meat | 53,512  | 0  |\nMangoes, mangosteens and guavas | 49,527  | 82,659  | Im\nCotton lint | 39,017  | 27,300  | F\nPaddy rice | 36,896  | 135,988  |\nFresh vegetables | 30,530  | 162,012  | Im\nIndigenous chicken meat | 25,713  | 0  |\nCow peas | 18,073  | 72,082  |\n\nKey: F : FAO estimate, Im: FAO data based on imputation methodology, P :\nProvisional official data"
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Macro-economic trends",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Pct. of GDP)\n---|---|---|---|---|---|---\n**1980** | 2.70  | 412  | 3.02  | 0.4%  | 19.2%  | n/a\n**1985** | 3.88  | 503  | 2.76  | 4.6%  | 10.6%  | n/a\n**1990** | 5.07  | 505  | 4.22  | 5.7%  | 11.9%  | n/a\n**1995** | 6.45  | 605  | 3.41  | 13.8%  | 83.1%  | n/a\n**2000** | 8.67  | 718  | 4.26  | 0.8%  | 29.6%  | n/a\n**2001** | 8.50  | 689  | 4.18  | -4.1%  | 22.7%  | n/a\n**2002** | 8.78  | 686  | 4.92  | 1.8%  | 14.7%  | 101.5%\n**2003** | 9.47  | 723  | 4.52  | 5.7%  | 9.6%  | 84.7%\n**2004** | 10.25  | 766  | 4.90  | 5.4%  | 11.4%  | 74.7%\n**2005** | 10.92  | 800  | 5.15  | 3.3%  | 15.5%  | 70.9%\n**2006** | 11.78  | 839  | 5.63  | 4.7%  | 13.9%  | 17.9%\n**2007** | 13.26  | 919  | 6.24  | 9.6%  | 7.9%  | 18.9%\n**2008** | 14.55  | 980  | 7.49  | 7.6%  | 8.7%  | 23.5%\n**2009** | 15.86  | 1,038  | 8.72  | 8.3%  | 8.4%  | 23.5%\n**2010** | 17.16  | 1,092  | 9.80  | 6.9%  | 7.4%  | 19.3%\n**2011** | 18.36  | 1,136  | 11.24  | 4.9%  | 7.6%  | 20.0%\n**2012** | 19.06  | 1,146  | 8.42  | 1.9%  | 21.3%  | 28.6%\n**2013** | 20.39  | 1,192  | 7.65  | 5.2%  | 28.3%  | 35.3%\n**2014** | 21.93  | 1,246  | 8.53  | 5.7%  | 23.8%  | 33.5%\n**2015** | 22.78  | 1,258  | 9.01  | 3.0%  | 21.9%  | 35.5%\n**2016** | 23.52  | 1,262  | 7.73  | 2.3%  | 21.7%  | 37.1%\n**2017** | 24.90  | 1,299  | 8.94  | 4.0%  | 11.5%  | 40.0%\n**2018** | 25.27  | 1,282  | 9.88  | 4.4%  | 9.2%  | 40.8%\n**2019** | 27.52  | 1,356  | 11.03  | 5.4%  | 9.4%  | 41.2%\n**2020** | 29.54  | 1,415  | 11.85  | 1.0%  | 8.6%  | 53.9%\n**2021** | 33.83  | 1,575  | 12.48  | 4.6%  | 9.3%  | 66.5%\n**2022** | 36.58  | 1,656  | 12.53  | 0.9%  | 20.8%  | 76.7%\n**2023** | 38.45  | 1,692  | 12.67  | 1.5%  | 28.8%  | 91.3%\n**2024** | 40.07  | 1,714  | 10.84  | 1.8%  | 30.6%  | 84.5%"
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Industry",
    "text": "In 2013, Malawi's manufacturing sector contributed 10.7% of GDP. The main\nindustries are food processing, construction, consumer goods, cement,\nfertilizer, ginning, furniture production and cigarette production.\n\nThe government's attempts to diversify the agriculture sector and move up the\nglobal value chain have been seriously constrained by poor infrastructure, an\ninadequately trained work force and a weak business climate. In order to help\ncompanies adopt innovative practices and technologies, the _National Export\nStrategy_ adopted in 2013 affords companies greater access to the outcome of\ninternational research and better information about available technologies; it\nalso helps companies to obtain grants to invest in such technologies from\nsources such as the country's Export Development Fund and the Malawi\nInnovation Challenge Fund. In parallel, the government has raised its\ninvestment in research and development to 1% of GDP."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Food and beverages",
    "text": "Most fruits and vegetables are exported raw, while processed food is imported\nmainly from South Africa. Carlsberg opened its first brewery outside of\nDenmark in Blantyre in 1965. The brewery also bottles Coca-Cola products under\nlicence. A mango processing plant for the export of fruit concentrate opened\nin Salima in 2013. Universal Industries operates several food factories in\nBlantyre, where it produces sweets, crisps, biscuits, milk powder, soy\nproducts and baby food. Coffee and tea are processed by half a dozen of\ndifferent companies in the regions of Thyolo, Mulanje and around Mzuzu."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Pharmaceutical companies",
    "text": "Malawi has four pharmaceutical companies. They manufacture a limited range of\ndrugs, particularly those that are in great demand on the local market. These\nare Pharmanova Ltd., which is the biggest pharmaceutical manufacturer in\nMalawi, followed by SADM, Malawi Pharmacies (Pharmaceuticals Limited) and\nKentam Products Limited."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Forestry",
    "text": "Lady carrying a solar panel.\n\nLarge man-made pine tree forests are located in the Viphya Mountains, around\nMulanje and Zomba. Timber production for building materials and furniture is\nan important industry for these regions. However, most areas in Malawi suffer\nfrom deforestation due to illegal logging for charcoal production and the use\nof firewood."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Electricity",
    "text": "Malawi's sole power supplier is the state owned Electricity Supply Commission\nof Malawi (ESCOM), which generates almost all its power from hydroelectric\nplants along the Shire River. The installed is approximately 351MW. About 12%\nof the country's population has access to electricity, according to 2014 World\nBank figures.\n\nThe country has been suffering from intermittent power outages as a result of\nan ongoing drought that has halved power output as water levels of the Shire\nriver dropped significantly. The river usually generates 300MW of electricity,\naccounting for 98% of Malawi's total supply. However, the drought reduced that\ncapacity to 160MW, according to ESCOM."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Services",
    "text": "The service sector accounts for 51.7% of Malawi's national GDP. Notable\nindustries are tourism, retail, transport, education, health services,\ntelecommunication and the banking sector. The Government of Malawi holds\nshares in many important companies, such as Malawian Airlines (51%) and Press\nCorporation Limited. Press Corporation Ltd. is the country's biggest company,\nwith subsidiaries in the tobacco, banking, sugar, fishing, ethanol production,\nsteel production, retail, telecommunication and petrol sectors."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "International support",
    "text": "Malawi has undertaken economic structural adjustment programs supported by the\nWorld Bank (IBRD), the International Monetary Fund (IMF), and other donors\nsince 1981. Broad reform objectives include stimulation of private sector\nactivity and participation through the elimination of price controls and\nindustrial licensing, liberalization of trade and foreign exchange,\nrationalization of taxes, privatization of state-owned enterprises, and civil\nservice reform. Malawi qualified for Heavily Indebted Poor Country (HIPC) debt\nrelief and is in the process of refining its poverty reduction strategy.\n\nMalawi has bilateral trade agreements with its two major trading partners,\nSouth Africa and Zimbabwe, both of which allow duty-free entry of Malawian\nproducts into their countries. The government faces challenges such as the\nimprovement of Malawi's educational and health facilities — particularly\nimportant because of the rising[_when?_] rates of HIV/AIDS — and environmental\nproblems including deforestation, erosion, and overworked soils.[_citation\nneeded_]\n\nFormer President Bingu wa Mutharika of Malawi spoke about the country's recent\nunilateral agricultural reforms at the World Economic Forum on Africa at the\nUnited Nations, September 2008."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Move towards economic independence",
    "text": "In 2006, in response to disastrously low agricultural harvests, Malawi,\nthrough an initiative by the late President Bingu Mutharika, an economist by\nprofession, began a program of fertilizer subsidies that were designed to re-\nenergize the land and boost crop production. It has been reported that this\nprogram, championed by the country's president, is radically improving\nMalawi's agriculture, and causing Malawi to become a net exporter of food to\nnearby countries.\n\nEconomic grievances though took a downward slide during Mutharika's second\nterm. Economic grievances were a catalyst that resulted in the 2011 economic\nprotests in Malawi in July."
  },
  {
    "chapter_name": "Economy of Malawi",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Economic indicators",
    "text": "The following figures are taken from the CIA World Factbook, unless otherwise\nindicated.\n\n**GDP:** purchasing power parity = $22.37 billion (2017 est.)\n\nInterest rates advertised by Malawi Savings Bank in Nchalo, Malawi on 30\nSeptember 2008 Exchange rates advertised by a currency trader in Lilongwe on 7\nOctober 2008 Reserve Bank of Malawi Mzuzu Branch under construction in Mzuzu,\na fast-growing city. July 2008\n\n**GDP - real growth rate:** 4% (2017 est.)\n\n**GDP - per capita:** purchasing power parity - $1200 (2017 est.)\n\n**GDP - composition by sector:**\n_agriculture:_ 28.1%\n_industry:_ 15.8%\n_services:_ 56.1% (2016 est.)\n\n**Population below poverty line:** 50.7% (2010 est.)\n\n**Inflation rate (consumer prices):** 23% (2014 est.)\n\n**Labor force:** 7 million (2013 est.)\n\n**Labor force - by occupation:** agriculture 76.9%, industry and services\n23.1% (2013 est.)\n\n**Unemployment rate:** NA%\n\n**Budget:**\n_revenues:_ $1.346 billion (2017 est.)\n_expenditures:_ $1.556 billion (2017 est.)\n\n**Public Debt** 59.3% of GDP (2017 est.)\n\n**Industries:** tobacco, tea, sugar, sawmill products, cement, consumer goods,\ncotton, consumer goods, uranium and coal mining\n\n**Industrial production growth rate:** 2.8% (2013 est.)\n\n**Electricity - production:** 1.973 billion kWh (2010 est.)\n\n**Electricity - consumption:** 1.835 billion kWh (2010 est.)\n\n**Agriculture - products:** tobacco, sugar cane, cotton, tea, maize, potatoes,\ncassava (tapioca), sorghum, pulses; cattle, goats\n\n**Exports:** $1.427 billion (2013 est.)\n\n**Exports - commodities:** tobacco, tea, sugar, cotton, coffee, peanuts, wood\nproducts, apparel, uranium and its compounds\n\n**Exports - partners:** Canada 10.6%, Zimbabwe 9.3%, Germany 7.3%, South\nAfrica 6.6%, Russia 6.5%, US 6.1%, China 4.2% (2012)\n\n**Imports:** $2.42 billion (2013 est.)\n\n**Imports - commodities:** food, petroleum products, semimanufactures,\nconsumer goods, transportation equipment\n\n**Imports - partners:** South Africa 27%, China 16.6%, India 8.7%, Zambia\n8.5%, Tanzania 5.1%, US 4.3% (2012)\n\n**Current account balance** \\- $280.1 million (2013 est.)\n\n**Debt - external:** $1.556 billion (31 December 2013 est.)\n\n**Economic aid - recipient:**\n\n$575.3 million (2005)\n\n**Foreign direct investment - inflow** $129.5 million (2014)\n\n**Currency:** 1 Malawian kwacha (MK) = 100 tambala\n\n**Exchange rates:** Malawian kwachas per US dollar -730.00 (20/June/2016),\n460.00 (20/Jan/2015), 360.00 (6/Feb/2013), 165.961 (1/Sep/2011), 145.179\n(2009), 135.96 (2006), 108.894 (2005), 108.898 (2004), 97.433 (2003), 76.687\n(2002)\n\n**Fiscal year:** 1 July - 30 June\n\nWikimedia Commons has media related to Economy of Malawi."
  }
]