[
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. The reason given is: The information\nin this article is outdated since the Russian invasion of Ukraine where its\neconomy has significantly deteriorated. Please help update this article to\nreflect recent events or newly available information. _( December 2024)_  \n---|---  \n  \nThe **economy of Ukraine** is a developing, upper-middle income, mixed\neconomy. It grew rapidly from 2000 until the 2008–2009 Ukrainian financial\ncrisis. The economy recovered in 2010 and continued improving until 2013. The\nRussian incursion in Ukraine caused a severe economic decline from 2014 to\n2015, with the country's gross domestic product in 2015 barely surpassing half\nof what it was in 2013. In 2016, the economy again started to grow. By 2018,\nthe Ukrainian economy was growing rapidly, and reached almost 80% of its size\nin 2008.\n\nThe depression during the 1990s included hyperinflation and a fall in economic\noutput to less than half of the GDP of the preceding Ukrainian SSR. GDP growth\nwas recorded for the first time in 2000, and continued for eight years. This\ngrowth was halted by the 2008 financial crisis. The Ukrainian economy\nrecovered and achieved positive GDP growth in the first quarter of 2010. In\nthe early 2010s, Ukraine was noted as possessing many of the components of a\nmajor European economy, such as rich farmlands, a well-developed industrial\nbase, highly trained labour, and a good education system. It also has\nimportant mineral resources.\n\nIn October 2013, the Ukrainian economy lapsed into a recession. The previous\nsummer, Ukrainian exports to Russia substantially declined due to stricter\nborder and customs control by Russia. The early 2014 annexation of Crimea by\nRussia, and the war in Donbas that started in the spring of 2014 severely\ndamaged Ukraine's economy and two of Ukraine's most industrial regions. In\n2013, Ukraine saw zero GDP growth. Ukraine's economy shrank by 6.8% in 2014,\nand this continued with a 12% decline in GDP in 2015. In April 2017, the World\nBank stated that Ukraine's economic growth rate was 2.3% in 2016, ending the\nrecession. Despite these improvements, Ukraine remains one of the poorest\ncountries in Europe, which some have attributed to high corruption levels and\nthe slow pace of economic liberalisation and institutional reform. The Russian\nInvasion of Ukraine in 2022 further deteriorated the country's economy.",
    "openai_summarised_points": [
      "• The economy of Ukraine is classified as a developing, upper-middle income, mixed economy that experienced rapid growth from 2000 until the 2008–2009 Ukrainian financial crisis.",
      "• Following the financial crisis, Ukraine's economy recovered in 2010 and continued to improve until 2013, when it faced significant challenges due to geopolitical tensions.",
      "• The Russian incursion into Ukraine beginning in 2014 caused a severe economic decline between 2014 and 2015, with Ukraine's gross domestic product (GDP) in 2015 barely exceeding half of its 2013 level.",
      "• Economic growth resumed in 2016, and by 2018, the Ukrainian economy was growing rapidly, reaching nearly 80% of its size compared to 2008.",
      "• During the 1990s, Ukraine experienced a deep economic depression characterized by hyperinflation and a reduction in economic output to less than half of the GDP of the former Ukrainian SSR.",
      "• GDP growth was first recorded in 2000 and continued uninterrupted for eight years until the 2008 global financial crisis halted this progress.",
      "• The Ukrainian economy recovered to achieve positive GDP growth in the first quarter of 2010.",
      "• In the early 2010s, Ukraine was recognized for possessing key attributes of a major European economy, including fertile agricultural land, a well-developed industrial sector, a highly trained labor force, a strong education system, and significant mineral resources.",
      "• In October 2013, Ukraine entered a recession triggered partly by a substantial decline in exports to Russia during the previous summer, due to Russia implementing stricter border and customs controls.",
      "• The early 2014 annexation of Crimea by Russia and the outbreak of war in the Donbas region in spring 2014 severely damaged Ukraine’s economy and its two most industrialized regions.",
      "• Ukraine experienced zero GDP growth in 2013, followed by a 6.8% contraction in 2014 and a further 12% decline in GDP in 2015.",
      "• In April 2017, the World Bank reported that Ukraine’s economic growth rate was 2.3% in 2016, marking the end of the recession period.",
      "• Despite signs of recovery, Ukraine remains one of the poorest countries in Europe, a condition attributed by some analysts to persistent high levels of corruption and the slow pace of economic liberalization and institutional reforms.",
      "• The Russian invasion of Ukraine in 2022 caused further significant deterioration of the country’s economy.",
      "• As of December 2024, the information on Ukraine’s economy is recognized as outdated due to the ongoing impacts of the Russian invasion, and updates are needed to reflect recent events and newly available data."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:36.173392",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2406,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Before 1917",
    "text": "Geography has long influenced the economy of the Ukrainian lands. Rich fertile\nsoils (such as chernozem areas) made the area a \"breadbasket\": for ancient\nGreece as well as for early modern Europe. The maintenance of trade corridors\n– the route from the Varangians to the Greeks and access through the Straits\nto the Mediterranean world – became important. Mineral resources encouraged\nindustrialisation – notably in the Donbas – from the 19th century onwards.\n\nThe lack of secure borders meant repeated interruptions in economic\ndevelopment. Steppe nomads and other conquerors – Cumans, Mongols, Tatars for\nexample, sometimes saw plundering as more important than fostering economic\ndevelopment. In the 16th to 18th centuries, the wastelands of the Wild Fields\nleft much of Ukraine as an area of tentatively militarised outposts, prior to\ntsarist Russia's extension of its power into the region in the 17th and 18th\ncenturies.",
    "openai_summarised_points": [
      "• The economy of the Ukrainian lands has been historically shaped by its geography, with rich fertile soils, particularly chernozem areas, establishing the region as a significant \"breadbasket\" for ancient Greece and early modern Europe.",
      "• The maintenance of key trade corridors was crucial, notably the route from the Varangians to the Greeks, which provided access through the Straits to the Mediterranean world, facilitating economic exchange.",
      "• From the 19th century onwards, the presence of mineral resources, especially in the Donbas region, spurred industrialisation within Ukrainian territories.",
      "• The absence of secure borders led to frequent disruptions in economic development due to invasions and instability.",
      "• Various steppe nomads and conquerors, including the Cumans, Mongols, and Tatars, often prioritized plundering over the promotion of sustained economic growth in the region.",
      "• Between the 16th and 18th centuries, large areas of Ukraine, known as the Wild Fields, remained largely undeveloped and were characterized by tentatively militarised outposts rather than stable economic centers.",
      "• The expansion of tsarist Russia's power into Ukrainian lands during the 17th and 18th centuries marked a significant political and economic turning point, gradually integrating the region into the Russian imperial economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:31.770958",
      "openai_model": "gpt-4.1-mini",
      "content_length": 926,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "1991 to 2000",
    "text": "On 24 August 1991, Ukraine established its independence from the Soviet Union.\nThe new state's economy suffered huge output declines and soaring inflation in\nthe following years. Ukraine saw hyperinflation in the early 1990s because of\na lack of access to financial markets and massive monetary expansion to\nfinance government spending, while output declined sharply this was\ncatastrophic for the economy because it undid decades of hard-fought economic\nprogress and people became poorer. Huge output declines and soaring inflation\nwas at the time common to most former Soviet republics, but Ukraine was among\nthe hardest hit by these problems.\n\nIn response to hyperinflation the National Bank of Ukraine replaced the\nnational currency, the karbovanets, with the hryvnia in September 1996 and\npledged to keep it stable in relation to the U.S. dollar. The currency\nremained unstable through the late 1990s, particularly during the 1998 Russian\nfinancial crisis.\n\nDeep recession during the 1990s led to a relatively high poverty rate, but\nbeginning in 2001, seven straight years of economic growth, raised the living\nstandard for most citizens. A World Bank report in 2007 noted that: \"Ukraine\nrecorded one of the sharpest declines in poverty of any transition economy in\nrecent years. The poverty rate, measured against an absolute poverty line,\nfell from a high of 32% in 2001 to 8% in 2005.\" The UN noted that Ukraine had\novercome absolute poverty, and that there was only relative poverty in 2009.",
    "openai_summarised_points": [
      "• On 24 August 1991, Ukraine declared its independence from the Soviet Union, marking the beginning of its status as a sovereign state.",
      "• Following independence, Ukraine's economy experienced severe output declines and soaring inflation throughout the early 1990s, severely damaging economic progress made during the Soviet era.",
      "• Ukraine suffered hyperinflation in the early 1990s primarily due to restricted access to international financial markets and massive monetary expansion aimed at financing government expenditures, which coincided with a sharp decline in industrial and economic output.",
      "• The economic crisis in Ukraine during this period was catastrophic, causing widespread impoverishment and reversing decades of economic development; these issues were common among former Soviet republics, but Ukraine was among the most severely affected.",
      "• To combat hyperinflation, the National Bank of Ukraine introduced a new national currency, the hryvnia, in September 1996, replacing the karbovanets, and committed to maintaining its stability relative to the U.S. dollar.",
      "• Despite the introduction of the hryvnia, the currency remained unstable throughout the late 1990s, particularly impacted by the 1998 Russian financial crisis, which further destabilized Ukraine's economy.",
      "• The deep recession of the 1990s resulted in a relatively high poverty rate across Ukraine, reflecting the broader economic hardships faced by the population during this decade.",
      "• Starting in 2001, Ukraine experienced seven consecutive years of economic growth, which significantly improved living standards for the majority of its citizens.",
      "• A 2007 World Bank report highlighted Ukraine’s substantial reduction in poverty during the early 2000s, noting that the poverty rate, measured against an absolute poverty line, fell sharply from 32% in 2001 to 8% in 2005.",
      "• The United Nations recognized that by 2009, Ukraine had effectively overcome absolute poverty, with poverty existing only in relative terms rather than absolute deprivation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:33.613865",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1499,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "2000 to 2014",
    "text": "Ukraine stabilised by the early 2000s. The year 2000 saw the first year of\neconomic growth since Ukraine's independence. The economy continued to grow\nthanks to a 50% growth in exports between 2000 and 2008 – mainly exports from\nthe traditional industries of metals, metallurgy, engineering, chemicals, and\nfood. Between 2001 and 2008, metals and chemicals prices boomed because of\nfast international economic growth, while the price of natural gas imported\nfrom Russia remained low.\n\nMonetisation also helped to drive the economic boom Ukraine experienced\nbetween 2000 and 2008. Attracted in part by relatively high interest-rates,\nforeign cash was injected into Ukraine's economy and money supply grew\nrapidly: from 2001 to 2010 broad, money increased at an annual rate of 35%. In\n2006 and 2007, credit growth averaged 73%.\n\nAn effect of this was that Ukrainian assets began to look like a large\neconomic bubble and high inflation started to damage Ukraine's export\ncompetitiveness. The ratio of credit to GDP grew extremely fast – from 7% to\nalmost 80% over just several[_quantify_] years. From 2000 to 2007, Ukraine's\nreal growth averaged 7.4%. This growth was driven by domestic demand:\norientation toward consumption, other structural change, and financial\ndevelopment.\n\nDomestic demand grew in constant prices by almost 15% annually. It was\nsupported by expansionary—procyclical—fiscal policy. Ukraine benefited from\nvery low labour costs, slightly lower tariffs, and high prices of its main\nexport goods, but at the same time faced notably higher non-tariff barriers.\nRussia has not charged Ukraine below-world-market prices for natural gas since\nthe end of 2008. This led to various Russia–Ukraine gas disputes.\n\nUkraine suffered severely in the economic crisis of 2008. Because of it\nUkraine experienced a drought in capital flows. The hryvnia, which had been\npegged at a rate of 5:1 to the U.S. dollar, was devalued to 8:1, and was\nstabilised at that ratio until the beginning of 2014. In 2008, Ukraine's\neconomy ranked 45th in the world according to GDP (nominal), with a total\nnominal GDP of US$188 billion, and nominal per capita GDP of US$3,900. There\nwas 3% unemployment at the end of 2008. Over the first 9 months of 2009,\nunemployment averaged 9.4%. The final official unemployment rates for 2009 and\n2010 were 8.8% and 8.4%, although the CIA World Factbook notes a \"large number\nof unregistered or underemployed workers\". Ukraine's GDP fell by 15% in 2009.\n\nThe Ukrainian economy recovered in the first quarter of 2010 due to the\nrecovery of the world economy and increasing prices for metals. Ukraine's real\nGDP growth in 2010 was 4.3%, leading to a per capita PPP GDP of US$6,700. In\n2011, Ukrainian politicians estimated that 40% of Ukraine's economy was a\nshadow economy.\n\nIn the summer of 2013, Ukrainian exports to Russia fell substantially due to\nRussia's stricter customs controls.\n\nBy October 2013, the Ukrainian economy had become stuck in recession. Moody's\ndowngraded Ukraine's credit rating to Caa1 (poor quality and very high credit\nrisk) in September 2013. At the time, swap markets rated Ukraine's default\nprobability over the next five years at 50%. In 2013, Ukraine saw no growth in\nGDP.",
    "openai_summarised_points": [
      "• By the early 2000s, Ukraine's economy had stabilized, with the year 2000 marking the first year of economic growth since its independence.",
      "• Between 2000 and 2008, Ukraine's economy continued to grow, driven by a 50% increase in exports primarily from traditional industries such as metals, metallurgy, engineering, chemicals, and food.",
      "• From 2001 to 2008, international economic growth caused a boom in metals and chemicals prices, while the price of natural gas imported from Russia remained low.",
      "• Monetisation contributed to Ukraine's economic boom between 2000 and 2008, with foreign capital attracted by relatively high interest rates, leading to rapid growth in the money supply; broad money increased at an annual rate of 35% from 2001 to 2010.",
      "• Credit growth averaged 73% in 2006 and 2007, contributing to the perception of Ukrainian assets as a large economic bubble and causing high inflation that damaged export competitiveness.",
      "• The ratio of credit to GDP in Ukraine grew dramatically from 7% to nearly 80% over several years (exact years unspecified).",
      "• From 2000 to 2007, Ukraine's real GDP growth averaged 7.4%, driven primarily by domestic demand, which was supported by consumption orientation, structural changes, and financial development.",
      "• Domestic demand in constant prices grew by almost 15% annually, supported by expansionary, procyclical fiscal policy.",
      "• Ukraine benefited from very low labor costs, slightly lower tariffs, and high prices for its main export goods but faced significantly higher non-tariff barriers.",
      "• Since the end of 2008, Russia ceased charging Ukraine below-world-market prices for natural gas, leading to various Russia–Ukraine gas disputes.",
      "• Ukraine was severely affected by the 2008 global economic crisis, experiencing a drought in capital flows.",
      "• The Ukrainian hryvnia, previously pegged at 5:1 to the U.S. dollar, was devalued to 8:1 in 2008 and remained stable at that rate until early 2014.",
      "• In 2008, Ukraine ranked 45th globally by nominal GDP, with a total nominal GDP of US$188 billion and a nominal per capita GDP of US$3,900.",
      "• Unemployment in Ukraine was 3% at the end of 2008, but averaged 9.4% over the first nine months of 2009; official unemployment rates were 8.8% in 2009 and 8.4% in 2010, though the CIA World Factbook noted a large number of unregistered or underemployed workers.",
      "• Ukraine's GDP contracted by 15% in 2009 due to the economic crisis.",
      "• The Ukrainian economy began recovering in the first quarter of 2010, aided by the global economic recovery and rising metal prices.",
      "• Real GDP growth in Ukraine was 4.3% in 2010, resulting in a per capita purchasing power parity (PPP) GDP of US$6,700.",
      "• In 2011, Ukrainian politicians estimated that approximately 40% of the country's economy operated within the shadow economy.",
      "• In the summer of 2013, Ukrainian exports to Russia declined substantially due to Russia imposing stricter customs controls.",
      "• By October 2013, Ukraine's economy was in recession, with no GDP growth recorded for the year.",
      "• In September 2013, Moody's downgraded Ukraine's credit rating to Caa1, indicating poor quality and very high credit risk.",
      "• At that time, swap markets assessed Ukraine's probability of default over the next five years at 50%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:42.315270",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3224,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "Post-Euromaidan: 2014 to present",
    "text": "Due to the loss of Ukraine's largest trading partner, Russia, over the\nannexation of Crimea in March 2014, and exacerbated by the war in Donbas which\nstarted in April 2014 Ukraine's economy shrank by 6.8% in 2014. It had been\nexpected to decline by 8%. A Ukrainian government report stated early in\nFebruary 2016 that Ukraine's economy had shrunk by 10.4% in 2015. For 2015,\nthe National Bank of Ukraine had expected a further decline of 11.6%, and the\nWorld Bank anticipated a 12% shrinkage. The World Bank forecast growth of 1%\nin 2016.\n\nEarly in February 2014, the National Bank of Ukraine changed the hryvnia into\na fluctuating/floating currency in an attempt to meet IMF requirements and to\ntry to enforce a stable price for the currency in the Forex market. In 2014\nand 2015, the hryvnia lost about 70% of its value against the U.S. dollar.\n\nThe IMF agreed to a four-year loan programme worth about $17.5 billion in\neight tranches over 2015 and 2016, subject to conditions which involved\neconomic reforms. However, due to lack of progress on reforms, only two\ntranches worth $6.7 billion were paid in 2015. A third tranche of $1.7 billion\nwas provisionally scheduled in June 2016 subject to the bringing into law of\n19 further reform measures. Some western analysts believed that large foreign\nloans were not encouraging reform, but enabling the corrupt extraction of\nfunds out of the country.\n\nSince December 2015, Ukraine has refused to pay and hence _de facto_ defaults\non a $3 billion debt payment to Russia that formed part of a December 2013\nUkrainian–Russian action plan.\n\nThe turnover of retail trade in Ukraine in 2014 shrank by 8.6% (from 2013) and\nshrank by 20.7% in 2015 (from 2014). Ukraine saw a 30.9% decline in exports in\n2015, mainly because of a sharp decline in production output in Donetsk Oblast\nand in Luhansk Oblast (the two regions of the Donbas). These two regions were\nresponsible for 40.6% of the total export-decline rate. Before the war they\nhad been two of the more industrial oblasts of Ukraine.\n\nAccording to the Ministry of Economic Development and Trade, Ukraine had a\nsurplus in its balance of payments in January–November 2015 of $566 million\nand has had a trade deficit of $11.046 billion during the same period in 2014.\nOn 31 December 2015, Ukraine's public debt stood at 79% of its GDP. It had\nshrunk $4.324 billion in 2015 to end up at $65.488 billion. But calculated in\nhryvnia, the debt had grown by 42.78%. In 2015, the Ministry of Social Policy\nof Ukraine rated 20–25% of Ukrainian households as poor.\n\n$2.526 billion entered the Ukrainian economy via remittances in 2015, 34.9%\nless than in 2014. $431 million was sent from Ukraine to elsewhere using\nremittances. In January 2016, Bloomberg rated Ukraine's economy as the 41st\nmost innovative in the world, down from 33rd in January 2015.\n\nIn May 2016, the IMF mission chief for Ukraine, Ron van Rood, stated that\nreduction of corruption was a key test for continued international support. In\nFebruary 2016, historian Andrew Wilson assessed progress in reducing\ncorruption as poor as of 2016. Aivaras Abromavičius, Ukraine's then-Minister\nof Economy and Trade, resigned in February 2016, citing ingrained corruption.\nIn October of the same year, a survey of potential foreign investors conducted\nby Dragon Capital identified corruption and lack of trust in the judiciary as\nthe largest obstacles to investment.\n\nLate in July 2016, the State Statistics Service of Ukraine reported that,\ncompared with June 2015, real wages had increased by 17.3%. Simultaneously the\nNational Bank of Ukraine reported a $406 million surplus in Ukraine's\nJanuary–June 2016 balance of payments against a deficit of $1.3 billion in the\nsame period in 2015. According to Ukraine's State Statistics Service,\ninflation in 2016 came down to 13.9%; while it had stood at 43.3% in 2015 and\nat 24.9% in 2014.\n\n_The Economist_ has compared the severity of Ukraine's recession to that of\nthe Greek recession in 2011–2012 – pointing to Ukraine experiencing an 8–9%\ndecline in GDP from 2014 to 2015 and Greece experiencing an 8.1% decline of\nGDP in 2011–2012, and noted that not all areas of Ukraine were equally\neffected by the economic downturn. Donetsk and Luhansk (the conflict zone) saw\nindustrial production falling by 32% and 42% respectively. On the other hand,\nLviv, located over 1000 km from the conflict, posted the largest jump in\nemployment in the nation.\n\nThe economy of Ukraine has overcome[_when?_] the severe crisis caused by armed\nconflict in the eastern part of country. A 200% devaluation of the hryvnia in\n2014–2015 made Ukrainian goods and services cheaper and more competitive. In\n2016, for the first time since 2010, the economy grew by more than 2%. A 2017\nWorld Bank statement projected growth of 2% in 2017, of 3.5% in 2018, and of\n4% in 2019 and 2020. Inflation in Ukraine in 2017 was 13.7% (12.4% in 2016).\n\nSince about 2015, there has been a growing number of Ukrainians working in the\nEuropean Union, particularly Poland. Eurostat reported that 662,000 Ukrainians\nreceived EU residence permits in 2017, with 585,439 issued by Poland. The head\nof the National Security and Defence Council of Ukraine has estimated that up\nto 9 million Ukrainians work abroad for some part of the year, and 3.2 million\nhave regular full-time work abroad with most not planning to return. World\nBank statistics show that money remittances back to Ukraine have roughly\ndoubled from 2015 to 2018, worth about 4% of GDP.\n\nIn Q1 2019, China became Ukraine's largest trading partner, replacing Russia.\nIn Q3 of 2019, real GDP grew by 4.2%. The main driving factors include:\nincreased purchasing power of the population in conditions of increase of the\nlevel of wages (during nine months of 2019 real wages increased by 9.5%); high\nlevel of business activity and preservation of investment activity, which\nstimulated mainly the development of construction, in particular, of\nindustrial and transport infrastructure facilities; active consumer lending;\nmaintaining the high dynamics of agricultural development; favourable price\nsituation on selected world commodity markets for domestic exports and others.\nUkraine made its largest payment on debt in 2019 at $1.1 billion.\n\nIn 2019, Fitch Ratings, a global leader in credit ratings and research,\nupgraded Ukraine's Long-Term foreign and National Currency Issuer Default\nRatings (IDR) from \"B−\" to \"B\" and improved the outlook on the credit rating\nfrom stable to positive. Ukraine has demonstrated timely access to fiscal and\nexternal financing, improving macroeconomic stability, and declining public\nindebtedness.\n\nUkraine moved up seven positions in the annual World Bank Doing Business 2020\nreport. Prudent macroeconomic management helped reduce inflation and interest\nrates in 2019. Inflation eased to 4.1% at the end of 2019 and 2.4% in February\n2020.[_citation needed_]\n\nIn 2020, Ukraine's GDP fell by 4.4%, due to the COVID-19 pandemic. On 27\nOctober 2020, the Constitutional Court of Ukraine ruled that anti-corruption\nlegislation, including the mandatory electronic declaration of income, was\nunconstitutional. President Volodymyr Zelenskyy warned that if the Ukrainian\nparliament did not restore these anti-corruption laws, foreign aid, loans and\nvisa-free travel to the European Union were at risk. The governor of the\nNational Bank of Ukraine reported that Ukraine will not receive the scheduled\n$700 million IMF load before the end of 2020 because of the issue. IMF\nassessment teams had not visited Kyiv for eight months, which is necessary for\nfurther IMF loan tranches to be released. In February 2021, economist Anders\nÅslund wrote \"for months, senior Ukrainian officials have been claiming that\nthe Ukrainian government has done everything the [IMF] could possibly demand\"\nbut \"this happy talk was always detached from reality\", and the relationship\nwith the IMF remains critical.\n\nOn 21 July 2022, Ukraine devalued the Ukrainian hryvnia by 25% against the\nU.S. dollar due to the economic impact of ongoing Russian invasion of Ukraine,\nto eliminate currency speculation and to improve the international\ncompetitiveness of business. The previous day it requested a two-year payment\nfreeze on international bonds; in 2020 it had $130 billion of external debt.\nWhen the 2022 Russian invasion began, Ukraine's economy was predicted by the\nIMF to shrink by up to 35%.\n\nDespite improvements, as in Moldova corruption in Ukraine remains an obstacle\nto joining the EU; the country was rated 104th out of 180 in the Corruption\nPerceptions Index for 2023."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic data",
    "text": "Ukraine is subdivided into nine economic regions: Carpathian, Northwestern,\nPodillia, Capital, Central-Ukrainian, Northeastern, Black-Sea-Coastal, Trans-\nDnipro, and Donetsk. Those regions were redrawn from the three Soviet economic\nregions of the Ukrainian SSR: Donetsk-TransDnieper, Southwestern, and\nSouthern.",
    "openai_summarised_points": [
      "• Ukraine is divided into nine distinct economic regions, namely Carpathian, Northwestern, Podillia, Capital, Central-Ukrainian, Northeastern, Black-Sea-Coastal, Trans-Dnipro, and Donetsk.",
      "• These nine economic regions were established by redrawing the boundaries of the three former Soviet economic regions within the Ukrainian SSR, which were Donetsk-TransDnieper, Southwestern, and Southern."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:27.341330",
      "openai_model": "gpt-4.1-mini",
      "content_length": 312,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Main economic indicators",
    "text": "The following table shows the main economic indicators in 1992–2023. Inflation\nbelow 5% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in %) | Unemployment\n(in %) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1992  | 331.1  | 6,382.7  | 22.2  | 427.9  | n/a  | n/a  | n/a  | n/a\n1993  | 290.8  | 5,623.0  | 35.0  | 677.3  | -14.2%  | 4734.9%  | n/a  | n/a\n1994  | 229.0  | 4,463.7  | 38.0  | 741.0  | -22.9%  | 891.2%  | n/a  | n/a\n1995  | 205.3  | 4,034.9  | 38.3  | 752.3  | -12.2%  | 376.7%  | 14.8%  | n/a\n1996  | 188.1  | 3,732.6  | 46.1  | 914.3  | -10.0%  | 80.2%  | 10.0%  | n/a\n1997  | 185.6  | 3,714.5  | 51.9  | 1,037.9  | -3.0%  | 15.9%  | 9.8%  | 28.9%\n1998  | 184.2  | 3,716.9  | 43.3  | 874.3  | -1.9%  | 10.6%  | 11.3%  | 46.5%\n1999  | 186.4  | 3,794.6  | 32.7  | 665.0  | -0.2%  | 22.7%  | 11.9%  | 59.0%\n2000  | 201.8  | 4,147.7  | 32.3  | 664.4  | 5.9%  | 28.2%  | 11.5%  | 43.8%\n2001  | 224.5  | 4,654.7  | 37.9  | 784.9  | 8.8%  | 12.0%  | 10.8%  | 36.7%\n2002  | 240.1  | 5,021.3  | 42.3  | 885.3  | 5.3%  | 0.8%  | 9.6%  | 33.6%\n2003  | 268.1  | 5,651.9  | 50.1  | 1,055.9  | 9.5%  | 5.2%  | 9.1%  | 29.4%\n2004  | 307.8  | 6,535.5  | 64.8  | 1,374.8  | 11.8%  | 9.0%  | 8.6%  | 24.8%\n2005  | 327.3  | 7,001.6  | 86.0  | 1,839.5  | 3.1%  | 13.5%  | 7.2%  | 17.7%\n2006  | 363.1  | 7,813.6  | 107.8  | 2,319.3  | 7.6%  | 9.1%  | 6.8%  | 14.8%\n2007  | 403.5  | 8,734.2  | 143.3  | 3,101.4  | 8.2%  | 12.8%  | 6.4%  | 12.3%\n2008  | 420.2  | 9,142.8  | 181.3  | 3,944.7  | 2.2%  | 25.2%  | 6.4%  | 20.4%\n2009  | 359.1  | 7,842.9  | 117.1  | 2,557.3  | -15.1%  | 15.9%  | 8.8%  | 35.4%\n2010  | 378.3  | 8,296.0  | 136.0  | 2,982.8  | 4.1%  | 9.4%  | 8.1%  | 40.6%\n2011  | 407.2  | 8,959.2  | 163.2  | 3,589.6  | 5.5%  | 8.0%  | 7.9%  | 36.9%\n2012  | 426.0  | 9,388.8  | 175.7  | 3,872.5  | 0.2%  | 0.6%  | 7.5%  | 37.5%\n2013  | 486.4  | 10,749.4  | 179.6  | 3,968.9  | 0%  | -0.3%  | 7.2%  | 40.5%\n2014  | 462.0  | 10,804.3  | 130.6  | 3,053.6  | -6.6%  | 12.1%  | 9.3%  | 70.3%\n2015  | 435.5  | 10,224.9  | 90.5  | 2,124.3  | -9.8%  | 48.7%  | 9.1%  | 79.5%\n2016  | 475.7  | 11,215.9  | 93.3  | 2,200.0  | 2.4%  | 13.9%  | 9.5%  | 79.5%\n2017  | 504.2  | 11,942.8  | 112.1  | 2,655.7  | 2.4%  | 14.4%  | 9.7%  | 71.6%\n2018  | 534.2  | 12,725.0  | 130.9  | 3,118.3  | 3.5%  | 10.9%  | 9.0%  | 60.4%\n2019  | 561.2  | 13,447.4  | 154.0  | 3,690.1  | 3.2%  | 7.9%  | 8.5%  | 50.5%\n2020  | 547.3  | 13,213.6  | 156.6  | 3,780.1  | -3.7%  | 2.7%  | 9.2%  | 60.5%\n2021  | 591.5  | 14,427.9  | 199.8  | 4,874.3  | 3.4%  | 9.4%  | 9.8%  | 48.9%\n2022  | 449.0  | 12,886.2  | 160.5  | 4,606.8  | -29.1%  | 20.2%  | 24.5%  | 78.5%\n2023  | 474.8  | 14,304.9  | 173.4  | 5,224.6  | 2.0%  | 17.7%  | 19.4%  | 88.2%",
    "openai_summarised_points": [
      "• The main economic indicators of Ukraine from 1992 to 2023 include GDP in billion US$ PPP and nominal terms, GDP per capita in US$ PPP and nominal terms, real GDP growth rate, inflation rate, unemployment rate, and government debt as a percentage of GDP.",
      "• In 1992, Ukraine's GDP was 331.1 billion US$ PPP with a GDP per capita of 6,382.7 US$ PPP; nominal GDP was 22.2 billion US$ with a nominal GDP per capita of 427.9 US$, but data for GDP growth, inflation, unemployment, and government debt were not available.",
      "• The early 1990s saw severe economic contraction with real GDP growth rates of -14.2% in 1993 and -22.9% in 1994; inflation rates were extraordinarily high, reaching 4734.9% in 1993 and 891.2% in 1994.",
      "• Unemployment data begins in 1995 at 14.8%, with government debt data starting in 1997 at 28.9% of GDP.",
      "• From 1995 to 1999, Ukraine experienced continued economic decline with negative GDP growth rates ranging from -12.2% to -0.2%, while inflation rates decreased from 376.7% in 1995 to 22.7% in 1999.",
      "• Government debt rose sharply from 28.9% in 1997 to 59.0% in 1999, while unemployment remained around 10-12%.",
      "• The 2000s marked economic recovery with positive GDP growth rates: 5.9% in 2000, 8.8% in 2001, and peaking at 11.8% in 2004; inflation rates dropped significantly to below 10% after 2001, with some years below 5% (e.g., 0.8% in 2002).",
      "• Government debt decreased steadily during the 2000s, from 43.8% in 2000 to 12.3% in 2007, while unemployment rates gradually declined from 11.5% in 2000 to 6.4% in 2007.",
      "• Nominal GDP increased substantially in the 2000s, reaching 181.3 billion US$ in 2008, with GDP per capita nominal rising to 3,944.7 US$.",
      "• The global financial crisis impacted Ukraine in 2009, with a GDP contraction of -15.1%, inflation at 15.9%, unemployment rising to 8.8%, and government debt increasing to 35.4% of GDP.",
      "• Recovery resumed from 2010 to 2013 with moderate GDP growth rates between 0.2% and 5.5%, inflation rates mostly below 10%, and unemployment decreasing to 7.2% in 2013; government debt fluctuated around 30-40% of GDP.",
      "• In 2014, Ukraine's economy contracted by -6.6% amid political and military turmoil; inflation surged to 12.1%, unemployment increased to 9.3%, and government debt rose sharply to 70.3% of GDP.",
      "• The economic crisis deepened in 2015 with a GDP decline of -9.8%, hyperinflation at 48.7%, unemployment steady at 9.1%, and government debt peaking at 79.5% of GDP.",
      "• From 2016 to 2019, Ukraine experienced gradual economic stabilization and growth with GDP growth rates between 2.4% and 3.5%, inflation rates falling to single digits (e.g., 7.9% in 2019), unemployment decreasing to 8.5%, and government debt reducing to 50.5% of GDP by 2019.",
      "• The COVID-19 pandemic caused a GDP contraction of -3.7% in 2020, inflation dropped to 2.7%, unemployment rose slightly to 9.2%, and government debt increased to 60.5% of GDP.",
      "• In 2021, the economy grew by 3.4%, inflation rose to 9.4%, unemployment increased to 9.8%, and government debt decreased to 48.9% of GDP.",
      "• The 2022 Russian invasion led to a severe economic downturn with a GDP contraction of -29.1%, inflation spiking to 20.2%, unemployment surging to 24.5%, and government debt escalating to 78.5% of GDP.",
      "• In 2023, Ukraine's economy showed signs of recovery with 2.0% GDP growth, inflation at 17.7%, unemployment reduced to 19.4%, but government debt further increased to 88.2% of GDP.",
      "• Throughout the period, inflation rates below 5% are highlighted in green, indicating periods of relative price stability, notably in years such as 2002 (0.8%), 2012 (0.6%), and 2013 (-0.3%).",
      "• The data reflects Ukraine's transition from hyperinflation and economic collapse in the early 1990s to gradual recovery in the 2000s, followed by crises linked to political instability, global financial shocks, and military conflict, impacting key economic indicators including GDP, inflation, unemployment, and government debt."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:45.643970",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2859,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Trade",
    "text": "Until recently, Russia was Ukraine's largest trading partner with 25.7% of\nexports and 32.4% of imports in 2012. In 2012, 24.9% of exports and 30.9% of\nimports were to and from the EU. In 2013, 35.9% of Ukrainian exports went to\nCIS countries, including eight countries other than Ukraine. Simultaneously,\nexports to EU countries was 26.6% of all exports.\n\nIn 2015 the EU became Ukraine's largest trading partner, accounting for more\nthan a third of its trade. In 2015, Ukrainian exports to Russia had fallen to\n12.7%. In 2017, 14.5% of Ukraine's imports came from Russia. In 2017,\nUkrainian exports to Russia stood at 9%. In 2017, 40% of Ukraine's exports\nwent to the EU and 15% to CIS countries. Overall, Ukraine increased its\nexports by 20% in 2017. The growth of imports was faster than the rate of\nexport growth.\n\nIn 2015, food and other agricultural products (worth $13 billion), metallurgy\n($8.8 billion) and machinery ($4.1 billion) made up most of Ukraine's exports,\nwith trade partners in 217 countries. Exports from Ukraine in 2015 decreased\nby 29.3% to $38.135 billion. Imports were 31.1% down, to $37.502 billion. In\n2017 almost half of Ukraine's exports were provided by the agrarian complex\nand food industry, slightly more than 20% by metallurgy and nearly 10% by\nmachine building products.\n\nIn 2019, China replaced Russia as the largest single-nation trading partner\nwith Ukraine achieved $50.06 billion in export and $60.78 billion in import.\nUkraine was the leading agricultural goods provider in the Chinese market.\n\nNatural gas is Ukraine's biggest import and the main cause of the country's\nstructural trade deficit.\n\nExports of Ukrainian goods in 2024 reached US$41.73 billion.",
    "openai_summarised_points": [
      "• Until 2012, Russia was Ukraine's largest trading partner, accounting for 25.7% of Ukrainian exports and 32.4% of imports in that year.",
      "• In 2012, the European Union (EU) accounted for 24.9% of Ukraine's exports and 30.9% of its imports.",
      "• In 2013, 35.9% of Ukrainian exports were directed to Commonwealth of Independent States (CIS) countries, which include eight countries other than Ukraine itself.",
      "• Simultaneously in 2013, exports to EU countries constituted 26.6% of Ukraine’s total exports.",
      "• By 2015, the EU became Ukraine's largest trading partner, representing more than one-third of Ukraine's total trade volume.",
      "• In 2015, Ukrainian exports to Russia declined significantly to 12.7% of total exports.",
      "• In 2017, imports from Russia accounted for 14.5% of Ukraine’s total imports, while exports to Russia further decreased to 9%.",
      "• Also in 2017, 40% of Ukraine's exports were destined for the EU, and 15% for CIS countries.",
      "• Overall, Ukraine increased its exports by 20% in 2017, although the growth rate of imports outpaced that of exports.",
      "• In 2015, Ukraine’s main export sectors were food and other agricultural products valued at $13 billion, metallurgy at $8.8 billion, and machinery at $4.1 billion, with trade partners spanning 217 countries.",
      "• Total exports from Ukraine in 2015 decreased by 29.3% to $38.135 billion, while imports fell by 31.1% to $37.502 billion.",
      "• In 2017, nearly 50% of Ukraine’s exports were contributed by the agrarian complex and food industry, over 20% by metallurgy, and nearly 10% by machine-building products.",
      "• In 2019, China surpassed Russia as Ukraine’s largest single-nation trading partner, with Ukraine achieving $50.06 billion in exports and $60.78 billion in imports with China.",
      "• Ukraine was the leading provider of agricultural goods in the Chinese market as of 2019.",
      "• Natural gas remains Ukraine’s largest import commodity and is the principal factor contributing to the country’s structural trade deficit.",
      "• In 2024, exports of Ukrainian goods reached a total value of US$41.73 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:44.160545",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1700,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "List of major private owned companies, not considering banks and insurance",
    "text": "companies\n\nRank  | Company  | Home city  | Revenue (₴M), 2020  | Profit (₴M), 2020\n---|---|---|---|---\n1. | Metinvest | Mariupol | 309,302 | 12,960\n2. | ATB-Market | Dnipro | 123,864 | 5,769\n3. | Kernel | Kyiv | 118,667 | 5,553\n4. | DTEK | Kyiv | 116,046 | −13,895\n5. | Fozzy Group | Kyiv | 80,167 | n/d\n6. | ArcelorMittal Kryvyi Rih | Kryvyi Rih | 63,497 | 741\n7. | Tedis Ukraine | Odesa | 54,845 | 244\n8. | Mironivsky Hliboproduct | Kyiv | 51,516 | −3,547\n9. | Epicentr K | Kyiv | 50,382 | 3,171\n10. | Ferrexpo | Horishni Plavni | 45,828 | 17,118\n11. | Zaporizhstal | Zaporizhzhia | 45,631 | −3,678\n12. | BaDM | Lviv | 41,816 | 1,112\n13. | Optima-Pharm | Kyiv | 37,248 | 338\n14. | Ukrnafta | Kyiv | 35,535 | 4,269\n15. | Ukrtatnafta | Kremenchuk | 34,327 | 42\n\nSource:\n\nThe 2016 Ranking of the Top 500 companies of Central and Eastern Europe by\nDeloitte has come up with specific features of Ukraine's economy. More than\n50% of the biggest Ukrainian companies are therefore owned by local investors\nwhereas for the whole region this number accounts only to 15,4%. Deloitte\nexplains the difference with the low investment attractiveness for foreign\ninvestors. Furthermore, the biggest Ukrainian companies feature a considerable\nhigher average headcount (35’600 vs. 6’600 employees) and lower productivity\n(EUR 47’000 revenue per employee vs. EUR 207’000 for the whole region).",
    "openai_summarised_points": [
      "• In 2020, Metinvest, headquartered in Mariupol, was the largest private company in Ukraine by revenue, generating ₴309,302 million and a profit of ₴12,960 million.",
      "• ATB-Market, based in Dnipro, ranked second with a 2020 revenue of ₴123,864 million and a profit of ₴5,769 million.",
      "• Kernel, located in Kyiv, was the third-largest company with ₴118,667 million in revenue and ₴5,553 million in profit in 2020.",
      "• DTEK, also from Kyiv, had a revenue of ₴116,046 million in 2020 but reported a significant loss of ₴13,895 million.",
      "• Fozzy Group, headquartered in Kyiv, earned ₴80,167 million in revenue in 2020, with profit data not disclosed (n/d).",
      "• ArcelorMittal Kryvyi Rih, based in Kryvyi Rih, recorded ₴63,497 million in revenue and a profit of ₴741 million in 2020.",
      "• Tedis Ukraine, from Odesa, generated ₴54,845 million in revenue and a profit of ₴244 million in 2020.",
      "• Mironivsky Hliboproduct, headquartered in Kyiv, had ₴51,516 million in revenue but incurred a loss of ₴3,547 million in 2020.",
      "• Epicentr K, based in Kyiv, reported ₴50,382 million in revenue and a profit of ₴3,171 million in 2020.",
      "• Ferrexpo, located in Horishni Plavni, earned ₴45,828 million in revenue and had the highest profit among the listed companies at ₴17,118 million in 2020.",
      "• Zaporizhstal, from Zaporizhzhia, generated ₴45,631 million in revenue but suffered a loss of ₴3,678 million in 2020.",
      "• BaDM, based in Lviv, recorded ₴41,816 million in revenue and a profit of ₴1,112 million in 2020.",
      "• Optima-Pharm, headquartered in Kyiv, had ₴37,248 million in revenue and a profit of ₴338 million in 2020.",
      "• Ukrnafta, located in Kyiv, reported ₴35,535 million in revenue and a profit of ₴4,269 million in 2020.",
      "• Ukrtatnafta, based in Kremenchuk, earned ₴34,327 million in revenue and a modest profit of ₴42 million in 2020.",
      "• According to the 2016 Deloitte Ranking of the Top 500 companies in Central and Eastern Europe, over 50% of Ukraine’s largest companies are owned by local investors, significantly higher than the regional average of 15.4%.",
      "• Deloitte attributes this high local ownership in Ukraine to the country’s low investment attractiveness for foreign investors.",
      "• Ukrainian companies have a substantially higher average workforce size, with 35,600 employees per company compared to 6,600 employees on average in the Central and Eastern European region.",
      "• Productivity in Ukrainian companies is lower, with average revenue per employee at EUR 47,000, compared to EUR 207,000 per employee for companies across the entire Central and Eastern European region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:40.987171",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1376,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Natural resources",
    "text": "Ukraine is relatively rich in natural resources, particularly in mineral\ndeposits. Although oil and natural gas reserves in Ukraine are largely\nexhausted, it has other important energy sources, such as coal,\nhydroelectricity, and nuclear-fuel raw materials.",
    "openai_summarised_points": [
      "• Ukraine possesses considerable natural resource wealth, with a particular abundance of mineral deposits across its territory.",
      "• The country's oil and natural gas reserves have been largely depleted, indicating a significant reduction in these traditional energy sources.",
      "• Despite the exhaustion of oil and natural gas, Ukraine maintains other critical energy resources, including substantial coal reserves.",
      "• Hydroelectric power constitutes an important component of Ukraine's energy portfolio, contributing to the country's electricity generation.",
      "• Ukraine also has access to nuclear-fuel raw materials, supporting its nuclear energy sector and providing an alternative energy source."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:39.452510",
      "openai_model": "gpt-4.1-mini",
      "content_length": 257,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Ukrainian economy in graphics",
    "text": "* GDP (PPP) of Ukraine\n\n* Ukraine's GDP (PPP) per capita\n\n* Ukraine's population from 1950\n\n* 2022 GNI per capita:\n\nUkraine (3 000 $)\n\nHigher GNI per capita compared to Ukraine\n\nLower GNI per capita compared to Ukraine\n\n* Average monthly salary in November 2021 (ranks by region)",
    "openai_summarised_points": [
      "• Ukraine's Gross Domestic Product (GDP) measured by Purchasing Power Parity (PPP) is a key economic indicator illustrating the country's economic output adjusted for price level differences across countries.",
      "• Ukraine's GDP (PPP) per capita provides a measure of the average economic output per person, reflecting the relative standard of living and economic productivity within the country.",
      "• Historical population data of Ukraine from 1950 onwards demonstrates demographic trends and changes over time, which are crucial for understanding labor market dynamics and economic development.",
      "• In 2022, Ukraine's Gross National Income (GNI) per capita was recorded at 3,000 US dollars, serving as an important indicator of the average income of a country's citizens and overall economic well-being.",
      "• Comparative analysis of GNI per capita shows certain countries or regions with higher GNI per capita than Ukraine, indicating relatively greater average income levels and economic prosperity in those areas.",
      "• Conversely, some countries or regions have a lower GNI per capita compared to Ukraine, highlighting areas with comparatively lower average income and economic development.",
      "• The average monthly salary in Ukraine as of November 2021 is detailed by region, providing insight into regional economic disparities and labor market conditions across the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:42.504934",
      "openai_model": "gpt-4.1-mini",
      "content_length": 279,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Sectors",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2016)_\n---|---",
    "openai_summarised_points": [
      "• The \"Sectors\" section of the Economy of Ukraine article on Wikipedia is currently marked as needing an update to reflect recent events or newly available information, as of January 2016.",
      "• The section does not contain substantive content or data regarding the economic sectors of Ukraine at this time.",
      "• Readers and contributors are encouraged to update the section to provide accurate and current information on Ukraine's economic sectors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:43.340080",
      "openai_model": "gpt-4.1-mini",
      "content_length": 154,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Industries",
    "text": "A Zenit-2, produced by the former Yuzhmash, Ukrainian rocket manufacturer\n\nUkraine is home to companies operating in around 20 major industries, namely\npower generation, fuel, ferrous and non-ferrous metallurgy, chemical and\npetrochemical and gas, machine building and metal-working, forest, wood-\nworking and wood pulp and paper, construction materials, light, food, and\nothers. Industry accounted for 26% of GDP in 2012. Ukraine has a massive high-\ntech industrial base, including electronics, armaments, and space programme.",
    "openai_summarised_points": [
      "• Ukraine hosts companies operating in approximately 20 major industries, including power generation, fuel, ferrous and non-ferrous metallurgy, chemical and petrochemical sectors, gas, machine building and metal-working, forest, woodworking and wood pulp and paper, construction materials, light industry, food industry, and others.",
      "• In 2012, the industrial sector contributed 26% to Ukraine’s Gross Domestic Product (GDP).",
      "• Ukraine possesses a substantial high-technology industrial base encompassing electronics manufacturing, armaments production, and a space program.",
      "• The former Yuzhmash, a Ukrainian rocket manufacturer, produced the Zenit-2 rocket, exemplifying the country’s aerospace and defense industrial capabilities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:45.830212",
      "openai_model": "gpt-4.1-mini",
      "content_length": 527,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.1",
    "section_name": "Mining and production",
    "text": "Ukraine is one of the world's most important mineral producing countries, in\nterms of both the range and size of its reserves. There are nearly 8,000\nseparate deposits, harboring some 90 different minerals, of which about 20 are\neconomically significant. About half of all the known deposits are under\nexploitation. Coal reserves in Ukraine amount to 47.1 billion tons. The annual\ndomestic demand for coal as fuel is about 100 million tons, of which 85\npercent can be satisfied by domestic production.\n\nUkraine has oil and gas fields that meet 10 percent of its oil and 20 percent\nof its gas consumption, respectively. Ukraine contains natural gas reserves of\n39.6 billion cubic feet (1.12 billion cubic metres), but only about 20 percent\nof Ukraine's demand is met by domestic production. Deposits of iron ore\n(estimated at 28 billion tons), manganese ore (3 billion tons), chalk and\nlimestone (1.5 billion tons) are also large in Ukraine. The domestic\nindustrial sector suffers from constant energy shortages and energy supply\npayment debts totaling about $792 million at the end of 1995. Ukraine\nincreased oil and gas production in 2023 up to 18.7 bcm.\n\nIn 2019, Ukraine was the 7th largest world producer of iron ore, the world's\n8th largest producer of manganese, 6th largest producer of titanium, and 7th\nlargest producer worldwide of graphite. Ukraine was the world's 9th largest\nproducer of uranium in 2018. Before the 2022 escalation of the war with Russia\nUkraine supplied about 50% of the world's neon gas and 40% of its krypton,\nboth of which are needed for the production of semiconductors. It is estimated\nthat over 90% of U.S. semiconductor-grade neon supplies were imported from\nUkraine.",
    "openai_summarised_points": [
      "• Ukraine is recognized as one of the world's most important mineral-producing countries due to the extensive range and size of its mineral reserves.",
      "• The country has nearly 8,000 separate mineral deposits containing approximately 90 different minerals, of which about 20 are considered economically significant.",
      "• Approximately 50 percent of all known mineral deposits in Ukraine are currently under exploitation.",
      "• Ukraine's coal reserves total 47.1 billion tons, with an annual domestic demand for coal as fuel of about 100 million tons, 85 percent of which is met by domestic production.",
      "• Ukraine possesses oil and gas fields that satisfy 10 percent of its oil consumption and 20 percent of its natural gas consumption, respectively.",
      "• The country’s natural gas reserves are estimated at 39.6 billion cubic feet (1.12 billion cubic meters), but domestic production only meets about 20 percent of Ukraine's natural gas demand.",
      "• Significant mineral deposits in Ukraine include iron ore estimated at 28 billion tons, manganese ore at 3 billion tons, and chalk and limestone at 1.5 billion tons.",
      "• The domestic industrial sector in Ukraine faces ongoing energy shortages and accumulated energy supply payment debts amounting to approximately $792 million by the end of 1995.",
      "• In 2023, Ukraine increased its oil and gas production to 18.7 billion cubic meters (bcm).",
      "• In 2019, Ukraine ranked as the world’s 7th largest producer of iron ore, 8th largest producer of manganese, 6th largest producer of titanium, and 7th largest producer of graphite globally.",
      "• Ukraine was the world’s 9th largest producer of uranium in 2018.",
      "• Prior to the 2022 escalation of the war with Russia, Ukraine supplied about 50 percent of the world’s neon gas and 40 percent of its krypton, both critical for semiconductor production.",
      "• It is estimated that over 90 percent of U.S. semiconductor-grade neon gas supplies were imported from Ukraine."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:49.895054",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1703,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.1.1",
    "section_name": "Iron and steel",
    "text": "Ukraine is rich in mineral deposits, including iron ore (of which it once\nproduced 50 percent of the entire Soviet output), manganese ore (of which it\nproduced 40 percent of world output during the Soviet era), mercury, titanium,\nand nickel.\n\nUkraine has a major ferrous metal industry, producing cast iron, steel, and\npipes. Among its economy leading companies in that field are Metinvest,\nKryvorizhstal, AzovStal, Ilyich Steel & Iron Works, and others. As of 2012,\nUkraine is the world's tenth largest steel producer (according to the World\nSteel Association).",
    "openai_summarised_points": [
      "• Ukraine possesses abundant mineral deposits, notably including iron ore, manganese ore, mercury, titanium, and nickel, which form a critical foundation for its industrial sectors.",
      "• Historically, Ukraine produced 50 percent of the entire Soviet Union's iron ore output, underscoring its significant role in the Soviet mineral resource base.",
      "• During the Soviet era, Ukraine was responsible for producing 40 percent of the world’s manganese ore output, highlighting its global importance in this mineral.",
      "• The country has a substantial ferrous metal industry that manufactures cast iron, steel, and pipes, contributing significantly to its industrial economy.",
      "• Leading companies in Ukraine’s ferrous metal sector include Metinvest, Kryvorizhstal, AzovStal, and Ilyich Steel & Iron Works, among others, indicating a robust corporate presence in this field.",
      "• As of 2012, Ukraine ranked as the world’s tenth largest steel producer, according to data from the World Steel Association, reflecting its prominent position in the global steel industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:46.109243",
      "openai_model": "gpt-4.1-mini",
      "content_length": 562,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.2",
    "section_name": "Chemical industry",
    "text": "Another important branch was the country's chemical industry which included\nthe production of coke, mineral fertilizers, and sulfuric acid. Production of\ncoke dropped tremendously due to the Russo-Ukrainian War.",
    "openai_summarised_points": [
      "• The chemical industry was a significant sector within Ukraine's economy, encompassing the production of coke, mineral fertilizers, and sulfuric acid.",
      "• The production of coke experienced a substantial decline as a direct consequence of the Russo-Ukrainian War."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:45.594504",
      "openai_model": "gpt-4.1-mini",
      "content_length": 211,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.3",
    "section_name": "Defence industry",
    "text": "A BM Oplot, produced by KMDB\n\nUkraine's defence industry is organised around Ukroboronprom, a state owned\nconglomerate of over 130 companies. These companies include Soviet era giants\nsuch as Ivchenko-Progress aircraft design bureau that was opened in 1945, to\nnewer companies such as RPC Fort which came into existence in the 1990s.\nUkraine is among the top 10 arms exporters in the world.\n\nThe signing of recent large contracts may put Ukraine into 6th place among\nbiggest arms traders, after the United States, Russia, France, Germany, and\nIsrael. The output of Ukrainian defence plants grew 58% in 2009, with largest\ngrowth reported by aircraft builders (77%) and ship builders (71%).\n\nIn 2013, Ukraine's defence sector manufactured a total of ₴11.7 billion worth\nof goods, ₴10 billion of which were exported. In the first 9 months of 2014\nUkraine's defence sector produced a record ₴13 billion worth of goods. The\nincrease was largely due to government orders for the war in Donbas.",
    "openai_summarised_points": [
      "• Ukraine's defence industry is structured around Ukroboronprom, a state-owned conglomerate comprising over 130 companies.",
      "• Ukroboronprom includes historic Soviet-era enterprises such as the Ivchenko-Progress aircraft design bureau, established in 1945.",
      "• The conglomerate also encompasses newer companies like RPC Fort, which was founded in the 1990s.",
      "• Ukraine ranks among the top 10 arms exporters globally.",
      "• Recent large arms contracts have the potential to elevate Ukraine to 6th place among the world's largest arms traders, following the United States, Russia, France, Germany, and Israel.",
      "• In 2009, Ukrainian defence plant output increased by 58%, with aircraft manufacturing growing by 77% and shipbuilding by 71%.",
      "• In 2013, Ukraine's defence sector produced goods valued at ₴11.7 billion, of which ₴10 billion were exported.",
      "• During the first nine months of 2014, the defence sector achieved a record production value of ₴13 billion.",
      "• The significant production increase in 2014 was primarily driven by government orders related to the conflict in Donbas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:48.665708",
      "openai_model": "gpt-4.1-mini",
      "content_length": 987,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.4",
    "section_name": "Fuel and energy complex",
    "text": "Due to Ukraine's large population and its significant energy consumption, it\nis one of the largest energy markets on the European continent. Ukraine's\nlocation at the intersection of Europe, Russia, the Black Sea, and the Caspian\nSea provides its ample natural resources such as coal, oil, natural gas, as\nwell as significant potential for hydro and biomass energy.\n\nUkraine relies heavily on imports for natural gas and oil products. It is a\nkey transit site for European imports of Russian gas. Ukraine transits more\nnatural gas than any other country. Prior to the full-scale Russian invasion\nof Ukraine in 2022, economic crises, Russia's closure of its market, and the\nRusso-Ukrainian War in eastern Ukraine since 2014 had stymied some of the\ncountry's growth. Ukraine's energy policy has created incentives for\ninvestment in renewable energy sources, but these remain uncertain. Since\n2015, Ukrainian energy policy has favoured reducing natural gas subsidies\nalongside diversifying energy supply. Ukraine participates in the European\nUnion's EU4Energy Programme, an effort to promote evidence-based policy making\nin national energy sectors.",
    "openai_summarised_points": [
      "• Ukraine is one of the largest energy markets on the European continent due to its large population and significant energy consumption.",
      "• Geographically, Ukraine is situated at the intersection of Europe, Russia, the Black Sea, and the Caspian Sea, providing access to ample natural resources including coal, oil, natural gas, as well as significant potential for hydro and biomass energy.",
      "• Ukraine relies heavily on imports for natural gas and oil products, making it dependent on external energy supplies.",
      "• The country serves as a key transit site for European imports of Russian natural gas, transiting more natural gas than any other country in Europe.",
      "• Prior to the full-scale Russian invasion of Ukraine in 2022, Ukraine’s economic growth was hindered by economic crises, Russia’s closure of its market, and the ongoing Russo-Ukrainian War in eastern Ukraine since 2014.",
      "• Ukrainian energy policy has aimed to create incentives for investment in renewable energy sources, although the future of these investments remains uncertain.",
      "• Since 2015, Ukraine’s energy policy has focused on reducing subsidies for natural gas and diversifying its energy supply sources.",
      "• Ukraine participates in the European Union's EU4Energy Programme, which promotes evidence-based policymaking in national energy sectors to enhance energy security and efficiency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:48.672900",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1145,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.4.1",
    "section_name": "Fuel industry",
    "text": "Ukraine remains heavily reliant on oil product and gas imports. Russia ranks\nas Ukraine's principal supplier of oil, and Russian firms own and/or operate\nthe majority of Ukraine's refining capacity. Natural gas imports come from\nRussia – which delivers its own gas, as well as the gas from\nTurkmenistan.[_citation needed_]\n\nUkraine has been a key transit point for EU imports of Russian gas, and its\npipeline system has been a crucial player in European energy supply, despite\nrecent diversification of transit routes by Russian oil companies such as\nGazprom. Since the 2014 Russia–Ukraine gas disputes, the latter's dependence\non Russian gas supplies has dramatically affected its economics and foreign\npolicy.[_citation needed_]\n\nUkraine was independent in its electricity supply, and exported electricity to\nRussia and other countries of Eastern Europe. This was achieved through a wide\nuse of nuclear power and hydroelectricity. Its energy strategy intended a\ngradual decreasing of gas- and oil-based generation in favour of nuclear\npower, as well as energy saving measures including lower industrial gas\nconsumption. Reform of the still inefficient and opaque energy sector was a\nmajor objective of the International Monetary Fund (IMF) and World Bank\nprograms with Ukraine.[_citation needed_]\n\nUkraine was a partner country of the European Union's INOGATE energy\nprogramme, which had four key topics: enhancing energy security, convergence\nof member state energy markets on the basis of EU internal energy market\nprinciples, supporting sustainable energy development, and attracting\ninvestment for energy projects of common and regional interest. INOGATE was\ndiscontinued in 2016.",
    "openai_summarised_points": [
      "• Ukraine remains heavily reliant on imports of oil products and natural gas to meet its energy needs.",
      "• Russia is Ukraine's principal supplier of oil, with Russian firms owning and/or operating the majority of Ukraine's refining capacity.",
      "• Natural gas imports to Ukraine come primarily from Russia, which supplies both its own gas and gas sourced from Turkmenistan.",
      "• Ukraine serves as a key transit country for European Union imports of Russian gas, with its pipeline system playing a crucial role in European energy supply.",
      "• Despite the importance of Ukraine's transit routes, Russian oil companies such as Gazprom have recently diversified their transit routes, reducing reliance on Ukraine.",
      "• The 2014 Russia–Ukraine gas disputes significantly impacted Ukraine’s economy and foreign policy due to its heavy dependence on Russian gas supplies.",
      "• Ukraine was historically independent in its electricity supply and even exported electricity to Russia and other Eastern European countries.",
      "• This electricity independence was largely achieved through extensive use of nuclear power and hydroelectricity.",
      "• Ukraine’s energy strategy aimed to gradually reduce gas- and oil-based electricity generation in favor of nuclear power and implement energy-saving measures, including reducing industrial gas consumption.",
      "• Reforming Ukraine’s energy sector, which remained inefficient and opaque, was a major objective of International Monetary Fund (IMF) and World Bank programs with Ukraine.",
      "• Ukraine was a partner country in the European Union’s INOGATE energy programme, which focused on four key areas: enhancing energy security, aligning member state energy markets with EU internal energy market principles, supporting sustainable energy development, and attracting investment for energy projects of common and regional interest.",
      "• The INOGATE energy programme was discontinued in 2016."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:50.303522",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1686,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.5",
    "section_name": "Automotive industry",
    "text": "A LAZ-5208DL built by Lviv Bus Factory A modern Electron T5L64 tram\n\nUkraine automobile manufacturers produces diesel locomotives, tractors,\ntrucks, buses, trolleybuses, own-designed cars and trams. There are 12\nautomobile manufacturers in Ukraine, including ZAZ, LuAZ, Bogdan, KrAZ,\nEurocar, Electron, and LAZ.\n\nZAZ (Zaporizhzhia Automobile Building Plant) is the main automobile-\nmanufacturer of Ukraine, based in the south-eastern city of Zaporizhzhia.\nPassenger car manufacturing in Ukraine started in 1959. From 1960 to 1994, a\ntotal of 3,422,444 Zaporozhets vehicles were manufactured in Zaporizhzhia and\nengines with air-cooling in Melitopol. In 2011–2012, the Zaporizhzhia\nAutomobile Building Plant started serial full-scale production of two new\nmodels of vehicle, the ZAZ Forza (a re-badged Chinese Chery A13) and the ZAZ\nVida (a re-badged Daewoo Aveo).\n\nThe Bogdan Corporation is a leading Ukrainian automobile-manufacturing group,\nincluding several car- and bus-makers of Ukraine. Bogdan buses (re-badged\nIsuzu models) are used as the primary small buses in most Ukrainian cities.\n\nLAZ used to be one of the major bus manufacturers in Ukraine. It manufactured\ncity buses, coach buses, trolley buses, and special purpose buses. The company\nhas been defunct since 2014.\n\nThe Lviv-based company Electrontrans is an enterprise of a full-scale\nproduction, specialising in design and production of modern urban electric\ntransport – trams, trolleybuses, electric buses, units, and spare parts. In\n2013 Electrotrans starts producing low-floor trams, the first Ukrainian 100%\nlow-floor tramways.",
    "openai_summarised_points": [
      "• Ukraine’s automotive industry encompasses the production of diesel locomotives, tractors, trucks, buses, trolleybuses, domestically designed cars, and trams, supported by 12 automobile manufacturers including ZAZ, LuAZ, Bogdan, KrAZ, Eurocar, Electron, and LAZ.",
      "• ZAZ (Zaporizhzhia Automobile Building Plant), located in the south-eastern city of Zaporizhzhia, is the principal automobile manufacturer in Ukraine, with passenger car manufacturing commencing in 1959.",
      "• Between 1960 and 1994, a total of 3,422,444 Zaporozhets vehicles were produced in Zaporizhzhia, with air-cooled engines manufactured in Melitopol.",
      "• In 2011–2012, ZAZ resumed serial full-scale production of two new vehicle models: the ZAZ Forza, a re-badged Chinese Chery A13, and the ZAZ Vida, a re-badged Daewoo Aveo.",
      "• The Bogdan Corporation is a prominent Ukrainian automobile manufacturing group comprising multiple car and bus producers, with Bogdan buses—re-badged Isuzu models—serving as the primary small buses in most Ukrainian cities.",
      "• LAZ was formerly one of Ukraine’s major bus manufacturers, producing city buses, coach buses, trolleybuses, and special-purpose buses, but the company ceased operations and became defunct in 2014.",
      "• Electrontrans, based in Lviv, is a full-scale production enterprise specializing in the design and manufacture of modern urban electric transport, including trams, trolleybuses, electric buses, as well as units and spare parts.",
      "• In 2013, Electrontrans began producing low-floor trams, marking the introduction of the first Ukrainian 100% low-floor tramways."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:54.605586",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1598,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.6",
    "section_name": "Aircraft and aerospace industry",
    "text": "The Antonov An-225 _Mriya_ was the largest aircraft in the world prior to its\ndestruction in 2022.\n\nUkraine is one of nine countries with a full cycle of aerospace hardware\nengineering and production. Besides the design and production of passenger and\ntransportation aircraft, Ukraine has a network of aircraft repair enterprises,\nincluding companies involved in the recovery of military planes and\nhelicopters.[_citation needed_] In March 2007, the Cabinet of Ministers of\nUkraine created the state aircraft building concern Aviation of Ukraine\n(SACAU), which is governed by the Ministry of Industrial Policy. Production of\nAn-148 aircraft is now one of the most prospective projects for the Ukrainian\nplane manufacturing industry with 35 units manufactured since 2009 (together\nwith Russian production).\n\nThe aircraft were engineered by the Antonov Scientific and Production Complex\nDesign Office (Antonov ANTK). The largest single airplane in the world,\nAntonov An-225 Mriya was designed by Antonov ANTK and made in 1988. The gross\nproduction of light and ultra light planes in Ukraine does not exceed 200\nunits per annum. Production of hang-gliders and paragliders of all designs\nmakes nearly 1,000 units each year. Most of produced devices are exported. The\nmain buyers of Ukrainian-made ultra-light aircraft are the United States,\nAustralia, New Zealand, the United Kingdom, France, etc..\n\nSince 2014, aerospace industry revenues have fallen by 80%. In June 2016, the\nAntonov Corporation merged with the state-owned military conglomerate\nUkroboronprom, forming Ukrainian Aircraft Corporation within its structure.\nThis merger was done to boost Antonov profits and the production rate. In\n2018, Antonov was working on two cargo planes: the An-178, a cargo version of\nthe An-158, and the An-132D, a redesigned version of the An-32. The An-132 was\ndeveloped jointly with Saudi's Taqnia Aeronautics Company, featuring western\navionics and engines. The roll out and first flight was due at the beginning\nof January 2017.\n\nThe space rocket industry in Ukraine has been managed by the State Space\nAgency of Ukraine since 1992. The agency included 30 enterprises, scientific\nresearch institutes, and design offices. Pivdenne Design Bureau was in general\nresponsible for creating the Zenit-3SL carrier rocket. In 2013, The National\nSpace Agency of Ukraine was involved in cooperation with American Rockwell\nInt., as well as the Sea Launch project. Yuzhnoye SDO was the designer and\nmanufacturer of the initial first stage core of the U.S. Orbital ATK Antares\nrocket."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.1.7",
    "section_name": "Shipbuilding",
    "text": "MV Minerva − a passenger ship built in Ukraine\n\nUkraine is one of the 10 largest shipbuilding countries in Europe. There are\n49 shipbuilding companies registered in Ukraine. They are able to build a wide\nrange of vessel types: powerboats, barges, bulk carriers (dry cargo ship),\ntankers, liquefied gas carriers, etc.\n\nThe USSR's collapse put Ukraine's shipbuilding into a long-term decline. This\nlasted until 1999 and was mostly due to a minimum volume of state shipbuilding\norders. Between 1992 and 2003, Ukraine's 11 shipyards produced 237 navigation\nunits for a total value of US$1.5 billion. Production facilities are not\nworking near full capacity, and customers are not always timely in paying for\nservices. The shipbuilding industry grew between 2000 and 2006, in line with\nthe wider Ukrainian economic expansion at the time.\n\nState support and the opening of free economic zones, foremost at enterprises\nbased in Mykolaiv were a crucial recent development in Ukraine's shipbuilding\nindustry. Within the Mykolaiv Special Economic Zone, enterprises like Damen\nShipyards Okean, Chornomorskyi (Black Sea) Shipbuilding Plant (defunct since\n2021), 61 Communards Shipbuilding Plant, as well as the Veselka (Rainbow)\npaint and insulation enterprise are implementing investment projects targeted\nto raise efficiency and quality in primarily export-oriented vessels through\nproduction upgrades. The new engineering developments and high potential of\nUkrainian designers provide the ability to build high quality vessels with\ncompetitive prices."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture",
    "text": "A Ukrainian T-150K tractor built by the Kharkiv Tractor Plant Ukraine's flag\nresembles the nation's farmlands. Vineyards in Zakarpattia Oblast\n\nAlthough typically known as the industrial base of the Soviet Union,\nagriculture is a large part of Ukraine's economy. Ukraine is one of the\nworld's largest agricultural producers and exporters and is known as the\n\"breadbasket\" of Europe.\n\nIn 2008, agriculture accounted for 8.29% of Ukraine's GDP and by 2012 had\ngrown to 10.43% of the GDP. Agriculture accounted for $13.98 billion of value\nadded to the economy of Ukraine in 2012. Despite being a top 10 world producer\nof several crops such as wheat and corn Ukraine still only ranks 24 out of 112\nnations measured in terms of overall agricultural production.\n\nIn 2011, Ukraine was the world's largest producer of sunflower oil, a major\nglobal producer of grain and sugar, and a potential global player on meat and\ndairy markets. It was one of the largest producers of nuts. Ukraine produced\nmore natural honey than any other European country and was one of the world's\nlargest honey producers. An estimated 1.5% of its population was involved in\nhoney production, therefore Ukraine had the highest honey per capita\nproduction rate in the world. Because Ukraine possesses 30% of the world's\nrichest black soil, making its agricultural industry have huge potential.\n\nAt the beginning of the 21st century, Ukraine's agricultural industry was\nhighly profitable, generating profit margins of 40–60%. Analysts indicated\nthat the sector had the potential to increase its output by up to four times.\nUkraine was the world's 6th largest, 5th if not including the EU as a separate\nstate, producer of corn in the world and the 3rd largest corn exporter in the\nworld. In 2012, Ukraine signed a contract with China, the world's largest\nimporter of corn, to supply China with 3 million tonnes of corn annually at\nmarket price. The deal included a $3 billion line of credit extension from\nChina to Ukraine.\n\nIn 2014, Ukraine's total grain crop was estimated to be a record 64 million\nmetric tons. In 2014, Ukraine lost control over portions of several regions to\nRussia, followed by the start of the war in Donbas and the annexation of\nCrimea by the Russian Federation, hence the actual available crop yield was\ncloser to 60.5 million metric tons. Due to the decline of the metallurgy\nindustry, which was previously Ukraine's top export category, agricultural\nproducts have become Ukraine's largest export category as a result of the war\nin Donbas.\n\nSince at least 2011, farmland was remaining as the only major asset in Ukraine\nthat was not privatised. In March 2020, the Ukrainian parliament lifted a ban\non the sale of farmland. The land market was fully opened for the first time\nindependence on 1 July 2021.\n\nAgricultural output of Ukraine since 1961, in 2015 US$\n\nUkraine also produces some wine, mostly in the South-Western regions.\n\nIn 2018:\n\n* It was the 5th largest world producer of maize (35.8 million metric tons (35,200,000 long tons; 39,500,000 short tons)), after the U.S., China, Brazil, and Argentina;\n* It was the 8th largest world producer of wheat (24.6 million metric tons (24,200,000 long tons; 27,100,000 short tons));\n* It was the 3rd largest world producer of potatoes (22.5 million metric tons (22,100,000 long tons; 24,800,000 short tons)), second only to China and India;\n* It was the world's largest producer of sunflower seed (14.1 million metric tons (13,900,000 long tons; 15,500,000 short tons));\n* It was the 7th largest world producer of sugar beets (13.9 million metric tons (13,700,000 long tons; 15,300,000 short tons)), which is used to produce sugar and ethanol;\n* It was the 7th largest world producer of barley (7.3 million metric tons (7,200,000 long tons; 8,000,000 short tons));\n* It was the 7th largest world producer of rapeseed (2.7 million metric tons (2,700,000 long tons; 3,000,000 short tons));\n* It was the 13th largest world producer of tomatoes (2.3 million metric tons (2,300,000 long tons; 2,500,000 short tons));\n* It was the 5th largest world producer of cabbage (1.6 million metric tons (1,600,000 long tons; 1,800,000 short tons)), after China, India, South Korea, and Russia;\n* It was the 11th largest world producer of apples (1.4 million metric tons (1,400,000 long tons; 1,500,000 short tons));\n* It was the 3rd largest world producer of pumpkins (1.3 million metric tons (1,300,000 long tons; 1,400,000 short tons)), second only to China and India;\n* It was the 6th largest world producer of cucumbers (985 thousand metric tons (969,000 long tons; 1,086,000 short tons));\n* It was the 5th largest world producer of carrots (841 thousand metric tons (828,000 long tons; 927,000 short tons)), after China, Uzbekistan, the U.S., and Russia;\n* It was the 4th largest world producer of dry peas (775 thousand metric tons (763,000 long tons; 854,000 short tons)), second only to Canada, Russia, and China;\n* It was the 7th largest world producer of rye (393 thousand metric tons (387,000 long tons; 433,000 short tons));\n* It was the 3rd largest world producer of buckwheat (137 thousand metric tons (135,000 long tons; 151,000 short tons)), second only to China and Russia;\n* It was the 6th largest world producer of walnuts (127 thousand metric tons (125,000 long tons; 140,000 short tons));\n* It produced 4.4 million metric tons (4,300,000 long tons; 4,900,000 short tons) of soy;\n* It produced 883 thousand metric tons (869,000 long tons; 973,000 short tons) of onions;\n* It produced 467 thousand metric tons (460,000 long tons; 515,000 short tons) of grapes;\n* It produced 418 thousand metric tons (411,000 long tons; 461,000 short tons) of oats;\n* It produced 396 thousand metric tons (390,000 long tons; 437,000 short tons) of watermelons;\n* It produced 300 thousand metric tons (300,000 long tons; 330,000 short tons) of cherries;\n\nin addition to smaller productions of other agricultural products.\n\nProfessionalised, scientific breeding of barley began in 1910 and now supplies\nimproved cultivars to the country."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Information technology",
    "text": "Ukrainian National IT Factory in Kyiv\n\nUkraine has a long-standing reputation as a major technology region, with a\nwell-developed scientific and educational base. In March 2013, Ukraine ranked\n4th in the world in number of certified IT professionals after the United\nStates, India, and Russia. On top of that, experts recognised both the\nquantitative and qualitative potential of Ukrainian specialists. In 2011, the\nnumber of IT specialists working in the industry reached 25,000 people with\n20% growth. The volume of the Ukrainian IT market in 2013 was estimated to be\nup to 3.6 billion U.S. dollars.\n\nIn 2017, Ukraine emerged as the top outsourcing destination of the year,\naccording to the Global Sourcing Association. By 2017, there were 13 research\nand development centres of global companies located in Ukraine, including\nEricsson Ukraine, in Lviv.\n\nAs for 2019, the number of IT specialists involved in the IT industry of\nUkraine reached 172,000 people. The share of IT industry in Ukraine's GDP is\n4%.\n\nAccording to the IT sector report of 2019, Ukraine is the largest exporter of\nIT services in Europe, and ranks among the 25 most attractive countries for\nsoftware development worldwide.",
    "openai_summarised_points": [
      "• Ukraine has a long-standing reputation as a major technology region, supported by a well-developed scientific and educational base.",
      "• In March 2013, Ukraine ranked 4th globally in the number of certified IT professionals, following the United States, India, and Russia.",
      "• Experts recognized both the quantitative and qualitative potential of Ukrainian IT specialists.",
      "• In 2011, the number of IT specialists working in Ukraine's industry reached 25,000, reflecting a 20% growth rate.",
      "• The volume of the Ukrainian IT market in 2013 was estimated to be up to 3.6 billion U.S. dollars.",
      "• In 2017, Ukraine was named the top outsourcing destination of the year by the Global Sourcing Association.",
      "• By 2017, there were 13 research and development centres of global companies located in Ukraine, including Ericsson Ukraine in Lviv.",
      "• As of 2019, the number of IT specialists involved in Ukraine's IT industry reached 172,000 people.",
      "• The IT industry accounted for 4% of Ukraine's GDP in 2019.",
      "• According to the 2019 IT sector report, Ukraine is the largest exporter of IT services in Europe.",
      "• Ukraine ranks among the 25 most attractive countries worldwide for software development as of 2019."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:26:53.989979",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1196,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.3.1",
    "section_name": "Maritime",
    "text": "An EKr-1 multiple unit built by Kriukiv Railway Car Building Works. Rail\ntransport is heavily used in Ukraine\n\nAbout 100,000 Ukrainians regularly work on foreign merchant ships, one of the\nlargest group of Ukrainian labour migrants and the sixth largest number of\nsailors from any country. They are attracted by the high salaries of more than\n$1,000 per month.\n\nEvery major Ukrainian coastal city has a maritime university."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.3.2",
    "section_name": "Communications",
    "text": "Ukraine ranks eighth among the world's nations in terms of the Internet speed\nwith the average download speed of 1,190 kbit/s. Five national providers of\nfixed (DSL, ADSL, XDSL) internet access — Ukrtelecom, Vega Telecom, Datagroup,\nUkrnet, Volia, and 3 national operators of mobile internet – Vodafone Ukraine,\nKyivstar, lifecell are currently operating in Ukraine. Every regional centre\nand large district centre has a number of local providers and home networks.\n\n2011 revenues from Internet service providing in Ukraine reached ₴4.75\nbillion.\n\nOver 16 million Ukrainians had Internet access in 2012, growing to 22 million\nin 2015. In Kyiv, 90% of the population had internet access.\n\nThe mobile-cellular telephone system's expansion has slowed, largely due to\nsaturation of the market which has reached 144 mobile phone subscriptions per\n100 people."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Tourism",
    "text": "Rynok square, Lviv\n\nIn 2012, Ukraine was the 8th most popular tourism destination in Europe with\n23 million visitors. The country's tourism industry is generally considered to\nbe underdeveloped, but it does provide crucial support for Ukraine's economy.\nIn 2012, the contribution of tourism to the GDP amounted to ₴28.8 billion, or\n2.2% of GDP and directly supported 351,500 jobs (1.7% of total employment)."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.4.1",
    "section_name": "Shopping tourism",
    "text": "Ukraine's neighbours (Belarusians, Hungarians, Poles, Russians, and Slovaks)\nare known to come to Ukraine to purchase products (such as food or gasoline)\nand presents that are cheaper in Ukraine than in their home countries."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.4.2",
    "section_name": "Recreational tourism and sightseeing",
    "text": "Ukraine has impressive landscapes, ruins of ancient castles, historical parks,\nvineyards where they produce native wines, unique structures such as Saint\nSophia Cathedral or Chersonesos. Officially, there are seven World Heritage\nSites in Ukraine. The Carpathian Mountains suitable for skiing, hiking,\nfishing and hunting. Bukovel — is the largest ski resort in Ukraine situated\nin the Ivano-Frankivsk Oblast (province) of western Ukraine. The 2010–2011\nwinter season recorded 1,200,000-day visits with foreigners amounting to 8–10%\nof all visitors. In 2012, the Bukovel was named the fastest growing ski resort\nworldwide. The coastline on the Black Sea is a popular summer destination for\nvacationers, especially Odesa."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Financing, banking, investments",
    "text": "National Bank of Ukraine"
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5.1",
    "section_name": "Investments",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( December 2013)_\n---|---\n\nA political crisis in the middle of 2006 was feared as a threat to economic\nand investment stability, however, despite the forecasts, the political\nsituation has not scared investors. The GDP showed a good growth rate of 7% in\n2007, compared to the previous year. Industrial output has increased. Car\nsales have soared, while the banking sector has expanded, thanks to the\narrival of European banks."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5.2",
    "section_name": "International financial institutions",
    "text": "In 1992, Ukraine became a member of the IMF and the World Bank. It is also a\nmember of the European Bank for Reconstruction and Development.\n\nIn 2008, the country joined the World Trade Organization (WTO). Ukraine\napplied for WTO membership in 1993, but its accession process was stalled for\n15 years."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5.3",
    "section_name": "Foreign direct investment",
    "text": "To encourage foreign trade and investment, the Ukrainian parliament approved a\nforeign investment law allowing foreigners to purchase businesses and\nproperty, to repatriate revenue and profits, and to receive compensation if\nthe property is nationalised by a future government. Complex laws and\nregulations, poor corporate governance, weak enforcement of contract law by\ncourts, and corruption, continued to prevent direct large-scale foreign\ninvestment in Ukraine. There is a functioning stock market, but portfolio\ninvestment activities have been restricted by a historic lack of protection of\nshareholders' rights.[_citation needed_]\n\nAs of April 2011, total foreign direct investment stock in Ukraine stood at\n$44.7 billion. Statistics from FDi Magazine show that Ukraine suffered a year\non year decline in foreign direct investment between 2010 and 2013.\n\nState enterprise InvestUkraine was created under the State Agency for\nInvestment and National Projects (_National Projects_) to serve as a one-stop\nstop for investors and to deliver investment consulting services.\n\nUkraine signed a shale gas exploration deal with Royal Dutch Shell on 25\nJanuary 2013. The $10 billion deal was the largest foreign direct investment\never for Ukraine.\n\nMany companies, owned by foreigners, have been successfully operating in\nUkraine since its independence. These include companies in agriculture, such\nas Kyiv-Atlantic Group, founded in 1994 by David Sweere. He sold its business\nin Minnesota and invested in Ukraine, believing in its huge potential. The\ncompany has been operating at a profit since 2002. As a result, he became the\nfifth richest among the Westerners who made their fortune in Ukraine.\n\nIn 2016, foreign direct investment in Ukraine's economy amounted to $3.8\nbillion in 2016, which was almost twice more than in 2015."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5.4",
    "section_name": "Monetary policy and banking",
    "text": "| **This section is empty.** You can help by adding to it. _( January 2016)_\n---|---"
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.5.5",
    "section_name": "Insurance business and companies",
    "text": "| **This section is empty.** You can help by adding to it. _( January 2016)_\n---|---"
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Background",
    "text": "Since the late 1990s, the Ukrainian government has pledged to reduce the\nnumber of government agencies, streamline the regulatory process, create a\nlegal environment to encourage entrepreneurs, and enact a comprehensive tax\noverhaul. In 2003, the IMF encouraged Ukraine to quicken the pace and scope of\nreforms, threatening to withdraw financial support.\n\nOn 24 June 2010, Ukraine's Foreign Minister Kostyantyn Hryshchenko signed a\nfree trade agreement with the European Free Trade Association (EFTA).\nAccording to the Global Competitiveness Report of 2012–2013, \"the country's\nmost important challenge is the needed overhaul of its institutional\nframework, which cannot be relied on because it suffers from red tape, lack of\ntransparency, and favouritism.\" In reports by the _Kyiv Post_ in 2010 and 2011\nrespectively, a \"double taxation avoidance\" treaty with Cyprus signed in 1982\nby the Soviet Union has cost Ukraine billions of U.S. dollars of tax revenues.\n\nThe 2014 campaign of lustration in Ukraine was criticised by Mark Varga,\nwriting in _The National Interest_ as it might have adverse economic effects.\nOn 29 May 2014, Ukraine entered into the European Union–Ukraine Association\nAgreement, that reached its full application on 1 September 2017."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Foreign workers",
    "text": "A number of foreign guest workers come to work in Ukraine, mainly in seasonal\nfarm work and construction industry, especially from neighbouring Moldova and\nBelarus."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "War Economy",
    "text": "Following the onset of the Russian-Ukrainian War in 2022, Ukraine's GDP\ndeclined by nearly 30%. Despite economic growth in 2023 and 2024, the economy\nremains smaller than it was before the war. In 2023, GDP increased by 5.3%,\nand in 2024 by 3.6%. The International Monetary Fund forecasts that Ukraine's\nGDP growth will slow to between 2% and 3% in 2025, citing challenges such as\nlabor shortages, damage to energy infrastructure, and the ongoing war."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Environmental issues",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2016)_\n---|---\n\nUkraine is interested in cooperating on regional environmental issues.\nConservation of natural resources is a stated high priority, although\nimplementation suffers from a lack of financial resources. Ukraine established\nits first nature preserve, Askania-Nova, in 1921 and has programs to breed\nendangered species.\n\nUkraine has a Ministry of Environment and has introduced a pollution fee\nsystem that levies taxes on air and water emissions and solid waste disposal.\nThe resulting revenues are channelled to environmental protection activities,\nbut enforcement of this pollution fee system is lax. Industrial pollution\nremains a considerable problem in Ukraine.\n\nSignificant environmental problems result from the Chernobyl nuclear power\nplant disaster in 1986. In accordance with its previously announced plans,\nUkraine permanently closed the Chernobyl Atomic Energy Station in December\n2000. In November 2001, Ukraine withdrew an application it had made to the\nEBRD for funding to complete two new reactor units to compensate for the\nenergy once produced by Chernobyl. Ukrainian concern over reform conditions\nattached to the loan – particularly tariff increases needed to ensure loan\nrepayment—led the Ukrainian government to withdraw the application on the day\nthe EBRD Board was to have considered final approval.\n\nThe Russo-Ukrainian War significantly impacts the environmental situation.\nThirty-six thousand tons of waste, including toxic chemicals such as copper\nand zinc, have entered water bodies, posing dangers to human organs and the\nnervous system. Three million hectares of forests need to be demined, and\nforest fires caused by shelling occur in 30% of the country's forest area. The\nwar has released approximately 67,532,788 tons of hazardous emissions, causing\nrespiratory and cardiovascular issues."
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Ukrainian companies",
    "text": "In 2022, the sector with the highest number of companies registered in Ukraine\nis Services with 512,393 companies followed by Wholesale Trade and\nManufacturing with 288,072 and 93,637 companies respectively.\n\n* 1+1 Media Group – media\n* 4AGames – Technology\n* Antonov – Industrials\n* APEKS-BANK – Financials\n* ATB-Market – Consumer Services\n* BG Capital – Financials\n* Bogdan group – Industrials\n* Chumak – Consumer goods\n* Ciklum – IT\n* DTEK – Oil & Gaz, Basic Materials, Utilities\n* EKTA – Technology\n* Electron – Industrials\n* Epicentre K – Consumer services\n* ESTA Holding – Financials\n* FED – Aerospace industry\n* Ferreexpo – Basic Materials\n* FOM-Ukraine – Industrials\n* Fozzy Group – Consumer services\n* Galnaftogaz – Oil & Gas\n* GSC Game World – Technology\n* Hromadske.ua – Media\n* Industrial Union of Donbas – Industrials\n* InvestUkraine – Industrials\n* Kryukiv Railway Car Building Works – Industrials\n* Kyivstar – Telecommunications\n* Kuznia na Rybalskomu – Shipbuilding, arms industry\n* Lifecell – Telecommunications\n* METRO Cash&Carry – Consumer services\n* MHP – Consumer goods\n* Motor Sich – Industrials\n* Nemiroff – Consumer goods\n* Naftogaz – Oil & Gas\n* Nibulon – Agriculture & Shipbuilding\n* Obolon – Consumer goods\n* Oschadbank – banking\n* PrivatBank – banking\n* Roshen – Consumer goods\n* SCM Holdings – Financials\n* SoftServe – IT\n* Ukraine International Airlines – Consumer services\n* Ukrainian Automobile Corporation – Consumer goods\n* Ukrainian Railways – Consumer services, Industrials\n* Ukrnafta – Oil & Gas\n* Ukroboronprom\n* Ukrtelecom – Telecommunications\n* Vodafone Ukraine – Telecommunications\n* WOG – Oil & Gas, Consumer services\n* Pivdenmash – Industrials\n* Zaporizhstal – Basic materials\n* ZAZ – Consumer goods"
  },
  {
    "chapter_name": "Economy of Ukraine",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Facts and figures",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2016)_\n---|---\n\n**Household income or consumption by percentage share:**\n\n* _lowest 10%:_ 3.4% (2006)\n* _highest 10%:_ 25.7% (2006)\n\n**Poverty rate:** 4% in 2018 (below US$5.5/day).\n\n**Industrial production growth rate:** 6% (2007 est.), 6.5 (2008)\n\n**Electricity:**\n\n* _production:_ 192.1 billion kWh (2006)\n* _consumption:_ 181.9 billion kWh (2006)\n* _export:_ 10.07 billion kWh (2005)\n* _import:_ 20 billion kWh (2006)\n\n**Electricity – production by source:**\n\n* _fossil fuel:_ 48.6%\n* _hydro:_ 7.9%\n* _nuclear:_ 43.5%\n* _other:_ 0% (2001)\n\n**Oil:**\n\n* _production:_ 90,400 barrels per day (14,370 m3/d) (2006)\n* _consumption:_ 284,600 barrels per day (45,250 m3/d) (2006)\n* _exports:_ 214,600 barrels per day (34,120 m3/d) (2004)\n* _imports:_ 469,600 barrels per day (74,660 m3/d) (2004)\n* _proved reserves:_ 395,000,000 barrels (62,800,000 m3) (1 January 2006 est.)\n\n**Natural gas:**\n\n* _production:_ 20.85 billion cubic m (2006 est.)\n* _consumption:_ 73.94 billion cubic m (2006 est.)\n* _exports:_ 4 billion cubic m (2006 est.)\n* _imports:_ 57.09 billion cubic m (2006 est.)\n* _proved reserves:_ 1.075 trillion cubic m (1 January 2006 est.)\n\n**Agriculture – exports:** grain, sugar beets, sunflower seeds, vegetables,\nbeef, milk, natural honey.\n\n**Agriculture – imports:** seafood, pork, beef, grain.\n\n**Exchange rates:** hryvnia per US$1 – 22 (2015), 7.97 (2009), 5.05 (2007),\n5.05 (2006), 5.13 (2005), 5.33 (May 2004), 5.30 (October 2002), 5.59 (February\n2000), 5.3811 (January 2000), 4.1304 (1999), 2.4495 (1998), 1.8617 (1997),\n1.8295 (1996), 1.4731 (1995)\n\n**Minimum wage:** ₴6,000/ ~$210 per month (from 2021 to 2001–01)\n\n**Average salary by region**"
  }
]