[
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Kazakhstan** is the largest in Central Asia in both absolute\nand per capita terms. As of 2023, Kazakhstan attracted more than US$370\nbillion of foreign investments since becoming an independent republic after\nthe dissolution of the former Soviet Union.\n\nIt possesses oil reserves as well as minerals and metals. Almost every known\nelement on the periodic table can be found in Kazakhstan. It also has\nconsiderable agricultural potential, with its vast steppe lands accommodating\nboth livestock and grain production. The mountains in the south are important\nfor apples and walnuts; both species grow wild there. Kazakhstan's industrial\nsector rests on the extraction and processing of these natural resources.\n\nThe dissolution of the Soviet Union and the collapse of demand for\nKazakhstan's traditional heavy industry products have resulted in a sharp\ndecline of the economy since 1991, with the steepest annual decline occurring\nin 1994. In 1995–97 the pace of the government program of economic reform and\nprivatization quickened, resulting in a substantial shifting of assets into\nthe private sector. Kazakhstan was granted \"market economy country\" status by\nthe European Union and the United States, in 2000 and 2002 respectively.\n\nThe December 1996 signing of the Caspian Pipeline Consortium agreement to\nbuild a new pipeline from western Kazakhstan's Tengiz Field through Russia to\nthe Black Sea increased prospects for substantially larger oil exports until\nPutin took issue with the lukewarm support he experienced in the wake of the\n2022 Russian invasion of Ukraine from Kazakh President Kassym-Jomart Tokayev.\nKazakhstan's economy turned downward in 1998 with a 2.5% decline in GDP growth\ndue to slumping oil prices and the August financial crisis in Russia. A bright\nspot in 1999 was the recovery of international petroleum prices, which,\ncombined with a well-timed tenge devaluation and a bumper grain harvest,\npulled the economy out of recession.\n\nGDP per capita shrank by 26% in the 1990s. In the 2000s, Kazakhstan's economy\ngrew sharply, aided by increased prices on world markets for Kazakhstan's\nleading exports: oil, metals and grain. GDP grew 9.6% in 2000, up from 1.7% in\n1999. In 2006, extremely high GDP growth had been sustained, and grew by\n10.6%. Business with the booming economies of Russia and China, as well as\nneighboring Commonwealth of Independent States (CIS) nations have helped to\npropel this growth. The increased economic growth also led to a turn-around in\ngovernment finances, with the budget moving from a cash deficit of 3.7% of GDP\nin 1999 to 0.1% surplus in 2000. The country experienced a slowdown in\neconomic growth from 2014, sparked by falling oil prices and the effects of\nthe Russo-Ukrainian War. The country's currency was devalued by 19% in 2014\nand by 22% in 2015.\n\nIn 2023, the International Institute for Management Development compiled its\nWorld Competitiveness Ranking, ranking Kazakhstan 37th out of 64 countries.\nThe ranking analyzes and ranks countries according to how they manage their\ncompetencies to achieve long-term value creation.\n\nCyril Muller, the World Bank Vice President for Europe and Central Asia,\nvisited Astana in January 2017. He praised the country's progress, made during\nthe 25-year partnership with the World Bank. Muller also talked about\nKazakhstan's improved positioning in the World Bank's Doing Business Report\n2017, where Kazakhstan ranked 35th out of 190 countries worldwide. After 2000,\nthe government conducted several public sector reforms and adopted the New\nPublic Management (NPM) approach, which was aimed at reducing costs and\nincreasing the efficiency of the public service delivery.\n\nKazakhstan secured the 3rd position in the Central and South Asia regional\nranking of the 2018 Global Innovation Index (GII) released by World\nIntellectual Property Organization.\n\nThe main producer of cotton pulp in Kazakhstan is Khlopkoprom. Judging by a\nnumber of transactions, its products have been supplied to gunpowder\nmanufacturers in the Russian Federation since 2022. Most of the factories that\nimported pulp from Kazakhstan for the manufacture of explosives are under US\nand Ukrainian sanctions. According to OCCRP, Vlast, and iStories, a\nsignificant increase in Kazakhstan's exports of cotton pulp and derivatives to\nthe Russian Federation after February 24, 2022, was identified. Exported\ncomponents are key in the manufacture of explosives and gunpowder. There are\ncontracts for the supply of raw materials to the Kazan Gunpowder Plant from\nKazakhstan until 2026, and to the Aleksinsky Chemical Plant (which also\nproduces gunpowder) until 2024.",
    "openai_summarised_points": [
      "• The economy of Kazakhstan is the largest in Central Asia both in absolute terms and per capita, reflecting its significant regional economic influence.",
      "• As of 2023, Kazakhstan has attracted over US$370 billion in foreign investments since gaining independence following the dissolution of the Soviet Union in 1991.",
      "• The country possesses substantial natural resources, including oil reserves, minerals, and metals, with nearly every known element on the periodic table found within its territory.",
      "• Kazakhstan has considerable agricultural potential, with its extensive steppe lands supporting livestock farming and grain production; the southern mountains are notable for wild apple and walnut growth.",
      "• The industrial sector is primarily based on the extraction and processing of natural resources, including oil, minerals, and metals.",
      "• The collapse of the Soviet Union and the subsequent decline in demand for Kazakhstan’s traditional heavy industry products led to a sharp economic downturn starting in 1991, with the most severe decline occurring in 1994.",
      "• Between 1995 and 1997, the government accelerated economic reforms and privatization efforts, resulting in a significant transfer of assets to the private sector.",
      "• Kazakhstan was granted \"market economy country\" status by the European Union in 2000 and by the United States in 2002.",
      "• The signing of the Caspian Pipeline Consortium agreement in December 1996 aimed to build a pipeline from western Kazakhstan’s Tengiz Field through Russia to the Black Sea, enhancing prospects for increased oil exports until geopolitical issues arose.",
      "• Russian President Vladimir Putin expressed concerns over Kazakhstan’s lukewarm support following the 2022 Russian invasion of Ukraine, affecting oil export prospects.",
      "• Kazakhstan’s economy declined in 1998 with a 2.5% decrease in GDP, influenced by falling oil prices and the August 1998 Russian financial crisis.",
      "• In 1999, the economy recovered due to rising international petroleum prices, a strategic tenge devaluation, and a bumper grain harvest, pulling it out of recession.",
      "• During the 1990s, GDP per capita decreased by 26%.",
      "• The 2000s saw rapid economic growth driven by higher global prices for oil, metals, and grain, with GDP increasing by 9.6% in 2000 (up from 1.7% in 1999) and reaching 10.6% growth in 2006.",
      "• Growth was supported by trade with Russia, China, and other CIS nations, contributing to a positive shift in government finances from a 3.7% GDP cash deficit in 1999 to a 0.1% surplus in 2000.",
      "• The economy experienced a slowdown starting in 2014 due to declining oil prices and the impacts of the Russo-Ukrainian War, with the national currency devalued by 19% in 2014 and 22% in 2015.",
      "• In 2023, Kazakhstan was ranked 37th out of 64 countries in the International Institute for Management Development’s World Competitiveness Ranking, which assesses countries’ ability to achieve long-term value creation.",
      "• Cyril Muller, Vice President of the World Bank for Europe and Central Asia, visited Astana in January 2017, praising Kazakhstan’s 25-year partnership with the World Bank and noting improvements in the country’s ranking in the 2017 Doing Business Report, where Kazakhstan ranked 35th out of 190 countries.",
      "• Post-2000, Kazakhstan implemented several public sector reforms based on the New Public Management approach, aiming to reduce costs and enhance efficiency in public service delivery.",
      "• Kazakhstan ranked 3rd in the Central and South Asia region in the 2018 Global Innovation Index (GII) published by the World Intellectual Property Organization.",
      "• The main producer of cotton pulp in Kazakhstan is Khlopkoprom, which has supplied products to gunpowder manufacturers in Russia since 2022.",
      "• Many factories importing Kazakh pulp for explosive manufacturing are under US and Ukrainian sanctions, yet exports of cotton pulp and derivatives to Russia increased significantly after February 24, 2022.",
      "• Exported components from Kazakhstan are key in the manufacture of explosives and gunpowder, with contracts in place for the supply of raw materials to the Kazan Gunpowder Plant until 2026 and the Aleksinsky Chemical Plant until 2024."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:30.135991",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4654,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "GDP per capita development, since 1973\n\nIn the 2014 Economic Freedom Index published by The Heritage Foundation in\nWashington, D.C., Kazakhstan has gained 22 points over the past 17 years,\nwhich is noted by the authors as among the 20 best improvements recorded by\nany country. Kazakhstan's economic freedom score is 69.1, equalling\n\"moderately free\". Its overall score has increased by 0.1 point, with\nsignificant improvements in investment freedom and government integrity\noffsetting steep declines in fiscal health and monetary freedom. Kazakhstan is\nranked 11th among 43 countries in the Asia–Pacific region, and its overall\nscore is above the regional and world averages.\n\nAccording to the World Bank’s latest Kazakhstan economic update – Economic\nRecovery During Challenging Times (spring, 2023), the economy is set to\nexperience a moderate growth acceleration, with real GDP forecast to rise by\n3.5 percent in 2023 and 4 percent in 2024 supported largely by the\nhydrocarbons sector as oil production increases. In the 2023 Economic Freedom\nIndex published by The Heritage Foundation in Washington, D.C., Kazakhstan\nranks 71st out of 176 countries, falling in the group of \"moderately free\"\ncountries. Kazakhstan's economic freedom score is 62.1. Kazakhstan ranks 13th\nout of 39 countries in the Asia–Pacific region, and its overall score is above\nthe world and regional averages.\n\nThis chart shows trends in the gross domestic product of Kazakhstan at market\nprices estimated by the International Monetary Fund, with figures in millions\nof tenge.\n\nYear | Gross domestic product (millions ₸) | US$ exchange rate | Inflationindex\n(2000=100) | Per capita income\n(as % of USA)\n---|---|---|---|---\n1995 | 78,014,200 | T 61.11 | 64 | 3.81\n2000 | 102,599,902 | T 142.26 | 100 | 3.53\n2005 | 147,453,000 | T 132.88 | 140 | 9.01\n2017  | 159,406,930  | ₸344.18  |  |\n\nThe following table shows the main economic indicators in 1980–2023. Inflation\nunder 5% is in green.\n\nYear  | GDP\n(in bn. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP (in bn. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---\n1992  | 120.2  | 7,052  | 2.9  | n/a  | n/a  | n/a  | n/a\n1993  | 111.8  | 6,613  | 5.2  | −9.2%  | 1,662.3%  | n/a  | n/a\n1994  | 99.8  | 6,315  | 11.9  | −12.6%  | 1,402.0%  | 10.1%  | n/a\n1995  | 93.5  | 5,966  | 16.6  | −8.2%  | 176.3%  | 11.0%  | n/a\n1996  | 95.7  | 6,183  | 21.0  | 0.5%  | 39.1%  | 13.0%  | n/a\n1997  | 99.0  | 6,519  | 22.2  | 1.7%  | 17.4%  | 13.0%  | n/a\n1998  | 98.2  | 6,568  | 22.1  | −1.9%  | 7.3%  | 13.1%  | n/a\n1999  | 102.3  | 6,865  | 16.9  | 2.7%  | 8.4%  | 13.5%  | n/a\n2000  | 114.9  | 7,727  | 18.3  | 9.8%  | 13.3%  | 12.8%  | n/a\n2001  | 133.3  | 8,977  | 22.2  | 13.5%  | 8.4%  | 10.4%  | n/a\n2002  | 148.7  | 9,999  | 24.6  | 9.8%  | 5.9%  | 9.3%  | 17.6%\n2003  | 165.7  | 11,082  | 30.8  | 9.3%  | 6.5%  | 8.8%  | 15.0%\n2004  | 186.5  | 12,370  | 43.2  | 9.6%  | 6.9%  | 8.4%  | 11.4%\n2005  | 211.0  | 13,862  | 57.1  | 9.7%  | 7.5%  | 8.1%  | 8.1%\n2006  | 240.8  | 15,637  | 81.0  | 10.7%  | 8.6%  | 7.8%  | 6.7%\n2007  | 269.3  | 17,293  | 104.9  | 8.9%  | 10.8%  | 7.3%  | 5.9%\n2008  | 283.5  | 17,737  | 133.4  | 3.3%  | 17.1%  | 6.6%  | 6.8%\n2009  | 288.7  | 17,819  | 115.3  | 1.2%  | 7.3%  | 6.6%  | 10.2%\n2010  | 313.5  | 19,071  | 148.0  | 7.3%  | 7.1%  | 5.8%  | 10.7%\n2011  | 344.0  | 20,634  | 192.6  | 7.5%  | 8.3%  | 5.4%  | 10.1%\n2012  | 369.9  | 21,878  | 208.0  | 5.0%  | 5.1%  | 5.3%  | 12.1%\n2013  | 417.5  | 24,326  | 236.6  | 5.9%  | 5.8%  | 5.2%  | 12.6%\n2014  | 427.5  | 24,545  | 221.4  | 4.3%  | 6.7%  | 5.0%  | 14.5%\n2015  | 407.4  | 23,057  | 184.4  | 1.0%  | 6.7%  | 5.0%  | 21.9%\n2016  | 423.8  | 23,654  | 137.3  | 0.9%  | 14.6%  | 4.9%  | 19.6%\n2017  | 448.5  | 24,699  | 166.8  | 3.9%  | 7.4%  | 4.9%  | 19.9%\n2018  | 478.1  | 25,989  | 179.3  | 4.1%  | 6.0%  | 4.8%  | 20.2%\n2019  | 508.6  | 27,295  | 181.7  | 4.5%  | 5.2%  | 4.8%  | 19.9%\n2020  | 501.8  | 26,582  | 171.1  | −2.6%  | 6.8%  | 4.9%  | 26.4%\n2021  | 545.8  | 27,987  | 197.1  | 4.1%  | 8.0%  | 4.9%  | 25.1%\n2022  | 603.3  | 30,523  | 225.5  | 3.3%  | 15.0%  | 4.9%  | 23.5%\n2023  | 654.1  | 32,712  | 259.3  | 4.6%  | 15.0%  | 4.8%  | 23.4%",
    "openai_summarised_points": [
      "• Since 1973, Kazakhstan's GDP per capita has experienced significant fluctuations, reflecting broader economic transitions and growth patterns over the decades.",
      "• In 1995, Kazakhstan's GDP was approximately 78,014,200 million tenge, with an exchange rate of T 61.11 per US dollar, inflation index at 64, and per capita income at 3.81% of the USA.",
      "• By 2000, GDP increased to approximately 102,599,902 million tenge, with the exchange rate rising to T 142.26, inflation index reaching 100, and per capita income slightly decreasing to 3.53% of the USA.",
      "• In 2005, GDP further grew to 147,453,000 million tenge, with an exchange rate of T 132.88, inflation index at 140, and per capita income increasing to 9.01% of the USA.",
      "• In 2017, the GDP was approximately 159,406,930 million tenge, with an exchange rate of ₸344.18; specific inflation and per capita income figures are not provided for this year.",
      "• According to IMF estimates, Kazakhstan's gross domestic product at market prices was 417.5 billion US dollars in 2013, with a GDP per capita of 24,326 US dollars, and a GDP growth rate of 5.9%.",
      "• In 2014, GDP slightly increased to 427.5 billion US dollars, with a GDP per capita of 24,545 US dollars, and a growth rate of 4.3%; inflation was 6.7%, and unemployment was 5.0%.",
      "• The economic indicators from 1980 to 2023 show a steady increase in GDP in both nominal and PPP terms, with notable fluctuations in growth rates and inflation.",
      "• In 1992, Kazakhstan's GDP was 120.2 billion US dollars (PPP), with a GDP per capita of 7,052 US dollars, and a growth rate of 2.9%.",
      "• The year 1993 saw a decline to 111.8 billion US dollars (PPP), with a GDP per capita of 6,613 US dollars, and a significant decrease in GDP growth of −9.2%, alongside inflation at 5.2%.",
      "• In 1994, GDP further declined to 99.8 billion US dollars (PPP), with a GDP per capita of 6,315 US dollars, and a decrease in growth of −12.6%, inflation at 11.9%, and unemployment at 10.1%.",
      "• From 1995 onward, Kazakhstan's GDP gradually recovered, reaching 93.5 billion US dollars (PPP) with a GDP per capita of 5,966 US dollars, and a decline in growth to −8.2%, inflation at −8.2%, and unemployment at 11.0%.",
      "• Between 2000 and 2007, Kazakhstan experienced consistent economic growth, with GDP in PPP terms rising from 114.9 billion US dollars to 269.3 billion US dollars, and GDP per capita increasing from 7,727 to 17,293 US dollars.",
      "• The global financial crisis of 2008 caused a slowdown, with GDP in PPP terms reaching 283.5 billion US dollars and growth slowing to 3.3%, while inflation decreased to 17.1%.",
      "• Post-2009, Kazakhstan's economy recovered, with GDP in PPP terms increasing to 344.0 billion US dollars in 2011, and further to 448.5 billion US dollars in 2017, with GDP per capita rising correspondingly.",
      "• In 2020, amid the COVID-19 pandemic, GDP in PPP terms was approximately 501.8 billion US dollars, with a growth rate of −2.6%, and inflation at 6.8%.",
      "• The year 2021 saw GDP in PPP terms increase to 545.8 billion US dollars, with a growth rate of 4.1%, inflation at 8.0%, and unemployment at 4.9%.",
      "• In 2022, GDP in PPP terms reached 603.3 billion US dollars, with a growth rate of 3.3%, inflation at 15.0%, and unemployment remaining at 4.9%.",
      "• As of 2023, Kazakhstan's GDP in PPP terms is approximately 654.1 billion US dollars, with a growth rate of 4.6%, inflation at 15.0%, and unemployment at 4.8%.",
      "• Overall, Kazakhstan's macroeconomic trend demonstrates a trajectory of growth with periods of volatility, influenced by global economic conditions, commodity prices, and internal reforms."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:38.327421",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4278,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic growth and GDP",
    "text": "According to the World Bank, Kazakhstan's economy grew by 5.1% in H1 2023,\ndriven by exports and fiscal stimulus. GDP is projected to grow by 4.5% in\n2023 and subsequent years, aided by new oil production coming on-stream.\n\nKazakhstan's economy recorded an average real GDP growth rate of 3.0% in the\ndecade to 2022, above the 2.5% average for Eastern Europe. In 2022, real GDP\ngrowth was 3.3%. The official estimate for Kazakhstan's GDP was $512 billion\nat the end of 2022 in purchasing power parity terms.\n\nThe country devalued its currency by 19% in February 2014. The country\nexperienced a slowdown in economic growth from 2014 sparked by falling oil\nprices and the effects of the 2014 Russo-Ukrainian War.\n\nThe Government of Kazakhstan signed a Framework Partnership Agreement with\nIBRD, IFC, MIGA on 1 May 2014; according to this Agreement the World Bank will\nallocate US$2.5 trillion to Kazakhstan, for the diversification of the economy\nand reaching the sustainable development.\n\nThe World Bank report shows that Kazakhstan, as of 2015, reached the level of\nan upper-middle-income country with a GDP of US$170 billion.\n\nAnother 22% devaluation occurred in August 2015.\n\nForeign direct investment increased 30 percent in 2015 in Kazakhstan's\nagricultural industry and 80 percent in the country's petroleum products\nsector.\n\nIn 2016 Kazakhstan's economy started to recover from the crisis caused by low\noil prices and the tenge devaluation. According to the Minister of National\nEconomy of Kazakhstan, in nine months of 2016 the GDP growth reached 0.4%.\nSectors of economy that experienced the highest growth included construction\n(6.9%), agriculture (4.9%), and transport sector (4.0%).\n\nThe GDP per capita in current US$ in Kazakhstan declined by about 40% between\n2013 and 2017.\n\nKazakhstan was ranked 25th out of 190 countries in the World Bank's Doing\nBusiness 2020 report. The country improved its position by 3 points, from 28\nto 25, in the 2020 ranking compared to the previous year. This placed\nKazakhstan ahead of countries such as Iceland (26th place), Austria (27th\nplace), Russia (28th place), Japan (29th place), etc.\n\nKazakhstan has prioritized the development of non-oil sectors of economy,\nwhich accounted for 85% of the country's economic growth in 2019.\n\nThe biggest growth in 2020 occurred in the automotive industry (+53.6%),\npharmaceuticals (+39.7%), processed metal products (+19.5%), mechanical\nengineering (+16.5%), as well as in light industry (+16.4%). The industries in\nthe service sector that demonstrated growth included construction (+10.7%) and\ninformation and communications (+8.2%).\n\nThe World Bank reported that Kazakhstan's economy recorded a gross domestic\nproduct (GDP) growth of 3.2% in 2022. This was a part of the trend where the\neconomy was projected to grow by 3.9% in 2023, driven mainly by the\nhydrocarbons sector and increased oil production.",
    "openai_summarised_points": [
      "• According to the World Bank, Kazakhstan's economy grew by 5.1% in the first half (H1) of 2023, primarily driven by exports and fiscal stimulus measures.",
      "• The GDP of Kazakhstan is projected to grow by 4.5% in 2023 and subsequent years, supported by new oil production coming on-stream.",
      "• Over the decade leading up to 2022, Kazakhstan's economy experienced an average real GDP growth rate of 3.0%, which is higher than the 2.5% average for Eastern Europe.",
      "• In 2022, Kazakhstan's real GDP growth was 3.3%.",
      "• The official estimate of Kazakhstan's GDP at the end of 2022 was $512 billion in purchasing power parity (PPP) terms.",
      "• Kazakhstan devalued its currency by 19% in February 2014.",
      "• The country experienced an economic slowdown starting in 2014, triggered by falling oil prices and the impacts of the 2014 Russo-Ukrainian War.",
      "• On 1 May 2014, the Government of Kazakhstan signed a Framework Partnership Agreement with the International Bank for Reconstruction and Development (IBRD), International Finance Corporation (IFC), and Multilateral Investment Guarantee Agency (MIGA), under which the World Bank committed to allocate US$2.5 trillion to Kazakhstan for economic diversification and sustainable development.",
      "• As of 2015, Kazakhstan reached the status of an upper-middle-income country with a GDP of US$170 billion, according to the World Bank report.",
      "• A second devaluation of the Kazakhstani tenge occurred in August 2015, amounting to 22%.",
      "• In 2015, foreign direct investment (FDI) increased by 30% in Kazakhstan's agricultural sector and by 80% in the petroleum products sector.",
      "• Kazakhstan's economy began recovering in 2016 from the crisis caused by low oil prices and the devaluation of the tenge; during the first nine months of 2016, GDP growth reached 0.4%.",
      "• In 2016, the sectors with the highest growth included construction (+6.9%), agriculture (+4.9%), and transport (+4.0%).",
      "• Between 2013 and 2017, Kazakhstan's GDP per capita in current US dollars declined by approximately 40%.",
      "• In the 2020 World Bank Doing Business report, Kazakhstan ranked 25th out of 190 countries, improving three positions from 28th place the previous year, ahead of countries such as Iceland (26th), Austria (27th), Russia (28th), and Japan (29th).",
      "• Kazakhstan prioritized developing its non-oil sectors, which contributed to 85% of the country's economic growth in 2019.",
      "• In 2020, the sectors with the most significant growth included automotive (+53.6%), pharmaceuticals (+39.7%), processed metal products (+19.5%), mechanical engineering (+16.5%), and light industry (+16.4%).",
      "• Service sector growth in 2020 was notable in construction (+10.7%) and information and communications (+8.2%).",
      "• The World Bank reported Kazakhstan's GDP growth was 3.2% in 2022.",
      "• The economy was projected to grow by 3.9% in 2023, mainly driven by hydrocarbons and increased oil production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:44.368378",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2894,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.1",
    "section_name": "Energy",
    "text": "Kazakhstan is the leading country in the world for uranium production volumes\nwith 35% of global production, and it has the world's second biggest uranium\nreserves after Australia.",
    "openai_summarised_points": [
      "• Kazakhstan is the leading country in the world for uranium production volumes, accounting for 35% of global uranium production.",
      "• Kazakhstan possesses the world's second-largest uranium reserves, following Australia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:45.903046",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 180,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.2",
    "section_name": "Oil and gas",
    "text": "Oil and gas is the leading economic sector. In 2000, Kazakhstan produced\n35,252,000 metric tons of oil (700,000 barrels per day), a 17.4% increase over\n1999's 30,025,000 tons. It exported 28,883,000 tons of oil in 2000, up 38.8%\nfrom 20,813,000 tons in 1999. Production in 2001 has been growing at roughly\n20%, on target to meet the government's forecast of 40,100,000 tons of oil\n(800,000 barrels per day). In 2000, production reached 11.5 km3 of natural\ngas, up from 8.2 km3 in 1999.\n\nKazakhstan has the potential to be a world-class oil exporter in the medium\nterm. The landmark foreign investment in Kazakhstan is the TengizChevroil\njoint venture, owned 50% by ChevronTexaco, 25% by ExxonMobil, 20% by\nKazMunaiGas of Kazakhstan, and 5% by LukArco of Russia. The Karachaganak\nnatural gas and gas condensate field is being developed by BG, Agip,\nChevronTexaco, and Lukoil. The Agip-led Offshore Kazakhstan Consortium has\ndiscovered potentially huge Kashagan oil field in the northern Caspian.\nKazakhstan's economic future is linked to oil and gas development. GDP growth\nwill depend on the price of oil, as well as the ability to develop new\ndeposits.\n\nJanuary 2022 began with thousands of people returning to the streets of\nKazakhstan to protest against the surging gas prices, recording four straight\ndays of demonstrations, which is claimed to be the biggest protests to have\ntaken place in the oil-rich country in decades. Protesters invaded into\ngovernment buildings and took over police vehicles despite a strict emergency\nled by the state being in place.",
    "openai_summarised_points": [
      "• Oil and gas constitute the leading sector of Kazakhstan's economy, significantly influencing its economic development and growth.",
      "• In the year 2000, Kazakhstan produced 35,252,000 metric tons of oil, which is equivalent to approximately 700,000 barrels per day, representing a 17.4% increase compared to 1999's production of 30,025,000 tons.",
      "• Kazakhstan's oil exports in 2000 totaled 28,883,000 tons, marking a 38.8% increase from the 20,813,000 tons exported in 1999.",
      "• Oil production in 2001 has been growing at an approximate rate of 20%, aligning with the government's forecast to reach 40,100,000 tons of oil, or about 800,000 barrels per day.",
      "• In 2000, natural gas production reached 11.5 cubic kilometers (km³), up from 8.2 km³ in 1999, indicating significant growth in natural gas output.",
      "• Kazakhstan has substantial potential to become a world-class oil exporter in the medium term, driven by its rich reserves and foreign investment.",
      "• The landmark foreign investment project is the TengizChevroil joint venture, which is owned 50% by ChevronTexaco, 25% by ExxonMobil, 20% by KazMunaiGas of Kazakhstan, and 5% by LukArco of Russia.",
      "• The Karachaganak natural gas and gas condensate field is under development by a consortium including BG Group, Eni (through Agip), ChevronTexaco, and Lukoil.",
      "• The offshore Kashagan oil field, located in the northern Caspian Sea, was discovered by the Agip-led Offshore Kazakhstan Consortium and is considered potentially huge, with significant future development prospects.",
      "• Kazakhstan's economic future heavily depends on oil and gas development, with GDP growth being contingent on oil prices and the country's ability to develop new deposits.",
      "• In January 2022, Kazakhstan experienced widespread protests beginning with thousands of people returning to the streets to oppose surging gas prices, marking four consecutive days of demonstrations.",
      "• These protests in January 2022 are claimed to be the largest in decades in the oil-rich country, involving protesters invading government buildings and seizing police vehicles despite the enforcement of a strict state emergency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:52.456841",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1563,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.3",
    "section_name": "Mining",
    "text": "Kazakhstan is a leading producer of many mineral commodities, including salt,\nuranium, ferrochrome, titanium sponge, cadmium, potash, magnesium, rhenium,\ncopper, bauxite, gallium and zinc.\n\nThe country was the world's largest producer of uranium in 2022. In 2019, the\ncountry was the world's 10th largest producer of gold; 11th largest world\nproducer of copper; 3rd largest worldwide producer of chromium; 9th largest\nworld producer of bauxite; 9th largest world producer of zinc; 10th largest\nworldwide producer of antimony; 12th largest world producer of iron ore; 12th\nlargest world producer of lead; 14th largest world producer of manganese; 17th\nlargest world producer of phosphate; 6th largest world producer of bismuth,\nand the 7th largest world producer of sulfur.",
    "openai_summarised_points": [
      "• Kazakhstan is a leading global producer of numerous mineral commodities, including salt, uranium, ferrochrome, titanium sponge, cadmium, potash, magnesium, rhenium, copper, bauxite, gallium, and zinc.",
      "• In 2022, Kazakhstan was the world's largest producer of uranium.",
      "• In 2019, Kazakhstan ranked as the 10th largest producer of gold worldwide.",
      "• In 2019, Kazakhstan was the 11th largest producer of copper globally.",
      "• Kazakhstan was the 3rd largest producer of chromium worldwide in 2019.",
      "• In 2019, Kazakhstan was the 9th largest producer of bauxite.",
      "• Kazakhstan ranked as the 9th largest producer of zinc in 2019.",
      "• In 2019, Kazakhstan was the 10th largest producer of antimony globally.",
      "• Kazakhstan was the 12th largest producer of iron ore in 2019.",
      "• Kazakhstan ranked as the 12th largest producer of lead worldwide in 2019.",
      "• In 2019, Kazakhstan was the 14th largest producer of manganese.",
      "• Kazakhstan was the 17th largest producer of phosphate globally in 2019.",
      "• Kazakhstan ranked as the 6th largest producer of bismuth in 2019.",
      "• In 2019, Kazakhstan was the 7th largest producer of sulfur worldwide."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:55:55.510183",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 772,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.4",
    "section_name": "Motor cars",
    "text": "In June 2014 the CKD (Complete Knock-Down) assembly of Toyota Fortuner was\nlaunched in Kostanay, Kazakhstan. The expected annual output makes around\n3,000 cars.\n\nThe Kazakhstan's car industry was developing rapidly in 2014 producing US$2\nbillion worth of products annually. Unfortunately, the industry experienced a\ndecline despite high hopes, with sales dwindling to only 47,000 in 2016.\n\nIn 2020, the Kazakh economy observed the biggest growth in its automotive\nindustry, which saw a 53.6% growth, despite the COVID-19 pandemic.\n\nThe ongoing state support for the domestic auto industry, primarily through\nrecycling fees, is a contentious issue. For 20 years, the industry has largely\noperated as a mere assembly hub, importing spare parts from abroad and\nperforming basic assembly tasks, such as fitting wheels—hardly advancing\ntowards establishing a truly Kazakh brand in the automotive sector. This\nsituation has fostered public dissent, notably from groups like #Нетутильсбору\n[no recycling fee], who argue that such policies unfairly prioritize industry\nsupport over the needs of regular citizens. This has contributed to an\nincrease in the average age of vehicles across Kazakhstan, as newer,\naffordable options remain inaccessible for many. The group's primary demands\ninclude the abolition of these recycling fees and a redirection of support\ntowards more pressing public needs, challenging the continued governmental\nsupport that, they argue, effectively \"mummifies\" an unproductive industry.",
    "openai_summarised_points": [
      "• In June 2014, the CKD (Complete Knock-Down) assembly of the Toyota Fortuner was launched in Kostanay, Kazakhstan, with an expected annual production of approximately 3,000 cars.",
      "• Kazakhstan's car industry was experiencing rapid development in 2014, producing goods valued at around US$2 billion annually.",
      "• Despite initial optimism, the industry faced a decline, with vehicle sales decreasing to only 47,000 units in 2016.",
      "• In 2020, Kazakhstan's automotive sector experienced its most significant growth to date, with a 53.6% increase in industry output, despite the challenges posed by the COVID-19 pandemic.",
      "• The Kazakh government has provided ongoing state support to the domestic auto industry, primarily through recycling fees, which has become a contentious issue.",
      "• Over the past 20 years, the industry has largely functioned as a simple assembly hub, importing spare parts from abroad and performing basic assembly tasks such as fitting wheels, without progressing toward establishing a truly Kazakh automotive brand.",
      "• This limited development has led to public dissatisfaction, notably from groups like #Нетутильсбору (No Recycling Fee), who argue that government policies unfairly favor industry support over the needs of ordinary citizens.",
      "• The support policies have contributed to an increase in the average age of vehicles across Kazakhstan, as affordable, newer options remain inaccessible to many consumers.",
      "• The primary demands of the #Нетутильсбору group include the abolition of recycling fees and a redirection of government support toward addressing more urgent public needs.",
      "• Critics argue that continued government backing effectively \"mummifies\" an unproductive industry, hindering broader automotive sector development and consumer access."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:56:00.545341",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1503,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.5",
    "section_name": "Rail",
    "text": "GE Transportation acquired 50% stake in Lokomotiv Kurastyru Zauyty in a joint\nventure with Kazakhstan's national railway company Temir Zholy.",
    "openai_summarised_points": [
      "• GE Transportation acquired a 50% stake in Lokomotiv Kurastyru Zauyty, establishing a joint venture with Kazakhstan's national railway company, Temir Zholy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:56:01.979190",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 141,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.6",
    "section_name": "Technology",
    "text": "On 22 December 2014 the World Bank approved a US$88 million loan that would\nsupport Kazakhstan's efforts to facilitate commercially and socially viable\ninnovation in technology. The Fostering Productive Innovation Project aims to\nimprove the country in areas that are able to foster and support technological\ninnovation.",
    "openai_summarised_points": [
      "• On 22 December 2014, the World Bank approved a loan of US$88 million to support Kazakhstan's technological development initiatives.",
      "• The purpose of the loan was to facilitate commercially and socially viable innovation in technology within Kazakhstan.",
      "• The loan was allocated to the Fostering Productive Innovation Project, which aims to enhance the country's capacity for technological innovation.",
      "• The project focuses on improving sectors that can foster and support technological innovation, thereby contributing to Kazakhstan's overall economic development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:56:03.731467",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 320,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.7",
    "section_name": "Retail",
    "text": "According to A.T. Kearney's 2015 Global Retail Development Index, Kazakhstan\nranked 13 out of 30. In the 2016th Index, Kazakhstan ranked as the 4th best\ndeveloping country for retail investments, scoring 56.5 out of 100.\nKazakhstan's market attracted large international retailers, such as French\nretail chains Carrefour and Leroy Merlin, as well as food giants McDonald's\nand KFC.",
    "openai_summarised_points": [
      "• According to A.T. Kearney's 2015 Global Retail Development Index, Kazakhstan ranked 13th out of 30 countries.",
      "• In the 2016 edition of the Index, Kazakhstan was ranked as the 4th best developing country for retail investments.",
      "• Kazakhstan scored 56.5 out of 100 on the 2016 Index, indicating a favorable environment for retail development.",
      "• The country's retail market attracted significant international retailers, including French retail chains Carrefour and Leroy Merlin.",
      "• Major food service giants such as McDonald's and KFC also established a presence in Kazakhstan's retail sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:56:05.564481",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 381,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.8",
    "section_name": "Tourism",
    "text": "View of Mausoleum of Khoja Ahmed Yasawi Number of international tourism\narrivals in Kazakhstan\n\nKazakhstan is the ninth-largest country by area and the largest landlocked\ncountry in the world. Tourism is not a major component of the economy. As of\n2014, tourism has accounted for 0.3% of Kazakhstan GDP, but the government had\nplans to increase it to 3% by 2020.\n\nAccording to the World Economic Forum's Travel and Tourism Competitiveness\nReport 2017, travel and tourism industry GDP in Kazakhstan is $3.08 billion or\n1.6 percent of total GDP. The WEF ranks Kazakhstan 81st in its 2017 report,\nwhich is four positions higher compared to the previous period. Kazakhstan\nreceived 6.5 million tourists in 2016."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.9",
    "section_name": "Gambling",
    "text": "Gambling in Kazakhstan was developing already during the day of Czarist\nRussia, then lotteries were organized. In 1698, Czar Peter I signed a decree\nwhich allowed organized lotteries for the first time. In later years lotteries\nwere organized by the Ministry of Finance of the Union of Soviet Socialist\nRepublics, which included Kazakhstan.\n\nThe Ministry of Finance of the Republic of Kazakhstan started issuing licenses\nfor gambling activity in 1999.\n\nIn 2007 the government of Kazakhstan has introduced a new law which ordered\nbanning gambling on the territory of Kazakhstan besides 2 places which were to\nbecome the examples of Russia's special gambling zones. Casinos existing\noutside these areas had to be closed or moved to places where they could\noperate legally. The first legal casino opened after the introduction of new\nlaw was Casino Flamingo in Kapchagay, which was opened on 1 October 2008.\n\nIn 2018, the income of gambling companies in Kazakhstan amounted to ₸19.5\nbillion. This is 16.1% more than in 2017. Then this amount was at the level of\n₸16.8 billion."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.0.10",
    "section_name": "Housing market",
    "text": "As of 2016, the total housing area in Kazakhstan was 342.6 million square\nmetres (3,688 million square feet), an average of 21.4 m2 (230 sq ft) per\nperson. The housing area per person increased by 20% in the period from 2005\nto 2016, but remained below the UN's recommended standard of 30 square metres\n(320 square feet) per person."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Trade",
    "text": "Kazakh export destinations, 2013\n\nKazakhstan has 11 transcontinental routes, including rail and road routes, and\nmany oil and gas pipelines. The country's geographic position allows for the\ntransporting of goods from China to Europe three to four times faster than\nother routes.\n\nSherin Suzhikova, Counselor of Kazakhstan's Chamber of Commerce and Industry\nand Chao Yon-chuan, Secretary-General of the Taiwan External Trade Development\nCouncil (TAITRA), signed an agreement on 13 October 2006 in Taipei to improve\neconomic relations through \"exchanges of market information and visits by\ntrade professionals.\" TAITRA has an office in Almaty, Kazakhstan.\n\nIn 2006, North Dakota's then Lieutenant Governor Jack Dalrymple led an\n18-member delegation of the North Dakota Trade Office representing seven North\nDakota companies and Dickinson State University on a trip to Kazakhstan,\nUkraine and Russia. North Dakota exports mostly machinery to Kazakhstan, the\neighth largest destination for North Dakotan exports; machinery exports\nincreased from US$22,000 to US$25 million between 2000 and 2005.\n\nThe percentage of high-tech exports (as a share of manufactured exports) from\nKazakhstan has grown from just 4.46% in 1995 to 37.17% in 2014. One of the\nmain factors that triggered this growth was the Technology Commercialization\nProject developed and implemented by the World Bank Group and the Kazakh\nGovernment. Through this project, 65 Kazakh tech startups received funding and\ntraining helping them get their innovations into markets.\n\nChina is Kazakhstan's important trade partner. In late March 2015 the two\ncountries signed 33 deals worth US$23.6 billion. The deals cover different\nindustries, such as oil refining, cars, steel.\n\nKazakhstan's foreign trade turnover in 2018 comprised $93.5bn that is 19.7%\nmore compared to 2017. The volume of export in the reporting period made $67bn\n(+25.7%) and import was $32.5bn (+9.9%).\n\nThe Government of Kazakhstan has been supporting Kazakhstani exporters\noperating in foreign markets through their QazTrade incubator. Since September\n2019, the program selects businesses and assists them with navigating\nbureaucracy and connecting to foreign markets the government deems a priority,\nincluding Germany, Turkey, the United Arab Emirates, Iran, and China."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "New economic reforms",
    "text": "In his state-of-the-nation address on September 1, 2023, President Kassym-\nJomart Tokayev of Kazakhstan unveiled a comprehensive plan focused on economic\nreforms and the new economic course for the country. Among the key points were\nindustrialization, diversification, a move toward green energy, simplification\nof tax codes, and a focus on transparency and fairness in governance.\n\nParticular focus will be given to sectors like heavy engineering, uranium\nenrichment, and automotive components, he noted. Tokayev proposed that in\norder to support the manufacturing industry, foreign and domestic investors\nshould be exempted from paying taxes and other mandatory payments for the\nfirst three years.\n\nOn fiscal matters, the President called for a coordination of financial and\nmonetary policies, with the aim of achieving stable economic growth of 6-7\npercent. He also emphasized the need to attract foreign banks to boost\ncompetition and solve the problem of insufficient corporate lending.\n\nTokayev further accentuated the need to support small and medium enterprises\nand accelerate privatization. Changes in legislation will be initiated to\nencourage consolidation among small businesses, and efforts will be\nintensified to demonopolize key markets.\n\nIn his address, the President also focused on Kazakhstan’s commitment to\nsustainability and environmental protection. Tokayev highlighted plans to\nincrease renewable energy capacity and develop hydrogen generation. The\nPresident proposed to hold a national referendum on the construction of a\nnuclear power plant.\n\nThe Kazakh leader also indicated a vision for Kazakhstan to become an IT-\nfocused country. He directed the government to increase the export of IT\nservices to one billion dollars by 2026. This will be facilitated by\npartnerships with major foreign IT companies.\n\nIn the realm of transportation, President Tokayev outlined plans to establish\nKazakhstan as a major transit hub in Eurasia, focusing on key routes like the\nTrans-Caspian and the international North-South Corridor. He noted that\nKazakhstan should eventually become a full-fledged transport and logistics\npower. The President also pointed out that the realization of the transport\npotential depends on Kazakhstan’s constructive and good-neighbourly relations\nwith all neighbouring countries, including Russia, China, and our neighbours\nin Central and South Asia.\n\nKazakhstan is developing a national plan to provide projects with high-quality\ninfrastructure by 2029 and is introducing new financial incentive mechanisms\nto facilitate investment flows into complex oil and gas projects."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Bond market",
    "text": "In October 2014, Kazakhstan introduced its first overseas dollar bonds in 14\nyears. Kazakhstan issued $2.5 billion of 10- and 30-year bonds on 5 October\n2014, in what was the nation's first dollar-denominated overseas sale since\n2000. Kazakhstan sold $1.5 billion of 10-year dollar bonds to yield 1.5\npercentage points above midswaps and $1 billion of 30-year debt at two\npercentage points over midswaps. The country drew bids for $11 billion."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Foreign direct investment",
    "text": "Kazakhstan is the largest recipient of total and annual foreign direct\ninvestment of all CIS countries. The OECD has recognized the strides the\ngovernment has made in opening the country to international investment and in\nimproving the policy framework for investment as part of their efforts to\ndiversify the economy. In 2017 Kazakhstan was invited by OECD to become\nAdherent to the OECD Declaration on International Investment and Multinational\nEnterprises.\n\nAs of 30 September 2014, total foreign investment in Kazakhstan reached\nUS$211.5 billion. Of that total, net foreign Direct Investment constituted\nUS$129.3 billion, with portfolio and other investments comprising the\nremaining US$82.2 billion.\n\nThe FDI growth in Kazakhstan was largely driven by increased investment in\nmining, transport, financial services, telecommunication, and energy that\ncompensated for decreasing investment inflows in construction, metallurgy, and\ntrade. The Prime Minister of Kazakhstan, Alikhan Smailov, has stated that\nKazakhstan aims to attract foreign direct investment (FDIs) worth around US$25\nbillion in 2023, adding that 46 projects involving international financial\ninvestments were implemented in the country during 2022 in renewable energy,\nmetallurgy, agriculture, mining industry, and engineering. Kazakhstan's top-10\nFDI donors in 2022 included the Netherlands, the Unitesd States, Switzerland,\nBelgium, Russia, South Korea, China, France, the United Kingdom, and Turkey.\n\nKazakhstan established the Astana International Financial Center (AIFC),\nmodelled on the Dubai International Financial Center, in 2018. The AIFC offers\nforeign investors an alternative jurisdiction for operations, with tax\nholidays, flexible labor rules, a Common Law-based legal system, and\nflexibility to carry out transactions in any currency. The Kazakh government\nrecommends that foreign investors use the AIFC for contracts with Kazakh\nbusinesses.\n\nOver the past five years, the major foreign investors in Kazakhstan have been\nthe Netherlands ($33.8 billion of investment), the United States ($19.4\nbillion), Switzerland ($12.5 billion), China ($ 6.2 billion) and France ($ 4.7\nbillion). Notably, almost 60% of the investment projects are related to non-\nextractive sectors, including manufacturing, transportation, trade, as well as\nfinancial and insurance services. Agriculture is one of Kazakhstan's most\nimportant sectors where the country seeks to attract foreign investments to\nboost the competitiveness of this sector of economy. To that end, in 2017\nKazAgro negotiated with the European Investment Bank (EIB) a €200 million loan\nfor a period of 15 years.\n\n13 Kazakhstan's regions out of 14 saw investment growth in 2020, despite the\nCOVID-19 pandemic. High growth of investment was in the construction sector,\nspecifically in Turkestan region and Zhambyl region as well as Shymkent city.\nThe gross foreign direct investment (FDI) inflow in Kazakhstan reached $28\nbillion in 2022, a record-high in the past ten years. FDI inflow went up by\n17.7 percent since 2021 when it reached $23.8 billion. In 2012, this figure\nstood at $28.9 billion. The Atyrau Region received most of the investment –\n$8.3 billion (a 48.3 percent increase), followed by Almaty city with $7.6\nbillion (10.9 percent), Astana – $2.2 billion (107.2 percent), the East\nKazakhstan Region – $2.2 billion (3.1 percent), and the Aktobe Region – $1.2\nbillion (11.2 percent down).\n\nOne of the main areas for investment is renewable energy, as Kazakhstan has\none of the largest solar and wind potentials in the region. Moreover, it has\nabundant reserves, amounting to 90% of Central Asia's total, of critical raw\nmaterials, which are essential for the deployment of technologies like wind\nturbines (with rare earth magnets), batteries (lithium and cobalt) and\nsemiconductors (polysilicon). In November 2022, the EU had already recognised\nKazakhstan's value for the green transition by signing a strategic partnership\nfor the supply of critical raw materials, as well as green hydrogen."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Investor support",
    "text": "Kazakhstan's investment environment is defined by the government's support for\nforeign investors. To increase the FDI inflow, the country established the\nKazakh Invest National Company, or Kazakh Invest for short. It is a one-stop\nshop for investors that facilitates investment projects' implementation\nprocess from an idea to implementation, as well as ensures aftercare services.\nIn 2018, Kazakh Invest helped develop more than 70 investment proposals in a\nvariety of industries: metallurgy, petrochemistry, food industry, tourism and\nother. It included creating a business plan, financial model and teaser\ndevelopment.\n\nCurrently, Kazakh Invest is involved in 216 investment projects and\ninitiatives worth $42.5 billion that will create around 47,000 jobs. This\nyear, 4 investment projects worth $217 million have been launched with the\nsupport of the organization, while 85 projects worth $12.3 billion are being\nimplemented.\n\nIn order to facilitate foreign investment, Kazakhstan launched in 2020 an\nonline portal elicense.kz, which allows to conclude investment contracts\nonline reducing red tape. The first agreement that was concluded via the\nportal was between Kaz Solar 50 and the German company Solarnet Investment\nGmbH for a renewable energy project worth ₸5 billion.\n\nTo make Kazakhstan more attractive to foreign investors, Kazakhstan\nestablished 14 special economic zones. Companies located in these zones\nreceive preferential treatment, including exemptions from corporate income\ntax, land tax, property tax, VAT and customs duties for up to 25 years,"
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Intellectual property",
    "text": "In 2015 Kazakhstan passed a law to regulate Intellectual Property, patent law,\nand copyright protections and bring its legislation into line with the\nEuropean Patent Convention (1994 revision) and the 2006 Singapore Treaty."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "United Arab Emirates",
    "text": "In April 2025, Al Khaleej Sugar, a leading sugar company from the United Arab\nEmirates, announced plans to establish a sugar plant in Kazakhstan’s Almaty\nRegion. The decision was made following a meeting on 27 April between the\ncompany’s managing director, Sheikh Jamal Al Ghurair, and the region’s\ngovernor, Marat Sultangaziyev. The plant’s location was to be near the city of\nKonayev, chosen for its logistical advantages. Key considerations for the\nproject included securing a reliable water supply, with alternative irrigation\nsources being explored, as well as the potential development of wind power\nplants to ensure the plant’s energy self-sufficiency. Al Khaleej Sugar aimed\nto minimize environmental impact by relying on renewable energy. The company,\nwhich controlled 3% of the global refined sugar market, conducted a detailed\nhydrological analysis to ensure the success of the project."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "2015 \"Nurly Zhol\" economic policy",
    "text": "On 11 November 2014 in his address to the nation for 2015, Nazarbayev\nproclaimed Kazakhstan's New Economic Policy – The Path to the Future (Nurly\nZhol). The new economic policy implies large-scale state investment in\ninfrastructure over the next several years. In the short term, the program\n\"Nurly Zhol\" will apply the anti-crisis measures to overcome the turbulence in\nthe global economy. The long-term measures of the state program of\ninfrastructure development will help to create a strong platform for new\ngrowth.\n\nKazakhstan has identified five priorities for modernization of the state and\nthe economy to maintain competitiveness in the Fourth Industrial Revolution.\n\nKazakhstan was ranked 36th in the Ease of Doing Business report released by\nthe World Bank Group in 2018. The report's rankings rate ease of regulations\nfor businesses and strength of property rights.\n\nThe Heritage Foundation, a Washington, D.C.–based research center, ranked\nKazakhstan 41st in its Index of Economic Freedom 2018\\. Its overall score has\nincreased by 0.1 point, still being only \"moderately free\" with significant\nimprovements in investment freedom and government integrity offsetting steep\ndeclines in fiscal health and monetary freedom.\n\nKazakhstan aimed in 2017 to boost its economy by attracting private investors\ninterested in developing national companies. This is the main goal of\nprivatization that is expected to decrease the share of public property to 15%\nof GDP. Such companies as Kazakhstan Railways, Samruk-Energo, Kazatomprom,\nKaspost, KazMunayGas and Air Astana are expected to be sold through IPO.\n\nKazakhstan fell from 32nd to the 38th place in the 2018 IMD World\nCompetitiveness ranking. The report evaluates business efficiency, public\nfinance and domestic economy."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.9",
    "section_name": "Privatisation 2016–2020",
    "text": "In December 2015, Kazakhstan Government approved new privatization plan for\n2016 – 2020. It is a large-scale privatization program that continues the\nprivatization of 2014 and includes 60 major state-owned companies. According\nto Kazakh Finance ministry, the state budget got ₸6.99 billion (US$20.6\nmillion) from the deals reached within the 2014–2016 privatization program as\nof 20 Sept. 2016. Kazakhstan's privatization program aims to reduce the state\nparticipation in the economy to 15 percent, which is the level set for\ncountries of the OECD.\n\nAccording to the Kazakh Prime Minister Alikhan Smailov, the implementation of\na large-scale privatization plan will reduce the share of state participation\nin the economy down to 14 percent by 2025.\n\nThe privatization list includes 675 facilities in the public and quasi-public\nsectors, including the shares of 262 national companies that are part of\nholdings such as the Samruk Kazyna Sovereign Wealth Fund, KazMunayGas, and\nKazakhstan Temir Zholy.\n\nAccording to Minister of National Economy Alibek Kuantyrov, the plan excludes\n200 critical social life support systems such as water, power, and heat\nfacilities. These objects will remain under state ownership."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.10",
    "section_name": "Special Economic Zones",
    "text": "A Special Economic Zone (SEZ) is a part of Kazakhstan's territory, which has a\nspecial legal regime, with all the necessary infrastructure, to carry out\npriority activities.\n\nKazakhstan has 14 SEZs with different industry orientations in 12 regions\nnationwide, particularly in the Khorgos-Eastern Gate logistics hub, Turkistan,\na center of international tourism and pilgrimage, and the Aktau Seaport, which\nhas incorporated the ports of Aktau and Kuryk in the summer of 2023.\n\nIn March 2023, Kazakhstan created the G4 City special economic zone in the\nAlmaty Region, seeking to attract nearly 3.7 trillion tenge ($8.1 billion) of\ninvestments through 2048. The new economic zone with an area of 30,000\nhectares is expected to provide favorable conditions for attracting domestic\nand foreign investment to create an integrated G4 City, which will facilitate\nthe development of the entire region.\n\nCurrently, the following SEZs have been established in Kazakhstan:\n\n1. 'Astana, the New City' in Nur-Sultan (the expiry date is in 2027).\n2. 'Aktau Sea Port' in Aktau (the expiry date is on 1 January 2028).\n3. 'Ontustik' in Sairam district of South-Kazakhstan region (the expiry date is on 1 July 2030).\n4. 'National Industrial Petrochemical Park' in Atyrau region (the expiry date is on 31 December 2032)\n5. 'Park of Innovative Technologies' (the expiry date is 1 January 2028).\n6. ‘Saryarka’ in Karaganda region (the expiry date is 1 December 2036).\n7. ‘Horgos - the eastern gates’ in Almaty region (the expiry date is 2035).\n8. ‘Pavlodar’ in Pavlodar (the expiry date is 1 December 2036).\n9. ’Chemical Park Taraz’ in Taraz (the expiry date is 1 January 2037).\n10. ‘International Center for Cross-Border Cooperation Horgos' in Almaty region (the expiry date is 1 January 2041).\n11. 'Turkestan' in Turkestan region (the expiry date is 1 January 2043)."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "2.11",
    "section_name": "Small and medium-sized enterprises",
    "text": "A new program to support small businesses was launched in Kazakhstan in\nFebruary 2015. 2015 is expected to be a pilot period of the program. During\nthat period the initiative will be focused on three major areas, notably\nagribusiness, machinery building and production of construction materials, and\nis to be further extended to other industries.\n\nIn May 2015 the European Bank for Reconstruction and Development (EBRD) agreed\nto provide €41 million for technical cooperation projects, advisory support to\nsmall and medium-sized enterprises (SMEs), and to introduce a Women in\nBusiness program.\n\nIn 2016 the number of Kazakhstan's telecom start-ups increased by 10% compared\nto 2015. Around 9,400 small telecom companies are currently registered in the\ncountry.\n\nThe Kazakh Government provides extensive support to businesses, especially\nSMEs. The share of small and medium-sized businesses (SMEs) in the country's\ngross domestic product grew by 7.9 percent between 2015 and 2021 and reached\n34.7 percent. Kazakhstan plans to raise this indicator to 50% by 2050.\n\nIn 2023, it was reported that the number of small and medium-sized businesses\n(SMEs) in Kazakhstan has increased by 23.4% to nearly two million. The number\nof people working in SMEs increased by more than 18% to 4.1 million,\naccounting for around 40% of everyone employed in the economy.\n\nThe share of SMEs in the economy grew from 33.3% to 36.5%, while the volume of\noutput by SMEs increased by 28% to over 59 trillion tenge ($132.4 billion).\n\nTo expand SMEs’ access to finance, a number of programmes are in place in the\ncountry to provide concessional lending and microfinance, subsidised interest\nrates, loan guarantees and grants to start a business. The main operator of\nfinancial support programmes for SMEs is the Damu Entrepreneurship Development\nFund.\n\n**Government programme for business support and business development “Business\nRoadmap 2025”**\n\n“BRM 2025” programme has been in operation since 2010 and is administered by\nthe Ministry of National Economy of the Republic of Kazakhstan. Initially, the\nfocus of the programme was on supporting enterprises in non-extracting and\nimport-substituting sectors. Over time, this was expanded to rural areas,\nsmall and single-industry towns’ entrepreneurs, who are not subject to\nsectoral restrictions. The programme implementation involves both central and\nlocal authorities, Damu Entrepreneurship Development Fund, Atameken National\nChamber of Entrepreneurs and commercial banks. The types of support that the\nprogramme offers include interest rate subsidies, loan guarantees, grants,\ntraining and consulting assistance; and meets the basic needs of\nentrepreneurs, making “BRM 2025” the most popular government programme.\n\n**The programmes of Damu Entrepreneurship Development Fund**\n\nDamu Entrepreneurship Development Fund implements a number of its own\nprogrammes, which are financed from the company’s own capital or by raising\nfunds from local authorities and international financial organisations. Within\nthe framework of regional programmes, loans are granted at a rate of up to\n8.0% in priority sectors, which are determined depending on the specifics of\nthe economy of each region. Within the framework of international programmes,\nloans are issued on market terms and without sector restrictions.\n\nIn terms of its own programmes, Damu Fund and its partner organisations\n(banks, leasing companies, microfinance organisations) have financed more than\n55 112 projects for KZT 837 756 million as of the end of 2020.\n\nIn May 2023, Prime Minister Alikhan Smailov said medium-sized businesses\nshould become the engine of progress that drives Kazakhstan’s manufacturing\ngrowth with the launch of competitive products and a wide range of services.\nTo enhance the protection of the rights of entrepreneurs, the government is\nintroducing a regulation-from-scratch mechanism to drop 10,000 unwarranted\nrequirements for businesses and automate processes in all areas of state\ncontrol."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Recent miscellany",
    "text": "Kazakhstan was ranked 54th 2017 Economic Freedom of the World report published\nby Fraser Institute, but ranks 12 places below on place 66 when adjusted by\nthe Gender Disparity Index, which captures the degree to which women around\nthe world have the same legal rights as men and adjusts the economic freedom\nscore accordingly. This shows a large disadvantage of women in business.\n\nIn recent years a trade route has been established between Kazakhstan and the\nUnited States. It now makes up 54% of the World's salt imports and exports by\nvolume (350,000 tonnes per year).[_clarification needed_]\n\nIn 2021, 14 products developed by Kazakh scientists began being exported to\nChina, Russia, Turkey, Georgia, Kyrgyzstan, and the Czech Republic. These\nproducts include, but are not limited to, food & drinks based on milk whey;\nprobiotics; an anti-fungal drug; biological sanitation products.\n\nIn 2021, it was reported that the number of young female entrepreneurs in\nKazakhstan has increased by 15 percent."
  },
  {
    "chapter_name": "Economy of Kazakhstan",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Global tariff war",
    "text": "On 11 April 2025, President Kassym-Jomart Tokayev stated that Kazakhstan was\nprepared to face the ongoing global economic crisis, which he described as one\nof the most severe in recent decades. He cited disruptions in global trade and\nproduction chains, price volatility, and intensified competition for\ninvestment as key challenges. Despite these pressures, Tokayev affirmed that\nKazakhstan would maintain its development agenda and continue funding priority\ninfrastructure projects. The statement followed a government meeting\naddressing falling global prices for energy and commodities. At the time, the\neconomy had seen a temporary boost from rising export demand and the\nsuspension of certain U.S. tariffs."
  }
]