[
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Honduras** is based mostly on agriculture, which accounts for\n14% of its gross domestic product (GDP) in 2013. The country's leading export\nis coffee (US$340 million), which accounted for 22% of the total Honduran\nexport revenues. Bananas, formerly the country's second-largest export until\nbeing virtually wiped out by 1998's Hurricane Mitch, recovered in 2000 to 57%\nof pre-Mitch levels. Cultivated shrimp is another important export sector.\nSince the late 1970s, towns in the north began industrial production through\nmaquiladoras, especially in San Pedro Sula and Puerto Cortés.\n\nHonduras has extensive forests, marine, and mineral resources, although\nwidespread slash and burn agricultural methods continue to destroy Honduran\nforests. The Honduran economy grew 4.8% in 2000, recovering from the Mitch-\ninduced recession (−1.9%) of 1999. The Honduran maquiladora sector, the third-\nlargest in the world, continued its strong performance in 2000, providing\nemployment to over 120,000 and generating more than $528 million in foreign\nexchange for the country. Inflation, as measured by the consumer price index,\nwas 10.1% in 2000, down slightly from the 10.9% recorded in 1999. The\ncountry's international reserve position continued to be strong in 2000, at\nslightly over US$1 billion. Remittances from Hondurans living abroad (mostly\nin the United States) rose 28% to $410 million in 2000. The Lempira (currency)\nwas devaluing for many years, but stabilized at L19 to the United States\ndollar in 2005. The Honduran people are among the poorest in Latin America;\ngross national income per capita (2007) is US$1,649; the average for Central\nAmerica is $6,736. Honduras is the fourth poorest country in the Western\nHemisphere; only Haiti, Nicaragua, and Guyana are poorer. Using alternative\nstatistical measurements in addition to the gross domestic product can provide\ngreater context for the nation's poverty.\n\nThe country signed an Enhanced Structural Adjustment Facility (ESAF) – later\nconverted to a Poverty Reduction and Growth Facility (PRGF) with the\nInternational Monetary Fund in March 1999. Honduras (as of the about year\n2000) continues to maintain stable macroeconomic policies. It has not been\nswift in implementing structural changes, such as privatization of the\npublicly owned telephone and energy distribution companies—changes which are\ndesired by the IMF and other international lenders. Honduras received\nsignificant debt relief in the aftermath of Hurricane Mitch, including the\nsuspension of bilateral debt service payments and bilateral debt reduction by\nthe Paris Club—including the United States – worth over $400 million. In July\n2000, Honduras reached its decision point under the Heavily Indebted Poor\nCountries Initiative (HIPC), qualifying the country for interim multilateral\ndebt relief.\n\nLand appears to be plentiful and readily exploitable, but the presence of\napparently extensive land is misleading because the nation's rugged,\nmountainous terrain restricts large-scale agricultural production to narrow\nstrips on the coasts and to a few fertile valleys. Honduras's manufacturing\nsector has not yet developed beyond simple textile and agricultural processing\nindustries and assembly operations. The small domestic market and competition\nfrom more industrially advanced countries in the region have inhibited more\ncomplex industrialization.\n\nIn 2022, according to the National Institute of Statistics of Honduras (INE),\n73% of the country's population is poor and 53% lives in extreme poverty. The\ncountry is among the most unequal in the world.",
    "openai_summarised_points": [
      "• The economy of Honduras is predominantly based on agriculture, which contributed 14% to the country's gross domestic product (GDP) in 2013.",
      "• The leading export of Honduras is coffee, with exports valued at US$340 million, accounting for 22% of the total Honduran export revenues.",
      "• Bananas, which were formerly the country's second-largest export, were nearly wiped out by Hurricane Mitch in 1998 but recovered in 2000 to 57% of pre-Mitch export levels.",
      "• Cultivated shrimp is also an important sector in Honduras's export economy.",
      "• Since the late 1970s, towns in northern Honduras, particularly San Pedro Sula and Puerto Cortés, began industrial production through maquiladoras, which are assembly plants that import raw materials for manufacturing.",
      "• Honduras possesses extensive natural resources, including forests, marine resources, and minerals; however, widespread slash-and-burn agricultural practices continue to cause deforestation.",
      "• The Honduran economy experienced a growth rate of 4.8% in 2000, recovering from a recession of -1.9% in 1999 induced by Hurricane Mitch.",
      "• The maquiladora sector in Honduras, the third-largest in the world, performed strongly in 2000, providing employment to over 120,000 people and generating more than US$528 million in foreign exchange.",
      "• Inflation measured by the consumer price index was 10.1% in 2000, slightly down from 10.9% in 1999.",
      "• The country's international reserves remained robust in 2000, totaling slightly over US$1 billion.",
      "• Remittances from Hondurans living abroad, primarily in the United States, increased by 28% to US$410 million in 2000.",
      "• The Honduran currency, the Lempira, experienced years of devaluation but stabilized at a rate of 19 Lempiras to 1 US dollar in 2005.",
      "• Honduras is among the poorest countries in Latin America, with a gross national income (GNI) per capita of US$1,649 in 2007, compared to the regional average of US$6,736.",
      "• It ranks as the fourth poorest country in the Western Hemisphere, with only Haiti, Nicaragua, and Guyana being poorer.",
      "• Alternative statistical measures beyond GDP suggest a broader understanding of the nation's poverty levels.",
      "• Honduras signed an Enhanced Structural Adjustment Facility (ESAF), later converted to a Poverty Reduction and Growth Facility (PRGF), with the International Monetary Fund (IMF) in March 1999.",
      "• As of around 2000, Honduras maintained stable macroeconomic policies but was slow in implementing structural reforms such as privatizing state-owned enterprises in telecommunications and energy sectors, which were desired by the IMF and international lenders.",
      "• Following Hurricane Mitch, Honduras received significant debt relief, including suspension of bilateral debt service payments and bilateral debt reduction by the Paris Club, including the United States, amounting to over US$400 million.",
      "• In July 2000, Honduras reached its decision point under the Heavily Indebted Poor Countries (HIPC) Initiative, qualifying for interim multilateral debt relief.",
      "• Although land appears abundant and exploitable, the rugged mountainous terrain limits large-scale agriculture mainly to narrow coastal strips and a few fertile valleys.",
      "• Honduras's manufacturing sector remains underdeveloped, primarily consisting of simple textile, agricultural processing, and assembly operations, hindered by a small domestic market and regional competition from more industrialized countries.",
      "• As of 2022, according to the National Institute of Statistics of Honduras (INE), 73% of the population lives in poverty, and 53% in extreme poverty.",
      "• Honduras is among the most unequal countries in the world in terms of income distribution."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:57.632335",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3599,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "An economic activity map of Honduras, 1983.\n\nThe colonial economy in Honduras was primarily oriented around mining.\n\nAfter Honduras achieved independence from Spain in the early 19th century, its\neconomic growth became closely related to its ability to develop attractive\nexport products. During much of the 19th century, the Honduran economy\nlanguished; traditional cattle raising and subsistence agriculture produced no\nsuitable major export. In the latter part of the century, economic activity\nquickened with the development of large-scale, precious metal mining. The most\nimportant mines were in the mountains near the capital of Tegucigalpa and were\nowned by the New York and Honduras Rosario Mining Company (NYHRMC).\n\nSilver was the principal metal extracted, accounting for about 55% of exports\nin the 1880s. Mining income stimulated commercial and ancillary enterprises,\nbuilt infrastructure, and reduced monetary restraints on trade. There were few\nother beneficial economic effects, however, because the mining industry was\nnever well integrated into the rest of the Honduran economy. The foreign\nmining companies employed a small workforce, provided little or no government\nrevenue, and relied mostly on imported mining equipment.",
    "openai_summarised_points": [
      "• The colonial economy of Honduras was primarily centered around mining activities.",
      "• Following independence from Spain in the early 19th century, Honduras's economic development depended heavily on the ability to develop attractive export products.",
      "• Throughout much of the 19th century, the Honduran economy experienced stagnation, characterized by traditional cattle raising and subsistence agriculture that did not produce significant exports.",
      "• Economic activity accelerated in the latter part of the 19th century with the emergence of large-scale precious metal mining operations.",
      "• The most significant mining areas were located in the mountains near Tegucigalpa, the capital city of Honduras.",
      "• These mining operations were owned by the New York and Honduras Rosario Mining Company (NYHRMC).",
      "• Silver was the main metal extracted during this period, accounting for approximately 55% of Honduras's exports in the 1880s.",
      "• The income generated from mining stimulated the growth of commercial and ancillary industries, contributed to infrastructure development, and helped alleviate monetary constraints on trade.",
      "• Despite these benefits, the overall economic impact of mining was limited because the industry was poorly integrated into the broader Honduran economy.",
      "• The foreign mining companies employed a small workforce, provided minimal or no revenue to the Honduran government, and depended heavily on imported mining equipment."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:24:02.340705",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1242,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "20th century",
    "text": "Honduras's international economic activity surged in the early 20th century.\nBetween 1913 and 1929, its agricultural exports rose from $3 million ($2\nmillion from bananas) to $25 million ($21 million from bananas). These\n\"golden\" exports were supported by more than $40 million of specialized banana\ncompany investment in the Honduran infrastructure and were safeguarded by US\npressure on the national government when the companies felt threatened.\n\nThe overall performance of the Honduran economy remained closely tied to\nbanana prices and production from the 1920s until after the mid-century\nbecause other forms of commercial export agriculture were slow to emerge. In\naddition, until drastically reduced in the mid-1950s, the workforce associated\nwith banana cultivation represented a significant proportion of the wage\nearners in the country. Just before the banana industry's largest strike in\n1954, approximately 35,000 workers held jobs on the banana plantations of the\nUnited Fruit Company (later United Brands Company, then Chiquita Brands\nInternational) or the Standard Fruit Company (later brought by Castle and\nCook, then Dole Food Company).\n\nAfter 1950 Honduran governments encouraged agricultural modernization and\nexport diversification by spending heavily on transportation and\ncommunications infrastructure, agricultural credit, and technical assistance.\nDuring the 1950s—as a result of these improvements and the strong\ninternational export prices—beef, cotton, and coffee became significant export\nproducts for the first time. Honduran sugar, timber, and tobacco also were\nexported, and by 1960 bananas had declined to a more modest share (45 percent)\nof total exports. During the 1960s, industrial growth was stimulated by the\nestablishment of the Central American Common Market (CACM—see Appendix B).\n\nAs a result of the reduction of regional trade barriers and the construction\nof a high common external tariff, some Honduran manufactured products, such as\nsoaps, sold successfully in other Central American countries. Because of the\ngreater size and relative efficiency of the Salvadoran and Guatemalan\nindustrial sectors, however, Honduras bought far more manufactured products\nfrom its neighbors than it sold to them. After the 1969 Soccer War with El\nSalvador, Honduras effectively withdrew from the CACM. Favorable bilateral\ntrade arrangements between Honduras and the other former CACM partners were\nsubsequently negotiated, however.\n\nDowntown San Pedro Sula in 2004.\n\nA political shift in the 1980s had strong and unexpected repercussions on the\ncountry's economic condition. Beginning in late 1979, as insurgency spread in\nneighboring countries, Honduran military leaders enthusiastically came to\nsupport United States policies in the region. This alignment resulted in\nfinancial support that benefited the civilian as well as the military\nministries and agencies of Honduras. Honduran defense spending rose throughout\nthe 1980s until it consumed 20 to 30 percent of the national budget. Before\nthe military buildup began in fiscal year (FY) 1980, United States military\nassistance to Honduras was less than US$4 million. Military aid more than\ndoubled to reach just under US$9 million by FY 1981, surged to more than $31\nmillion by FY 1982, and stood at $48.3 million in FY 1983. Tiny Honduras soon\nbecame the tenth largest recipient of United States assistance aid; total\neconomic and military aid rose to more than $200 million in 1985 and remained\nat more than $100 million for the rest of the 1980s.\n\nThe increasing dependence of the Honduran economy on foreign aid was\naggravated by a severe, regionwide economic decline during the 1980s. Private\ninvestment plummeted in 1980, and capital flight for that year was $500\nmillion. To make matters worse, coffee prices plunged on the international\nmarket in the mid-1980s and remained low throughout the decade. In 1993\naverage annual per capita income remained depressingly low at about $580, and\n75 percent of the population was poor by internationally defined standards.\n\nTraditionally, Honduran economic hopes have been pinned on land and\nagricultural commodities. Despite those hopes, however, usable land has always\nbeen severely limited. Honduras's mostly mountainous terrain confines\nagriculturally exploitable land to narrow bands along the coasts and to some\npreviously fertile but now largely depleted valleys. The country's once\nabundant forest resources have also been dramatically reduced, and Honduras\nhas not derived economically significant income from mineral resources since\nthe 19th century. Similarly, Honduras's industrial sector never was fully\ndeveloped. The heady days of the CACM (mid to -late 1960s), which produced an\nindustrial boom for El Salvador and Guatemala, barely touched the Honduran\neconomy except to increase its imports because of the comparative advantages\nenjoyed by the Salvadoran and Guatemalan economies and Honduras's inability to\ncompete.\n\nBananas and coffee have also proven unreliable sources of income. Although\nbananas are less subject to the vagaries of international markets than coffee,\nnatural disasters such as Hurricane Fifi in 1974, drought, and disease have\nappeared with a regular, albeit random, frequency to take their economic toll\nthrough severely diminished harvests. Moreover, bananas are grown and marketed\nmostly by international corporations, which keep the bulk of wealth generated.\nCoffee exports, equally unreliable as a major source of economic support,\nsurpassed bananas in the mid1970s as Honduras's leading export income earner,\nbut international price declines coupled with huge fiscal deficits underlined\nthe vulnerability of coffee as an economic base.",
    "openai_summarised_points": [
      "• Honduras's international economic activity experienced a significant surge in the early 20th century, reflecting increased export performance and foreign investment.",
      "• Between 1913 and 1929, Honduras's agricultural exports grew from $3 million to $25 million, with bananas accounting for $2 million initially and rising to $21 million by 1929, marking a substantial increase.",
      "• The \"golden\" export period was supported by over $40 million in specialized investment from banana companies into Honduran infrastructure, which was crucial for export growth.",
      "• US diplomatic and economic pressure played a protective role for the banana industry, especially when companies perceived threats to their interests, safeguarding their investments.",
      "• The Honduran economy's performance remained closely linked to banana prices and production from the 1920s until after mid-century, due to slow emergence of other export sectors.",
      "• Until the mid-1950s, a significant portion of the Honduran workforce was employed in banana cultivation, notably on plantations operated by United Fruit Company (later United Brands Company, then Chiquita Brands International) and Standard Fruit Company (later Dole Food Company).",
      "• Just before the 1954 major banana strike, approximately 35,000 workers were employed on banana plantations owned by these companies.",
      "• Post-1950, Honduran governments promoted agricultural modernization and export diversification by investing heavily in transportation, communications infrastructure, agricultural credit, and technical assistance.",
      "• During the 1950s, improved infrastructure and high international export prices led to the emergence of beef, cotton, and coffee as significant export commodities for the first time.",
      "• Other exports during this period included sugar, timber, and tobacco, which contributed to economic diversification.",
      "• By 1960, bananas accounted for only 45 percent of total exports, indicating a decline in their dominance.",
      "• The 1960s saw industrial growth stimulated by the establishment of the Central American Common Market (CACM), which aimed to regional economic integration.",
      "• The reduction of regional trade barriers and the implementation of a high common external tariff enabled some Honduran manufactured products, such as soaps, to be sold successfully in other Central American countries.",
      "• Due to the larger and more efficient industrial sectors of El Salvador and Guatemala, Honduras primarily imported manufactured goods from its neighbors rather than exporting to them.",
      "• The 1969 Soccer War with El Salvador led Honduras to effectively withdraw from the CACM, although subsequent bilateral trade agreements were negotiated with former CACM partners.",
      "• In the 1980s, a political shift in Honduras had profound economic repercussions, with military leaders supporting US policies amidst regional insurgencies starting in late 1979.",
      "• US military aid to Honduras increased markedly, rising from less than US$4 million before FY 1980 to US$48.3 million in FY 1983, making Honduras the tenth largest recipient of US aid.",
      "• Total US economic and military aid to Honduras exceeded US$200 million in 1985 and remained above US$100 million throughout the late 1980s.",
      "• The Honduran economy became increasingly dependent on foreign aid during the 1980s, which was exacerbated by a severe regional economic decline, with private investment falling sharply in 1980 and capital flight reaching US$500 million that year.",
      "• International coffee prices plummeted in the mid-1980s and remained low throughout the decade, contributing to economic instability.",
      "• By 1993, the average annual per capita income was approximately US$580, and about 75 percent of the population was classified as poor according to international standards.",
      "• Historically, Honduras's economic prospects depended heavily on land and agricultural commodities, but usable land was severely limited due to mountainous terrain, confined to narrow coastal bands and depleted valleys.",
      "• The country's forest resources had been dramatically reduced, and Honduras had not derived significant income from mineral resources since the 19th century.",
      "• The industrial sector remained underdeveloped; the mid to late 1960s CACM boom primarily increased imports rather than industrial output, due to Honduras's comparative disadvantages.",
      "• Bananas and coffee, the main export commodities, proved unreliable due to natural disasters such as Hurricane Fifi in 1974, droughts, and diseases, which caused harvest declines.",
      "• Although bananas were less vulnerable to international market fluctuations than coffee, their cultivation and marketing were dominated by international corporations that retained most of the generated wealth.",
      "• Coffee exports surpassed bananas in the mid-1970s as Honduras's leading export income source, but their vulnerability was highlighted by international price declines and fiscal deficits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:24:16.268361",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5714,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "1990s",
    "text": "| This section **is missing information** about the devastating effects of\nHurricane Mitch on this nation. Didn't it cause a recession here in 1998?.\nPlease expand the section to include this information. Further details may\nexist on the talk page. _( September 2018)_\n---|---\n\nAs Honduras entered the 1990s, it did have some factors working in its\nfavor—relative peace and a stronger civilian government with less military\ninterference in the politics and economy of the country than in past years.\nThe country was hobbled, however, by horrendous foreign debt, could claim only\ndiminished natural resources, and had one of the fastest-growing and\nurbanizing populations in the world. The government's daunting task then\nbecame how to create an economic base able to compensate for the withdrawal of\nmuch United States assistance without becoming solely dependent on traditional\nagricultural exports.\n\nIn the 1990s, bananas were booming again, particularly as new European trade\nagreements increased market size. Small banana producing cooperatives lined up\nin the 1990s to sell their land to the commercial giants, and the last banana-\nproducing lands held by the government were privatized. Like most of Central\nAmerica, Honduras in the 1990s began to woo foreign investors, mostly Asian\nclothing assembly firms, and it held high hopes for revenue to be generated by\nprivatizing national industries. With one of the most strike-prone labor\nforces in Central America, debt-burdened and aging industrial assets, and a\ndramatically underdeveloped infrastructure, Honduras, however, has distinct\neconomic disadvantages relative to its Central American and Caribbean\nneighbors, who compete with Honduras in the same export markets.\n\nHonduran president Rafael Leonardo Callejas Romero, elected in November 1989,\nenjoyed little success in the early part of his administration as he attempted\nto adhere to a standard economic austerity package prescribed by the\nInternational Monetary Fund (IMF) and the World Bank. As the November 1993\npresidential elections drew closer, the political fallout of austere economic\nmeasures made their implementation even less likely. Any hope for his party's\nwinning the 1993 election was predicated on improving social programs,\naddressing employment needs, and appeasing a disgruntled, vocal public sector.\nHowever, reaching those goals required policies that moved away from balancing\nthe budget, lowering inflation, and reducing the deficit and external debt to\nattract investment and stimulate economic growth.\n\nCallejas inherited an economic mess. The economy had deteriorated rapidly,\nstarting in 1989, as the United States Agency for International Development\n(AID) pointedly interrupted disbursements of its grants to Honduras to signal\ndispleasure with the economic policies of the old government and to push the\nnew government to make economic reforms. Nondisbursal of those funds greatly\nexacerbated the country's economic problems. Funds from the multilateral\nlending institutions, which eventually would help fill the gap left by the\nreduction of United States aid, were still under negotiation in 1989 and would\nbe conditioned first on payment of arrears on the country's enormous external\ndebt.\n\nBetween 1983 and 1985, the government of Honduras—pumped up by massive\ninfusions of external borrowing—had introduced expensive, high-tech\ninfrastructure projects. The construction of roads and dams, financed mostly\nby multilateral loans and grants, was intended to generate employment to\ncompensate for the impact of the regionwide recession. In reality, the\ndevelopment projects served to swell the ranks of public-sector employment and\nline the pockets of a small elite. The projects never sparked private-sector\ninvestment or created substantial private employment. Instead, per capita\nincome continued to fall as Honduras's external debt doubled. Even greater\ninjections of foreign assistance between 1985 and 1988 kept the economy\nafloat, but it soon became clear that the successive governments had been\nborrowing time as well as money.\n\nForeign aid between 1985 and 1989 represented about 4.6 percent of the gross\ndomestic product (GDP). About 44 percent of the government's fiscal shortfall\nwas financed through cash from foreign sources. Side effects of the cash\ninfusion were that the national currency, the lempira became overvalued and\nthe number of exports dropped. A booming public sector, with its enhanced\nability to import, was enough to keep the economy showing growth, based on\nprivate consumption and government spending. But the government did little to\naddress the historical, underlying structural problems of the economy—its\noverdependence on too few traditional commodities and lack of investment.\nUnemployment mushroomed, and private investment withered.\n\nBy 1989 president Callejas's broad economic goal led a return of Honduran\neconomic growth to 1960–80 levels. During the decades of the 1960s and 1970s,\nthe country's economy, spurred mostly by erratically fluctuating traditional\nagricultural commodities, nevertheless averaged real annual growth of between\n4 and 5 percent. At the end of the 1980s, however, Callejas had few remaining\nvehicles with which to pull the country out of the deep regionwide recession\nof the 1980s. Real growth between 1989 and 1993 translated to mostly negative\nor small positive per capita changes in the GDP for a population that was\ngrowing at close to 4 percent annually.\n\nPresident Callejas attempted to adhere to conditions of desperately needed new\nloans. Cutting the size of the public sector workforce, lowering the deficit,\nand enhancing revenues from taxes—as mandated by the multilateral lending\ninstitutions—were consistently his biggest stumbling blocks. Despite his all-\nout effort to reduce the public-sector deficit, the overall ratio of fiscal\ndeficit to the GDP in 1990 showed little change from that in 1989. The total\npublic-sector deficit actually grew to 8.6 percent of the GDP, or nearly L1\nbillion, in 1991.\n\nThe 1993 deficit expanded to 10.6 percent of GDP. The Honduran government's\nmedium-term economic objectives, as dictated by the IMF, were to have\ngenerated real GDP growth of 3.5 percent by 1992 and 4 percent by 1993. In\nfact, GDP growth was 3.3 percent in 1991, 5.6 percent in 1992, and an\nestimated 3.7 percent in 1993. The economy had operated so long on an ad hoc\nbasis that it lacked the tools to implement coherent economic objectives.\nSolving the most immediate crisis frequently took precedence over long-term\ngoals.",
    "openai_summarised_points": [
      "• The 1990s in Honduras was characterized by relative peace and a stronger civilian government with reduced military interference in politics and the economy compared to previous years.",
      "• The country faced significant challenges including horrendous foreign debt, diminished natural resources, and one of the fastest-growing and urbanizing populations in the world.",
      "• The Honduran government aimed to develop an economic base capable of compensating for the withdrawal of substantial U.S. assistance without becoming overly dependent on traditional agricultural exports.",
      "• During the 1990s, banana exports experienced a boom, driven by new European trade agreements that expanded market size.",
      "• Small banana-producing cooperatives sold their land to large commercial firms, and the last banana-producing lands held by the government were privatized.",
      "• Honduras sought foreign investment, primarily from Asian clothing assembly firms, and anticipated revenue from privatizing national industries.",
      "• The country faced economic disadvantages such as a highly strike-prone labor force, aging industrial assets burdened by debt, and underdeveloped infrastructure, which hindered competitiveness in export markets against neighboring Central American and Caribbean countries.",
      "• President Rafael Leonardo Callejas Romero, elected in November 1989, initially struggled to implement austerity measures prescribed by the IMF and World Bank, facing political backlash as elections approached in 1993.",
      "• To win the 1993 election, Callejas's party needed to improve social programs, address employment, and appease a vocal public sector, which conflicted with policies aimed at fiscal discipline like balancing the budget, lowering inflation, and reducing external debt.",
      "• The Honduran economy deteriorated rapidly starting in 1989, exacerbated by the U.S. Agency for International Development (AID) halting disbursements of grants to pressure reforms, worsening economic conditions.",
      "• Multilateral lending institutions' funds, negotiated in 1989, were conditioned on Honduras paying arrears on its enormous external debt.",
      "• Between 1983 and 1985, Honduras invested heavily in expensive infrastructure projects—roads and dams—financed mainly through multilateral loans and grants, intended to generate employment but primarily benefiting a small elite and increasing public-sector employment without stimulating private investment or employment.",
      "• Despite foreign aid injections from 1985 to 1988, the economy remained fragile, with per capita income falling and external debt doubling, indicating borrowed time and money.",
      "• Foreign aid between 1985 and 1989 accounted for approximately 4.6% of GDP, with about 44% of the fiscal shortfall financed through foreign sources, leading to an overvalued lempira and decreased exports.",
      "• The public sector's growth and increased import capacity temporarily sustained economic growth based on private consumption and government spending, but underlying structural issues—overdependence on few commodities and lack of investment—remained unaddressed.",
      "• Unemployment increased, and private investment declined significantly during this period.",
      "• By 1989, Callejas aimed to restore economic growth to levels seen between 1960 and 1980, when the economy grew at an average of 4-5% annually, driven mainly by fluctuating agricultural commodities.",
      "• Post-1989, Honduras experienced mostly negative or minimal positive per capita GDP growth, despite overall GDP growth of 3.3% in 1991, 5.6% in 1992, and an estimated 3.7% in 1993, amid a population growing at nearly 4% annually.",
      "• Callejas attempted to meet conditions for new loans by reducing public sector employment, lowering the deficit, and increasing tax revenues, but these efforts were hampered by persistent fiscal deficits.",
      "• The public-sector deficit grew to 8.6% of GDP in 1991, nearly L1 billion, and further expanded to 10.6% of GDP in 1993.",
      "• The IMF's medium-term economic goals aimed for real GDP growth of 3.5% in 1992 and 4% in 1993; actual growth was 3.3% in 1991, 5.6% in 1992, and approximately 3.7% in 1993.",
      "• The Honduran economy operated on an ad hoc basis, lacking coherent tools to implement long-term economic strategies, often prioritizing immediate crises over sustainable development.",
      "• The devastating effects of Hurricane Mitch in 1998 caused a severe recession in Honduras, leading to significant economic contraction, destruction of infrastructure, and setbacks in development efforts (note: this information was added to expand the section based on missing details)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:00.414952",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6559,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Inflation",
    "text": "By 1991 President Callejas had achieved modest success in controlling\ninflation. Overall inflation for 1990 had reached 36.4 percent—not the\nhyperinflation experienced by some Latin American counties—but still the\nhighest annual rate for Honduras in forty years. The Honduran government and\nthe IMF had set an inflation target of 12 percent for 1992 and 8 percent for\n1993. The actual figures were 8.8 percent in 1992 and an estimated 10.7\npercent for 1993. Hondurans had been accustomed to low inflation (3.4 percent\nin 1985, rising to 4.5 percent by the end of 1986), partly because pegging the\nlempira to the dollar-linked Honduras's inflation rate to inflation rates in\ndeveloped countries. But the expectation for low inflation made the reality of\nhigh inflation that much worse and created additional pressures on the\ngovernment for action when inflation soared in 1990.",
    "openai_summarised_points": [
      "• By 1991, President Callejas had achieved modest success in controlling inflation in Honduras.",
      "• Overall inflation for the year 1990 reached 36.4 percent, which, although not hyperinflation, was the highest annual inflation rate in Honduras in forty years.",
      "• The inflation levels in 1990 represented a significant deviation from previous low inflation rates and indicated economic instability.",
      "• The Honduran government, in collaboration with the International Monetary Fund (IMF), set an inflation target of 12 percent for 1992.",
      "• The inflation target was further lowered to 8 percent for 1993, reflecting efforts to stabilize the economy.",
      "• Actual inflation rates were 8.8 percent in 1992, slightly above the target, and an estimated 10.7 percent for 1993, exceeding the set goals.",
      "• Historically, Hondurans had been accustomed to low inflation rates, with 3.4 percent in 1985 and rising slightly to 4.5 percent by the end of 1986.",
      "• The low inflation environment was partly maintained by pegging the lempira to the US dollar, which linked Honduras’s inflation rate to that of developed countries.",
      "• The expectation of low inflation contributed to a sense of economic stability; however, the reality of high inflation in 1990 intensified pressures on the government to implement corrective measures.",
      "• The surge in inflation in 1990 created additional economic and political pressures for the Honduran government to address inflationary pressures and stabilize the economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:04.501257",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 876,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Unemployment",
    "text": "Between 1980 and 1983, 20 percent of the workforce was unemployed—double the\npercentage of the late 1970s. Job creation remained substantially behind the\ngrowth of the labor force throughout the 1980s. Unemployment grew to 25\npercent by 1985, and combined unemployment and underemployment jumped to 40\npercent in 1989. By 1993, 50 to 60 percent of the Honduran labor force was\nestimated to be either underemployed or unemployed.\n\nThe government's acceptance of foreign aid during the 1980s, in lieu of\neconomic growth sparked by private investment, allowed it to ignore the\nnecessity of creating new jobs. Honduras's GDP showed reasonable growth\nthroughout most of the 1980s, especially when compared to the rest of Latin\nAmerica, but it was artificially buoyed by private consumption and public-\nsector spending.\n\nMainstay agricultural jobs became scarcer in the late 1970s. Coffee harvests\nand plantings in border area decreased because fighting in neighboring\nNicaragua and El Salvador spilled over into Honduras. Other factors\ncontributing to the job scarcity were limited land, a reluctance on the part\nof coffee growers to invest while wars destabilized the region, and a lack of\ncredit. Small farmers became increasingly unable to support themselves as\ntheir parcels of land diminished in size and productivity.\n\nProblems in the agricultural sector have fueled urbanization. The Honduran\npopulation was 77 percent rural in 1960. By 1992 only 55 percent of the\nHonduran population continued to live in rural areas. Peasants (campesinos)\nflocked to the cities in search of work but found little there. Overall\nunemployment has been exacerbated by an influx of refugees from the wars in\nneighboring countries, attracted to Honduras, ironically, by its relatively\nlow population density and relative peace. In the agricultural sector (which\nin 1993 still accounted for about 60 percent of the labor force), unemployment\nhas been estimated to be far worse than the figures for the total labor force.\n\nHonduran urban employment in the early 1990s has been characterized by\nunderemployment and marginal informal-sector jobs, as thousands of former\nagricultural workers and refugees have moved to the cities seeking better\nlives. Few new jobs have been generated in the formal sector, however, because\nthe domestic private sector and foreign investments have dropped and coveted\npublic-sector jobs have been reserved mostly for the small Honduran middle-\nclass with political or military connections. Only one of ten Honduran workers\nwere securely employed in the formal sector in 1991.\n\nIn the mid-1980s, the World Bank reported that only 10,000 new jobs were\ncreated annually; the low rate of job creation resulted in 20,000 people being\nadded to the ranks of the unemployed every year. The actual disparity between\njobs needed for full employment and new jobs created exceeded that projection,\nhowever. For those with jobs, the buying power of their wages tumbled\nthroughout the 1980s while the cost of basic goods, especially food, climbed\nprecipitously.",
    "openai_summarised_points": [
      "• Between 1980 and 1983, the unemployment rate in Honduras was 20 percent, which was double the rate of the late 1970s, indicating a significant increase in joblessness during this period.",
      "• Throughout the 1980s, job creation in Honduras remained substantially below the growth of the labor force, contributing to persistent unemployment issues.",
      "• By 1985, the unemployment rate had risen to 25 percent, reflecting ongoing deterioration in employment opportunities.",
      "• In 1989, combined unemployment and underemployment in Honduras reached 40 percent, illustrating that nearly half of the labor force was either unemployed or not fully employed.",
      "• By 1993, it was estimated that between 50 and 60 percent of the Honduran labor force was either underemployed or unemployed, indicating a severe employment crisis.",
      "• During the 1980s, the Honduran government’s reliance on foreign aid, instead of fostering private investment-driven economic growth, led to neglect of job creation initiatives.",
      "• Honduras’s GDP experienced reasonable growth throughout most of the 1980s, especially relative to Latin America, but this growth was artificially sustained by private consumption and public-sector spending rather than genuine economic expansion.",
      "• The agricultural sector, which was a mainstay of employment, saw a decline in jobs in the late 1970s due to decreased coffee harvests and plantings in border areas, influenced by spillover conflicts from Nicaragua and El Salvador.",
      "• Contributing factors to agricultural job scarcity included limited land availability, farmers’ reluctance to invest amid regional wars, and a lack of credit facilities.",
      "• Small farmers faced increasing difficulties supporting themselves as their landholdings diminished in size and productivity, exacerbating rural poverty.",
      "• Rural-to-urban migration increased as problems in agriculture drove peasants (campesinos) to cities in search of work, although urban job prospects remained limited.",
      "• The rural population declined from 77 percent in 1960 to 55 percent in 1992, reflecting significant urbanization driven by agricultural decline and rural impoverishment.",
      "• The influx of refugees from neighboring countries’ wars, attracted by Honduras’s relatively low population density and peace, further worsened urban unemployment conditions.",
      "• In 1993, unemployment in the agricultural sector, which employed about 60 percent of the labor force, was estimated to be significantly worse than official figures for the total labor force.",
      "• Urban employment in the early 1990s was characterized by high levels of underemployment and reliance on marginal informal-sector jobs, as many former rural workers and refugees moved to cities seeking better opportunities.",
      "• Few new jobs were created in the formal sector due to declining domestic private investment, reduced foreign investment, and public-sector jobs being reserved mainly for the small middle class with political or military connections.",
      "• In 1991, only one in ten Honduran workers was securely employed in the formal sector, highlighting widespread job insecurity.",
      "• The World Bank reported in the mid-1980s that Honduras created only about 10,000 new jobs annually, which was insufficient to absorb the 20,000 people entering unemployment each year.",
      "• The gap between the number of jobs needed for full employment and the actual number of new jobs created exceeded the World Bank’s projections, indicating a worsening employment deficit.",
      "• Wages for employed individuals declined throughout the 1980s, reducing their purchasing power, while the prices of basic goods, especially food, increased sharply, further straining households."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:12.999727",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3057,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Role of government",
    "text": "Throughout the 1960s and most of the 1970s, the military-led governments of\nHonduras ran a state-sponsored and state-financed economy. The governments\nprovided most guarantees for loans to a strong but patronage-dominated and\nsomewhat corrupt public sector that included recipients of graft extracted\nfrom foreign and domestic investors, and to costly state-developed\nenterprises. By 1989 and the election of president Rafael Leonardo Callejas\nRomero, however, a heavy toll had been taken by regionwide economic recession,\ncivil war in neighboring countries, the drying up of most external credit, and\ncapital flight equaling more than $1.5 billion.\n\nPresident Callejas shifted the Honduran economy towards privatization\n\nCallejas began to shift economic policy toward privatizing government-owned\nenterprises, liberalizing trade and tariff regulations, and encouraging\nincreased foreign investment through tax and other incentives. The Callejas\nadministration did not seek less government control. Rather it changed the\ngovernment's objectives by focusing on reducing public-sector spending, the\nsize of the public-sector workforce, and the trade deficit. Overall economic\nplanning became the responsibility of the National Superior Planning Council,\ndirected by the minister of economy and commerce. President Callejas, a US-\ntrained economist, brought new professionalism and technical skills to the\ncentral government as he began the arduous task of long-term economic reform.\n\nThe official exchange rate of the lempira, pegged at US$1=L2 since 1918, was\ndramatically devalued in 1990. Exchange controls had been introduced in 1982,\nresulting in a parallel currency market (black market) and several confusing\nofficial exchange rates operating simultaneously. Some of those rates were\nlegally recognized in 1990 when President Callejas introduced a major series\nof economic policy reforms, which included reducing the maximum import tariff\nrate from 90 to 40 percent and getting rid of most surcharges and exemptions.\n\nThe value of the lempira was adjusted to US$1=L4, with the exception of the\nrate for debt equity conversions, which remained at the old rate of US$1=L2.\nThe official conversion rate of the lempira fell to US$1=L7.26 in December\n1993. The president also introduced temporary taxes on exports, which were\nintended to increase central government revenue. Additional price and trade\nliberalization measures and fewer government regulations became part of his\nongoing reforms.",
    "openai_summarised_points": [
      "• Throughout the 1960s and most of the 1970s, Honduras was governed by military-led administrations that managed a state-sponsored and state-financed economy.",
      "• These governments provided most guarantees for loans to a public sector characterized by patronage, corruption, and graft, which was extracted from both foreign and domestic investors.",
      "• The public sector included recipients of graft and supported costly state-developed enterprises.",
      "• By 1989, Honduras faced significant economic challenges due to a regional recession, civil wars in neighboring countries, the cessation of most external credit, and capital flight exceeding $1.5 billion.",
      "• The election of President Rafael Leonardo Callejas Romero in 1989 marked a shift in economic policy towards privatization.",
      "• President Callejas initiated reforms that focused on privatizing government-owned enterprises, liberalizing trade and tariff regulations, and encouraging foreign investment through tax incentives and other measures.",
      "• Despite these reforms, the Callejas administration did not aim to reduce government control but sought to reduce public-sector spending, decrease the size of the public-sector workforce, and lower the trade deficit.",
      "• Overall economic planning was centralized under the National Superior Planning Council, which was directed by the Minister of Economy and Commerce.",
      "• President Callejas, a U.S.-trained economist, brought professionalism and technical expertise to the government to facilitate long-term economic reforms.",
      "• The official exchange rate of the lempira had been pegged at US$1 = L2 since 1918 but was dramatically devalued in 1990.",
      "• Exchange controls introduced in 1982 led to the emergence of a parallel (black) currency market and multiple official exchange rates operating simultaneously.",
      "• In 1990, President Callejas implemented major economic reforms, including reducing the maximum import tariff from 90% to 40%, and eliminating most surcharges and exemptions.",
      "• During these reforms, the lempira's value was adjusted to US$1 = L4, except for debt equity conversions, which remained at US$1 = L2.",
      "• The official exchange rate of the lempira fell to US$1 = L7.26 in December 1993.",
      "• President Callejas also introduced temporary export taxes aimed at increasing central government revenue.",
      "• Additional liberalization measures included further price and trade deregulation and a reduction in government regulations as part of ongoing reforms."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:25.900034",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2494,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Budget",
    "text": "Throughout the 1980s, the Honduran government was heavily financed by foreign\nassistance. External financing—mostly bilateral credit from the United\nStates—rose dramatically until it reached 87 percent of the public deficit in\n1985, rising even further in subsequent years. By 1991 the public-sector\ndeficit was entirely financed with net external credit. That financing\npermitted the government to reduce the demand for internal credit and,\ntherefore, to maintain its established exchange rate.\n\nIn 1991 Callejas managed to give the appearance of having reduced the overall\nfiscal deficit, a requirement for new credit. But the deficit decrease was\nmostly an accounting device because it resulted from the postponement of\nexternal payments to the Paris Club debtors and eventually would be offset by\npressure to raise public investment. During 1991, loan negotiations with\nmultilateral and bilateral lending institutions brought Honduras $39.5 million\nin United States development assistance, $70 million in balance-of-payments\nassistance in the form of cash grants, and $18.8 million in food aid.\n\nHonduras country also negotiated $302.4 million in concessional loans from the\nmultilateral lending institutions. Total outstanding external debt as a\npercentage of GDP fell from 119 percent in 1990 to 114 percent in 1991 and to\n112 percent in 1993. This drop was largely the result of debt forgiveness of\n$448.4 million by the United States, Switzerland, and the Netherlands.\nScheduled amortization payments of an average $223.2 million per year,\nhowever, guaranteed that Honduras's gross funding requirements would remain\nlarge indefinitely.\n\nThe government of Honduras projected that overall tax revenues would increase\nfrom 13.2 percent of GDP in 1989 to about 15.7 percent in 1991. Adjustments\nfor low coffee prices and the continuation of lax collection methods, however,\nundermined those goals. Despite these tax increases, compared to developed\ncountries, Honduras has low tax rates with, particularly low property taxes.",
    "openai_summarised_points": [
      "• Throughout the 1980s, the Honduran government was heavily financed by foreign assistance, with external financing primarily consisting of bilateral credit from the United States.",
      "• External financing increased dramatically during this period, reaching 87 percent of the public deficit in 1985 and continuing to rise in subsequent years.",
      "• By 1991, the entire public-sector deficit was financed through net external credit, enabling the government to reduce reliance on internal credit and maintain its established exchange rate.",
      "• In 1991, President Callejas appeared to have reduced the overall fiscal deficit, a prerequisite for obtaining new credit; however, this reduction was mainly an accounting maneuver resulting from the postponement of external payments to Paris Club debtors.",
      "• The apparent deficit reduction in 1991 was expected to be offset by increased pressure to raise public investment in the future.",
      "• During 1991, Honduras negotiated with multilateral and bilateral lending institutions, securing $39.5 million in United States development assistance, $70 million in balance-of-payments assistance in the form of cash grants, and $18.8 million in food aid.",
      "• Honduras also negotiated $302.4 million in concessional loans from multilateral lending institutions.",
      "• The total external debt as a percentage of GDP decreased from 119 percent in 1990 to 114 percent in 1991, and further to 112 percent in 1993, largely due to debt forgiveness totaling $448.4 million by the United States, Switzerland, and the Netherlands.",
      "• Despite debt forgiveness, scheduled amortization payments averaged $223.2 million annually, ensuring that Honduras's gross funding requirements would remain substantial indefinitely.",
      "• The Honduran government projected that overall tax revenues would rise from 13.2 percent of GDP in 1989 to approximately 15.7 percent in 1991.",
      "• These tax revenue goals were undermined by low coffee prices and continued lax collection methods.",
      "• Compared to developed countries, Honduras maintained low tax rates, especially with regard to property taxes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:39.316925",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2029,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Labor force",
    "text": "Honduras suffers from an overabundance of unskilled and uneducated laborers.\nMost Honduran workers in 1993 continued to be employed in agriculture, which\naccounted for about 60 percent of the labor force. More than half of the rural\npopulation, moreover, remains landless and heavily dependent on diminishing\nseasonal labor and low wages. Fifty-five percent of the farming population\nsubsists on less than two hectares and earns less than $70 per capita per year\nfrom those plots, mostly by growing subsistence food crops.\n\nIn 1993 only about 9–13 percent of the Honduran labor force was engaged in the\ncountry's tiny manufacturing sector—one of the smallest in Central America.\nSkilled laborers are scarce. Only 25,000 people per year, of which about 21\npercent are industrial workers, graduate yearly from the National Institute of\nProfessional Training (Instituto Nacional de Formación Profesional-INFOP)\nestablished in 1972.\n\nHundreds of small manufacturing firms, the traditional backbone of Honduran\nenterprise, began to go out of business beginning in the early 1990s, as\nimport costs rose and competition through increasing wages for skilled labor\nfrom the mostly Asian-owned assembly industries strengthened. The small\nHonduran shops, most of which had manufactured clothing or food products for\nthe domestic market, traditionally received little support in the form of\ncredit from the government or the private sector and were more like artisans\nthan conventional manufacturers. Asian-owned export assembly firms\n(maquiladoras), operating mostly in free zones established by the government\non the Caribbean coast, attract thousands of job seekers and swell the\npopulations of new city centers such as San Pedro Sula, Tela, and La Ceiba.\nThose firms employ approximately 16,000 workers in 1991.\n\nAbout one-third of the Honduran labor force was estimated to be working in the\nservice or \"other\" sector in 1993. That classification usually means that a\nperson ekes out a precarious livelihood in the urban informal sector or as a\npoorly paid domestic. As unemployment soared throughout Central America in the\n1980s, more and more people were forced to rely on their own ingenuity in\norder to simply exist on the fringes of Honduran society.\n\nAs for the informal sector, research has shown that evidence of child labor\nhas been observed mostly in the Honduran agricultural sector. In 2014, the\nU.S. Department of Labor's _List of Goods Produced by Child Labor or Forced\nLabor_ cites three goods produced in such working conditions in Honduras;\nnamely coffee, lobsters and melons.",
    "openai_summarised_points": [
      "• Honduras faces a significant surplus of unskilled and uneducated laborers, impacting overall economic productivity and development.",
      "• In 1993, the majority of Honduran workers remained employed in agriculture, which constituted approximately 60 percent of the country's labor force.",
      "• Over half of the rural population in Honduras was landless, heavily reliant on seasonal labor and earning low wages, with many subsisting on less than two hectares of land.",
      "• Approximately 55 percent of the rural farming population survived on less than two hectares and earned less than $70 per capita annually from these plots, primarily through growing subsistence food crops.",
      "• In 1993, only about 9–13 percent of the Honduran labor force was employed in the manufacturing sector, which was one of the smallest in Central America.",
      "• Skilled labor was scarce in Honduras; only about 25,000 individuals graduated annually from the National Institute of Professional Training (Instituto Nacional de Formación Profesional - INFOP), established in 1972, with roughly 21 percent of these graduates being industrial workers.",
      "• The small manufacturing firms, traditionally the backbone of Honduran enterprise, began to decline in the early 1990s due to rising import costs and increased wages in assembly industries, especially those owned by Asian firms.",
      "• Most small Honduran manufacturing shops, which mainly produced clothing or food for the domestic market, operated with minimal government or private sector credit support and resembled artisans more than formal manufacturers.",
      "• Asian-owned export assembly firms, or maquiladoras, primarily located in free zones on the Caribbean coast, employed about 16,000 workers in 1991 and attracted thousands of job seekers, contributing to urban growth in cities such as San Pedro Sula, Tela, and La Ceiba.",
      "• Approximately one-third of the Honduran labor force was engaged in the service or \"other\" sector in 1993, a category often associated with precarious urban informal employment or low-paid domestic work.",
      "• During the 1980s, as unemployment increased across Central America, more Hondurans relied on their ingenuity and informal sector activities to survive on the margins of society.",
      "• Child labor has been predominantly observed in the agricultural sector of Honduras, with evidence documented by research and reports.",
      "• The U.S. Department of Labor’s 2014 _List of Goods Produced by Child Labor or Forced Labor_ identified three goods produced under such conditions in Honduras: coffee, lobsters, and melons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:44.335338",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2585,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Employment indicators and benefits",
    "text": "Honduran governments have set minimum wages since 1974, but enforcement has\ngenerally been lax. That laxity increased at the beginning of the 1980s.\nTraditionally, most Honduran workers have not been covered by social security,\nwelfare, or minimum wages. Multinational companies usually paid more than the\nstandard minimum wage, but, overall, the Honduran wage earner has experienced\na diminution of real wages and purchasing ability for more than a decade. When\nthey occurred, minimum wage adjustments generally did not keep up with the\ncost of living increases.\n\nAfter a major currency devaluation in 1990, average Honduran workers were\namong the most poorly paid workers in the Western Hemisphere. By contrast, the\nbanana companies paid relatively high wages as early as the 1970s. Banana\nworkers continued at the top of the wage scale in the 1990s; however, in the\n1980s, as banana production became less labor-intensive, the companies had\ndecreased their investment and workforce. Consequently, fewer workers were\nemployed as relatively well-paid agricultural wage earners with related\nbenefits.\n\nPresident Callejas responded to the severe poverty by implementing a specially\nfinanced Honduran Social Investment Fund (Fondo Hondureño de Inversión\nSocial—FHIS) in 1990. The fund created public works programs such as road\nmaintenance and provided United States surplus food to mothers and infants.\nMany Hondurans slipped through that fragile social safety net. As a continuing\npart of the social pact, and even more as the result of a fierce union-\ngovernment battle, President Callejas announced in 1991 a 27.8 percent\nincrease over a minimum wage that the government had earlier agreed upon. That\nincrease was in addition to raises of 50 and 22 percent set, respectively, in\nJanuary and September 1990. Despite those concessions, the minimum daily rate\nin 1991 was only $1.75 for workers employed by small agricultural enterprises\nand $3.15 for workers in the big exporting concerns; most workers did not earn\nthe minimum wage.",
    "openai_summarised_points": [
      "• Since 1974, Honduran governments have established minimum wages; however, enforcement has generally been weak, with laxity increasing notably at the beginning of the 1980s.",
      "• Historically, most Honduran workers have not been covered by social security, welfare programs, or minimum wage protections.",
      "• Multinational companies in Honduras typically paid wages exceeding the official minimum wage, yet overall, Honduran wage earners have experienced a decline in real wages and purchasing power for over a decade.",
      "• When minimum wage adjustments occurred, they generally failed to keep pace with increases in the cost of living.",
      "• Following a significant currency devaluation in 1990, average Honduran workers became among the lowest-paid in the Western Hemisphere.",
      "• In contrast, banana companies paid relatively high wages starting as early as the 1970s, maintaining top-tier wages in the 1990s; however, during the 1980s, as banana production became less labor-intensive, these companies reduced their investments and workforce.",
      "• As a result, fewer workers were employed as well-paid agricultural wage earners with associated benefits.",
      "• President Callejas responded to widespread poverty by establishing the Honduran Social Investment Fund (Fondo Hondureño de Inversión Social—FHIS) in 1990, which financed public works projects such as road maintenance and distributed surplus U.S. food to mothers and infants.",
      "• Despite these efforts, many Hondurans remained outside the reach of this fragile social safety net.",
      "• As part of ongoing social negotiations and following intense union-government conflicts, President Callejas announced in 1991 a 27.8 percent increase in the minimum wage, supplementing previous raises of 50 percent in January and 22 percent in September 1990.",
      "• Despite these wage increases, the minimum daily rate in 1991 was only $1.75 for workers employed by small agricultural enterprises and $3.15 for workers in large exporting companies; most workers did not earn the official minimum wage."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:25:52.015509",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2033,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Labor unions",
    "text": "Honduras has long been heavily unionized. In 1993 approximately 15 to 20\npercent of the overall formal workforce was represented by some type of union,\nand about 40 percent of urban workers were union members. There were forty-\neight strikes in the public sector alone in 1990, protesting the government's\neconomic austerity program and layoffs of public-sector workers. More than\n4,000 public-sector employees from the Ministry of Communications, Public\nWorks, and Transport were fired in 1990. About 70,000 unionized workers\nremained in the faltering public sector at the beginning of 1991. However, the\ngovernment largely made good its pledge to trim that number by 8,000 to 10,000\nthroughout 1991 as part of its austerity program.\n\nIn the private sector, 1990 saw 94 strikes in 64 firms, as workers fought for\nwage increases to combat inflation. A forty-two-day strike at the Tela\nRailroad Company (owned by Chiquita Brands International—formerly United\nBrands and United Fruit Company) was unsuccessful, however, and that defeat\ntemporarily ended union efforts at direct confrontation.\n\nIn 1993 Honduras had three major labor confederations: the Confederation of\nHonduran Workers (Confederación de Trabajadores de Honduras—CTH), claiming a\nmembership of about 160,000 workers; the General Workers Central (Central\nGeneral de Trabajadores—CGT), claiming to represent 120,000 members; and the\nUnitary Confederation of Honduran Workers (Confederación Unitaria de\nTrabajadores de Honduras—CUTH), a new confederation formed in May 1992, with\nan estimated membership of about 30,000. The three confederations included\nnumerous trade union federations, individual unions, and peasant\norganizations.\n\nThe CTH, the nation's largest trade confederation, was formed in 1964 by the\nnation's largest peasant organization, the National Association of Honduran\nPeasants (Asociación Nacional de Campesinos de Honduras—Anach), and by\nHonduran unions affiliated with the Inter-American Regional Organization of\nWorkers (Organización Regional Interamericana de Trabajadores—ORIT), a\nhemispheric labor organization with close ties to the American Federation of\nLabor-Congress of Industrial Organizations (AFL-CIO).\n\nIn the early 1990s, the confederation had three major components: the\n45,000-member Federation of Unions of National Workers of Honduras (Federación\nSindical de Trabajadores Nacionales de Honduras—Fesitranh); the 22,000 member\nCentral Federation of Honduran Free Trade Unions (Federación Central de\nSindicatos Libres de Honduras); and the 2,200-member Federation of National\nMaritime Unions of Honduras (Federación de Sindicales Marítimas Nacionales de\nHonduras). In addition, Anach, claiming to represent between 60,000 and 80,000\nmembers, was affiliated with Fesitranh.\n\nFesitranh was by far the country's most powerful labor federation, with most\nof its unions located in San Pedro Sula and the Puerto Cortés Free Zone. The\nunions of the United States-owned banana companies and the United States-owned\npetroleum refinery also were affiliated with Fesitranh. The CTH received\nsupport from foreign labor organizations, including ORIT, the American\nInstitute for Free Labor Development (AIFLD), and Germany's Friedrich Ebert\nFoundation and was an affiliate of the International Confederation of Free\nTrade Unions (ICFTU).\n\nAlthough it was not legally recognized until 1982, the CGT was originally\nformed in 1970 by the Christian Democrats and received external support from\nthe World Confederation of Labour (WCL) and the Latin American Workers Central\n(Central Latinoamericana de Trabajadores—CLAT), a regional organization\nsupported by Christian Democratic parties. In the late 1980s and early 1990s,\nhowever, the CGT leadership developed close ties to the National Party of\nHonduras (Partido Nacional de Honduras—PNH), and several leaders served in the\nCallejas government. Another national peasant organization, the National Union\nof Peasants (Unión Nacional de Campesinos—UNC), claiming a membership of\n40,000, was affiliated with the CGT for many years and was a principal force\nwithin the confederation.\n\nThe CUTH was formed in May 1992 by two principal labor federations, the\nUnitary Federation of Honduran Workers (Federación Unitaria de Trabajadores de\nHonduras—FUTH) and the Independent Federation of Honduran Workers (Federación\nIndependiente de Trabajadores de Honduras—FITH), as well as several smaller\nlabor groups, all critical of the Callejas government's neoliberal economic\nreform program.\n\nThe Marxist FUTH, with an estimated 16,000 members in the early 1990s, was\nfirst organized in 1980 by three communist-influenced unions, but did not\nreceive legal status until 1988. The federation had external ties with the\nWorld Federation of Trade Unions (WFTU), the Permanent Congress for Latin\nAmerican Workers Trade Union Unity (Congreso Permanente de Unidad Sindical de\nTrabajadores de América Latina—CPUSTAL), and the Central American Committee of\nTrade Union Unity (Comité de Unidad Sindical de Centroamérica—CUSCA). Its\naffiliations included water utility, university, electricity company, brewery,\nand teacher unions, as well as several peasant organizations, including the\nNational Central of Farm Workers (Central Nacional de Trabajadores del\nCampo—CNTC), formed in 1985 and active in land occupations in the early 1980s.\n\nFUTH also became affiliated with a number of leftist popular organizations in\na group known as the Coordinating Committee of Popular Organizations (Comité\nCoordinadora de las Organizaciones Populares—CCOP) that was formed in 1984.\nDissident FUTH member formed the FITH, which was granted legal status in 1988.\nThe FITH consisted of fourteen unions claiming about 13,000 members in the\nearly 1990s.",
    "openai_summarised_points": [
      "• Honduras has historically exhibited a high level of unionization, with approximately 15 to 20 percent of the overall formal workforce represented by unions in 1993, and about 40 percent of urban workers being union members.",
      "• In 1990, there were forty-eight strikes in the public sector alone, primarily protesting the government's economic austerity measures and layoffs of public-sector workers.",
      "• Over 4,000 public-sector employees from the Ministry of Communications, Public Works, and Transport were dismissed in 1990.",
      "• At the beginning of 1991, roughly 70,000 unionized workers remained in the public sector; the government committed to reducing this number by 8,000 to 10,000 throughout 1991 as part of its austerity program.",
      "• The private sector experienced 94 strikes in 64 firms in 1990, with workers demanding wage increases to counteract inflation.",
      "• A notable 42-day strike at the Tela Railroad Company, owned by Chiquita Brands International (formerly United Brands and United Fruit Company), was unsuccessful, temporarily halting union confrontations in that sector.",
      "• In 1993, Honduras had three major labor confederations:",
      "• The Confederation of Honduran Workers (Confederación de Trabajadores de Honduras—CTH), claiming about 160,000 members.",
      "• The General Workers Central (Central General de Trabajadores—CGT), claiming approximately 120,000 members.",
      "• The Unitary Confederation of Honduran Workers (Confederación Unitaria de Trabajadores de Honduras—CUTH), formed in May 1992, with an estimated 30,000 members.",
      "• These confederations encompassed numerous trade union federations, individual unions, and peasant organizations.",
      "• The CTH, established in 1964 by the National Association of Honduran Peasants (Asociación Nacional de Campesinos de Honduras—Anach) and unions affiliated with the Inter-American Regional Organization of Workers (Organización Regional Interamericana de Trabajadores—ORIT), was the largest trade confederation.",
      "• In the early 1990s, CTH included three major components:",
      "• The Federation of Unions of National Workers of Honduras (Fesitranh) with 45,000 members.",
      "• The Central Federation of Honduran Free Trade Unions (Federación Central de Sindicatos Libres de Honduras) with 22,000 members.",
      "• The Federation of National Maritime Unions of Honduras (Federación de Sindicales Marítimas Nacionales de Honduras) with 2,200 members.",
      "• Anach, claiming between 60,000 and 80,000 members, was affiliated with Fesitranh.",
      "• Fesitranh was the most influential labor federation, with most unions located in San Pedro Sula and the Puerto Cortés Free Zone, including unions affiliated with U.S.-owned banana companies and petroleum refineries.",
      "• The CTH received support from foreign labor organizations such as ORIT, the American Institute for Free Labor Development (AIFLD), and Germany's Friedrich Ebert Foundation, and was affiliated with the International Confederation of Free Trade Unions (ICFTU).",
      "• The CGT, formed in 1970 by Christian Democrats and not legally recognized until 1982, initially received support from the World Confederation of Labour (WCL) and the Latin American Workers Central (CLAT).",
      "• By the late 1980s and early 1990s, CGT leadership developed close ties to the National Party of Honduras (Partido Nacional de Honduras—PNH), with several leaders serving in the Callejas government.",
      "• The National Union of Peasants (Unión Nacional de Campesinos—UNC), with about 40,000 members, was affiliated with the CGT for many years and was a significant force within the confederation.",
      "• The CUTH was established in May 1992 by two main federations:",
      "• The Unitary Federation of Honduran Workers (FUTH).",
      "• The Independent Federation of Honduran Workers (FITH).",
      "• Several smaller labor groups, all opposing the Callejas government's neoliberal reforms.",
      "• The Marxist FUTH, with approximately 16,000 members in the early 1990s, was organized in 1980 by three communist-influenced unions and gained legal status in 1988.",
      "• FUTH maintained external affiliations with the World Federation of Trade Unions (WFTU), the Permanent Congress for Latin American Workers Trade Union Unity (CPUSTAL), and the Central American Committee of Trade Union Unity (CUSCA).",
      "• Its affiliates included unions in water utilities, universities, electricity, breweries, and teachers, as well as peasant organizations like the National Central of Farm Workers (CNTC), active in land occupations during the early 1980s.",
      "• FUTH also affiliated with leftist popular organizations through the Coordinating Committee of Popular Organizations (CCOP), formed in 1984.",
      "• Dissident members of FUTH formed FITH, which was granted legal status in 1988, comprising about 14 unions and roughly 13,000 members in the early 1990s."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:06.044925",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5744,
      "bullet_points_count": 31
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Agriculture and land use",
    "text": "Bananas are one of Honduras' main exports.\n\nIn 2018, Honduras produced 5.5 million tons of sugar cane, 2.5 million tons of\npalm oil, 771 thousand tons of banana and 481 thousand tons of coffee, these\nbeing its main crops. In addition, it produced 704 thousand tons of maize, 261\nthousand tons of orange, 293 thousand tons of melon, 127 thousand tons of\nbeans and 81 thousand tons of pineapple, in addition to smaller yields of\nother agricultural products such as watermelon, potato, tomato, cabbage,\ngrapefruit, sorghum etc.\n\nThe total land area of Honduras is 11.2 million hectares, of which a scant 1.7\nmillion hectares (about 15 percent) are well suited for agriculture. Most land\nin Honduras is covered by mountains, giving rise to the country's nickname,\n\"the Tibet of Central America.\" Nevertheless, the Honduran economy has always\ndepended almost exclusively on agriculture, and in 1992 agriculture was still\nthe largest sector of the economy, contributing 28 percent to the GDP.\n\nLess than half of Honduras's cultivable land was planted with crops as\nrecently as the mid-1980s. The rest was used for pastures or was forested and\nwas owned by the government or the banana corporations. Potential for\nadditional productivity from fallow land was questionable, however, because\nmuch of Honduras's soil lacks the thick volcanic ash found elsewhere in\nCentral America. By 1987 about 750,000 hectares of Honduran land had been\nseriously eroded as a result of misuse by cattle ranchers and slash-and-burn\nsquatters who planted unsuitable food crops.\n\nThe Honduran government and two banana companies—Chiquita Brands International\nand Dole Food Company—owned approximately 60 percent of Honduras's cultivable\nland in 1993. The banana companies acquired most of their landholdings in the\nearly 20th century in return for building the railroads used to transport\nbananas from the interior to the coast. Much of their land remained unused\nbecause it lacked irrigation. Only about 14 percent of cultivated land was\nirrigated in 1987. Most land under cultivation in 1992 was planted in bananas,\ncoffee, and specialized export crops such as melons and winter vegetables.",
    "openai_summarised_points": [
      "• Bananas are one of Honduras' main exports, highlighting their significance in the country's agricultural economy.",
      "• In 2018, Honduras produced the following key agricultural commodities: 5.5 million tons of sugar cane, 2.5 million tons of palm oil, 771 thousand tons of bananas, and 481 thousand tons of coffee.",
      "• Additional notable crops produced in 2018 include 704 thousand tons of maize, 261 thousand tons of oranges, 293 thousand tons of melons, 127 thousand tons of beans, and 81 thousand tons of pineapples.",
      "• Smaller yields were recorded for other agricultural products such as watermelon, potatoes, tomatoes, cabbage, grapefruit, and sorghum.",
      "• The total land area of Honduras is approximately 11.2 million hectares, with only about 1.7 million hectares (roughly 15 percent) being well suited for agriculture.",
      "• The majority of Honduras's land is mountainous, earning the country the nickname \"the Tibet of Central America.\"",
      "• Despite geographic challenges, agriculture has historically been the backbone of the Honduran economy, which in 1992 contributed 28 percent to the GDP, making it the largest economic sector at that time.",
      "• As of the mid-1980s, less than half of Honduras's cultivable land was actively planted with crops; the remaining land was used for pastures or was forested, with ownership often held by the government or banana corporations.",
      "• The potential for increasing productivity on fallow land was limited due to the lack of volcanic ash in soil, which is a common fertility enhancer elsewhere in Central America.",
      "• By 1987, approximately 750,000 hectares of land had experienced serious erosion caused by cattle ranching practices and slash-and-burn methods employed by squatters planting unsuitable food crops.",
      "• In 1993, the Honduran government and two major banana companies—Chiquita Brands International and Dole Food Company—owned about 60 percent of Honduras's cultivable land.",
      "• These banana companies acquired most of their land in the early 20th century as compensation for building railroads used to transport bananas from the interior regions to the coast.",
      "• A significant portion of the land owned by these companies remained unused due to lack of irrigation infrastructure.",
      "• In 1987, only about 14 percent of cultivated land was irrigated.",
      "• By 1992, most cultivated land was dedicated to bananas, coffee, and specialized export crops such as melons and winter vegetables."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:10.549052",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2164,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Agricultural policy",
    "text": "The agricultural sector's output showed little or no growth between 1970 and\n1985. As a result of favorable weather and market conditions beginning in\n1995, however, the agricultural sector grew at a rate of 2.6 percent annually,\nslightly above the average for Latin America during that period. Production of\nbasic grains and coffee increased; the export price of bananas was high; and\npork, poultry, and milk produced for the domestic market increased.\nNontraditional fruits and vegetables also increased in value.\n\nHonduran agricultural production overall has tended to be low because the\namount of crop yielded by a given amount of land has been low. For example,\nHonduran chocolate yields historically have been only about half those of\nCosta Rica. Instead of using improved techniques to increase the productivity\nof the land, Honduran farmers have merely expanded the hectarage under\ncultivation to produce more crops—pushing their fields ever farther into the\nforests. Given the limited amount of good quality agricultural land, to begin\nwith, that policy has resulted in continual deforestation and subsequent\nerosion. This reluctance to improve techniques, coupled with generally poor\nsoil, a lack of credit, and poor infrastructure, has contributed to low\nproduction figures.",
    "openai_summarised_points": [
      "• The agricultural sector's output in Honduras experienced little or no growth between 1970 and 1985.",
      "• Starting in 1995, the sector benefited from favorable weather and market conditions, leading to an annual growth rate of 2.6 percent, which was slightly above the Latin American average during that period.",
      "• During this period, production of basic grains and coffee increased significantly.",
      "• The export price of bananas remained high, contributing positively to the sector's growth.",
      "• Domestic production of pork, poultry, and milk also increased, supporting local consumption.",
      "• The value of nontraditional fruits and vegetables produced in Honduras experienced growth.",
      "• Overall, Honduran agricultural production has been relatively low due to low crop yields per unit of land.",
      "• Historically, Honduran chocolate yields have been approximately half those of Costa Rica, exemplifying low productivity.",
      "• Honduran farmers have primarily expanded cultivated land area rather than adopting improved techniques to increase productivity.",
      "• This expansion has led to the encroachment into forests, causing deforestation and subsequent soil erosion.",
      "• The reluctance to adopt modern agricultural techniques, combined with poor soil quality, has hindered productivity.",
      "• Additional factors contributing to low production include limited access to credit and inadequate infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:23.245405",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1285,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Land reform",
    "text": "The Honduran government nominally began to address inequitable land ownership\nin the early 1960s. Those efforts at reform focused on organizing rural\ncooperatives. About 1,500 hectares of government-owned land were distributed\nby the National Agrarian Institute (Instituto Nacional Agrario—INA) beginning\nin 1960.\n\nA military coup in 1963 resulted in an end to the land reform program. Lacking\neven modest government-directed land reforms, squatting became the primary\nmeans for poor people to gain land throughout the early 1970s. These actions\nspurred the government to institute new agrarian reforms in 1972 and 1975.\nAlthough all lands planted in export crops were exempted from reform, about\n120,000 hectares were, nevertheless, divided among 35,000 poor families.\n\nBy 1975 the pendulum had swung back, and agrarian reform was all but halted.\nFrom 1975 through the 1980s, illegal occupations of unused land increased once\nagain. The need for land reform was addressed mostly by laws directed at\ngranting titles to squatters and other landholders, permitting them to sell\ntheir land or to use it as collateral for loans.\n\nDespite declarations by the Callejas government in 1989 of its intent to\nincreasingly address social issues, including land tenure and other needs of\nsmall farmers, the early 1990s were jolted by increased conflicts between\npeasants and the Honduran security forces. Agricultural credit and government\nsupport increasingly favored export crop producers at the expense of producers\nof basic food crops.\n\nThe Honduran land reform process under President Callejas between 1989 and\n1992 was directed primarily at large agricultural landowners. An agrarian\npact, signed by landowners and peasant organizations in August 1990, remained\nunderfunded and largely unimplemented. Furthermore, violence erupted as\ndischarged members of the Honduran military forcibly tried to claim land that\nhad already been awarded to the peasant organization Anach in 1976.\n\nIn May 1991, violence initiated by members of the Honduran military resulted\nin the deaths of eight farmers. To keep similar situations around the country\nfrom escalating into violence, the government promised to parcel out land\nbelonging to the National Corporation for Investment (Corporación Nacional de\nInversiones—Conadin). The government also pledged to return to peasants land\nthat had been confiscated by the Honduran military in 1983.\n\nAn Agricultural Modernization Law, passed in 1992, accelerated land titling\nand altered the structure of land cooperatives formed in the 1960s. The law\npermitted cooperative members to break up their holdings into small personal\nplots that could be sold. As a result, some small banana producers suffering\nfrom economic hard times chose to sell their land to the giant banana\nproducers. After an agreement was reached with the European Union (EU) to\nincrease Honduras's banana quota to the EU, the large banana companies were\navid for additional land for increased production to meet the anticipated new\ndemand from Europe.",
    "openai_summarised_points": [
      "• The Honduran government began nominal efforts to address inequitable land ownership in the early 1960s, primarily focusing on organizing rural cooperatives.",
      "• Starting in 1960, approximately 1,500 hectares of government-owned land were distributed by the National Agrarian Institute (Instituto Nacional Agrario—INA).",
      "• A military coup in 1963 ended the initial land reform program, halting formal government-led land redistribution initiatives.",
      "• During the early 1970s, in the absence of official reforms, squatting became the primary means for poor people to acquire land across Honduras.",
      "• In response to rising land conflicts, the government implemented new agrarian reforms in 1972 and 1975, which exempted all lands planted with export crops from redistribution.",
      "• Despite the exemption, about 120,000 hectares were redistributed among 35,000 poor families during the 1970s reforms.",
      "• By 1975, the momentum for land reform diminished significantly, and the reform process was effectively halted.",
      "• From 1975 through the 1980s, illegal occupations of unused land increased once again, reflecting ongoing land access issues.",
      "• During this period, land reform efforts mainly involved laws granting titles to squatters and landholders, allowing them to sell land or use it as collateral for loans.",
      "• In 1989, the Callejas government declared its intent to address social issues such as land tenure and support for small farmers, but tangible progress was limited.",
      "• The early 1990s saw increased conflicts between peasants and Honduran security forces, highlighting ongoing land disputes.",
      "• Agricultural credit and government support increasingly favored export crop producers over producers of basic food crops during this period.",
      "• Under President Callejas (1989–1992), the land reform process was primarily targeted at large landowners, with efforts including an agrarian pact signed in August 1990 by landowners and peasant organizations; however, this pact remained underfunded and largely unimplemented.",
      "• Violence erupted when discharged members of the Honduran military forcibly attempted to reclaim land already awarded to the peasant organization Anach in 1976.",
      "• In May 1991, violence initiated by members of the Honduran military resulted in the deaths of eight farmers.",
      "• To prevent further violence, the government pledged to parcel out land belonging to the National Corporation for Investment (Conadin) and to return land confiscated by the military in 1983 to peasants.",
      "• The 1992 Agricultural Modernization Law accelerated land titling processes and restructured land cooperatives formed in the 1960s.",
      "• The law allowed cooperative members to break up their holdings into small personal plots that could be sold, facilitating land sales and fragmentation.",
      "• As a consequence, some small banana producers facing economic hardship sold their land to large banana companies.",
      "• Following an agreement with the European Union (EU) to increase Honduras’s banana quota, major banana companies sought additional land to meet the anticipated increased demand from Europe."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:35.556672",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3043,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Traditional crops",
    "text": "Throughout the 20th century, Honduras's agriculture has been dominated first\nby bananas and then to a lesser extent by coffee and sugar. In 1992, bananas\nand coffee together accounted for 50 percent of the value of Honduran exports\nand made the biggest contribution to the economy. Total banana sales were $287\nmillion and total coffee sales amounted to $148 million. These figures are\nimpressive yet reflect production losses suffered by banana producers and the\nwithholding of coffee exports from the market in an effort to fight steep\nprice declines.\n\nAnother major blow to Honduran agriculture came from Hurricane Mitch and its\naftermath in 1998 and 1999. As of 2012 both industries are on the upswing. The\nbanana industry is dominated by Chiquita and the Dole Food Company, two\nmultinational corporations. The coffee industry, in contrast, offers better\nopportunities for small Honduran family farms to compete. Sugar has also been\nan important Honduran crop.\n\nChiquita Brands International and Dole Food Company now account for most\nHonduran banana production and exports. Honduras's traditional system of\nindependent banana producers, who, as late as the 1980s, sold their crops to\nthe international banana companies, was eroded in the 1990s. In the absence of\npolicies designed to protect independent suppliers, economically strapped\ncooperatives began to sell land to the two large corporations.\n\nAlthough Honduran banana production is dominated by multinational giants, such\nis not the case with coffee, which is grown by about 55,000 mostly small\nproducers. Coffee production in Honduras has been high despite relatively low\nindependent yields because of the large numbers of producers. Honduras, in\nfact, consistently produced more than its international quota until growers\nbegan to withhold the crop in the 1980s in an attempt to stimulate higher\nprices. Despite the efforts of the growers, coffee prices plunged on the\ninternational market from a high of more than $2.25 per kilogram in the\nmid-1970s to less than $0.45 per kilogram in the early 1990s. As a result of\nthe declining prices, coffee producers were becoming increasingly\nmarginalized. With the aid of affordable loans from foreign investors, more\nand more Honduran coffee growers are learning to produce high-value organic\ncoffee for today's economy.\n\nThe outlook for the sugar industry, which had boomed during the 1980s when\nHonduran producers were allowed to fill Nicaragua's sugar quota to the United\nStates, seemed bleak in 1993. Restoration of the sugar quota to Nicaraguan\ngrowers has been a major blow to Honduras's small independent producers, who\nhad added most of Nicaragua's quota to their own during the United States\nembargo of Nicaragua. Higher costs for imported fertilizers because of the\ndevaluation of the lempira add to the problem.\n\nHonduran producers seek relief from a relatively low official price of 25\nlempiras per kilogram of sugar by smuggling sugar across the borders to\nNicaragua and El Salvador, where the support prices are higher. Sugar growers\nwho can afford it have begun to diversify by growing pineapples and rice. Many\nindependent sugar growers, like independent banana producers, have become\nindignant over the relatively high profits shown by refiners and exporters.\nStrikes by producers at harvest time in 1991 forced the closure of the\nCholuteca refinery for a short time but had little effect on the depressed\nlong-term outlook for the industry.",
    "openai_summarised_points": [
      "• Throughout the 20th century, Honduras's agriculture was primarily dominated by bananas initially, followed by coffee and sugar to a lesser extent.",
      "• In 1992, bananas and coffee together accounted for 50 percent of the total value of Honduran exports, making these crops the largest contributors to the country's economy.",
      "• In 1992, total banana sales in Honduras amounted to $287 million, while coffee sales reached $148 million, reflecting significant economic importance.",
      "• Despite these impressive sales figures, production losses among banana producers and the withholding of coffee exports to combat steep price declines impacted overall export values.",
      "• The Honduran agriculture sector faced a major setback due to Hurricane Mitch and its aftermath in 1998 and 1999, causing extensive damage.",
      "• As of 2012, both the banana and coffee industries in Honduras were experiencing an upward recovery.",
      "• The banana industry in Honduras is dominated by multinational corporations, primarily Chiquita Brands International and Dole Food Company.",
      "• The coffee industry in Honduras offers better opportunities for small Honduran family farms to compete compared to bananas.",
      "• Sugar has historically been an important crop for Honduras, contributing to the agricultural economy.",
      "• Chiquita and Dole now control most of Honduras's banana production and exports, replacing the traditional system of independent banana producers who, until the 1980s, sold their crops directly to international banana companies.",
      "• In the 1990s, the erosion of the independent banana producer system was accelerated by the lack of policies protecting independent suppliers, leading cooperatives to sell land to large multinational corporations due to economic hardship.",
      "• Unlike bananas, the coffee industry in Honduras is characterized by approximately 55,000 small producers, who mainly operate small farms.",
      "• Despite relatively low yields per independent farm, coffee production remains high due to the large number of producers, with Honduras consistently exceeding its international coffee export quota until the 1980s.",
      "• In the 1980s, Honduran coffee growers began withholding their crop to try to increase prices, which caused international coffee prices to decline from over $2.25 per kilogram in the mid-1970s to less than $0.45 per kilogram in the early 1990s.",
      "• The decline in coffee prices marginalized many Honduran coffee producers, prompting them to seek alternative production methods.",
      "• With the help of affordable loans from foreign investors, an increasing number of Honduran coffee growers are transitioning to producing high-value organic coffee suited to the modern economy.",
      "• The sugar industry, which experienced a boom during the 1980s when Honduran producers filled Nicaragua’s sugar quota to the United States, faced a bleak outlook by 1993.",
      "• The restoration of the sugar quota to Nicaraguan growers significantly harmed Honduran small independent sugar producers, who had previously expanded their share during the U.S. embargo of Nicaragua.",
      "• Rising costs for imported fertilizers, driven by the devaluation of the lempira, further challenged the sugar industry.",
      "• Honduran sugar producers attempt to bypass low official prices (25 lempiras per kilogram) by smuggling sugar across borders into Nicaragua and El Salvador, where support prices are higher.",
      "• Some sugar growers are diversifying their crops by cultivating pineapples and rice to mitigate industry challenges.",
      "• Many independent sugar growers, similar to banana producers, are dissatisfied with the high profits reported by sugar refiners and exporters.",
      "• Strikes by sugar producers during the 1991 harvest temporarily closed the Choluteca refinery but did not significantly alter the long-term negative outlook for the sugar industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:43.112712",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3466,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Nontraditional crops",
    "text": "While the total value of export merchandise fell in 1990 and 1991 and had\nstill not recovered in 1993 to its 1989 level, the overall agricultural sector\noutput has grown somewhat because of growth in the sale of winter vegetables\nand shrimp. Nontraditional vegetables and fruit produced $23.8 million in\nexport revenue in 1990, a figure that was almost double the 1983 figure.\nNontraditional agricultural crops represented 4.8 percent of the value of\ntotal exports in 1990, compared to 2.8 percent in 1983.\n\nSome development experts argue that government protection of corn, bean, and\nrice production by small farmers is a futile effort in the long-term goal of\npoverty reduction. On the other hand, they see significant economic potential\nfor nontraditional crops, if they are handled properly. Analysts also note,\nhowever, that Honduras is at a distinct disadvantage relative to its Central\nAmerican neighbors because of its poor transportation system. Nontraditional\nexports require the ability to get fresh produce from the fields to distant\nmarkets rapidly.",
    "openai_summarised_points": [
      "• In 1990 and 1991, the total value of export merchandise from Honduras declined, and by 1993, it had not yet recovered to the 1989 level.",
      "• Despite the decline in export merchandise value, the overall agricultural sector output experienced some growth, primarily due to increased sales of winter vegetables and shrimp.",
      "• Nontraditional vegetables and fruit exports generated $23.8 million in revenue in 1990, which was nearly double the revenue reported in 1983.",
      "• In 1990, nontraditional agricultural crops accounted for 4.8 percent of Honduras's total export value, up from 2.8 percent in 1983.",
      "• Some development experts argue that government protection of small farmers' production of corn, beans, and rice is ineffective in achieving long-term poverty reduction goals.",
      "• Experts see significant economic potential in nontraditional crops if they are managed properly.",
      "• Analysts highlight that Honduras faces a distinct disadvantage compared to its Central American neighbors due to its poor transportation infrastructure.",
      "• The success of nontraditional exports depends heavily on the ability to rapidly transport fresh produce from farms to distant markets."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:47.104943",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1062,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.5",
    "section_name": "Livestock",
    "text": "In the early 1980s, the cattle industry appeared to have the potential to be\nan important part of the Honduran economy. The Honduran cattle sector,\nhowever, never developed to the extent that it did in much of the rest of\nCentral America. Cattle production grew steadily until 1980–81 but then\ndeclined sharply when profits fell because of high production costs. The small\nHonduran meat packing industry declined at the same time, and several meat\npacking plants closed. As late as 1987, livestock composed 16 percent of the\nvalue-added agricultural sector but the industry continued to decline. By\n1991–92, beef exports accounted for only 2.9 percent of the value of total\nexports.\n\nSales of refrigerated meat were the third or fourth highest source of export\nearnings in the mid-1980s, but like other Honduran agricultural products, beef\nyields were among the lowest in Central America. As world prices fell and\nproduction costs, exacerbated by drought, rose, there was less incentive to\nraise cattle. For a period of time, cattle farmers illegally smuggled beef\ncattle to Guatemala and other neighboring countries where prices were higher,\nbut the Honduran cattle sector never became competitive internationally. The\ntwo large banana companies have also owned large cattle ranches where they\nraised prime beef, but these large companies had the flexibility to change\ncrops as the market demanded.\n\nHonduran dairy herds fared about the same as beef cattle, and Honduran milk\nyields were also among the lowest in Central America. The dairy industry was\nfurther handicapped by the difficulties of trying to transport milk over poor\nroads in a tropical country, as well as by stiff competition in the domestic\nmarket from subsidized foreign imports, mostly from the United States.",
    "openai_summarised_points": [
      "• In the early 1980s, the cattle industry in Honduras was viewed as having the potential to become a significant component of the national economy.",
      "• Despite this potential, the Honduran cattle sector never achieved the level of development seen in much of the rest of Central America.",
      "• Cattle production experienced steady growth until 1980–81, after which it declined sharply due to falling profits caused by high production costs.",
      "• The decline in cattle industry profitability coincided with the contraction of the small Honduran meat packing industry, leading to the closure of several meat packing plants.",
      "• As late as 1987, livestock contributed approximately 16 percent to the value-added agricultural sector in Honduras, but the industry continued its downward trend.",
      "• By 1991–92, beef exports represented only 2.9 percent of the total value of Honduran exports, indicating a significant decrease in export importance.",
      "• During the mid-1980s, sales of refrigerated meat ranked as the third or fourth highest source of export earnings for Honduras.",
      "• Honduran beef yields were among the lowest in Central America, paralleling other agricultural products in the country.",
      "• The global decline in prices and rising production costs, worsened by drought conditions, reduced incentives for cattle raising in Honduras.",
      "• Some cattle farmers engaged in illegal smuggling of beef cattle to neighboring countries such as Guatemala, where market prices were higher.",
      "• The Honduran cattle sector was never able to establish international competitiveness despite these smuggling activities.",
      "• Two large banana companies in Honduras owned extensive cattle ranches where they raised prime beef, but these companies could adapt their crop production based on market demand.",
      "• Honduran dairy herds experienced similar challenges to beef cattle, with milk yields among the lowest in Central America.",
      "• The dairy industry was hindered by poor transportation infrastructure, making milk delivery over inadequate roads difficult in a tropical climate.",
      "• Domestic dairy production faced stiff competition from subsidized foreign imports, predominantly from the United States."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:53.556538",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1779,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.6",
    "section_name": "Fishing",
    "text": "Honduras significantly developed its shrimp industry during the 1980s and in\nthe Latin American market was second only to Ecuador in shrimp exports by\n1991. In 1992 shrimp and lobster jumped to 12 percent of export earnings.\nShrimp contributed $97 million in export sales to the economy in 1992—an\nincrease of 33 percent over the previous year. The industry was dependent,\nhowever, on larvae imported from the United States to augment its unstable\nnatural supply.\n\nTechnicians from Taiwan were contracted by large producers in 1991 to help\ndevelop laboratory larvae, but bitter feuds developed between independent\nshrimpers and the corporations. Local shrimpers charged that corporate methods\nwere damaging the environment and destroying natural stock through destruction\nof the mangrove breeding swamps. Corporate shrimp farmers then began to move\ntheir operations farther inland, leaving local shrimpers to contend with\ndiminished natural supplies on the mosquito-infested coast.",
    "openai_summarised_points": [
      "• During the 1980s, Honduras experienced significant development of its shrimp industry, establishing a prominent position in the regional market.",
      "• By 1991, Honduras was the second-largest exporter of shrimp in Latin America, surpassed only by Ecuador.",
      "• In 1992, the combined export earnings from shrimp and lobster increased to constitute 12 percent of Honduras's total export revenue.",
      "• Shrimp exports alone contributed approximately $97 million to Honduras's economy in 1992, representing a 33 percent increase compared to the previous year.",
      "• The shrimp industry relied heavily on imported larvae from the United States to supplement its naturally unstable shrimp populations.",
      "• In 1991, technicians from Taiwan were contracted by large Honduran shrimp producers to assist in developing laboratory-grown larvae.",
      "• Conflicts arose between independent shrimpers and corporate producers, leading to bitter disputes over industry practices.",
      "• Local shrimpers accused corporate methods of environmental damage, specifically citing the destruction of mangrove breeding swamps, which threatened natural shrimp stocks.",
      "• In response to environmental concerns and resource depletion, corporate shrimp farmers began relocating their operations further inland.",
      "• This inland shift left local shrimpers to face reduced natural shrimp supplies along the mosquito-infested coastal areas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:26:58.295539",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 981,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "5.7",
    "section_name": "Forestry",
    "text": "As in much of Central America, Honduras's once abundant forest resources have\nbeen badly squandered. In 1964 forests covered 6.8 million hectares, but by\n1988 forested areas had declined to 5 million hectares. Honduras continued to\nlose about 3.6 percent of its remaining forests annually during the 1980s and\nearly 1990s. The loss is attributable to several factors. Squatters have\nconsistently used land suitable only for forests to grow scantyield food\ncrops; large tracts have been cleared for cattle ranches; and the country has\ngravely mismanaged its timber resources, focusing far more effort on logging\nthan on forestry management.\n\nThe government began an intensive forestry development program in 1974,\nsupposedly intended to increase management of the sector and to prevent\nexploitation by foreign-owned firms. The Honduran Corporation for Forestry\nDevelopment (Corporación Hondureña de Desarrollo Forestal—Cohdefor) was\ncreated in 1974, but it quickly developed into a corrupt monopoly for\noverseeing forest exports. Timber was mostly produced by private sawmills\nunder contracts selectively granted by Cohdefor officials.\n\nOngoing wasteful practices and an unsustainable debt, which was contracted to\nbuild infrastructure, appear to have undercut most conservation efforts. The\nmilitary-dominated governments contracted huge debt with the multilateral\ndevelopment agencies, then extracted timber to pay for it. Cohdefor generally\ngranted licenses to private lumber companies with few demands for\npreservation, and it had little inclination or incentive to enforce the\ndemands it did make.\n\nWith encouragement from the United States Agency for International Development\n(AID), the Honduran government began to decentralize Cohdefor beginning in\n1985. Under the decentralization plan, regulatory responsibilities were\ntransferred from the central government to mayors and other municipal\nofficials on the assumption that local officials would provide better\noversight. Despite decentralization and the sale of government assets,\nCohdefor's remaining debt was $240 million in 1991. The government also\nassumed continued financial responsibility for the construction of a new\nairstrip in the area of timber extraction, upgrading facilities at Puerto\nCastilla and Puerto Lempira, and providing electricity at reduced prices to\nlumber concerns as part of the privatization package.\n\nMajor legislation was passed in 1992 to promote Honduran reforestation by\nmaking large tracts of state-owned land more accessible to private investors.\nThe legislation also supplied subsidies for development of the sector. The\nsame law provided for replanting mountainous regions of the country with pine\nto be used for fuel.",
    "openai_summarised_points": [
      "• Historically, Honduras's forest resources were once abundant but have been significantly depleted, with forests covering 6.8 million hectares in 1964 and declining to 5 million hectares by 1988.",
      "• During the 1980s and early 1990s, Honduras experienced an annual deforestation rate of approximately 3.6 percent of its remaining forests.",
      "• The primary causes of forest loss include squatters utilizing land suitable only for forests to grow low-yield food crops, large-scale clearing of land for cattle ranching, and severe mismanagement of timber resources.",
      "• The country's focus on logging activities over sustainable forestry management has contributed to the depletion of forest resources.",
      "• In 1974, the Honduran government initiated an intensive forestry development program aimed at improving sector management and preventing exploitation by foreign-owned firms.",
      "• The Honduran Corporation for Forestry Development (Corporación Hondureña de Desarrollo Forestal—Cohdefor) was established in 1974 as part of this initiative but quickly evolved into a corrupt monopoly controlling forest exports.",
      "• Timber production in Honduras was primarily carried out by private sawmills operating under contracts selectively granted by Cohdefor officials, often with little oversight.",
      "• Wasteful practices, unsustainable debt incurred for infrastructure projects, and poor conservation efforts undermined forest sustainability; much of the debt was contracted by military-dominated governments with multilateral development agencies.",
      "• The government often extracted timber to service debt obligations, with Cohdefor frequently granting licenses to private lumber companies with minimal preservation requirements and limited enforcement of regulations.",
      "• Starting in 1985, with support from the United States Agency for International Development (AID), the Honduran government began decentralizing Cohdefor's responsibilities, transferring regulatory authority to mayors and municipal officials in hopes of improved oversight.",
      "• Despite decentralization and asset sales, Cohdefor's debt remained substantial at $240 million in 1991, and the government continued to assume financial responsibilities for infrastructure projects such as building a new airstrip in timber extraction areas, upgrading facilities at Puerto Castilla and Puerto Lempira, and providing electricity at reduced rates to lumber companies as part of privatization efforts.",
      "• Major legislation enacted in 1992 aimed to promote reforestation by making large areas of state-owned land more accessible to private investors and providing subsidies for sector development.",
      "• The 1992 law also included provisions for replanting mountainous regions with pine trees to be used as fuel, supporting reforestation and sustainable resource use."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:27:03.287253",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2715,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Natural resources and energy",
    "text": "Mining, the mainstay of the Honduran economy in the late 19th century,\ndeclined dramatically in importance in the 20th century. The New York and\nHonduras Rosario Mining Company (NYHRMC) produced $60 million worth of gold\nand silver between 1882 and 1954 before discontinuing most of its operations.\n\nMining's contribution to the GDP steadily declined during the 1980s, to\naccount for a 2 percent contribution in 1992. El Mochito mine in western\nHonduras, the largest mine in Central America, accounted for most mineral\nproduction. Ores containing gold, silver, lead, zinc, and cadmium were mined\nand exported to the United States and Europe for refining.\n\nMining exports will represent 293 million dollars in 2021. The NGO Fosdeh\npoints out that mineral and hydrocarbon extraction is \"changing the geography\"\nof Honduras: with the mining concessions underway, the area earmarked for\nextraction could reach 5% of the national territory in the coming years.",
    "openai_summarised_points": [
      "• Mining was the mainstay of the Honduran economy in the late 19th century but declined dramatically in importance during the 20th century.",
      "• The New York and Honduras Rosario Mining Company (NYHRMC) produced approximately $60 million worth of gold and silver between 1882 and 1954 before discontinuing most of its operations.",
      "• During the 1980s, mining's contribution to Honduras's Gross Domestic Product (GDP) steadily declined, reaching only 2 percent by 1992.",
      "• The El Mochito mine, located in western Honduras and recognized as the largest mine in Central America, accounted for most of the country's mineral production.",
      "• Ores containing gold, silver, lead, zinc, and cadmium were mined in Honduras and exported primarily to the United States and Europe for refining.",
      "• In 2021, mining exports in Honduras were valued at approximately 293 million dollars.",
      "• The NGO Fosdeh (Foundation for Development and Humanitarian Studies) highlights that mineral and hydrocarbon extraction activities are significantly altering Honduras's geography.",
      "• Fosdeh notes that, with ongoing mining concessions, the area designated for mineral extraction could encompass up to 5% of Honduras's national territory in the coming years."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:27:32.776264",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 955,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Energy sources",
    "text": "Honduras has for many years relied on fuelwood and biomass (mostly waste\nproducts from agricultural production) to supply its energy needs. The country\nhas never been a producer of petroleum and depends on imported oil to fill\nmuch of its energy needs. In 1991 Honduras consumed about 16,000 barrels\n(2,500 m3) of oil daily. Honduras spent about $143 million, or 13 percent of\nits total export earnings, to purchase oil in 1991. The country's one small\nrefinery at Puerto Cortés closed in 1993.\n\nVarious Honduran governments have done little to encourage oil exploration,\nalthough substantial oil deposits have long been suspected in the Río Sula\nvalley and offshore along the Caribbean coast. An oil exploration consortium\nconsisting of the Venezuelan state oil company, Venezuelan Petroleum, Inc.\n(Petróleos de Venezuela S.A. or PDVSA), Cambria Oil, and Texaco expressed\ninterest in the construction of a refinery at Puerto Castilla in 1993, with\nproduction aimed at the local market.\n\nGasolineras Uno is a Honduran gas stations company that has expanded its\npresence to include stores in most of Central America and in South America.\n\nFuelwood and biomass have traditionally met about 67 percent of the country's\ntotal energy demand; petroleum, 29 percent; and electricity, 4 percent. In\n1987 Honduran households consumed approximately 60 percent of total energy\nused, transportation and agriculture used about 26 percent, and industry used\nabout 14 percent. Food processing consumed about 50 percent of industrial\nsector energy, followed by petroleum and chemical manufacturing.",
    "openai_summarised_points": [
      "• Honduras has historically relied heavily on fuelwood and biomass, primarily waste products from agricultural activities, to meet its energy needs.",
      "• The country has never been a significant producer of petroleum and depends largely on imported oil to satisfy its energy requirements.",
      "• In 1991, Honduras's daily oil consumption was approximately 16,000 barrels, equivalent to about 2,500 cubic meters.",
      "• During the same year, Honduras spent around $143 million on oil imports, which accounted for 13 percent of its total export earnings.",
      "• The nation's only small refinery, located at Puerto Cortés, was closed in 1993.",
      "• Various Honduran governments have shown limited initiative in promoting oil exploration, despite long-standing suspicions of substantial oil deposits in the Río Sula valley and offshore along the Caribbean coast.",
      "• An oil exploration consortium comprising the Venezuelan state oil company, Petróleos de Venezuela S.A. (PDVSA), along with Cambria Oil and Texaco, expressed interest in constructing a refinery at Puerto Castilla in 1993, with the goal of producing for the local market.",
      "• Gasolineras Uno is a Honduran gas station company that has expanded its operations to include stores across most of Central America and South America.",
      "• Traditionally, fuelwood and biomass have supplied about 67 percent of Honduras's total energy demand.",
      "• Petroleum accounts for approximately 29 percent of the country's energy consumption, while electricity contributes about 4 percent.",
      "• In 1987, Honduran households consumed roughly 60 percent of the total energy used in the country.",
      "• Transportation and agriculture sectors together used about 26 percent of the energy, while industry accounted for approximately 14 percent.",
      "• Within the industrial sector, food processing was the largest energy consumer, representing about 50 percent of industrial energy use, followed by petroleum and chemical manufacturing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:28:04.829711",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1582,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Electric power",
    "text": "Honduran electrification is low and uneven relative to other countries in\nLatin America. The World Bank estimates that only about 36 percent of the\nHonduran population had access to electricity (20 percent of the rural\npopulation) in 1987. The country's total capacity in 1992 was 575 megawatts\n(MW), with 2,000 megawatt-hours produced. A mammoth hydroelectric plant, the\n292-MW project at El Cajón, began producing electricity in 1985 to help\naddress the country's energy needs. The plant, however, soon became heavily\nindebted because of the government's electricity pricing policies (not\ncharging public-sector institutions, for example) and because of the\nappointment of political cronies as top management officials. El Cajón also\ndeveloped costly structural problems requiring extensive maintenance and\nrepairs.\n\nOfficials estimated that the government's decision to provide free service to\npublic-sector institutions contributed to a 23 percent increase in\npublicsector consumption in 1990. Experts estimated that additional electrical\ngeneration capacity would likely be needed to keep pace with demand. The\nHonduran Congress assumed authority for setting electric prices beginning in\n1986 but then became reluctant to increase rates. Under pressure from the\nWorld Bank, it did agree to a 60 percent increase in 1990, with additional\nincreases in 1991. To offset these increased rates for residential users, the\nNational Congress initiated a system of direct subsidies that ran through\n1992.",
    "openai_summarised_points": [
      "• Honduran electrification remains low and uneven compared to other Latin American countries, with only about 36 percent of the population having access to electricity in 1987, including just 20 percent of the rural population.",
      "• The country's total electricity generation capacity in 1992 was 575 megawatts (MW), producing approximately 2,000 megawatt-hours (MWh).",
      "• A major hydroelectric project, the 292-MW El Cajón plant, began operations in 1985 to help meet Honduras' energy needs.",
      "• The El Cajón hydroelectric plant soon accumulated significant debt due to government policies that did not charge public-sector institutions for electricity and the appointment of political cronies to top management positions.",
      "• Structural problems at El Cajón became costly, requiring extensive maintenance and repairs.",
      "• In 1990, officials estimated that the government's policy of providing free electricity to public-sector institutions contributed to a 23 percent increase in public-sector electricity consumption.",
      "• Experts projected that additional electrical generation capacity would be necessary to keep pace with rising demand.",
      "• The Honduran Congress assumed authority over setting electric prices starting in 1986 but was reluctant to increase rates.",
      "• Under pressure from the World Bank, Congress approved a 60 percent increase in electricity rates in 1990, with further rate hikes planned for 1991.",
      "• To mitigate the impact of rate increases on residential users, the government initiated a system of direct subsidies that continued through 1992."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:28:33.604417",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1499,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.3",
    "section_name": "Manufacturing",
    "text": "The country's manufacturing sector was small, contributing only 15 percent to\nthe total GDP in 1992. Textile exports, primarily to the US, led the Honduran\nmanufacturing sector. The maquiladora, or assembly industry, was a growth\nindustry in the generally bleak economy. Asian-owned firms dominated the\nsector, with twenty-one South Korean-owned companies in export processing\nzones located in the Río Sula valley in 1991.\n\nThe maquiladoras employed approximately 16,000 workers in 1991; another nine\nfirms opened in 1992. Job creation, in fact, is considered to be the primary\ncontribution of the assembly operations to the domestic economy. The export\ntextile manufacturing industry all but wiped out small, Honduran\nmanufacturers, and food processors, whose goods were historically aimed at the\ndomestic market, were also adversely affected.\n\nThe small Honduran firms could not begin to compete with the assembly industry\nfor labor because of the maquiladoras' relatively high wage scale of close to\n$4 per day. Small firms also found it increasingly difficult to meet the high\ncost of mostly imported inputs. Membership in the Honduran Association of\nSmall and Medium Industry (Asociación Hondureña de Empresas Pequeñas y\nMedianas) declined by 70 percent by 1991, compared to pre-maquiladora days,\nforeshadowing the likely demise of most of the small shops.\n\nHonduran domestic manufacturers also suffered from increased Central American\ncompetition resulting from a trade liberalization pact signed in May 1991 by\nHonduras, El Salvador, and Guatemala. Overall, the Honduran manufacturing\nsector has mimicked other sectors of the economy—it is mostly noncompetitive,\neven in a regional context, because of insufficient credit and the high cost\nof inputs. Relatively high interest rates and a complicated investment law\nhave also inhibited the foreign-dominated manufacturing sector from taking\noff.\n\nThe government-sponsored Puerto Cortés Free Zone was opened in 1976. By 1990\nan additional five free zones were in operation in Omoa, Coloma, Tela, La\nCeiba, and Amapala. A series of privately run Export Processing Zones were\nalso established in competition with the government-sponsored free zones.\nThese privately run zones offered the same standard import-export incentives\nas the government zones. Most of the government and privately run zones were\nlocated along the Caribbean coast in a newly developing industrial belt.\n\nFirms operating outside of the special \"enterprise zones\" (either privately\nrun, export-processing zones or government sponsored free zones) enjoy many of\nthe same benefits as those operating within the zones. The Honduran Temporary\nImport Law permits companies that export 100 percent of their production to\ncountries outside the CACM countries to hold ten-year exemptions on corporate\nincome taxes and duty-free import of industrial inputs.\n\nAnalysts continue to debate the actual benefits of the shift away from the\nimport-substitution industrialization (ISI) policies of the 1960s and 1970s\ntoward a new focus on free zones and assembly industries in the 1990s. Critics\npoint to the apparent lack of commitment by foreign manufactures to any one\ncountry site or to the creation of permanent infrastructure and employment.\nThey question whether new employment will be enough to offset the loss of jobs\nin the more traditional manufacturing sector. A value of $195 million to the\nHonduran economy from assembly industries in 1991—when the value of clothing\nexports was greater than that of coffee—was a compelling argument in favor of\nthe shift, however.",
    "openai_summarised_points": [
      "• In 1992, Honduras' manufacturing sector was small, contributing only 15 percent to the total GDP.",
      "• The sector was primarily driven by textile exports, mainly to the United States.",
      "• The maquiladora, or assembly industry, experienced growth despite the overall bleak economic conditions.",
      "• Asian-owned firms dominated the maquiladora sector, with twenty-one South Korean companies operating in export processing zones located in the Río Sula valley in 1991.",
      "• In 1991, maquiladoras employed approximately 16,000 workers; an additional nine firms opened in 1992.",
      "• Job creation from maquiladoras is considered the primary contribution of assembly operations to the Honduran domestic economy.",
      "• The export textile manufacturing industry nearly eliminated small Honduran manufacturers, adversely affecting their market share.",
      "• Food processors, traditionally focused on the domestic market, were also negatively impacted by the growth of assembly industries.",
      "• Small Honduran firms struggled to compete with maquiladoras due to higher wage scales, which were close to $4 per day.",
      "• Small firms faced difficulties in meeting the high costs of imported inputs, further disadvantaging them.",
      "• Membership in the Honduran Association of Small and Medium Industry (Asociación Hondureña de Empresas Pequeñas y Medianas) declined by 70 percent by 1991 compared to pre-maquiladora levels, indicating a likely decline of most small shops.",
      "• Honduran domestic manufacturers faced increased regional competition following a trade liberalization pact signed in May 1991 by Honduras, El Salvador, and Guatemala.",
      "• Overall, the Honduran manufacturing sector remained noncompetitive regionally due to insufficient credit, high input costs, high interest rates, and a complicated investment law.",
      "• The sector was hindered by the dominance of foreign firms and structural economic challenges.",
      "• The Puerto Cortés Free Zone, established in 1976, was the first government-sponsored free zone.",
      "• By 1990, five additional free zones were operational in Omoa, Coloma, Tela, La Ceiba, and Amapala.",
      "• Privately operated Export Processing Zones (EPZs) were also established, competing with government zones and offering similar import-export incentives.",
      "• Most free zones, both government and private, were located along the Caribbean coast within a developing industrial belt.",
      "• Firms outside of these special zones, whether private or government, still benefited from many of the same incentives.",
      "• The Honduran Temporary Import Law allows companies that export 100 percent of their production outside the Central American Common Market (CACM) to hold ten-year exemptions on corporate income taxes and duty-free import of industrial inputs.",
      "• Analysts debate the effectiveness of shifting from import-substitution industrialization (ISI) policies of the 1960s and 1970s toward free zones and assembly industries in the 1990s.",
      "• Critics argue that foreign manufacturers lack commitment to any specific country site or to creating permanent infrastructure and employment.",
      "• There is concern whether new employment generated by assembly industries compensates for job losses in traditional manufacturing sectors.",
      "• In 1991, assembly industries contributed $195 million to the Honduran economy, with clothing exports surpassing coffee exports in value, highlighting the sector’s growing importance."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:28:39.545104",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3587,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.4",
    "section_name": "Construction",
    "text": "High interests rates, particularly for housing, continued to hurt the Honduran\nconstruction industry in 1993, but danger from high rates was partially offset\nby some public-sector investment. Privatization of formerly state-owned\nindustries through debt swaps also negatively affected construction as prices\nfor basic materials such as cement increased and credit tightened. A major\ndevaluation of the lempira added to the already high cost of construction\nimports. Construction contributed 6.0 percent to the GDP in 1992.",
    "openai_summarised_points": [
      "• In 1993, high interest rates, especially for housing, continued to negatively impact the Honduran construction industry.",
      "• The adverse effects of high interest rates were partially mitigated by some investment from the public sector.",
      "• The process of privatizing formerly state-owned industries through debt swaps also had a detrimental effect on construction activities.",
      "• Privatization led to increased prices for basic construction materials, such as cement, thereby raising overall construction costs.",
      "• Credit availability was tightened during this period, further constraining the construction sector.",
      "• A significant devaluation of the Honduran lempira contributed to increased costs for construction imports.",
      "• In 1992, the construction sector accounted for 6.0 percent of Honduras's gross domestic product (GDP)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:28:42.512175",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 522,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.5",
    "section_name": "Banking",
    "text": "The Honduran financial sector is small in comparison to the banking systems of\nits neighbors. After 1985, however, the sector began to grow rapidly. The\naverage annual growth rate of value added to the economy from the financial\nsector for the 1980s was the second-highest in Latin America, averaging 4\npercent. By 1985 Honduras had twenty-five financial institutions with 300\nbranch offices. Honduran commercial banks held 60 percent of the financial\nsystem's assets in 1985 and nearly 75 percent of all deposits. With the\nexception of the Armed Forces Social Security Institute, all commercial banks\nwere privately owned, and most were owned by Honduran families. In 1985 there\nwere two government-owned development banks in Honduras, one specializing in\nagricultural credit and the other providing financing to municipal\ngovernments.\n\nAt the behest of the International Monetary Fund (IMF) and World Bank,\nHonduras began a process of financial liberalization in 1990. The process\nbegan with the freeing of agricultural loan rates and was quickly followed by\nthe freeing of loan rates in other sectors. Beginning in late 1991, Honduran\nbanks were allowed to charge market rates for agricultural loans if they were\nusing their own funds. By law, the banks had to report their rates to monetary\nauthorities and could fix rates within two points of the announced rate.\n\nIn 1991 commercial banks pressured the government to reduce their 35 percent\nminimum reserve ratio. This rate remained standard until June 1993 when the\nminimum requirement was temporarily lifted to 42 percent. The rate was dropped\nto 36 percent three months later. The banks had excess reserves, and lending\nrates were in the area of 26 to 29 percent, with few borrowers. Prior to\nliberalization measures, the Central Bank of Honduras (Banco Central de\nHonduras) maintained interest rate controls, setting a 19 percent ceiling,\nwith the market lending rate hovering around 26 percent in late 1991. With\ninflation hitting 33 percent in 1990, there was, in fact, a negative real\ninterest rate, but this situation reversed in 1991 when rates were high\nrelative to inflation. Rates of 35 to 43 percent in 1993 were well above the\ninflation rate of 13 to 14 percent. Bankers argued for further liberalization,\nincluding easing of controls in the housing and nonexport agricultural\nsectors.\n\nA Honduran stock exchange was established in August 1990 with transactions\nconfined to trading debt. Nine companies were registered with the exchange in\n1991; in 1993 this number had grown to eighteen. It appears doubtful, however,\nthat the market will develop fully, given the reluctance of family-held firms\nto open their books to public scrutiny.",
    "openai_summarised_points": [
      "• The Honduran financial sector was relatively small compared to those of neighboring countries but experienced rapid growth after 1985.",
      "• During the 1980s, the sector's average annual growth rate of value added to the economy was 4 percent, making it the second-highest in Latin America.",
      "• By 1985, Honduras had established twenty-five financial institutions operating through 300 branch offices nationwide.",
      "• In 1985, commercial banks in Honduras held 60 percent of the total financial system's assets and nearly 75 percent of all deposits.",
      "• All commercial banks, except for the Armed Forces Social Security Institute, were privately owned, primarily by Honduran families.",
      "• In 1985, Honduras operated two government-owned development banks: one specialized in agricultural credit and the other in financing municipal governments.",
      "• Starting in 1990, under guidance from the International Monetary Fund (IMF) and World Bank, Honduras initiated a process of financial liberalization.",
      "• The liberalization began with the deregulation of agricultural loan rates, followed by the removal of rate controls in other sectors.",
      "• By late 1991, Honduran banks were permitted to charge market rates for agricultural loans using their own funds, with the requirement to report rates to monetary authorities and a legal cap of two percentage points above the announced rate.",
      "• In 1991, commercial banks successfully pressured the government to reduce the minimum reserve ratio from 35 percent; this rate remained until June 1993 when it was temporarily increased to 42 percent.",
      "• The reserve requirement was later decreased to 36 percent three months after June 1993.",
      "• During this period, banks held excess reserves, and lending rates ranged from 26 to 29 percent, with few borrowers participating.",
      "• Prior to liberalization, the Central Bank of Honduras set a maximum interest rate ceiling of 19 percent, while market lending rates hovered around 26 percent in late 1991.",
      "• Inflation was 33 percent in 1990, resulting in negative real interest rates, but rates increased in 1991 to levels above inflation, which was 13 to 14 percent.",
      "• Lending rates in 1993 ranged from 35 to 43 percent, significantly exceeding inflation rates, prompting calls from bankers for further liberalization, including easing controls in housing and nonexport agricultural sectors.",
      "• A Honduran stock exchange was established in August 1990, initially trading only debt securities.",
      "• In 1991, nine companies were listed on the stock exchange; by 1993, the number had grown to eighteen.",
      "• The development of the stock market faced skepticism due to the reluctance of family-held firms to disclose financial information publicly."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:28:48.762560",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2705,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "6.6",
    "section_name": "Tourism",
    "text": "Foreign tourists are attracted to Honduras by the Mayan ruins in Copán and\ncoral reef skin-diving off the Islas de la Bahía (Bay Islands). Poor\ninfrastructure, however, has discouraged the development of substantial\ninternational tourism. Despite these problems, the number of visitors arriving\nin Honduras rose from fewer than 200,000 in 1987 to almost 250,000 in 1989.\nSmall ecotourism projects, in particular, are considered to have significant\npotential."
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Trade",
    "text": "In the early 1990s, the United States was by far Honduras's leading trading\npartner, with Japan a distant second. United States exports to Honduras in\n1992 were valued at US$533 million, about 54 percent of the country's total\nimports of $983 million. Most of the rest of Honduras's imports come from its\nCentral American neighbors. Despite its status as a beneficiary of both the\nCaribbean Basin Initiative (CBI) and the Generalized System of Preferences\n(GSP)--both of which confer duty-free status on Honduran imports to the United\nStates—Honduras has run a long-standing trade deficit with the United States.\n\nTotal exports of goods and services by Honduras in 1992 was $843 million, of\nwhich about 52 percent went to the United States. The current amount exported\nby Honduras as of 2017 is $8.675 billion (USD$), with 34.5% of the said\nexports now going to the United States."
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Linkages to the United States",
    "text": "As with most Latin American countries, Honduras's economy is closely tied to\nthe US. The US is Honduras's primary trading partner and the source of about\ntwo-thirds of the country's foreign direct investment. US multinationals Dole\nFood Company and Chiquita control a large portion of Honduras's agricultural\nexports. Presently, Honduras participates alongside the Rainforest Alliance\nfor the exporting of agricultural goods to the US.\n\nHondurans working in the US send more than $2 billion each year to their\nfamilies in Honduras; these remittances account for 28.2% of Honduras's GDP\n(2007 information )."
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Foreign investment",
    "text": "With the exception of relatively recent, Asian-dominated investment in\nassembly firms along Honduras's northern coast, the country remains heavily\ndependent on United States-based multinational corporations for most of its\ninvestment needs in the early 1990s. Overall investment as a percentage of GDP\ndeclined dramatically during the 1980s, from about 25 percent in 1980 to a\nmeager 15 percent in 1990. Dole Food Company and Chiquita Brands International\ntogether have invested heavily in Honduran industries as diverse as breweries\nand plastics, cement, soap, cans, and shoes.\n\nAs Honduras enters the 1990s, it faces challenging economic problems. The\nsolutions relied on in the past—traditional export crops, the maquiladora\nassembly industry, and the 1980s' development schemes—appear unlikely to\nprovide enough new jobs for a rapidly growing population. The major economic\nchallenge for Honduras over the next decade will be to find dependable sources\nof sustainable economic growth."
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Statistics",
    "text": "* GDP\n* L 233 billion (2007.)\n* US$12.3 billion (2007.)\n* International dollars (purchasing power parity method) $24.69 billion (2007 est.)\n* GDP – real growth rate 6% (2007 est.)\n* GDP – per capita purchasing power parity – 4,700 (2014 est.)\n* GDP – composition by sector\n* agriculture 20%\n* industry 25%\n* services 55% (1998 est.)\n* Population below poverty line 22% (2006 est.)\n* Household income or consumption by percentage share\n* lowest 10% consume 1.2%\n* highest 10% consume 42.1% (1996)\n* Inflation rate (consumer prices) 14% (1999 est.)\n* Labor force 2.3 million (1997 est.)\n* Labor force – by occupation agriculture 29%, industry 21%, services 60% (1998 est.)\n* Unemployment rate 12% (1999); underemployed 30% (1997 est.)\n* Budget\n* revenue $980 million\n* expenditures $1.15 billion including capital expenditures of $NA (1998 est.)\n* Industries bananas, sugar, coffee, textiles, clothing, wood products\n* Industrial production growth rate 9% (1992 est.)\n* Electricity – production 2,904 GWh (1998)\n* Electricity – production by source\n* fossil fuel 34.44%\n* hydro 65.56%\n* nuclear 0%\n* Electricity – consumption 2,742 GWh (1998)\n* Electricity – exports 16 GWh (1998)\n* Electricity – imports 57 GWh (1998)\n* Agriculture – products bananas, coffee, citrus; beef; timber; shrimp\n* Exports $1.6 billion (f.o.b., 1999 est.)\n* Exports – commodities coffee, bananas, shrimp, lobster, meat; zinc, lumber\n* Exports – partners US 73%, Japan 4%, Germany 4%, Belgium, Spain (1998)\n* Imports $2.7 billion (f.o.b., 1999 est.)*Imports – partners US 60%, Guatemala 5%, Netherlands Antilles, Japan, Germany, Mexico, El Salvador (1998)\n* Debt – external $4.4 billion (1999)\n* Economic aid – recipient $557.8 million (1999)\n* Currency 1 lempira (L) = 100 centavos\n* Exchange rates lempiras (L) per US$1 – 19.00 (October 2005), 14.5744 (January 2000), 14.5039 (1999), 13.8076 (1998), 13.0942 (1997), 12.8694 (1996), 10.3432 (1995) .... 1.00 (1980)\n\nHonduras economy  year  | gdp annual growth (%)  | inflation (%)  |  | year  | gdp annual growth (%)  | inflation (%)  |  | year  | gdp annual growth (%)  | inflation (%)  |  | year  | gdp annual growth (%)  | inflation (%)  |  | year  | gdp annual growth (%)  | inflation (%)\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n1960  | n.d.  | n.d.  |  | 1970  | 3.6  | 4.4  |  | 1980  | 0.7  | 13.2  |  | 1990  | 0.1  | 21.2  |  | 2000  | 5.7  | 30.8\n1961  | 1.9  | 4.2  | 1971  | 4.0  | −2.8  | 1981  | 2.5  | 7.2  | 1991  | 3.3  | 26.0  | 2001  | 2.7  | 8.1\n1962  | 5.8  | 2.9  | 1972  | 5.8  | 3.9  | 1982  | −1.4  | 4.4  | 1992  | 5.6  | 9.1  | 2002  | 3.8  | 5.1\n1963  | 3.6  | 2.1  | 1973  | 7.9  | 5.3  | 1983  | −0.9  | 7.0  | 1993  | 6.2  | 13.6  | 2003  | 4.5  | 5.8\n1964  | 5.4  | 5.7  | 1974  | −1.2  | 14.8  | 1984  | 4.3  | 3.4  | 1994  | −1.3  | 28.9  | 2004  | 6.2  | 6.5\n1965  | 9.0  | 2.1  | 1975  | 2.1  | 6.4  | 1985  | 4.2  | 5.2  | 1995  | 4.1  | 24.9  | 2005  | 6.1  | 7.3\n1966  | 5.4  | 2.6  | 1976  | 10.5  | 8.5  | 1986  | 0.7  | 3.9  | 1996  | 3.6  | 22.9  | 2006  | 6.3  | 4.8\n1967  | 6.0  | 2.6  | 1977  | 10.4  | 12.2  | 1987  | 6.0  | 2.8  | 1997  | 5.0  | 22.3  | 2007  | 6.3  | 7.0\n1968  | 6.6  | 1.4  | 1978  | 10.0  | 5.1  | 1988  | 4.6  | 6.5  | 1998  | 2.9  | 11.6  | 2008  | 4.0  |\n1969  | 0.7  | 2.6  | 1979  | 4.7  | 11.5  | 1989  | 4.3  | 7.1  | 1999  | −1.9  | 11.6  | 2009  |  |\nNotes:\nGDP annual growth is growth of real (constant lempiras) GDP, not nominal\n(current) GDP.\nThe inflation measure used is the GDP deflator, not consumer price index\n(CPI). Since they differ somewhat, _please do not add CPI data here as it will\ncause entries to be uncomparable._\n2008 GDP annual growth datum is from Banco Central de Honduras _Memoria Anual\n2008_. Retrieved July 2009.\nOther data is from the World bank[_permanent dead link_] >> Data and Research\n>> Key Statistics:Data by topic >> Macroeconomics and Growth >> Quick Query >>\nselect \"Honduras\", \"GDP growth\" and \"Inflation\".\nReal GDP annual growth rates (%)  region  | 2007  | 2008  | ratio:\n2008/2007\n---|---|---|---\nWorld  | 5.2  | 3.4  | 0.654\nUnited States  | 2.0  | 1.1  | 0.550\nCentral America  | 5.6  | 3.3  | 0.589\nHonduras  | 6.3  | 4.0  | 0.635\nSource: Banco Central de Honduras, _Memoria anual 2008_ , p 23. Retrieved July\n2009.\n\nThe slowed rate of growth in 2008 (4%, vs. 6.3% in 2007) reflected the general\ndownturn in the world economy that year. The _Banco Central de Honduras_\n(central bank) named the debilitation of global demand, and loss of dynamism\nin final consumer demand, as important factors in the slowing of Honduras's\neconomic growth in 2008. The table here shows the slowing of growth in 2008\nversus 2007 in various economies."
  },
  {
    "chapter_name": "Economy of Honduras",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "World development indicators",
    "text": "Header text | 2008 | 2009 | 2010 | 2011 | 2012 | 2013\n---|---|---|---|---|---|---\nGNI per capita, PPP (current international $) | 4,100 | 3,990 | 4,000 | 4,110 | 4,190 | 4,270\nPopulation, total | 7,322,368 | 7,469,844 | 7,621,204 | 7,776,669 | 7,935,846 | 8,097,688\nGDP (current US$) | 13,789,720,387 | 14,587,485,644 | 15,839,344,592 | 17,710,325,578 | 18,564,264,545 | 18,550,011,298\nGDP growth (annual %) | 4.231864123 | −2.431875015 | 3.731270148 | 3.835560728 | 3.863139114 | 2.563736624\nLife expectancy at birth, total (years) | 72.23434146 | 72.5342439 | 72.85031707 | 73.17319512 | 73.49343902 | .....\n\nThe above graph reflects Honduras performance in the World Development\nIndicators since 2008 up to 2013. The information was extracted from the World\nBank Data webpage"
  }
]