[
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of São Tomé and Príncipe\" – news **·** newspapers\n**·** books **·** scholar **·** JSTOR _( November 2012)__(Learn how and when\nto remove this message)_  \n---|---  \n  \nThe **economy of São Tomé and Príncipe** , while traditionally dependent on\ncocoa, is experiencing considerable changes due to investment in the\ndevelopment of its oil industry in the oil-rich waters of the Gulf of Guinea.",
    "openai_summarised_points": [
      "• The economy of São Tomé and Príncipe has traditionally been dependent on cocoa production as its primary economic activity.",
      "• The country is currently undergoing significant economic changes driven by investments in the development of its oil industry.",
      "• These investments focus on exploiting oil reserves located in the oil-rich waters of the Gulf of Guinea.",
      "• The shift from a cocoa-dependent economy to one increasingly influenced by oil development marks a notable transformation in São Tomé and Príncipe’s economic landscape.",
      "• The article on the economy of São Tomé and Príncipe requires additional citations from reliable sources to verify the information presented.",
      "• Unsourced material in the article may be challenged and removed, emphasizing the need for scholarly and credible references such as news, newspapers, books, academic journals, and JSTOR.",
      "• The notice requesting additional citations was added in November 2012, indicating ongoing efforts to improve the article’s reliability and accuracy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:55:36.565463",
      "openai_model": "gpt-4.1-mini",
      "content_length": 603,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Under Portuguese colonial rule, sugar plantations were set up, and the islands\nwere used for the transshipment of slaves.",
    "openai_summarised_points": [
      "• Under Portuguese colonial rule, sugar plantations were established on the islands of São Tomé and Príncipe.",
      "• During this period, the islands served as a transshipment point for the slave trade."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:55:34.526356",
      "openai_model": "gpt-4.1-mini",
      "content_length": 121,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Oil reserves",
    "text": "Geologists estimate that the Gulf of Guinea zone (Niger Delta province) holds\nmore than 10 billion barrels (1.6 km3) of oil, although no reserves have yet\nbeen proven. A joint oil project with Nigeria in 2005 is likely to\ncontribute[_when?_] $50 million of revenues to the government from the\nexploration licence signing fees. This represents four times government\nrevenues in 2004. São Tomé is optimistic that significant petroleum\ndiscoveries under the exploration licence are forthcoming, though no crude oil\nnor natural gas has been found as of 2021."
  },
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Since the 1800s, the economy of São Tomé and Príncipe has been based on\nplantation agriculture. At the time of independence, Portuguese-owned\nplantations occupied 90% of the cultivated area. After independence, control\nof these plantations passed to various state-owned agricultural enterprises.\nThe dominant crop on São Tomé is cocoa, representing about 95% of exports.\nOther export crops include copra, palm kernels, and coffee.\n\n*   *   *   *",
    "openai_summarised_points": [
      "• Since the 1800s, the economy of São Tomé and Príncipe has been primarily based on plantation agriculture.",
      "• At the time of independence, Portuguese-owned plantations occupied 90% of the cultivated agricultural area in São Tomé and Príncipe.",
      "• Following independence, control of these plantations was transferred to various state-owned agricultural enterprises.",
      "• The dominant agricultural crop on São Tomé is cocoa, which accounts for approximately 95% of the country’s exports.",
      "• Other significant export crops from São Tomé and Príncipe include copra, palm kernels, and coffee."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:55:35.438170",
      "openai_model": "gpt-4.1-mini",
      "content_length": 445,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic issues",
    "text": "The government has an economic program that is supported by the IMF, via its\nExtended Credit Facility arrangement.",
    "openai_summarised_points": [
      "• The government of São Tomé and Príncipe implements an economic program that receives support from the International Monetary Fund (IMF) through its Extended Credit Facility arrangement."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:55:34.521620",
      "openai_model": "gpt-4.1-mini",
      "content_length": 114,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of São Tomé and Príncipe",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "| The current version of this section was **imported from the CIA World\nFactbook** and may require rewriting or reformatting to meet Wikipedia's\nquality standards. Please discuss this issue on the talk page. Editing help is\navailable.\n---|---\n\n**Gross domestic product:** purchasing power parity – $316.9 million (2010\nest.), $214 million (2003 est.)\n\n**GDP – real growth rate:** 6% (2010 est.), 5% (2004 est.)\n\n**GDP – per capita:** purchasing power parity – $1,800 (2010 est.), $1,200\n(2003 est.)\n\n**Unemployment rate:** 12.2% in the formal business sector (2017 est.)\n\n**Budget:**\n\n* _revenues:_ $58 million\n* _expenditures:_ $114 million, including capital expenditures of $54 million (1993 est.)\n\n**Industries:** light construction, textiles, soap, beer; fish processing;\ntimber\n\n**Agriculture – products:** cocoa, coconuts, palm kernels, copra, cinnamon,\npepper, coffee, bananas, papayas, beans; poultry; fish\n\n**Exports:** $13 million (2010 est.)\n\n**Exports – commodities:** cocoa 80%, copra, coffee, palm oil (2009)\n\n**Exports – partners:** United Kingdom 32.99%, Netherlands 26.93%, Belgium\n21.04%, Portugal 4.31% (2009)\n\n**Imports:** $127.7 million (2017 est.)\n\n**Petroleum** – it needs to import all of its required petroleum",
    "openai_summarised_points": [
      "• The gross domestic product (GDP) of São Tomé and Príncipe measured by purchasing power parity was estimated at $316.9 million in 2010, up from $214 million in 2003.",
      "• The real GDP growth rate was estimated at 6% in 2010, showing an increase from 5% in 2004.",
      "• GDP per capita based on purchasing power parity was approximately $1,800 in 2010, compared to $1,200 in 2003.",
      "• The unemployment rate within the formal business sector was estimated at 12.2% in 2017.",
      "• The national budget in 1993 recorded revenues of $58 million and expenditures of $114 million, which included capital expenditures amounting to $54 million.",
      "• Key industries in São Tomé and Príncipe include light construction, textiles, soap manufacturing, beer production, fish processing, and timber.",
      "• Agricultural products consist of cocoa, coconuts, palm kernels, copra, cinnamon, pepper, coffee, bananas, papayas, beans, poultry, and fish.",
      "• Total exports were valued at $13 million in 2010.",
      "• Export commodities in 2009 were dominated by cocoa, which accounted for 80% of exports, followed by copra, coffee, and palm oil.",
      "• Major export partners in 2009 included the United Kingdom (32.99%), the Netherlands (26.93%), Belgium (21.04%), and Portugal (4.31%).",
      "• Imports were estimated at $127.7 million in 2017.",
      "• São Tomé and Príncipe imports all of its required petroleum, indicating no domestic petroleum production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:55:39.124940",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1236,
      "bullet_points_count": 12
    }
  }
]