[
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Somalia is classified by the United Nations as a least developed country, with\nthe majority of its population being dependent on agriculture and livestock\nfor their livelihood. The **economy of Somalia** is $13.89 billion by gross\ndomestic product as of 2025. For 1994, the CIA estimated it at purchasing\npower parity to be approximately $3.3 billion. In 2001, it was estimated to be\n$4.1 billion. By 2009, the CIA estimated that it had grown to $5.731 billion,\nwith a projected real growth rate of 2.6%. In 2014, the International Monetary\nFund estimated economic activity to have expanded by 3.7% primarily. This\nexpansion was driven by growth in the primary sector and the secondary sector.\nAccording to a 2007 British Chambers of Commerce report, the private sector\nhas experienced growth, particularly in the service sector. Unlike the pre-\ncivil war period, when most services and the industrial sector were\ngovernment-run, there has been substantial, albeit unmeasured, private\ninvestment in commercial activities. The investment has been largely financed\nby the Somali diaspora, and includes trade and marketing, money transfer\nservices, transportation, communications, fishery equipment, airlines,\ntelecommunications, education, health, construction and hotels.[_needs\nupdate_]\n\nAccording to the United Nations Development Programme (UNDP) Somalia, as of\n2012[update], the country had some of the lowest development indicators in the\nworld, and a \"strikingly low\" Human Development Index (HDI) value of 0.285.\nThis would rank amongst the lowest in the world if comparable data were\navailable, and when adjusted for the significant inequality that exists in\nSomalia, its HDI is even lower. The UNDP notes that \"inequalities across\ndifferent social groups, a major driver of conflict, have been widening\".\n\nSomalia's economy consists of both traditional and modern production, with a\ngradual shift to more modern industrial techniques. According to the Central\nBank of Somalia, about 80% of the population are nomadic or semi-nomadic\npastoralists, who keep goats, sheep, camels and cattle. The nomads also gather\nresins and gums to supplement their income.\n\nAccording to the World Bank, Somalia's economy has suffered as a result of the\nstate failure that accompanied the country's civil war. Some economists,\nincluding libertarian Peter T. Leeson, have argued instead that state collapse\nhas actually helped improve economic welfare, because the previous Somali\nstate was predatory."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic indicators",
    "text": "According to the African Development Bank, Somalia is \"characterized by a\nsevere lack of basic economic and social statistics\". This situation has been\nexacerbated by the civil war and institutional collapse, although even prior\nto Somalia's state failure, data was often unreliable.\n\nThe World Bank reports that Somalia's GDP was $917.0 million in 1990 and its\ntotal population was 13.42 million in 2014, and has since risen to 15 million\nas of 2018, marking roughly a 12% increase in its total population since then.\nIn 2018 the World bank estimated an annual GDP of $6.2 billion, similar in\nsize to Guam and the Kyrgyz Republic, and classifies it as a low-income\ncountry. The United Nations Statistics Division reports a GDP figure of $1.306\nbillion for 2012, compared to $2.316 billion in 2005 and $1.071 billion in\n2010.\n\nAccording to the Central Bank of Somalia, sometime in the 2000s the country's\nGDP per capita according to the World Bank was $230, a slight reduction in\nreal terms from 1990. The 2012 _Human Development Report_ estimates per capita\nGDP to be $284, compared with an average across sub-Saharan Africa of $1,300\nper capita. This GDP per capita figure is the fourth lowest in the world.\nAbout 43% of the population live on less than 1 US dollar a day, with about\n24% of those found in urban areas and 54% living in rural areas.\n\nAccording to the United Nations Development Programme (UNDP) Somalia, as of\n2012[update] the country had some of the lowest development indicators in the\nworld, and a \"strikingly low\" Human Development Index (HDI) value of 0.285.\nThis would rank amongst the lowest in the world if comparable data were\navailable, and when adjusted for the significant inequality that exists in\nSomalia, its HDI is even lower. The UNDP notes that \"inequalities across\ndifferent social groups, a major driver of conflict, have been widening\". The\nUN has classified Somalia as a least developed country since its Committee for\nDevelopment Policy began categorising states in this way in 1971.\n\nAn International Monetary Fund mission to Somalia reports estimated GDP growth\nof 3.7% in 2014 and CPI inflation of -71.10%. The report notes that provided\nthat Somalia's security situation continues to improve modestly and there is\nno drought, economic growth in the medium term should average 5%, but that\n\"growth will remain inadequate to redress poverty and gender disparities\". An\nestimated 73% of the people of Somalia live below the poverty line in 2016."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "State failure and economic welfare",
    "text": "According to the World Bank, within two years of the outbreak of civil war in\n1988, Somali state institutions collapsed and \"most of the economic and social\ninfrastructure and assets were destroyed\". In 2003 the Bank said that despite\nthe absence of a state and its institutions, the Somali private sector\nexperienced impressive growth, but that \"most of these sectors are now\nbecoming either stagnant or their growth is hindered due to the lack of\ninvestment, trained manpower and the absence of a relevant legal and\nregulatory framework to enforce rules and regulations, common standards and\nquality control\". The report notes difficulties encouraging and making use of\ndomestic savings for investment, due to the lack of formal financial services\nand regulatory agencies. The lack of state institutions, the Bank argues,\nresulted in the prevention of access to international capital markets.\n\nIn an article published in 2007, libertarian economist Peter T. Leeson argues\nthat the Somali state was predatory, and that its collapse has improved the\neconomic welfare of its citizens, with 14 out of 18 key development indicators\nbeing more positive in the period 2000-2005 than in 1985–1990. Similarly,\neconomists Benjamin Powell, Ryan Ford and Alex Nowrasteh argue that Somalia's\neconomic performance, relative to other African states, has improved during\nthe period of statelessness. Ersun Kurtulus states that Leeson and Powell,\nFord and Nowrasteh's articles provide \"the most unequivocal evidence to\nindicate that Somalia has been faring far better under anarchy than it did\nunder Barre's regime\". Kurtulus argues that these authors may provide a valid\nexplanation of the situation in Somalia, but that \"the argument appears to be\nderived from a hypothesis which is rooted in a liberal conceptualisation of\nstatehood rather than in a quantitative analysis which establishes a negative\ncorrelation between indicators of state predation and those of economic and\nsocial welfare\". Kurtulus suggests that the collapse of a repressive state may\nimprove personal and civil liberties, but that such an account \"overemphasises\nendogenous factors that are vested in the domestic arena, while neglecting the\nexogenous factors that operate at the regional and international level\".",
    "openai_summarised_points": [
      "• According to the World Bank, within two years of the outbreak of civil war in 1988, Somali state institutions collapsed, resulting in the destruction of most economic and social infrastructure and assets.",
      "• In 2003, the World Bank reported that despite the absence of a state and its institutions, the Somali private sector experienced impressive growth; however, many sectors were becoming stagnant or hindered in growth due to lack of investment, trained manpower, and absence of a relevant legal and regulatory framework to enforce rules, common standards, and quality control.",
      "• The 2003 World Bank report highlighted difficulties in encouraging and utilizing domestic savings for investment in Somalia, primarily due to the lack of formal financial services and regulatory agencies.",
      "• The absence of state institutions in Somalia prevented access to international capital markets, according to the World Bank.",
      "• In a 2007 article, libertarian economist Peter T. Leeson argued that the Somali state was predatory, and its collapse improved the economic welfare of its citizens, with 14 out of 18 key development indicators showing more positive outcomes during 2000-2005 compared to 1985–1990.",
      "• Economists Benjamin Powell, Ryan Ford, and Alex Nowrasteh similarly argued that Somalia's economic performance relative to other African states improved during the period of statelessness.",
      "• Ersun Kurtulus stated that the articles by Leeson, Powell, Ford, and Nowrasteh provide the most unequivocal evidence indicating that Somalia fared far better under anarchy than under Siad Barre's regime.",
      "• Kurtulus argued that while these authors may offer a valid explanation of Somalia’s situation, their argument is rooted in a liberal conceptualization of statehood rather than based on quantitative analysis establishing a negative correlation between state predation indicators and economic and social welfare.",
      "• Kurtulus suggested that the collapse of a repressive state may improve personal and civil liberties but criticized the overemphasis on endogenous domestic factors, noting that such accounts neglect exogenous factors operating at regional and international levels."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:00:31.585048",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2274,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Cans of _Las Qoray_ brand tuna fish made in Las Khorey.\n\nAgriculture is the most important economic sector. It accounts for about 65%\nof the GDP and employs 65% of the workforce. Livestock contributes about 40%\nto GDP and more than 50% of export earnings. Other principal exports include\nfish, charcoal and bananas; sugar, sorghum and corn are products for the\ndomestic market. According to the Central Bank of Somalia, imports of goods\ntotal about $460 million per year, and have recovered and even surpassed\naggregate imports prior to the start of the civil war in 1991. Exports, which\ntotal about $270 million annually, have also surpassed pre-war aggregate\nexport levels but still lead to a trade account deficit of about $190 million\nUS dollars per year. However, this trade deficit is far exceeded by\nremittances sent by Somalis in the diaspora, which have helped sustain the\nimport level.\n\nWith the advantage of being located near the Arabian Peninsula, Somali traders\nhave increasingly begun to challenge Australia's traditional dominance over\nthe Persian Gulf Arab livestock and meat market, offering quality animals at\nvery low prices. In response, Persian Gulf Arab states have started to make\nstrategic investments in the region, with Saudi Arabia building livestock\nexport infrastructure and the United Arab Emirates purchasing large farmlands.\nAdditionally, fishing fleets from Europe and Asia have reached commercial\nfishing agreements in the northern Puntland region.\n\nWith Somalia exporting 3 million sheep in 2012, its live exports to the Middle\nEast have overtaken Australian exports which numbered 2 million. According to\nthe Australian Bureau of Agricultural and Resource Economics and Sciences, 99%\nof the country's livestock exports are headed to the Middle East. However,\nsince 2006, there has been a 10% decline \"because of increasing competition in\nexport markets from African and eastern European sheep exports\". More than 5\nmillion livestock were exported in 2014, the highest amount in 20 years.\nNeighbouring Somaliland is also home to some of the largest livestock markets,\nknown in Somali as _seylad_ , in the Horn of Africa, with as many as 10,000\nheads of sheep and goats sold daily in the markets of Burao and Yirowe, many\nof whom shipped to Gulf states via the port of Berbera. The markets handle\nlivestock from all over the Horn of Africa.\n\nFrankincense and myrrh are important export products for Somalia. Along with\nEthiopia and Kenya, Somalia is one of the world's three largest suppliers of\nthese products."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Manufacturing",
    "text": "The Coca-Cola bottling plant in Mogadishu\n\nThe modest industrial sector, based on the processing of agricultural\nproducts, accounts for 10% of Somalia's GDP.\n\nPrior to the outbreak of the civil war in 1991, the roughly 53 state-owned\nsmall, medium and large manufacturing firms were foundering, with the ensuing\nconflict destroying many of the remaining industries. However, primarily as a\nresult of substantial local investment by the Somali diaspora, many of these\nsmall-scale plants have re-opened and newer ones have been created. The latter\ninclude fish-canning and meat-processing plants in the north, as well as about\n25 factories in the Mogadishu area, which manufacture pasta, mineral water,\nconfections, plastic bags, fabric, hides and skins, detergent and soap,\naluminum, foam mattresses and pillows, fishing boats, carry out packaging, and\nstone processing.\n\nIn 2001, investments in light manufacturing have expanded in Bosaso, Hargeisa\nand Mogadishu, in particular, indicating growing business confidence in the\neconomy. To this end, in 2004, an $8.3 million Coca-Cola bottling plant opened\nin Mogadishu, with investors hailing from various constituencies in Somalia.\nVarious other sectors have also attracted foreign investment from the likes of\nGeneral Motors and Dole Fruit.",
    "openai_summarised_points": [
      "• The industrial sector in Somalia is modest and primarily based on the processing of agricultural products, contributing approximately 10% to the country's Gross Domestic Product (GDP).",
      "• Before the civil war erupted in 1991, Somalia had about 53 state-owned manufacturing firms of varying sizes—small, medium, and large—that were struggling financially.",
      "• The civil war that began in 1991 caused significant destruction to many of Somalia's remaining industrial facilities, severely impacting the manufacturing sector.",
      "• Despite the conflict, substantial local investment from the Somali diaspora has led to the reopening of many small-scale manufacturing plants and the establishment of new ones.",
      "• New manufacturing enterprises include fish-canning and meat-processing plants located in northern Somalia.",
      "• Approximately 25 factories operate in the Mogadishu area, producing a diverse range of products such as pasta, mineral water, confections, plastic bags, fabric, hides and skins, detergent and soap, aluminum goods, foam mattresses and pillows, fishing boats, packaging services, and stone processing.",
      "• By 2001, light manufacturing investments had expanded notably in the cities of Bosaso, Hargeisa, and Mogadishu, signaling increasing business confidence in Somalia’s economic prospects.",
      "• In 2004, a Coca-Cola bottling plant was inaugurated in Mogadishu with an investment of $8.3 million; the investors came from various constituencies within Somalia.",
      "• Foreign investment has also been attracted to Somalia’s manufacturing and related sectors, with companies such as General Motors and Dole Fruit participating in the economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:00:26.007772",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1290,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Airline industry",
    "text": "Jubba Airways plane in Mogadishu, Somalia.\n\nFollowing the start of the civil war, all of Somali Airlines' operations were\nofficially suspended in 1991. By 2014, there were over six Somali-owned\nprivate carriers filling the gap. These included Daallo Airlines, Jubba\nAirways, African Express Airways, East Africa 540, Central Air and Hajara.\nDaallo and Jubba merged as the African Airways Alliance in 2015.\n\nDespite reports of preparations to relaunch Somali Airlines in 2012 and 2013,\nAl Arabiya reports discussing the merger of Daallo Airlines and Jubba Airways\nin February 2015 said there was no official Somali flag carrier after the\ndemise of Somali Airlines in 1991.",
    "openai_summarised_points": [
      "• Somali Airlines officially suspended all operations in 1991 following the onset of the civil war in Somalia.",
      "• By 2014, the void left by Somali Airlines was filled by over six Somali-owned private airlines, including Daallo Airlines, Jubba Airways, African Express Airways, East Africa 540, Central Air, and Hajara.",
      "• In 2015, Daallo Airlines and Jubba Airways merged to form the African Airways Alliance, consolidating their operations.",
      "• Despite reports in 2012 and 2013 about plans to relaunch Somali Airlines, no official Somali national flag carrier existed after Somali Airlines ceased operations in 1991.",
      "• Al Arabiya's February 2015 coverage of the Daallo-Jubba merger confirmed the absence of an official Somali flag carrier since the demise of Somali Airlines."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:00:25.644475",
      "openai_model": "gpt-4.1-mini",
      "content_length": 671,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Construction",
    "text": "As a result of improved security conditions in Mogadishu, the Economist\nIntelligence Unit reported in 2015 that construction of new infrastructure and\nrepairs to previously abandoned villas was occurring in the city. However, the\nCentral Intelligence Agency's _The World Factbook_ states that development has\nnot spread to other parts of Somalia, and that security is a major concern for\nbusinesses in Mogadishu.",
    "openai_summarised_points": [
      "• In 2015, the Economist Intelligence Unit reported that improved security conditions in Mogadishu facilitated the construction of new infrastructure and the repair of previously abandoned villas within the city.",
      "• Despite developments in Mogadishu, the Central Intelligence Agency's publication, The World Factbook, indicates that such construction and development activities have not extended to other regions of Somalia.",
      "• The World Factbook also emphasizes that security remains a significant concern for businesses operating in Mogadishu, potentially limiting broader economic and infrastructural growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:00:27.695432",
      "openai_model": "gpt-4.1-mini",
      "content_length": 412,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Telecommunications and media",
    "text": "The Hormuud Telecom building in Mogadishu\n\nSomalia's telecommunications system was destroyed during the fighting which\ntook place in 1991. By 2010 various new telecommunications companies were\nproviding this missing infrastructure. Funded by Somali entrepreneurs and\nbacked by expertise from People's Republic of China, Japan, EU and Korea.\nThese nascent telecommunications firms offer affordable mobile phone and\ninternet services that are not available in many other parts of the continent.\nCustomers can conduct money transfers and other banking activities via mobile\nphones, as well as easily gain wireless internet access. However, the\noperations of the companies were constrained by the continuing fighting.\n\nIn 2004, installation time for a landline was three days, while in Kenya to\nthe south, waiting lists were many years long. Interviewed in 2004,\ntelecommunications firms were \"desperate\" to have an effective government:\n\"everything starts with security.\" There are presently around 25 mainlines per\n1,000 persons, and the local availability of telephone lines (_tele-density_)\nis higher than in neighboring countries; three times greater than in adjacent\nEthiopia. Prominent Somali telecommunications companies include Golis Telecom\nGroup, Hormuud Telecom, Somafone, Nationlink, Netco, Telcom and Somali Telecom\nGroup. Hormuud Telecom alone grosses about $40 million a year. To dampen\ncompetitive pressures, three of these companies signed an interconnectivity\ndeal in 2005 that allows them to set prices and expand their networks.\n\nA 2010 report stated that the expansion of Somalia's telecom industry provided\none of the clearest signs that the country's economy was growing.\n\nAs of 2015, there were also 20 privately owned Somali newspapers, 10 radio and\ntelevision stations, and numerous internet sites offering information to the\npublic.",
    "openai_summarised_points": [
      "• Somalia's telecommunications system was destroyed during the fighting in 1991, resulting in a complete collapse of infrastructure.",
      "• By 2010, various new telecommunications companies had emerged to provide the missing infrastructure, funded by Somali entrepreneurs and supported by expertise from the People's Republic of China, Japan, the European Union, and Korea.",
      "• These emerging telecommunications firms offered affordable mobile phone and internet services, which were unavailable in many other parts of Africa, enabling customers to conduct money transfers, banking activities via mobile phones, and access wireless internet easily.",
      "• Despite these advancements, the operations of telecommunications companies were constrained by ongoing fighting and insecurity in the country.",
      "• In 2004, the installation time for a landline in Somalia was three days, a stark contrast to Kenya, where waiting lists for landlines extended for many years.",
      "• Telecommunications firms interviewed in 2004 expressed desperation for an effective government, emphasizing that \"everything starts with security\" as a prerequisite for growth.",
      "• At that time, Somalia had approximately 25 mainlines per 1,000 persons, with a local telephone line availability (tele-density) higher than neighboring countries and three times greater than adjacent Ethiopia.",
      "• Prominent Somali telecommunications companies included Golis Telecom Group, Hormuud Telecom, Somafone, Nationlink, Netco, Telcom, and Somali Telecom Group.",
      "• Hormuud Telecom alone generated gross revenues of about $40 million annually.",
      "• To reduce competitive pressures, three major telecommunications companies signed an interconnectivity agreement in 2005, allowing them to set prices collaboratively and expand their networks.",
      "• A 2010 report highlighted the expansion of Somalia's telecom industry as one of the clearest indicators of the country's economic growth.",
      "• By 2015, Somalia had developed a media landscape comprising 20 privately owned newspapers, 10 radio and television stations, and numerous internet sites providing information to the public."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:00:32.810116",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1856,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Finance",
    "text": "A Dahabshiil bank branch in Hargeisa\n\nThe Central Bank of Somalia is the official monetary authority of Somalia. In\nterms of financial management, it is in the process of assuming the task of\nboth formulating and implementing monetary policy. In 2013 the African\nDevelopment Bank assessed that the Somali Central Bank was \"handicapped by the\nlack of adequate human, material and financial resources\", but that it would\nbe able to reduce the rate of inflation once it assumed control of monetary\npolicy and issued a new currency. At this time Somaliland also had a central\nbank, though its main roles were to serve as a treasury to the government and\nprint currency.\n\nOwing to a lack of confidence in the local currency, the US dollar is widely\naccepted as a medium of exchange alongside the Somali shilling. Dollarization\nnotwithstanding, the large issuance of the Somali shilling has caused\ninflation. The central bank says it will end the inflationary environment when\nit assumes full control of monetary policy and replaces the presently\ncirculating currency introduced by the private sector.\n\nSomalia has had no central monetary authority for upwards of 15 years between\nthe outbreak of the civil war in 1991 and the subsequent re-establishment of\nthe Central Bank of Somalia in 2009. Bank-to-bank transfers are not possible,\nwhich led to the rise of private money transfer operators (MTO) that have\nacted as informal banking networks.\n\nThese remittance firms (_hawalas_) have become a large industry in Somalia,\nwith an estimated US$1.6 billion annually remitted to the region by Somalis in\nthe diaspora via money transfer companies. The latter include Dahabshiil,\nQaran Express, Mustaqbal, Amal Express, Kaah Express, Hodan Global, Olympic,\nAmana Express, Iftin Express and Tawakal Express. Most are credentialed\nmembers of the Somali Money Transfer Association (SOMTA), an umbrella\norganization that regulates the community's money transfer sector, or its\npredecessor, the Somali Financial Services Association (SFSA). Somalia is the\nworld's fourth-most country dependent on remittances. Most remittances are\nsent by Somalis-based abroad to relatives in Somalia. This accounts for\n20%-50% of the Somali economy.\n\nA 500 Somali shilling banknote\n\nDahabshiil is the largest of the Somali money transfer operators (MTO), having\ncaptured most of the market vacated by Al-Barakaat. The firm has its\nheadquarters in London and employs more than 2000 people across 144 countries,\nwith 130 branches in the United Kingdom alone, a further 130 branches in\nSomalia, and 400 branches globally, including one in Dubai. The company\nprovides a broad range of financial services to international organisations,\nas well as to both large and small businesses and private individuals. After\nDahabshiil, Qaran Express is the largest Somali-owned funds transfer company.\nThe firm has its headquarters in both London and Dubai, with 175 agents\nworldwide, 66 agents in Somalia and 64 in London, and charges nothing for\nremitting charity funds. Mustaqbal is the third most prominent Somali MTO,\nwith 8 agents in Somalia and 49 in the UK. As with Dahabshiil and Qaran\nExpress, it also has a notable presence internationally.\n\nAs the reconstituted Central Bank of Somalia fully assumes its monetary policy\nresponsibilities, some of the existing money transfer companies are expected\nin the near future to seek licenses so as to develop into full-fledged\ncommercial banks. This will serve to expand the national payments system to\ninclude formal cheques, which in turn is expected to reinforce the efficacy of\nthe use of monetary policy in domestic macroeconomic management.\n\nWith a significant improvement in local security, Somali expatriates began\nreturning to the country for investment opportunities. Coupled with modest\nforeign investment, the inflow of funds have helped the Somali shilling\nincrease considerably in value. By March 2014, the currency had appreciated by\nalmost 60% against the U.S. dollar over the previous 12 months. The Somali\nshilling was the strongest among the 175 global currencies traded by\nBloomberg, rising close to 50 percentage points higher than the next most\nrobust global currency over the same period."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Stock exchange",
    "text": "The Somalia Stock Exchange (SSE) is the national bourse of Somalia. It was\nfounded in 2012 by the Somali diplomat Idd Mohamed, Ambassador extraordinary\nand deputy permanent representative to the United Nations. The SSE was\nestablished to attract investment from both Somali-owned firms and global\ncompanies in order to accelerate the ongoing post-conflict reconstruction\nprocess in Somalia.\n\nIn August 2012, the SSE signed a Memorandum of understanding with the Nairobi\nSecurities Exchange (NSE) to assist it in technical development. The agreement\nincludes identifying appropriate expertise and support. Sharia compliant sukuk\nbonds and halal equities are also envisioned as part of the deal as Somalia's\nnascent stock market develops.\n\nAs of November 2014, the Somalia Stock Exchange has established administrative\noffices in Mogadishu, Kismayo, and other urban centers in Somalia. The bourse\nis slated to officially open in 2015. Initially, seven Somali-owned firms from\nthe financial services, telecommunications and transportation sectors are\nexpected to list their shares therein for prospective global investment."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Natural Resources",
    "text": "Oil blocks in Puntland\n\nSomalia has untapped reserves of numerous natural resources, including\nuranium, iron ore, tin, gypsum, bauxite, copper, salt and natural gas.\nAustralian and Chinese oil companies have been granted licenses for finding\npetroleum and other natural resources in the country. An oil group listed in\nSydney, Range Resources, anticipates that the Puntland province in the north\nhas the potential to produce 5 billion barrels (790×10~~^~~ 6 m3) to 10\nbillion barrels (1.6×10~~^~~ 9 m3) of oil. As a result of these developments,\nthe Somali Petroleum Company was created by the federal government.\n\nIn the late 1960s, UN geologists also discovered major uranium deposits and\nother rare mineral reserves in Somalia. The find was the largest of its kind,\nwith industry experts estimating the deposits at over 25% of the world's then\nknown uranium reserves of 800,000 tons. In 1984, the IUREP Orientation Phase\nMission to Somalia reported that the country had 5,000 tons of uranium\nreasonably assured resources (RAR), 11,000 tons of uranium estimated\nadditional resources (EAR) in calcrete deposits, as well as possibly up to\n150,000 tons of uranium speculative resources (SR) in sandstone and calcrete\ndeposits. Somalia concurrently evolved into a major world supplier of uranium,\nwith American, UAE, Italian and Brazilian mineral companies vying for\nextraction rights. Link Natural resources have a stake in the natural\nresources of the central region, Kilimanjaro Capital has a stake in the\n1,161,400 acres Amsas-Coriole-Afgoi (ACA) Block, which includes uranium\nexploration. Besides uranium, an unspecified quantity of yttrium, a rare earth\nelement and costly mineral, was also found in the country."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Energy",
    "text": "In mid-2010, Somalia's business community pledged to invest $1 billion in the\nnational gas and electricity industries over the following five years.\nAbdullahi Hussein, the director of the just-formed Trans-National Industrial\nElectricity and Gas Company, predicted that the investment strategy would\ncreate 100,000 jobs. The new firm was established through the merger of five\nSomali companies from the trade, finance, security, and telecommunications\nsectors. The first phase of the project started within six months of the\nestablishment of the company, and trained youth to supply electricity to\neconomic areas and communities. The second phase began in mid-to-late 2011 and\nsaw the construction of factories in specially designated economic zones for\nthe fishing, agriculture, livestock and mining industries.\n\nIn 2012, the Farole administration gave the green light to the first official\noil exploration project in Puntland and Somalia at large. Led by the Canadian\noil company Africa Oil and its partner Range Resources, initial drilling in\nthe Shabeel-1 well on Puntland's Dharoor Block in March of the year\nsuccessfully yielded oil.\n\nAccording to the Central Bank of Somalia, as the nation embarks on the path of\nreconstruction, the economy is expected to not only match its pre-civil war\nlevels, but also to accelerate in growth and development due to the Somalia's\nuntapped natural resources."
  },
  {
    "chapter_name": "Economy of Somalia",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators since 1960.\n\nYear  | GDP\n(in billion US$ nominal) | GDP per capita\n(in US$ Nominal) | GDP\n(in billion US$ PPP) | GDP per capita\n(in US$ PPP) | GDP growth (real)\n---|---|---|---|---|---\n1960  | 0.2  | 63  | ...  | ...  | ...\n1970  | 0.3  | 87  | ...  | ...  | ...\n1980  | 0.6  | 102  | ...  | ...  | ...\n1990  | 0.9  | 131  | ...  | ...  | ...\n2013  | 5.8  | 454  | 13.5  | 1,052  | ...\n2014  | 6.5  | 491  | 16.3  | 1,222  | 7.5%\n2015  | 7.0  | 508  | 19.6  | 1,422  | 9.9%\n2016  | 7.4  | 517  | 21.5  | 1,506  | 6.4%\n2017  | 8.4  | 555  | 23.2  | 1,558  | 9.5%\n2018  | 8.3  | 537  | 24.4  | 1,585  | 3.0%\n2019  | 9.2  | 590  | 25.8  | 1,613  | 3.6%\n2020  | 9.2  | 557  | 25.4  | 1,538  | −2.6%\n2021  | 9.8  | 577  | 27.5  | 1,609  | 3.3%\n2022  | 10.4  | 592  | 30.1  | 1,711  | 2.4%"
  }
]