[
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The United Kingdom has a highly developed social market economy. From 2017 to\n2025 it has been the sixth-largest national economy in the world measured by\nnominal gross domestic product (GDP), tenth-largest by purchasing power parity\n(PPP), and about 18th by nominal GDP per capita, constituting 2.4% of world\nGDP and 2.2% by purchasing power parity (PPP).\n\nThe United Kingdom has one of the most globalised economies and comprises\nEngland, Scotland, Wales and Northern Ireland. In 2022, the United Kingdom was\nthe fifth-largest exporter of goods and services in the world and the fourth-\nlargest importer. It also had the fourth-largest outward foreign direct\ninvestment, and the fifteenth-largest inward foreign direct investment. In\n2022, the United Kingdom's trade with the European Union accounted for 42% of\nthe country's exports and 48% of its total imports. The United Kingdom has a\nhighly efficient and strong social security system, which comprises roughly\n24.5% of GDP.\n\nThe service sector dominates, contributing 82% of GDP; the financial services\nindustry is particularly important, and London is the second-largest financial\ncentre in the world. Edinburgh was ranked 17th in the world, and 6th in Europe\nfor its financial services industry in 2021. The United Kingdom's technology\nsector is valued at US$1 trillion, third behind the United States and China.\nThe aerospace industry in the United Kingdom is the second-largest national\naerospace industry. Its pharmaceutical industry, the tenth-largest in the\nworld, plays an important role in the economy. Of the world's 500 largest\ncompanies, 17 are headquartered in the UK. The economy is boosted by North Sea\noil and gas production; its reserves were estimated at 2.5 billion barrels in\n2021, although it has been a net importer of oil since 2005. There are\nsignificant regional variations in prosperity, with South East England and\nNorth East Scotland being the richest areas per capita. The size of London's\neconomy makes it the wealthiest city by GDP per capita in Europe. In 2022, the\nUK spent around 2.8% of GDP on research and development.\n\nIn the 18th century, Britain was the first nation to industrialise. During the\n19th century, through its expansive colonial empire and technological\nsuperiority, Britain had a preeminent role in the global economy, accounting\nfor 9.1% of the world's GDP in 1870. The Second Industrial Revolution was also\ntaking place rapidly in the United States and the German Empire; this\npresented an increasing economic challenge for the UK, leading into the 20th\ncentury. The cost of fighting both the First and Second World Wars further\nweakened the UK's relative position. Despite a relative decline in its global\ndominance, in the 21st century the UK retains the ability to project\nsignificant power and influence around the world. During the Great Recession\nof 2008, the UK economy suffered a significant decline, followed by a period\nof weak growth.\n\nGovernment involvement is primarily exercised by His Majesty's Treasury,\nheaded by the Chancellor of the Exchequer, and the Department for Business and\nTrade. Since 1979, management of the economy has followed a broadly laissez-\nfaire approach. The Bank of England is the UK's central bank, and since 1997\nits Monetary Policy Committee has been responsible for setting interest rates,\nquantitative easing, and forward guidance.",
    "openai_summarised_points": [
      "• The United Kingdom has a highly developed social market economy and, from 2017 to 2025, ranks as the sixth-largest national economy globally by nominal gross domestic product (GDP), the tenth-largest by purchasing power parity (PPP), and approximately 18th by nominal GDP per capita, contributing 2.4% of world GDP and 2.2% by PPP.",
      "• The UK is one of the most globalised economies, comprising four constituent countries: England, Scotland, Wales, and Northern Ireland.",
      "• In 2022, the United Kingdom was the fifth-largest exporter and the fourth-largest importer of goods and services worldwide.",
      "• The UK held the fourth-largest outward foreign direct investment (FDI) and the fifteenth-largest inward FDI in 2022.",
      "• Trade with the European Union in 2022 accounted for 42% of the UK’s exports and 48% of its total imports.",
      "• The UK maintains a highly efficient and robust social security system, which constitutes approximately 24.5% of its GDP.",
      "• The service sector dominates the UK economy, contributing 82% of GDP, with the financial services industry being particularly significant.",
      "• London is the world’s second-largest financial centre, while Edinburgh was ranked 17th globally and 6th in Europe for its financial services industry in 2021.",
      "• The UK’s technology sector is valued at US$1 trillion, ranking third globally behind the United States and China.",
      "• The aerospace industry in the UK is the second-largest national aerospace industry worldwide.",
      "• The pharmaceutical industry ranks as the tenth-largest globally and plays an important role in the UK economy.",
      "• Among the world’s 500 largest companies, 17 have their headquarters in the United Kingdom.",
      "• The UK economy benefits from North Sea oil and gas production, with reserves estimated at 2.5 billion barrels in 2021, although the UK has been a net importer of oil since 2005.",
      "• There are significant regional disparities in prosperity within the UK, with South East England and North East Scotland identified as the richest areas per capita.",
      "• London’s economy is the wealthiest city by GDP per capita in Europe.",
      "• In 2022, the United Kingdom invested approximately 2.8% of its GDP in research and development.",
      "• Historically, Britain was the first nation to industrialise in the 18th century.",
      "• During the 19th century, Britain’s expansive colonial empire and technological superiority secured its preeminent role in the global economy, accounting for 9.1% of the world’s GDP in 1870.",
      "• The Second Industrial Revolution, occurring rapidly in the United States and the German Empire, presented increasing economic challenges to the UK leading into the 20th century.",
      "• The financial and human costs of fighting both the First and Second World Wars further weakened the UK’s relative economic position.",
      "• Despite a relative decline in global dominance, the UK retains significant power and influence worldwide in the 21st century.",
      "• The UK economy experienced a significant decline during the Great Recession of 2008, followed by a period of weak growth.",
      "• Government economic involvement is primarily exercised by His Majesty’s Treasury, led by the Chancellor of the Exchequer, and the Department for Business and Trade.",
      "• Since 1979, the UK’s economic management has generally followed a broadly laissez-faire approach.",
      "• The Bank of England serves as the UK’s central bank, and since 1997, its Monetary Policy Committee has been responsible for setting interest rates, implementing quantitative easing, and providing forward guidance."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:06.119023",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3385,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "1945 to 1979",
    "text": "The WWII net losses in British national wealth amounted to 18.6% (£4.595\nbillion) of the prewar wealth (£24.68 billion), at 1938 prices. After the\nSecond World War, a new Labour government fully nationalised the Bank of\nEngland, civil aviation, telephone networks, railways, gas, electricity, and\nthe coal, iron and steel industries, affecting 2.3 million workers. Post-war,\nthe United Kingdom enjoyed a long period without a major recession; there was\na rapid growth in prosperity in the 1950s and 1960s, with unemployment staying\nlow and not exceeding 3.5% until the early 1970s. The annual rate of growth\nbetween 1960 and 1973 averaged 2.9%, although this figure was far behind some\nother European countries such as France, West Germany and Italy.\n\nDeindustrialisation meant the closure of operations in mining, heavy industry,\nand manufacturing, resulting in the loss of highly paid working-class jobs.\nThe UK's share of manufacturing output had risen from 9.5% in 1830 during the\nIndustrial Revolution to 22.9% in the 1870s. It fell to 13.6% by 1913, 10.7%\nby 1938, and 4.9% by 1973. Overseas competition, lack of innovation, trade\nunionism, the welfare state, loss of the British Empire, and cultural\nattitudes have all been put forward as explanations. It reached crisis point\nin the 1970s against the backdrop of a worldwide energy crisis, high\ninflation, and a dramatic influx of low-cost manufactured goods from Asia.\n\nDuring the 1973 oil crisis (which saw oil prices quadruple), the 1973–74 stock\nmarket crash, and the secondary banking crisis of 1973–75, the British economy\nfell into the 1973–75 recession and the government of Edward Heath was ousted\nby the Labour Party under Harold Wilson, which had previously governed from\n1964 to 1970. Wilson formed a minority government in March 1974 after the\ngeneral election on 28 February ended in a hung parliament. Wilson secured a\nthree-seat overall majority in a second election in October that year. The UK\nrecorded weaker growth than many other European nations in the 1970s; even\nafter the recession, the economy was blighted by rising unemployment and\ndouble-digit inflation, which exceeded 20% more than once and was rarely below\n10% after 1973.\n\nIn 1976, the UK was forced to apply for a loan of £2.3 billion from the\nInternational Monetary Fund. Denis Healey, then Chancellor of the Exchequer,\nwas required to implement public spending cuts and other economic reforms in\norder to secure the loan, and for a while the British economy improved, with\ngrowth of 4.3% in early 1979. Following the discovery of large North Sea oil\nreserves, the UK became a net exporter of oil by the end of the 1970s, which\ncontributed to a massive appreciation of the pound, making exports in general\nmore expensive and imports cheaper. Oil prices doubled between 1979 and 1980,\nfurther reducing manufacturing profitability. After the Winter of Discontent,\nwhen the UK was hit by numerous public sector strikes, the government of James\nCallaghan lost a vote of no confidence in March 1979. This triggered the\ngeneral election on 3 May 1979 which resulted in Margaret Thatcher's\nConservative Party forming a new government. In retrospect, the 1970s is\nconsidered to have been a \"lost decade\" for Britain economically (as well as\nculturally).",
    "openai_summarised_points": [
      "• The net losses in British national wealth due to World War II amounted to 18.6%, equivalent to £4.595 billion, based on prewar wealth valued at £24.68 billion at 1938 prices.",
      "• Following the Second World War, the Labour government fully nationalised key sectors including the Bank of England, civil aviation, telephone networks, railways, gas, electricity, and the coal, iron, and steel industries, impacting 2.3 million workers.",
      "• The post-war period in the United Kingdom was marked by a prolonged absence of major recessions, with rapid growth in prosperity during the 1950s and 1960s, and unemployment remaining low, not exceeding 3.5% until the early 1970s.",
      "• Between 1960 and 1973, the UK’s annual economic growth rate averaged 2.9%, which was significantly lower than growth rates experienced by other European countries such as France, West Germany, and Italy.",
      "• Deindustrialisation led to the closure of mining, heavy industry, and manufacturing operations, resulting in the loss of highly paid working-class jobs.",
      "• The UK’s share of global manufacturing output increased from 9.5% in 1830 during the Industrial Revolution to 22.9% in the 1870s, before declining to 13.6% by 1913, 10.7% by 1938, and further to 4.9% by 1973.",
      "• Factors contributing to deindustrialisation included overseas competition, lack of innovation, trade unionism, the welfare state, the loss of the British Empire, and prevailing cultural attitudes.",
      "• The 1970s saw a crisis point for the UK economy amid a global energy crisis, high inflation, and a significant influx of low-cost manufactured goods from Asia.",
      "• The 1973 oil crisis caused oil prices to quadruple, coinciding with the 1973–74 stock market crash and the secondary banking crisis of 1973–75, which precipitated the 1973–75 recession in the UK.",
      "• The Conservative government of Edward Heath was replaced by the Labour Party under Harold Wilson following the February 1974 general election, which resulted in a hung parliament; Wilson formed a minority government in March 1974 and secured a narrow three-seat majority in a second election in October 1974.",
      "• Throughout the 1970s, the UK economy experienced weaker growth compared to many European nations, with persistent rising unemployment and double-digit inflation that exceeded 20% on multiple occasions and rarely fell below 10% after 1973.",
      "• In 1976, the UK sought a £2.3 billion loan from the International Monetary Fund (IMF), which required Chancellor of the Exchequer Denis Healey to implement public spending cuts and economic reforms to secure the loan.",
      "• Following IMF-mandated reforms, the British economy showed signs of improvement, achieving a growth rate of 4.3% in early 1979.",
      "• The discovery of substantial North Sea oil reserves enabled the UK to become a net exporter of oil by the late 1970s, contributing to a significant appreciation of the pound sterling, which made UK exports more expensive and imports cheaper.",
      "• Oil prices doubled between 1979 and 1980, further undermining the profitability of the UK’s manufacturing sector.",
      "• The Winter of Discontent in 1978–79, characterized by widespread public sector strikes, culminated in the government of James Callaghan losing a vote of no confidence in March 1979.",
      "• The subsequent general election on 3 May 1979 resulted in Margaret Thatcher’s Conservative Party forming a new government, marking a political and economic turning point.",
      "• Retrospectively, the 1970s are regarded as a \"lost decade\" for Britain both economically and culturally due to stagnation, industrial decline, and social unrest."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:00.064852",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3288,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "1979 to 1997",
    "text": "A new period of neo-liberal economics began with this election. During the\n1980s, many state-owned industries and utilities were privatised, taxes cut,\ntrade union reforms passed and markets deregulated. GDP fell by 5.9%\ninitially, but growth subsequently returned and rose to an annual rate of 5%\nat its peak in 1988, one of the highest rates of any country in Europe.\n\nThatcher's modernisation of the economy was far from trouble-free; her battle\nwith inflation, which in 1980 had risen to 21.9%, resulted in a substantial\nincrease in unemployment from 5.3% in 1979 to over 10.4% by the start of 1982,\npeaking at nearly 11.9% in 1984 – a level not seen in Britain since the Great\nDepression. The rise in unemployment coincided with the early 1980s global\nrecession, after which UK GDP did not reach its pre-recession rate until 1983.\nIn spite of this, Thatcher was re-elected in June 1983 with a landslide\nmajority. Inflation had fallen to 3.7%, while interest rates were relatively\nhigh at 9.56%. The increase in unemployment was largely due to the\ngovernment's economic policy which resulted in the closure of outdated\nfactories and coal pits. Manufacturing in England and Wales declined from\naround 38% of jobs in 1961 to around 22% in 1981. This trend continued for\nmost of the 1980s, with newer industries and the service sector enjoying\nsignificant growth. Many jobs were also lost as manufacturing became more\nefficient and fewer people were required to work in the sector. Unemployment\nhad fallen below 3 million by the time of Thatcher's third successive election\nvictory in June 1987; and by the end of 1989 it was down to 1.6 million.\n\nBritain's economy slid into another global recession in late 1990; it shrank\nby a total of 6% from peak to trough, and unemployment increased from around\n6.9% in spring 1990 to nearly 10.7% by the end of 1993. However, inflation\ndropped from 10.9% in 1990 to 1.3% three years later. The subsequent economic\nrecovery was extremely strong, and unlike after the early 1980s recession, the\nrecovery saw a rapid and substantial fall in unemployment, which was down to\n7.2% by 1997, although the popularity of the Conservative government had\nfailed to improve with the economic upturn. The government won a fourth\nsuccessive election in 1992 under John Major, who had succeeded Thatcher in\nNovember 1990, but soon afterwards came Black Wednesday, which damaged the\nConservative government's reputation for economic competence, and from that\nstage onwards, the Labour Party was ascendant in the opinion polls,\nparticularly in the immediate aftermath of Tony Blair's election as party\nleader in July 1994 after the sudden death of his predecessor John Smith.\n\nDespite two recessions, wages grew consistently by around 2% per year in real\nterms from 1980 until 1997, and continued to grow until 2008.",
    "openai_summarised_points": [
      "• The period from 1979 to 1997 in the United Kingdom marked the beginning of a new era of neo-liberal economics, initiated by the election that brought Margaret Thatcher to power.",
      "• Throughout the 1980s, the UK government implemented widespread privatisation of state-owned industries and utilities, enacted trade union reforms, reduced taxes, and deregulated markets.",
      "• Initially, the UK’s GDP fell by 5.9%, but economic growth resumed and peaked at an annual rate of 5% in 1988, ranking among the highest growth rates in Europe at that time.",
      "• Inflation in 1980 reached a high of 21.9%, prompting Thatcher’s government to engage in a vigorous battle against inflation, which led to a significant rise in unemployment.",
      "• Unemployment increased from 5.3% in 1979 to over 10.4% by early 1982, peaking at nearly 11.9% in 1984, a level not seen since the Great Depression in Britain.",
      "• The rise in unemployment coincided with the global recession of the early 1980s; UK GDP did not return to its pre-recession level until 1983.",
      "• Despite economic difficulties, Thatcher won a landslide re-election victory in June 1983; by then, inflation had fallen to 3.7%, though interest rates remained relatively high at 9.56%.",
      "• The increase in unemployment was largely attributed to government policies that led to the closure of outdated factories and coal pits, accelerating structural changes in the economy.",
      "• Manufacturing employment in England and Wales declined from approximately 38% of jobs in 1961 to around 22% by 1981, a trend that continued through the 1980s.",
      "• Growth was concentrated in newer industries and the service sector, while manufacturing became more efficient, reducing the number of workers required.",
      "• By the time of Thatcher’s third consecutive election victory in June 1987, unemployment had fallen below 3 million, and by the end of 1989, it had decreased further to 1.6 million.",
      "• The UK economy entered another global recession in late 1990, shrinking by a total of 6% from peak to trough, with unemployment rising from about 6.9% in spring 1990 to nearly 10.7% by the end of 1993.",
      "• Inflation dropped significantly during this period, from 10.9% in 1990 to 1.3% three years later, indicating successful anti-inflationary measures despite economic contraction.",
      "• The economic recovery after the early 1990s recession was robust and featured a rapid and substantial decline in unemployment, which fell to 7.2% by 1997.",
      "• Despite the economic upturn, the Conservative government’s popularity did not improve; the party won a fourth successive election in 1992 under John Major, who had succeeded Thatcher in November 1990.",
      "• The Conservative government’s reputation for economic competence was damaged by Black Wednesday in 1992, after which the Labour Party gained ascendancy in opinion polls.",
      "• Labour’s rise in popularity was further bolstered by Tony Blair’s election as party leader in July 1994, following the sudden death of his predecessor John Smith.",
      "• Throughout the period from 1980 to 1997, despite two recessions, real wages consistently grew by approximately 2% per year and continued to increase until 2008."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:08.564404",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2840,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "1997 to 2009",
    "text": "In May 1997, Labour, led by Tony Blair, won the general election after 18\nyears of Conservative government. The Labour Government inherited a strong\neconomy with low inflation, falling unemployment, and a current account\nsurplus. Blair ran on a platform of New Labour which was characterised largely\nby the continuation of neo-liberal economic policies, but also supporting a\nstrong welfare state. In Britain it was largely viewed as a combination of\nsocialist and capitalist policies, being dubbed 'Third Way'. Four days after\nthe election, Gordon Brown, the new Chancellor of the Exchequer, gave the Bank\nof England the freedom to control monetary policy, which until then had been\ndirected by the government.\n\nDuring Blair's 10 years in office there were 40 successive quarters of\neconomic growth, lasting until the second quarter of 2008. GDP growth, which\nhad briefly reached 4% per year in the early 1990s, gently declining\nthereafter, was relatively anaemic compared to prior decades, such as the 6.5%\nper year peak in the early 1970s, although growth was smoother and more\nconsistent. Annual growth rates averaged 2.68% between 1992 and 2007, with the\nfinance sector accounting for a greater part than previously. The period saw\none of the highest GDP growth rates of any developed economy and the strongest\nof any European nation. At the same time, household debt rose from £420\nbillion in 1994 to £1 trillion in 2004 and £1.46 trillion in 2008 – more than\nthe entire GDP of the UK.\n\nThis extended period of growth ended in Q2 of 2008 when the United Kingdom\nentered the Great Recession brought about by the 2008 financial crisis. The UK\nwas particularly vulnerable to the crisis because its financial sector was the\nmost highly leveraged of any major economy. Beginning with the collapse of\nNorthern Rock, which was taken into public ownership in February 2008, other\nbanks had to be partly nationalised. The Royal Bank of Scotland Group, at its\npeak the fifth-largest bank in the world by market capitalisation, was\neffectively nationalised in October 2008. By mid-2009, HM Treasury had a\n70.33% controlling shareholding in RBS, and a 43% shareholding, through the UK\nFinancial Investments Limited, in Lloyds Banking Group. The Great Recession,\nas it came to be known, saw unemployment rise from just over 1.6 million in\nJanuary 2008 to nearly 2.5 million by October 2009.\n\nIn August 2008 the IMF warned that the country's outlook had worsened due to a\ntwin shock: financial turmoil and rising commodity prices. Both developments\nharmed the UK more than most developed countries, as it obtained revenue from\nexporting financial services while running deficits in goods and commodities,\nincluding food. In 2007, the UK had the world's third largest current account\ndeficit, due mainly to a large deficit in manufactured goods. In May 2008, the\nIMF advised the UK government to broaden the scope of fiscal policy to promote\nexternal balance. The UK's output per hour worked was on a par with the\naverage for the \"old\" EU-15 countries.",
    "openai_summarised_points": [
      "• In May 1997, the Labour Party, led by Tony Blair, won the UK general election, ending 18 years of Conservative government and inheriting a strong economy characterized by low inflation, falling unemployment, and a current account surplus.",
      "• Tony Blair's Labour government promoted \"New Labour,\" which combined neo-liberal economic policies with support for a strong welfare state, and was commonly described in Britain as a \"Third Way\" blending socialist and capitalist approaches.",
      "• Four days after the 1997 election, Gordon Brown, appointed Chancellor of the Exchequer, granted the Bank of England independence to control monetary policy, a function previously directed by the government.",
      "• During Blair’s decade in office, the UK experienced 40 consecutive quarters of economic growth, lasting until the second quarter of 2008, marking a sustained period of economic expansion.",
      "• UK GDP growth averaged 2.68% annually between 1992 and 2007, which was lower than the 4% peak in the early 1990s and significantly less than the 6.5% peak in the early 1970s, but growth was smoother and more consistent during this period.",
      "• The finance sector’s contribution to GDP growth increased substantially during this period, making the UK’s growth rate one of the highest among developed economies and the strongest in Europe.",
      "• Household debt in the UK rose sharply from £420 billion in 1994 to £1 trillion in 2004, and further to £1.46 trillion by 2008, exceeding the entire UK GDP at that time.",
      "• The prolonged growth period ended in the second quarter of 2008 when the UK entered the Great Recession, triggered by the 2008 global financial crisis.",
      "• The UK’s financial sector was particularly vulnerable to the crisis due to being the most highly leveraged among major economies, leading to the collapse and subsequent public ownership of Northern Rock in February 2008.",
      "• Other banks required partial nationalisation, including the Royal Bank of Scotland Group (RBS), which was effectively nationalised in October 2008; at its peak, RBS was the fifth-largest bank worldwide by market capitalization.",
      "• By mid-2009, HM Treasury held a 70.33% controlling share in RBS and a 43% shareholding in Lloyds Banking Group through UK Financial Investments Limited.",
      "• The Great Recession caused UK unemployment to rise significantly from just over 1.6 million in January 2008 to nearly 2.5 million by October 2009.",
      "• In August 2008, the International Monetary Fund (IMF) warned that the UK’s economic outlook had deteriorated due to a \"twin shock\" of financial turmoil and rising commodity prices, which disproportionately affected the UK compared to other developed countries.",
      "• The UK’s vulnerability stemmed from its reliance on revenue from exporting financial services while running deficits in goods and commodities, including food.",
      "• In 2007, the UK recorded the world’s third-largest current account deficit, primarily driven by a substantial deficit in manufactured goods.",
      "• In May 2008, the IMF recommended that the UK government broaden fiscal policy measures to promote external balance in response to the economic challenges.",
      "• The UK’s labor productivity, measured as output per hour worked, was comparable to the average of the \"old\" European Union 15 (EU-15) member countries during this period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:05.495024",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3043,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "2009 to 2020",
    "text": "In March 2009, the Bank of England (BoE) cut interest rates to a then-historic\nlow of 0.5% and began quantitative easing (QE) to boost lending and shore up\nthe economy. The UK exited the Great Recession in Q4 of 2009 having\nexperienced six consecutive quarters of negative growth, shrinking by 6.03%\nfrom peak to trough, making it the longest recession since records began and\nthe deepest since World War II. Support for Labour slumped during the\nrecession, and the general election of 2010 resulted in a coalition government\nbeing formed by the Conservatives and the Liberal Democrats.\n\nIn 2011, household, financial, and business debts stood at 420% of GDP in the\nUK. As the world's most indebted country, spending and investment were held\nback after the recession, creating economic malaise. However, it was\nrecognised that government borrowing, which rose from 52% to 76% of GDP, had\nhelped to avoid a 1930s-style depression. Within three years of the general\nelection, government cuts aimed at reducing the budget deficit had led to\npublic sector job losses well into six figures, but the private sector enjoyed\nstrong jobs growth.\n\nThe ten years following the Great Recession were characterised by extremes. In\n2015, employment was at its highest since records began, and GDP growth had\nbecome the fastest in the Group of Seven (G7) and Europe, but workforce\nproductivity was the worst since the 1820s, with any growth attributed to a\nfall in working hours. Output per hour worked was 18% below the average for\nthe rest of the G7. Real wage growth was the worst since the 1860s, and the\nGovernor of the Bank of England described it as a lost decade. Wages fell by\n10% in real terms in the eight years to 2016, whilst they grew across the OECD\nby an average of 6.7%. For 2015 as a whole, the current account deficit rose\nto a record high of 5.2% of GDP (£96.2bn), the highest in the developed world.\nIn Q4 2015, it exceeded 7%, a level not witnessed during peacetime since\nrecords began in 1772. The UK relied on foreign investors to plug the\nshortfall in its balance of payments. Homes had become less affordable, a\nproblem exacerbated by QE, without which house prices would have fallen by\n22%, according to the BoE's own analysis.\n\nA rise in unsecured household debt added to questions over the sustainability\nof the economic recovery in 2016. The BoE insisted there was no cause for\nalarm, despite having said two years earlier that the recovery was \"neither\nbalanced nor sustainable\". Following the UK's 2016 decision to leave the\nEuropean Union, the BoE cut interest rates to a new historic low of 0.25% for\njust over a year. It also increased the amount of QE since the start of the\nGreat Recession to £435bn. By Q4 2018 net borrowing in the UK was the highest\nin the OECD at 5% of GDP. Households had been in deficit for an unprecedented\nnine quarters in a row. Since the Great Recession, the country was no longer\nmaking a profit on its foreign investments. The Great Recession had a long\nterm effect on UK's growth; GDP growth slowed from an annual average of 3.0%\nbetween 1993 and 2007 to 1.5% between 2009 and 2023, while labour productivity\ngrowth slowed from an annual average of 1.9% between 1993 and 2008 to 0.4%\nbetween 2008 and 2023. As of early 2024, average wages in the UK adjusted by\ninflation are roughly the same as in 2008.",
    "openai_summarised_points": [
      "• In March 2009, the Bank of England (BoE) reduced interest rates to a historic low of 0.5% and initiated quantitative easing (QE) to stimulate lending and support the UK economy during the Great Recession.",
      "• The UK exited the Great Recession in the fourth quarter (Q4) of 2009 after enduring six consecutive quarters of negative economic growth, with a total contraction of 6.03% from peak to trough, marking the longest recession on record and the deepest since World War II.",
      "• During the recession, public support for the Labour Party declined significantly, culminating in the 2010 general election which resulted in a coalition government formed by the Conservative Party and the Liberal Democrats.",
      "• By 2011, the combined household, financial, and business debts in the UK amounted to 420% of GDP, positioning the UK as the world's most indebted country and constraining spending and investment post-recession, contributing to economic stagnation.",
      "• Government borrowing increased from 52% to 76% of GDP during this period, which was acknowledged as a critical factor in preventing a depression akin to that of the 1930s.",
      "• Within three years following the 2010 general election, austerity measures aimed at reducing the budget deficit led to public sector job losses in the six-figure range, while the private sector experienced robust employment growth.",
      "• The decade following the Great Recession was marked by economic extremes: by 2015, UK employment reached its highest recorded level, and GDP growth was the fastest among the Group of Seven (G7) nations and Europe.",
      "• Despite strong employment and GDP growth, workforce productivity in 2015 was the lowest since the 1820s, with any growth attributed primarily to a reduction in working hours rather than increased output per hour.",
      "• UK output per hour worked was 18% below the G7 average in 2015, indicating significant productivity challenges.",
      "• Real wage growth during this period was the worst since the 1860s; wages fell by 10% in real terms over the eight years leading to 2016, contrasting with an average real wage increase of 6.7% across OECD countries.",
      "• The Governor of the Bank of England described the 2010s as a \"lost decade\" for the UK economy due to stagnant wages and productivity.",
      "• In 2015, the UK’s current account deficit reached a record high of 5.2% of GDP (£96.2 billion), the largest among developed nations, and in Q4 2015, it exceeded 7%, a peacetime record since 1772.",
      "• The UK economy relied heavily on foreign investors to finance its balance of payments shortfall during this period.",
      "• Housing affordability worsened, exacerbated by quantitative easing; the BoE’s analysis suggested that without QE, house prices would have declined by 22%.",
      "• In 2016, rising unsecured household debt raised concerns about the sustainability of the economic recovery, although the BoE maintained there was no cause for alarm despite previously describing the recovery as \"neither balanced nor sustainable.\"",
      "• Following the 2016 Brexit referendum, the BoE further reduced interest rates to a new historic low of 0.25%, maintaining this rate for just over a year, and increased the total QE amount since the Great Recession to £435 billion.",
      "• By Q4 2018, the UK’s net borrowing was the highest in the OECD at 5% of GDP, with households running a deficit for an unprecedented nine consecutive quarters.",
      "• Since the Great Recession, the UK ceased generating profits on its foreign investments, marking a significant shift in its international financial position.",
      "• The long-term impact of the Great Recession included a slowdown in UK GDP growth from an annual average of 3.0% between 1993 and 2007 to 1.5% between 2009 and 2023.",
      "• Labour productivity growth also decelerated significantly, from an annual average of 1.9% between 1993 and 2008 to just 0.4% between 2008 and 2023.",
      "• As of early 2024, average wages in the UK, when adjusted for inflation, remained roughly at the same level as in 2008, indicating a prolonged period of wage stagnation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:09.588336",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3353,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "2020 to present",
    "text": "In March 2020, in response to the COVID-19 pandemic, a temporary ban was\nimposed on non-essential business and travel in the UK. The BoE cut the\ninterest rate to 0.1%. Economic growth had been weak before the crisis, with\nzero growth in Q4 2019. By May, 23% of the British workforce was furloughed\n(temporarily laid off). Government schemes were launched to help affected\nworkers. In the first half of 2020, GDP shrank by 22.6%, the deepest recession\nin UK history and worse than any other G7 or European country. During 2020 the\nBoE purchased £450 billion of government bonds, taking the amount of\nquantitative easing since the start of the Great Recession to £895 billion.\nOverall, GDP shrank by 9.9% in 2020, making it the worst contraction since the\nGreat Frost paralysed the economy in 1709.\n\nIn 2021 consumer price inflation (CPI) began rising sharply due to higher\nenergy and transport costs. With annual inflation approaching 11%, the BoE\ngradually increased the base rate to 2.25% during the first nine months of\n2022. The UK was not alone: global inflation rates were the highest in 40\nyears owing to the pandemic and Russia's invasion of Ukraine, though as of\nSeptember 2022[update], the country had the highest domestic electricity\nprices and amongst the highest gas prices in Europe, contributing to a cost of\nliving crisis. In February 2022 the BoE began quantitative tightening (a\nreversal of QE) by not renewing mature government bonds and in November\nstarted offloading bonds to private investors, signalling the end to an era of\neasy borrowing. In October 2022 year-on-year CPI was at 11.1%, the worst for\n41 years, food price inflation was 16.2%, gas prices 130% and electricity 66%.\n\nIn August 2023, the ONS revised its analysis of Britain's economic performance\nand said that Britain's GDP had surpassed its pre-COVID-19 size in the final\nquarter of 2021, a much earlier recovery from the pandemic than previously\nestimated and ahead of other big European countries. The British economy was\n0.6% larger in the fourth quarter of 2021 than in the final quarter of 2019,\ncompared with an earlier estimate that it was 1.2% smaller. The new Labour\ngovernment elected in summer 2024 implemented the most significant enhancement\nof employment regulations in a generation. This included an increase in\nminimum wages and a wide array of rights.",
    "openai_summarised_points": [
      "• In March 2020, the UK imposed a temporary ban on non-essential business and travel in response to the COVID-19 pandemic, while the Bank of England (BoE) cut the interest rate to 0.1%.",
      "• Prior to the pandemic, economic growth in the UK was weak, with zero growth recorded in the fourth quarter of 2019.",
      "• By May 2020, 23% of the British workforce was furloughed (temporarily laid off), and the government launched schemes to support affected workers.",
      "• During the first half of 2020, the UK’s GDP shrank by 22.6%, marking the deepest recession in UK history and a contraction worse than any other G7 or European country.",
      "• Throughout 2020, the BoE purchased £450 billion of government bonds, increasing the total quantitative easing (QE) since the Great Recession to £895 billion.",
      "• Overall, UK GDP contracted by 9.9% in 2020, representing the worst economic contraction since the Great Frost of 1709.",
      "• In 2021, consumer price inflation (CPI) in the UK began rising sharply, driven by higher energy and transport costs.",
      "• By the first nine months of 2022, annual inflation approached 11%, prompting the BoE to gradually increase the base interest rate to 2.25%.",
      "• The UK experienced some of the highest domestic electricity and gas prices in Europe as of September 2022, contributing to a significant cost of living crisis.",
      "• Global inflation rates in 2022 were the highest in 40 years, influenced by the COVID-19 pandemic and Russia’s invasion of Ukraine.",
      "• In February 2022, the BoE initiated quantitative tightening by not renewing mature government bonds, and in November 2022, it began offloading bonds to private investors, signaling an end to an era of easy borrowing.",
      "• In October 2022, year-on-year CPI reached 11.1%, the highest in 41 years; food price inflation was 16.2%, gas prices increased by 130%, and electricity prices rose by 66%.",
      "• In August 2023, the Office for National Statistics (ONS) revised its analysis, stating that UK GDP had surpassed its pre-COVID-19 level in the final quarter of 2021, indicating an earlier recovery than previously estimated and ahead of other major European economies.",
      "• The revised data showed the British economy was 0.6% larger in Q4 2021 than in Q4 2019, contrasting with earlier estimates that it was 1.2% smaller.",
      "• Following the summer 2024 election, the new Labour government implemented the most significant enhancement of employment regulations in a generation, including increases in minimum wages and the introduction of a wide array of new workers’ rights."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:06.719312",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2356,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic charts",
    "text": "* GDP year-on-year growth, 1949–2020\n\n* Workforce distribution in Great Britain 1841–1911, and in England and Wales 1921–2011\n\n* Unemployment rates, 1881–2017\n\n* Recovery periods for each recession (measured as GDP per capita), 1920–2009\n\n* Productivity, 1971–2019\n\n* Interest rates, 1800–2020\n\n* Balance of trade, 1948–2020\n\n* Balance of trade in crude oil and petroleum, 1890–2015\n\n* United Kingdom bonds inverted yield curve 1988–1991",
    "openai_summarised_points": [
      "• The GDP year-on-year growth chart covers the period from 1949 to 2020, illustrating the annual percentage changes in the United Kingdom's gross domestic product over seven decades.",
      "• Workforce distribution data is presented for Great Britain from 1841 to 1911, and separately for England and Wales from 1921 to 2011, detailing the composition and shifts in employment sectors during these historical intervals.",
      "• Unemployment rates are documented from 1881 to 2017, providing a long-term view of labor market fluctuations and economic health across more than a century.",
      "• Recovery periods following each recession, measured by GDP per capita, are analyzed for the years 1920 to 2009, highlighting the duration and pace of economic rebound after downturns.",
      "• Productivity trends are charted from 1971 to 2019, reflecting changes in output per worker or per hour worked within the UK economy over nearly five decades.",
      "• Interest rates data spans from 1800 to 2020, offering insight into the historical cost of borrowing and monetary policy shifts across more than two centuries.",
      "• The balance of trade figures are provided for the years 1948 to 2020, showing the difference between the value of exports and imports and indicating periods of trade surplus or deficit.",
      "• Balance of trade specifically in crude oil and petroleum is tracked from 1890 to 2015, illustrating the UK's trade performance in these key energy commodities over 125 years.",
      "• The United Kingdom bonds inverted yield curve is documented for the period 1988 to 1991, capturing an unusual financial phenomenon where short-term interest rates exceeded long-term rates, often interpreted as a recession indicator."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:08.598866",
      "openai_model": "gpt-4.1-mini",
      "content_length": 437,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Government spending and economic management",
    "text": "The Bank of England, London\n\nGovernment involvement in the economy is primarily exercised by HM Treasury,\nheaded by the Chancellor of the Exchequer. In recent years, the UK economy has\nbeen managed in accordance with principles of market liberalisation and low\ntaxation and regulation. Since 1997, the Bank of England's Monetary Policy\nCommittee, headed by the Governor of the Bank of England, has been responsible\nfor setting interest rates at the level necessary to achieve the overall\ninflation target for the economy that is set by the Chancellor each year. The\nScottish Government, subject to the approval of the Scottish Parliament, has\nthe power to vary the basic rate of income tax payable in Scotland by plus or\nminus 3 pence in the pound, though this power has not yet been exercised.\n\nIn the 20-year period from 1986/87 to 2006/07 government spending in the UK\naveraged around 40% of GDP. In July 2007, the UK had government debt at 35.5%\nof GDP. As a result of the 2008 financial crisis and the Great Recession,\ngovernment spending increased to a historically high level of 48% of GDP in\n2009–10, partly as a result of the cost of a series of bank bailouts. In terms\nof net government debt as a percentage of GDP, at the end of June 2014 public\nsector net debt excluding financial sector interventions was £1304.6 billion,\nequivalent to 77.3% of GDP. For the financial year of 2013–2014 public sector\nnet borrowing was £93.7 billion. This was £13.0 billion higher than in the\nfinancial year of 2012–2013.\n\nTaxation in the United Kingdom may involve payments to at least two different\nlevels of government: local government and central government (HM Revenue &\nCustoms). Local government is financed by grants from central government\nfunds, business rates, council tax, and, increasingly, fees and charges such\nas those from on-street parking. Central government revenues are mainly from\nincome tax, national insurance contributions, value added tax, corporation tax\nand fuel duty.",
    "openai_summarised_points": [
      "• Government involvement in the UK economy is primarily conducted by HM Treasury, which is headed by the Chancellor of the Exchequer.",
      "• Since 1997, the Bank of England's Monetary Policy Committee, led by the Governor of the Bank of England, has been responsible for setting interest rates to meet the inflation target established annually by the Chancellor.",
      "• The UK economy has been managed in recent years according to principles of market liberalisation, low taxation, and reduced regulation.",
      "• The Scottish Government, with approval from the Scottish Parliament, holds the power to vary the basic rate of income tax in Scotland by plus or minus 3 pence in the pound, although this power has not yet been exercised.",
      "• Between the fiscal years 1986/87 and 2006/07, government spending in the UK averaged approximately 40% of GDP.",
      "• In July 2007, UK government debt stood at 35.5% of GDP.",
      "• Following the 2008 financial crisis and the Great Recession, government spending rose to a historic peak of 48% of GDP in 2009–10, partly due to the costs associated with multiple bank bailouts.",
      "• As of the end of June 2014, public sector net debt in the UK, excluding financial sector interventions, was £1304.6 billion, equivalent to 77.3% of GDP.",
      "• For the financial year 2013–2014, public sector net borrowing totaled £93.7 billion, which was £13.0 billion higher than the borrowing in the financial year 2012–2013.",
      "• Taxation in the UK involves payments to at least two levels of government: local government and central government, the latter administered by HM Revenue & Customs.",
      "• Local government funding sources include grants from central government, business rates, council tax, and an increasing reliance on fees and charges such as those from on-street parking.",
      "• Central government revenues are primarily derived from income tax, national insurance contributions, value added tax (VAT), corporation tax, and fuel duty."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:10.214126",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1992,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Sectors",
    "text": "The UK's Office for National Statistics' Blue Book divides the UK economy into\n10 broad categories, to list their contribution to the UK economy in terms of\nGross value added and employment income (as measured by employee\ncompensation). These are\n\nContributions to the UK economy by sector  Sector | GVA (£M) | % of GVA | Employee compensation (£M) | % of employee compensation\n---|---|---|---|---\nAgriculture | 16,206 | 0.8 | 4,887 | 0.4\nProduction | 259,522 | 12.7 | 143,992 | 12.5\nConstruction | 119,920 | 5.9 | 53,142 | 4.6\nDistribution | 335,709 | 16.4 | 235,682 | 20.4\nInformation | 131,244 | 6.4 | 87,369 | 7.6\nFinancial | 185,434 | 9.1 | 87,738 | 7.6\nReal Estate | 266,136 | 13.0 | 18,011 | 1.6\nProfessional | 264,877 | 12.9 | 176,238 | 15.2\nGovernment (including health and education) | 405,455 | 19.8 | 313,594 | 27.1\nOther Services | 62,133 | 3.0 | 35,499 | 3.1",
    "openai_summarised_points": [
      "• The UK's Office for National Statistics' Blue Book categorizes the UK economy into 10 broad sectors, detailing their contributions in terms of Gross Value Added (GVA) and employee compensation.",
      "• The Agriculture sector contributes £16,206 million to GVA, representing 0.8% of the total GVA, and accounts for £4,887 million in employee compensation, which is 0.4% of total employee compensation.",
      "• The Production sector contributes £259,522 million to GVA, making up 12.7% of the total GVA, with employee compensation amounting to £143,992 million or 12.5% of the total.",
      "• The Construction sector adds £119,920 million to GVA, equating to 5.9% of the total GVA, and provides £53,142 million in employee compensation, representing 4.6% of the total.",
      "• The Distribution sector contributes £335,709 million to GVA, which is 16.4% of the total, and has employee compensation of £235,682 million, accounting for 20.4% of total employee compensation.",
      "• The Information sector contributes £131,244 million to GVA, or 6.4% of the total, with employee compensation of £87,369 million, representing 7.6% of total employee compensation.",
      "• The Financial sector contributes £185,434 million to GVA, comprising 9.1% of the total, and employee compensation totals £87,738 million, which is 7.6% of the total.",
      "• The Real Estate sector contributes £266,136 million to GVA, accounting for 13.0% of the total GVA, but employee compensation is comparatively low at £18,011 million, or 1.6% of total employee compensation.",
      "• The Professional sector contributes £264,877 million to GVA, representing 12.9% of the total, with employee compensation of £176,238 million, equating to 15.2% of total employee compensation.",
      "• The Government sector, including health and education, is the largest contributor with £405,455 million to GVA, making up 19.8% of the total, and employee compensation of £313,594 million, which is 27.1% of total employee compensation.",
      "• The Other Services sector contributes £62,133 million to GVA, or 3.0% of the total, and employee compensation is £35,499 million, representing 3.1% of total employee compensation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:15.319125",
      "openai_model": "gpt-4.1-mini",
      "content_length": 872,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Agriculture",
    "text": "Agriculture in the UK is intensive, highly mechanised, and efficient by\nEuropean standards.\n\nAgriculture in the UK is intensive, highly mechanised, and efficient by\nEuropean standards. The country produces around 65% of its food needs. The\nself-sufficiency level was just under 50% in the 1950s, peaking at 80% in the\n1980s, before declining to its present level at the turn of the 21st century.\n\nAgriculture added gross value of £12.18 billion to the economy in 2018, and\naround 467,000 people were employed in agriculture, hunting, forestry and\nfishing. It contributes around 0.5% of the UK's national GDP. Around two-\nthirds of production by value is devoted to livestock, and one-third to arable\ncrops. The agri-food sector as a whole (agriculture and food manufacturing,\nwholesale, catering, and retail) was worth £120 billion and accounts for 4\nmillion jobs in the UK.",
    "openai_summarised_points": [
      "• Agriculture in the United Kingdom is characterized by intensive practices, high mechanization, and efficiency that ranks well by European standards.",
      "• The UK produces approximately 65% of its own food requirements, reflecting a significant level of domestic food production.",
      "• The self-sufficiency level in food production was just under 50% during the 1950s, increased to a peak of 80% in the 1980s, and subsequently declined to around 65% by the turn of the 21st century.",
      "• In 2018, agriculture contributed a gross value of £12.18 billion to the UK economy, indicating its economic importance within the national context.",
      "• Employment in agriculture, hunting, forestry, and fishing sectors totaled approximately 467,000 people in 2018, highlighting the sector’s role as a source of rural employment.",
      "• Agriculture accounts for about 0.5% of the United Kingdom’s national Gross Domestic Product (GDP), demonstrating its relatively small but significant economic share.",
      "• Approximately two-thirds of agricultural production by value in the UK is devoted to livestock farming, while one-third is dedicated to arable crop production.",
      "• The broader agri-food sector, encompassing agriculture, food manufacturing, wholesale, catering, and retail, was valued at £120 billion and provided employment for around 4 million people across the UK."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:14.500077",
      "openai_model": "gpt-4.1-mini",
      "content_length": 874,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Construction",
    "text": "The construction industry of the United Kingdom employed around 2.3 million\npeople and contributed gross value of £123.2 billion to the economy in 2019.\n\nOne of the largest construction projects in the UK in recent years was\nCrossrail, costing an estimated £19 billion. It was the largest construction\nproject in Europe. Opened in 2022, it is a new railway line running east to\nwest through London and into the surrounding area, with a branch to Heathrow\nAirport. The main feature of the project is construction of 42 km (26 mi) of\nnew tunnels connecting stations in central London. High Speed 2 between London\nand the West Midlands is one of Europe's largest infrastructure projects.\nCrossrail 2 is a proposed rail route in the South East of England.",
    "openai_summarised_points": [
      "• The construction industry in the United Kingdom employed approximately 2.3 million people in 2019 and contributed a gross value of £123.2 billion to the national economy during the same year.",
      "• Crossrail, one of the largest construction projects in the UK in recent years, had an estimated cost of £19 billion and was recognized as the largest construction project in Europe.",
      "• Crossrail officially opened in 2022 and consists of a new railway line running east to west through London, extending into the surrounding areas, and includes a branch line to Heathrow Airport.",
      "• A key feature of the Crossrail project was the construction of 42 kilometers (26 miles) of new tunnels that connect various stations in central London.",
      "• High Speed 2 (HS2), a major infrastructure project connecting London and the West Midlands, is considered one of Europe’s largest infrastructure undertakings.",
      "• Crossrail 2 is a proposed rail route planned for the South East of England, intended to further enhance the region’s rail network."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:13.171924",
      "openai_model": "gpt-4.1-mini",
      "content_length": 751,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.2.1",
    "section_name": "Electricity, gas and water",
    "text": "This sector added gross value of £51.4 billion to the economy in 2018. The\nUnited Kingdom is expected to launch the building of new nuclear reactors to\nreplace existing generators and to boost the UK's energy reserves.",
    "openai_summarised_points": [
      "• The electricity, gas, and water sector contributed a gross value of £51.4 billion to the United Kingdom's economy in the year 2018.",
      "• The United Kingdom has plans to initiate the construction of new nuclear reactors aimed at replacing existing nuclear generators.",
      "• The development of new nuclear reactors is also intended to enhance and increase the UK's overall energy reserves."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:10.210089",
      "openai_model": "gpt-4.1-mini",
      "content_length": 218,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.2.2",
    "section_name": "Manufacturing",
    "text": "A Rolls-Royce Trent 1000 jet engine made in the UK\n\nIn the 1970s, manufacturing accounted for 25 per cent of the economy. Total\nemployment in manufacturing fell from 7.1 million in 1979 to 4.5 million in\n1992 and only 2.7 million in 2016, when it accounted for 10% of the economy.\n\nIn 2023, the manufacturing industry was worth £451.6 billion or $588 billion\nto the UK economy, according to the office of national statistics.\n\nManufacturing has increased in 36 of the last 50 years and was twice in 2007\nwhat it was in 1958.\n\nIn 2011, the UK manufacturing sector generated approximately £140.5 billion in\ngross value added and employed around 2.6 million people. Of the approximately\n£16 billion invested in R&D by UK businesses in 2008, approximately £12\nbillion was by manufacturing businesses. In 2008, the UK was the sixth-largest\nmanufacturer in the world measured by value of output.\n\nIn 2008, around 180,000 people in the UK were directly employed in the UK\nautomotive manufacturing sector. In that year the sector had a turnover of\n£52.5 billion, generated £26.6 billion of exports and produced around 1.45\nmillion passenger vehicles and 203,000 commercial vehicles. The UK is a major\ncentre for engine manufacturing, and in 2008 around 3.16 million engines were\nproduced in the country.\n\nThe aerospace industry of the UK is the second-largest aerospace industry in\nthe world (after the United States) and the largest in Europe. The industry\nemploys around 113,000 people directly and around 276,000 indirectly and has\nan annual turnover of around £20 billion. British companies with a major\npresence in the industry include BAE Systems and Rolls-Royce (the world's\nsecond-largest aircraft engine maker). European aerospace companies active in\nthe UK include Airbus, whose commercial aircraft, space, helicopter and\ndefence divisions employ over 13,500 people across more than 25 UK sites.\n\nThe pharmaceutical industry employs around 67,000 people in the UK and in 2007\ncontributed £8.4 billion to the UK's GDP and invested a total of £3.9 billion\nin research and development. In 2007 exports of pharmaceutical products from\nthe UK totalled £14.6 billion, creating a trade surplus in pharmaceutical\nproducts of £4.3 billion. The UK is home to GlaxoSmithKline and AstraZeneca,\nrespectively the world's third- and seventh-largest pharmaceutical companies.",
    "openai_summarised_points": [
      "• In the 1970s, manufacturing constituted 25 per cent of the UK economy, reflecting its significant role during that decade.",
      "• Employment in the UK manufacturing sector declined from 7.1 million workers in 1979 to 4.5 million in 1992, further decreasing to 2.7 million by 2016, at which point manufacturing accounted for 10% of the economy.",
      "• According to the Office for National Statistics, the manufacturing industry was valued at £451.6 billion (equivalent to $588 billion) in 2023, underscoring its substantial economic contribution.",
      "• Manufacturing output in the UK increased in 36 of the 50 years leading up to 2023 and was twice as large in 2007 compared to 1958, indicating long-term growth despite fluctuations.",
      "• In 2011, the UK manufacturing sector generated approximately £140.5 billion in gross value added and employed about 2.6 million people, highlighting its economic and employment significance.",
      "• Of the roughly £16 billion invested in research and development (R&D) by UK businesses in 2008, manufacturing businesses accounted for approximately £12 billion, demonstrating the sector’s central role in innovation.",
      "• In 2008, the UK ranked as the sixth-largest manufacturer globally by value of output, reflecting its prominent position in international manufacturing.",
      "• The UK automotive manufacturing sector employed around 180,000 people directly in 2008, with a turnover of £52.5 billion, exports valued at £26.6 billion, and production of approximately 1.45 million passenger vehicles and 203,000 commercial vehicles.",
      "• The UK is a major global centre for engine manufacturing, producing about 3.16 million engines in 2008, emphasizing its technical expertise in this field.",
      "• The UK aerospace industry is the second-largest worldwide after the United States and the largest in Europe, employing approximately 113,000 people directly and around 276,000 indirectly, with an annual turnover of about £20 billion.",
      "• Major British aerospace companies include BAE Systems and Rolls-Royce, the latter being the world’s second-largest aircraft engine manufacturer.",
      "• European aerospace companies with significant operations in the UK include Airbus, whose commercial aircraft, space, helicopter, and defence divisions employ over 13,500 people across more than 25 UK sites.",
      "• The UK pharmaceutical industry employed around 67,000 people in 2007, contributed £8.4 billion to the UK’s GDP, and invested £3.9 billion in research and development that year.",
      "• Pharmaceutical exports from the UK in 2007 totaled £14.6 billion, generating a trade surplus of £4.3 billion in pharmaceutical products.",
      "• The UK is home to GlaxoSmithKline and AstraZeneca, ranked respectively as the world’s third- and seventh-largest pharmaceutical companies, underscoring the country’s global pharmaceutical significance."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:24.089961",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2361,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.2.3",
    "section_name": "Mining, quarrying and hydrocarbons",
    "text": "The Blue Book 2013 reports that this sector added gross value of £31.4 billion\nto the UK economy in 2011. In 2007, the UK had a total energy output of 9.5\nquadrillion Btus (10 exajoules), of which the composition was oil (38%),\nnatural gas (36%), coal (13%), nuclear (11%) and other renewables (2%). In\n2009, the UK produced 1.5 million barrels per day (bbl/d) of oil and consumed\n1.7 million bbl/d. Production is now in decline and the UK has been a net\nimporter of oil since 2005. As of 2010 the UK has around 3.1 billion barrels\nof proven crude oil reserves, the largest of any EU member state.\n\nIn 2009, the UK was the 13th largest producer of natural gas in the world and\nthe largest producer in the EU. Production is now in decline and the UK has\nbeen a net importer of natural gas since 2004. In 2009 the UK produced 19.7\nmillion tons of coal and consumed 60.2 million tons. In 2005 it had proven\nrecoverable coal reserves of 171 million tons. It has been estimated that\nidentified onshore areas have the potential to produce between 7 billion\ntonnes and 16 billion tonnes of coal through underground coal gasification\n(UCG). Based on current UK coal consumption, these volumes represent reserves\nthat could last the UK between 200 and 400 years.\n\nThe UK is home to a number of large energy companies, including two of the six\noil and gas \"supermajors\" – BP and Shell plc. The UK is also rich in a number\nof natural resources, including coal, tin, limestone, iron ore, salt, clay,\nchalk, gypsum, lead and silica.",
    "openai_summarised_points": [
      "• The Blue Book 2013 reports that the mining, quarrying, and hydrocarbons sector contributed a gross value of £31.4 billion to the UK economy in 2011.",
      "• In 2007, the UK had a total energy output of 9.5 quadrillion Btus (10 exajoules), composed of oil (38%), natural gas (36%), coal (13%), nuclear energy (11%), and other renewables (2%).",
      "• In 2009, the UK produced 1.5 million barrels per day (bbl/d) of oil while consuming 1.7 million bbl/d, indicating production was insufficient to meet domestic demand.",
      "• The UK’s oil production has been in decline since 2005, and the country has been a net importer of oil from that year onward.",
      "• As of 2010, the UK possessed approximately 3.1 billion barrels of proven crude oil reserves, the largest amount held by any European Union member state.",
      "• In 2009, the UK ranked as the 13th largest natural gas producer globally and was the largest natural gas producer within the European Union.",
      "• UK natural gas production has been declining, with the country becoming a net importer of natural gas since 2004.",
      "• Coal production in the UK in 2009 was 19.7 million tons, while coal consumption was significantly higher at 60.2 million tons.",
      "• In 2005, the UK had proven recoverable coal reserves totaling 171 million tons.",
      "• Identified onshore areas in the UK have the potential to yield between 7 billion and 16 billion tonnes of coal through underground coal gasification (UCG).",
      "• Based on current coal consumption rates, these UCG reserves could supply the UK with coal for between 200 and 400 years.",
      "• The UK hosts several major energy companies, including two of the six global oil and gas \"supermajors\": BP and Shell plc.",
      "• The UK is endowed with a variety of natural resources, including coal, tin, limestone, iron ore, salt, clay, chalk, gypsum, lead, and silica."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:20.144574",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1519,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Service industries",
    "text": "The service sector is the dominant sector of the UK economy, and it accounted\nfor 82% of GDP in 2023.",
    "openai_summarised_points": [
      "• The service sector is the dominant sector of the United Kingdom's economy.",
      "• In 2023, the service sector accounted for 82% of the UK's Gross Domestic Product (GDP)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:11.321590",
      "openai_model": "gpt-4.1-mini",
      "content_length": 101,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Creative industries",
    "text": "The creative industries accounted for 7% of gross value added (GVA) in 2005\nand grew at an average of 6% per annum between 1997 and 2005. Key areas\ninclude London and the North West of England, which are the two largest\ncreative industry clusters in Europe. According to the British Fashion\nCouncil, the fashion industry's contribution to the UK economy in 2014 is £26\nbillion, up from £21 billion in 2009. The UK is home to the world's largest\nadvertising company, WPP.",
    "openai_summarised_points": [
      "• The creative industries contributed 7% of the United Kingdom's gross value added (GVA) in 2005, reflecting a significant portion of the national economy.",
      "• Between 1997 and 2005, the creative industries in the UK experienced an average annual growth rate of 6%, indicating robust expansion over this period.",
      "• London and the North West of England are identified as the two largest creative industry clusters in Europe, highlighting their importance as key regional hubs for creative economic activity.",
      "• According to the British Fashion Council, the fashion industry’s contribution to the UK economy was valued at £26 billion in 2014, demonstrating substantial growth from £21 billion in 2009.",
      "• The United Kingdom is the headquarters of WPP, recognized as the world’s largest advertising company, underscoring the country’s global leadership in the advertising sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:14.725644",
      "openai_model": "gpt-4.1-mini",
      "content_length": 470,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.2",
    "section_name": "Education, health and social work",
    "text": "The Queen Elizabeth Hospital Birmingham is a university hospital affiliated\nwith the University of Birmingham. It has the largest single-floor critical\ncare unit in the world.\n\nAccording to The Blue Book 2013 the education sector added a gross value of\n£84.6 billion in 2011 whilst human health and social work activities added\n£104.0 billion in 2011.\n\nIn the UK the majority of the healthcare sector consists of the state funded\nand operated National Health Service (NHS), which accounts for over 80% of all\nhealthcare spending in the UK and has a workforce of around 1.7 million,\nmaking it the largest employer in Europe, and putting it amongst the largest\nemployers in the world. The NHS operates independently in each of the four\nconstituent countries of the UK. The NHS in England is by far the largest of\nthe four parts and had a turnover of £92.5 billion in 2008.\n\nIn 2007/08 higher education institutions in the UK had a total income of £23\nbillion and employed a total of 169,995 staff. In 2007/08 there were 2,306,000\nhigher education students in the UK (1,922,180 in England, 210,180 in\nScotland, 125,540 in Wales and 48,200 in Northern Ireland).",
    "openai_summarised_points": [
      "• The Queen Elizabeth Hospital Birmingham is a university hospital affiliated with the University of Birmingham and features the largest single-floor critical care unit in the world.",
      "• According to The Blue Book 2013, the education sector in the UK contributed a gross value of £84.6 billion in 2011, while human health and social work activities contributed £104.0 billion in the same year.",
      "• The majority of the UK healthcare sector is composed of the state-funded and operated National Health Service (NHS), which accounts for over 80% of all healthcare spending in the UK.",
      "• The NHS employs approximately 1.7 million people, making it the largest employer in Europe and one of the largest employers worldwide.",
      "• The NHS operates independently in each of the four constituent countries of the UK: England, Scotland, Wales, and Northern Ireland.",
      "• The NHS in England is the largest of the four NHS organizations, with a turnover of £92.5 billion in 2008.",
      "• In the 2007/08 academic year, higher education institutions in the UK had a total income of £23 billion and employed 169,995 staff.",
      "• During 2007/08, there were 2,306,000 higher education students in the UK, distributed as follows: 1,922,180 in England, 210,180 in Scotland, 125,540 in Wales, and 48,200 in Northern Ireland."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:17.675828",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1157,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.3",
    "section_name": "Financial and business services",
    "text": "The UK financial services industry added gross value of £116.4 billion to the\nUK economy in 2011. The UK's exports of financial and business services make a\nsignificant positive contribution towards the country's balance of payments.\n\nPaternoster Square, home of the London Stock Exchange\n\nLondon is a major centre for international business and commerce and is one of\nthe three \"command centres\" of the global economy (alongside New York City and\nTokyo).\n\nThere are over 500 banks with offices in London, and it is the leading\ninternational centre for banking, insurance, Eurobonds, transactions in\nforeign currencies and energy futures. London's financial services industry is\nprimarily based in the City of London and Canary Wharf. The City houses the\nLondon Stock Exchange, the London Metal Exchange, Lloyd's of London, and the\nBank of England. Canary Wharf began development in the 1980s and is now home\nto major financial institutions such as Barclays Bank, Citigroup and HSBC, as\nwell as the UK Financial Services Authority. London is also a major centre for\nother business and professional services, and four of the six largest law\nfirms in the world are headquartered there.\n\nSeveral other major UK cities have large financial sectors and related\nservices. Edinburgh has one of the largest financial centres in Europe and is\nhome to the headquarters of Lloyds Banking Group, NatWest Group and Standard\nLife. Leeds is the UK's largest centre for business and financial services\noutside London, and the largest centre for legal services in the UK after\nLondon.\n\nAccording to a series of research papers and reports published in the\nmid-2010s, Britain's financial firms provide sophisticated methods to launder\nbillions of pounds annually, including money from the proceeds of corruption\naround the world as well as the world's drug trade, thus making the city a\nglobal hub for illicit finance. According to a Deutsche Bank study published\nin March 2015, Britain was attracting circa one billion pounds of capital\ninflows a month not recorded by official statistics, up to 40 per cent\nprobably originating from Russia, which implies misreporting by financial\ninstitutions, sophisticated tax avoidance, and the UK's \"safe-haven\"\nreputation.",
    "openai_summarised_points": [
      "• In 2011, the UK financial services industry contributed a gross value of £116.4 billion to the UK economy, highlighting its significant economic impact.",
      "• The UK's exports of financial and business services play a crucial role in positively influencing the country's balance of payments.",
      "• London is recognized as a major global centre for international business and commerce, identified as one of the three \"command centres\" of the global economy alongside New York City and Tokyo.",
      "• Over 500 banks maintain offices in London, establishing the city as the leading international hub for banking, insurance, Eurobonds, foreign currency transactions, and energy futures trading.",
      "• The financial services industry in London is primarily concentrated in two key areas: the City of London and Canary Wharf.",
      "• The City of London hosts several major financial institutions and markets, including the London Stock Exchange, the London Metal Exchange, Lloyd's of London, and the Bank of England.",
      "• Canary Wharf, developed beginning in the 1980s, houses major financial institutions such as Barclays Bank, Citigroup, HSBC, and the UK Financial Services Authority.",
      "• London also serves as a major centre for other business and professional services, with four of the six largest law firms in the world headquartered in the city.",
      "• Outside London, several other UK cities have significant financial sectors and related services: Edinburgh is one of Europe's largest financial centres and hosts the headquarters of Lloyds Banking Group, NatWest Group, and Standard Life.",
      "• Leeds is the largest centre for business and financial services in the UK outside London and ranks as the second-largest centre for legal services in the UK after London.",
      "• Research papers and reports from the mid-2010s reveal that British financial firms provide sophisticated mechanisms facilitating the laundering of billions of pounds annually, including funds derived from global corruption and the international drug trade, positioning London as a global hub for illicit finance.",
      "• A Deutsche Bank study published in March 2015 found that Britain attracted approximately one billion pounds of capital inflows per month that were not recorded in official statistics, with up to 40 percent likely originating from Russia.",
      "• The unrecorded capital inflows suggest misreporting by financial institutions, advanced tax avoidance strategies, and the UK's reputation as a \"safe-haven\" for capital."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:25.151340",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2245,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.4",
    "section_name": "Hotels and restaurants",
    "text": "The Blue Book 2013 reports that this industry added gross value of £36.6\nbillion to the UK economy in 2011. InterContinental Hotels Group (IHG),\nheadquartered in Denham, Buckinghamshire, is currently the world's largest\nhotelier, owning and operating hotel brands such as InterContinental, Holiday\nInn and Crowne Plaza.",
    "openai_summarised_points": [
      "• The Blue Book 2013 reports that the hotels and restaurants industry contributed a gross value of £36.6 billion to the United Kingdom economy in the year 2011.",
      "• InterContinental Hotels Group (IHG), which is headquartered in Denham, Buckinghamshire, is recognized as the world's largest hotelier.",
      "• IHG owns and operates several prominent hotel brands, including InterContinental, Holiday Inn, and Crowne Plaza."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:16.959112",
      "openai_model": "gpt-4.1-mini",
      "content_length": 319,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.5",
    "section_name": "Informal",
    "text": "A study in 2014 found that sex work and associated services added over £5\nbillion to the economy each year.",
    "openai_summarised_points": [
      "• A 2014 study determined that sex work and related services contributed in excess of £5 billion annually to the United Kingdom's economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:16.444261",
      "openai_model": "gpt-4.1-mini",
      "content_length": 107,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.6",
    "section_name": "Public administration and defence",
    "text": "The Blue Book 2013 reports that this sector added gross value of £70.4 billion\nto the UK economy in 2011.",
    "openai_summarised_points": [
      "• The Blue Book 2013 reports that the public administration and defence sector contributed a gross value of £70.4 billion to the United Kingdom economy in the year 2011."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:17.376358",
      "openai_model": "gpt-4.1-mini",
      "content_length": 105,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.7",
    "section_name": "Real estate and renting activities",
    "text": "The Trafford Centre shopping complex in Manchester was sold for £1.6 billion\nin 2011 in the largest property sale in British history.\n\nNotable real estate companies in the United Kingdom include British Land,\nLandsec and the Peel Group. The UK property market boomed for the seven years\nup to 2008, and in some areas property trebled in value over that period. The\nincrease in property prices had a number of causes: low interest rates, credit\ngrowth, economic growth, rapid growth in buy-to-let property investment,\nforeign property investment in London and planning restrictions on the supply\nof new housing.\n\nIn England and Wales between 1997 and 2016, average house prices increased by\n259%, while earnings increased by 68%. An average home cost 3.6 times annual\nearnings in 1997 compared to 7.6 in 2016. Rent has nearly doubled as a share\nof GDP since 1985, and is now larger than the manufacturing sector. In 2014,\nrent and imputed rent – an estimate of how much home-owners would pay if they\nrented their home – accounted for 12.3% of GDP.",
    "openai_summarised_points": [
      "• The Trafford Centre shopping complex in Manchester was sold in 2011 for £1.6 billion, marking the largest property sale in British history.",
      "• Prominent real estate companies in the United Kingdom include British Land, Landsec, and the Peel Group.",
      "• The UK property market experienced a boom for seven years leading up to 2008, during which property values in some areas trebled.",
      "• Several factors contributed to the increase in property prices during this period: low interest rates, credit growth, overall economic growth, rapid expansion in buy-to-let property investment, foreign investment in London property, and planning restrictions limiting the supply of new housing.",
      "• Between 1997 and 2016, average house prices in England and Wales rose by 259%, while average earnings increased by only 68%.",
      "• The ratio of average home cost to annual earnings increased significantly, from 3.6 times in 1997 to 7.6 times in 2016.",
      "• Since 1985, rent has nearly doubled as a share of the UK’s GDP and has grown to exceed the size of the manufacturing sector.",
      "• In 2014, rent and imputed rent—which estimates the rental value homeowners would pay if they rented their own homes—accounted for 12.3% of the United Kingdom’s GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:23.207359",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1046,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.8",
    "section_name": "Tourism",
    "text": "The British Museum received 6.2 million visitors in 2019.\n\nWith over 40 million visits in 2019, inbound tourism contributed £28.5 billion\nto the British economy, although just over half of that money was spent in\nLondon, which was the third most visited city in the world (21.7 million),\nbehind second-placed Bangkok and first-placed Hong Kong.\n\nThe UK's 10 most significant inbound tourism markets in 2023:****\n\nRank  | Market  | Spend  | Visitors\n---|---|---|---\n1  | United States  | £6.3 billion  | 5,122,000\n2  | Germany  | £1.8 billion  | 2,957,000\n3  | France  | £1.6 billion  | 3,172,000\n4  | Australia  | £1.6 billion  | 1,169,000\n5  | Ireland  | £1.2 billion  | 2,889,000\n6  | Spain  | £1.1 billion  | 2,210,000\n7  | Netherlands  | £1.1 billion  | 1,960,000\n8  | Italy  | £973 million  | 1,696,000\n9  | Canada  | £970 million  | 1,003,000\n10  | United Arab Emirates  | £914 million  | 477,000",
    "openai_summarised_points": [
      "• The British Museum attracted 6.2 million visitors in the year 2019.",
      "• Inbound tourism to the United Kingdom accounted for over 40 million visits in 2019, generating £28.5 billion in revenue for the British economy.",
      "• More than half of the inbound tourism expenditure in 2019 was concentrated in London, which ranked as the third most visited city globally with 21.7 million visitors.",
      "• London was surpassed only by Hong Kong, the most visited city, and Bangkok, the second most visited city worldwide in 2019.",
      "• In 2023, the United States was the largest inbound tourism market for the UK, contributing £6.3 billion in spending from 5,122,000 visitors.",
      "• Germany ranked second among the UK's inbound tourism markets in 2023, with £1.8 billion spent by 2,957,000 visitors.",
      "• France was the third largest market in 2023, generating £1.6 billion from 3,172,000 visitors to the UK.",
      "• Australia also contributed £1.6 billion in 2023, with 1,169,000 visitors, making it the fourth largest inbound tourism market for the UK.",
      "• Ireland ranked fifth in 2023, with £1.2 billion spent by 2,889,000 visitors to the UK.",
      "• Spain was the sixth largest inbound market in 2023, contributing £1.1 billion from 2,210,000 visitors.",
      "• The Netherlands also contributed £1.1 billion in 2023, with 1,960,000 visitors, ranking seventh among inbound tourism markets.",
      "• Italy was the eighth largest inbound tourism market in 2023, generating £973 million from 1,696,000 visitors.",
      "• Canada ranked ninth in 2023, with £970 million spent by 1,003,000 visitors to the UK.",
      "• The United Arab Emirates was the tenth largest inbound tourism market in 2023, contributing £914 million from 477,000 visitors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:23.816423",
      "openai_model": "gpt-4.1-mini",
      "content_length": 902,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.8.1",
    "section_name": "Effects of the COVID-19 pandemic",
    "text": "The travel restrictions and lockdowns necessitated by the pandemic negatively\naffected the entire hospitality/tourism section in 2020 with a 76% reduction\nin \"inbound tourism\" to the UK that year according to VisitBritain. The\nJanuary 2021 forecast for the year indicated an estimate that visits from\nother nations would be up \"21% on 2020 but only 29% of the 2019 level\". Some\nincrease was expected during 2021, slowly at first; the tourism authority\nconcluded that the number of visits was not expected to come \"even close to\nnormal levels\".\n\nThe same VisitBritain report also discussed the effects of the pandemic on\ndomestic travel within the UK in 2020, citing a significant reduction in\nspending, for an estimated decline of 62% over the previous year. As of\nJanuary 2021, the forecast for the year suggested that spending would increase\nby 79% over the previous year and that \"the value of spending will be back to\n84% of 2019 levels\" by the end of 2021.\n\nSome of the \"COVID-19 restrictions\" on domestic travel were to be loosened on\n12 April 2021 and the UK planned to begin relaxing some restrictions on travel\nfrom other nations in mid May. The latter plan became less certain as of 8\nApril 2021 when sources in the European Union stated on that a \"third wave of\nthe pandemic [was sweeping] the continent\"; the B117 variant was of particular\nconcern. Two days earlier, PM Boris Johnson had made it clear that \"We don't\nwant to see the virus being reimported into this country from abroad\". All\ntravel restrictions ended on 18 March 2022.",
    "openai_summarised_points": [
      "• The COVID-19 pandemic led to travel restrictions and lockdowns in 2020, causing a 76% reduction in inbound tourism to the UK, as reported by VisitBritain.",
      "• VisitBritain's January 2021 forecast estimated that visits from other nations in 2021 would increase by 21% compared to 2020 but would only reach 29% of the 2019 levels.",
      "• The tourism authority anticipated a slow recovery in 2021, concluding that the number of visits would not come \"even close to normal levels\" during that year.",
      "• Domestic travel within the UK also suffered significantly in 2020, with spending declining by an estimated 62% compared to the previous year, according to the same VisitBritain report.",
      "• As of January 2021, forecasts predicted that domestic travel spending would increase by 79% over 2020 levels and reach 84% of the 2019 spending value by the end of 2021.",
      "• Some COVID-19 restrictions on domestic travel were scheduled to be loosened on 12 April 2021.",
      "• The UK planned to begin relaxing certain travel restrictions on international arrivals in mid-May 2021.",
      "• On 8 April 2021, the plan to ease international travel restrictions became uncertain due to reports from European Union sources about a \"third wave of the pandemic\" sweeping the continent, with particular concern over the B117 variant.",
      "• On 6 April 2021, UK Prime Minister Boris Johnson emphasized the government's stance against allowing the virus to be reimported into the UK from abroad.",
      "• All travel restrictions in the UK were officially ended on 18 March 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:25.154464",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1547,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.9",
    "section_name": "Transport, storage and communication",
    "text": "The East Coast Main Line (ECML) is a 393-mile long (632 km) high-speed line\nbetween its southern terminus at London King's Cross station and Edinburgh\nWaverley via Peterborough, Doncaster, York, Darlington, Durham and Newcastle.\n\nThe transport and storage industry added a gross value of £59.2 billion to the\nUK economy in 2011 and the telecommunication industry added a gross value of\n£25.1 billion in the same year.\n\nThe UK has a total road network of 246,700 miles (397,025 km) with 31,400\nmiles (50,533 km) of major roads, including 2,300 miles (3,701 km) of\nmotorway. The railway infrastructure, in Great Britain, is owned by Network\nRail which has 19,291 miles (31,046 km) of railway lines, of which 9,866 miles\n(15,878 km) is open for traffic. There are a further 206.5 miles (332.3 km) of\ntrack in Northern Ireland, owned and operated by Northern Ireland Railways.\n\nThe government is to spend £56 billion on a new high-speed railway line, HS2,\nwith the first phase from London to Birmingham costing £27 billion. Crossrail\n(later branded the Elizabeth line), which was completed and officially opened\nin 2022, is Europe's largest infrastructure project with a £15 billion\nprojected cost.\n\nNational Highways is the government-owned company responsible for trunk roads\nand motorways in England apart from the privately owned and operated M6 Toll.\n\nIn the year from February 2017 to January 2018, UK airports handled a total of\n284.8 million passengers. In that period the three largest airports were\nLondon Heathrow Airport (78.0 million passengers), Gatwick Airport (45.6\nmillion passengers) and Manchester Airport (27.8 million passengers).\nHeathrow, located 14+1⁄2 miles (23.3 km) west of the capital, has the most\ninternational passenger traffic of any airport in the world. It is the hub for\nthe UK flag carrier British Airways and Virgin Atlantic. London's six\ncommercial airports form the world's largest city airport system measured by\npassenger traffic with 171 million passengers in 2017.",
    "openai_summarised_points": [
      "• The East Coast Main Line (ECML) is a high-speed railway line measuring 393 miles (632 km) in length, connecting London King's Cross station in the south to Edinburgh Waverley in the north, passing through Peterborough, Doncaster, York, Darlington, Durham, and Newcastle.",
      "• In 2011, the transport and storage industry contributed a gross value of £59.2 billion to the UK economy, while the telecommunication industry added a gross value of £25.1 billion in the same year.",
      "• The United Kingdom possesses a total road network of 246,700 miles (397,025 km), which includes 31,400 miles (50,533 km) of major roads; among these major roads, 2,300 miles (3,701 km) are designated motorways.",
      "• Network Rail owns the railway infrastructure in Great Britain, encompassing 19,291 miles (31,046 km) of railway lines, of which 9,866 miles (15,878 km) are currently open for traffic.",
      "• Northern Ireland has an additional 206.5 miles (332.3 km) of railway track, which is owned and operated by Northern Ireland Railways.",
      "• The UK government has committed to spending £56 billion on the High Speed 2 (HS2) railway project, with the first phase from London to Birmingham estimated to cost £27 billion.",
      "• Crossrail, later branded as the Elizabeth line, was completed and officially opened in 2022; it is recognized as Europe's largest infrastructure project with a projected cost of £15 billion.",
      "• National Highways is a government-owned company responsible for managing trunk roads and motorways in England, excluding the M6 Toll, which is privately owned and operated.",
      "• Between February 2017 and January 2018, UK airports collectively handled 284.8 million passengers.",
      "• The three largest UK airports by passenger numbers during this period were London Heathrow Airport with 78.0 million passengers, Gatwick Airport with 45.6 million passengers, and Manchester Airport with 27.8 million passengers.",
      "• London Heathrow Airport, located 14.5 miles (23.3 km) west of central London, handles the highest volume of international passenger traffic of any airport worldwide.",
      "• Heathrow Airport serves as the primary hub for the UK flag carrier British Airways and for Virgin Atlantic.",
      "• The six commercial airports serving London collectively form the world's largest city airport system by passenger traffic, accommodating 171 million passengers in 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:31.666435",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2003,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "3.3.10",
    "section_name": "Wholesale and retail trade",
    "text": "This sector includes the motor trade, auto repairs, personal and household\ngoods industries. The Blue Book 2013 reports that this sector added gross\nvalue of £151.8 billion to the UK economy in 2011.\n\nAs of 2016, high-street retail spending accounted for about 33% of consumer\nspending and 20% of GDP. Because 75% of goods bought in the United Kingdom are\nmade overseas, the sector only accounts for 5.7% of gross value added to the\nBritish economy. Online sales account for 22% of retail spending in the UK,\nthird highest in the world after China and South Korea, and double that of the\nUnited States.\n\nThe UK grocery market is dominated by four companies: Tesco (26.9% market\nshare), Sainsbury's (14.8%), Asda (14.3%) and Morrisons (8.8%) in March 2023,\nthese supermarkets are known as the \"Big Four\". However discount supermarkets\nsuch as Aldi and Lidl have grown in popularity, with Aldi's market share now\nworth 9.9%.\n\nLondon is a major retail centre and in 2010 had the highest non-food retail\nsales of any city in the world, with a total spend of around £64.2 billion.\nOutside of London, Manchester and Birmingham are also major retail\ndestinations, the UK is also home to many large out of town shopping centres\nlike Meadowhall, away from the main high streets in town and city centres.\nWhilst the big international names dominate most towns and cities have streets\nor areas with many often quirky independent businesses. The UK-based Tesco is\nthe fourth-largest retailer in Europe measured by turnover (after Swartz,\nAldi, and Carrefour in 2019).",
    "openai_summarised_points": [
      "• The wholesale and retail trade sector in the United Kingdom encompasses the motor trade, auto repairs, and personal and household goods industries.",
      "• According to The Blue Book 2013, this sector contributed a gross value of £151.8 billion to the UK economy in 2011.",
      "• As of 2016, high-street retail spending represented approximately 33% of total consumer spending and accounted for 20% of the UK’s Gross Domestic Product (GDP).",
      "• Despite high consumer spending, the sector contributes only 5.7% of gross value added to the British economy, largely because 75% of goods purchased in the UK are imported from overseas.",
      "• Online retail sales constitute 22% of total retail spending in the UK, ranking third globally behind China and South Korea, and are twice the proportion of online sales in the United States.",
      "• The UK grocery market is predominantly controlled by four major supermarket chains known as the \"Big Four\": Tesco with a 26.9% market share, Sainsbury’s with 14.8%, Asda with 14.3%, and Morrisons with 8.8%, as of March 2023.",
      "• Discount supermarket chains Aldi and Lidl have increased in popularity, with Aldi holding a 9.9% market share as of March 2023.",
      "• London serves as a major retail hub, having recorded the highest non-food retail sales of any city worldwide in 2010, with total spending around £64.2 billion.",
      "• Outside London, Manchester and Birmingham are significant retail centers, and the UK features numerous large out-of-town shopping centers such as Meadowhall, located away from traditional high streets in town and city centers.",
      "• While international retail chains dominate most urban areas, many UK towns and cities maintain streets or districts characterized by numerous independent and often unique businesses.",
      "• Tesco, a UK-based company, was the fourth-largest retailer in Europe by turnover in 2019, ranking behind Schwarz Group, Aldi, and Carrefour."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:31.399265",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1555,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Currency",
    "text": "London is the world capital for foreign exchange trading, with a global market\nshare of 43.1% in 2019 of the daily $6.6 trillion global turnover. The highest\ndaily volume, counted in trillions of US dollars, is reached when New York\nenters the trade.\n\nSterling is the currency of the UK, with its main unit, the pound, represented\nby the symbol \"£'. The Bank of England is the central bank, responsible for\nissuing currency. Banks in Scotland and Northern Ireland retain the right to\nissue their own notes, subject to retaining enough Bank of England notes in\nreserve to cover the issue. Sterling is also used as a reserve currency by\nother governments and institutions, and is the third-largest after the US\ndollar and the euro.\n\nThe UK chose not to join the euro at the currency's launch. The government of\nformer Prime Minister Tony Blair had pledged to hold a referendum to decide on\nmembership should \"five economic tests\" be met. Until relatively recently\nthere had been debate over whether or not the UK should abolish its currency\nand adopt the euro. In 2007 the Prime Minister, Gordon Brown, pledged to hold\na public referendum based on certain tests he set as Chancellor of the\nExchequer. When assessing the tests, Brown concluded that while the decision\nwas close, the United Kingdom should not yet join the euro. He ruled out\nmembership for the foreseeable future, saying that the decision not to join\nhad been right for the UK and for Europe. In particular, he cited fluctuations\nin house prices as a barrier to immediate entry. Public opinion polls have\nshown that a majority of Britons have been opposed to joining the single\ncurrency for some considerable time, and this position has hardened further in\nthe last few years. In 2005, more than half (55%) of the UK were against\nadopting the currency, while 30% were in favour. The possibility of joining\nthe euro has become a non-issue since the referendum decision to withdraw from\nthe European Union in 2016 and subsequent withdrawal in 2020.",
    "openai_summarised_points": [
      "• London is recognized as the world capital for foreign exchange trading, holding a global market share of 43.1% in 2019 of the daily $6.6 trillion global turnover.",
      "• The highest daily trading volume in foreign exchange, measured in trillions of US dollars, occurs when New York enters the market.",
      "• Sterling is the official currency of the United Kingdom, with its primary unit being the pound, symbolized by \"£\".",
      "• The Bank of England serves as the central bank of the UK and is responsible for issuing the national currency.",
      "• Banks located in Scotland and Northern Ireland retain the legal right to issue their own banknotes, provided they hold sufficient Bank of England notes in reserve to cover their issuance.",
      "• Sterling functions as a reserve currency for various governments and financial institutions worldwide, ranking as the third-largest reserve currency after the US dollar and the euro.",
      "• The United Kingdom opted not to join the euro currency at its inception, maintaining the pound sterling as its currency.",
      "• Under former Prime Minister Tony Blair, the UK government pledged to hold a referendum on euro membership contingent upon meeting \"five economic tests.\"",
      "• Debate over adopting the euro persisted until at least 2007, when then-Prime Minister Gordon Brown, previously Chancellor of the Exchequer, promised a public referendum based on specific economic criteria.",
      "• After evaluating the economic tests, Gordon Brown concluded that the UK should not join the euro at that time, citing the decision as appropriate for both the UK and Europe.",
      "• Brown specifically highlighted fluctuations in UK house prices as a significant barrier to immediate entry into the eurozone.",
      "• Public opinion polls have consistently shown a majority of Britons opposing adoption of the euro; in 2005, 55% were against joining the single currency, while only 30% supported it.",
      "• Opposition to adopting the euro has intensified in recent years, solidifying the stance against membership.",
      "• The prospect of the UK joining the euro became effectively irrelevant following the 2016 referendum decision to withdraw from the European Union and the subsequent formal withdrawal in 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:28.740051",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2009,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Exchange rates",
    "text": "Average for each year, in US dollars and euros per pound; and inversely: £ per\nUS$ and €. (Synthetic Euro XEU before 1999). These averages conceal wide\nintra-year spreads. The coefficient of variation gives an indication of this.\nIt also shows the extent to which the pound tracks the euro or the dollar.\nNote the effect of Black Wednesday in late 1992 by comparing the averages for\n1992 and for 1993.\n\n| Year  | £/US$  | US$/£  | C.var |  | £/XEU  | XEU/£ | C.var\n---|---|---|---|---|---|---|---\n1990 | £0.5633 | $1.775 |  |  | £0.7161 | ₠1.397 |\n1991 | £0.5675 | $1.762 |  |  | £0.7022 | ₠1.424 |\n1992 | £0.5699 | $1.755 |  |  | £0.7365 | ₠1.358 |\n1993 | £0.6663 | $1.501 |  |  | £0.7795 | ₠1.283 |\n1994 | £0.6536 | $1.53 |  |  | £0.7742 | ₠1.292 |\n1995 | £0.6338 | $1.578 |  |  | £0.82 | ₠1.22 |\n1996 | £0.6411 | $1.56 |  |  | £0.8029 | ₠1.245 |\n1997 | £0.6106 | $1.638 |  |  | £0.6909 | ₠1.447 |\n1998 | £0.6037 | $1.656 |  |  | £0.6779 | ₠1.475 |\n1999 | £0.6185 | $1.617 |  |  | £0.6595 | €1.516 |\n2000 | £0.6609 | $1.513 |  |  | £0.6099 | €1.64 |\n2001 | £0.6943 | $1.44 |  |  | £0.6223 | €1.607 |\n2002 | £0.6664 | $1.501 |  |  | £0.6289 | €1.59 |\n2003 | £0.6123 | $1.633 |  |  | £0.6924 | €1.444 |\n2004 | £0.5461 | $1.832 | 2.26% |  | £0.6787 | €1.474 | 1.92%\n| Year  | £/US$  | US$/£  | C.var |  | £/€  | €/£ | C.var\n---|---|---|---|---|---|---|---\n2005 | £0.55 | $1.82 | 3.47% |  | £0.6842 | €1.462 | 1.27%\n2006 | £0.5435 | $1.842 | 3.79% |  | £0.6821 | €1.466 | 1.11%\n2007 | £0.4999 | $2.001 | 1.97% |  | £0.6848 | €1.461 | 2.4%\n2008 | £0.5499 | $1.835 |  |  | £0.7964 | €1.226 |\n2009 | £0.641 | $1.566 |  |  | £0.8914 | €1.123 |\n2010 | £0.6474 | $1.546 | 1.27% |  | £0.8586 | €1.166 | 3.83%\n2011 | £0.6231 | $1.605 | 3.81% |  | £0.8684 | €1.151 | 1.286%\n2012 | £0.6310 | $1.585 | 2.74% |  | £0.8112 | €1.233 | 0.712%\n2013 | £0.6650 | $1.503 | 5.17% |  | £0.8496 | €1.177 | 4.54%\n2014 | £0.6320 | $1.582 | 5.25% |  | £0.8060 | €1.240 | 5.35%\n2015 | £0.6810 | $1.468 | 7.20% |  | £0.7262 | €1.377 | 11.04%\n2016 | £0.770 | $1.299 |  |  | £0.8193 | €1.2242 |\n2017 | £0.808 | $1.238 |  |  | £0.8766 | €1.1414 |\n2018 | £0.750 | $1.333 |  |  | £0.885 | €1.1301 |\n2019 | £0.748 | $1.337 |  |  | £0.8773 | €1.1405 |\n\nFor consistency and comparison purposes, coefficient of variation is measured on both the \"per £\" ratios, although it is conventional to show the forex rates as dollars per £ and £ per euro.",
    "openai_summarised_points": [
      "• The exchange rate data for the British pound (GBP) against the US dollar (USD) and the euro (EUR) is presented as annual averages, showing values in both directions: US dollars and euros per pound, and inversely, pounds per US dollar and euro.",
      "• Prior to 1999, the euro exchange rate is represented by the synthetic Euro (XEU), reflecting the pre-euro currency basket.",
      "• These annual averages mask significant intra-year volatility in exchange rates; the coefficient of variation (C.var) is used to quantify this variability and to indicate how closely the pound tracks the euro or the dollar within each year.",
      "• A notable event impacting exchange rates was Black Wednesday in late 1992, which caused a marked change in the pound’s value; this is evident by comparing the average exchange rates for 1992 and 1993.",
      "• Specific exchange rate data for 1990 to 2019 includes:",
      "• In 1990, the pound was valued at £0.5633 per US dollar and £0.7161 per synthetic euro (₠1.397 XEU per £).",
      "• By 1992, just before Black Wednesday, the pound was £0.5699 per US dollar and £0.7365 per XEU.",
      "• In 1993, following Black Wednesday, the pound depreciated to £0.6663 per US dollar and £0.7795 per XEU, reflecting a weaker pound.",
      "• From 1999 onwards, the synthetic euro (XEU) was replaced by the euro (€), with the pound at £0.6595 per euro in 1999.",
      "• Exchange rates fluctuated over the years, with the pound reaching £0.770 per US dollar and £0.8193 per euro in 2016, and £0.748 per US dollar and £0.8773 per euro in 2019.",
      "• The coefficient of variation (C.var) for the pound against the US dollar and euro is reported from 2004 onwards, indicating the degree of exchange rate volatility:",
      "• For example, in 2004, the C.var was 2.26% against the US dollar and 1.92% against the euro.",
      "• The highest volatility recorded was in 2015, with a C.var of 7.20% against the US dollar and 11.04% against the euro.",
      "• Volatility fluctuated in subsequent years, with 2013 and 2014 showing C.var values above 4% for both currencies.",
      "• The data presentation conventionally shows forex rates as dollars per pound and pounds per euro, but for consistency and comparison, the coefficient of variation is measured on the \"per pound\" ratios.",
      "• The exchange rate trends and volatility measures provide insight into the pound’s performance relative to major currencies over three decades, reflecting economic events, policy changes, and market dynamics influencing the UK economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:37.440405",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2407,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Gross domestic product (2022)",
    "text": "Within the United Kingdom, England has the largest constituent economy\nmeasured by gross domestic product (GDP) according to the figures provided by\nthe Office for National Statistics (ONS) for the year 2022, whilst Northern\nIreland has the smallest, which is also in line with their respective\npopulation sizes. England also has the highest level of GDP per capita within\nthe UK, whilst Wales has the lowest.\n\nRank | Nation | Population | GDP (in millions of GBP) | GDP (in millions of USD) | Share of the UK total | GDP per capita (GBP) | GDP per capita (USD)\n---|---|---|---|---|---|---|---\n1  |  England | 57 106 398  | 2 161 593  | 2 664 325  | 86.25%  | 37 852  | 46 655\n2  |  Scotland | 5 447 698  | 186 851  | 230 445  | 7.46%  | 34 299  | 42 301\n3  |  Wales | 3 131 640  | 85 412  | 105 337  | 3.41%  | 27 274  | 33 636\n4  |  Northern Ireland | 1 910 543  | 56 694  | 69 813  | 2.26%  | 29 674  | 36 541\nUnited Kingdom (total)  | 67 596 279  | 2 506 170  | 3 089 072  | 100%  | 37 076  | 45 758",
    "openai_summarised_points": [
      "• In 2022, England had the largest constituent economy within the United Kingdom as measured by gross domestic product (GDP), according to data from the Office for National Statistics (ONS).",
      "• Northern Ireland had the smallest economy in terms of GDP among the UK nations in 2022, consistent with its smaller population size relative to other UK nations.",
      "• England also recorded the highest GDP per capita within the UK in 2022, while Wales had the lowest GDP per capita among the four constituent nations.",
      "• England's population in 2022 was 57,106,398, with a GDP of £2,161,593 million (equivalent to $2,664,325 million USD), representing 86.25% of the total UK GDP.",
      "• England’s GDP per capita in 2022 was £37,852, which equates to $46,655 USD per person.",
      "• Scotland had a population of 5,447,698 in 2022, with a GDP of £186,851 million (or $230,445 million USD), accounting for 7.46% of the UK’s total GDP.",
      "• Scotland’s GDP per capita in 2022 was £34,299, equivalent to $42,301 USD.",
      "• Wales had a population of 3,131,640 in 2022, with a GDP of £85,412 million (or $105,337 million USD), contributing 3.41% to the UK’s total GDP.",
      "• Wales recorded the lowest GDP per capita among the UK nations in 2022, at £27,274 or $33,636 USD per person.",
      "• Northern Ireland’s population in 2022 was 1,910,543, with a GDP of £56,694 million (equivalent to $69,813 million USD), representing 2.26% of the total UK GDP.",
      "• Northern Ireland’s GDP per capita in 2022 was £29,674, which is $36,541 USD per person.",
      "• The total population of the United Kingdom in 2022 was 67,596,279, with an aggregate GDP of £2,506,170 million (or $3,089,072 million USD).",
      "• The UK’s overall GDP per capita in 2022 was £37,076, equivalent to $45,758 USD per person."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:30.781469",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1003,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4.2.1",
    "section_name": "By English region",
    "text": "England constitutes the vast majority of the total UK population (84.3%) and\nan even larger proportion of the GDP (86.25%). Therefore a large part of the\nregional variation in the UK economy occurs within England itself. London,\nwhich is the capital of both the UK and England, has the largest regional\neconomy in England as well as the highest GDP per capita, whilst North East\nEngland has both the smallest economy out of the regions as measured by total\nnominal GDP, as well as the lowest GDP per capita in England.\n\nBelow is a list of the Regions of England by GDP and GDP per capita, also\nprovided by the ONS for the year 2022.\n\nRank | Region | Population | GDP (in millions of GBP) | GDP (in millions of USD) | Share of the UK total | GDP per capita (GBP) | GDP per capita (USD)\n---|---|---|---|---|---|---|---\n1  | London | 8 866 180  | 562 179  | 693 096  | 22.43%  | 63 407  | 78 154\n2  | South East England | 9 379 833  | 374 453  | 461 665  | 14.94%  | 39 921  | 49 208\n3  | North West England | 7 516 113  | 247 199  | 304 755  | 9.86%  | 32 889  | 40 538\n4  | East of England | 6 398 497  | 213 828  | 263 556  | 8.53%  | 33 419  | 41 191\n5  | South West England | 5 764 881  | 194 030  | 239 186  | 7.74%  | 33 657  | 41 485\n6  | West Midlands | 6 021 653  | 181 354  | 223 599  | 7.23%  | 30 117  | 37 118\n7  | Yorkshire and the Humber | 5 541 262  | 170 304  | 209 933  | 6.79%  | 30 734  | 37 888\n8  | East Midlands | 4 934 939  | 146 482  | 180 663  | 5.84%  | 29 683  | 36 610\n9  | North East England | 2 683 040  | 71 763  | 88 526  | 2.86%  | 26 747  | 33 000\nEngland | 57 106 398  | 2 161 593  | 2 664 325  | 86.25%  | 37 852  | 46 655\nUnited Kingdom (total)  | 67 596 279  | 2 506 170  | 3 089 072  | 100%  | 37 076  | 45 758",
    "openai_summarised_points": [
      "• England accounts for 84.3% of the total United Kingdom population and contributes an even larger proportion to the UK's GDP, representing 86.25% of the total GDP.",
      "• Significant regional economic variation within the UK primarily occurs within England due to its dominant share of population and GDP.",
      "• London, serving as the capital city of both the United Kingdom and England, possesses the largest regional economy in England and the highest GDP per capita among English regions.",
      "• North East England has the smallest regional economy in England based on total nominal GDP and also records the lowest GDP per capita within England.",
      "• According to the Office for National Statistics (ONS) data for the year 2022, the regions of England ranked by GDP and GDP per capita are as follows:",
      "• London: Population of 8,866,180; GDP of £562,179 million (US$693,096 million); accounts for 22.43% of UK GDP; GDP per capita of £63,407 (US$78,154).",
      "• South East England: Population of 9,379,833; GDP of £374,453 million (US$461,665 million); accounts for 14.94% of UK GDP; GDP per capita of £39,921 (US$49,208).",
      "• North West England: Population of 7,516,113; GDP of £247,199 million (US$304,755 million); accounts for 9.86% of UK GDP; GDP per capita of £32,889 (US$40,538).",
      "• East of England: Population of 6,398,497; GDP of £213,828 million (US$263,556 million); accounts for 8.53% of UK GDP; GDP per capita of £33,419 (US$41,191).",
      "• South West England: Population of 5,764,881; GDP of £194,030 million (US$239,186 million); accounts for 7.74% of UK GDP; GDP per capita of £33,657 (US$41,485).",
      "• West Midlands: Population of 6,021,653; GDP of £181,354 million (US$223,599 million); accounts for 7.23% of UK GDP; GDP per capita of £30,117 (US$37,118).",
      "• Yorkshire and the Humber: Population of 5,541,262; GDP of £170,304 million (US$209,933 million); accounts for 6.79% of UK GDP; GDP per capita of £30,734 (US$37,888).",
      "• East Midlands: Population of 4,934,939; GDP of £146,482 million (US$180,663 million); accounts for 5.84% of UK GDP; GDP per capita of £29,683 (US$36,610).",
      "• North East England: Population of 2,683,040; GDP of £71,763 million (US$88,526 million); accounts for 2.86% of UK GDP; GDP per capita of £26,747 (US$33,000).",
      "• The total population of England in 2022 was 57,106,398, with a combined GDP of £2,161,593 million (US$2,664,325 million), representing 86.25% of the UK's total GDP.",
      "• The entire United Kingdom had a population of 67,596,279 in 2022, with a total GDP of £2,506,170 million (US$3,089,072 million).",
      "• The overall GDP per capita for England was £37,852 (US$46,655), which is higher than the UK-wide GDP per capita of £37,076 (US$45,758) in 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:41.433693",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1748,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Gross value added (2020)",
    "text": "Excluding the effects of North Sea oil and gas (which is classified in\nofficial statistics as extra-regio), England has the highest gross value added\n(GVA) and Wales the lowest of the UK's countries.\n\nRank  | Country  | GVA per head, 2020\n---|---|---\n1  | England | £32,866 ($42136)\n2  | Scotland | £29,629 ($37986)\n3  | Northern Ireland | £25,575 ($32788)\n4  | Wales | £23,882 ($30618)",
    "openai_summarised_points": [
      "• Excluding the effects of North Sea oil and gas, which are classified in official statistics as extra-regio, England has the highest gross value added (GVA) per head among the countries of the United Kingdom in 2020.",
      "• Wales has the lowest GVA per head among the UK's countries in 2020 when excluding North Sea oil and gas effects.",
      "• In 2020, England's GVA per head was £32,866, equivalent to $42,136.",
      "• Scotland ranked second in GVA per head in 2020 with £29,629, equivalent to $37,986.",
      "• Northern Ireland held the third position with a GVA per head of £25,575, equivalent to $32,788 in 2020.",
      "• Wales had the lowest GVA per head in 2020 at £23,882, equivalent to $30,618."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:32.728127",
      "openai_model": "gpt-4.1-mini",
      "content_length": 386,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "4.3.1",
    "section_name": "By English region",
    "text": "Within England, GVA per capita is highest in London. The following table shows\nthe GVA per capita of the nine statistical regions of England.\n\nRank  | Region  | GVA per head, 2020\n---|---|---\n1  | London | £55,974 ($71762)\n2  | South East England | £34,516 ($44251)\n3  | East of England | £29,176 ($37405)\n4  | North West England | £28,257 ($36227)\n5  | South West England | £28,012 ($35913)\n6  | West Midlands | £26,281 ($33694)\n7  | East Midlands | £25,956 ($33277)\n8  | Yorkshire and the Humber | £25,696 ($32944)\n9  | North East England | £23,109 ($29627)",
    "openai_summarised_points": [
      "• Within England, the Gross Value Added (GVA) per capita is highest in London, indicating the region's leading economic productivity on a per-person basis.",
      "• In 2020, London ranked first among the nine statistical regions of England with a GVA per head of £55,974, equivalent to $71,762.",
      "• South East England held the second position with a GVA per capita of £34,516 ($44,251) in 2020.",
      "• The East of England was ranked third, reporting a GVA per head of £29,176 ($37,405) for the year 2020.",
      "• North West England occupied the fourth rank with a GVA per capita of £28,257 ($36,227) in 2020.",
      "• South West England was fifth, with a GVA per head of £28,012 ($35,913) in 2020.",
      "• The West Midlands region ranked sixth, showing a GVA per capita of £26,281 ($33,694) in 2020.",
      "• East Midlands was seventh, with a GVA per head of £25,956 ($33,277) in 2020.",
      "• Yorkshire and the Humber ranked eighth, reporting a GVA per capita of £25,696 ($32,944) in 2020.",
      "• North East England was ninth and last among the English regions listed, with a GVA per head of £23,109 ($29,627) in 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:37.027994",
      "openai_model": "gpt-4.1-mini",
      "content_length": 559,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Trade",
    "text": "Value of UK exports at constant prices, 1995–2016\n\nThe trade deficit (goods and services) narrowed £0.2 billion to £7.9 billion\nin the three months to November 2018 as both goods and services exports each\nincreased £0.1 billion more than their respective imports.\n\nExcluding erratic commodities (mainly aircraft) the total trade deficit\nwidened £1.2 billion to £9.5 billion in the three months to November 2018.\n\nLarge increases in export prices of oil and aircraft drove the narrowing of\nthe total trade deficit; removing the effect of inflation, the total trade\ndeficit widened £0.3 billion to £6.5 billion in the three months to November\n2018.\n\nThe trade in goods deficit widened £0.8 billion with EU countries and narrowed\n£0.9 billion with non-EU countries in the three months to November 2018, due\nmainly to increases in imports from EU countries and exports to non-EU\ncountries.\n\nThe total trade deficit widened £4.1 billion in the 12 months to November 2018\ndue mainly to a £4.4 billion narrowing in the trade in services surplus.\n\nAfter the withdrawal of the United Kingdom from the European Union, the\nnegotiation of a trade deal between the UK and the European Union including\nher 27 member states might have the same status than third countries for\nstatistics related to imports and exports with the UK:\n\n* According to OEC World 2017 data, the EU-27-2020 could become/stay one of the notable partners of the UK, with exports from the UK reaching near $200B, close from the United States ($45B, and China $21B).\n* According to OEC World 2017 data, the EU-27-2020 could become/stay one of the notable partners of the UK, with imports to the UK reaching near $330B, close from the United States ($46B, and China $58B).\n\nUK economy received £1 billion to boost through innovative trade\ndigitalisation act in July 2023.\n\n**Trade deals being negotiated**\n\n* Canada–United Kingdom Free Trade Agreement\n* India–United Kingdom Free Trade Agreement\n* Gulf Cooperation Council–United Kingdom Free Trade Agreement\n* United Kingdom–United States Free Trade Agreement\n* Comprehensive and Progressive Agreement for Trans-Pacific Partnership\n* * Accession of the United Kingdom to CPTPP\n\n**Other Trade Deals**\n\n* Free trade agreements of the United Kingdom",
    "openai_summarised_points": [
      "• In the three months to November 2018, the UK trade deficit (goods and services) narrowed by £0.2 billion to £7.9 billion, as exports of both goods and services each increased by £0.1 billion more than their respective imports.",
      "• When excluding erratic commodities, primarily aircraft, the total trade deficit widened by £1.2 billion to £9.5 billion in the same period (three months to November 2018).",
      "• Large increases in export prices of oil and aircraft contributed to the narrowing of the total trade deficit; however, after adjusting for inflation, the total trade deficit actually widened by £0.3 billion to £6.5 billion in the three months to November 2018.",
      "• The trade in goods deficit with European Union (EU) countries widened by £0.8 billion, while the deficit with non-EU countries narrowed by £0.9 billion in the three months to November 2018, primarily due to increased imports from EU countries and increased exports to non-EU countries.",
      "• Over the 12 months to November 2018, the total trade deficit widened by £4.1 billion, mainly driven by a £4.4 billion reduction in the trade in services surplus.",
      "• Following the United Kingdom's withdrawal from the European Union, trade negotiations between the UK and the EU (comprising 27 member states) may result in the EU having the same status as third countries in UK import and export statistics.",
      "• According to OEC World 2017 data, the EU-27-2020 is projected to remain a significant trade partner for the UK, with UK exports to the EU reaching nearly $200 billion, compared to exports to the United States at $45 billion and China at $21 billion.",
      "• The same OEC World 2017 data indicates that UK imports from the EU-27-2020 could reach nearly $330 billion, compared to imports from the United States at $46 billion and China at $58 billion.",
      "• In July 2023, the UK economy received a £1 billion boost aimed at promoting innovative trade digitalisation through a dedicated act.",
      "• The United Kingdom is actively negotiating several trade deals, including the Canada–United Kingdom Free Trade Agreement, India–United Kingdom Free Trade Agreement, Gulf Cooperation Council–United Kingdom Free Trade Agreement, United Kingdom–United States Free Trade Agreement, and its accession to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP).",
      "• The UK also maintains other free trade agreements under the broader category of Free Trade Agreements of the United Kingdom."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:41.451979",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2253,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Investment",
    "text": "In 2013 the UK was the leading country in Europe for inward foreign direct\ninvestment (FDI) with $26.51bn. This gave it a 19.31% market share in Europe.\nIn contrast, the UK was second in Europe for outward FDI, with $42.59bn,\ngiving a 17.24% share of the European market.\n\nIn October 2017, the ONS revised the UK's balance of payments, changing the\nnet international investment position from a surplus of £469bn to a deficit of\n£22bn. Deeper analysis of outward investment revealed that much of what was\nthought to be foreign debt securities owned by British companies were actually\nloans to British citizens. Inward investment also dropped, from a surplus of\n£120bn in the first half of 2016 to a deficit of £25bn in the same period of\n2017. The UK had been relying on a surplus of inward investment to make up for\nits long-term current account deficit. In April 2021, Lord Grimstone\nestablished the UK Investment Council to enhance UK inward investment and\ninform the trade policy of the UK by providing a forum for global investors to\noffer high-level advice to the government.\n\nAccording to the Office for National Statistics, the UK is the biggest\ninvestor in America, and the second biggest in China.",
    "openai_summarised_points": [
      "• In 2013, the United Kingdom was the leading country in Europe for inward foreign direct investment (FDI), attracting $26.51 billion, which represented a 19.31% share of the European market.",
      "• During the same year, the UK ranked second in Europe for outward FDI, with investments totaling $42.59 billion, accounting for a 17.24% share of the European market.",
      "• In October 2017, the Office for National Statistics (ONS) revised the UK's balance of payments, altering the net international investment position from a reported surplus of £469 billion to a deficit of £22 billion.",
      "• The revision was based on a deeper analysis of outward investment, which revealed that a significant portion of what was previously classified as foreign debt securities owned by British companies were, in fact, loans to British citizens.",
      "• Inward investment figures also declined sharply, moving from a surplus of £120 billion in the first half of 2016 to a deficit of £25 billion in the same period of 2017.",
      "• The UK had been relying on a surplus of inward investment to compensate for its persistent long-term current account deficit.",
      "• In April 2021, Lord Grimstone established the UK Investment Council with the objectives of enhancing UK inward investment and informing UK trade policy by providing a platform for global investors to offer high-level advice to the government.",
      "• According to the Office for National Statistics, the United Kingdom is the largest foreign investor in the United States and the second largest foreign investor in China."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:37.878514",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1206,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Mergers and acquisitions",
    "text": "Since 1985 103,430 deals with UK participation have been announced. There have\nbeen three major waves of increased M&A activity (2000, 2007 and 2017; see\ngraph \"M&A in the UK\"). 1999 however, was the year with the highest cumulated\nvalue of deals (£490 bil, which is about 50% more than the current peak of\n2017). The Finance industry and Energy & Power made up most of the value from\n2000 until 2018 (both about 15%).\n\nHere is a list of the top 10 deals including UK companies. The Vodafone –\nMannesmann deal is still the biggest deal in global history.\n\nRank  | Date  | Acquirer  | Acquirer nation  | Target  | Target nation  | Value\n(£ billions)\n---|---|---|---|---|---|---\n1  | 14 November 1999  | Vodafone AirTouch PLC  | United Kingdom  | Mannesmann AG  | Germany  | 126.95\n2  | 16 September 2015  | Anheuser-Busch Inbev SA/NV  | Belgium  | SABMiller PLC  | United Kingdom  | 77.24\n3  | 4 August 2015  | Royal Dutch Shell PLC  | Netherlands  | BG Group PLC  | United Kingdom  | 46.70\n4  | 17 January 2000  | Glaxo Wellcome PLC  | United Kingdom  | SmithKline Beecham PLC  | United Kingdom  | 46.48\n5  | 28 October 2004  | Royal Dutch Petroleum Co  | Netherlands  | Shell Transport & Trading Co  | United Kingdom  | 40.75\n6  | 21 October 2016  | British American Tobacco PLC  | United Kingdom  | Reynolds American Inc  | United States  | 40.10\n7  | 15 January 1999  | Vodafone Group PLC  | United Kingdom  | AirTouch Communications Inc  | United States  | 36.35\n8  | 30 May 2000  | France Telecom SA  | France  | Orange PLC  | United Kingdom  | 31.14\n9  | 8 November 1998  | British Petroleum Co PLC  | United Kingdom  | Amoco Corp  | United States  | 29.51\n10  | 31 October 2016  | GE Oil & Gas  | United Kingdom  | Baker Hughes Inc  | United States  | 26.63\n11  | 26 February 2009  | HM Treasury  | United Kingdom  | Royal Bank of Scotland Group  | United Kingdom  | 25.50\n\n* In most cases both the acquiring and target companies have/had shareholders spread throughout the world, not only in the stated countries."
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "European Union membership",
    "text": "The proportion of the country's exports going to the EU has fallen from 54 per\ncent to 47 per cent over the past decade. The total value of exports however,\nhas increased in the same period from £130 billion (€160 billion) to £240\nbillion (€275 billion).\n\nIn June 2016 the UK voted to leave the EU in a national referendum on its\nmembership of the EU. After the activation of Article 50 of the Lisbon Treaty,\nthe UK had been set to leave on Friday 29 March 2019. However the leave date\nwas extended to Friday 12 April 2019 and then extended again to Thursday 31\nOctober 2019, and then extended again until Friday 31 January 2020 with the\nability to exit earlier. The future relationship between the UK and EU was\nunder negotiation until the end of October 2019. UK economic growth slowed\nduring 2019, with uncertainty over Brexit and a world economic slowdown\nblamed.\n\nThe UK left the EU in January 2020. On 16 July 2020, the government of UK\naffirmed that businesses across the United Kingdom, after the transition\nperiod ends, will continue to enjoy internal trade and jobs would remain\nprotected against uncertain environment . From 1 January 2021, the powers\nwhich were previously exercised at an EU level in at least 70 policy areas\nwere to directly transfer to the devolved administrations in Edinburgh,\nCardiff and Belfast for the first time.",
    "openai_summarised_points": [
      "• Over the past decade, the proportion of the United Kingdom's exports going to the European Union has decreased from 54 percent to 47 percent, despite the total value of exports increasing from £130 billion (€160 billion) to £240 billion (€275 billion) during the same period.",
      "• In June 2016, the United Kingdom held a national referendum in which the electorate voted to leave the European Union, marking a pivotal moment in the country's relationship with the EU.",
      "• Following the referendum, the UK government activated Article 50 of the Lisbon Treaty, initially setting the UK's departure date from the EU for Friday, 29 March 2019.",
      "• The original leave date was subsequently extended multiple times: first to Friday, 12 April 2019; then to Thursday, 31 October 2019; and finally to Friday, 31 January 2020, with provisions allowing for an earlier exit if agreements were reached.",
      "• Negotiations concerning the future relationship between the UK and the EU continued until the end of October 2019, amid significant political and economic uncertainty.",
      "• The UK experienced a slowdown in economic growth during 2019, which was attributed to the uncertainty surrounding Brexit as well as a broader global economic slowdown.",
      "• The United Kingdom officially left the European Union in January 2020, concluding its membership after over four decades.",
      "• On 16 July 2020, the UK government affirmed that, following the end of the Brexit transition period, businesses across the United Kingdom would continue to benefit from internal trade protections and that jobs would remain safeguarded despite the uncertain economic environment.",
      "• Beginning 1 January 2021, powers previously exercised at the EU level in at least 70 policy areas were transferred directly to the devolved administrations in Edinburgh (Scotland), Cardiff (Wales), and Belfast (Northern Ireland) for the first time, marking a significant constitutional and administrative change within the UK."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:17:44.092081",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1349,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Poverty",
    "text": "The United Kingdom is a developed country with social welfare infrastructure,\nthus discussions surrounding poverty tend to use a relatively high minimum\nincome compared to developing countries. Eurostat figures show that the\nnumbers of Britons at risk of poverty has fallen to 15.9% in 2014, down from\n17.1% in 2010 and 19% in 2005 (after social transfers were taken into\naccount). Poverty is countered in United Kingdom with the welfare state.\n\nThe poverty line in the UK is commonly defined as being 60% of the median\nhousehold income. In 2007–2008, this was calculated to be £115 per week for\nsingle adults with no dependent children; £199 per week for couples with no\ndependent children; £195 per week for single adults with two dependent\nchildren under 14; and £279 per week for couples with two dependent children\nunder 14. In 2007–2008, 13.5 million people, or 22% of the population, lived\nbelow this line. This is a higher level of relative poverty than all but four\nEU members. In the same year, 4.0 million children, 31% of the total, lived in\nhouseholds below the poverty line, after housing costs were taken into\naccount. This is a decrease of 400,000 children since 1998–1999."
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Economic impacts of climate change",
    "text": "According to the Government, the number of households in flood risk will be up\nto 970,000 homes in the 2020s, up from around 370,000 in January 2012. The\neffects of flooding and managing flood risk cost the country about £2.2bn a\nyear, compared with the less than £1bn spent on flood protection and\nmanagement. UK agriculture is also being affected by drought and weather\nchanges.\n\nIn 2020 PricewaterhouseCoopers estimated that Storm Dennis damage to homes,\nbusinesses and cars could be between £175m and £225m and Storm Ciara cost up\nto £200m. Friends of the Earth criticised British government of the intended\ncuts to flood defence spending. The protection against increasing flood risk\nas a result of climate change requires rising investment. In 2009, the\nEnvironment Agency calculated that the UK needs to be spending £20m more\ncompared to 2010 to 2011 as the baseline, each and every year out to 2035,\njust to keep pace with climate change.\n\nThe British government and the economist Nicholas Stern published the Stern\nReview on the Economics of Climate Change in 2006. The report states that\nclimate change is the greatest and widest-ranging market failure ever seen,\npresenting a unique challenge for economics. The Review provides prescriptions\nincluding environmental taxes to minimise economic and social disruptions. The\nStern Review's main conclusion is that the benefits of strong, early action on\nclimate change far outweigh the costs of not acting. The Review points to the\npotential effects of climate change on water resources, food production,\nhealth, and the environment. According to the Review, without action, the\noverall costs of climate change will be equivalent to losing at least 5% of\nglobal gross domestic product (GDP) each year, now and forever. Including a\nwider range of risks and costs could increase this to 20% of GDP or more. The\nreview leads to a simple conclusion: the benefits of strong, early action\nconsiderably outweigh the costs.\n\nClimate change made the unusual rainfall in autumn and winter 2023-2024, 10\ntimes more probable and 20% stronger. The rainfall led to \"severe damage to\nhomes and infrastructure, power blackouts, travel cancellations, and heavy\nlosses of crops and livestock\". The damage to arable crops alone is £1.2\nbillion, without counting vegetables. Claims for house insurance from weather\nrelated disasters increased by more than a third."
  },
  {
    "chapter_name": "Economy of the United Kingdom",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$ nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | In­flation rate\n(in %) | Unem­ploy­ment\n(in %) | Govern­ment debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 511.8  | 9,085.1  | 603.6  | 10,715.4  | -2.1%  | 16.8%  | 7.1%  | 42.6%\n1981  | 556.3  | 9,870.7  | 587.3  | 10,420.4  | -0.7%  | 12.2%  | 9.7%  | 44.8%\n1982  | 602.3  | 10,699.9  | 558.3  | 9,918.9  | 2.0%  | 8.5%  | 10.7%  | 43.1%\n1983  | 652.2  | 11,580.6  | 532.1  | 9,448.7  | 4.2%  | 5.2%  | 11.5%  | 41.9%\n1984  | 690.9  | 12,247.2  | 504.2  | 8,938.7  | 2.2%  | 4.4%  | 11.8%  | 42.3%\n1985  | 742.1  | 13,121.9  | 536.6  | 9,488.1  | 4.1%  | 5.2%  | 11.4%  | 41.3%\n1986  | 780.9  | 13,776.7  | 654.7  | 11,549.7  | 3.1%  | 3.6%  | 11.3%  | 41.3%\n1987  | 843.4  | 14,847.8  | 813.1  | 14,315.0  | 5.4%  | 4.1%  | 10.4%  | 39.3%\n1988  | 922.1  | 16,200.4  | 990.2  | 17,398.2  | 5.4%  | 4.6%  | 8.6%  | 37.1%\n1989  | 981.6  | 17,198.6  | 1,008.4  | 17,667.9  | 2.4%  | 5.2%  | 7.2%  | 32.5%\n1990  | 1,024.8  | 17,904.8  | 1,195.4  | 20,884.2  | 0.6%  | 7.0%  | 7.1%  | 28.5%\n1991  | 1,046.9  | 18,226.8  | 1,250.3  | 21,767.1  | -1.4%  | 7.5%  | 8.9%  | 28.4%\n1992  | 1,074.1  | 18,653.1  | 1,292.1  | 22,438.0  | 0.2%  | 4.2%  | 10.0%  | 33.2%\n1993  | 1,126.0  | 19,509.9  | 1,157.5  | 20,055.8  | 2.3%  | 2.5%  | 10.4%  | 37.9%\n1994  | 1,193.4  | 20,624.6  | 1,244.0  | 21,499.6  | 3.4%  | 2.0%  | 9.5%  | 40.6%\n1995  | 1,248.2  | 21,511.1  | 1,346.7  | 23,208.7  | 2.4%  | 2.6%  | 8.6%  | 43.6%\n1996  | 1,301.9  | 22,383.3  | 1,423.0  | 24,464.8  | 2.6%  | 2.4%  | 8.1%  | 43.7%\n1997  | 1,389.4  | 23,825.5  | 1,559.9  | 26,749.9  | 4.9%  | 1.8%  | 7.0%  | 43.2%\n1998  | 1,449.3  | 24,785.2  | 1,653.5  | 28,277.9  | 3.4%  | 1.6%  | 6.3%  | 40.9%\n1999  | 1,513.7  | 25,793.8  | 1,686.2  | 28,733.2  | 3.1%  | 1.3%  | 6.0%  | 39.3%\n2000  | 1,604.8  | 27,253.1  | 1,665.3  | 28,279.7  | 4.3%  | 0.8%  | 5.5%  | 36.6%\n2001  | 1,675.0  | 28,335.4  | 1,644.3  | 27,816.7  | 2.6%  | 1.2%  | 5.1%  | 33.9%\n2002  | 1,737.2  | 29,262.8  | 1,786.9  | 30,099.6  | 1.8%  | 1.3%  | 5.2%  | 34.1%\n2003  | 1,825.2  | 30,604.8  | 2,059.0  | 34,525.0  | 3.1%  | 1.4%  | 5.0%  | 35.3%\n2004  | 1,918.3  | 31,998.7  | 2,422.9  | 40,415.5  | 2.4%  | 1.3%  | 4.8%  | 38.2%\n2005  | 2,029.8  | 33,598.5  | 2,547.7  | 42,171.2  | 2.7%  | 2.1%  | 4.8%  | 39.4%\n2006  | 2,146.5  | 35,288.4  | 2,720.9  | 44,731.6  | 2.4%  | 2.3%  | 5.4%  | 40.4%\n2007  | 2,254.5  | 36,767.2  | 3,107.4  | 50,675.5  | 2.6%  | 2.3%  | 5.4%  | 41.4%\n2008  | 2,292.3  | 37,077.1  | 2,970.0  | 48,039.0  | -0.2%  | 3.6%  | 5.7%  | 49.0%\n2009  | 2,209.0  | 35,479.0  | 2,434.5  | 39,101.2  | -4.6%  | 2.2%  | 7.6%  | 62.8%\n2010  | 2,283.2  | 36,379.2  | 2,493.6  | 39,731.6  | 2.2%  | 3.3%  | 7.9%  | 74.0%\n2011  | 2,364.6  | 37,363.8  | 2,675.8  | 42,281.9  | 1.1%  | 4.5%  | 8.1%  | 79.5%\n2012  | 2,453.4  | 38,511.1  | 2,719.6  | 42,691.2  | 1.5%  | 2.8%  | 8.0%  | 82.7%\n2013  | 2,579.2  | 40,232.7  | 2,805.1  | 43,757.4  | 1.8%  | 2.6%  | 7.6%  | 83.6%\n2014  | 2,686.2  | 41,584.0  | 3,088.8  | 47,816.0  | 3.2%  | 1.5%  | 6.2%  | 85.5%\n2015  | 2,795.1  | 42,928.5  | 2,957.2  | 45,418.9  | 2.2%  | 0.0%  | 5.4%  | 86.0%\n2016  | 2,928.3  | 44,606.1  | 2,733.0  | 41,630.5  | 1.9%  | 0.7%  | 4.9%  | 85.8%\n2017  | 3,074.4  | 46,553.5  | 2,701.3  | 40,903.5  | 2.7%  | 2.7%  | 4.4%  | 85.1%\n2018  | 3,199.8  | 48,163.7  | 2,904.5  | 43,719.0  | 1.4%  | 2.5%  | 4.1%  | 84.5%\n2019  | 3,311.5  | 49,575.6  | 2,880.4  | 43,121.1  | 1.6%  | 1.8%  | 3.8%  | 83.9%\n2020  | 3,040.7  | 45,329.1  | 2,758.9  | 41,127.4  | -10.4%  | 0.9%  | 4.6%  | 102.6%\n2021  | 3,402.7  | 50,522.7  | 3,187.6  | 47,328.8  | 8.7%  | 2.6%  | 4.5%  | 95.3%\n2022  | 3,776.0  | 55,862.1  | 3,198.5  | 47,317.6  | 4.3%  | 9.1%  | 3.8%  | 87.0%\n2023  | 3,922.9  | 57,821.9  | 3,479.5  | 51,286.1  | 0.1%  | 9.0%  | 4.8%  | 79.9%\n2024  | 4,027.7  | 59,160.0  | 3,757.4  | 55,189.5  | 0.6%  | 3.7%  | 5.0%  | 76.7%\n2025  | 4,198.8  | 61,471.6  | 3,969.9  | 58,120.1  | 2.3%  | 1.8%  | 4.3%  | 73.7%\n2026  | 4,373.1  | 63,829.0  | 4,217.7  | 61,562.0  | 2.2%  | 2.0%  | 4.2%  | 70.6%\n2027  | 4,524.5  | 65,857.4  | 4,449.8  | 64,768.9  | 1.5%  | 2.0%  | 4.2%  | 68.0%"
  }
]