[
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of France is a highly developed social market economy with notable\nstate participation in strategic sectors. It is the world's seventh-largest\neconomy by nominal GDP and the ninth-largest economy by PPP, constituting\naround 4% of world GDP. Due to a volatile currency exchange rate, France's GDP\nas measured in dollars fluctuates sharply, being smaller in 2024 than in 2008.\nFrance has a diversified economy, that is dominated by the service sector\n(which in 2017 represented 78.8% of its GDP), whilst the industrial sector\naccounted for 19.5% of its GDP and the primary sector accounted for the\nremaining 1.7%. In 2020, France was the largest Foreign Direct Investment\nrecipient in Europe, and Europe's second largest spender in research and\ndevelopment. It was ranked among the 10 most innovative countries in the world\nby the 2020 Bloomberg Innovation Index, as well as the 15th most competitive\nnation globally according to the 2019 Global Competitiveness Report (up 2\nnotches compared to 2018). It was the fifth-largest trading nation in the\nworld (and second in Europe after Germany). France is also the most visited\ndestination in the world, as well as the European Union's leading agricultural\npower.\n\nAccording to the International Monetary Fund (IMF), in 2023, France was the\nworld's 23rd country by GDP per capita with $44,408 per inhabitant. In 2021,\nFrance was listed on the United Nations's Human Development Index with a value\nof 0.903 (indicating very high human development) and 22nd on the Corruption\nPerceptions Index in 2021. Among OECD members, France has a highly efficient\nand strong social security system, which comprises roughly 31.7% of GDP.\n\nParis is a leading global city, and has one of the largest city GDP in the\nworld. It ranks as the first city in Europe (and 3rd worldwide) by the number\nof companies classified in _Fortune'_s Fortune Global 500. Paris produced\nUS$738 billion (or US$882 billion at market exchange rates) or around 1/3 of\nthe French economy in 2018 while the economy of the Paris metropolitan\narea—the largest in Europe with London—generates around 1/3 of France's GDP or\naround $1.0 trillion. Paris has been ranked as the 2nd most attractive global\ncity in the world in 2019 by KPMG. La Défense, Paris's Central Business\nDistrict, was ranked by Ernst & Young in 2017 as the leading business district\nin continental Europe, and fourth in the world. The OECD is headquartered in\nParis, the nation's financial capital. The other major economic centres of the\ncountry include Lyon, Toulouse (centre of the European aerospace industry),\nMarseille and Lille.\n\nFrance's economy entered the recession of the late 2000s later and appeared to\nleave it earlier than most affected economies, only enduring four-quarters of\ncontraction. However, France experienced stagnant growth between 2012 and\n2014, with the economy expanding by 0% in 2012, 0.8% in 2013 and 0.2% in 2014.\nGrowth picked up in 2015 with a growth of 0.8%. This was followed by a growth\nof 1.1% for 2016, a growth of 2.2% for 2017, and a growth of 2.1% for 2018.\n\nAccording to INSEE (2021), non-financial and non-agricultural medium-sized\nfirms employed 3 million full-time equivalent employees (24.3% of the\nworkforce), accounted for 27% of investment, 30% of turnover, and 26% of value\nadded, despite accounting for only 1.6% of total firms in France.",
    "openai_summarised_points": [
      "• The economy of France is characterized as a highly developed social market economy with significant state participation in strategic sectors.",
      "• France ranks as the world's seventh-largest economy by nominal GDP and the ninth-largest by purchasing power parity (PPP), accounting for approximately 4% of global GDP.",
      "• Due to a volatile currency exchange rate, France's GDP measured in dollars fluctuates sharply; notably, in 2024, France's GDP is smaller than in 2008.",
      "• The French economy is diversified, with the service sector dominating, representing 78.8% of GDP in 2017, followed by the industrial sector at 19.5%, and the primary sector at 1.7%.",
      "• In 2020, France was the largest recipient of Foreign Direct Investment (FDI) in Europe and the second-largest spender on research and development (R&D) in Europe.",
      "• France was ranked among the top 10 most innovative countries globally according to the 2020 Bloomberg Innovation Index.",
      "• It was also ranked as the 15th most competitive nation worldwide in the 2019 Global Competitiveness Report, improving by two positions compared to 2018.",
      "• France is the fifth-largest trading nation globally and the second-largest in Europe after Germany.",
      "• France is the most visited country in the world and the European Union's leading agricultural power.",
      "• According to the International Monetary Fund (IMF), in 2023, France was the 23rd country in the world by GDP per capita, with a value of $44,408 per inhabitant.",
      "• In 2021, France was listed on the United Nations Human Development Index with a score of 0.903, indicating very high human development, and ranked 22nd on the Corruption Perceptions Index.",
      "• Among OECD countries, France maintains a highly efficient and robust social security system, which constitutes approximately 31.7% of GDP.",
      "• Paris is a leading global city with one of the largest city GDPs worldwide; it ranks first in Europe and third globally by the number of companies listed in Fortune's Fortune Global 500.",
      "• In 2018, Paris produced approximately US$738 billion (or US$882 billion at market exchange rates), accounting for about one-third of the French economy.",
      "• The Paris metropolitan area, the largest in Europe alongside London, generates around US$1.0 trillion, roughly one-third of France's GDP.",
      "• Paris was ranked as the second most attractive global city in 2019 by KPMG.",
      "• La Défense, Paris's Central Business District, was ranked by Ernst & Young in 2017 as the leading business district in continental Europe and fourth worldwide.",
      "• The Organisation for Economic Co-operation and Development (OECD) is headquartered in Paris, which is also France's financial capital.",
      "• Major economic centers in France include Lyon, Toulouse (noted as the center of the European aerospace industry), Marseille, and Lille.",
      "• France's economy entered the late 2000s recession later than many affected economies, experiencing only four quarters of contraction before beginning recovery.",
      "• Between 2012 and 2014, France experienced stagnant growth: 0% in 2012, 0.8% in 2013, and 0.2% in 2014.",
      "• Economic growth resumed with 0.8% in 2015, 1.1% in 2016, 2.2% in 2017, and 2.1% in 2018.",
      "• According to INSEE (2021), medium-sized non-financial and non-agricultural firms employed 3 million full-time equivalent employees, representing 24.3% of the workforce.",
      "• These firms accounted for 27% of investment, 30% of turnover, and 26% of value added, despite constituting only 1.6% of total firms in France."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:05:57.898613",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3373,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Corporations",
    "text": "With 31 companies that are part of the world's biggest 500 companies, France\nwas in 2020 the most represented European country in the 2020 Fortune Global\n500, ahead of Germany (27 companies) and the UK (22).\n\nAs of August 2020, France was also the country that weighed the most on the\nEurozone's EURO STOXX 50 (representing 36.4% of all total assets), ahead of\nGermany (35.2%).\n\nSeveral French corporations rank amongst the largest in their industries such\nas AXA in insurance and Air France in air transportation. Luxury and consumer\ngoods are particularly relevant, with L'Oreal being the world's largest\ncosmetic company while LVMH and Kering are the world's two largest luxury\nproduct companies. In energy and utilities, GDF-Suez and EDF are amongst the\nlargest energy companies in the world, and Areva is a large nuclear-energy\ncompany; Veolia Environnement is the world's largest environmental services\nand water management company; Vinci SA, Bouygues and Eiffage are large\nconstruction companies; Michelin ranks in the top 3 tire manufacturers;\nJCDecaux is the world's largest outdoor advertising corporation; BNP Paribas,\nCredit Agricole and Société Générale rank amongst the largest banks in the\nworld by assets. Capgemini and Atos are among the largest technology\nconsulting companies.\n\nCarrefour is the world's second-largest retail group in terms of revenue;\nTotal is the world's fourth-largest private oil company; Lactalis is the\nworld's largest dairy products group; Sanofi is the world's fifth-largest\npharmaceutical company; Publicis is the world's third-largest advertising\ncompany; Groupe PSA is the world's 6th and Europe's 2nd largest automaker;\nAccor is the leading European hotel group; Alstom is one of the world's\nleading conglomerates in rail transport.\n\nIn 2022, the sector with the highest number of companies registered in France\nis Finance, Insurance, and Real Estate with 2,656,178 companies followed by\nServices and Retail Trade with 2,090,320 and 549,395 companies respectively.",
    "openai_summarised_points": [
      "• In 2020, France had 31 companies listed among the world's biggest 500 companies, making it the most represented European country in the 2020 Fortune Global 500, surpassing Germany with 27 companies and the UK with 22 companies.",
      "• As of August 2020, France was the leading country in the Eurozone's EURO STOXX 50 index, accounting for 36.4% of all total assets, ahead of Germany which held 35.2%.",
      "• French corporations that rank among the largest in their respective industries include AXA in insurance and Air France in air transportation.",
      "• The luxury and consumer goods sectors are notably significant in France, with L'Oreal recognized as the world's largest cosmetic company.",
      "• LVMH and Kering are identified as the world's two largest luxury product companies.",
      "• In energy and utilities, GDF-Suez and EDF are among the largest energy companies globally, while Areva is a major nuclear-energy enterprise.",
      "• Veolia Environnement is distinguished as the world's largest environmental services and water management company.",
      "• Major construction companies include Vinci SA, Bouygues, and Eiffage.",
      "• Michelin ranks among the top three tire manufacturers worldwide.",
      "• JCDecaux is identified as the world's largest outdoor advertising corporation.",
      "• French banking giants—BNP Paribas, Credit Agricole, and Société Générale—are among the largest banks in the world by assets.",
      "• Capgemini and Atos are recognized as leading technology consulting firms globally.",
      "• Carrefour is the world's second-largest retail group based on revenue.",
      "• Total ranks as the world's fourth-largest private oil company.",
      "• Lactalis is the largest dairy products group in the world.",
      "• Sanofi is the fifth-largest pharmaceutical company globally.",
      "• Publicis is the third-largest advertising company worldwide.",
      "• Groupe PSA is the sixth-largest automaker in the world and the second-largest in Europe.",
      "• Accor is identified as the leading hotel group in Europe.",
      "• Alstom is considered one of the world's leading conglomerates in rail transport.",
      "• In 2022, the sector with the highest number of registered companies in France was Finance, Insurance, and Real Estate, totaling 2,656,178 companies.",
      "• The Services and Retail Trade sectors followed, with 2,090,320 and 549,395 companies respectively."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:06:02.422899",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2011,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Rise and decline of dirigisme",
    "text": "France embarked on an ambitious and very successful programme of modernisation\nunder state coordination. This programme of _dirigisme_ , mostly implemented\nby governments between 1944 and 1983, involved the state control of certain\nindustries such as transportation, energy and telecommunications as well as\nvarious incentives for private corporations to merge or engage in certain\nprojects.\n\nThe 1981 election of president François Mitterrand saw a short-lived increase\nin governmental control of the economy, nationalizing many industries and\nprivate banks. This form of increased _dirigisme_ , was criticised as early as\n1982. By 1983, the government decided to renounce _dirigisme_ and start an era\nof rigueur (\"rigor\") or corporation. As a result, the government largely\nretreated from economic intervention; _dirigisme_ has now essentially receded,\nthough some of its traits remain. The French economy grew and changed under\ngovernment direction and planning much more than in other European countries.\n\nDespite being a widely liberalised economy, the government continues to play a\nsignificant role in the economy: government spending, at 56% of GDP in 2014,\nis the second-highest in the European Union. Labor conditions and wages are\nhighly regulated. The government continues to own shares in corporations in\nseveral sectors, including energy production and distribution, automobiles,\naerospace industry, shipbuilding, the arms industry, electronics industry,\nmachine industry, metallurgy, fuels, chemical industry, transportation, and\ntelecommunications.",
    "openai_summarised_points": [
      "• France initiated an extensive and highly successful modernization program under state coordination, characterized by the policy of _dirigisme_, primarily implemented by governments from 1944 to 1983.",
      "• The _dirigisme_ approach involved government control over key industries such as transportation, energy, and telecommunications, alongside providing incentives for private corporations to merge or undertake specific projects.",
      "• During this period, the French government actively directed economic development through regulation and strategic planning, fostering significant growth and transformation of the economy.",
      "• The election of President François Mitterrand in 1981 marked a brief resurgence of increased governmental control, including the nationalization of numerous industries and private banks, reflecting a temporary shift toward more interventionist policies.",
      "• This heightened _dirigisme_ faced criticism as early as 1982, indicating political and economic debates over the extent of state intervention.",
      "• By 1983, the French government decided to abandon the _dirigisme_ model in favor of a policy termed \"rigueur\" (\"rigor\") or \"la rigueur,\" signaling a move towards reduced economic intervention and a focus on austerity and fiscal discipline.",
      "• Following this shift, the government largely retreated from direct economic intervention, and _dirigisme_ has since receded, although some of its traits persist in the current economic framework.",
      "• Throughout the post-_dirigisme_ era, the French economy continued to grow and evolve under government planning and direction more extensively than in other European nations.",
      "• Despite being a largely liberalized economy, the French government maintains a significant role, with government spending constituting 56% of GDP in 2014, making it the second-highest in the European Union.",
      "• Labor conditions and wages in France remain highly regulated by the government, reflecting ongoing interventionist policies.",
      "• The French government continues to hold shares in various corporations across multiple sectors, including energy production and distribution, automobiles, aerospace, shipbuilding, arms manufacturing, electronics, machinery, metallurgy, fuels, chemicals, transportation, and telecommunications."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:06:06.211421",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1564,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Government finance",
    "text": "French Government borrowing (budget deficits) as a percentage of GNP,\n1960–2009 French bonds\n\n50 year\n\n20 year\n\n10 year\n\n2 year\n\n1 year\n\n3 month\n\nFrance's public debt from 1978 to 2009 Composition of the French economy (GDP)\nin 2016 by expenditure type\n\nIn April and May 2012, France held a presidential election in which the winner\nFrançois Hollande had opposed austerity measures, promising to eliminate\nFrance's budget deficit by 2017. The new government stated that it aimed to\ncancel recently enacted tax cuts and exemptions for the wealthy, raising the\ntop tax bracket rate to 75% on incomes over a million euros, restoring the\nretirement age to 60 with a full pension for those who have worked 42 years,\nrestoring 60,000 jobs recently cut from public education, regulating rent\nincreases; and building additional public housing for the poor.\n\nIn June 2012, Hollande's Socialist Party won an overall majority in the\nlegislative elections, giving it the capability to amend the French\nConstitution and allowing immediate enactment of the promised reforms. French\ngovernment bond interest rates fell 30% to record lows, less than 50 basis\npoints above German government bond rates.\n\nHollande's successor as President of France, Emmanuel Macron, a centrist\npolitician, took office in May 2017. His aim was to revive the euro zone’s\nsecond-largest economy.\n\nIn July 2020, during the COVID-19 pandemic, the French government issued\n10-years bonds which had negative interest rates, for the first time in its\nhistory (which means that investors buying French bonds will pay, rather than\nreceive, interest for owning French sovereign debt).\n\nFrance possesses in 2020 the fourth-largest gold reserves in the world.\n\nMacron vowed in May 2023 to build factories, boost job creations and make\nFrance more independent, shaked by pension protests.",
    "openai_summarised_points": [
      "• French government borrowing, measured as budget deficits as a percentage of Gross National Product (GNP), was tracked from 1960 to 2009, with data including French bonds of various maturities spanning 50-year, 20-year, 10-year, 2-year, 1-year, and 3-month durations.",
      "• France's public debt levels from 1978 to 2009 were documented, highlighting trends and changes over this period.",
      "• The composition of the French economy in 2016 was analyzed by expenditure type as a percentage of Gross Domestic Product (GDP).",
      "• In April and May 2012, France held a presidential election resulting in François Hollande's victory, who opposed austerity measures and pledged to eliminate France’s budget deficit by 2017.",
      "• Hollande's government aimed to reverse recent tax cuts and exemptions for the wealthy, including raising the top income tax bracket rate to 75% on incomes exceeding one million euros.",
      "• The government also committed to restoring the retirement age to 60 with full pension rights for those who have worked 42 years, rehire 60,000 jobs cut from public education, regulate rent increases, and build additional public housing for low-income populations.",
      "• In June 2012, Hollande’s Socialist Party secured an overall majority in the French legislative elections, enabling constitutional amendments and immediate implementation of the proposed reforms.",
      "• Following these reforms, French government bond interest rates decreased by 30%, reaching record lows, with yields less than 50 basis points above German government bond rates.",
      "• Emmanuel Macron, a centrist politician, succeeded Hollande as President of France in May 2017, with the goal of revitalizing the euro zone’s second-largest economy.",
      "• In July 2020, amid the COVID-19 pandemic, France issued 10-year bonds with negative interest rates for the first time in its history, meaning investors paid to hold French sovereign debt rather than earning interest.",
      "• France held the fourth-largest gold reserves globally in 2020.",
      "• In May 2023, Macron pledged to build factories, create jobs, and increase France’s economic independence, amidst protests related to pension reforms."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:06:12.225196",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1840,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "National debt",
    "text": "The Government of France has run a budget deficit each year since the early\n1970s. As of 2021, French government debt reached an equivalent of 118.6% of\nFrench GDP.\n\nUnder European Union rules, member states are supposed to limit their debt to\n60% of output or be reducing the ratio structurally towards this ceiling, and\nrun public deficits of no more than 3.0% of GDP.\n\nIn late 2012, credit-rating agencies warned that growing French government\ndebt levels risked France's AAA credit rating, raising the possibility of a\nfuture credit downgrade and subsequent higher borrowing costs for the French\ngovernment. In 2012 France was downgraded by ratings agencies Moody's,\nStandard & Poor's (S&P), and Fitch to an AA+ credit rating.\n\nIn December 2014 France's credit rating was further downgraded by Fitch and\nS&P to AA.\n\nMacron, shaken by pension protests, vowed in May 2023 to build factories,\nboost job creations and make France more independent.\n\nThe Government of France experienced a significant shift in its bond market\nposition on September 26, 2024, when its bond yield surpassed that of Spain\nfor the first time since 2007. The yield on 10-year French bonds reached\n2.97%, slightly exceeding the yield on Spanish bonds of similar maturity,\ndespite France's typically higher credit rating. This development raised\nconcerns among investors about France's ability to manage its public finances\neffectively. France's bond yields were reported to be higher than those of\nPortugal and approaching levels seen in Italy and Greece, countries\ntraditionally viewed as having higher economic risks in the Eurozone.\n\nFurthermore, France faces a budget crisis in 2024, with the deficit at risk of\nexceeding 6% of GDP, significantly higher than the previous government's\nestimate of 5.1%. Newly appointed Finance Minister Antoine Armand and Budget\nMinister Laurent Saint-Martin pledged to focus on spending cuts before\nconsidering tax increases to address the fiscal shortfall. Prime Minister\nMichel Barnier was tasked with finalizing the 2025 budget within days, amidst\npressure to present realistic plans for deficit reduction.",
    "openai_summarised_points": [
      "• The Government of France has maintained a budget deficit annually since the early 1970s.",
      "• As of 2021, French government debt equaled 118.6% of France's Gross Domestic Product (GDP).",
      "• European Union rules stipulate that member states should limit their national debt to 60% of GDP or work towards reducing it to this level through structural measures.",
      "• EU rules also mandate that member states should keep their public deficits at no more than 3.0% of GDP.",
      "• In late 2012, credit-rating agencies issued warnings that increasing French government debt levels threatened France’s AAA credit rating, raising concerns about potential future credit downgrades and higher borrowing costs.",
      "• In 2012, France was downgraded by Moody’s, Standard & Poor’s (S&P), and Fitch to an AA+ credit rating.",
      "• In December 2014, Fitch and S&P further downgraded France’s credit rating to AA.",
      "• French President Emmanuel Macron, following pension protests, promised in May 2023 to promote factory construction, increase job creation, and enhance France’s independence.",
      "• On September 26, 2024, France experienced a significant shift in its bond market position when its 10-year bond yield surpassed Spain’s for the first time since 2007, reaching 2.97%.",
      "• The French 10-year bond yield slightly exceeded that of Spain’s, despite France’s higher traditional credit rating, raising concerns about France’s fiscal management.",
      "• France’s bond yields were reported to be higher than Portugal’s and approaching levels seen in Italy and Greece, countries with higher perceived economic risks within the Eurozone.",
      "• France faces a looming budget crisis in 2024, with the deficit potentially exceeding 6% of GDP, notably higher than the previous government’s estimate of 5.1%.",
      "• Newly appointed Finance Minister Antoine Armand and Budget Minister Laurent Saint-Martin committed to prioritizing spending cuts over tax increases to address the fiscal shortfall.",
      "• Prime Minister Michel Barnier was tasked with finalizing the 2025 budget within days, amid pressure to develop realistic deficit reduction strategies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:06:19.127553",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2123,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "Change in per capita GDP of France, 1820–2018. Figures are inflation-adjusted\nto 2011 International dollars.\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green.\n\nYear  | GDP (in bn. US$PPP  | **GDP per capita** (in US$PPP) | **GDP** **(in bn. US$nominal)** | **GDP per capita** (in US$ nominal) | GDP growth\n(real)  | Inflation rate\n(% per annum)  | Unemployment\nrate  | Government\ndebt\n(% of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 578.2  | 10,761.0  | 702.2  | 13,069.5  | 1.8%  | 13.1%  | 6.3%  | 20.8%\n1981  | 639.7  | 11,839.6  | 619.0  | 11,456.0  | 1.1%  | 13.3%  | 7.4%  | 22.0%\n1982  | 695.9  | 12,806.8  | 588.0  | 10,822.0  | 2.5%  | 12.0%  | 8.1%  | 25.4%\n1983  | 732.2  | 13,397.2  | 562.5  | 10,292.8  | 1.3%  | 9.5%  | 7.4%  | 26.7%\n1984  | 770.6  | 14,037.1  | 532.3  | 9,697.4  | 1.6%  | 7.7%  | 8.5%  | 29.1%\n1985  | 808.6  | 14,660.1  | 557.6  | 10,108.6  | 1.7%  | 5.8%  | 8.7%  | 30.7%\n1986  | 843.7  | 15,225.8  | 772.8  | 13,947.3  | 2.3%  | 2.5%  | 8.9%  | 31.3%\n1987  | 886.8  | 15,926.7  | 935.1  | 16,794.0  | 2.6%  | 3.3%  | 9.2%  | 33.7%\n1988  | 960.2  | 17,157.3  | 1,020.9  | 18,241.0  | 4.6%  | 2.7%  | 8.8%  | 33.6%\n1989  | 1,043.1  | 18,536.6  | 1,026.2  | 18,236.8  | 4.5%  | 6.6%  | 8.7%  | 34.4%\n1990  | 1,113.4  | 19,680.1  | 1,272.4  | 22,490.3  | 2.9%  | 0.3%  | 8.4%  | 35.6%\n1991  | 1,163.6  | 20,471.7  | 1,273.6  | 22,406.4  | 1.1%  | 3.4%  | 8.6%  | 36.5%\n1992  | 1,207.9  | 21,150.8  | 1,404.4  | 24,590.7  | 1.5%  | 2.5%  | 9.4%  | 40.2%\n1993  | 1,228.1  | 21,407.8  | 1,324.2  | 23,082.7  | -0.7%  | 2.2%  | 10.3%  | 46.6%\n1994  | 1,284.0  | 22,305.4  | 1,396.7  | 24,262.2  | 2.4%  | 1.7%  | 10.7%  | 49.9%\n1995  | 1,340.6  | 23,212.9  | 1,602.1  | 27,741.3  | 2.3%  | 1.8%  | 10.5%  | 56.1%\n1996  | 1,383.6  | 23,882.3  | 1,606.0  | 27,720.9  | 1.4%  | 2.1%  | 10.8%  | 60.0%\n1997  | 1,440.4  | 24,784.8  | 1,454.6  | 25,028.5  | 2.3%  | 1.3%  | 10.9%  | 61.4%\n1998  | 1,509.1  | 25,884.7  | 1,505.2  | 25,818.4  | 3.6%  | 0.7%  | 10.7%  | 61.4%\n1999  | 1,580.7  | 27,021.4  | 1,494.6  | 25,550.8  | 3.3%  | 0.6%  | 10.4%  | 60.5%\n2000  | 1,683.0  | 28,594.2  | 1,366.2  | 23,212.5  | 4.1%  | 1.8%  | 9.2%  | 58.9%\n2001  | 1,754.2  | 29,598.8  | 1,377.7  | 23,245.3  | 1.9%  | 1.8%  | 8.5%  | 58.3%\n2002  | 1,802.5  | 30,199.5  | 1,500.3  | 25,137.4  | 1.2%  | 1.9%  | 8.3%  | 60.3%\n2003  | 1,853.5  | 30,840.1  | 1,844.1  | 30,682.6  | 0.8%  | 2.2%  | 8.5%  | 64.4%\n2004  | 1,951.9  | 32,260.2  | 2,118.7  | 35,016.2  | 2.6%  | 2.3%  | 8.9%  | 65.9%\n2005  | 2,048.0  | 33,594.5  | 2,198.2  | 36,057.1  | 1.7%  | 1.9%  | 8.9%  | 67.4%\n2006  | 2,167.0  | 35,292.8  | 2,320.7  | 37,795.9  | 2.6%  | 1.9%  | 8.9%  | 64.6%\n2007  | 2,278.5  | 36,871.8  | 2,660.9  | 43,060.0  | 2.4%  | 1.6%  | 8.0%  | 64.5%\n2008  | 2,325.8  | 37,432.1  | 2,930.0  | 47,155.2  | 0.2%  | 3.2%  | 7.4%  | 68.8%\n2009  | 2,275.5  | 36,428.3  | 2,698.0  | 43,191.0  | -2.8%  | 0.1%  | 9.1%  | 83.0%\n2010  | 2,344.8  | 37,358.4  | 2,647.3  | 42,178.6  | 1.8%  | 1.7%  | 9.3%  | 85.3%\n2011  | 2,446.5  | 38,789.6  | 2,864.7  | 45,420.0  | 2.2%  | 2.3%  | 9.2%  | 87.8%\n2012  | 2,474.0  | 39,037.0  | 2,685.4  | 42,372.1  | 0.4%  | 2.2%  | 9.8%  | 90.6%\n2013  | 2,608.5  | 40,951.5  | 2,811.9  | 44,144.6  | 0.7%  | 1.0%  | 10.3%  | 93.4%\n2014  | 2,662.0  | 41,576.1  | 2,856.7  | 44,616.5  | 1.0%  | 0.6%  | 10.3%  | 94.9%\n2015  | 2,719.2  | 42,289.1  | 2,439.4  | 37,937.9  | 1.1%  | 0.1%  | 10.4%  | 95.6%\n2016  | 2,863.8  | 44,421.7  | 2,472.3  | 38,348.5  | 1.0%  | 0.3%  | 10.1%  | 98.0%\n2017  | 2,997.3  | 46,369.7  | 2,594.2  | 40,134.1  | 2.4%  | 1.2%  | 9.4%  | 98.1%\n2018  | 3,124.8  | 48,190.0  | 2,792.2  | 43,060.6  | 1.8%  | 2.1%  | 9.0%  | 97.8%\n2019  | 3,240.6  | 49,782.0  | 2,729.2  | 41,924.8  | 1.9%  | 1.3%  | 8.4%  | 97.4%\n2020  | 3,020.5  | 46,267.4  | 2,636.0  | 40,377.5  | -7.9%  | 0.5%  | 8.0%  | 114.7%\n2021  | 3,358.9  | 51,322.3  | 2,957.4  | 45,187.8  | 6.8%  | 2.1%  | 7.9%  | 112.6%\n2022  | 3,688.3  | 56,199.9  | 2,778.1  | 42,330.5  | 2.5%  | 5.8%  | 7.5%  | 111.8%\n2023  | 3,844.9  | 58,420.6  | 2,806.7  | 42,646.0  | 0.7%  | 4.6%  | 7.6%  | 112.5%\n2024  | 3,986.7  | 60,406.6  | 2,932.4  | 44,431.0  | 1.6%  | 2.4%  | 7.5%  | 113.5%\n2025  | 4,134.5  | 62,469.8  | 3,057.2  | 46,193.3  | 1.8%  | 1.8%  | 7.5%  | 114.9%\n2026  | 4,282.9  | 64,531.7  | 3,179.5  | 47,906.1  | 1.7%  | 1.6%  | 7.4%  | 116.5%\n2027  | 4,428.6  | 66,540.8  | 3,299.7  | 49,579.1  | 1.4%  | 1.6%  | 7.4%  | 118.5%",
    "openai_summarised_points": [
      "• The data illustrates the change in per capita GDP of France from 1820 to 2018, with figures adjusted for inflation to 2011 International dollars, providing a long-term perspective on economic growth and living standards.",
      "• A comprehensive table presents key economic indicators for France from 1980 to 2021, with IMF staff estimates extending to 2027, covering metrics such as GDP in both PPP and nominal terms, GDP per capita, GDP growth rates, inflation rates, unemployment rates, and government debt as a percentage of GDP.",
      "• In 1980, France's GDP was approximately 578.2 billion US dollars (PPP), with a per capita GDP of 10,761.0 US dollars (PPP), and a nominal GDP of 702.2 billion US dollars, with a per capita nominal GDP of 13,069.5 US dollars.",
      "• The annual GDP growth rate in 1980 was 1.8%, with an inflation rate of 13.1%, unemployment at 6.3%, and government debt at 20.8% of GDP.",
      "• Throughout the 1980s, France experienced steady increases in GDP, with nominal GDP rising from 702.2 billion US dollars in 1980 to 1,020.9 billion in 1988, and GDP per capita (PPP) increasing from 10,761 to 17,157 US dollars.",
      "• The 1980s saw inflation rates generally declining from 13.1% in 1980 to below 10% by 1983, with unemployment rates fluctuating around 6-9%, and government debt rising from 20.8% to approximately 33.6% of GDP by 1988.",
      "• The early 1990s marked modest economic growth, with GDP in PPP terms reaching 1,163.6 billion US dollars in 1991 and GDP per capita (PPP) at 20,471.7 US dollars, while nominal GDP was about 1,273.6 billion US dollars.",
      "• During the 1990s, France's GDP growth was relatively stable, with real growth rates mostly between 1.1% and 2.3%, and inflation rates decreasing to below 2% by the late 1990s.",
      "• The late 1990s and early 2000s saw significant increases in GDP, with nominal GDP reaching approximately 1,683.0 billion US dollars in 2000 and GDP per capita (PPP) at 28,594.2 US dollars.",
      "• The 2000s experienced continued growth, with GDP in PPP terms surpassing 2,000 billion US dollars by 2004, and GDP per capita (PPP) rising to over 32,260 US dollars in 2004.",
      "• The financial crisis of 2008-2009 caused a contraction, with GDP decreasing from 2,325.8 billion US dollars in 2008 to 2,275.5 billion in 2009, and a notable GDP decline of -2.8% in 2009.",
      "• Post-2009 recovery saw GDP in PPP terms increase to 2,446.5 billion US dollars in 2011, with GDP per capita (PPP) reaching 38,789.6 US dollars, and a return to positive growth rates.",
      "• From 2012 onward, France's GDP in PPP terms generally increased, reaching 3,124.8 billion US dollars in 2018, with GDP per capita (PPP) at 48,190 US dollars.",
      "• The COVID-19 pandemic in 2020 caused a significant GDP contraction of -7.9%, with GDP in PPP terms falling to 3,020.5 billion US dollars and GDP per capita (PPP) decreasing to 46,267.4 US dollars.",
      "• In 2021, economic recovery was evident with GDP in PPP terms rising by 6.8% to 3,358.9 billion US dollars, and GDP per capita (PPP) increasing to 51,322.3 US dollars.",
      "• IMF estimates project continued growth through 2027, with GDP in PPP terms reaching approximately 4,428.6 billion US dollars and GDP per capita (PPP) rising to about 66,540.8 US dollars by that year.",
      "• The data indicates that inflation rates below 5% are highlighted in green in the table, with notable periods of low inflation occurring from 2014 onward, generally below 2%.",
      "• Unemployment rates fluctuated over the decades, peaking at 10.9% in 1997 and remaining around 8-10% during the 2000s, with a decrease to approximately 7.9% in 2021.",
      "• Government debt as a percentage of GDP increased from 20.8% in 1980 to over 60% during the 1990s and early 2000s, reaching 112.6% in 2021, reflecting rising public debt levels.",
      "• The data collectively illustrates France’s economic resilience, periods of growth, the impact of global financial crises, and ongoing recovery trends up to 2027 projections."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:06:25.047511",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4545,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Industry",
    "text": "A Peugeot 508 SW\n\nIn 2019, France was the world's 8th largest manufacturer in terms of value\nadded, according to the World Bank.\n\nThe leading industrial sectors in France are telecommunications (including\ncommunication satellites), aerospace and defence, ship building,\npharmaceuticals, construction and civil engineering, chemicals, textiles, and\nautomobile production. The chemical industry is a key sector for France,\nhelping to develop other manufacturing activities and contributing to economic\ngrowth.\n\nResearch and development spending is also high in France at 2.26% of GDP, the\nfourth-highest in the OECD.\n\nIndustry contributes to French exports: as of 2018, the Observatory of\nEconomic Complexity estimates that France's largest exports \"are led by\nplanes, helicopters, and spacecraft ($43.8 billion), cars ($26 billion),\npackaged medicaments ($25.7 billion), vehicle parts ($16.5 billion), and gas\nturbines ($14.4 billion).\"\n\nIn December 2023, industrial production in France experienced its most\nsignificant change since May of the same year, with a notable increase of\n1.1%."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Energy",
    "text": "France is the world-leading country in nuclear energy, home of global energy\ngiants Areva, EDF and GDF Suez: nuclear power now accounts for about 78% of\nthe country's electricity production, up from only 8% in 1973, 24% in 1980,\nand 75% in 1990. Nuclear waste is stored on site at reprocessing facilities.\nDue to its heavy investment in nuclear power, France is the smallest emitter\nof carbon dioxide among the seven most industrialised countries in the world.\nDue to its overwhelming reliance on nuclear power, renewable energies have\nseen relatively little growth compared to other Western countries.\n\nIn 2006, electricity generated in France amounted to 548.8 TWh, of which:\n\n* 428.7 TWh (78.1%) were produced by nuclear power generation\n* 60.9 TWh (11.1%) were produced by hydroelectric power generation\n* 52.4 TWh (9.5%) were produced by fossil-fuel power generation\n* 21.6 TWh (3.9%) by coal power\n* 20.9 TWh (3.8%) by natural-gas power\n* 9.9 TWh (1.8%) by other fossil fuel generation (fuel oil and gases by-products of industry such as blast furnace gases)\n* 6.9 TWh (1.3%) were produced by other types of power generation (essentially waste-to-energy and wind turbines)\n* The electricity produced by wind turbines increased from 0.596 TWh in 2004, to 0.963 TWh in 2005, and 2.15 TWh in 2006, but this still accounted only for 0.4% of the total production of electricity (as of 2006).\n\nIn November 2004, EDF (which stands for Electricité de France), one of the\nworld's largest utility company and France's largest electricity provider, was\nfloated with huge success on the French stock market. However, the French\nstate still retains 70% of the capital. Other electricity providers include\nCompagnie nationale du Rhône (CNR) and Endesa (through SNET)."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Agriculture",
    "text": "Development of agricultural output of France in 2015 US$ since 1961 A wheat\nfield in Villiers-le-Bâcle. France is the EU's largest agricultural producer.\n\nFrance is the world's sixth largest agricultural producer and EU's leading\nagricultural power, accounting for about one-third of all agricultural land\nwithin the EU. In the early 1980s, France was the leading producer of the\nthree principal grains of wheat, barley, and maize. Back in 1983, France\nproduced around 24.8 million tonnes, ahead of the United Kingdom and West\nGermany, the next two largest wheat producers.\n\nNorthern France is characterised by large wheat farms. Dairy products, pork,\npoultry, and apple production are concentrated in the western region. Beef\nproduction is located in central France, while the production of fruits,\nvegetables, and wine ranges from central to southern France. France is a large\nproducer of many agricultural products and is currently expanding its forestry\nand fishery industries. The implementation of the Common Agricultural Policy\n(CAP) and the Uruguay Round of the General Agreement on Tariffs and Trade\n(GATT) have resulted in reforms in the agricultural sector of the economy.\n\nAs the world's second-largest agricultural exporter, France ranks just after\nthe United States. The destination of 49% of its exports is other EU members\nstates. France also provides agricultural exports to many poor African\ncountries (including its former colonies) which face serious food shortages.\nWheat, beef, pork, poultry, and dairy products are the principal exports.\n\nExports from the United States face stiff competition from domestic\nproduction, other EU member states, and third-world countries in France. US\nagricultural exports to France, totaling some $600 million annually, consist\nprimarily of soybeans and soybean products, feeds and fodders, seafood, and\nconsumer products, especially snack foods and nuts. French exports to the\nUnited States are much more high-value products such as its cheese, processed\nproducts and its wine.\n\nThe French agricultural sector receives almost €11 billion in EU subsidies.\nFrance produced in 2018 39.5 million tons of sugar beet (2nd largest producer\nin the world, just behind Russia), which serves to produce sugar and ethanol;\n35.8 million tons of wheat (5th largest producer in the world); 12.6 million\ntons of maize (11th largest producer in the world); 11.2 million tons of\nbarley (2nd largest producer in the world, only behind Russia); 7.8 million\ntons of potato (8th largest producer in the world); 6.2 million tons of grape\n(5th largest producer in the world); 4.9 million tons of rapeseed (4th largest\nproducer in the world, behind Canada, China and India); 2.2 million tons of\nsugarcane; 1.7 million tons of apple (9th largest producer in the world); 1.3\nmillion tons of triticale (4th largest producer in the world, only behind\nPoland, Germany and Belarus); 1.2 million tons of sunflower seed (9th largest\nproducer in the world); 712 thousand tons of tomatoes; 660 thousand tons of\nlinen; 615 thousand tons of dry pea; 535 thousand tons of carrot; 427 thousand\ntons of oats; 400 thousand tons of soy; in addition to smaller productions of\nother agricultural products."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Tourism",
    "text": "The Palace of Versailles is one of the most popular tourist destinations in\nFrance.\n\nFrance is the world's most popular tourist destination with more than 83.7\nmillion foreign tourists in 2014, ahead of Spain (58.5 million in 2006) and\nthe United States (51.1 million in 2006). This figure excludes people staying\nless than 24 hours in France, such as northern Europeans crossing France on\ntheir way to Spain or Italy during the summer.\n\nAccording to figures from 2003, some popular tourist sites include (in\nvisitors per year): Eiffel Tower (6.2 million), Louvre Museum (5.7 million),\nPalace of Versailles (2.8 million), Cité des Sciences et de l'Industrie (2.6\nmillion), Musée d'Orsay (2.1 million), Arc de Triomphe (1.2 million), Centre\nPompidou (1.2 million), Mont-Saint-Michel (1 million), Château de Chambord\n(711,000), Sainte-Chapelle (683,000), Château du Haut-Kœnigsbourg (549,000),\nPuy de Dôme (500,000), Musée Picasso (441,000), Carcassonne (362,000).\nHowever, the most popular site in France is Disneyland Paris, with 9.7 million\nvisitors in 2017"
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Arms industry",
    "text": "Dassault Rafale\n\nThe French government is the French arms industry's main customer, mainly\nbuying warships, guns, nuclear weapons and equipment.\n\nDuring the 2000–2015 period, France was the fourth largest weapons exporter in\nthe world.\n\nFrench manufacturers export great quantities of weaponry to Saudi Arabia, the\nUnited Arab Emirates, Brazil, Greece, India, Pakistan, Taiwan, Singapore and\nmany others. It was reported that in 2015, French arms sales internationally\namounted to 17.4 billion U.S. dollars, more than double the figure of 2014."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Fashion and luxury goods",
    "text": "According to 2017 data compiled by Deloitte, Louis Vuitton Moet Hennessey\n(LVMH), a French brand, is the largest luxury company in the world by sales,\nselling more than twice the amount of its nearest competitor. Moreover, France\nalso possesses 3 of the top 10 luxury goods companies by sales (LVMH, Kering\nSA, L'Oréal), more than any other country in the world.\n\nParis is considered one of the world's foremost fashion capitals, or even \"the\nworld's fashion capital\". The French tradition for haute couture has been\nestimated to start as early as the era of Louis XIV, the Sun King."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.7",
    "section_name": "Education",
    "text": "Education in France is organised in a highly centralised manner, with many\nsubdivisions. It is divided into the three stages of primary education\n(_enseignement primaire_), secondary education (_enseignement secondaire_),\nand higher education (_enseignement supérieur_). In French higher education,\nthe following degrees are recognised by the Bologna Process (EU recognition):\n_Licence_ and _Licence Professionnelle_ (bachelor's degrees), and the\ncomparably named _Master_ and _Doctorat_ degrees.\n\nThe Programme for International Student Assessment coordinated by the OECD\ncurrently ranks the overall knowledge and skills of French 15-year-olds as\n26th in the world in reading literacy, mathematics, and science, near the OECD\naverage of 493. France's performance in mathematics and science at the middle\nschool level was ranked 23 in the 1995 Trends in International Math and\nScience Study.\n\nGrenoble Alpes University, the third largest university in France with about\n60,000 students and over 3,000 researchers\n\nThe OECD also found that students in France reported greater concern about\ndiscipline and behaviour at school and in classrooms, much more than the rest\nof Europe. This was higher than all OECD countries. School principals reported\nhigher staff and material shortage in France, higher than OECD averages. About\n7% of French teachers believe the teaching profession is highly valued in\nFrance and in society. School principals noted regular acts of violence/\nbullying among their students, higher than averages. The time spent of\nteaching time spent on keeping classes in good order is one of the largest in\nFrance, among all OECD countries studied. France also has a high drop out\nrate.\n\nPupils can take apprenticeships to enter the labour market with the\nBaccalauréat Technologique. It allows pupils pursue short and technical\nstudies (laboratory, design and applied arts, hotel and restaurant, management\netc).\n\nHigher education in France was reshaped by the student revolts of May 1968.\nDuring the 1960s, French public universities responded to a massive explosion\nin the number of students (280,000 in 1962–63 to 500,000 in 1967–68) by\nstuffing approximately one-third of their students into hastily developed\ncampus annexes (roughly equivalent to American satellite campuses) which\nlacked decent amenities, resident professors, academic traditions, or the\ndignity of university status. This is why the French higher education economy\nperforms poorly compared with other high-performing countries such as England\nor Australia. France also hosts various catholic universities recognised by\nthe state, the largest one being Lille Catholic University, as well branch\ncolleges of foreign universities. They include Baruch College, the University\nof London Institute in Paris, Parsons Paris School of Art and Design and the\nAmerican University of Paris. Eighteen million pupils and students are in the\neducation system, over 2.4 million of whom are in higher education."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "4.8",
    "section_name": "Transport",
    "text": "Brest station Two high-speed TGV trains by Alstom SA at Paris-Gare de l'Est\n\nTransportation in France relies on one of the densest networks in the world\nwith 146 km of road and 6.2 km of rail lines per 100 km2. It is built as a web\nwith Paris at its centre. The highly subsidised rail transport network makes\nup a relatively small portion of travel, most of which is done by car.\nHowever, the high-speed TGV trains make up a large proportion of long-distance\ntravel, partially because intercity buses were prevented from operating until\n2015.\n\nWith 3,220 kilometers of high-speed train lines, France boast the 2nd most\nexpansive network in the world, only after China. Charles de Gaulle Airport is\none of the busiest airports in the world by passenger traffic. Charles de\nGaulle airport is third globally in the number of destinations served, and\nfirst in the number of countries served with non-stop flights.\n\nFrance also boasts a number of seaports and harbours, including Bayonne,\nBordeaux, Boulogne-sur-Mer, Brest, Calais, Cherbourg-Octeville, Dunkerque,\nFos-sur-Mer, La Pallice, Le Havre, Lorient, Marseille, Nantes, Nice, Paris,\nPort-la-Nouvelle, Port-Vendres, Roscoff, Rouen, Saint-Nazaire, Saint-Malo,\nSète, Strasbourg and Toulon. There are approximately 470 airports in France\nand by a 2005 estimate, there are three heliports. 288 of the airports have\npaved runways, with the remaining 199 being unpaved. The national carrier of\nFrance is Air France, a full service global airline which flies to 20 domestic\ndestinations and 150 international destinations in 83 countries (including\nOverseas France) across all 6 major continents."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Foreign investment",
    "text": "According to a study conducted by Ernst & Young, France was in 2020 the\nlargest Foreign Direct Investment recipient in Europe, ahead of the UK and\nGermany. EY attributed this as a \"direct result of President Macron’s reforms\nof labor laws and corporate taxation, which were well received by domestic and\ninternational investors alike.\"\n\nFrance scored 5th in the 2019 AT Kearney FDI Confidence Index, up 2 notches\nfrom its 2017 ranking."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Labour market",
    "text": "According to a 2011 report by the American Bureau of Labor Statistics (BLS),\nFrance's GDP per capita at purchasing power parity is similar to that of the\nUK, with just over US$35,000 per head. To explain why French per capita GDP is\nlower than that of the United States, the economist Paul Krugman stated that\n\"French workers are roughly as productive as US workers\", but that the French\nhave a _lower workforce participation rate,_ and \"when they work, they work\nfewer hours\". According to Krugman, the difference is due to the French making\n\"different choices about retirement and leisure\".\n\nLa Part-Dieu, Lyon's central business district\n\nFrance has long suffered a relatively high unemployment rate, even during the\nyears when its macroeconomic performances compared favourably with other\nadvanced economies. The employment rate of the French working-age population\nis one of the lowest of the OECD countries: in 2020, only 64.4% of the French\nworking-age population were in employment, compared to 77% in Japan, 76.1% in\nGermany, 75.4% in the UK, but the French employment rate was higher than that\nof the US, which stood at 62.5%. This gap is due to the low employment rate of\nthose 15–24 years old: 38% in 2012, compared to 47% in the OECD.\n\nSince his election in 2017, Emmanuel Macron has introduced several labour\nmarket reforms which proved successful in decreasing the unemployment rate\nbefore the global COVID-19 recession struck. In late 2019, the French\nunemployment rate, though still high compared to other developed economies,\nwas the lowest in a decade.\n\nDuring the 2000s and 2010s, classical liberal and Keynesian economists sought\nout different solutions to the unemployment issue in France. Keynesian\neconomists's theories led to the introduction of the 35-hour workweek law in\n1999. Between 2004 and 2008, the government attempted to combat unemployment\nwith supply-side reforms, but was met with fierce resistance; the _contrat\nnouvelle embauche_ and the _contrat première embauche_ (which allowed more\nflexible contracts) were of particular concern, and both were eventually\nrepealed. The Sarkozy government used the _revenu de solidarité active_ (in-\nwork benefits) to redress the _negative effect_ of the _revenu minimum\nd'insertion_ (unemployment benefits which do not depend on previous\ncontributions, unlike normal unemployment benefits in France) on the incentive\nto accept even jobs which are insufficient to earn a living. Neoliberal\neconomists attribute the low employment rate, particularly evident among young\npeople, to high minimum wages that would prevent low productivity workers from\neasily entering the labour market.\n\nA December 2012 _New York Times_ article reported on a \"floating generation\"\nin France that formed part of the 14 million unemployed young Europeans\ndocumented by the Eurofound research agency. This _floating generation_ was\nattributed to a dysfunctional system: \"an elitist educational tradition that\ndoes not integrate graduates into the work force, a rigid labour market that\nis hard to enter for newcomers, and a tax system that makes it expensive for\ncompanies to hire full-time employees and both difficult and expensive to lay\nthem off\". In July 2013, the unemployment rate for France was 11%.\n\nIn early April 2014, employers' federations and unions negotiated an agreement\nwith technology and consultancy employers, as employees had been experiencing\nan extension of their work time through smartphone communication outside of\nofficial working hours. Under a new, legally binding labour agreement, around\n250,000 employees will avoid handling work-related matters during their\nleisure time and their employers will, in turn, refrain from engaging with\nstaff during this time.\n\nEvery day, about 80,000 French citizens commute to work in neighbouring\nLuxembourg, making it the biggest cross-border workforce group in the whole of\nthe European Union. They are attracted by much higher wages for the different\njob groups than in their own country and the lack of skilled labour in the\nbooming Luxembourgish economy.\n\nThe background of the 2023 pension reform was about 14% of GDP pension\nspending in France compared to OECD average of just over 9%. The aim of the\npension reform was to reduce cost by increasing the minimum legal retirement\nage from 62 years to 64 years in 2030. In April 2023, president Emmanuel\nMacron signed the pension reforms into law."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "External trade",
    "text": "In 2018, France was the 5th largest trading nation in the world, as well as\nthe second-largest trading nation in Europe (after Germany). Its foreign trade\nbalance for goods had been in surplus from 1992 until 2001, reaching $25.4\nbillion (25.4 G$) in 1998; however, the French balance of trade was hit by the\neconomic downturn, and went into the red in 2000, reaching a US$15bn deficit\nin 2003. Total trade for 1998 amounted to $730 billion, or 50% of GDP—imports\nplus exports of goods and services. Trade with European Union countries\naccounts for 60% of French trade.\n\nIn 1998, US–France trade stood at about $47 billion – goods only. According to\nFrench trade data, US exports accounted for 8.7% – about $25 billion – of\nFrance's total imports. US industrial chemicals, aircraft and engines,\nelectronic components, telecommunications, computer software, computers and\nperipherals, analytical and scientific instrumentation, medical instruments\nand supplies, broadcasting equipment, and programming and franchising are\nparticularly attractive to French importers.\n\nThe principal French exports to the US are aircraft and engines, beverages,\nelectrical equipment, chemicals, cosmetics, luxury products and perfume.\nFrance is the ninth-largest trading partner of the US.\n\n**Amounts in billions of US dollars (2016)** Exports  | Rank  | Country  | Amount\n---|---|---\n1\\.  |  Germany | 70.1\n2\\.  |  United States | 40.4\n3\\.  |  Belgium\nLuxembourg | 36.7\n4\\.  |  Italy | 35.3\n5\\.  |  United Kingdom | 35.3\n6\\.  |  Spain | 34.6\n7\\.  |  China | 18.6\n8\\.  |  Netherlands | 16.8\n9\\.  |  Switzerland | 16.2\n10\\.  |  Japan | 8.9\n11\\.  |  Poland | 7.9\n12\\.  |  Singapore | 7.8\n13\\.  |  Turkey | 7.5\n14\\.  |  Hong Kong | 6.4\n15\\.  |  Ireland | 6.3\n16\\.  |  Russia | 6.1\n17\\.  |  Sweden | 5.7\n18\\.  |  South Korea | 5.7\n19\\.  |  Algeria | 5.3\n20\\.  |  Portugal | 5.3\nImports  | Rank  | Country  | Amount\n---|---|---\n1\\.  |  Germany | 99.8\n2\\.  |  China | 47.9\n3\\.  |  Italy | 43.7\n4\\.  |  Belgium\nLuxembourg | 41.6\n5\\.  |  United States | 37.9\n6\\.  |  Spain | 37.1\n7\\.  |  Netherlands | 26.4\n8\\.  |  United Kingdom | 22.4\n9\\.  |  Switzerland | 15.8\n10\\.  |  Poland | 10.4\n11\\.  |  Japan | 10.1\n12\\.  |  Ireland | 7.6\n13\\.  |  Czech Republic | 7.6\n14\\.  |  Turkey | 7.5\n15\\.  |  Norway | 6.4\n16\\.  |  Portugal | 6.3\n17\\.  |  Sweden | 6.0\n18\\.  |  Austria | 5.6\n19\\.  |  India | 5.1\n20\\.  |  Vietnam | 5.0\nTotal trade  | Rank  | Country  | Amount\n---|---|---\n1\\.  |  Germany | 169.9\n2\\.  |  Italy | 79.0\n3\\.  |  United States | 78.3\n4\\.  |  Belgium\nLuxembourg | 78.3\n5\\.  |  Spain | 71.7\n6\\.  |  China | 66.5\n7\\.  |  United Kingdom | 57.7\n8\\.  |  Netherlands | 43.2\n9\\.  |  Switzerland | 32.0\n10\\.  |  Japan | 19.0\n\nIn August 2023, the French current account deficit shrank by €29.7 billion in\nthe past six months, from −€39.3 billion to −€9.6 billion, primarily due to a\nfall in energy prices."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Regional economy",
    "text": "Nominal GDP per capita, 2015 Eurostat\n\nThe economic disparity between French regions is not as high as that in other\nEuropean countries such as the UK or Italy and higher than in countries like\nSweden or Denmark, or even Spain. However, Europe's wealthiest and second\nlargest regional economy, Ile-de-France (the region surrounding Paris), has\nlong profited from the capital city's economic hegemony.\n\nThe most important _régions_ are Île-de-France (Europe's 4th regional\neconomy), Rhône-Alpes (Europe's 5th largest regional economy thanks to its\nservices, high-technologies, chemical industries, wines, tourism), Provence-\nAlpes-Côte d'Azur (services, industry, tourism and wines), Nord-Pas-de-Calais\n(European transport hub, services, industries) and Pays de la Loire (green\ntechnologies, tourism). Regions like Alsace, which has a rich past in industry\n(machine tool) and currently stands as a high income service-specialised\nregion, are very wealthy without ranking very high in absolute terms.\n\nThe rural areas are mainly in Auvergne, Limousin, and Centre-Val de Loire, and\nwine production accounts for a significant proportion of the economy in\nAquitaine (Bordeaux (or claret)), Burgundy, and champagne produced in\nChampagne-Ardennes.\n\nRhône-Alpes, Europe's 5th largest regional economy. In the past mining, especially coal mining was an important sector, particularly around Saint-Étienne, although this has declined since the 1970s. Rank  | Region  | GDP\n(millions of\neuros, 2015)  | GDP per capita\n(euros, 2015)\n---|---|---|---\n1  | Île de France | 671,048  | 55,433\n2  | Auvergne-Rhône-Alpes | 250,197  | 31,666\n3  | Nouvelle-Aquitaine | 163,140  | 27,527\n4  | Occitanie | 159,326  | 27,497\n5  | Hauts-de-France | 157,316  | 26,170\n6  | Provence-Alpes-Côte d'Azur | 154,081  | 30,709\n7  | Grand Est | 151,880  | 27,317\n8  | Pays de la Loire | 109,965  | 29,482\n9  | Normandy | 91,810  | 27,495\n10  | Brittany | 91,406  | 27,684\n11  | Bourgogne-Franche-Comté | 74,074  | 26,258\n12  | Centre-Val de Loire | 70,230  | 27,226\n| _Réunion_ | 18,373  | 21,559\n| _Guadeloupe_ | 9,724  | 22,509\n| _Martinique_ | 9,289  | 24,516\n13  | Corsica | 8,761  | 26,629\n| _French Guiana_ | 4,441  | 16,777\n| _Mayotte_ | 2,309  | 9,755"
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Departmental income inequalities",
    "text": "Paris is France's largest urban economy (and the world's third).\n\nIn terms of income, important inequalities can be observed among the French\ndépartements.\n\nAccording to the 2008 statistics of the INSEE, the Yvelines is the highest\nincome department of the country with an average income of €4,750 per month.\nHauts-de-Seine comes second, Essonne third, Paris fourth, Seine-et Marne\nfifth. Île-de-France is the wealthiest region in the country with an average\nincome of €4,228 per month (and is also the wealthiest region in Europe)\ncompared to €3,081 at the national level. Alsace comes second, Rhône-Alpes\nthird, Picardy fourth, and Upper Normandy fifth.\n\nThe poorest parts of France are the French overseas departments, French Guiana\nbeing the poorest department with an average household income of €1,826. In\nMetropolitan France it is Creuse in the Limousin region which comes bottom of\nthe list with an average household income of €1,849 per month."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Urban income inequalities",
    "text": "Huge inequalities can also be found among cities. In the Paris metropolitan\narea, significant differences exist between the higher standard of living of\n_Paris Ouest_ and lower standard of living in areas in the northern\n_banlieues_ of Paris such as Seine-Saint-Denis.\n\nFor cities of over 50,000 inhabitants, Neuilly-sur-Seine, a western suburb of\nParis, is the wealthiest city in France with an average household income of\n€5,939, and 35% earning more than €8,000 per month. But within Paris, four\narrondissements surpass wealthy Neuilly-sur-Seine in household income: the\n6th, the 7th, the 8th and the 16th; the 8th arrondissement being the\nwealthiest district in France (the other three following it closely as 2nd,\n3rd and 4th wealthiest ones)."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Poverty",
    "text": "OECD data from 2021 estimate that 8.4% of the French population lived in\npoverty, compared with 18% in the United States, 11.6% in Canada, and 9.8% in\nGermany. In 2016, the poverty rate in France stood at 14%, compared to 12.8%\nin 2004. The northern districts of Marseille represent one of the poorest and\nunequal areas in France, where poor neighbourhoods rub shoulders with\nwealthier pockets. The share of people living below the poverty line (949 euro\nper month) was 28.8% in 2008 in sensitive urban zones (ZUS) compared to 12% in\nthe rest of the territory.\n\nIn comparison with the average French workers, foreign workers tended to be\nemployed in the hardest and lowest-paid jobs. They also live in poor\nconditions. A 1972 study found that foreign workers earned 17% less than their\nFrench counterparts, although this national average concealed the extent of\ninequality. Foreign workers were more likely to be men in their prime working\nyears in the industrial areas, which generally had higher rates of pay than\nelsewhere."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Overview",
    "text": "In 2010, the French had an estimated wealth of US$14.0 trillion for a\npopulation of 63 million.\n\n* In terms of aggregate wealth, the French are the wealthiest Europeans, accounting for more than a quarter of wealthiest European households. Globally, the French nation ranks fourth-wealthiest.\n* In 2010, wealth per French adult was a little higher than $290,000, down from a pre-crisis high of $300,000 in 2007. According to this ratio, the French are the wealthiest in Europe. The wealth tax is paid by 1.1 million people in France. Liability to this tax starts from €1.3 million of assets. (There is a discount on the principal residence value.)\n* Almost every French household has at least $1,000 in assets. Proportionally, there are twice as many French with assets of over $10,000 and four times as many French with assets of over $100,000 than the world average."
  },
  {
    "chapter_name": "Economy of France",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Millionaires",
    "text": "France has the third-highest number of millionaires in Europe as of 2017.\nThere were 1.617 million millionaire households (measured in US dollars)\nliving in France in 2017, behind the UK (2.225 million) and Germany (1.637\nmillion).\n\nFrance Macroeconomic indicators\n\nThe wealthiest man in France is the LVMH CEO and owner Bernard Arnault.\n\nBy 2022, the combined wealth of France's 500 richest people will be worth\n1,170 billion euros, or 45% of GDP. In 2009, this figure was just 194 billion,\nrepresenting 10% of GDP at the time."
  }
]