[
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2021)_  \n---|---  \n  \nThe **economy ofPanama** is based mainly on the tourism and services sector,\nwhich accounts for nearly 80% of its GDP and accounts for most of its foreign\nincome. Services include banking, commerce, insurance, container ports, and\nflagship registry, medical and health and tourism. Historically, the Panama\nCanal (and the nearby Colón Free Trade Zone) was the key source of Panama's\nincome, but its importance has been displaced by the services sector.\n\nThe country's industry includes the manufacturing of aircraft spare parts,\ncement, drinks, adhesives, and textiles. Additionally, exports from Panama\ninclude bananas, shrimp, sugar, coffee, and clothing. Panama's economy is\nfully dollarized, with the US dollar being legal tender in the country. Panama\nwas the first foreign country to adopt the U.S. dollar as its legal currency\n(1903) after its secession from Colombia (with U.S. help) temporarily deprived\nit of a local currency. Panama is a high income economy with a history of low\ninflation.",
    "openai_summarised_points": [
      "• The economy of Panama is predominantly based on the tourism and services sector, which constitutes nearly 80% of the country's Gross Domestic Product (GDP) and generates the majority of its foreign income.",
      "• The services sector in Panama encompasses banking, commerce, insurance, container ports, flagship registry, medical and health services, and tourism.",
      "• Historically, the Panama Canal and the nearby Colón Free Trade Zone were the primary sources of Panama's income; however, their economic significance has been surpassed by the expanding services sector.",
      "• Panama’s industrial sector includes the manufacturing of aircraft spare parts, cement, beverages, adhesives, and textiles.",
      "• Panama exports agricultural and manufactured products such as bananas, shrimp, sugar, coffee, and clothing.",
      "• Panama’s economy is fully dollarized, with the United States dollar serving as legal tender throughout the country.",
      "• Panama was the first foreign nation to adopt the U.S. dollar as its official currency in 1903, following its secession from Colombia, which was facilitated by U.S. support and resulted in the temporary absence of a local currency.",
      "• Panama is classified as a high-income economy and has a historical record of maintaining low inflation rates."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:27.479379",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1163,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Since the early 16th century, Panama's geographic location gave the country a\ncomparative advantage. From the earliest Spanish times, ports on each coast\nand a trail between them handled much of Spain's colonial trade to the benefit\nof the inhabitants of the port cities.\n\nPanama has always been dependent on world commerce for its prosperity, and it\nis affected by the cyclical nature of international trade. The economy\nstagnated in the 18th century as colonial exchange via the isthmus declined.\nIn the mid-19th century, Panama's economy boomed as a result of increased\ncargo and passengers associated with the California Gold Rush. A railroad\nacross the isthmus, completed in 1855, extended economic growth for about\nfifteen years until completion of the first transcontinental railroad in the\nUnited States led to a decline in trans-isthmian traffic.\n\nFrance's efforts to construct a canal across the isthmus in the 1880s and\nefforts by the United States in the early 20th century stimulated the\nPanamanian economy. The United States completed the canal in 1914. However,\nthe world depression of the 1930s reduced international trade and canal\ntraffic, causing widespread unemployment in the terminal cities and generating\na flow of workers to subsistence farming. During World War II, canal traffic\ndid not increase, but the economy boomed as the convoy system and the presence\nof United States forces, sent to defend the canal, increased foreign spending\nin the canal cities. The end of the war was followed by an economic depression\nand another movement of unemployed people into agriculture.\n\nThe postwar depression gave way to rapid economic expansion between 1950 and\n1970. All sectors contributed to the growth. Agricultural output rose, and\ncommerce evolved into a relatively sophisticated wholesale and retail system.\nBanking, tourism, and the export of services to the Canal Zone grew rapidly.\nMost importantly, an increase in world trade provided a major stimulus to use\nof the canal and to the economy.\n\nIn the 1970s and 1980s, Panama's growth fluctuated with the vagaries of the\nworld economy. After 1973, economic expansion slowed considerably as a result\nof a number of international and domestic factors. In the early 1980s, the\neconomy rebounded. The acute recession in Latin America after 1982, however,\nwreaked havoc on Panama's economy. This period coincided with the rise to\npower of General Manuel Noriega during which Panama became increasingly\nindebted.\n\nThe United States started to pursue Noriega, culminating in sanctions that\nfroze Panama's assets in the United States, and because Panama used the US\ndollar it was forced to default on its IMF debt in 1987. Economic turmoil in\nthe country included a general strike and the banking system closing down for\ntwo months. The United States invaded Panama in 1989 and forced the surrender\nof Noriega. Panama regained access to IMF funds in 1992.\n\nAfter taking office in 1994, President Ernesto Perez Balladares instituted an\neconomic liberalization program designed to liberalize the trade regime,\nattract foreign investment, privatize state-owned enterprises, institute\nfiscal discipline. After two years of near-stagnation, there was strong GDP\ngrowth in 1997–1998. The most important sectors which drove growth were the\nPanama Canal and the shipping and port activities of the Colón Free Trade\nZone.\n\nDuring the Moscoso administration beginning in 1999, Moscoso attempted to\nstrengthen social programs. Moscoso's administration successfully handled the\nPanama Canal transfer and was effective in the administration of the Canal.\n\nUnder the Martín Torrijos administration beginning in 2004, Panama continued\nstrong economic growth and initiated the 2007–2016 Panama Canal expansion\nproject. The canal expansion doubled the waterway capacity. Strong economic\nperformance had reduced the national poverty level to 29% in 2008.\n\nIn 2008, Panama had the second most unequal income distribution in Latin\nAmerica. The Torrijos government implemented tax reforms, as well as social\nsecurity reforms, and backed regional trade agreements and development of\ntourism. Not a CAFTA signatory, Panama in December 2006 independently\nnegotiated a free trade agreement with the US.\n\nIn May 2009, Ricardo Martinelli was elected president, and promised to promote\nfree trade, establish a metro system, and complete the expansion plan for the\nPanama Canal.\n\nPanama's economic role has been compared to that of Singapore: commentators\nhave described the country as \"the Singapore of central America\", although\nPanama's involvement in the Odebrecht scandal has dealt a blow to official\nattempts to market Panama using this expression.",
    "openai_summarised_points": [
      "• Since the early 16th century, Panama's geographic location provided a comparative advantage, with ports on each coast and a trail between them facilitating much of Spain's colonial trade, benefiting the inhabitants of the port cities.",
      "• Panama's economy has historically depended on world commerce and is influenced by the cyclical nature of international trade, experiencing stagnation in the 18th century as colonial exchange via the isthmus declined.",
      "• In the mid-19th century, Panama's economy boomed due to increased cargo and passenger traffic linked to the California Gold Rush; the completion of a railroad across the isthmus in 1855 extended this growth for about fifteen years until the first transcontinental railroad in the United States reduced trans-isthmian traffic.",
      "• French efforts to construct a canal across the isthmus in the 1880s and subsequent United States efforts in the early 20th century stimulated Panama's economy, culminating in the completion of the Panama Canal by the United States in 1914.",
      "• The Great Depression of the 1930s caused a reduction in international trade and canal traffic, leading to widespread unemployment in terminal cities and a shift of workers to subsistence farming.",
      "• During World War II, canal traffic did not increase, but the economy boomed due to the convoy system and the presence of United States forces defending the canal, which increased foreign spending in canal cities.",
      "• Post-World War II economic depression was followed by rapid expansion between 1950 and 1970, with growth across all sectors including increased agricultural output, development of a sophisticated wholesale and retail commerce system, and rapid growth in banking, tourism, and export of services to the Canal Zone, stimulated by increased world trade.",
      "• In the 1970s and 1980s, Panama's economic growth fluctuated with global economic conditions; after 1973, expansion slowed due to international and domestic factors, with a rebound in the early 1980s followed by severe recession in Latin America after 1982, coinciding with General Manuel Noriega’s rise to power and increasing national indebtedness.",
      "• The United States pursued Noriega, imposing sanctions that froze Panama's assets in the US; Panama, using the US dollar, was forced to default on its IMF debt in 1987, leading to economic turmoil including a general strike and a two-month banking system closure.",
      "• The United States invaded Panama in 1989, forcing Noriega’s surrender; Panama regained access to IMF funds in 1992.",
      "• After assuming office in 1994, President Ernesto Perez Balladares implemented an economic liberalization program aimed at trade liberalization, attracting foreign investment, privatizing state-owned enterprises, and instituting fiscal discipline; following two years of near-stagnation, strong GDP growth occurred in 1997–1998, driven primarily by the Panama Canal and shipping and port activities of the Colón Free Trade Zone.",
      "• During the administration of President Mireya Moscoso beginning in 1999, efforts focused on strengthening social programs; Moscoso’s government successfully managed the Panama Canal transfer and administered the Canal effectively.",
      "• Under President Martín Torrijos, starting in 2004, Panama continued strong economic growth and initiated the Panama Canal expansion project (2007–2016), which doubled the waterway’s capacity; by 2008, strong economic performance had reduced the national poverty level to 29%.",
      "• In 2008, Panama exhibited the second most unequal income distribution in Latin America; the Torrijos government implemented tax and social security reforms, supported regional trade agreements, and promoted tourism development; although not a CAFTA signatory, Panama independently negotiated a free trade agreement with the United States in December 2006.",
      "• Ricardo Martinelli was elected president in May 2009, pledging to promote free trade, establish a metro system, and complete the Panama Canal expansion plan.",
      "• Panama’s economic role has been compared to that of Singapore, with commentators describing it as \"the Singapore of Central America,\" although Panama’s involvement in the Odebrecht corruption scandal has negatively impacted official efforts to market the country using this analogy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:37.540412",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4693,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Financial services",
    "text": "Panama has a substantial financial services sector and no central bank to act\nas a lender of last resort to rescue banks that get in trouble. As a result,\nPanamanian banks are very conservatively run, with an average capital adequacy\nratio of 15.6% in 2012, nearly double the legal minimum. The sector grew up\nproviding trade finance for trade passing through the Canal, and later evolved\ninto money laundering for the drug trade under Noriega. Since the 2008\nfinancial crisis, the country has been trying to shake off its reputation as a\ntax haven, signing double taxation treaties with many (mostly OECD) countries\nand in April 2011 a treaty on the exchange of financial information with the\nUnited States.",
    "openai_summarised_points": [
      "• Panama's financial services sector is substantial and operates without a central bank, meaning there is no lender of last resort to rescue banks facing financial difficulties.",
      "• Due to the absence of a central bank, Panamanian banks are managed very conservatively, maintaining an average capital adequacy ratio of 15.6% in 2012, which is nearly double the legally required minimum.",
      "• The financial sector initially developed by providing trade finance services for commerce passing through the Panama Canal.",
      "• Over time, the sector became associated with money laundering activities linked to the drug trade during the regime of Manuel Noriega.",
      "• Following the global financial crisis of 2008, Panama has actively sought to improve its international reputation and reduce its image as a tax haven.",
      "• To this end, Panama has signed numerous double taxation treaties, primarily with countries belonging to the Organisation for Economic Co-operation and Development (OECD).",
      "• In April 2011, Panama entered into a treaty with the United States focused on the exchange of financial information to enhance transparency and cooperation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:23.805939",
      "openai_model": "gpt-4.1-mini",
      "content_length": 708,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Agriculture",
    "text": "Maize cultivation in Panama.\n\nAgriculture in Panama is an important sector of the Panamanian economy. Major\nagricultural products include bananas, cocoa beans, coffee, coconuts, timber,\nbeef, chicken, shrimp, corn, potatoes, rice, soybeans, and sugar cane.\n\nIn 2009 agriculture and fisheries made up 7.4% of Panama's GDP. Panama is a\nnet food importer and the U.S. is its main supplier. Agriculture employs many\nPanamanians (in relation to agriculture's percentage of Panamanian GDP)\nbecause many farmers are engaged in subsistence farming.",
    "openai_summarised_points": [
      "• Agriculture constitutes a significant sector within the Panamanian economy, contributing notably to the country's overall economic activities.",
      "• Major agricultural products cultivated and produced in Panama include bananas, cocoa beans, coffee, coconuts, timber, beef, chicken, shrimp, corn (maize), potatoes, rice, soybeans, and sugar cane.",
      "• In the year 2009, the combined sectors of agriculture and fisheries accounted for 7.4% of Panama's Gross Domestic Product (GDP).",
      "• Despite its agricultural production, Panama is a net importer of food, relying primarily on the United States as its main supplier of imported food products.",
      "• The agricultural sector in Panama employs a substantial portion of the population, which is relatively high compared to agriculture’s share of the national GDP, largely due to the prevalence of subsistence farming among many Panamanian farmers."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:25.633185",
      "openai_model": "gpt-4.1-mini",
      "content_length": 540,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Mining",
    "text": "| This article needs to be **updated**. The reason given is: petaquilla's gold\nmine has been abandoned since an unconstitutionality ruling was rendered\nagainst it. Rise in GDP percentage with cobre Panama's operations. Please help\nupdate this article to reflect recent events or newly available information.\n_( April 2024)_\n---|---\nThe mineral-mining industry of Panama accounted for about 1% of the country's\nGDP in 2006. This does not include any manufacturing of mineral commodities,\nsuch as cement or petroleum refinery products.\n\nAn economic activity map of Panama, 1981.",
    "openai_summarised_points": [
      "• As of 2006, the mineral-mining industry in Panama contributed approximately 1% to the country's Gross Domestic Product (GDP), excluding the manufacturing sectors related to mineral commodities such as cement production and petroleum refining.",
      "• The Petaquilla gold mine, a significant mining operation in Panama, has been abandoned following a ruling of unconstitutionality against it, indicating legal and operational challenges impacting the mining sector.",
      "• The operations of Cobre Panama, a major copper mining project, have led to a rise in Panama’s GDP percentage attributed to mining activities, reflecting the economic importance of copper extraction in recent years.",
      "• The article notes the need for updates as of April 2024 to incorporate recent developments and newly available information regarding Panama’s mining industry, particularly concerning the status of Petaquilla and the economic impact of Cobre Panama.",
      "• An economic activity map of Panama from 1981 is referenced, providing historical context for the distribution and significance of various economic sectors, including mining, within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:24.884401",
      "openai_model": "gpt-4.1-mini",
      "content_length": 576,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Real estate",
    "text": "The Republic of Panama's real estate industry relies on foreign investment.\nThe sector has grown since 2006, as such investment has helped to fuel\nPanama's economy and housing market.\n\nIn spite of the economic and housing market growth, poverty is a problem in\nPanama. Most indigenous people live in extreme poverty while others located in\nrural areas live in basic poverty. Lack of sanitation, electricity, basic\nwater, health, and education amongst the poor is a serious problem affecting\nPanama’s housing conditions.\n\nIn an attempt to encourage foreign investments for real estate projects and\ninfrastructure, the government of Panama enacted laws protecting foreigners\nand citizens who make investments.\n\nCorruption permeates the real estate market including claims of drug profits\nand money laundering financing real estate projects.\n\nSimilar to the U.S. and Canada, Panama uses a system of publicly recorded\ntitled deeds as proof of real estate ownership. A unique Rights of Possession\nsystem exists allowing individuals to occupy unused government lands in order\nto make improvements to them.",
    "openai_summarised_points": [
      "• The Republic of Panama's real estate industry is heavily dependent on foreign investment, which has been a significant driver of growth since 2006, contributing positively to both the national economy and the housing market.",
      "• Despite the expansion of the economy and housing sector, poverty remains a critical issue in Panama, with most indigenous populations living in conditions of extreme poverty and many rural inhabitants experiencing basic poverty.",
      "• The poor living conditions in Panama are exacerbated by inadequate access to essential services such as sanitation, electricity, clean water, healthcare, and education, which severely impact housing quality and overall living standards.",
      "• To stimulate foreign investment in real estate projects and infrastructure development, the Panamanian government has enacted protective legislation aimed at safeguarding the rights of both foreign and domestic investors.",
      "• The real estate market in Panama is affected by corruption, including allegations that drug trafficking profits and money laundering activities are used to finance real estate developments.",
      "• Panama employs a system of publicly recorded titled deeds, similar to those used in the United States and Canada, to establish and verify real estate ownership.",
      "• Additionally, Panama has a distinctive Rights of Possession system that permits individuals to occupy unused government land and improve it, thereby establishing certain usage rights despite the absence of formal title."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:27.070704",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1099,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Taxation",
    "text": "Taxation in Panama, which is governed by the Fiscal Code, is on a territorial\nbasis; this is to say, that taxes apply only to income or gains derived\nthrough business carried on in Panama itself. The existence of a sales or\nadministration office in Panama, or the re-invoicing of external transactions\nat a profit, does not of itself give rise to taxation if the underlying\ntransactions take place outside Panama. Dividends paid out of such earnings\nare free of taxation.\n\nIn February 2005, Panama's unicameral legislature approved a major fiscal\nreform package in order to raise revenues from new business taxes, and\nincreases the country's level of debt. The legislature voted 46 to 28 in\nfavour of the measures, which include a new 1.4% tax on companies’ gross\nrevenues, and a 1% levy on firms operating in the Colón Free Trade Zone – the\nlargest free port in the Americas.",
    "openai_summarised_points": [
      "• Taxation in Panama is governed by the Fiscal Code and operates on a territorial basis, meaning taxes apply only to income or gains derived from business activities conducted within Panama itself.",
      "• The presence of a sales or administration office in Panama, or the re-invoicing of external transactions at a profit, does not automatically trigger taxation if the underlying transactions occur outside Panama.",
      "• Dividends paid out of earnings from activities conducted outside Panama are exempt from taxation.",
      "• In February 2005, Panama's unicameral legislature approved a significant fiscal reform package aimed at increasing government revenues through new business taxes and raising the country’s debt level.",
      "• The legislative vote on the fiscal reform package was 46 in favor and 28 against.",
      "• The fiscal reform measures introduced a new tax of 1.4% on companies’ gross revenues.",
      "• Additionally, a 1% levy was imposed on firms operating within the Colón Free Trade Zone, which is recognized as the largest free port in the Americas."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:29.484671",
      "openai_model": "gpt-4.1-mini",
      "content_length": 876,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Further reforms",
    "text": "President Ricardo Martinelli had promised to implement a flat tax system with\na flat tax of 10% and which promised to raise revenues, put inflation under\ncontrol and which will allow enormous real wage gains.[_citation needed_]\nInstead the Martinelli government increased sales tax to 7% from 5%, as well\nas increasing other taxes, in order to finance many infrastructure projects\naround the country.\n\nThe current VAT rates are: 7% (standard rate); 15% (tobacco); 10% (alcohol and\nhotels); 5% (essential goods). The corporate tax rate is 25%, while the\nhighest marginal income tax rate is 27%.",
    "openai_summarised_points": [
      "• President Ricardo Martinelli initially pledged to introduce a flat tax system with a flat tax rate of 10%, aiming to increase government revenues, control inflation, and enable significant real wage growth.",
      "• Contrary to his initial promise, the Martinelli administration raised the sales tax from 5% to 7% and increased other taxes to fund numerous infrastructure projects throughout Panama.",
      "• The current Value Added Tax (VAT) rates in Panama are differentiated as follows: a standard rate of 7%, a 15% rate applied to tobacco products, a 10% rate for alcohol and hotel services, and a 5% rate for essential goods.",
      "• Panama’s corporate tax rate is set at 25%, while the highest marginal income tax rate applicable is 27%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:29.438632",
      "openai_model": "gpt-4.1-mini",
      "content_length": 593,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "As tax haven",
    "text": "The Republic of Panama is one of the oldest and best-known tax havens in the\nCaribbean, as well as one of the most established in the region. Panama has\nhad a reputation for tax avoidance since the early 20th century, and Panama\nhas been cited repeatedly in recent years as a jurisdiction which does not\ncooperate with international tax transparency initiatives.\n\nPanama's offshore sector is intimately tied to the Panama Canal, which has\nmade it a gateway and _entrepôt_ for international trade. There are strong\nsimilarities between Panama and other leading tax havens like Hong Kong,\nSingapore and Dubai. On paper at least, Panama has the largest shipping fleet\nin the world, greater than those of the US and China combined, according to\nthe Tax Justice Network.",
    "openai_summarised_points": [
      "• The Republic of Panama is recognized as one of the oldest and most well-known tax havens in the Caribbean region, with a long-established presence in this capacity.",
      "• Panama has maintained a reputation for facilitating tax avoidance since the early 20th century, marking it as a significant jurisdiction in global tax avoidance practices.",
      "• In recent years, Panama has been repeatedly cited as a jurisdiction that does not cooperate with international tax transparency initiatives, highlighting ongoing concerns about its regulatory stance.",
      "• Panama’s offshore financial sector is closely linked to the Panama Canal, which serves as a strategic gateway and entrepôt for international trade, reinforcing Panama’s role in global commerce and finance.",
      "• The economic and operational characteristics of Panama’s tax haven status show strong similarities to other prominent tax havens such as Hong Kong, Singapore, and Dubai.",
      "• According to the Tax Justice Network, Panama officially has the largest shipping fleet in the world on paper, surpassing the combined fleets of the United States and China, underscoring its significant maritime and offshore financial presence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:32.203398",
      "openai_model": "gpt-4.1-mini",
      "content_length": 765,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Transportation",
    "text": "In Panama City there are six highways: the Panama-Arraijan Bridge of the\nAmericas, Panama-Arraijan Centennial Bridge, Arraijan-Chorrera, Corredor\nNorte, Corredor Sur, and Autopista Panama-Colon.\n\nPanama's roads, traffic and transportation systems are generally safe, with\nolder traffic lights having undergone a recent overhaul and most have been\nreplaced by traffic lights that are capable of being controlled [and changed]\nremotely, even at busy intersections where they are not needed. Driving during\nthe midday is usually slow and demanding due to dense traffic, frequent\ntraffic jams, and street renovation programs. On roads where poor lighting and\ndriving conditions prevail, night driving is difficult and in many cases,\nrestricted by local authorities, this usually occurs in informal settlements.\nNight driving is particularly hazardous in these areas. Traffic in Panama\nmoves on the right, and Panamanian law requires that drivers and passengers\nwear seat belts.\n\nCurrently, Panama used to have an extensive and efficient, yet confusing to\ntourists, form of public transportation consisting of colorful painted buses\ncolloquially known as __diablo rojo__. A __diablo rojo__ is usually\n\"customized\" or painted with bright colors, usually depicting famous actors,\npoliticians or singers. It is now popular all over the city (and also in\nneighboring towns) for bus drivers to personally customize the interior and\nexterior of their __diablo rojo__. Panama City's streets experience frequent\ntraffic jams due to poor planning.\n\n\"Diablos Rojos\" are not allowed to operate in Panama city since 2010, except\nfor recreational purposes. The Metrobus and the Metro are the only available\npublic transportation methods.",
    "openai_summarised_points": [
      "• Panama City features six major highways: the Panama-Arraijan Bridge of the Americas, Panama-Arraijan Centennial Bridge, Arraijan-Chorrera, Corredor Norte, Corredor Sur, and Autopista Panama-Colon.",
      "• Panama's roads, traffic, and transportation systems are generally considered safe, with older traffic lights recently overhauled and replaced by remotely controllable traffic lights, even at busy intersections where remote control is not strictly necessary.",
      "• Midday driving in Panama City is typically slow and challenging due to dense traffic, frequent traffic jams, and ongoing street renovation programs.",
      "• Night driving is difficult and often restricted by local authorities in areas with poor lighting and hazardous driving conditions, particularly in informal settlements, making night travel especially dangerous in these zones.",
      "• Traffic in Panama moves on the right-hand side of the road, and Panamanian law mandates that both drivers and passengers wear seat belts.",
      "• Historically, Panama had an extensive and efficient public transportation system characterized by colorful painted buses known as __diablo rojo__, which were often customized with bright colors and images of famous actors, politicians, or singers.",
      "• The __diablo rojo__ buses were popular throughout Panama City and neighboring towns, with drivers personally customizing both the interior and exterior of their vehicles.",
      "• Panama City's streets frequently experience traffic jams, attributed to poor urban planning.",
      "• Since 2010, __diablo rojo__ buses have been prohibited from operating in Panama City except for recreational purposes.",
      "• Currently, the only available public transportation methods in Panama City are the Metrobus and the Metro system."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:45:33.675770",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1719,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Panama",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "The following table shows the main economic indicators in 1980–2019 (with IMF\nstaff estimates in 2020–2026). Inflation below 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 7.0  | 3,530.8  | 4.1  | 2,071.0  | 4.5%  | 13.8%  | 8.4%  | n/a\n1981  | 8.4  | 4,120.3  | 4.6  | 2,288.4  | 9.2%  | 7.3%  | 9.2%  | n/a\n1982  | 9.4  | 4,501.2  | 5.1  | 2,469.1  | 5.3%  | 4.3%  | 11.0%  | n/a\n1983  | 9.3  | 4,365.3  | 5.3  | 2,477.1  | -4.5%  | 2.1%  | 11.6%  | n/a\n1984  | 9.9  | 4,540.9  | 5.5  | 2,527.5  | 2.7%  | 1.6%  | 12.2%  | n/a\n1985  | 10.7  | 4,807.3  | 5.8  | 2,614.8  | 4.9%  | 1.0%  | 14.4%  | n/a\n1986  | 11.3  | 4,969.0  | 6.0  | 2,658.3  | 3.6%  | -0.1%  | 12.5%  | n/a\n1987  | 11.4  | 4,893.2  | 6.1  | 2,613.1  | -1.8%  | 1.0%  | 14.1%  | n/a\n1988  | 10.2  | 4,295.8  | 5.3  | 2,211.7  | -13.4%  | 0.4%  | 18.8%  | n/a\n1989  | 10.8  | 4,440.3  | 5.3  | 2,171.7  | 1.6%  | 0.1%  | 18.9%  | n/a\n1990  | 12.1  | 4,878.5  | 5.7  | 2,313.0  | 8.1%  | 0.8%  | 16.7%  | n/a\n1991  | 13.7  | 5,402.2  | 6.3  | 2,489.7  | 9.4%  | 1.5%  | 16.0%  | n/a\n1992  | 15.1  | 5,853.3  | 7.2  | 2,771.0  | 8.2%  | 1.8%  | 14.7%  | n/a\n1993  | 16.3  | 6,188.0  | 7.8  | 2,963.3  | 5.5%  | 0.5%  | 13.3%  | n/a\n1994  | 17.1  | 6,367.1  | 8.3  | 3,095.2  | 2.8%  | 1.3%  | 14.0%  | 81.2%\n1995  | 17.8  | 6,480.3  | 8.5  | 3,099.9  | 1.8%  | 0.9%  | 14.0%  | 79.5%\n1996  | 19.5  | 6,941.6  | 10.0  | 3,580.9  | 7.4%  | 1.3%  | 14.3%  | 67.4%\n1997  | 21.1  | 7,366.9  | 10.8  | 3,791.3  | 6.5%  | 1.3%  | 13.4%  | 62.4%\n1998  | 22.9  | 7,834.9  | 11.8  | 4,027.3  | 7.3%  | 0.6%  | 11.6%  | 60.3%\n1999  | 24.1  | 8,088.6  | 12.3  | 4,136.1  | 3.9%  | 1.3%  | 9.5%  | 57.4%\n2000  | 25.3  | 8,328.9  | 12.5  | 4,111.7  | 2.7%  | 1.4%  | 13.5%  | 55.8%\n2001  | 26.0  | 8,394.2  | 12.7  | 4,095.0  | 0.6%  | 0.3%  | 14.0%  | 60.2%\n2002  | 27.0  | 8,545.6  | 13.2  | 4,172.7  | 2.2%  | 1.0%  | 13.5%  | 59.3%\n2003  | 28.7  | 8,907.5  | 13.9  | 4,312.6  | 4.2%  | 0.1%  | 13.0%  | 58.8%\n2004  | 31.7  | 9,647.3  | 15.3  | 4,638.7  | 7.5%  | 0.5%  | 11.7%  | 61.2%\n2005  | 35.1  | 10,466.2  | 16.6  | 4,965.2  | 7.2%  | 2.9%  | 9.8%  | 61.7%\n2006  | 39.2  | 11,496.5  | 18.4  | 5,401.6  | 8.5%  | 2.5%  | 8.7%  | 56.9%\n2007  | 45.2  | 12,999.8  | 21.3  | 6,127.0  | 12.1%  | 4.2%  | 6.4%  | 49.4%\n2008  | 50.6  | 14,298.8  | 25.2  | 7,110.2  | 9.9%  | 8.8%  | 5.6%  | 41.6%\n2009  | 51.5  | 14,318.3  | 27.1  | 7,532.4  | 1.2%  | 2.4%  | 6.6%  | 41.6%\n2010  | 55.2  | 15,076.0  | 29.4  | 8,039.8  | 5.8%  | 3.5%  | 6.5%  | 40.5%\n2011  | 62.7  | 16,845.1  | 34.7  | 9,314.7  | 11.3%  | 5.9%  | 4.5%  | 37.8%\n2012  | 70.4  | 18,596.3  | 40.4  | 10,674.5  | 9.8%  | 5.7%  | 4.1%  | 36.0%\n2013  | 79.8  | 20,727.2  | 45.6  | 11,841.9  | 6.9%  | 4.0%  | 4.1%  | 35.6%\n2014  | 89.3  | 22,827.4  | 49.9  | 12,757.0  | 5.1%  | 2.6%  | 4.8%  | 36.6%\n2015  | 100.5  | 25,275.2  | 54.1  | 13,606.6  | 5.7%  | 0.1%  | 5.1%  | 36.0%\n2016  | 112.3  | 27,828.8  | 57.9  | 14,344.1  | 5.0%  | 0.7%  | 5.5%  | 35.3%\n2017  | 125.0  | 30,511.0  | 62.2  | 15,178.3  | 5.6%  | 0.9%  | 6.1%  | 35.3%\n2018  | 132.6  | 31,891.9  | 64.9  | 15,612.3  | 3.6%  | 0.8%  | 6.0%  | 37.3%\n2019  | 139.1  | 32,973.2  | 66.8  | 15,831.0  | 3.0%  | -0.4%  | 7.1%  | 42.2%\n2020  | 115.5  | 26,998.8  | 52.9  | 12,373.0  | -17.9%  | -1.6%  | 18.5%  | 66.3%\n2021  | 134.0  | 30,889.2  | 60.1  | 13,861.1  | 12.0%  | 1.4%  | 10.2%  | 62.2%\n2022  | 144.6  | 32,886.6  | 64.4  | 14,643.9  | 5.0%  | 2.0%  | 9.2%  | 61.2%\n2023  | 155.4  | 34,896.8  | 68.9  | 15,481.4  | 5.0%  | 2.0%  | 8.9%  | 60.6%\n2024  | 166.9  | 37,005.5  | 73.8  | 16,372.1  | 5.0%  | 2.0%  | 8.9%  | 59.1%\n2025  | 179.0  | 39,212.6  | 79.1  | 17,319.3  | 5.0%  | 2.0%  | 8.9%  | 57.2%\n2026  | 191.9  | 41,522.5  | 84.7  | 18,326.5  | 5.0%  | 2.0%  | 8.9%  | 55.4%\n\nNominal GDP per capita in Panama was (in balboas or US dollars) 11,691 in\n2002, 13,099 in 2004, 14,004 in 2005 (Prelim), 15,141.9 in 2006 (est), as\nreported by Office of Statistics and Census, Government of Panama. Growth from\n2002 to 2006 was especially strong in the transport and communications sector,\nwhich became the biggest component of GDP, although many sectors also saw\nstrong growth. Real GDP rose 7.5% (2003–04), 6.9% (2004–05), 8.1% (2005–06).\n\nGDP growth in 2008 was 9.2%, reflecting a slowing of the robust growth of\n11.5% seen in 2007. Although growth slowed to 2.4% in the first half of 2009,\ndue to the global economic downturn, it is expected to improve in 2010 and is\nstill one of the most positive growth rates in the region. Growth has been\nfueled by the construction sector, transportation, port and Panama Canal-\nrelated activities, and tourism. As a result of this growth, government\ndeficit as a percentage of GDP dropped to 43% in 2009, and government-issued\ndebt achieved investment grade in February 2010. A recent United Nations\nreport highlighted progress in poverty reduction from 2001 to 2007—overall\npoverty fell from 37% to 29%, and extreme poverty fell from 19% to 12%.\nHowever, Panama still has the second-most unequal income distribution in Latin\nAmerica."
  }
]