[
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Mauritanian exports in 2006\n\nThe **economy of Mauritania** is still largely based on agriculture, mining\nand livestock, even though most of the nomads and many subsistence farmers\nwere forced into the cities by recurring droughts in the 1970s and 1980s.\n\nTrain carrying iron ore.\n\nMauritania has extensive deposits of iron ore, which account for almost 50% of\ntotal exports. The decline in world demand for this ore, however, has led to\ncutbacks in production. With the current rise in metal prices, gold and copper\nmining companies are opening mines in the interior.\n\nThe nation's coastal waters are among the richest fishing areas in the world,\nbut overexploitation by foreigners threatens this key source of revenue. The\ncountry's first deep water port opened near Nouakchott in 1986.\n\nIn recent years, drought and economic mismanagement have resulted in a buildup\nof foreign debt. In March 1999, the government signed an agreement with a\njoint World Bank-International Monetary Fund mission on a $54 million enhanced\nstructural adjustment facility (ESAF). The economic objectives have been set\nfor 1999–2002. Privatization remains one of the key issues.",
    "openai_summarised_points": [
      "• The economy of Mauritania in 2006 remained predominantly based on agriculture, mining, and livestock, despite significant demographic shifts caused by recurring droughts in the 1970s and 1980s that forced many nomads and subsistence farmers to relocate to urban areas.",
      "• Mauritania possesses extensive iron ore deposits, which constituted nearly 50% of the country's total exports; however, a decline in global demand for iron ore led to reductions in production levels.",
      "• Recent increases in metal prices have encouraged the development of gold and copper mining operations, with new mines opening in the interior regions of Mauritania.",
      "• The coastal waters of Mauritania are recognized as some of the richest fishing grounds worldwide, yet overexploitation by foreign entities poses a significant threat to this vital source of national revenue.",
      "• In 1986, Mauritania inaugurated its first deep-water port near the capital city, Nouakchott, enhancing its maritime infrastructure and export capabilities.",
      "• The country faced economic challenges in the late 20th century, including drought and poor economic management, which contributed to a growing foreign debt burden.",
      "• In March 1999, the Mauritanian government entered into an agreement with a joint mission from the World Bank and the International Monetary Fund (IMF) to implement a $54 million Enhanced Structural Adjustment Facility (ESAF).",
      "• The ESAF agreement outlined specific economic objectives for the period 1999 to 2002, focusing on structural reforms and fiscal stabilization.",
      "• Privatization was identified as a critical issue within the economic reform agenda during this period, reflecting the government's commitment to restructuring the economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:31:00.098332",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1157,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trends",
    "text": "This is a chart of trend of gross domestic product of Mauritania at market\nprices estimated by the International Monetary Fund with figures in millions\nof Mauritanian Ouguiyas.\n\nYear | Gross Domestic Product | US Dollar Exchange | Inflation Index (2000=100)\n---|---|---|---\n1980 | 37,211 | 45.93 Ouguiyas | 23\n1985 | 60,197 | 77.07 Ouguiyas | 36\n1990 | 97,819 | 80.64 Ouguiyas | 52\n1995 | 158,443 | 129.76 Ouguiyas | 73\n2000 | 258,245 | 240.00 Ouguiyas | 100\n2005 | 514,642 | 265.55 Ouguiyas | 144\n\nCurrent GDP per capita of Mauritania grew 82% in the Sixties reaching a peak\ngrowth of 166% in the Seventies. But this proved unsustainable, and growth\nconsequently scaled back to 14% in the Eighties. Finally, it shrank by 29% in\nthe Nineties. Mean wages were $0.97 per man-hour in 2009.\n\nThe following table shows the main economic indicators in 1990–2024.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1990  | 5.76  | 2,886  | 1.79  | ...  | ...  | ...\n1995  | 7.46  | 3,253  | 2.09  | 9.8%  | 6.5%  | ...\n2000  | 8.42  | 3,187  | 1.78  | −3.9%  | 3.3%  | 55.5%\n2005  | 11.55  | 3,790  | 2.94  | 8.6%  | 12.1%  | 71.1%\n2006  | 14.09  | 4,770  | 4.01  | 18.3%  | 6.2%  | 38.0%\n2007  | 14.18  | 4,672  | 4.33  | −2.0%  | 7.3%  | 61.5%\n2008  | 14.41  | 4,619  | 5.14  | −0.3%  | 7.5%  | 57.2%\n2009  | 14.51  | 4,532  | 4.73  | 0.1%  | 2.1%  | 54.3%\n2010  | 15.07  | 4,589  | 5.64  | 2.6%  | 6.3%  | 43.9%\n2011  | 16.03  | 4,756  | 6.78  | 4.2%  | 5.7%  | 38.8%\n2012  | 17.06  | 4,938  | 6.72  | 4.5%  | 4.9%  | 39.3%\n2013  | 18.07  | 5,107  | 7.33  | 4.2%  | 4.1%  | 40.7%\n2014  | 19.17  | 5,292  | 6.62  | 4.3%  | 3.8%  | 49.5%\n2015  | 20.38  | 5,500  | 6.18  | 5.4%  | 0.5%  | 59.9%\n2016  | 20.84  | 5,493  | 6.41  | 1.3%  | 1.5%  | 57.6%\n2017  | 22.54  | 5,807  | 6.83  | 6.3%  | 2.3%  | 55.7%\n2018  | 23.55  | 5,932  | 7.47  | 4.8%  | 3.1%  | 59.2%\n2019  | 25.06  | 6,176  | 7.89  | 3.1%  | 2.3%  | 57.7%\n2020  | 26.41  | 6,367  | 8.46  | −0.4%  | 2.4%  | 56.5%\n2021  | 27.64  | 6,518  | 9.13  | 0.7%  | 3.6%  | 54.5%\n2022  | 31.62  | 7,295  | 9.56  | 6.8%  | 9.6%  | 50.5%\n2023  | 34.89  | 7,875  | 10.65  | 6.5%  | 4.9%  | 48.2%\n2024  | 37.29  | 8,233  | 10.76  | 4.4%  | 2.7%  | 44.2%"
  },
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Diversification",
    "text": "In 2007, mining industries accounted for well over 35 percent of the\nMauritanian economy, with the fish industry so much as 54% (with big changes\nbetween these industries in the power relationship). Diversification of the\neconomy into non-mining industries remains a long-term issue. Mauritania is a\nnet importer of food, reportedly importing 70% of its domestic food needs."
  },
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Natural Gas and the Tortue/Ahmeyim Project",
    "text": "In 2015, Kosmos Energy made significant natural gas discoveries on the\nmaritime border between Senegal and Mauritania, and in December 2016, it\nentered into partnership with British Petroleum. The two companies, along with\nMauritanian and Senegalese governments and the two countries' national oil\ncompanies, are optimistic about the potential of these gas discoveries. The\nGrand Tortue/Ahmeyim reserves are estimated at 15 trillion cubic feet.\nAccording to BP, 'that's equivalent to all of Africa's current gas production\nfor nearly seven years.' The production phase will begin in 2022, starting\nwith 2.3 million tons annually."
  },
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Dispute with Woodside Petroleum",
    "text": "In February 2006, the new Mauritanian government denounced amendments to an\noil contract made by former Leader Ould Taya with Woodside Petroleum, an\nAustralian company. In 2004, Woodside had agreed to invest US$600 million in\ndeveloping Mauritania's Chinguetti offshore oil project. The controversial\namendments, which Mauritanian authorities declared had been signed \"outside\nthe legal framework of normal practice, to the great detriment of our\ncountry\", could cost Mauritania up to $200 million a year, according to BBC\nNews. Signed by Woodside two weeks after the February 1, 2005, legislation\nauthorizing the four amendments, they provided for a lower state quota in the\n_profit-oil_ , and reduced taxes by 15 percent in certain zones. They also\neased environmental constraints and extended the length and scope of the\nexploitation and exploration monopoly, among other measures.\n\nThe disputed amendments were signed by former Oil Minister Zeidane Ould Hmeida\nin February 2004 and March 2005. Hmeida was arrested in January 2006 on\ncharges of \"serious crimes against the country's essential economic\ninterests\".\n\nNouakchott's authorities declared that the government would likely seek\ninternational arbitration, which Woodside (which operated for Hardman, BG\nGroup, Premier Oil, ROC Oil, Fusion, Petronas, Dana Petroleum, Energy Africa\nand the Hydrocarbons Mauritanian Society) also contemplated.\n\nDiscovered in 2001, Chinguetti has proven reserves of about 120,000,000\nbarrels (19,000,000 m3) of oil. At the end of December 2005, authorities\nestimated that in 2006, the oil profits would be 47 billion _ouguiyas_ (about\nUS$180 million) and represent a quarter of the state budget, according to\n_RFI_.\n\nSome U.S. oil companies are alleged to be playing a part in Mauritania's oil\nrelated corruption."
  },
  {
    "chapter_name": "Economy of Mauritania",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Electricity",
    "text": "Mauritania has 380 MW of generating capacity, of which 263 MW are fossil fuels\nand 117 MW are renewable. Its sunny weather makes solar power highly\nfavorable, and eight plants totaling 16.6 MW were installed with the support\nof Masdar in 2016."
  }
]