[
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Israel** is a highly developed free-market economy. The\nprosperity of Israel's advanced economy allows the country to have a\nsophisticated welfare state, a powerful modern military said to possess a\nnuclear-weapons capability with a full nuclear triad, modern infrastructure\nequivalent to developed countries, and a high-technology sector competitively\non par with Silicon Valley. It has the second-largest number of startup\ncompanies in the world after the United States,[_needs update_] and the third-\nlargest number of NASDAQ-listed companies after the U.S. and China. American\ncompanies, such as Intel, Microsoft, and Apple, built their first overseas\nresearch and development facilities in Israel. More than 400 high-tech multi-\nnational corporations, such as IBM, Google, Hewlett-Packard, Cisco Systems,\nFacebook and Motorola have opened R&D centers throughout the country. As of\n2025, the IMF estimated Israel has the 25th largest economy in the world by\nnominal GDP, and one of the biggest economies in the Middle East.[1]\n\nThe country's major economic sectors are high-technology and industrial\nmanufacturing. The Israeli diamond industry is one of the world's centers for\ndiamond cutting and polishing, amounting to 21% of all exports in 2017. As the\ncountry is relatively poor in natural resources, it consequently depends on\nimports of petroleum, raw materials, wheat, motor vehicles, uncut diamonds and\nproduction inputs. Nonetheless, the country's nearly total reliance on energy\nimports may change in the future as recent discoveries of natural gas reserves\noff its coast and the Israeli solar energy industry have taken a leading role\nin Israel's energy sector.\n\nIsrael's quality higher education and the establishment of a highly motivated\nand educated populace is largely responsible for ushering in the country's\nhigh technology boom and rapid economic development by regional standards. The\ncountry has developed a strong educational infrastructure and a high-quality\nbusiness startup incubation system for promoting cutting edge new ideas to\ncreate value-driven goods and services. These developments have allowed the\ncountry to create a high concentration of high-tech companies across the\ncountry's regions. These companies are financially backed by a strong venture\ncapital industry. Its central high technology hub, the \"Silicon Wadi\", is\nconsidered second in importance only to its Californian counterpart. Numerous\nIsraeli companies have been acquired by global multinational corporations for\ntheir profit-driven technologies in addition to their reliable and quality\ncorporate personnel.\n\nIn its early decades, the Israeli economy was largely state-controlled and\nshaped by social democratic ideas. In the 1970s and 1980s, the economy\nunderwent a series of free-market reforms and was gradually liberalized. In\nthe past three decades, the economy has grown considerably, though GDP per\ncapita has increased faster than wages. Israel is the most developed and\nadvanced country in West Asia, possessing the 17th largest foreign-exchange\nreserves in the world and the highest average wealth per adult in the Middle\nEast (10th worldwide by financial assets per capita). Israel is the 9th\nlargest arm exporter in the world and has the highest number of billionaires\nin the Middle East, ranked 18th in the world. In recent years, Israel has had\namong the highest GDP growth rates within the developed world along with\nIreland. _The Economist_ ranked Israel as the 4th most successful economy\namong developed countries for 2022. The IMF estimated Israel's GDP at US$564\nbillion and its GDP per capita at US$58,270 in 2023 (13th highest in the\nworld), a figure comparable to other highly developed countries. Israel was\ninvited to join the OECD in 2010. Israel has also signed free trade agreements\nwith the European Union, the United States, the European Free Trade\nAssociation, Turkey, Mexico, Canada, Ukraine, Jordan, and Egypt. In 2007,\nIsrael became the first non-Latin-American country to sign a free trade\nagreement with the Mercosur trade bloc.",
    "openai_summarised_points": [
      "• The economy of Israel is characterized as a highly developed free-market economy, demonstrating advanced economic infrastructure and capabilities.",
      "• Israel's prosperity enables it to maintain a sophisticated welfare state, supporting social services and economic stability.",
      "• The country possesses a powerful modern military, which is believed to have a nuclear-weapons capability with a full nuclear triad (land, sea, and air-based nuclear forces).",
      "• Israel's infrastructure is modern and comparable to that of developed nations, facilitating efficient economic activities.",
      "• The high-technology sector in Israel is highly competitive, comparable to Silicon Valley in the United States.",
      "• Israel has the second-largest number of startup companies globally, after the United States, though this ranking requires an update.",
      "• It ranks third in the world for the number of NASDAQ-listed companies, following the United States and China.",
      "• Major American technology companies such as Intel, Microsoft, and Apple established their first overseas R&D facilities in Israel.",
      "• Over 400 multinational corporations, including IBM, Google, Hewlett-Packard, Cisco Systems, Facebook, and Motorola, have established R&D centers across Israel.",
      "• As of 2025, the International Monetary Fund (IMF) estimated Israel's nominal GDP ranks 25th globally, making it one of the largest economies in the Middle East.",
      "• The primary economic sectors in Israel are high-technology and industrial manufacturing.",
      "• The Israeli diamond industry is a global hub for diamond cutting and polishing, accounting for 21% of all exports in 2017.",
      "• Due to limited natural resources, Israel relies heavily on imports of petroleum, raw materials, wheat, motor vehicles, uncut diamonds, and production inputs.",
      "• The country's energy dependence on imports is expected to decrease due to recent natural gas discoveries off its coast and the growth of its solar energy industry.",
      "• Israel's high-quality higher education system and a highly motivated, educated population have been crucial in driving the country's high-tech boom and rapid economic development.",
      "• The country has developed a robust educational infrastructure and a high-quality startup incubation system to promote innovative ideas and value-added goods and services.",
      "• This infrastructure has fostered a high concentration of high-tech companies across various regions, supported by a strong venture capital industry.",
      "• The \"Silicon Wadi,\" Israel's central high-tech hub, is considered second in importance only to California's Silicon Valley.",
      "• Many Israeli companies have been acquired by global multinationals for their innovative technologies and reliable, skilled personnel.",
      "• In its early decades, Israel's economy was largely state-controlled and influenced by social democratic ideas.",
      "• During the 1970s and 1980s, Israel implemented a series of free-market reforms and gradually liberalized its economy.",
      "• Over the past three decades, Israel's economy has experienced significant growth, with GDP per capita increasing faster than wages.",
      "• Israel is the most developed and advanced country in West Asia, holding the 17th largest foreign-exchange reserves in the world.",
      "• It has the highest average wealth per adult in the Middle East, ranking 10th worldwide in financial assets per capita.",
      "• Israel is the 9th largest arms exporter globally and has the highest number of billionaires in the Middle East, ranking 18th worldwide.",
      "• In recent years, Israel has achieved among the highest GDP growth rates within the developed world, comparable to Ireland.",
      "• The Economist ranked Israel as the 4th most successful economy among developed countries in 2022.",
      "• The IMF estimated Israel's GDP at US$564 billion and GDP per capita at US$58,270 in 2023, ranking 13th worldwide in per capita income.",
      "• Israel's economic indicators are comparable to other highly developed nations.",
      "• Israel was invited to join the Organisation for Economic Co-operation and Development (OECD) in 2010.",
      "• The country has signed free trade agreements with the European Union, the United States, the European Free Trade Association, Turkey, Mexico, Canada, Ukraine, Jordan, and Egypt.",
      "• In 2007, Israel became the first non-Latin American country to sign a free trade agreement with the Mercosur trade bloc."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:55:56.432508",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4089,
      "bullet_points_count": 32
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Change in per capita GDP of Israel since 1950. Figures are inflation-adjusted\nto 2011 International dollars.\n\nThe British Mandate for Palestine that came into effect in 1920 aimed at\nrestricting land purchases by Jewish immigrants. For this reason, the Jewish\npopulation was initially more urban and had a higher share in industrial\noccupations. This particular development resulted economically in one of the\nfew growth miracles of the region whereby the structure of firms was\ndetermined mainly by private businessmen rather than by the government. The\nfirst survey of the Dead Sea in 1911, by the Russian Jewish businessman and\nengineer Moshe Novomeysky, led to the establishment of Palestine Potash Ltd.\nin 1930, later renamed the Dead Sea Works. In 1923, the businessman and\nhydraulic engineer Pinhas Rutenberg was granted an exclusive concession for\nthe production and distribution of electric power. He founded the Palestine\nElectric Company, later the Israel Electric Corporation. Between 1920 and\n1924, some of the country's largest factories were established, including the\nShemen Oil Company, the Societe des Grand Moulins, the Palestine Silicate\nCompany and the Palestine Salt Company.\n\nIn 1937, there were 86 spinning and weaving factories in the country,\nemploying a workforce of 1,500. Capital and technical expertise were supplied\nby Jewish professionals from Europe. The Ata textile plant in Kiryat Ata,\nwhich went on to become an icon of the Israeli textile industry, was\nestablished in 1934. In 1939, the cornerstone was laid for one of the kibbutz\nindustry's first factories: the Naaman brick factory, which supplied the\ngrowing need for construction materials.\n\nThe textile underwent rapid development during World War II, when supplies\nfrom Europe were cut off while local manufacturers were commissioned for army\nneeds. By 1943, the number of factories had grown to 250, with a workforce of\n5,630, and output increased tenfold.\n\nFrom 1924, trade fairs were held in Tel Aviv. The Levant Fair was inaugurated\nin 1932.",
    "openai_summarised_points": [
      "• The section discusses the change in per capita GDP of Israel since 1950, noting that figures are inflation-adjusted to 2011 International dollars, indicating a long-term economic analysis.",
      "• The British Mandate for Palestine, effective from 1920, aimed to restrict land purchases by Jewish immigrants, influencing the demographic and economic structure of the Jewish population.",
      "• Due to these restrictions, the Jewish population was initially more urbanized and had a higher proportion engaged in industrial occupations, fostering a unique economic development.",
      "• This development led to one of the region’s few economic growth miracles, characterized by a firm structure primarily driven by private businessmen rather than government intervention.",
      "• In 1911, Russian Jewish businessman and engineer Moshe Novomeysky conducted the first survey of the Dead Sea, which resulted in the establishment of Palestine Potash Ltd. in 1930, later renamed the Dead Sea Works, marking early industrial activity.",
      "• In 1923, businessman and hydraulic engineer Pinhas Rutenberg was granted an exclusive concession for the production and distribution of electric power, founding the Palestine Electric Company, which later became the Israel Electric Corporation.",
      "• Between 1920 and 1924, Israel saw the establishment of some of its largest factories, including the Shemen Oil Company, Societe des Grand Moulins, Palestine Silicate Company, and Palestine Salt Company, indicating industrial growth.",
      "• By 1937, Israel had 86 spinning and weaving factories employing approximately 1,500 workers, with capital and technical expertise supplied predominantly by Jewish professionals from Europe.",
      "• The Ata textile plant in Kiryat Ata, established in 1934, became an iconic symbol of the Israeli textile industry.",
      "• In 1939, the cornerstone was laid for the Naaman brick factory, one of the first kibbutz industries, which supplied construction materials during a period of rapid growth.",
      "• During World War II, the textile industry experienced rapid development due to the interruption of European supplies, leading to increased local manufacturing for military needs.",
      "• By 1943, the number of textile factories had increased to 250, employing 5,630 workers, with output increasing tenfold, demonstrating significant industrial expansion during wartime.",
      "• Starting from 1924, trade fairs were held in Tel Aviv, serving as platforms for economic exchange and showcasing industrial progress.",
      "• The Levant Fair was inaugurated in 1932, further promoting trade and economic development within the region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:00.554636",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2038,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "After independence",
    "text": "After statehood, Israel faced a deep economic crisis. As well as having to\nrecover from the devastating effects of the 1948 Arab–Israeli War, it also had\nto absorb hundreds of thousands of Jewish refugees from Europe and almost a\nmillion from the Arab world. Israel was financially overwhelmed and faced a\ndeep economic crisis, which led to a policy of austerity from 1949 to 1959.\nUnemployment was high, and foreign currency reserves were scarce.\n\nIn 1952, Israel and West Germany signed an agreement stipulating that West\nGermany was to pay Israel to compensate for Jewish property stolen by the\nNazis, material claims during the Holocaust, and absorption of refugees as a\nresult. Over the next 14 years, West Germany paid Israel 3 billion marks\n(around US$714 million according to 1953–1955 conversion rates or equivalent\nto approximately US$7 billion in modern currency). The reparations became a\ndecisive part of Israel's income, comprising as high as 87.5% of Israel's\nincome in 1956. Israel never had any formal diplomatic relations with East\nGermany. In 1950, the Israeli government launched Israel Bonds for American\nand Canadian Jews to buy. In 1951, the final results of the bonds program\nexceeded $52 million. Additionally, many American Jews made private donations\nto Israel, which in 1956 were thought to amount to $100 million a year. In\n1957, bond sales amounted to 35% of Israel's special development budget. Later\nin the century, Israel became significantly reliant on economic aid from the\nUnited States, a country that also became Israel's most important source of\npolitical support internationally.\n\nThe proceeds from these sources were invested in industrial and agricultural\ndevelopment projects, which allowed Israel to become economically self-\nsufficient. Among the projects made possible by the aid was the Hadera power\nplant, the Dead Sea Works, the National Water Carrier, port development in\nHaifa, Ashdod, and Eilat, desalination plants, and national infrastructure\nprojects.\n\nAfter statehood, priority was given to establishing industries in areas slated\nfor development, among them, Lachish, Ashkelon, the Negev and Galilee. The\nexpansion of Israel's textile industry was a consequence of the development of\ncotton growing as a profitable agricultural branch. By the late 1960s,\ntextiles were one of the largest industrial branches in Israel, second only to\nthe foodstuff industry. Textiles constituted about 12% of industrial exports,\nbecoming the second-largest export branch after polished diamonds. In the\n1990s, cheap East Asian labor decreased the profitability of the sector. Much\nof the work was subcontracted to 400 Israeli Arab sewing shops. As these\nclosed down, Israeli firms, among them Delta, Polgat, Argeman and Kitan, began\ndoing their sewing work in Jordan and Egypt, usually under the QIZ\narrangement. In the early 2000s, Israeli companies had 30 plants in Jordan.\nIsraeli exports reached $370 million a year, supplying such retailers and\ndesigners as Marks & Spencer, The Gap, Victoria's Secret, Walmart, Sears,\nRalph Lauren, Calvin Klein, and Donna Karan.\n\nIn its first two decades of existence, Israel's strong commitment to\ndevelopment led to economic growth rates that exceeded 10% annually. Between\n1950 and 1963, the expenditure among wage-earner's families rose 97% in real\nterms. Between 1955 and 1966, per capita consumption rose by 221%. In the\n1970s, investment began to shift from agriculture and basic infrastructure to\nindustry and defense programs. These latter investments would later become the\nfoundation of Israel's technology sector. The years after the 1973 Yom Kippur\nWar were a lost decade economically, as growth stalled, inflation soared and\ngovernment expenditures rose significantly. Also worthy of mention is the 1983\nBank stock crisis. By 1984, the economic situation became almost catastrophic\nwith inflation reaching an annual rate close to 450% and projected to reach\nover 1000% by the end of the following year. However, the successful economic\nstabilization plan implemented in 1985 and the subsequent introduction of\nmarket-oriented structural reforms reinvigorated the economy and paved the way\nfor its rapid growth in the 1990s and became a model for other countries\nfacing similar economic crises.\n\nIsraeli new shekel banknotes and coins\n\nTwo developments have helped to transform Israel's economy since the beginning\nof the 1990s. The first is waves of Jewish immigration, predominantly from the\ncountries of the former USSR, that has brought over one million new citizens\nto Israel. These new Soviet Jewish immigrants, many of them highly educated,\nhad a wellspring of scientific and technical expertise to help spur Israel's\nburgeoning technology sector, now constitute some 15% of Israel's population.\nThe second development benefiting the Israeli economy is the peace process\nthat begun at the Madrid conference of October 1991, which led to the signing\nof accords and later to a peace treaty between Israel and Jordan (1994).\n\nIsraeli New Shekel, new banknotes since 2018\n\nDuring the early 2000s, the Israeli economy went into a downturn due to the\ncrashing of the global dot-com bubble which bankrupted many startups\nestablished during the height of the bubble. The Second Intifada, which cost\nIsrael billions of dollars in security costs, and a decline in investment and\ntourism, sent unemployment in Israel to the double digits; growth in one\nquarter of 2000 was 10%. In 2002, the Israeli economy declined about 4% in one\nquarter. Afterward, Israel managed to create a remarkable recovery by opening\nup new markets to Israeli exporters farther afield, such as in the rapidly\ngrowing countries of East Asia. This was possible thanks to a rebound in the\nIsraeli tech sector, spurred on by the gradual bottoming out of the dotcom\ncrash and a growing increase in demand for computer software, which in turn\nwas due to burgeoning rates of global internet usage at this time. The\nexplosion in demand for security and defense products following 9/11 also\nallowed Israel to sell even more of its technologies abroad – a situation only\nmade possible due to Israel's prior investments in the technology sector in an\neffort to curb high levels of domestic unemployment.\n\nIn the 2000s, there was an influx of foreign investment in Israel from\ncompanies that formerly shunned the Israeli market. In 2006, foreign\ninvestment in Israel totalled $13 billion, according to the Manufacturers\nAssociation of Israel. The _Financial Times_ said that \"bombs drop, yet\nIsrael's economy grows\". Moreover, while Israel's total gross external debt is\nUS$95 billion, or approximately 41.6% of GDP, since 2001 it has become a net\nlender nation in terms of net external debt (the total value of assets vs.\nliabilities in debt instruments owed abroad), which as of June 2012[update]\nstood at a significant surplus of US$60 billion. The country also maintains a\ncurrent account surplus in an amount equivalent to about 3% of its gross\ndomestic product in 2010. In 2023, Israel's account surplus was 25.3 billion\nU.S. dollars.\n\nBank of Israel\n\nThe Israeli economy weathered and withstood the late-2000s recession,\nregistering positive GDP growth in 2009 and ending the decade with an\nunemployment rate lower than that of many of its Western counterparts. There\nare several reasons behind this economic resilience, for example, the fact\nthat the country is a net lender rather than a borrower nation and the\ngovernment and the Bank of Israel's generally conservative macro-economic\npolicies. Two policies, in particular, can be cited, one is the refusal of the\ngovernment to succumb to pressure by the banks to appropriate large sums of\npublic money to aid them early in the crisis, thus limiting their risky\nbehavior. The second is the implementation of the recommendations of the\nBach'ar commission in the early to mid-2000s which recommended decoupling the\nbanks' depository- and Investment banking activities, contrary to the then-\nopposite trend, particularly in the United States, of easing such restrictions\nwhich had the effect of encouraging more risk-taking in the financial systems\nof those countries. American investors today make up the most significant\nportion of investors in Israel.",
    "openai_summarised_points": [
      "• After Israel declared independence in 1948, the country faced a severe economic crisis characterized by the need to recover from the devastation of the 1948 Arab–Israeli War and to absorb hundreds of thousands of Jewish refugees from Europe and nearly one million from Arab countries.",
      "• The economic crisis led Israel to adopt a policy of austerity from 1949 to 1959, during which unemployment was high and foreign currency reserves were scarce.",
      "• In 1952, Israel signed an agreement with West Germany, stipulating that West Germany would pay Israel compensation for Jewish property stolen by the Nazis, Holocaust-related material claims, and refugee absorption costs.",
      "• Over the subsequent 14 years, West Germany paid Israel a total of 3 billion marks, approximately US$714 million based on 1953–1955 conversion rates, or roughly US$7 billion in modern currency equivalents.",
      "• The reparations from West Germany became a crucial part of Israel’s income, reaching as high as 87.5% of total income in 1956.",
      "• Israel never established formal diplomatic relations with East Germany.",
      "• In 1950, Israel launched Israel Bonds targeted at American and Canadian Jews to raise funds; by 1951, the bonds had raised over US$52 million.",
      "• Many American Jews also made private donations to Israel, which in 1956 were estimated to total US$100 million annually.",
      "• In 1957, bond sales contributed to 35% of Israel’s special development budget.",
      "• Later in the 20th century, Israel became heavily reliant on economic aid from the United States, which also became its most important source of international political support.",
      "• The funds from reparations, bonds, and private donations were invested in industrial and agricultural projects, enabling Israel to achieve economic self-sufficiency.",
      "• Major projects financed included the Hadera power plant, Dead Sea Works, the National Water Carrier, port developments in Haifa, Ashdod, and Eilat, desalination plants, and national infrastructure.",
      "• Post-independence, Israel prioritized establishing industries in development zones such as Lachish, Ashkelon, the Negev, and Galilee.",
      "• The expansion of the textile industry was driven by profitable cotton cultivation; by the late 1960s, textiles became Israel’s second-largest industrial sector after foodstuffs, accounting for about 12% of industrial exports.",
      "• The textile sector's profitability declined in the 1990s due to competition from low-cost East Asian labor, leading to subcontracting work to Israeli Arab sewing shops and later to Jordan and Egypt under the QIZ arrangement.",
      "• In the early 2000s, Israeli companies operated 30 plants in Jordan, with exports reaching US$370 million annually, supplying retailers such as Marks & Spencer, The Gap, Victoria’s Secret, Walmart, Sears, Ralph Lauren, Calvin Klein, and Donna Karan.",
      "• During its first two decades, Israel experienced rapid economic growth exceeding 10% annually, with wage-earner family expenditures rising 97% in real terms from 1950 to 1963 and per capita consumption increasing by 221% from 1955 to 1966.",
      "• Investment shifts in the 1970s moved from agriculture and infrastructure to industry and defense, laying the groundwork for Israel’s technology sector.",
      "• The 1973 Yom Kippur War marked a period of economic stagnation, with stalled growth, soaring inflation, and increased government spending.",
      "• The 1983 Bank stock crisis was a significant financial event, and by 1984, inflation reached nearly 450% annually, projected to surpass 1000% in 1985.",
      "• The economic stabilization plan implemented in 1985, along with market-oriented structural reforms, revitalized the economy, leading to rapid growth in the 1990s and serving as a model for other nations.",
      "• Since the early 1990s, two key developments transformed Israel’s economy: waves of Jewish immigration from the former USSR, bringing over one million highly educated immigrants, now constituting about 15% of the population, and the peace process initiated at the Madrid conference of October 1991, culminating in the 1994 peace treaty with Jordan.",
      "• The influx of Soviet Jewish immigrants contributed significant scientific and technical expertise, bolstering Israel’s burgeoning technology sector.",
      "• In the early 2000s, Israel’s economy declined due to the collapse of the dot-com bubble, the Second Intifada, which increased security costs and reduced investment and tourism, causing unemployment to reach double digits; in one quarter of 2000, growth was 10%, and in 2002, the economy shrank by about 4% in one quarter.",
      "• Israel recovered by expanding exports to new markets, especially in East Asia, driven by a rebound in the tech sector and increased global demand for computer software and security products post-9/11.",
      "• The demand for Israeli security and defense technologies surged after 9/11, facilitating increased exports due to prior investments in the tech sector aimed at reducing domestic unemployment.",
      "• In 2006, foreign investment in Israel totaled US$13 billion, according to the Manufacturers Association of Israel, reflecting increased international confidence despite regional instability.",
      "• Israel’s total gross external debt is approximately US$95 billion, representing about 41.6% of GDP, but since 2001, Israel has been a net lender nation, with a net external debt surplus of US$60 billion as of June 2012.",
      "• Israel maintained a current account surplus of about 3% of GDP in 2010, and in 2023, the account surplus reached US$25.3 billion.",
      "• The Israeli economy demonstrated resilience during the late-2000s recession, maintaining positive GDP growth in 2009 and ending the decade with a lower unemployment rate than many Western countries.",
      "• Israel’s economic resilience is attributed to its status as a net lender, conservative macroeconomic policies by the government and the Bank of Israel, and strategic financial regulations.",
      "• Notably, the government resisted pressure from banks to allocate large sums of public money to bail them out early in the crisis, limiting risky banking behavior.",
      "• The implementation of recommendations from the Bach’ar commission in the early to mid-2000s, which advocated for separating banks’ depository and investment activities, helped reduce systemic risk; this contrasted with the U.S. trend of easing such restrictions, which increased risk-taking in American financial systems.",
      "• American investors constitute the most significant foreign investor group in Israel today."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:15.784571",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 8264,
      "bullet_points_count": 34
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "OECD membership",
    "text": "In May 2007, Israel was invited to open accession discussions with the OECD.\nIn May 2010, the OECD voted unanimously to invite Israel to join, despite\nPalestinian objections. It became a full member on 7 September 2010. The OECD\npraised Israel's scientific and technological progress and described it as\nhaving \"produced outstanding outcomes on a world scale.\"",
    "openai_summarised_points": [
      "• In May 2007, Israel was invited to initiate accession discussions with the Organisation for Economic Co-operation and Development (OECD).",
      "• In May 2010, the OECD conducted a vote and unanimously decided to invite Israel to become a member, despite objections from Palestinian representatives.",
      "• Israel officially became a full member of the OECD on 7 September 2010.",
      "• The OECD praised Israel for its scientific and technological progress, highlighting its significant achievements.",
      "• The OECD described Israel as having \"produced outstanding outcomes on a world scale\" in terms of scientific and technological advancements."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:18.227005",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 360,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Challenges",
    "text": "Despite economic prosperity, the Israeli economy faces many challenges, some\nshort-term and some long-term. In the short term, its inability to duplicate\nits success in the telecommunication industry in other growing industries\nhampers its economic outlook. Its inability to foster large multinational\ncompanies in the last decade also calls into question its ability to employ\nmany people in advanced industries. On the long term, Israel is facing\nchallenges of high dependency on the growing number of Ultra-Orthodox Jews,\nwho have a low level of official labor force participation among men. This\nsituation could lead to a materially lower employment-to-population ratio and\na higher dependency ratio in the future. The governor of the Bank of Israel,\nStanley Fischer, stated that the growing poverty amongst the Ultra-Orthodox is\nhurting the Israeli economy. According to the data published by Ian Fursman,\n60% of the poor households in Israel are of the Haredi Jews and the Israeli\nArabs. Together, these two groups represent 25–28% of the Israeli population.\nOrganizations such as The Kemach Foundation, Gvahim, Jerusalem Village, and\nThe Jerusalem Business Networking Forum are addressing these challenges with\njob placement services and networking events.",
    "openai_summarised_points": [
      "• Despite experiencing economic prosperity, the Israeli economy faces numerous challenges that are categorized into short-term and long-term issues.",
      "• In the short term, Israel's inability to replicate its success in the telecommunications industry across other emerging sectors limits its overall economic growth prospects.",
      "• The country has struggled to develop large multinational corporations over the past decade, raising concerns about its capacity to generate employment in advanced industries.",
      "• Long-term challenges include a high dependency on the increasing population of Ultra-Orthodox Jews, who exhibit low levels of official labor force participation among men.",
      "• This demographic trend could result in a significantly lower employment-to-population ratio and an increased dependency ratio in the future, impacting economic sustainability.",
      "• Stanley Fischer, the governor of the Bank of Israel, has stated that rising poverty levels among the Ultra-Orthodox community are detrimental to the Israeli economy.",
      "• Data published by Ian Fursman indicates that 60% of poor households in Israel belong to the Haredi Jewish community and Israeli Arabs.",
      "• The Haredi Jews and Israeli Arabs together constitute approximately 25–28% of the total Israeli population.",
      "• Several organizations, including The Kemach Foundation, Gvahim, Jerusalem Village, and The Jerusalem Business Networking Forum, are actively addressing these economic challenges through initiatives such as job placement services and networking events."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:23.264191",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1263,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "2023 Israel–Gaza war",
    "text": "After the Gaza war, the Israeli stock markets and currency nosedived. It is\nestimated that Israel will lose around $400 billion in the next decade and\nexperience a significant economic shock. Ninety percent of this will result\nfrom indirect consequences such as reduced investment, labor market\ndisruptions, and hindered productivity growth. On August 2024, Fitch Ratings\ndowngraded Israel's credit rating. The Bank of Israel has counted war-related\ncosts from 2023 to 2025 at up to $55.6 billion. Another consequence of the war\nwas that consumer spending dropped by 27%, imports fell by 42%, and exports\ndeclined by 18%.",
    "openai_summarised_points": [
      "• Following the Gaza war, Israeli stock markets and the national currency experienced a sharp decline, indicating significant economic instability.",
      "• It is estimated that Israel will incur approximately $400 billion in economic losses over the next decade as a consequence of the conflict.",
      "• The projected economic shock is expected to be substantial, with 90% of the total loss attributed to indirect effects such as reduced investment, disruptions in the labor market, and hindered productivity growth.",
      "• In August 2024, Fitch Ratings downgraded Israel's credit rating, reflecting increased financial risk and economic uncertainty resulting from the conflict.",
      "• The Bank of Israel has estimated that war-related costs from 2023 to 2025 could reach up to $55.6 billion, encompassing military expenses, reconstruction, and other war-associated expenditures.",
      "• The conflict led to a 27% decrease in consumer spending, indicating a significant decline in domestic economic activity.",
      "• Imports into Israel fell by 42%, demonstrating a substantial reduction in international trade and supply chain disruptions.",
      "• Exports declined by 18%, further impacting Israel’s trade balance and overall economic performance during the post-war period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:25.615661",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 621,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Wealth Migrate",
    "text": "The 2024 Henley & Partners Report, indicates that around 1,700 millionaires\nhave departed the country since 2023, seeking investment migration\nopportunities to mitigate risks and explore alternative residency options. The\nreport announced a remarkable 232% increase in investment migration\napplications from Israeli citizens in 2023. Factors driving this trend include\na 5% depreciation in the shekel's value against the US dollar, a 10% decline\nin real estate prices in Tel Aviv, Israel's growing international isolation,\nand the financial pressure resulting from the war in 2023.",
    "openai_summarised_points": [
      "• The 2024 Henley & Partners Report states that approximately 1,700 millionaires have left Israel since 2023 in search of investment migration opportunities.",
      "• The migration of these high-net-worth individuals is motivated by the desire to mitigate risks and explore alternative residency options.",
      "• The report highlights a significant 232% increase in investment migration applications from Israeli citizens in 2023 compared to previous years.",
      "• Contributing factors to this surge include a 5% depreciation of the Israeli shekel against the US dollar.",
      "• There was also a 10% decline in real estate prices in Tel Aviv, Israel’s major economic hub.",
      "• Additional drivers of this trend are Israel’s increasing international isolation and the financial pressures stemming from the war in 2023."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:27.461333",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 581,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Red Sea crisis",
    "text": "The Red Sea crisis caused by the Houthi attacks has severely affected the\nIsraeli economy, disrupting shipping routes, increasing costs, and causing job\nlosses. The port of Eilat, Israel's southern gateway, has suffered almost shut\ndown and bankruptcy, leading to requests for government support. Half of the\nport's workers were at risk of losing their jobs. Many ships are avoiding the\nRed Sea and rerouting around Africa, which makes the journey three weeks\nlonger and more expensive. Insurance costs for ships in the Red Sea surged,\nwith some Israeli ships seeing a 250% increase or being denied coverage\naltogether.",
    "openai_summarised_points": [
      "• The Red Sea crisis, instigated by Houthi attacks, has significantly impacted the Israeli economy by disrupting maritime shipping routes.",
      "• The crisis has led to increased operational costs for shipping and resulted in job losses within the maritime sector.",
      "• The port of Eilat, Israel's southern gateway, has experienced near-complete shutdowns and faces bankruptcy risks, prompting calls for government assistance.",
      "• Approximately 50% of the port's workforce is at risk of losing their jobs due to the crisis.",
      "• Many shipping companies are avoiding the Red Sea entirely, rerouting their vessels around Africa, which extends the journey by three weeks.",
      "• The rerouting around Africa increases shipping costs substantially, adding to the economic strain.",
      "• Insurance premiums for ships operating in the Red Sea have surged dramatically, with some Israeli ships experiencing a 250% increase in insurance costs.",
      "• Certain ships have been denied insurance coverage altogether due to the heightened risks associated with the conflict zone."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:31.351008",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 619,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Boycotts of Israel",
    "text": "On 19 July 2024, the International Court of Justice released an important\nadvisory opinion stating that countries must not recognize, assist, or support\nthe illegal circumstances arising from Israel's occupation of Palestinian\nterritories. The court declared that all nations must avoid any economic or\ntrade relations with Israel concerning the Occupied Palestinian territories\n(OPT) or any areas that could reinforce its unlawful presence there.\nAdditionally, it emphasized the need to take steps to prevent trade or\ninvestment activities that contribute to sustaining the illegal situation\nestablished by Israel in the OPT. On May 26, 2023, the European Trade Union\nConfederation (ETUC), which represents over 45 million workers and their trade\nunions across Europe, announced a boycott of products made in illegal Israeli\nsettlements in the occupied Palestinian territories. The ETUC emphasized the\nneed for regulatory measures to ban the import and export of goods produced in\nthese illicit settlements by entities within the European Union, as stipulated\nby EU treaties and international law.",
    "openai_summarised_points": [
      "• On 19 July 2024, the International Court of Justice issued an advisory opinion stating that countries must not recognize, assist, or support the illegal circumstances resulting from Israel's occupation of Palestinian territories.",
      "• The ICJ declared that all nations are required to avoid engaging in any economic or trade relations with Israel concerning the Occupied Palestinian Territories (OPT) or any areas that could reinforce Israel's unlawful presence there.",
      "• The advisory emphasized the necessity for countries to take measures to prevent trade or investment activities that contribute to maintaining the illegal situation established by Israel in the OPT.",
      "• On 26 May 2023, the European Trade Union Confederation (ETUC), which represents over 45 million workers and their trade unions across Europe, announced a boycott of products produced in illegal Israeli settlements located in the occupied Palestinian territories.",
      "• The ETUC highlighted the importance of implementing regulatory measures to prohibit the import and export of goods manufactured in these illicit settlements by entities within the European Union.",
      "• The measures advocated by the ETUC are aligned with EU treaties and international law, emphasizing the need to prevent economic support for illegal settlements."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:35.531107",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1098,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "2023 Israeli judicial reform",
    "text": "Following the 2023 Israeli judicial reform, banks in the country experienced a\nsignificant surge in fund withdrawals, occurring at a rate ten times higher\nthan normal. Executives warned that these political changes could adversely\naffect the economy, resulting in a decline in the shekel's value and a loss of\ninvestor confidence. A report from The Times of Israel on March 5, 2023, noted\nthat as the shekel depreciated against the dollar and euro, the Tel Aviv Stock\nExchange fell compared to stock markets in the EU and the US. Numerous\ncompanies, particularly in the technology sector, have withdrawn their\ninvestments from Israel, leading to an outflow of over $4 billion in just a\nfew weeks.",
    "openai_summarised_points": [
      "• Following the 2023 Israeli judicial reform, banks in Israel experienced a significant surge in fund withdrawals, occurring at a rate ten times higher than normal.",
      "• Bank executives warned that these political changes could negatively impact the Israeli economy, including a decline in the value of the shekel and a loss of investor confidence.",
      "• A report from The Times of Israel, dated March 5, 2023, indicated that as the shekel depreciated against the US dollar and euro, the Tel Aviv Stock Exchange (TASE) also declined relative to stock markets in the European Union and the United States.",
      "• Numerous companies, especially within the technology sector, have withdrawn their investments from Israel, contributing to an outflow of over $4 billion in just a few weeks."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:37.534157",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 696,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation under 5% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 28.4  | 7,240.1  | 24.9  | 6,356.5  | 3.6%  | 316.6%  | 4.8%  | n/a\n1981  | 32.5  | 8,240.4  | 26.4  | 6,687.2  | 4.7%  | 116.8%  | 5.1%  | n/a\n1982  | 35.0  | 8,717.7  | 28.3  | 7,040.6  | 1.4%  | 120.4%  | 5.0%  | n/a\n1983  | 37.3  | 9,100.1  | 31.6  | 7,688.7  | 2.6%  | 145.6%  | 4.6%  | n/a\n1984  | 39.5  | 9,514.1  | 29.9  | 7,186.1  | 2.2%  | 373.8%  | 5.9%  | n/a\n1985  | 42.6  | 10,072.8  | 27.8  | 6,562.4  | 4.5%  | 304.6%  | 6.7%  | n/a\n1986  | 45.0  | 10,477.6  | 34.2  | 7,955.1  | 3.6%  | 48.2%  | 7.1%  | n/a\n1987  | 49.6  | 11,355.8  | 40.8  | 9,349.1  | 7.5%  | 19.9%  | 6.1%  | n/a\n1988  | 53.2  | 11,975.7  | 50.6  | 11,391.5  | 3.6%  | 16.2%  | 6.4%  | n/a\n1989  | 56.0  | 12,408.2  | 51.5  | 11,394.3  | 1.4%  | 20.2%  | 8.9%  | n/a\n1990  | 62.0  | 13,308.1  | 60.7  | 13,035.7  | 6.6%  | 17.2%  | 9.6%  | n/a\n1991  | 67.0  | 13,553.3  | 68.9  | 13,924.0  | 4.6%  | 19.0%  | 10.6%  | n/a\n1992  | 73.5  | 14,340.4  | 77.0  | 15,021.2  | 7.2%  | 11.9%  | 11.2%  | n/a\n1993  | 78.1  | 14,841.5  | 77.4  | 14,708.3  | 3.8%  | 10.9%  | 10.0%  | n/a\n1994  | 85.3  | 15,813.5  | 88.3  | 16,367.6  | 7.0%  | 12.3%  | 7.8%  | n/a\n1995  | 95.5  | 17,233.8  | 104.9  | 18,927.9  | 9.7%  | 10.0%  | 6.9%  | n/a\n1996  | 103.0  | 18,131.5  | 114.5  | 20,153.2  | 5.9%  | 11.3%  | 8.3%  | n/a\n1997  | 108.8  | 18,677.3  | 118.9  | 20,410.4  | 3.8%  | 9.0%  | 9.5%  | n/a\n1998  | 114.5  | 19,191.2  | 120.1  | 20,119.2  | 4.1%  | 5.4%  | 10.7%  | n/a\n1999  | 120.0  | 19,616.7  | 120.9  | 19,766.9  | 3.3%  | 5.2%  | 11.1%  | n/a\n2000  | 133.4  | 21,216.5  | 136.0  | 21,641.3  | 8.7%  | 1.1%  | 10.9%  | 77.4%\n2001  | 136.8  | 21,258.3  | 134.6  | 20,918.3  | 0.3%  | 1.1%  | 11.6%  | 81.3%\n2002  | 138.8  | 21,137.0  | 125.1  | 19,044.9  | -0.1%  | 5.7%  | 12.9%  | 87.3%\n2003  | 143.5  | 21,460.9  | 131.3  | 19,634.9  | 1.4%  | 0.7%  | 13.4%  | 89.7%\n2004  | 154.4  | 22,687.4  | 140.0  | 20,565.8  | 4.8%  | -0.4%  | 12.9%  | 88.3%\n2005  | 165.8  | 23,941.4  | 147.1  | 21,233.8  | 4.1%  | 1.3%  | 11.2%  | 85.4%\n2006  | 180.5  | 25,596.8  | 158.7  | 22,501.1  | 5.6%  | 2.1%  | 10.5%  | 77.7%\n2007  | 196.6  | 27,390.9  | 184.1  | 25,647.7  | 6.0%  | 0.5%  | 9.2%  | 70.9%\n2008  | 206.8  | 28,309.7  | 220.5  | 30,182.5  | 3.3%  | 4.6%  | 7.7%  | 70.4%\n2009  | 210.0  | 28,068.5  | 212.0  | 28,330.2  | 0.9%  | 3.3%  | 9.4%  | 73.0%\n2010  | 224.6  | 29,469.5  | 238.4  | 31,278.0  | 5.7%  | 2.7%  | 8.3%  | 69.3%\n2011  | 242.0  | 31,172.7  | 266.8  | 34,366.9  | 5.6%  | 3.4%  | 7.1%  | 67.4%\n2012  | 255.7  | 32,336.1  | 262.3  | 33,170.0  | 2.6%  | 1.7%  | 6.9%  | 67.1%\n2013  | 280.0  | 34,755.0  | 297.7  | 36,957.4  | 4.4%  | 1.5%  | 6.2%  | 66.0%\n2014  | 285.4  | 34,755.7  | 314.3  | 38,276.6  | 3.9%  | 0.5%  | 5.9%  | 64.9%\n2015  | 300.5  | 35,876.9  | 303.4  | 36,221.1  | 2.5%  | -0.6%  | 5.2%  | 63.1%\n2016  | 326.6  | 38,229.6  | 322.1  | 37,701.9  | 4.5%  | -0.5%  | 4.8%  | 61.4%\n2017  | 344.3  | 39,533.6  | 358.2  | 41,131.7  | 4.3%  | 0.2%  | 4.2%  | 59.7%\n2018  | 366.9  | 41,320.4  | 376.7  | 42,422.9  | 4.1%  | 0.8%  | 4.0%  | 59.9%\n2019  | 389.0  | 42,977.1  | 402.5  | 44,466.8  | 4.2%  | 0.8%  | 3.8%  | 58.8%\n2020  | 386.4  | 41,930.7  | 413.3  | 44,850.4  | -1.9%  | -0.6%  | 4.3%  | 70.7%\n2021  | 437.1  | 46,659.3  | 488.5  | 52,151.9  | 8.6%  | 1.5%  | 5.0%  | 68.0%\n2022  | 496.8  | 52,173.1  | 527.2  | 55,358.8  | 6.1%  | 4.5%  | 3.9%  | 61.5%\n2023  | 530.0  | 54,750.6  | 564.2  | 58,273.4  | 3.0%  | 3.6%  | 3.8%  | 57.6%\n2024  | 557.4  | 56,633.2  | 591.3  | 60,082.8  | 3.0%  | 2.5%  | 3.7%  | 55.7%\n2025  | 585.1  | 58,474.2  | 618.8  | 61,846.7  | 3.1%  | 2.2%  | 3.7%  | 55.1%\n2026  | 615.6  | 60,526.4  | 647.4  | 63,650.9  | 3.3%  | 2.0%  | 3.7%  | 54.7%\n2027  | 649.5  | 62,813.2  | 678.6  | 65,625.6  | 3.5%  | 1.9%  | 3.7%  | 54.4%",
    "openai_summarised_points": [
      "• The table presents key economic indicators of Israel from 1980 to 2021, with IMF staff estimates for 2022–2027, highlighting data such as GDP, GDP per capita, inflation, unemployment, government debt, and growth rates.",
      "• Inflation rates under 5% are indicated in green within the table.",
      "• In 1980, Israel’s GDP measured approximately 28.4 billion US dollars in purchasing power parity (PPP), with a GDP per capita of about 7,240.1 US dollars PPP; nominal GDP was 24.9 billion US dollars, and nominal GDP per capita was 6,356.5 US dollars.",
      "• The GDP growth rate in 1980 was 3.6%, with inflation at 316.6%, and unemployment at 4.8%; government debt as a percentage of GDP was not available.",
      "• By 1981, GDP increased to 32.5 billion US dollars PPP, with a GDP per capita of 8,240.4 US dollars PPP; nominal GDP rose to 26.4 billion US dollars, and nominal GDP per capita was 6,687.2 US dollars.",
      "• Inflation decreased significantly from 316.6% in 1980 to 116.8% in 1981, and unemployment slightly increased to 5.1%.",
      "• In 1982, GDP reached 35.0 billion US dollars PPP, with a GDP per capita of 8,717.7 US dollars PPP; nominal GDP was 28.3 billion US dollars, and nominal GDP per capita was 7,040.6 US dollars.",
      "• Inflation further declined to 120.4%, with unemployment at 5.0%, indicating ongoing economic adjustments.",
      "• The trend of rising GDP continued through the 1980s, with 1987 marking a GDP of 49.6 billion US dollars PPP and a GDP per capita of 11,355.8 US dollars PPP; nominal GDP was 40.8 billion US dollars.",
      "• In 1988, GDP increased to 53.2 billion US dollars PPP, with a GDP per capita of 11,975.7 US dollars PPP; nominal GDP was 50.6 billion US dollars, and inflation was at 16.2%.",
      "• The early 1990s saw continued growth, with 1992 GDP at 73.5 billion US dollars PPP and GDP per capita at 14,340.4 US dollars PPP; nominal GDP was 77.0 billion US dollars.",
      "• The 1990s experienced rapid economic expansion, with GDP reaching 108.8 billion US dollars PPP in 1997, and GDP per capita at 18,677.3 US dollars PPP; nominal GDP was 118.9 billion US dollars.",
      "• Inflation rates generally decreased over the decade, reaching 5.4% in 1998 and 5.2% in 1999, with unemployment declining to around 9.0–11.1%.",
      "• The early 2000s showed steady growth, with GDP at 133.4 billion US dollars PPP in 2000 and 136.8 billion in 2001; GDP per capita was approximately 21,216.5 and 21,258.3 US dollars PPP respectively.",
      "• During 2000–2002, inflation was notably low, at around 1.1–5.7%, and unemployment ranged from 10.9% to 12.9%.",
      "• From 2003 onward, Israel’s economy continued to expand, with GDP reaching 154.4 billion US dollars PPP in 2004 and 180.5 billion in 2006, with corresponding increases in GDP per capita.",
      "• The global financial crisis of 2008 saw GDP at 206.8 billion US dollars PPP, with a GDP per capita of 28,309.7 US dollars PPP; inflation was 4.6%, and unemployment was 7.7%.",
      "• Post-2008, the economy maintained growth, with GDP at 242.0 billion US dollars PPP in 2011 and 255.7 billion in 2012, with GDP per capita exceeding 31,000 US dollars PPP.",
      "• In 2013, GDP reached 280.0 billion US dollars PPP, with a GDP per capita of 34,755.0 US dollars PPP; inflation was 1.5%, and unemployment was 6.2%.",
      "• The COVID-19 pandemic in 2020 caused a contraction with GDP at 386.4 billion US dollars PPP, a slight decrease in GDP per capita, and a negative growth rate of -1.9%; inflation was at -0.6%, and unemployment rose to 4.3%.",
      "• In 2021, Israel’s GDP increased significantly to 437.1 billion US dollars PPP, with a GDP per capita of 46,659.3 US dollars PPP, and a robust growth rate of 8.6%; inflation was 1.5%, and unemployment was 5.0%.",
      "• Projections for 2022 estimate GDP at 496.8 billion US dollars PPP, with GDP per capita at 52,173.1 US dollars PPP, and growth of 6.1%, with inflation at 4.5% and unemployment at 3.9%.",
      "• For 2023, GDP is forecasted at 530.0 billion US dollars PPP, with GDP per capita of 54,750.6 US dollars PPP, and a growth rate of 3.0%, inflation at 3.6%, and unemployment at 3.8%.",
      "• The trend of steady growth continues into 2024 with GDP at 557.4 billion US dollars PPP, GDP per capita at 56,633.2 US dollars PPP, and growth of 3.0%, inflation at 2.5%, and unemployment at 3.7%.",
      "• In 2025, projections show GDP reaching 585.1 billion US dollars PPP, with GDP per capita of 58,474.2 US dollars PPP, growth of 3.1%, inflation at 2.2%, and unemployment at 3.7%.",
      "• By 2026, GDP is expected to be 615.6 billion US dollars PPP, with GDP per capita of 60,526.4 US dollars PPP, and growth of 3.3%, inflation at 2.0%, and unemployment at 3.7%.",
      "• The 2027 forecast indicates GDP at 649.5 billion US dollars PPP, with GDP per capita of 62,813.2 US dollars PPP, and a growth rate of 3.5%, inflation at 1.9%, and unemployment at 3.7%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:51.627114",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4202,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Agriculture",
    "text": "The Kibbutzim, collective communities in Israel traditionally based on\nagriculture, played an important role in Israel's economy until the late\n1970s.\n\nIn 2017, 2.4% of the country's GDP is derived from agriculture. Of a total\nlabor force of 2.7 million, 2.6% are employed in agricultural production while\n6.3% in services for agriculture. While Israel imports substantial quantities\nof grain (approximately 80% of local consumption), it is largely self-\nsufficient in other agricultural products and foodstuffs. For centuries,\nfarmers of the region have grown varieties of citrus fruits, such as\ngrapefruit, oranges and lemons. Citrus fruits are still Israel's major\nagricultural export. In addition, Israel is one of the world's leading\ngreenhouse-food-exporting countries. Israel also produces and exports flowers\nand cotton. The country exports more than $1.3 billion worth of agricultural\nproducts every year, including farm produce as well as $1.2 billion worth of\nagricultural inputs and technology. Israeli technological innovations in\nagriculture and water technology have given the Israeli AgTech sector a\ncompetitve edge and allows Israeli agtech companies to operate in numerous\ncountries around the world.",
    "openai_summarised_points": [
      "• The Kibbutzim, collective communities in Israel traditionally based on agriculture, played a significant role in the country's economy until the late 1970s.",
      "• In 2017, agriculture contributed approximately 2.4% to Israel's Gross Domestic Product (GDP).",
      "• The total labor force in Israel was about 2.7 million people, with 2.6% employed in agricultural production and 6.3% employed in services related to agriculture.",
      "• Israel imports approximately 80% of its grain consumption, indicating a heavy reliance on imported cereal grains.",
      "• Despite grain imports, Israel is largely self-sufficient in other agricultural products and foodstuffs.",
      "• Historically, farmers in the region have cultivated citrus fruits such as grapefruits, oranges, and lemons for centuries.",
      "• Citrus fruits remain Israel's major agricultural export product.",
      "• Israel is one of the world's leading countries in greenhouse-food exports, showcasing advanced horticultural technology.",
      "• The country also produces and exports flowers and cotton as part of its agricultural output.",
      "• Annually, Israel exports over $1.3 billion worth of agricultural products, including farm produce and agricultural inputs and technology.",
      "• The agricultural inputs and technology sector accounts for approximately $1.2 billion of the exports each year.",
      "• Israeli technological innovations in agriculture and water technology have provided the Israeli AgTech sector with a competitive advantage.",
      "• These innovations enable Israeli AgTech companies to operate successfully in numerous countries worldwide, expanding Israel’s influence in global agricultural markets."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:56:55.928918",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1218,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Financial services",
    "text": "Jerusalem Venture Partners (JVP) compound in Jerusalem, one of Israel's\nlargest venture capital firms\n\nIsrael has over 100 active venture capital funds operating throughout the\ncountry with US$10 billion under management. In 2004, international foreign\nfunds from various nations around the world committed over 50 percent of the\ntotal dollars invested exemplifying the country's strong and sound reputation\nas an internationally sought after foreign investment by many countries.\nIsrael's venture capital sector has rapidly developed from the early 1990s,\nand has about 70 active venture capital funds (VC), of which 14 international\nVCs have Israeli offices. Israel's thriving venture capital and business-\nincubator industry played an important role in financing the country's\nflourishing high-tech sector. In 2008, venture capital investment in Israel,\nrose 19 percent to $1.9 billion.\n\nThe Yozma Fund kick-started the venture capital industry in Israel during the\n1990s, raising ~$8 billion total.\n\n\"Between 1991 and 2000, Israel's annual venture-capital outlays, nearly all\nprivate, rose nearly 60-fold, from $58 million to $3.3 billion; companies\nlaunched by Israeli venture funds rose from 100 to 800; and Israel's\ninformation-technology revenues rose from $1.6 billion to $12.5 billion. By\n1999, Israel ranked second only to the United States in invested private-\nequity capital as a share of GDP. Israel led the world in the share of its\ngrowth attributable to high-tech ventures: 70 percent.\"\n\nIsrael's thriving venture capital industry has played an important role in\nfunding the country's booming high-technology sector, with hundreds of\nprosperous Israeli private equity and venture capital firms. The 2008\nfinancial crisis negatively affected the availability of venture capital\nlocally. In 2009, there were 63 mergers and acquisitions in the Israeli market\nworth a total of $2.54 billion; 7% below 2008 levels ($2.74 billion), when 82\nIsraeli companies were merged or acquired, and 33% lower than 2007 proceeds\n($3.79 billion) when 87 Israeli companies were merged or acquired. Numerous\nIsraeli high tech companies have been acquired by various global multinational\ncorporations for their ability to produce profit-driven technologies in\naddition to their arsenal of reliable corporate management and quality\nadministrative personnel. In addition to venture capital funds, many of the\nworld's leading investment banks, pension funds, and insurance companies have\na strong presence in Israel committing their funds to financially back Israeli\nhigh-tech firms and benefit from its prosperous high tech sector. These\ninstitutional investors include Goldman Sachs, Bear Stearns, Deutsche Bank, JP\nMorgan, Credit Suisse First Boston, Merrill Lynch, CalPERS, Ontario Teachers\nPension Plan, and AIG.\n\nIsrael also has a small but fast growing hedge fund industry. Within five\nyears between 2007 and 2012, the number of active hedge funds doubled to 60.\nIsrael-based hedge funds have registered an increase of 162% from 2006 to\n2012, when they managed a total of $2 billion (₪8 billion) and employed about\n300 people. The ever-growing hedge fund industry in Israel is also attracting\na myriad of investors from around the world, particularly from the United\nStates.\n\nIn 2022, Tel Aviv was ranked 53rd on the Global Financial Centres Index.\n\nIn 2023, despite the occurrence of war and significant events like a legal\nreform and interest rate rise that shook the capital market and created\nuncertainty, about 40% of the companies traded on the Tel Aviv Stock Exchange\ncontinued to distribute dividends to their shareholders. This was particularly\nevident in the energy, oil and gas industries, and in the banking and\nfinancial services sector. The year marked a record in the total dividend\ndistributed to public shareholders, with about 62% of the distributed amount\n(16.8 billion shekels), compared to about 55% of the dividends (15.8 billion\nshekels) in 2022, with the remainder being paid to stakeholders. The average\ndividend yield of the exchange-listed companies in 2023 was approximately\n2.9%, compared to about 2.8% in the previous year. This was the highest return\nsince 2017 and higher than that of 2022, the record year, as the average\nmarket value in 2023 was about 9% lower than in 2022, while the total dividend\nwas only about 5% lower than the previous year.",
    "openai_summarised_points": [
      "• Jerusalem Venture Partners (JVP), based in Jerusalem, is one of Israel's largest venture capital firms.",
      "• Israel hosts over 100 active venture capital funds operating nationwide, managing approximately US$10 billion.",
      "• In 2004, international foreign funds from various nations committed over 50% of the total dollars invested in Israel, highlighting the country's strong reputation as an attractive destination for foreign investment.",
      "• The Israeli venture capital sector has experienced rapid development since the early 1990s, currently comprising about 70 active venture capital funds, including 14 international VCs with Israeli offices.",
      "• Israel's venture capital and business-incubator industries have significantly contributed to financing the country's high-tech sector, which is flourishing.",
      "• In 2008, venture capital investment in Israel increased by 19%, reaching a total of $1.9 billion.",
      "• The Yozma Fund, established in the 1990s, was instrumental in initiating Israel’s venture capital industry, raising approximately $8 billion in total.",
      "• Between 1991 and 2000, Israel’s annual private venture capital outlays surged nearly 60-fold, from $58 million to $3.3 billion.",
      "• During the same period, the number of companies launched by Israeli venture funds increased from 100 to 800.",
      "• Israel’s information-technology revenues grew from $1.6 billion to $12.5 billion between 1991 and 2000.",
      "• By 1999, Israel ranked second globally after the United States in private equity capital invested as a share of GDP.",
      "• Israel led the world in the proportion of its economic growth attributable to high-tech ventures, accounting for 70%.",
      "• The high-tech sector’s growth has been heavily financed by Israel’s vibrant venture capital industry, comprising numerous successful private equity and venture capital firms.",
      "• The 2008 financial crisis negatively impacted the availability of venture capital within Israel.",
      "• In 2009, Israeli mergers and acquisitions (M&A) totaled 63 deals worth $2.54 billion, representing a 7% decrease from 2008’s $2.74 billion across 82 deals, and a 33% decline from 2007’s $3.79 billion across 87 deals.",
      "• Many Israeli high-tech companies have been acquired by global multinational corporations for their profitable technologies and strong management and administrative personnel.",
      "• Major international investment banks, pension funds, and insurance companies with a presence in Israel include Goldman Sachs, Bear Stearns, Deutsche Bank, JP Morgan, Credit Suisse First Boston, Merrill Lynch, CalPERS, Ontario Teachers Pension Plan, and AIG.",
      "• Israel has a small but rapidly growing hedge fund industry; between 2007 and 2012, the number of active hedge funds doubled to 60.",
      "• From 2006 to 2012, Israel-based hedge funds experienced a 162% increase, managing a total of $2 billion (₪8 billion) and employing approximately 300 people.",
      "• The hedge fund industry in Israel is attracting increasing international investor interest, especially from the United States.",
      "• In 2022, Tel Aviv was ranked 53rd on the Global Financial Centres Index.",
      "• In 2023, despite war, a legal reform, and rising interest rates causing market uncertainty, about 40% of companies traded on the Tel Aviv Stock Exchange continued paying dividends.",
      "• The energy, oil, gas, banking, and financial services sectors notably maintained dividend distributions in 2023.",
      "• The total dividends distributed to public shareholders in 2023 reached a record high of approximately 16.8 billion shekels, representing about 62% of the total dividends paid, up from 55% (15.8 billion shekels) in 2022.",
      "• The remaining dividend amount was allocated to stakeholders.",
      "• The average dividend yield of exchange-listed companies in 2023 was approximately 2.9%, slightly higher than 2.8% in 2022.",
      "• The 2023 dividend yield marked the highest return since 2017 and surpassed the 2022 record, despite the market value decreasing by about 9% compared to 2022.",
      "• The total dividend paid in 2023 was only about 5% lower than in 2022, even though the overall market value declined."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:57:01.255930",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4379,
      "bullet_points_count": 28
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "High technology",
    "text": "Weizmann Institute of Science, Rehovot\n\nScience and technology in Israel is one of the country's most highly developed\nand industrialized sectors. The modern Israeli ecosystem of high technology is\nhighly optimized making up a significant bulk of the Israeli economy. The\npercentage of Israelis engaged in scientific and technological inquiry, and\nthe amount spent on research and development (R&D) concerning gross domestic\nproduct (GDP), is among the highest in the world, with 140 scientists and\ntechnicians per 10,000 employees. In comparison, the same is 85 per 10,000 in\nthe United States and 83 per 10,000 in Japan. Israel ranks fourth in the world\nin scientific activity, as measured by the number of scientific publications\nper million citizens. Israel's percentage of the total number of scientific\narticles published worldwide is almost 10 times higher than its percentage of\nthe world's population. The country is home to over 1,400 life science\ncompanies, including about 300 pharmaceutical companies, 600 medical device\ncompanies, 450 digital health companies, and 468 biotechnology companies.\nIsraeli scientists, engineers, and technicians have contributed to the modern\nadvancement of the natural sciences, agricultural sciences, computer sciences,\nelectronics, genetics, medicine, optics, solar energy and various fields of\nengineering. The country has one of the world's technologically most literate\npopulations. Israel has the second largest number of startup companies\nglobally, behind only the United States, and remains one of the largest\ncenters in the world for technology start-up enterprises. As of 2013, around\n200 start-ups were being created annually in Israel. In 2019, there were\nnearly 7,000 active start-ups operating throughout the country. In 2021, there\nwere 79 Israeli-established tech unicorns, with 32 of them headquartered in\nIsrael. More than one-third of cybersecurity unicorns in the world were\nIsraeli in 2021. Israel is also home to nearly 400 research and development\ncenters owned by various multinational companies, including prominent high-\ntechnology giants such as Google, Microsoft, and Intel.\n\nIsrael is also a major semiconductor design hub. The country is home to\nnumerous chip design centers owned by major multinational corporations, and is\nconsidered as having one of the most advanced chip design industries in the\nworld. In 2021, a total of 37 multinational corporations were operating in\nIsrael in the semiconductor field.\n\nIn 1998, Tel Aviv was named by _Newsweek_ as one of the ten technologically\nmost influential cities in the world. In 2012, the city was also named one of\nthe best places for high-tech startup companies, placed second behind its\nCalifornia counterpart. In 2013, _The Boston Globe_ ranked Tel Aviv as the\nsecond-best city for business start-ups, after Silicon Valley. In 2020,\nStartupBlink ranked Israel as having the third best startup ecosystem in the\nworld, behind only the United States and United Kingdom.\n\nAs a result of the country's highly prolific and dynamic start-up culture,\nIsrael is often referred to as the \"Start-Up Nation.\" and the \"Silicon Valley\nof the Middle East\". Programs that send people to Israel to explore the\n\"Start-Up Nation\" economy include TAVtech Ventures and TAMID Group. This\nsuccess has been attributed by some to widespread service in the Israel\nDefense Forces and its development of talent which then fuels the high-tech\nindustry upon discharge.\n\nIn recent years, the industry has faced a shortage of technology specialists;\n15% of positions in the high technology sector of Israel were unfilled as of\n2019. However, the largest number of unfilled job positions (31%) are in\nsoftware engineering specialities: DevOps, back-end, data science, machine\nlearning and artificial intelligence. Therefore, salaries of specialists in\nthe Israeli market also increased significantly. To solve this problem, IT\ncompanies look for filling the gaps abroad. Consequently, they employ about\n25% of their entire workforce overseas. Most companies choose to hire\nemployees from Ukraine (45%) and the United States (with 16%) are the second\nmost popular offshoring destination country. In 2017, the Council for Higher\nEducation in Israel launched a five-year program to increase the number of\ngraduates from computer science and engineering programs by 40%.",
    "openai_summarised_points": [
      "• Science and technology constitute one of Israel's most highly developed and industrialized sectors, playing a significant role in the national economy.",
      "• The modern Israeli high technology ecosystem is highly optimized and accounts for a substantial portion of the country's economic activity.",
      "• Israel has a notably high percentage of its population engaged in scientific and technological inquiry, with research and development (R&D) expenditure relative to gross domestic product (GDP) among the highest worldwide.",
      "• There are 140 scientists and technicians per 10,000 employees in Israel, compared to 85 per 10,000 in the United States and 83 per 10,000 in Japan.",
      "• Israel ranks fourth globally in scientific activity, as measured by the number of scientific publications per million citizens.",
      "• The country’s share of worldwide scientific articles is nearly ten times higher than its proportion of the global population.",
      "• Israel hosts over 1,400 life science companies, including approximately 300 pharmaceutical companies, 600 medical device companies, 450 digital health companies, and 468 biotechnology firms.",
      "• Israeli scientists, engineers, and technicians have significantly contributed to advancements across multiple fields, including natural sciences, agricultural sciences, computer sciences, electronics, genetics, medicine, optics, and solar energy, as well as various engineering disciplines.",
      "• Israel possesses one of the world's most technologically literate populations.",
      "• The country has the second-largest number of startup companies globally, second only to the United States, and remains a major global hub for technology startups.",
      "• As of 2013, Israel was creating approximately 200 new startups annually.",
      "• By 2019, nearly 7,000 active startups were operating across Israel.",
      "• In 2021, Israel had 79 tech unicorns (privately held startups valued at over $1 billion), with 32 headquartered within the country.",
      "• Over one-third of the world's cybersecurity unicorns in 2021 were Israeli.",
      "• Israel is home to nearly 400 research and development centers owned by multinational corporations, including Google, Microsoft, and Intel.",
      "• The country is a major semiconductor design hub, hosting numerous chip design centers owned by leading multinational firms, and is recognized for having one of the most advanced chip design industries globally.",
      "• In 2021, 37 multinational corporations operated in Israel within the semiconductor sector.",
      "• Tel Aviv was named by _Newsweek_ in 1998 as one of the ten most influential technological cities worldwide.",
      "• In 2012, Tel Aviv was ranked as the second-best city for high-tech startups, behind California.",
      "• In 2013, _The Boston Globe_ ranked Tel Aviv as the second-best city for business startups, after Silicon Valley.",
      "• In 2020, StartupBlink ranked Israel as having the third-best startup ecosystem globally, following the United States and the United Kingdom.",
      "• Israel is frequently referred to as the \"Start-Up Nation\" and the \"Silicon Valley of the Middle East\" due to its prolific and dynamic startup culture.",
      "• Programs such as TAVtech Ventures and TAMID Group facilitate exploration of Israel’s \"Start-Up Nation\" economy for entrepreneurs and investors.",
      "• The country's high-tech success is partly attributed to the widespread service in the Israel Defense Forces, which develops talent that fuels the high-tech industry after discharge.",
      "• As of 2019, the industry faced a significant shortage of technology specialists, with 15% of high-tech positions unfilled.",
      "• The largest unfilled job positions (31%) are in software engineering specialties, including DevOps, back-end development, data science, machine learning, and artificial intelligence.",
      "• Salaries for high-tech specialists in Israel increased substantially due to the labor shortage.",
      "• To address the talent gap, Israeli IT companies increasingly employ workers from abroad, with about 25% of their workforce being overseas hires.",
      "• The primary offshoring destinations are Ukraine (45%) and the United States (16%).",
      "• In 2017, the Israeli Council for Higher Education launched a five-year program aiming to increase the number of graduates in computer science and engineering by 40%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:57:08.422487",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4361,
      "bullet_points_count": 30
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Energy",
    "text": "Known oil and gas fields in the Levant Basin (US EIA) Consumption of fossil\nfuel energy sources in Israel since 1980. Coal consumption rose steadily since\n1980 when it was negligible. Natural gas consumption was nearly zero in 2003\nand has risen steadily since.\n\nHistorically, Israel relied on external imports for meeting most of its energy\nneeds, spending an amount equivalent to over 5% of its GDP per year in 2009 on\nimports of energy products. The transportation sector relies mainly on\ngasoline and diesel fuel, while the majority of electricity production is\ngenerated using imported coal. As of 2013, Israel was importing about 100 mln\nbarrels of oil per year. The country possesses negligible reserves of crude\noil but does have domestic natural gas resources which were discovered in more\nsignificant quantities starting in 2009, after many decades of previously\nunsuccessful exploration.",
    "openai_summarised_points": [
      "• The Levant Basin contains known oil and gas fields, as reported by the US Energy Information Administration (EIA).",
      "• Since 1980, Israel's consumption of fossil fuel energy sources has undergone significant changes, with notable trends in coal and natural gas use.",
      "• Coal consumption in Israel has increased steadily since 1980, when it was virtually negligible.",
      "• Natural gas consumption was nearly zero in 2003 but has experienced a steady rise since then.",
      "• Historically, Israel depended heavily on external imports to meet its energy needs, with energy import expenditures exceeding 5% of the country's GDP annually in 2009.",
      "• The transportation sector in Israel primarily relies on gasoline and diesel fuel for its energy requirements.",
      "• The majority of Israel's electricity production is generated using imported coal.",
      "• As of 2013, Israel was importing approximately 100 million barrels of oil annually.",
      "• The country has negligible domestic crude oil reserves, making it heavily reliant on imports for oil.",
      "• Israel possesses domestic natural gas resources, which were discovered in more significant quantities starting in 2009 after decades of unsuccessful exploration efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T03:06:03.040000",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 898,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.4.1",
    "section_name": "Natural gas",
    "text": "Until the early 2000s, natural gas use in Israel was minimal. In the late\n1990s, the government of Israel decided to encourage the usage of natural gas\nbecause of environmental, cost, and resource diversification reasons. At the\ntime however, there were no domestic sources of natural gas and the\nexpectation was that gas would be supplied from overseas in the form of LNG\nand by a future pipeline from Egypt (which eventually became the\nArish–Ashkelon pipeline). Plans were made for the Israel Electric Corporation\nto construct several natural gas-driven power plants, for erecting a national\ngas distribution grid, and for an LNG import terminal.\n\nNatural Gas Usage in Israel  2004  | 2005  | 2006  | 2007  | 2008  | 2009  | 2010  | 2014  | 2016  | 2018* | 2020* | 2022* | 2024* | 2026* | 2028* | 2030*\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n1.2  | 1.6  | 2.3  | 2.7  | 3.7  | 4.2  | 5.2  | 7.6  | 9.5  | 10.1  | 11.1  | 11.7  | 13  | 14.3  | 15.3  | 16.8\nFigures are in Billion Cubic Meters (BCM) per year. *Projected"
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.4.2",
    "section_name": "Recent discoveries",
    "text": "In 2000, a 33-billion-cubic-metre (BCM), or 1,200-billion-cubic-foot, natural-\ngas field was located offshore Ashkelon, with commercial production starting\nin 2004. As of 2014[update] however, this field is nearly depleted—earlier\nthan expected due to increased pumping to partially compensate for the loss of\nimported Egyptian gas in the wake of unrest associated with the fall of the\nMubarak regime in 2011. In 2009, a significant gas find named Tamar, with\nproven reserves of 223 BCM or 7.9×10~~^~~ 12 cu ft (307 BCM total proven +\nprobable) was located in deep water approximately 90 km (60 mi) west of Haifa,\nas well as a smaller 15 BCM (530×10~~^~~ 9 cu ft) field situated nearer the\ncoastline. Furthermore, results of 3D seismic surveys and test drilling\nconducted since 2010 have confirmed that an estimated 621 BCM (21.9×10~~^~~ 12\ncu ft) natural-gas deposit named Leviathan exists in a large underwater\ngeological formation nearby the large gas field already discovered in 2009.\n\nThe Tamar field began commercial production on 30 March 2013 after four years\nof development. The supply of gas from Tamar was expected to aid the Israeli\neconomy, which had suffered losses of more than ₪20 billion between 2011 and\n2013 resulting from the disruption of gas supplies from neighboring Egypt (and\nwhich are not expected to resume due to Egypt's decision to indefinitely\nsuspend its gas supply agreement to Israel). As a result, Israel, as well as\nits other neighbor Jordan, which also suffered from disruption of gas\ndeliveries from Egypt, had to resort to importing significantly more expensive\nand polluting liquid heavy fuels as substitute sources of energy. The ensuing\nenergy crisis in Israel was lifted once the Tamar field came online in 2013,\nwhile Jordan committed to a US$10 billion, 15-year gas supply deal totaling 45\nBCM from the Israeli Leviathan field which is scheduled to come online in late\n2019. The agreement is estimated to save Jordan US$600 million per year in\nenergy costs. In 2018, the owners of the Tamar and Leviathan fields announced\nthat they are negotiating an agreement with a consortium of Egyptian firms for\nthe supply of up to 64 BCM of gas over 10 years valued at up to US$15 billion.\nIn early 2012 the Israeli cabinet announced plans to set up a sovereign wealth\nfund (called \"the Israeli Citizens' Fund\").\n\nField  | Discovered  | Production  | Estimated size\n---|---|---|---\nNoa North  | 1999  | 2012 to 2014  | originally, 50 billion cubic feet (1.4 billion cubic metres); field depleted\nMari-B  | 2000  | 2004 to 2015  | originally, 1 trillion cubic feet (28 billion cubic metres); field depleted\nTamar | 2009  | 2013  | 10.8 trillion cubic feet (310 billion cubic metres)\nDalit  | 2009  | Not in production  | 700 billion cubic feet (20 billion cubic metres)\nLeviathan | 2010  | 2019  | 22 trillion cubic feet (620 billion cubic metres)\nDolphin  | 2011  | Not in production  | 81.3 billion cubic feet (2.30 billion cubic metres)\nTanin | 2012  | Not in production  | 1.2–1.3 trillion cubic feet (34–37 billion cubic metres)\nKarish | 2013  | 2022  | 2.3–3.6 trillion cubic feet (65–102 billion cubic metres)"
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.4.3",
    "section_name": "Electricity",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( February 2020)_\n---|---\n\nSince the founding of the state through the mid-2010s decade, the state-owned\nutility, Israel Electric Corporation (IEC) had an effective monopoly on power\ngeneration in the country. In 2010 the company sold 52,037 GWh of electricity.\nUntil the mid-2010s the country also faced a persistently low operating\nreserve, which is mostly the result of Israel being an \"electricity island\".\nMost countries have the capability of relying on power drawn from producers in\nadjacent countries in the event of a power shortage. Israel's grid however, is\nunconnected to those of neighboring countries. This is mostly due to political\nreasons but also to the considerably less-developed nature of the power\nsystems of Jordan and Egypt, whose systems constantly struggle to meet\ndomestic demand and whose per-capita electric generation is less than one\nfifth that of Israel's. Nevertheless, while operating reserves in Israel were\nlow, the country possessed sufficient generation and transmission capacity to\nmeet domestic electricity needs and unlike in the countries surrounding it,\nrolling blackouts have historically been quite rare, even at periods of\nextreme demand.\n\nFacing the increasing demand for electricity and concerned about the low\nreserve situation, the government of Israel began taking steps to increase the\nsupply of electricity and operating reserve, as well to reduce the monopoly\nposition of the IEC and increase competition in the electricity market\nstarting in the second half of the 2000s decade. It instructed the IEC to\nconstruct several new power stations and encouraged private investment in the\ngeneration sector. By 2015, the IEC's share of total nationwide installed\nelectric generation capacity had fallen to about 75%, with the company then\npossessing an installed generation capacity of about 13.6 gigawatts (GW).\nSince 2010, Independent Power Producers have constructed three new gas-fired\ncombined cycle power stations with a total generation capacity of about 2.2\nGW, while various industrial concerns constructed on-premises cogeneration\nfacilities with a total electricity output of about 1 GW, and which are\nlicensed by the electric authority to sell surplus electricity to the national\ngrid at competitive rates. Also under construction is a 300 MW pumped storage\nfacility, with two more in planning, plus several solar-powered plants.\n\nIn addition to the above steps, Israel and Cyprus are considering implementing\nthe proposed EuroAsia Interconnector project. This consists of laying a 2000MW\nHVDC undersea power cable between them and between Cyprus and Greece, thus\nconnecting Israel to the greater European power grid. If carried out, this\nwill allow a further increase in the country's operating reserve as well as\nsell surplus electricity abroad.\n\nIn 2016, total nationwide electricity production was 67.2 GWh, of which 55.2%\nwas generated using natural gas and 43.8% using coal – the first time the\nshare of electricity production using natural gas exceeded that generated\nusing coal.\n\nShare of Total Electricity Generation Capacity at Full Output\nby Plant Type and Fuel Types Used by the IEC in 2010  | Coal  | Fuel oil | Natural gas  | Diesel\n---|---|---|---|---\n**Installed capacity by plant type** | 39.7%  | 3.4%  | 39.8%  | 18.9%\n**Total annual generation by fuel source** | 61.0%  | 0.9%  | 36.6%  | 1.5%"
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.4.4",
    "section_name": "Solar power",
    "text": "The Negev Desert is home to the Israeli solar research industry, in particular\nthe National Solar Energy Center and the Arava Valley, which is the sunniest\narea of Israel.\n\nSolar power in Israel and the Israeli solar energy industry has a history that\ndates to the founding of the country. In the 1950s, Levi Yissar developed a\nsolar water heater to help assuage an energy shortage in the new country. By\n1967 around one in twenty households heated their water with the sun and\n50,000 solar heaters had been sold. With the 1973 oil crisis, Harry Zvi Tabor,\nthe father of Israel's solar industry, developed the prototype solar water\nheater that is now used in over 90% of Israeli homes."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Industrial manufacturing",
    "text": "Israel has a large industrial capacity. It has a well-developed chemical\nindustry with many of its products aimed at the export market. Most of the\nchemical plants are located in Ramat Hovav, the Haifa Bay area and near the\nDead Sea. Israel Chemicals is one of the largest fertilizer and chemical\ncompanies in Israel and its subsidiary, the Dead Sea Works in Sdom is the\nworld's fourth-largest producer and supplier of potash products. The company\nalso produces other products such as magnesium chloride, industrial salts, de-\nicers, bath salts, table salt, and raw materials for the cosmetic industry.\nIndustrial production of metals, machinery and electrical equipment,\nconstruction materials, consumer goods, and textiles, as well as food\nprocessing also form a significant part of the manufacturing sector. Machinery\nand equipment manufactured in Israel includes computer equipment, medical\nequipment, agricultural equipment, and robots. Israel has a successful\nsemiconductor device fabrication industry, with several semiconductor\nmanufacturing facilities in the country.\n\nOne of the country's largest employers is Israel Aerospace Industries which\nproduces mainly aviation, space, and defense products. In 2017 the company had\nan order backlog of 11.4 billion US dollars. There are numerous other\naerospace companies. Israeli aerospace companies are primarily sub-suppliers,\nfocusing on fields such as machining, electronic systems and components, and\ncomposite materials. Israel is a major manufacturer and exporter of unmanned\naerial vehicles. Israel also has a significant pharmaceutical industry and is\nhome to Teva Pharmaceutical Industries, one of the world's largest\npharmaceutical companies, which employed 40,000 people as of 2011. It\nspecializes in generic and proprietary pharmaceuticals and active\npharmaceutical ingredients. It is the largest generic drug manufacturer in the\nworld and one of the 15 largest pharmaceutical companies worldwide. In\naddition, Israel also has a shipbuilding industry through the company Israel\nShipyards, which has one of the largest shipbuilding and repair facilities in\nthe Eastern Mediterranean. For the civilian market, it builds merchant ships\nand other civilian watercraft as well as machinery for ports and heavy\nindustries. It also builds naval craft for the defense market."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.5.1",
    "section_name": "Diamond industry",
    "text": "Israel is one of the world's three major centers for polished diamonds,\nalongside Belgium and India. Israel's net polished diamond exports slid 22.8\npercent in 2012 as polished diamond exports fell to $5.56 billion from $7.2\nbillion in 2011. Net exports of rough diamonds dropped 20.1 percent to $2.8\nbillion and net exports of polished diamonds slipped 24.9 percent to $4.3\nbillion, while net rough diamond imports dropped 12.9 percent to $3.8 billion.\nNet exports and imports dropped during the Great Recession, particularly\nwithin the Eurozone, affected by the European sovereign-debt crisis, and the\nUnited States. The United States is the largest market accounting for 36% of\noverall export market for polished diamonds while Hong Kong remains at second\nwith 28 percent and Belgium at 8 percent coming in third. As of 2016[update],\ncut diamonds were Israel's largest export product, comprising 23.2% of all\nexports."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.5.2",
    "section_name": "Defense contracting",
    "text": "Israel is one of the world's major exporters of military equipment, accounting\nfor 10% of the world total in 2007. Three Israeli companies were listed on the\n2010 Stockholm International Peace Research Institute index of the world's top\n100 arms-producing and military service companies: Elbit Systems, Israel\nAerospace Industries and RAFAEL. The Defense industry in Israel is a\nstrategically important sector and a large employer within the country. It is\nalso a major player in the global arms market and is the 11th largest arms\nexporter in the world as of 2012. Total arms transfer agreements topped 12.9\nbillion between 2004 and 2011. Israeli defense equipment exports have reached\n7 billion U.S. dollars in 2012, making it a 20 percent increase from the\namount of defense-related exports in 2011. Much of the exports are sold to the\nUnited States and Europe. Other major regions that purchase Israeli defense\nequipment include Southeast Asia and Latin America. India is also major\ncountry for Israeli arms exports and has remained Israel's largest arms market\nin the world. Israel is considered to be the leading UAV exporter in the\nworld. According to the Stockholm International Peace Research Institute,\nIsraeli defense companies were behind 41% of all drones exported in 2001–2011.\nIsrael's defense exports in 2021 reached US$11.2 billion in sales. Exports to\nArab countries that joined the Abraham Accords made up 7% of all Israeli\ndefense exports."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "3.6",
    "section_name": "Tourism",
    "text": "Israel is a major tourist destination, especially for those of Jewish\nancestry, with 4.55 million foreign tourists visiting the country in 2019\n(about one tourist per two Israelis), yielding a 25% growth since 2016 and\ncontributed ₪20 billion to the economy, making it an all-time record at that\ntime. The most popular paid visited site is Masada."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "External trade",
    "text": "Map of Israeli exports in 2016\n\nIn 2016, Israeli goods exports totaled US$55.8 billion. It imported US$61.9\nbillion worth of goods in the same year. In 2017 total exports (goods and\nservices) amounted to US$102.3 billion, while imports totaled $96.7 billion.\nIsrael usually posts a modest trade deficit in goods. Its main goods imports\nconsist of raw materials, crude oil, production inputs and finished consumer\ngoods. Most of its exports are high-value-added items such as electronic\ncomponents and other high-technology equipment, tools, and machinery, cut\ndiamonds, refined petrochemicals, and pharmaceuticals. It normally posts a\nsubstantial trade surplus in services thanks to tourism and service industries\nsuch as software development, engineering services, and biomedical and\nscientific research and development. Therefore, overall external trade is\npositive, contributing to a significant current account surplus which as of\n2017 stood at 4.7% of GDP.\n\nThe United States is Israel's largest trading partner, and Israel is the\nUnited States' 26th-largest trading partner; two-way trade totaled some $24.5\nbillion in 2010, up from $12.7 billion in 1997. The principal U.S. exports to\nIsrael include computers, integrated circuits, aircraft parts and other\ndefense equipment, wheat, and automobiles. Israel's chief exports to the U.S.\ninclude cut diamonds, jewelry, integrated circuits, printing machinery, and\ntelecommunications equipment. The two countries signed a free trade agreement\n(FTA) in 1985 that progressively eliminated tariffs on most goods traded\nbetween the two countries over the following ten years. An agricultural trade\naccord was signed in November 1996, which addressed the remaining goods not\ncovered in the FTA. Some non-tariff barriers and tariffs on goods remain,\nhowever. Israel also has trade and cooperation agreements in place with the\nEuropean Union and Canada, and is seeking to conclude such agreements with a\nnumber of other countries, including Turkey, Jordan and several countries in\nEastern Europe.\n\nIn regional terms, the European Union is the top destination for Israeli\nexports. In the four-month period between October 2011 and January 2012,\nIsrael exported goods totalling $5 billion to the EU – amounting to 35% of\nIsrael's overall exports. During the same period, Israeli exports to East Asia\nand the Far East totaled some $3.1 billion.\n\nUntil 1995, Israel's trade with the Arab world was minimal due to the Arab\nLeague boycott, which was begun against the Jewish community of Palestine in\n1945. Arab nations not only refused to have direct trade with Israel (the\nprimary boycott), but they also refused to do business with any corporation\nthat operated in Israel (secondary boycott), or any corporation that did\nbusiness with a corporation that did business with Israel (tertiary boycott).\n\nIn 2013, commercial trade between Israel and the Palestinian territories were\nvalued at US$20 billion annually.\n\nIn 2012, ten companies were responsible for 47.7% of Israel's exports. These\ncompanies were Intel Israel, Elbit Systems, Oil Refineries Ltd, Teva\nPharmaceuticals, Iscar, Israel Chemicals, Makhteshim Agan, Paz Oil Company,\nIsrael Aerospace Industries and the Indigo division of Hewlett-Packard. The\nBank of Israel and Israel's Export Institute have warned that the country is\ntoo dependent on a small number of exporters."
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Export destinations and import origins",
    "text": "Top ten export destinations for Israel in 2016  |  | Country/Area | Volume (bln. US $) | % of exports | Primary export(s)\n---|---|---|---|---\n1  |  United States | 17.6  | 32%  | Cut diamonds, medicaments\n2  |  Hong Kong | 4.44  | 8%  | Cut diamonds\n3  |  United Kingdom | 3.91  | 7%  | Medicaments\n4  |  China | 3.33  | 6%  | Electrical equipment, integrated circuits\n5  |  Belgium /  Luxembourg | 2.51  | 4.5%  | Cut diamonds (as of 2015)\n6  |  India | 2.4  | 4.3%  | Cut diamonds\n7  |  Netherlands | 2.14  | 3.8%  | Medicaments, computer equipment\n8  |  Germany | 1.52  | 2.7%  | Varied\n9  |  Switzerland | 1.47  | 2.6%  | Cut diamonds\n10  |  France | 1.45  | 2.6%  | Varied\nSource: The Observatory of Economic Complexity Archived 11 May 2019 at the\nWayback Machine, MIT\nTop ten import origins for Israel in 2016  |  | Country | Volume (bln. US $) | % of imports | Primary import(s)\n---|---|---|---|---\n1  |  United States | 8.1  | 13%  | Diamonds, electronics\n2  |  China (not including Hong Kong)  | 5.9  | 9.5%  | Varied\n3  |  Switzerland | 4.29  | 6.9%  | Oil, chemicals, diamonds\n4  |  Germany | 4.07  | 6.6%  | Varied\n5  |  Belgium /  Luxembourg | 3.91  | 6.3%  | Diamonds (as of 2015)\n6  |  United Kingdom | 3.67  | 5.9%  | Oil\n7  |  Netherlands | 2.7  | 4.4%  | Computers and electronics\n8  |  Italy | 2.69  | 4.4%  | Varied\n9  |  Turkey | 2.6  | 4.2%  | Varied\n10  |  Japan | 2.35  | 3.8%  | Cars, photo lab equipment\nSource: The Observatory of Economic Complexity Archived 11 May 2019 at the\nWayback Machine, MIT"
  },
  {
    "chapter_name": "Economy of Israel",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Rankings",
    "text": "The Global Competitiveness Report of 2016 to 2017 ranked Israel as having the\nworld's second most innovative economy.[_needs update_] It was also ranked\n19th among 189 world nations on the UN's Human Development Index. As of 2018,\nIsrael ranks 20th out of 133 countries on the economic complexity index. The\nIMD World Competitiveness Yearbook of 2016 ranked Israel's economy as world\n21st most competitive out of the 61 economies surveyed. The Israeli economy\nwas ranked as the world's most durable economy in the face of crises, and was\nalso ranked first in the rate research and development center investments. The\nBank of Israel was ranked first among central banks for its efficient\nfunctioning, up from the 8th place in 2009. Israel was ranked first also in\nits supply of skilled manpower. Israeli companies, particularly in the high-\ntech area, have enjoyed considerable success raising money on Wall Street and\nother world financial markets: as of 2010[update] Israel ranked second among\nforeign countries in the number of its companies listed on U.S. stock\nexchanges.\n\nHaving moved away from the socialist economic model since the mid-1980s and\nearly 1990s, Israel has made dramatic moves toward the free-market capitalist\nparadigm. As of 2020[update], Israel's economic freedom score is 74.0, making\nits economy the 26th freest in the 2020 Index of Economic Freedom. Israel\nranks 35th on the World Bank's ease of doing business index. Israel's economic\ncompetitiveness is helped by strong protection of property rights, relatively\nlow corruption levels, and high openness to global trade and investment.\nIncome and corporate tax rates remain relatively high. As of 2020[update],\nIsrael ranks 35th out of 179 countries in Transparency International's\nCorruption Perceptions Index. Bribery and other forms of corruption are\nillegal in Israel, which is a signatory to the OECD Bribery Convention since\n2008.\n\nIn April 2024, one of the three leading US credit rating agencies, Fitch,\nissued a warning that the Gaza war could result in a significant decline in\nIsrael's credit metrics. In August 2024, Fitch downgraded Israel's credit\nrating. The credit rating of Israel was downgraded to Baa1 by another agency,\nMoody's, in the upcoming month. In October 2024, Israel was also downgraded by\nthe third agency, S&P."
  }
]