[
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article includes a list of general references, but **it lacks\nsufficient correspondinginline citations**. Please help to improve this\narticle by introducing more precise citations. _( August 2010)__(Learn how and\nwhen to remove this message)_  \n---|---  \n  \nThe **economy ofMozambique** is $14.396 billion by gross domestic product as\nof 2018, and has developed since the end of the Mozambican Civil War\n(1977–1992). In 1987, the government embarked on a series of macroeconomic\nreforms designed to stabilize the economy. These steps, combined with donor\nassistance and political stability since the multi-party elections in 1994,\nled to dramatic improvements in the country's growth rate. Inflation was low\nduring the late 1990s, although it rose again in 2000–2002. Fiscal reforms,\nincluding the introduction of a value-added tax and reform of the customs\nservice, have improved the government's revenue collection abilities.\n\nIn spite of these gains, Mozambique remains dependent upon foreign assistance\nfor much of its annual budget. Subsistence agriculture continues to employ the\nvast majority of the country's workforce. A substantial trade imbalance\npersists. However, the opening of the Mozal aluminium smelter, the country's\nlargest foreign investment project to date, has increased export earnings.\nAdditional investment projects in titanium extraction and processing and\ngarment manufacturing should further close the import/export gap. Mozambique's\nonce substantial foreign debt has been reduced through forgiveness and\nrescheduling under the International Monetary Fund's Heavily Indebted Poor\nCountries (HIPC) and Enhanced HIPC initiatives, and is now at a manageable\nlevel. Mozambique is a least developed country according to United Nations.",
    "openai_summarised_points": [
      "• The economy of Mozambique had a gross domestic product (GDP) of $14.396 billion as of 2018, reflecting development since the end of the Mozambican Civil War, which lasted from 1977 to 1992.",
      "• In 1987, the Mozambican government initiated a series of macroeconomic reforms aimed at stabilizing the economy, which, together with donor assistance and political stability following the multi-party elections in 1994, resulted in significant improvements in the country's economic growth rate.",
      "• Inflation in Mozambique was low during the late 1990s but experienced an increase between 2000 and 2002.",
      "• Fiscal reforms implemented during this period included the introduction of a value-added tax (VAT) and reforms to the customs service, both of which enhanced the government’s capacity to collect revenue.",
      "• Despite these economic gains, Mozambique remains heavily dependent on foreign assistance to finance much of its annual government budget.",
      "• Subsistence agriculture continues to be the primary source of employment for the majority of Mozambique’s workforce.",
      "• The country faces a substantial trade imbalance, although this gap has begun to narrow with the opening of the Mozal aluminium smelter, which is Mozambique’s largest foreign investment project to date and has increased export earnings.",
      "• Additional investment projects in sectors such as titanium extraction and processing, as well as garment manufacturing, are expected to further reduce the import/export deficit.",
      "• Mozambique’s previously significant foreign debt has been reduced to a manageable level through debt forgiveness and rescheduling under the International Monetary Fund’s Heavily Indebted Poor Countries (HIPC) and Enhanced HIPC initiatives.",
      "• The United Nations classifies Mozambique as a least developed country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:52:28.010687",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1765,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Historical development of real GDP per capita in Mozambique, since 1960",
    "openai_summarised_points": [
      "• Since 1960, Mozambique's real GDP per capita has experienced significant fluctuations influenced by colonial rule, independence, civil war, and economic reforms.",
      "• During the colonial period under Portuguese rule, Mozambique's economy was primarily agrarian with limited industrial development, resulting in relatively low GDP per capita growth.",
      "• Following independence in 1975, Mozambique faced economic disruption due to the departure of Portuguese settlers and the nationalization of key industries, which initially caused a decline in real GDP per capita.",
      "• The onset of the Mozambican Civil War (1977–1992) severely damaged infrastructure and agricultural production, leading to a prolonged period of economic contraction and stagnation in real GDP per capita.",
      "• Post-civil war reconstruction efforts beginning in the early 1990s, supported by international aid and structural adjustment programs from organizations such as the International Monetary Fund (IMF) and the World Bank, contributed to gradual economic recovery and growth in real GDP per capita.",
      "• Throughout the 1990s and 2000s, Mozambique implemented market-oriented reforms, including privatization and liberalization policies, which facilitated increased foreign investment and diversification of the economy, further improving real GDP per capita.",
      "• Despite these improvements, real GDP per capita remained relatively low compared to global averages, reflecting ongoing challenges such as poverty, limited industrialization, and vulnerability to external shocks.",
      "• By the early 21st century, Mozambique's real GDP per capita showed a steady upward trend, driven by growth in sectors such as agriculture, mining, and natural gas exploration, although disparities in income distribution persisted.",
      "• The historical trajectory of Mozambique’s real GDP per capita underscores the impact of political instability, conflict, and economic policy shifts on the country’s economic development over the past six decades."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:52:36.512036",
      "openai_model": "gpt-4.1-mini",
      "content_length": 71,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "The Portuguese rule",
    "text": "Although the Portuguese participated in the trading networks of East Africa as\nearly as the 16th century, they did not establish hegemonic (total) colonial\ndominance over the entire territory that now comprises Mozambique until the\n19th century. Portugal founded settlements, trading posts, forts and ports.\nCities, towns and villages were founded all over the territory by the\nPortuguese, like Lourenço Marques, Beira, Vila Pery, Vila Junqueiro, Vila\nCabral and Porto Amélia. Others were expanded and developed greatly under\nPortuguese rule, like Quelimane, Nampula and Sofala. By this time, Mozambique\nhad become a Portuguese colony, but administration was left to the trading\ncompanies (like Mozambique Company and Niassa Company) who had received long-\nterm leases from Lisbon. By the mid-1920s, the Portuguese created a highly\nexploitative and coercive settler economy, in which African natives were\nforced to work on the fertile lands taken over by Portuguese settlers.\nIndigenous African peasants mainly produced cash crops designated for sale in\nthe markets of Portugal. Major cash crops included cotton, cashews, tea and\nrice. This arrangement ended in 1932 after the takeover in Portugal by the new\nAntónio de Oliveira Salazar government. Thereafter, Mozambique, along with\nother Portuguese colonies, was put under the direct control of Lisbon. In\n1951, it became an overseas province. The economy expanded rapidly during the\n1950s and 1960s, attracting thousands of Portuguese settlers to the country.\nIt was around this time that the first nationalist guerrilla groups began to\nform in Tanzania and other African countries. The strong industrial and\nagricultural development that did occur throughout the 1950s, 1960s and early\n1970s was based on Portuguese development plans, and also included British and\nSouth African investment.\n\nIn 1959–60, Mozambique's major exports included cotton, cashew nuts, tea,\nsugar, copra and sisal. The expanding economy of the Portuguese overseas\nprovince was fuelled by foreign direct investment, and public investment which\nincluded ambitious state-managed development plans. British capital owned two\nof the large sugar concessions (the third was Portuguese), including the\nfamous Sena states. The Matola Oil Refinery, Procon, was controlled by England\nand the United States. In 1948 the petroleum concession was given to the\nMozambique Gulf Oil Company. At Maotize coal was mined; the industry was\nchiefly financed by Belgian capital. 60% of the capital of the Compagnie de\nCharbons de Mozambique was held by the Societe Miniere et Geologique Belge,\n30% by the Mozambique Company, and the remaining 10% by the governing\nauthorities of the territory.\n\nThree banks were in operation, the Banco Nacional Ultramarino, Portuguese,\nBarclays Bank, D.C.O., British, and the _Banco Totta e Standard de Moçambique_\n(a joint-venture between Standard Bank of South Africa and Banco Totta &\nAçores of the Portuguese mainland). Nine out of the twenty-three insurance\ncompanies were Portuguese. 80% of life-insurance was in the hands of foreign\ncompanies which testifies the openness of the economy. The Portuguese overseas\nprovince of Mozambique was the first territory of Portugal, including the\nEuropean mainland, to distribute Coca-Cola. Lately the Lourenço Marques Oil\nRefinery was established by the Sociedade Nacional de Refinação de Petróleo\n(SONAREP) – a Franco-Portuguese syndicate. In the sisal plantations Swiss\ncapital was invested, and in copra concerns, a combination of Portuguese,\nSwiss and French capital was invested. The large availability of capital from\nboth Portuguese and international origin, allied to the wide range of natural\nresources and the growing urban population, lead to an impressive growth and\ndevelopment of the economy. From the late stages of this notable period of\nhigh growth and huge development effort started in the 1950s, was the\nconstruction of the Cahora Bassa dam by the Portuguese, which started to fill\nin December 1974 after construction was commenced in 1969.\n\nIn the face of intransigent Portuguese ruling authorities, the main\nnationalist movement, FRELIMO, began a guerrilla war which gradually wrested\ncontrol of parts of the northernmost regions of the territory from the\nPortuguese. The Mozambican War of Independence came to an end in 1974\nfollowing a leftist military coup in Portugal. The new left-wing government in\nLisbon had no wish to maintain an empire and negotiations on the country's\nindependence began immediately. In 1975, after the leftist military coup of 24\nApril 1974 in Portugal that overthrew the Estado Novo regime which had\ngoverned the country and its overseas territories, the colonial wars that\nraged in the various Portuguese African territories since the early 1960s\nended. At independence, Mozambique's industrial base was well-developed by\nSub-Saharan Africa standards, thanks to a boom in investment in the 1960s and\nearly 1970s. Indeed, in 1973, value-added in manufacturing was the sixth\nhighest in Sub-Saharan Africa. However, further industrialisation was stopped\nby the hasty exodus of 90 percent of the ethnic Portuguese citizens during and\nafter the independence process which was concluded on June 25, 1975. The rapid\nexodus of Mozambique's Portuguese population left its economy in disarray. The\nsituation was exacerbated by the Mozambican Civil War (1977–1992) during the\nfollowing years that destroyed the remaining wealth and left the former\nPortuguese Overseas Province in a state of disrepair.",
    "openai_summarised_points": [
      "• The Portuguese engaged in East African trading networks from the 16th century but did not establish full colonial dominance over present-day Mozambique until the 19th century.",
      "• Portugal founded numerous settlements, trading posts, forts, and ports across Mozambique, including Lourenço Marques, Beira, Vila Pery, Vila Junqueiro, Vila Cabral, and Porto Amélia, while expanding towns such as Quelimane, Nampula, and Sofala.",
      "• Mozambique became a Portuguese colony administered primarily by trading companies like the Mozambique Company and Niassa Company, which held long-term leases from Lisbon.",
      "• By the mid-1920s, the Portuguese had created an exploitative settler economy forcing indigenous African peasants to work on fertile lands seized by Portuguese settlers, producing cash crops such as cotton, cashews, tea, and rice for export to Portugal.",
      "• This system ended in 1932 when António de Oliveira Salazar’s government took control, placing Mozambique under direct administration from Lisbon and designating it an overseas province in 1951.",
      "• The economy expanded rapidly during the 1950s and 1960s, attracting thousands of Portuguese settlers, and the first nationalist guerrilla groups formed in Tanzania and other African countries during this period.",
      "• Industrial and agricultural development in Mozambique during the 1950s to early 1970s was driven by Portuguese development plans and included investments from British and South African capital.",
      "• In 1959–60, Mozambique’s major exports were cotton, cashew nuts, tea, sugar, copra, and sisal, supported by foreign direct investment and ambitious state-managed development plans.",
      "• British capital owned two of the three large sugar concessions, including the notable Sena estates; the third sugar concession was Portuguese-owned.",
      "• The Matola Oil Refinery, Procon, was controlled by English and American interests, and the petroleum concession was granted to the Mozambique Gulf Oil Company in 1948.",
      "• Coal mining at Maotize was primarily financed by Belgian capital, with 60% of the Compagnie de Charbons de Mozambique’s capital held by the Société Minière et Géologique Belge, 30% by the Mozambique Company, and 10% by the territorial government.",
      "• Three banks operated in Mozambique: the Portuguese Banco Nacional Ultramarino, the British Barclays Bank D.C.O., and Banco Totta e Standard de Moçambique, a joint venture between South Africa’s Standard Bank and Portugal’s Banco Totta & Açores.",
      "• Of twenty-three insurance companies, nine were Portuguese, but 80% of life insurance was controlled by foreign companies, indicating the economy’s openness.",
      "• Mozambique was the first Portuguese territory, including mainland Portugal, to distribute Coca-Cola.",
      "• The Lourenço Marques Oil Refinery was established by the Sociedade Nacional de Refinação de Petróleo (SONAREP), a Franco-Portuguese syndicate.",
      "• Swiss capital invested in sisal plantations, while copra enterprises received combined Portuguese, Swiss, and French investments.",
      "• The availability of both Portuguese and international capital, combined with abundant natural resources and a growing urban population, spurred significant economic growth and development.",
      "• Construction of the Cahora Bassa dam, a major infrastructure project, began in 1969 and started filling in December 1974.",
      "• The main nationalist movement, FRELIMO, initiated a guerrilla war against Portuguese rule, gradually gaining control over northern regions of Mozambique.",
      "• The Mozambican War of Independence ended in 1974 following a leftist military coup in Portugal, which led to the new government’s decision to relinquish its empire and begin independence negotiations.",
      "• The Estado Novo regime, which had governed Portugal and its colonies, was overthrown on 24 April 1974, ending colonial wars in Portuguese African territories.",
      "• At independence in 1975, Mozambique had a well-developed industrial base by Sub-Saharan African standards due to investment booms in the 1960s and early 1970s; in 1973, its manufacturing value-added ranked sixth highest in Sub-Saharan Africa.",
      "• The rapid departure of 90% of the ethnic Portuguese population during and after independence on 25 June 1975 halted further industrialization and left the economy in disarray.",
      "• The subsequent Mozambican Civil War (1977–1992) further devastated the country’s remaining wealth and infrastructure, leaving Mozambique in a state of severe economic disrepair."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:52:55.454934",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5530,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Independent Mozambique",
    "text": "GDP per capita (current), compared to neighbouring countries (world average =\n100)\n\nMozambique became an independent state in 1975. The exodus of trained\nPortuguese workers and the eruption of the Mozambican Civil War in 1977\nopposing RENAMO to FRELIMO, drove the country to absolute chaos. Mozambique\nbecame an independent republic and the Frente de Libertacao de Mocambique\n(FRELIMO), the socialist guerrilla organization that had fought the colonial\nwar against Portugal, assumed power. Over the next several years, FRELIMO\npursued numerous socialist policies, including nationalization of land and\nlarge industries, centralized planning, and heavy funding for the national\neducational and health systems, which however, remained weak for decades in\nindependent Mozambique, and still are among the most ineffective and\nunderfunded in the world. The exodus (mass departure) of the Portuguese\nfollowing independence in 1975 facilitated the takeover of many shops by\nMozambicans. Unfortunately, the exodus, which totaled over 275,000 ethnic\nPortuguese, also led to a huge loss of professionals, productive machinery,\nentrepreneurs, and skilled workers. By the early 1980s, Mozambique became what\nJoseph Hanlon—author of _Peace Without Profit: How the IMF Blocks Rebuilding\nin Mozambique_ —called a \"Cold War battlefield.\"[_page needed_] The term\nrefers to the situation in which socialist FRELIMO, with Soviet backing, was\nforced to fight a lengthy civil war (Mozambican Civil War) against a\ncounterinsurgency movement of Mozambicans named RENAMO, funded and directed by\nthe neighboring white minority states of apartheid South Africa and Rhodesia.\nThe Cold War was defined by animosity between capitalist and socialist world\npowers, and though there was never an outright military conflict between the\nformer and the latter, each respectively funded counterinsurgency movements\nagainst governments they disfavored. The capitalist governments of South\nAfrica and Zimbabwe feared that a successfully ruled African socialist system\nmight send a message of revolution and self-rule to citizens in\ncontemporaneous majority rule African countries, such as their own.\n\nIn 1983, however, the Fourth Congress of FRELIMO initiated the first steps\ntowards privatization by allowing for a partial dismantling of state farms.\nThe political pressure of the ideologically charged civil war, in conjunction\nwith the excruciating need for aid and funds to finance imports, compelled\nFRELIMO to negotiate its first structural adjustment package (SAP) with the\nWorld Bank and the International Monetary Fund (IMF) (commonly referred to as\nthe Bretton Woods institutions) in 1986. The series of SAPs that followed\nthereafter required privatization of major industries, less government\nspending, deregulation of the economy, and trade liberalization. The SAPs,\ntherefore, have essentially focused on the implementation of an unfettered\nfree market economy. Throughout the 1980s and 1990s, more than 1400\nprivatizations of public enterprises took place. At the time, this was the\nlargest privatization programme in Africa. The tendency towards austerity,\nprivatization and other neoliberal reforms has continued throughout the\nfollowing decades, for instance with the PARPA action plan (2001-2014) whose\nstated goal was the reduction of poverty. However, PARPA largely focused on\nattracting multinational corporations in sectors such as aluminium and oil. It\nhas been noted that GDP growth in this period did not result in a \"trickle-\ndown\" effect: in fact, the poorest segments of society have become even\npoorer, while public education and healthcare also suffered from the austerity\nmeasures.\n\nIn 1995 alone, Mozambique received $1.115 billion in aid. In 1999, the total\nexternal debt stood at $4.8 billion. Fortunately, in the same year significant\neconomic recovery did occur, as the real GDP growth rate reached 10 percent.\n\nToday, the economy of Mozambique continues to be dominated by agriculture.\nMajor exports include prawns, cotton, cashew nuts, sugar, citrus, copra and\ncoconuts, and timber. Export partners, in turn, include Spain, South Africa,\nPortugal, the United States, Japan, Malawi, India, and Zimbabwe. Imports, such\nas farm equipment and transport equipment, are capital goods that are worth\nmore than agricultural products, hence Mozambique's large trade deficit. The\ncountry also imports food, clothing, and petroleum products. Import partners\ninclude South Africa, Zimbabwe, Saudi Arabia, Portugal, the United States,\nJapan, and India. In the past several years, the value of imports outweighed\nthe value of exports by 5 to 1 or more—a factor that obliges Mozambique to\ndepend heavily on foreign aid and loans by foreign commercial banks and the\nBretton Woods Institutions (BWIs).\n\nDue to its reliance on loans, Mozambique also continues to commit itself to\nthe IMF's loan conditions. In 2024, for instance, a new support package from\nthe IMF was coupled to requirements such as further boosting the private\nsector and freezing wages. Concurrently, Mozambique has also intensified its\nrelations with Chinese firms and financial institutions. An important example\nis the Maputo–Katembe bridge, the longest suspension bridge in Africa, which\nwas realized by the China Road and Bridge Corporation and with Exim loans\nbetween 2014 and 2018. China is said to have \"become Mozambique’s top\ninfrastructure partner\" between 2014 and 2024.",
    "openai_summarised_points": [
      "• Mozambique gained independence from Portugal in 1975, becoming an independent republic governed by the Frente de Libertação de Moçambique (FRELIMO), a socialist guerrilla organization that had fought the colonial war against Portugal.",
      "• Following independence, over 275,000 ethnic Portuguese left Mozambique, resulting in a significant loss of professionals, productive machinery, entrepreneurs, and skilled workers, which negatively impacted the economy.",
      "• The eruption of the Mozambican Civil War in 1977 pitted FRELIMO against the rebel group RENAMO, a counterinsurgency movement funded and directed by apartheid South Africa and Rhodesia, turning Mozambique into a \"Cold War battlefield\" with Soviet-backed socialist FRELIMO opposing capitalist-supported RENAMO.",
      "• FRELIMO implemented socialist policies including nationalization of land and large industries, centralized economic planning, and substantial funding for education and health systems, which remained weak and underfunded for decades.",
      "• In 1983, at its Fourth Congress, FRELIMO initiated partial privatization by dismantling state farms, marking the beginning of economic reforms.",
      "• In 1986, under severe political and economic pressure, FRELIMO negotiated its first structural adjustment package (SAP) with the World Bank and International Monetary Fund (IMF), initiating a series of SAPs that mandated privatization of major industries, reduced government spending, deregulation, and trade liberalization to establish a free market economy.",
      "• Throughout the 1980s and 1990s, Mozambique executed over 1,400 privatizations of public enterprises, constituting the largest privatization program in Africa at the time.",
      "• The neoliberal reforms and austerity measures continued into the 2000s, exemplified by the PARPA action plan (2001-2014), which aimed to reduce poverty but primarily focused on attracting multinational corporations in sectors like aluminium and oil.",
      "• Despite GDP growth during the PARPA period, the poorest segments of Mozambican society became poorer, and public education and healthcare systems deteriorated due to austerity policies.",
      "• In 1995, Mozambique received $1.115 billion in foreign aid, and by 1999, its external debt reached $4.8 billion; however, 1999 also saw significant economic recovery with a real GDP growth rate of 10%.",
      "• Mozambique’s economy remains predominantly agricultural, with major exports including prawns, cotton, cashew nuts, sugar, citrus fruits, copra, coconuts, and timber.",
      "• Key export partners for Mozambique include Spain, South Africa, Portugal, the United States, Japan, Malawi, India, and Zimbabwe.",
      "• Mozambique imports capital goods such as farm and transport equipment, which exceed the value of its agricultural exports, resulting in a large trade deficit; other imports include food, clothing, and petroleum products.",
      "• Major import partners are South Africa, Zimbabwe, Saudi Arabia, Portugal, the United States, Japan, and India.",
      "• The value of imports has exceeded exports by a ratio of 5 to 1 or more in recent years, compelling Mozambique to rely heavily on foreign aid and loans from foreign commercial banks and Bretton Woods Institutions (BWIs).",
      "• Mozambique remains committed to IMF loan conditions due to its dependence on external financing; for example, a 2024 IMF support package required Mozambique to further boost the private sector and implement wage freezes.",
      "• Concurrently, Mozambique has strengthened economic and infrastructural ties with China, with Chinese firms and financial institutions playing a prominent role.",
      "• A notable Chinese-supported project is the Maputo–Katembe bridge, the longest suspension bridge in Africa, constructed by the China Road and Bridge Corporation with Exim Bank loans between 2014 and 2018.",
      "• Between 2014 and 2024, China has emerged as Mozambique’s top infrastructure partner, significantly influencing the country’s economic development and infrastructure landscape."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:11.123536",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5434,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Sectors",
    "text": "All economic sectors ranging from manufacturing and agriculture to tourism and\nfinance, declined sharply after independence from Portugal in 1975, but picked\nup in the 2000s after the end of the Mozambican Civil War, although they are\nstill performing well below potential.",
    "openai_summarised_points": [
      "• All economic sectors in Mozambique, including manufacturing, agriculture, tourism, and finance, experienced a sharp decline following the country’s independence from Portugal in 1975.",
      "• The decline in these sectors persisted until the 2000s, when economic performance began to improve after the conclusion of the Mozambican Civil War.",
      "• Despite the recovery observed in the 2000s, all sectors continue to perform significantly below their full potential."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:13.940789",
      "openai_model": "gpt-4.1-mini",
      "content_length": 273,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Gas and oil reserves",
    "text": "_The L-shaped recovery with low oil prices in the coming years._ Source:\nRisCura: Bright Africa\n\nRecent oil and gas discoveries across East Africa, most notably in Mozambique\nand Tanzania, have seen the region emerge as a new player in the global oil\nand gas Industry.\n\nThe discoveries have driven billions of dollars in annual investment to the\nregion. According to BMI estimates, the finds in the last few years are more\nthan that of any other region in the world, and the discoveries are expected\nto continue for the next few years.",
    "openai_summarised_points": [
      "• Recent oil and gas discoveries in East Africa, particularly in Mozambique and Tanzania, have positioned the region as an emerging player in the global oil and gas industry.",
      "• These discoveries have attracted billions of dollars in annual investment to East Africa, significantly boosting the local economies.",
      "• According to BMI estimates, the volume of oil and gas finds in East Africa over the past few years exceeds that of any other region worldwide.",
      "• The trend of substantial oil and gas discoveries in Mozambique and Tanzania is expected to continue for the next few years.",
      "• The region is experiencing an L-shaped recovery characterized by low oil prices projected to persist in the coming years, as noted by RisCura in their Bright Africa report."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:17.879709",
      "openai_model": "gpt-4.1-mini",
      "content_length": 535,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture, fishing and forestry",
    "text": "In Mozambique, agriculture is the mainstay of the economy and the country has\na great potential for growth in the sector. Agriculture employs more than 80\npercent of the labour force and provides livelihoods to the vast majority of\nover 23 million inhabitants. Agriculture contributed 31.5 percent of the GDP\nin 2009, while commerce and services accounted for 44.9 percent. By contrast,\n20 percent of the total export value in 2009 originated from the agriculture\nsector, mostly through the export of fish (mainly shrimps and prawns), timber,\ncopra, cashew nuts and citrus, cotton, coconuts, tea and tobacco.\n\nRural women taking transport to a local market in Mozambique. A large portion\nof the populations relies on small-scale agriculture and related marketplace\nfor food security and livelihoods.\n\nAgricultural potential is high, particularly in the fertile northern regions,\nwhich accounts for the bulk of the country's agricultural surplus. The main\ncash crops are sugar, copra, cashew nuts, tea, and tobacco. Total sugar\nproduction was expected to rise by 160% in the 2000s, which would make the\ncountry a major net exporter for the first time since independence. All the\nplantations and refineries have been privatized. Marine products, particularly\nprawns, are Mozambique's largest single export. There is an abundance of\nmarine resources that are not fully exploited. After the Mozambican Civil War,\nthe return of internally displaced persons and the gradual restoration of\nrural markets have enabled Mozambique to increase agricultural production\ndramatically.\n\nMozambique produced, in 2018:\n\n* 8.5 million tons of cassava (9th largest producer in the world);\n* 3 million tons of sugarcane;\n* 1.6 million tons of maize;\n* 625 thousand tons of sweet potato;\n* 578 thousand tons of banana;\n* 343 thousand tons of tomatoes;\n* 273 thousand tons of potato;\n* 227 thousand tons of coconut;\n* 138 thousand tons of onion;\n* 134 thousand tons of rice;\n* 108 thousand tons of cashew nuts (11th largest producer in the world);\n* 107 thousand tons of peanut;\n* 93 thousand tons of tobacco;\n* 90 thousand tons of sorghum;\n* 89 thousand tons of cowpea;\n* 85 thousand tons of castor bean;\n* 66 thousand tons of pineapple;\n* 65 thousand tons of sesame seed;\n* 50 thousand tons of beans;\n* 48 thousand tons of cotton;\n\nIn addition to smaller productions of other agricultural products.",
    "openai_summarised_points": [
      "• Agriculture is the mainstay of Mozambique's economy, employing more than 80 percent of the labor force and providing livelihoods to the vast majority of the country's over 23 million inhabitants.",
      "• In 2009, agriculture contributed 31.5 percent of Mozambique's GDP, while commerce and services accounted for 44.9 percent of GDP.",
      "• In 2009, 20 percent of Mozambique's total export value originated from the agriculture sector, primarily through the export of fish (mainly shrimps and prawns), timber, copra, cashew nuts, citrus, cotton, coconuts, tea, and tobacco.",
      "• A large portion of Mozambique’s population relies on small-scale agriculture and related marketplaces for food security and livelihoods, with rural women notably participating in local market transport and trade.",
      "• Mozambique has high agricultural potential, especially in the fertile northern regions, which produce the bulk of the country’s agricultural surplus.",
      "• The main cash crops in Mozambique include sugar, copra, cashew nuts, tea, and tobacco.",
      "• Total sugar production in Mozambique was expected to increase by 160% during the 2000s, potentially making the country a major net sugar exporter for the first time since independence.",
      "• All sugar plantations and refineries in Mozambique have been privatized.",
      "• Marine products, particularly prawns, represent Mozambique’s largest single export commodity.",
      "• Mozambique possesses abundant marine resources that remain underexploited.",
      "• Following the Mozambican Civil War, the return of internally displaced persons and the gradual restoration of rural markets have enabled a dramatic increase in agricultural production.",
      "• In 2018, Mozambique produced 8.5 million tons of cassava, ranking as the 9th largest producer globally.",
      "• In 2018, Mozambique produced 3 million tons of sugarcane.",
      "• In 2018, Mozambique produced 1.6 million tons of maize.",
      "• In 2018, Mozambique produced 625 thousand tons of sweet potato.",
      "• In 2018, Mozambique produced 578 thousand tons of banana.",
      "• In 2018, Mozambique produced 343 thousand tons of tomatoes.",
      "• In 2018, Mozambique produced 273 thousand tons of potato.",
      "• In 2018, Mozambique produced 227 thousand tons of coconut.",
      "• In 2018, Mozambique produced 138 thousand tons of onion.",
      "• In 2018, Mozambique produced 134 thousand tons of rice.",
      "• In 2018, Mozambique produced 108 thousand tons of cashew nuts, ranking as the 11th largest producer worldwide.",
      "• In 2018, Mozambique produced 107 thousand tons of peanut.",
      "• In 2018, Mozambique produced 93 thousand tons of tobacco.",
      "• In 2018, Mozambique produced 90 thousand tons of sorghum.",
      "• In 2018, Mozambique produced 89 thousand tons of cowpea.",
      "• In 2018, Mozambique produced 85 thousand tons of castor bean.",
      "• In 2018, Mozambique produced 66 thousand tons of pineapple.",
      "• In 2018, Mozambique produced 65 thousand tons of sesame seed.",
      "• In 2018, Mozambique produced 50 thousand tons of beans.",
      "• In 2018, Mozambique produced 48 thousand tons of cotton.",
      "• Mozambique also produces smaller quantities of various other agricultural products beyond those listed."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:31.603350",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2378,
      "bullet_points_count": 32
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Food security, vulnerability and risk management",
    "text": "It is estimated that 64 percent of Mozambique's population is food insecure.\nThe prevalence is higher in the southern region (75 percent). Mozambique is a\nnet importer of food. Total annual cereal import requirements average 0.89\nmillion tons (0.14 million of maize, 0.39 of rice and 0.36 of wheat).\nMozambique must also import substantial quantities of meat and livestock\nproducts.\n\nDespite good land and water availability, much of the food system relies on\nsmallholder farmers which are vulnerable to natural disasters, exacerbating\nfood insecurity challenges.",
    "openai_summarised_points": [
      "• It is estimated that 64 percent of Mozambique's population is food insecure, indicating a significant challenge in ensuring adequate food access across the country.",
      "• The prevalence of food insecurity is notably higher in the southern region of Mozambique, where 75 percent of the population experiences food insecurity.",
      "• Mozambique is a net importer of food, relying on external sources to meet its domestic food demand.",
      "• The country’s total annual cereal import requirements average 0.89 million tons, comprising 0.14 million tons of maize, 0.39 million tons of rice, and 0.36 million tons of wheat.",
      "• In addition to cereals, Mozambique must import substantial quantities of meat and livestock products to satisfy national consumption needs.",
      "• Despite Mozambique having good land and water availability, much of its food system depends heavily on smallholder farmers.",
      "• These smallholder farmers are particularly vulnerable to natural disasters, which exacerbates the existing challenges related to food insecurity in Mozambique."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:35.082970",
      "openai_model": "gpt-4.1-mini",
      "content_length": 563,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Mining and semi-processing",
    "text": "There are large mineral deposits, but exploration has been constrained by the\ncivil war (1977–1992) and poor infrastructure. The World Bank has estimated\nthat there was the potential for exports worth US$200m by 2005 – in the late\n1990s they totaled US$3.6m, some 1% of total exports, and a contribution of\nless than 2% of GDP. Minerals currently being mined include marble, bentonite,\ncoal, gold, bauxite, granite, titanium and gemstones. Illegal exports from\nartisanal production are estimated at US$50 million.[_original research?_]\n\nMozambique exported its first batch of coal in 2011 and expects to become the\nworld's largest coal exporter. It is also spending about US$50 billion in\ninfrastructure projects to access its coal reserves. Mozambique is reported to\nhave the fourth largest reserves of natural gas in the world, after Russia,\nIran, and Qatar.",
    "openai_summarised_points": [
      "• Mozambique possesses large mineral deposits; however, exploration activities have been significantly constrained by the civil war from 1977 to 1992 and by poor infrastructure conditions.",
      "• The World Bank estimated that Mozambique had the potential for mineral exports worth US$200 million by the year 2005.",
      "• In the late 1990s, mineral exports from Mozambique totaled only US$3.6 million, representing approximately 1% of the country’s total exports and contributing less than 2% to the national GDP.",
      "• Minerals currently being mined in Mozambique include marble, bentonite, coal, gold, bauxite, granite, titanium, and various gemstones.",
      "• Illegal exports originating from artisanal mineral production in Mozambique are estimated to be valued at around US$50 million.",
      "• Mozambique exported its first batch of coal in 2011 and has ambitions to become the world’s largest coal exporter.",
      "• The country is investing approximately US$50 billion in infrastructure projects aimed at improving access to its coal reserves.",
      "• Mozambique reportedly holds the fourth largest reserves of natural gas globally, ranking after Russia, Iran, and Qatar."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:37.774756",
      "openai_model": "gpt-4.1-mini",
      "content_length": 860,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Manufacturing",
    "text": "Although very well developed during the 1960s and early 1970s,\nindustrialisation declined rapidly with the withdrawal of most Portuguese\nafter independence. Since 1995 production has increased sharply and was\nexpected to grow by 33% in 2001 due to the expansion (costing US$860m) of the\nMozal aluminium smelter which was approved in mid-2001. The country's largest\never foreign investment, Mozal has little impact on employment, but is making\na substantial contribution to balance of payments through taxes generated.\nExports generated in the first quarter of 2001 were worth US$85.3, the primary\nfactor for the 172% expansion in Mozambique's exports for the period.\nCompletion of the smelter resulted in aluminium accounting for up to 70% of\nexports. Construction materials, agricultural processing, beverages, and\nconsumer goods were the main sub-sectors.",
    "openai_summarised_points": [
      "• Industrialisation in Mozambique was highly developed during the 1960s and early 1970s but experienced a rapid decline following the withdrawal of most Portuguese nationals after the country gained independence.",
      "• Since 1995, manufacturing production in Mozambique has increased sharply, reflecting a recovery and growth phase in the sector.",
      "• In 2001, manufacturing production was expected to grow by 33%, primarily driven by the expansion of the Mozal aluminium smelter.",
      "• The expansion of the Mozal aluminium smelter, approved in mid-2001, involved an investment of US$860 million, marking the largest foreign investment ever made in Mozambique.",
      "• Despite its scale, the Mozal aluminium smelter has minimal impact on employment levels within Mozambique.",
      "• The Mozal smelter contributes significantly to Mozambique’s balance of payments through the taxes it generates, enhancing the country’s fiscal revenues.",
      "• In the first quarter of 2001, exports generated by the manufacturing sector were valued at US$85.3 million, which was a key factor in the 172% increase in Mozambique’s exports during that period.",
      "• The completion of the Mozal aluminium smelter led to aluminium accounting for up to 70% of Mozambique’s total exports, highlighting its dominant role in the export economy.",
      "• Other important manufacturing sub-sectors in Mozambique include construction materials, agricultural processing, beverages, and consumer goods, which collectively support the broader industrial base."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:44.300866",
      "openai_model": "gpt-4.1-mini",
      "content_length": 857,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Tourism",
    "text": "This sector declined sharply after independence from Portugal, but has been\ndeveloped, although it is still performing well below potential. The national\nstrategy is to promote high-value, low-volume tourism. The first section of\nthe \"Peace Park\" initiative which links with Kruger Park in South Africa, and\nGonarezhou in Zimbabwe, was a project aimed at the development of tourism.",
    "openai_summarised_points": [
      "• The tourism sector in Mozambique experienced a sharp decline following the country’s independence from Portugal.",
      "• Despite this initial decline, efforts have been made to develop the tourism industry, although it continues to perform significantly below its potential.",
      "• Mozambique’s national tourism strategy focuses on promoting high-value, low-volume tourism to enhance economic benefits while managing environmental and cultural impacts.",
      "• A key project in tourism development is the \"Peace Park\" initiative, which aims to create a transfrontier conservation area linking Mozambique with neighboring countries.",
      "• The first section of the \"Peace Park\" initiative connects Mozambique with Kruger Park in South Africa and Gonarezhou National Park in Zimbabwe, fostering regional cooperation in tourism and conservation.",
      "• This initiative is designed to stimulate tourism growth by leveraging the combined natural and cultural resources of the linked parks across the three countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:48.470533",
      "openai_model": "gpt-4.1-mini",
      "content_length": 382,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Telecommunication",
    "text": "Immediately after a long civil war ended in 1992 the country started to reform\ntelecommunication sector. The mobile sub-sector has experienced excellent\ngrowth rates following the introduction of competition in 2003 between Vodacom\nMozambique and mCel, the incumbent mobile subsidiary of the national telco,\nTelecomunicações de Moçambique (TDM). The government is intent on introducing\ncompetition to the fixed-line sector as well, but it is hesitating to\nprivatise TDM. All other services are open to competition, subject to\nlicensing by the industry regulator, INCM. Internet usage in the country has\nbeen hampered by the inadequate fixed-line infrastructure and the high cost of\ninternational bandwidth, but this market sector has started to accelerate\nfollowing the introduction of various kinds of broadband services including\nADSL, cable modems, WiMAX wireless broadband and mobile data services, and\nthen the landing of the first international submarine fibre optic cable in the\ncountry (SEACOM) in 2009. Further improvements can be expected from the\nongoing rollout of 3G mobile services and a national fibre backbone network as\nwell as the landing of the second international fibre (EASSy) in 2010. The\nlower cost of bandwidth has already started to trickle down to lower consumer\nprices in some service segments, while others have remained\nunchanged.[_citation needed_]",
    "openai_summarised_points": [
      "• Following the end of a prolonged civil war in 1992, Mozambique initiated reforms in its telecommunication sector to modernize and improve services.",
      "• The mobile telecommunications sub-sector experienced significant growth after the introduction of competition in 2003, marked by the entry of Vodacom Mozambique competing against mCel, the incumbent mobile subsidiary of the national telecommunications company, Telecomunicações de Moçambique (TDM).",
      "• The Mozambican government aims to introduce competition into the fixed-line telecommunications sector; however, it remains hesitant to privatize the state-owned Telecomunicações de Moçambique (TDM).",
      "• All other telecommunication services in Mozambique are open to competition but require licensing and regulation by the industry regulator, Instituto Nacional das Comunicações de Moçambique (INCM).",
      "• Internet usage in Mozambique has historically been constrained by inadequate fixed-line infrastructure and the high cost of international bandwidth, limiting widespread access and growth.",
      "• The internet market began to accelerate with the introduction of various broadband technologies, including Asymmetric Digital Subscriber Line (ADSL), cable modems, WiMAX wireless broadband, and mobile data services.",
      "• A major milestone was achieved in 2009 with the landing of SEACOM, the first international submarine fibre optic cable in Mozambique, significantly enhancing international bandwidth availability.",
      "• Further improvements in telecommunications infrastructure were anticipated with the ongoing rollout of 3G mobile services and the development of a national fibre backbone network.",
      "• The landing of a second international submarine fibre optic cable, the Eastern Africa Submarine Cable System (EASSy), was expected in 2010, promising additional bandwidth and connectivity improvements.",
      "• The reduction in the cost of international bandwidth following these infrastructure developments has begun to lower consumer prices in certain service segments, although some prices have remained unchanged."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:53:57.203020",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1379,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Finance",
    "text": "The banking system, dominated by the Portuguese collapsed after independence\nin 1975. From an earlier position (in the 1980s) of central government control\nof the economy, Mozambique has initiated rapid reforms in recent years,\naccelerating the implementation of market-based economic policies, and\ncommitting to a policy of fiscal and monetary discipline. In 1995 the\ngovernment introduced its medium-term economic growth, strategy which it\ncontinues to pursue. Since the late 1990s, both national and international\nbanking, established an environment for rapid economic growth and development\nof the financial system. On 11 December 2012, the Mozambican Government\nacquire the Portuguese shares of BNI Banco Nacional de Investimento, owning\n100% of the bank and turning it into the country's development bank and\nnominated a former Governor of the Bank of Mozambique, Adriano Maleiane as\nCEO."
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Macroeconomic review",
    "text": "Alleviating poverty: at the end of the civil war in 1992, Mozambique ranked\namong the poorest countries in the world. It still ranks among the least\ndeveloped countries, with very low socioeconomic indicators. In the last\ndecade, however, it has experienced a notable economic recovery. Per capita\nGDP in 2000 was estimated at $222; in the mid-1980s, it was $120. With a high\nforeign debt (originally $5.7 billion at 1998 net present value) and a good\ntrack record on economic reform, Mozambique was the first African country to\nreceive debt relief under the initial Heavily Indebted Poor Country (HIPC)\nInitiative. In April 2000, Mozambique qualified for the Enhanced HIPC program\nas well and attained its completion point in September 2001. This led to the\nParis Club members agreeing in November 2001 to substantially reduce the\nremaining bilateral debt. This will lead to the complete forgiveness of a\nconsiderable volume of bilateral debt, including that owed to the United\nStates.\n\nThe following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bil. US$ nominal) | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Pct. of GDP)\n---|---|---|---|---|---|---\n1980  | 2.3  | 197  | 4.6  | 4.2%  | 2.0%  | n/a\n1985  | 2.3  | 181  | 4.5  | 1.0%  | 30.8%  | n/a\n1990  | 3.5  | 270  | 3.5  | 1.0%  | 43.7%  | n/a\n1995  | 4.7  | 304  | 3.1  | 2.1%  | 47.7%  | n/a\n2000  | 7.9  | 444  | 5.9  | 0.8%  | 12.7%  | 96%\n2005  | 13.5  | 657  | 8.9  | 6.3%  | 6.4%  | 60%\n2006  | 15.2  | 723  | 9.5  | 9.9%  | 13.2%  | 40%\n2007  | 16.9  | 778  | 10.8  | 7.6%  | 10.4%  | 31%\n2008  | 18.4  | 824  | 12.9  | 6.9%  | 14.5%  | 33%\n2009  | 19.6  | 855  | 12.3  | 5.9%  | 3.8%  | 39%\n2010  | 21.1  | 898  | 11.4  | 6.7%  | 12.4%  | 39%\n2011  | 23.1  | 955  | 14.6  | 7.1%  | 11.2%  | 34%\n2012  | 25.4  | 1,022  | 16.7  | 8.0%  | 2.6%  | 37%\n2013  | 27.5  | 1,078  | 17.2  | 6.6%  | 4.3%  | 49%\n2014  | 30.2  | 1,148  | 18.0  | 7.7%  | 2.6%  | 63%\n2015  | 32.7  | 1,210  | 16.2  | 7.4%  | 3.6%  | 86%\n2016  | 34.6  | 1,243  | 12.1  | 4.7%  | 18.4%  | 125%\n2017  | 36.1  | 1,261  | 13.3  | 2.6%  | 15.8%  | 104%\n2018  | 38.5  | 1,307  | 15.0  | 3.5%  | 3.2%  | 106%\n2019  | 41.5  | 1,370  | 15.5  | 2.3%  | 5.7%  | 98%\n2020  | 43.5  | 1,394  | 14.2  | -1.2%  | 0.9%  | 120%\n2021  | 46.2  | 1,440  | 16.2  | 2.4%  | 6.6%  | 104%\n2022  | 51.7  | 1,567  | 18.9  | 4.4%  | 10.4%  | 100%\n2023  | 56.4  | 1,665  | 21.0  | 5.4%  | 7.0%  | 94%\n2024  | 60.3  | 1,730  | 22.5  | 4.3%  | 3.5%  | 96%"
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Rebounding growth",
    "text": "The resettlement of war refugees and successful economic reform have led to a\nhigh natural increase rate: the average growth rate from 1993 to 1999 was\n6.7%; from 1997 to 1999, it averaged more than 10% per year. The devastating\nfloods of early 2000 slowed GDP growth to a 2.1%; estimates point to a full\nrecovery in 2001. The government projects have caused the economy to continue\nto expand between 7%-10% a year for the next 5 years, although rapid expansion\nin the future hinges on several major foreign investment projects, continued\neconomic reform, and the revival of the agriculture, transportation, and\ntourism sectors. More than 75% of the population engages in small scale\nagriculture, which still suffers from inadequate infrastructure, commercial\nnetworks and investment. Yet 88% of Mozambique's arable land is still\nuncultivated; focusing economic growth in this sector is a major challenge for\nthe government."
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Low inflation",
    "text": "The government's tight control of spending and the money supply, combined with\nfinancial sector reform, successfully reduced inflation from 70% in 1994 to\nless than 5% from 1998 to 1999. Rates spiked in 2000, however, to a rate of\n12.7% due to economic disruptions stemming from the devastating floods.\nStarting 2001 the inflation was in the range of 5% and 12%.\n\n2003 - 5.2%; 2004 - 7.5%; 2005 - 7.6%; 2006 - 11.8%; 2007 - 7.4%; 2008 - 8.4%;\n2009 - 4.2%; 2010 - 10.0%; 2011 - 11.1%"
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Extensive economic reform",
    "text": "Economic reform has been extensive. Over 1,200 state-owned enterprises (mostly\nsmall) have been privatized. Preparations for privatization and/or sector\nliberalization are underway for the remaining parastatals, including\ntelecommunications, electricity, water service, airports, ports, and the\nrailroads. The government frequently selects a strategic foreign investor when\nprivatizing a parastatal. Additionally, customs duties have been reduced, and\ncustoms management has been streamlined and reformed. The government\nintroduced a highly successful value-added tax in 1999 as part of its efforts\nto increase domestic revenues. Plans for 2001-02 include Commercial Code\nreform; comprehensive judicial reform; financial sector strengthening;\ncontinued civil service reform; improved government budget, audit, and\ninspection capability; and introduction of the private management of water\nsystems in major cities. The process of liberalization in Mozambique was an\ninitiative from the World Bank. In the Mid 1990s, the World Bank made it\nnecessary for the country to liberalize its cashew industry. The lifting of\nprotectionist measures for the cashew industry in Mozambique was an attempt to\nincrease the incomes of cashew farmers and reduce poverty in the country. This\npolicy of liberalization has been one of the most contentious\npolicies.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Improving trade imbalance",
    "text": "In recent years, the value of imports has surpassed that of exports by almost\n2:1, an improvement over the 4:1 ratio of the immediate post-war years. In\n2000 imports were $1,217 million, and exports were $723 million. Support\nprograms provided by development partners have largely compensated for balance\nof payments shortfalls. The medium-term outlook for exports is encouraging,\nsince a number of foreign investment projects should lead to substantial\nexport growth and a better trade balance. Mozal, a large aluminum smelter that\ncommenced production in mid-2000, has greatly expanded the nation's trade\nvolume. Traditional Mozambican exports include cashews, shrimp, fish, copra,\nsugar, cotton, tea, and citrus fruits. Most of these industries are being\nrehabilitated. Mozambique is becoming less dependent on imports for basic food\nand manufactured goods due to steady increases in local production."
  },
  {
    "chapter_name": "Economy of Mozambique",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Statistics",
    "text": "**GDP:** purchasing power parity - $39.16 billion (2018 est.)\n\n**GDP - real growth rate:** 3% (2017 est.)\n\n**GDP - per capita:** purchasing power parity - $1,327.9 (2018 est.)\n\n**GDP - composition by sector:**\n_agriculture:_ 22.3% (2017 est.)\n_industry:_ 23% (2017 est.)\n_services:_ 54.7% (2017 est.)\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ 1.9% (2008)\n_highest 10%:_ 36.7% (2008)\n\n**Distribution of family income - Gini index:** 47.3 (2002)\n\n**Inflation rate (consumer prices):** 15.3% (2017 est.)\n\n**Labor force:** 12.98 million (2017 est.)\n\n**Labor force - by occupation:** agriculture 74.4%, industry 3.9%, services\n21.7% (2017 est.)\n\n**Unemployment rate:** 24.5% (2017 est.)\n\n**Budget:**\n_revenues:_ $2.758 billion (2017 est.)\n_expenditures:_ $3.607 billion (2017 est.)\n\n**Industries:** food, beverages, chemicals (fertilizer, soap, paints),\naluminium, petroleum products, textiles, cement, glass, asbestos, tobacco\n\n**Industrial production growth rate:** 10.5% (2017 est.)\n\n**Electricity - production:** 19.58 billion kWh (2015 est.)\n\n**Electricity - consumption:** 13.86 billion kWh (2015 est.)\n\n**Electricity - exports:** 12.88 billion kWh (2015 est.)\n\n**Electricity - imports:** 10.55 billion kWh (2015 est.)\n\n**Oil - consumption:** 14,390 bbl/d (2,288 m3/d) (2006 est.)\n\n**Oil - proved reserves:** 0 bbl (0 m3) (1 January 2006 est.)\n\n**Natural gas - production:** 5.695 billion cu m (2015 est.)\n\n**Natural gas - consumption:** 1.895 billion cu m (2015 est.)\n\n**Natural gas - exports:** 3.8 billion cu m (2015 est.)\n\n**Natural gas - imports:** 0 cu m (2013 est.)\n\n**Natural gas - proved reserves:** 2.832 trillion cu m (1 January 2017 est.)\n\n**Agriculture - products:** cotton, cashew nuts, sugar cane, tea, cassava\n(tapioca), coconuts, sisal, citrus and tropical fruits; potatoes, sunflowers,\nbeef, poultry\n\n**Exports:** $4.773 billion (2017 est.)\n\n**Exports - commodities:** aluminum, prawns, cashews, cotton, sugar, citrus,\ntimber; bulk electricity\n\n**Exports - partners:** India 28.1%, Netherlands 24.4%, South Africa 16.7%\n(2017)\n\n**Imports:** $5.021 billion (2017 est.)\n\n**Imports - commodities:** machinery and equipment, vehicles, fuel, chemicals,\nmetal products, foodstuffs, textiles\n\n**Imports - partners:** South Africa 36.8%, China 7%, UAE 6.8%, India 6.2%,\nPortugal 4.4% (2017)\n\n**Debt - external:** $10.27 billion (31 December 2017 est.)\n\n**Currency:** 1 metical (Mt) = 100 centavos\n\n**Exchange rates:** meticais (MZM) per US dollar - 24.125 (2008 est.), 26.264\n(2007), 25.4 (2006)\n\n**Fiscal year:** calendar year"
  }
]