[
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Malaysia is an emerging and developing, upper-middle income,\nhighly industrialised, mixed economy. It ranks the 36th largest in the world\nin terms of nominal GDP, however, when measured by purchasing power parity,\nits GDP climbs to the 30th largest. Malaysia is forecasted to have a nominal\nGDP of nearly half a trillion US$ by the end of 2024. The labour productivity\nof Malaysian workers is the 62nd highest in the world and significantly higher\nthan China, Indonesia, Vietnam, and the Philippines.\n\nMalaysia excels above similar income group peers in terms of business\ncompetitiveness and innovation. Global Competitiveness Report 2024 ranks\nMalaysian economy as the 34th most competitive country economy in the world\nwhile Global Innovation Index 2024 ranks Malaysia as the 33rd most innovative\nnation globally.\n\nMalaysia is the 35th most trade intensive economy globally; higher than\nDenmark, Norway, Germany, and Sweden with total trade activities at 132% of\nits GDP. In addition, the Malaysian economy has developed vertical and\nhorizontal integration across several export linked industry while capturing a\nsignificant global market share for manufactured products and commodities\nranging from integrated circuit, semiconductor, and palm oil to liquefied\nnatural gas. Furthermore, Malaysia is an important nexus in the global\nsemiconductor market and is the third largest exporter of semiconductor\ndevices in the world. Malaysia has unveiled plan to target over US$100 billion\nin investment for its semiconductor industry as it positions itself as a\nglobal manufacturing hub.\n\nBy mid-2024, the country attracted large foreign direct investment centered on\nthe global artificial intelligence boom with foreign technology companies like\nGoogle, Microsoft and ByteDance flocked to the country and invested US$2\nbillion, US$2.2 billion, and US$2.1 billion, respectively, to capitalise on\nMalaysia's competitive advantage in the data center and hyperscale\nconstruction due to its highly educated workforce, cheap land acquisition, low\nwater and electricity cost, and the absence of natural disasters. This is\nexpected to consolidate Malaysia position as a cloud computing hub for wider\nAsia, increasing its high value sector and propel its economy to meet the\ngovernment high-income economy goal.\n\nOverall, the Malaysian economy is highly robust and diversified with the\nexport value of high-tech products in 2022 standing around US$66 billion, the\nthird highest in ASEAN. Malaysia exports the second largest volume and value\nof palm oil products globally, after Indonesia.\n\nMalaysians enjoy a relatively affluent lifestyle compared to many of its\nneighbours in Southeast Asia. This is due to a fast-growing export-oriented\neconomy, a relatively low national income tax, highly affordable local food\nand transport fuel, as well as a fully subsidized single-payer public\nhealthcare system. Malaysia has a newly industrialised market economy, which\nis relatively open and state-oriented.",
    "openai_summarised_points": [
      "• The economy of Malaysia is characterized as an emerging and developing, upper-middle income, highly industrialized, mixed economy.",
      "• Malaysia ranks as the 36th largest economy globally by nominal GDP, and 30th largest when measured by purchasing power parity (PPP).",
      "• By the end of 2024, Malaysia’s nominal GDP is forecasted to approach nearly half a trillion US dollars.",
      "• Malaysian labor productivity is ranked 62nd highest worldwide, significantly surpassing that of China, Indonesia, Vietnam, and the Philippines.",
      "• Malaysia outperforms peers within its income group in business competitiveness and innovation.",
      "• According to the Global Competitiveness Report 2024, Malaysia is ranked as the 34th most competitive economy globally.",
      "• The Global Innovation Index 2024 places Malaysia as the 33rd most innovative nation in the world.",
      "• Malaysia is the 35th most trade-intensive economy globally, with total trade activities amounting to 132% of its GDP, exceeding countries such as Denmark, Norway, Germany, and Sweden.",
      "• The Malaysian economy has developed both vertical and horizontal integration across multiple export-linked industries.",
      "• Malaysia holds significant global market shares in manufactured products and commodities including integrated circuits, semiconductors, palm oil, and liquefied natural gas.",
      "• Malaysia is a critical hub in the global semiconductor market, ranking as the third largest exporter of semiconductor devices worldwide.",
      "• The country has announced plans to attract over US$100 billion in investment for its semiconductor industry to establish itself as a global manufacturing hub.",
      "• By mid-2024, Malaysia attracted substantial foreign direct investment (FDI) driven by the global artificial intelligence boom.",
      "• Major foreign technology companies such as Google, Microsoft, and ByteDance invested US$2 billion, US$2.2 billion, and US$2.1 billion respectively in Malaysia.",
      "• These investments leverage Malaysia’s competitive advantages including a highly educated workforce, inexpensive land acquisition, low water and electricity costs, and absence of natural disasters.",
      "• Malaysia is expected to consolidate its position as a cloud computing hub for wider Asia, enhancing its high-value sectors and advancing its government’s high-income economy objectives.",
      "• The Malaysian economy is robust and diversified, with the export value of high-tech products reaching approximately US$66 billion in 2022, ranking third highest in ASEAN.",
      "• Malaysia is the world’s second largest exporter of palm oil products by volume and value, following Indonesia.",
      "• Malaysians enjoy a relatively affluent lifestyle compared to many Southeast Asian neighbors, attributed to a fast-growing export-oriented economy, relatively low national income tax, affordable local food and transport fuel, and a fully subsidized single-payer public healthcare system.",
      "• Malaysia’s economy is classified as a newly industrialized market economy that is relatively open and state-oriented."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:22:34.338212",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3003,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "As one of three countries that control the Strait of Malacca, international\ntrade plays a very significant role in Malaysia's economy. At one time, it was\nthe largest producer of tin, rubber and palm oil in the world. Manufacturing\nhas a large influence in the country's economy, accounting for over 40% of the\nGDP.\n\nIn the 1980s, Malaysia began to imitate the four Asian Tiger economies (Hong\nKong, Singapore, South Korea, and Taiwan) and committed itself to a transition\nfrom being reliant on mining and agriculture to an economy that depends more\non manufacturing. The predominantly mining and agricultural based Malaysian\neconomy began a transition towards a more multi-sector economy. Since the\n1980s the industrial sector has led Malaysia's growth. High levels of\ninvestment played a significant role in this. With Japanese investment, heavy\nindustries flourished and within several years, Malaysian exports became the\ncountry's primary growth engine. Malaysia consistently achieved more than 7%\nGDP growth along with low inflation in the 1980s and the 1990s.\n\nIn 1991, Prime Minister Mahathir Mohamad outlined his ideal, Vision 2020 in\nwhich Malaysia would become a self-sufficient industrialised nation by 2020.\nIn 2013, Minister in the Prime Minister's Department Tan Sri Nor Mohamed\nYakcop said Malaysia could attain developed country status in 2018 if the\ncountry's economic growth remains constant or increases. In 2023, the\nMalaysian government unveiled an industrial policy, the New Industrial Master\nPlan (NIMP) 2030, a guideline for the nation's manufacturing sector to grow\nand achieve macroeconomic targets, aiming for RM587.5 billion (from RM364.1\nbillion) contribution to Malaysia's GDP, 3.3 million (from 2.7 million)\nemployed persons and a median salary of RM4,510 (from RM1,976) by 2030.\n\nMalaysia experienced an economic boom and underwent rapid development during\nthe late 20th century and had a GDP per capita (nominal) of US$11,648.70 in\n2023, and is considered a newly industrialised country. In 2009, the GDP (PPP)\nwas US$378.5 billion and GDP per capita (PPP) was US$13,468.00, about one\nthird of the 2023 figures.\n\nIn 2022, the Household Income Survey undertaken by the government indicated\nthat there were 7.9 million households in Malaysia, with an average of 3.8\nmembers in each household. The average household income of Malaysia increased\nby 69.6% to RM8,479 a month, compared to RM5,000 in 2012.\n\nAccording to a HSBC report in 2012, Malaysia is expected to become the world's\n21st largest economy by 2050, with a GDP of $1.2 trillion (Year 2000 dollars)\nand a GDP per capita of $29,247 (Year 2000 dollars). The report also says \"The\nelectronic equipment, petroleum, and liquefied natural gas producer will see a\nsubstantial increase in income per capita. Malaysian life expectancy,\nrelatively high level of schooling, and above average fertility rate will help\nin its rapid expansion.\" Viktor Shvets, the managing director in Credit\nSuisse, has said \"Malaysia has all the right ingredients to become a developed\nnation.\"\n\nIn early 2020, the Malaysian economy was severely afflicted by the COVID-19\npandemic that eventually expanded to the rest of the world, causing an\neconomic shutdown and downturn in the country, the worst since 2008.[_citation\nneeded_] In early December 2020 during the pandemic, Fitch Ratings downgraded\nthe country's rating from A− to BBB+. Some, such as Hoo Ke Ping at the\nKingsley Strategic Institute, suggested that this was because of a lack of\ncommunication between the new government and the ratings agency. Others, such\nas Carmelo Ferlito, from the Centre for Market Education, said it might\nrequire something more substantial as the recent budget lacked a strategy for\nthe recovery as well as addressing the political tensions, and also, Shan\nSaeed at Juwai IQI suggested that the agency had lost its relevance as the\nanalysis was \"behind the curve\".[_citation needed_] However, the COVID-19\nrecession in the country ended by 1 April 2022 as the COVID-19 Omicron\ninfection rate continued to fall ahead of the endemic phase.",
    "openai_summarised_points": [
      "• Malaysia, as one of the three countries controlling the strategic Strait of Malacca, has an economy significantly influenced by international trade, historically being the world's largest producer of tin, rubber, and palm oil.",
      "• Manufacturing constitutes a major component of Malaysia’s economy, contributing over 40% to the country’s Gross Domestic Product (GDP).",
      "• In the 1980s, Malaysia emulated the economic development strategies of the Four Asian Tigers—Hong Kong, Singapore, South Korea, and Taiwan—shifting from a mining and agriculture-based economy to one focused on manufacturing and industrialization.",
      "• The transition in the 1980s marked a move towards a multi-sector economy, with the industrial sector becoming the primary driver of Malaysia’s economic growth, supported by substantial investment, particularly from Japan, which fostered the growth of heavy industries.",
      "• During the 1980s and 1990s, Malaysia consistently achieved GDP growth rates exceeding 7% annually, accompanied by low inflation rates.",
      "• In 1991, Prime Minister Mahathir Mohamad introduced Vision 2020, aiming for Malaysia to become a self-sufficient, fully industrialized nation by the year 2020.",
      "• In 2013, Tan Sri Nor Mohamed Yakcop, Minister in the Prime Minister’s Department, projected that Malaysia could attain developed country status by 2018, contingent on sustained or increased economic growth.",
      "• In 2023, the Malaysian government launched the New Industrial Master Plan (NIMP) 2030, an industrial policy designed to guide the manufacturing sector’s expansion with targets to increase its GDP contribution from RM364.1 billion to RM587.5 billion, raise employment from 2.7 million to 3.3 million persons, and boost the median salary from RM1,976 to RM4,510 by 2030.",
      "• Malaysia experienced rapid economic development and a boom in the late 20th century, achieving a nominal GDP per capita of US$11,648.70 in 2023, classifying it as a newly industrialized country.",
      "• In 2009, Malaysia’s GDP (Purchasing Power Parity) was US$378.5 billion with a GDP per capita (PPP) of US$13,468, approximately one-third of the 2023 nominal GDP per capita figure.",
      "• The 2022 Household Income Survey revealed that Malaysia had 7.9 million households with an average household size of 3.8 members, and the average monthly household income rose by 69.6% from RM5,000 in 2012 to RM8,479 in 2022.",
      "• A 2012 HSBC report forecasted Malaysia to become the world’s 21st largest economy by 2050, with a GDP of US$1.2 trillion and a GDP per capita of US$29,247 (both in Year 2000 dollars), attributing this growth to sectors such as electronic equipment, petroleum, and liquefied natural gas production.",
      "• The HSBC report also highlighted Malaysia’s relatively high life expectancy, above-average fertility rate, and elevated educational attainment as factors contributing to its rapid economic expansion.",
      "• Viktor Shvets, Managing Director at Credit Suisse, affirmed that Malaysia possesses all necessary elements to achieve developed nation status.",
      "• The Malaysian economy was severely impacted by the COVID-19 pandemic beginning in early 2020, resulting in an economic shutdown and the worst downturn since 2008.",
      "• In December 2020, Fitch Ratings downgraded Malaysia’s credit rating from A− to BBB+, with some analysts such as Hoo Ke Ping of the Kingsley Strategic Institute attributing the downgrade to poor communication between the new government and the ratings agency.",
      "• Other commentators, including Carmelo Ferlito from the Centre for Market Education, suggested the downgrade reflected a lack of a clear recovery strategy and unresolved political tensions, while Shan Saeed of Juwai IQI questioned the relevance of the ratings agency’s analysis, describing it as \"behind the curve.\"",
      "• The COVID-19 induced recession in Malaysia concluded by 1 April 2022, as the Omicron variant infection rates declined, signaling the transition towards the endemic phase of the pandemic."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:22:50.005472",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4091,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Monetary policy",
    "text": "Prior to the 1997 Asian Financial Crisis, the Malaysian Ringgit (MYR) was a\nfloating currency that traded at RM2.50 at the dollar. As speculative\nactivities spread across the region, the Ringgit fell to as much as RM4.10 to\nthe dollar in matter of weeks.\n\nAn executive decision led by the then Prime Minister Mahathir Mohamad decided\nto peg the MYR to the dollar and impose capital controls to prevent excessive\noutflow of the Ringgit in the open market. The Ringgit became was pegged at\nRM3.80 to the US dollar and a traveller had to declare to the central bank if\ntaking out more than RM10,000 out of the country and the Ringgit itself .\n\nThe fixed exchange rate was abandoned in favour of the floating exchange rate\nin July 2005, hours after China announced the same move. At this point, the\nRinggit was still not internationalised. The Ringgit continued to strengthen\nto 3.18 to the dollar by March 2008 and appreciated as low as 2.94 to the\ndollar in May 2011. Meanwhile, many aspects of capital control have been\nslowly relaxed by Bank Negara Malaysia. However, the government continues to\nnot internationalise the Ringgit. The government stated that the Ringgit will\nbe internationalised once it is ready.\n\nBank Negara Malaysia for the time being, uses interest rate targeting. The\nOvernight Policy Rate (OPR) is their policy instrument, and is used to guide\nthe short term interbank rates which will hopefully influence inflation and\neconomic growth.",
    "openai_summarised_points": [
      "• Prior to the 1997 Asian Financial Crisis, the Malaysian Ringgit (MYR) operated as a floating currency, trading at approximately RM2.50 to the US dollar.",
      "• During the crisis, speculative activities caused the Ringgit to depreciate sharply, falling to as low as RM4.10 to the US dollar within a matter of weeks.",
      "• In response, then Prime Minister Mahathir Mohamad made an executive decision to peg the MYR to the US dollar and implement capital controls to prevent excessive outflows of the Ringgit in the open market.",
      "• The Ringgit was officially pegged at a fixed rate of RM3.80 to the US dollar.",
      "• Under the capital control measures, travelers were required to declare to Bank Negara Malaysia if they intended to take out more than RM10,000 in Ringgit from the country.",
      "• The fixed exchange rate regime was maintained until July 2005, when it was abandoned in favor of a floating exchange rate system, coinciding with China’s announcement of a similar move.",
      "• At the time of the float in 2005, the Ringgit was still not internationalized, meaning it was not widely used or accepted outside Malaysia.",
      "• Following the reintroduction of the floating exchange rate, the Ringgit strengthened, reaching RM3.18 to the US dollar by March 2008 and appreciating further to as low as RM2.94 to the US dollar in May 2011.",
      "• Concurrently, Bank Negara Malaysia gradually relaxed many aspects of the capital controls imposed during the crisis period.",
      "• Despite these relaxations, the Malaysian government has maintained a policy of not internationalizing the Ringgit, stating that internationalization will occur only when the currency and economy are deemed ready.",
      "• Currently, Bank Negara Malaysia employs interest rate targeting as its primary monetary policy tool.",
      "• The central bank’s key policy instrument is the Overnight Policy Rate (OPR), which is used to guide short-term interbank interest rates.",
      "• The manipulation of the OPR aims to influence broader economic variables such as inflation and economic growth within Malaysia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:22:58.722187",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1458,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Affirmative action",
    "text": "Tun Abdul Razak, who was then Prime Minister, implemented the affirmative\naction policy named as New Economic Policy (NEP) soon after 13 May Incident in\n1969. Prior to the incident, the poverty rates among Malays were extremely\nhigh (65%) as was discontent between races, particularly towards the Chinese,\nwho controlled 74% of the economy at the time. Through NEP, the Bumiputeras\nmajority were given priority and special privileges in housing developments,\nscholarship admission and also for ownership of publicly listed companies.\n\nThe NEP was created in 1971 with the aim of bringing Malays a 30% share of the\neconomy of Malaysia and eradicating poverty amongst Malays, primarily through\nencouraging enterprise ownership by Bumiputeras. After 40 years of the\nprogram, bumiputra equity ownership rose to 23% worth RM167.7 billion in 2010\nagainst 2.4% in 1970.\n\nThe NEP was accused of creating an oligarchy, and creating a 'subsidy\nmentality'. Political parties such as Parti Keadilan Rakyat and Democratic\nAction Party proposed a new policy which will be equal for every Malaysian,\nregardless of race. When the Democratic Action Party was elected in the state\nof Penang in 2008, it announced that it would do away with the NEP, claiming\nthat it \"... breeds nepotism, corruption and systemic inefficiency\".\n\nWolfgang Kasper, a professor of economics at University of New South Wales,\nand once an adviser to Malaysia's Finance Ministry, criticized the NEP, saying\nthat \"NEP handouts (are) making Malays lazy, corrupt & swell-headed. Worst of\nall, it keeps them poor.\" He also criticized the Federal Government giving\ncash-handouts and financial aid instead of providing equal access to education\nto help the marginalized poor to lift their income status.\n\nOn 21 April 2009, the prime minister Najib Tun Razak announced the\nliberalization of 27 services sub-sector by abolishing the 30% bumiputera\nrequirement. The move was seen as a government effort to increase investment\nin the service sector of the economy. According to the premier, many more\nsectors of the economy would be liberalized.\n\nOn 30 June 2009, the prime minister announced further liberation moves\nincluding the dismantling of the Bumiputera equity quotas and repealing the\nguidelines of the Foreign Investment Committee, which was responsible to\nmonitor foreign shareholding in Malaysian companies. However, any Malaysian\ncompanies that wished to list in Malaysia would still need to offer 50 percent\nof public shareholding spread to Bumiputera investors.",
    "openai_summarised_points": [
      "• Tun Abdul Razak, then Prime Minister of Malaysia, implemented the affirmative action policy known as the New Economic Policy (NEP) shortly after the 13 May Incident in 1969.",
      "• Prior to the 1969 incident, poverty rates among Malays were extremely high at 65%, and there was significant racial discontent, particularly towards the Chinese community, which controlled 74% of the Malaysian economy at that time.",
      "• The NEP prioritized the Bumiputera majority by granting them special privileges in areas such as housing developments, scholarship admissions, and ownership of publicly listed companies.",
      "• Established in 1971, the NEP aimed to increase Malay economic participation to a 30% share of Malaysia’s economy and to eradicate poverty among Malays primarily by encouraging enterprise ownership by Bumiputeras.",
      "• After 40 years of the NEP, Bumiputera equity ownership had risen to 23%, valued at RM167.7 billion in 2010, compared to only 2.4% in 1970.",
      "• The NEP faced criticism for allegedly creating an oligarchy and fostering a \"subsidy mentality\" among beneficiaries.",
      "• Political parties such as Parti Keadilan Rakyat and the Democratic Action Party (DAP) proposed replacing the NEP with a new policy that would treat all Malaysians equally, regardless of race.",
      "• Upon its election in the state of Penang in 2008, the DAP announced its intention to abolish the NEP, arguing that it \"breeds nepotism, corruption and systemic inefficiency.\"",
      "• Wolfgang Kasper, a professor of economics at the University of New South Wales and former adviser to Malaysia’s Finance Ministry, criticized the NEP, stating that NEP handouts were causing Malays to become \"lazy, corrupt & swell-headed,\" and that the policy ultimately kept them poor.",
      "• Kasper also criticized the Federal Government’s approach of providing cash handouts and financial aid instead of ensuring equal access to education to help marginalized poor Malays improve their income status.",
      "• On 21 April 2009, Prime Minister Najib Tun Razak announced the liberalization of 27 service sub-sectors by abolishing the 30% Bumiputera ownership requirement, aiming to increase investment in Malaysia’s service sector.",
      "• Najib Tun Razak indicated that additional sectors of the economy would be liberalized following this initial move.",
      "• On 30 June 2009, further liberalization measures were announced, including dismantling Bumiputera equity quotas and repealing guidelines of the Foreign Investment Committee, which monitored foreign shareholding in Malaysian companies.",
      "• Despite these reforms, Malaysian companies wishing to list on the Malaysian stock exchange were still required to offer 50% of public shareholding to Bumiputera investors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:23:06.490458",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2524,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Subsidies and price controls",
    "text": "The Malaysian government subsidises and controls prices on many essential\nitems to keep the prices low. Prices of items such as palm oil, cooking oil,\npetrol, flour, bread, rice and other essentials have been kept under market\nprices to keep cost of living low. As of 2022, government expenditure on\nsubsidies stood at RM70.3 billion (US$15.96 billion), with fuel alone taking\nup RM52 billion (US$11.8 billion) or 74% of total subsidies.\n\nSince 2010, the government has been gradually reforming Malaysia's subsidy\nsystem, via a series of reductions in subsidies for fuel and sugar to improve\ngovernment finances and to improve economic efficiency. As a result, in\nDecember 2014, the government officially ended all fuel subsidies and\nimplemented a 'managed float' system, taking advantage of low oil prices at\nthe time, potentially saving the government almost RM20 billion ringgit\n(US$5.72 billion) annually.\n\nOn 10 June 2024, the Malaysian government ended the previously\nreimplementation of blanket subsidies on diesel fuel. Instead, a more\nselective, targeted subsidy was implemented, where cash assistance was\ndirectly disbursed to qualified individuals or fleet cards to eligible\nlogistics vehicles. Plans for removal of petrol subsidies have yet to be\nannounced but it is expected to take place in 2025. The withdrawal of said\nsubsidies will target the top 15% of income earners, while the remaining 85%\nwill continue to enjoy the status quo."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Sovereign wealth funds",
    "text": "The government owns and operates several sovereign wealth funds that invest in\nlocal companies and also foreign companies. One such fund is Khazanah Nasional\nBerhad, established in 1993, and as of 31 December 2023, had an asset size of\nRM126.2 billion (US$27.46 billion). The fund invests in major companies in\nMalaysia such as CIMB in the banking sector, UEM Group in the construction\nsector, Telekom Malaysia and Axiata in the communications industry, Malaysia\nAirports and Malaysia Airlines in the aerospace industry, as well as Tenaga\nNasional in the energy sector\n\nAnother fund owned by the Malaysian government is the Employees Provident\nFund, a retirement fund that as of 31 March 2024, had an asset size of RM1.19\ntrillion (US$251.61 billion), of which overseas investments account for 38% of\ntotal assets, making it the 4th largest pension fund in Asia and 13th largest\nin the world. Like Khazanah Nasional, EPF invests and owns several major\ncompanies in Malaysia such as RHB Bank. EPF investment is diversified over a\nnumber of sectors but almost 40% of their investment are in the services\nsector.\n\nPermodalan Nasional Berhad is another major fund manager controlled by the\nMalaysian Government. It offers capital guaranteed mutual funds such as Amanah\nSaham Bumiputera and Amanah Saham Wawasan 2020 which are open only to\nMalaysian and in some cases, Bumiputeras."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Government influence",
    "text": "Although the federal government promotes private enterprise and ownership in\nthe economy, the economic direction of the country is heavily influenced by\nthe government through five years development plans since independence. The\neconomy is also influenced by the government through agencies such as the\nEconomic Planning Unit and government-linked wealth funds such as Khazanah\nNasional Berhad, Employees Provident Fund and Permodalan Nasional Berhad.\n\nThe government's development plans, called the Malaysian Plan, currently the\nTwelfth Malaysia Plan, started in 1950 during the British colonial rule. The\nplans were largely centred around accelerating the growth of the economy by\nselectively investing in sectors of the economy and building infrastructure to\nsupport said sectors. For example, in the current national plan, three primary\naspects of the nation are being focused, consisting of strategies to energise\nand maintain economic empowerment, environmental sustainability and social\nreengineering.\n\nGovernment-linked investment vehicles such as Khazanah Nasional Berhad,\nEmployees Provident Fund and Permodalan Nasional Berhad invest in and own\ncompanies in major sectors of the Malaysian economy."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 46.3  | 3,337.8  | 26.8  | 1,927.0  | 7.4%  | 6.7%  | n/a  | n/a\n1981  | 54.3  | 3,813.0  | 27.3  | 1,920.1  | 6.9%  | 9.7%  | n/a  | n/a\n1982  | 61.0  | 4,182.4  | 29.3  | 2,006.5  | 5.9%  | 5.8%  | n/a  | n/a\n1983  | 67.4  | 4,505.6  | 32.7  | 2,189.6  | 6.3%  | 3.7%  | n/a  | n/a\n1984  | 75.2  | 4,908.0  | 37.1  | 2,419.5  | 7.8%  | 3.9%  | n/a  | n/a\n1985  | 76.9  | 4,862.0  | 34.1  | 2,154.5  | -0.9%  | 2.6%  | 6.9%  | n/a\n1986  | 79.4  | 4,883.2  | 30.3  | 1,864.0  | 1.2%  | 0.4%  | 8.3%  | n/a\n1987  | 85.7  | 5,139.6  | 34.5  | 2,070.0  | 5.4%  | 0.7%  | 8.2%  | n/a\n1988  | 97.6  | 5,708.0  | 37.8  | 2,213.9  | 9.9%  | 0.3%  | 8.1%  | n/a\n1989  | 110.6  | 6,316.4  | 41.7  | 2,380.5  | 9.1%  | 2.6%  | 6.7%  | n/a\n1990  | 125.1  | 6,846.2  | 47.2  | 2,585.8  | 9.0%  | 3.0%  | 5.1%  | 74.1%\n1991  | 141.6  | 7,636.5  | 53.5  | 2,885.1  | 9.5%  | 4.3%  | 4.3%  | 67.3%\n1992  | 157.7  | 8,272.5  | 64.5  | 3,380.2  | 8.9%  | 4.8%  | 3.7%  | 59.1%\n1993  | 177.5  | 9,053.0  | 72.9  | 3,717.4  | 9.9%  | 3.5%  | 3.0%  | 51.1%\n1994  | 197.9  | 9,827.3  | 81.1  | 4,028.4  | 9.2%  | 3.7%  | 2.9%  | 43.7%\n1995  | 222.0  | 10,731.8  | 96.6  | 4,672.1  | 9.8%  | 3.5%  | 3.1%  | 38.2%\n1996  | 248.6  | 11,715.0  | 109.9  | 5,176.3  | 10.0%  | 3.5%  | 2.5%  | 32.8%\n1997  | 271.4  | 12,469.0  | 108.8  | 4,997.0  | 7.3%  | 2.7%  | 2.4%  | 29.6%\n1998  | 254.3  | 11,386.4  | 78.6  | 3,520.9  | -7.4%  | 5.3%  | 3.2%  | 33.6%\n1999  | 273.7  | 11,946.7  | 86.2  | 3,762.8  | 6.1%  | 2.7%  | 3.4%  | 34.4%\n2000  | 304.2  | 12,945.8  | 102.1  | 4,347.7  | 8.7%  | 1.6%  | 3.1%  | 32.5%\n2001  | 312.6  | 12,959.3  | 101.1  | 4,189.1  | 0.5%  | 1.4%  | 3.7%  | 38.1%\n2002  | 334.6  | 13,532.2  | 109.8  | 4,441.8  | 5.4%  | 1.8%  | 3.5%  | 39.5%\n2003  | 361.0  | 14,256.3  | 120.0  | 4,740.3  | 5.8%  | 1.1%  | 3.6%  | 41.4%\n2004  | 395.8  | 15,278.8  | 135.9  | 5,244.9  | 6.8%  | 1.4%  | 3.6%  | 42.0%\n2005  | 428.5  | 16,184.8  | 150.4  | 5,678.7  | 5.0%  | 3.0%  | 3.6%  | 40.8%\n2006  | 466.4  | 17,383.1  | 170.5  | 6,355.0  | 5.6%  | 3.6%  | 3.3%  | 39.7%\n2007  | 509.2  | 18,789.4  | 202.9  | 7,485.9  | 6.3%  | 2.0%  | 3.2%  | 39.3%\n2008  | 544.0  | 19,711.4  | 242.1  | 8,771.0  | 4.8%  | 5.4%  | 3.3%  | 39.4%\n2009  | 539.2  | 19,202.1  | 212.0  | 7,550.3  | -1.5%  | 0.6%  | 3.7%  | 50.4%\n2010  | 586.8  | 20,525.5  | 258.8  | 9,054.1  | 7.5%  | 1.7%  | 3.3%  | 51.2%\n2011  | 630.7  | 21,701.7  | 302.6  | 10,413.7  | 5.3%  | 3.2%  | 3.1%  | 51.9%\n2012  | 677.6  | 22,963.3  | 319.2  | 10,815.1  | 5.5%  | 1.7%  | 3.0%  | 53.8%\n2013  | 701.7  | 23,224.6  | 328.1  | 10,858.4  | 4.7%  | 2.1%  | 3.1%  | 55.7%\n2014  | 745.4  | 24,273.0  | 343.1  | 11,172.4  | 6.0%  | 3.1%  | 2.9%  | 55.4%\n2015  | 750.8  | 24,074.1  | 301.4  | 9,663.3  | 5.0%  | 2.1%  | 3.2%  | 57.0%\n2016  | 783.9  | 24,779.9  | 301.9  | 9,544.2  | 4.5%  | 2.1%  | 3.5%  | 55.8%\n2017  | 829.3  | 25,897.2  | 319.2  | 9,969.5  | 5.8%  | 3.8%  | 3.4%  | 54.4%\n2018  | 890.2  | 27,491.3  | 359.0  | 11,086.1  | 4.8%  | 1.0%  | 3.3%  | 55.6%\n2019  | 946.1  | 29,091.6  | 365.3  | 11,231.5  | 4.4%  | 0.7%  | 3.3%  | 57.1%\n2020  | 904.6  | 27,760.7  | 337.6  | 10,361.3  | -5.5%  | -1.1%  | 4.5%  | 67.7%\n2021  | 971.3  | 29,702.4  | 373.0  | 11,407.7  | 3.1%  | 2.5%  | 4.7%  | 69.0%\n2022  | 1,096.5  | 33,112.7  | 434.1  | 13,107.9  | 5.4%  | 3.2%  | 4.5%  | 69.6%\n2023  | 1,185.3  | 35,353.6  | 467.5  | 13,942.6  | 4.4%  | 2.8%  | 4.3%  | 70.0%\n2024  | 1,269.7  | 37,416.1  | 503.1  | 14,826.0  | 4.9%  | 2.4%  | 4.2%  | 70.0%\n2025  | 1,350.5  | 39,335.8  | 539.6  | 15,717.8  | 4.4%  | 2.4%  | 4.2%  | 70.2%\n2026  | 1,437.2  | 41,395.7  | 577.2  | 16,623.9  | 4.4%  | 2.4%  | 4.2%  | 70.2%\n2027  | 1,522.7  | 43,387.1  | 615.0  | 17,523.6  | 3.9%  | 2.5%  | 4.2%  | 70.6%"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Currency",
    "text": "The only legal tender in Malaysia is the Malaysian ringgit. As of September\n2024, the ringgit traded at MYR 4.12 to the US dollar. This was a significant\nchange from the rate of MYR 4.80 to the dollar recorded in February 2024, an\nappreciation of 16.5%.\n\nThe ringgit is not internationalised. Since September 1998, due to the 1997\nAsian financial crisis in which then Prime Minister Mahathir Mohamad imposed\ncapital controls on the currency, due to speculative short-selling of the\nringgit. Due to a series of capital controls, the currency was pegged between\nSeptember 1998 and July 2005 at MYR 3.80 to the dollar after dropping from MYR\n2.50 to the dollar, and at one point, MYR 4.80 to the dollar.\n\nIn recent years, Bank Negara Malaysia has begun to relax certain rules on\ncapital controls, although the currency itself is still not traded\ninternationally. According to the Bank Governor, the ringgit will be\ninternationalised when it is ready.\n\nIn September 2010, in an interview with CNBC, Dato' Seri Najib Tun Razak, who\nwas then Prime Minister of Malaysia and also held the position of Finance\nMinister, said that the government was open to enabling the ringgit to\noffshore trading if the move would help the economy. He added that before such\na move could be made, it would ensure that rules and regulation were in place\nto avoid abuse of the currency."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Natural resources",
    "text": "Palm oil estate in Malaysia.\n\nMalaysia is well-endowed with natural resources in areas such as agriculture,\nforestry and minerals. It is an exporter of natural and agricultural\nresources, the most valuable exported resource being petroleum. In the\nagricultural sector, Malaysia is one of the top exporters of natural rubber\nand palm oil, which together with timber and timber products, cocoa, pepper,\npineapple and tobacco dominate the growth of the sector. As of 2023, the\npercentage arable land in Malaysia was 9.7%. Croplands consists of 17.49%\nwhile other land uses consists of 77.07%. As of 2009, irrigated land covered\n3,800 km2. Total renewable water resources made up 580 cubic km as of 2011.\n\nTin and petroleum are the two main mineral resources that are of major\nsignificance in the Malaysian economy. Malaysia was once the world's largest\nproducer of tin until the collapse of the tin market in the early 1980s. In\nthe 19th and 20th century, tin played a predominant role in the Malaysian\neconomy, with Malaysia accounting for over 31% of global output. It was only\nin 1972 that petroleum and natural gas took over from tin as the mainstay of\nthe mineral extraction sector. Other minerals of some importance or\nsignificance include copper, bauxite, iron-ore and coal together with\nindustrial minerals like clay, kaolin, silica, limestone, barite, phosphates\nand dimension stones such as granite as well as marble blocks and slabs. Small\nquantities of gold are produced.\n\nIn 2019, the country was the 11th largest world producer of manganese; the\n11th largest world producer of tin, the 12th largest world producer of\nbauxite, and the 19th largest world producer of lime."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Energy resources",
    "text": "Malaysia held proven oil reserves of 6.9 billion barrels as of January 2022,\nthe fourth-highest reserves in Asia-Pacific after China, India, and Vietnam.\nNearly all of Malaysia's oil comes from offshore fields. The continental shelf\nis divided into three producing basins: the basin offshore Eastern Peninsular\nMalaysia in the west and the Sarawak and Sabah basins in the east. Most of the\ncountry's oil reserves are located in the Peninsular basin and tend to be\nlight and sweet crude. Malaysia's benchmark crude oil, Tapis Blend, is a light\nand sweet crude oil, with an API gravity of 42.7° and a sulphur content of\n0.04% by weight.\n\nMalaysia held 87.8 trillion cubic feet (Tcf) of proven natural gas reserves as\nof 2021, and was the third-largest natural gas reserve holder in the Asia-\nPacific region after China and Indonesia. More than half of the country's\nnatural gas reserves are located in its eastern areas, predominantly offshore\nSarawak. Most of Malaysia's gas reserves are associated with oil basins,\nalthough Sarawak and Sabah have an increasing amount of non-associated gas\nreserves that have offset some of the declines from mature oil and gas basins\noffshore Peninsular Malaysia."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Business environment",
    "text": "In 2015, Malaysia's economy was one of the most competitive in the world,\nranking 14th in the world and 5th for countries with a population of over 20\nmillion, higher than countries like Australia, United Kingdom, South Korea and\nJapan.\n\nIn 2015, Malaysia was the 6th most attractive country for foreign investors,\nranked in the Baseline Profitability Index (BPI) published by Foreign Policy\nMagazine.\n\nThe government is moving towards a more business friendly environment by\nsetting up a special task force to facilitate business called PEMUDAH, which\nmeans \"simplifier\" in Malay. Highlights includes easing restrictions and\nrequirement to hire expatriates, shorten time to do land transfers and\nincreasing the limit of sugar storage (a controlled item in Malaysia) for\ncompanies.\n\nMalaysia was ranked 33rd in the Global Innovation Index in 2020, up from 35th\nin 2019."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Taxation",
    "text": "In 2016, the Inland Revenue Board of Malaysia lowered the effective tax rate\nto 24% for businesses with capital exceeding RM2.5 million (approximately\nUS$550,000). For smaller companies, the rate was 19%.\n\nThe Malaysian government also imposes government taxes such as the Sales and\nServices tax (SST) and real estate taxes. The current rate of SST is at 6%\nwhile disposal of property is subject to a schedule of period holding the\nproperty."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "External trade",
    "text": "In 2021, Malaysia's total external trade totaled RM2,227 billion\n(approximately US$530 billion), made up of RM1,239 billion (approximately\nUS$295 billion) of exports and RM987 billion (approximately US$235 billion) of\nimports, making Malaysia the world's 21st largest exporter and the world's\n25th largest importer.\n\nMalaysia's largest trading partner is China. Malaysia has been China's top\ntrading partner within ASEAN for five years in a row since 2008. The two-way\ntrade volume between China and Malaysia in 2013 reached $106 billion, making\nMalaysia China's third-largest trade partner in Asia, just behind Japan and\nSouth Korea and eighth largest overall. On 31 May 2014, during Najib Razak's\nvisit to China where he was welcomed by China's Premier Li Keqiang, China and\nMalaysia pledged to increase bilateral trade to US$160 billion by 2017. They\nalso agreed to upgrade economic and financial co-operation, especially in the\nproduction of halal food, water processing and railway construction.\n\nMalaysia's second largest trading partner is Singapore and Malaysia is\nSingapore's biggest trading partner, with bilateral trade totalling roughly\nUS$91 billion in 2012, accounting for over a fifth of total trade within\nASEAN.\n\nMalaysia's third largest trading partner is Japan, amounting RM137.45 billion\n(US$42 billion) of trade in 2014, an increase of 1.4% compared with to 2013.\nOut of this, exports totalled RM82.71 billion (US$25.6 billion), a growth of\n4.4% cent while imports contracted 2.9% to RM54.75 billion (US$16.74 billion).\nMalaysian Ambassador to Japan Datuk Ahmad Izlan Idris said the main exports\nfrom Malaysia to Japan were liquefied natural gas (LNG), electrical and\nelectronics as well as chemical-based products. He said Malaysia's main\nimports from Japan were electrical and electronics, machines and equipment as\nwell as spare parts and accessories for vehicles and cars.\n\nMalaysia is an important trading partner for the United States. In 1999, two-\nway bilateral trade between the US and Malaysia totalled US$30.5 billion, with\nUS exports to Malaysia totalling US$9.1 billion and US imports from Malaysia\nincreasing to US$21.4 billion. Malaysia was the United States' 10th-largest\ntrading partner and its 12th-largest export market. During the first half of\n2000, US exports totalled US$5 billion, while US imports from Malaysia reached\nUS$11.6 billion."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Statistics",
    "text": "Year  | Goods exports\n(billion US$) | Goods imports\n(in billion US$) | Net trade\n(in billion US$)\n---|---|---|---\n2023  | $231.4  | $201.5  | $30.0\n2020  | $186.1  | $153.2  | $32.8\n2015  | $174.6  | $146.7  | $27.9\n2010  | $187.3  | $148.9  | $28.4\n2005  | $141.6  | $108.7  | $33.0\n2000  | $98.2  | $77.5  | $20.7\n1990  | $28.8  | $26.3  | $2.5\n1980  | $13.0  | $10.6  | $2.3\n1975  | $3.8  | $3.6  | $0.2"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Agriculture sector",
    "text": "Rubber plantation in Malaysia\n\nAgriculture is now a minor sector of the Malaysian economy, accounting for\n7.1% of Malaysia's GDP in 2014 and employing 11.1% of Malaysia's labour force,\ncontrasting with the 1960s when agriculture accounted for 37% of Malaysia's\nGDP and employed 66.2% of the labour force. The crops grown by the\nagricultural sector has also significantly shifted from food crops like paddy\nand coconut to industrial crops like palm oil and rubber, which in 2005\ncontributed to 83.7% of total agricultural land use, compared to 68.5% in\n1960."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Palm Oil Industry",
    "text": "Despite its minor contribution to Malaysia's GDP, Malaysia has a significant\nfoothold in the world's agricultural sector, being the world's second largest\nproducer of palm oil in 2012 producing 18.79 million tonnes of crude palm oil\non roughly 5,000,000 hectares (19,000 sq mi) of land. Though Indonesia\nproduces more palm oil, Malaysia is the world's largest exporter of palm oil\nhaving exported 18 million tonnes of palm oil products in 2011.\n\nIn March 2019, the European Commission concluded that palm oil cultivation\nresults in excessive deforestation and its use in transport fuel should be\nphased out by 2030. In response, Mahathir Mohamad alleged that the European\nUnion is at risk of starting a trade war with Malaysia regarding its \"grossly\nunfair\" policies geared towards decreasing the use of palm oil, which Mahathir\nstated was \"unfair\" and an example of \"rich people...[trying] to impoverish\npoor people\".\n\nIn July 2024, Hong Wai Onn from the Research Institute for Sustainable\nExcellence and Leadership asserted that the European Union’s classification of\npalm oil as a high indirect land use change (ILUC) risk biofuel is flawed. He\ncalled for a reevaluation of ILUC factors to ensure more accurate carbon\nintensity measurements. He argued that ignoring this issue unfairly limits\npalm oil’s potential as a low ILUC-risk biofuel and its role in supporting\nglobal climate efforts."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Industry sector",
    "text": "Science policies in Malaysia are regulated by the Ministry of Science,\nTechnology, and Innovation. The country is one of the world's largest\nexporters of semiconductor devices, electrical devices, and IT and\ncommunication products.\n\nMalaysia's industrial sector accounts for 36.8%, over a third of the country's\nGDP in 2014, and employs 36% of the labour force in 2012. The industrial\nsector mostly contributed by the electronics industry, automotive industry and\nconstruction industry."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Electrical and electronics",
    "text": "The electrical & electronics (E&E) industry is the leading sector in\nMalaysia's manufacturing sector, contributing significantly to the country's\nexports and employment. The E&E industry produces 13% of global back-end\nsemiconductors, driving 40% of the nation's export output and contributing\nabout 5.8% to the GDP in 2023. Malaysia benefits from the global demand in the\nusage of mobile devices (smartphones, tablets), storage devices (cloud\ncomputing, data centers), optoelectronics (photonics, fibre optics, LEDs) and\nembedded technology (integrated circuits, PCBs, LEDs)."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.1.1",
    "section_name": "Electronic components",
    "text": "Products/activities which fall under this sub-sector include semiconductor\ndevices, passive components, printed circuits and other components such as\nmedia, substrates and connectors.\n\nWithin the electronic components sub-sector, the semiconductor devices is the\nleading contributor of exports for the E&E industry. Exports of semiconductor\ndevices were RM111.19 billion or 47% of the total E&E products exported in\n2013.\n\nMalaysia is a major hub for electrical component manufacturing, with factories\nof international companies like Intel, AMD, Freescale Semiconductor, ASE,\nInfineon, STMicroelectronics, Texas Instruments, Fairchild Semiconductor,\nRenesas, X-Fab and major Malaysian-owned companies such as Green Packet,\nSilterra, Globetronics, Unisem and Inari which have contributed to the steady\ngrowth of the semiconductor industry in Malaysia. To date, there are more than\n50 companies, largely MNCs producing semiconductors devices in Malaysia."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.1.2",
    "section_name": "Photovoltaics",
    "text": "Malaysia is a major hub for solar equipment manufacturing, with factories of\ncompanies like First Solar, Panasonic, TS Solartech, Jinko Solar, JA Solar,\nSunPower, Hanwha Q Cells, and SunEdison in locations like Kulim, Penang,\nMalacca, Cyberjaya and Ipoh.\n\nFirst Solar's factory in Kulim\n\nIn 2013, Malaysia's total production capacity for solar wafers, solar cells\nand solar panels totalled 4,042 MW. By 2014, Malaysia was the world's third\nlargest manufacturer of photovoltaics equipment, behind China and the European\nUnion.\n\nMany international companies have the majority of production capacity located\nin Malaysia, such as the American company First Solar which has over 2,000 MW\nof production capacity located in Kulim and only 280 MW located in Ohio, and\nformerly German-based Hanwha Q Cells which produces 1,100 MW worth of solar\ncells in Cyberjaya while producing only 200 MW worth of solar cells in\nGermany. SunPower's largest manufacturing facility with a capacity of 1,400 MW\nis also located in Malacca."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Automotive",
    "text": "The Proton Prevé, a car made by Malaysian car company Proton.\n\nThe automotive industry in Malaysia consists of 27 vehicle producers and over\n640 component manufacturers. The Malaysian automotive industry is the third\nlargest in Southeast Asia, and the 23rd largest in the world, with an annual\nproduction output of over 500,000 vehicles. The automotive industry\ncontributes 4% or RM 40 billion to Malaysia's GDP, and employs a workforce of\nover 700,000 throughout a nationwide ecosystem.\n\nThe Malaysian automotive industry is Southeast Asia's sole pioneer of\nindigenous car companies, namely Proton and Perodua. In 2002, Proton helped\nMalaysia become the 11th country in the world with the capability to fully\ndesign, engineer and manufacture cars from the ground up. The Malaysian\nautomotive industry also hosts several domestic-foreign joint venture\ncompanies, which assemble a large variety of vehicles from imported complete\nknock down (CKD) kits.\n\nMalaysia's first tech unicorn startup, automotive e-commerce platform Carsome,\nraised $290 million in a Series E funding round to expand its product,\ntechnology and infrastructure in Malaysia, Indonesia and Thailand. This latest\nfunding round values the used-car online marketplace at $1.7 billion."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.3",
    "section_name": "Construction",
    "text": "Penang Bridge\n\nMalaysia has a large construction industry of over RM102.2 billion (US$32\nbillion). The highest percentage share was contributed by construction of non-\nresidential buildings which recorded 34.6 per cent. This was followed by civil\nengineering sub-sector (30.6%), residential buildings (29.7%), and special\ntrades (5.1%).\n\nSelangor recorded the highest value of construction work done at 24.5% among\nthe states, followed by Johor at 16.5%, Kuala Lumpur at 15.8%, Sarawak at 8.6%\nand Penang at 6.4%. The contribution of these five states accounted for 71.8%\nof the total value of construction work in Malaysia.\n\nThe expansion of the construction industry has been catalysed by major capital\nexpenditure projects, and a key factor has been the government's Economic\nTransformation Programme (ETP) and public-private partnership (PPP) mega-\nprojects like Tun Razak Exchange, KVMRT and Iskandar Malaysia."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.4",
    "section_name": "Defence",
    "text": "A Kedah-class warship, with another unit being built in the background\n\nMalaysia has a relatively new defence industry that was created after the\ngovernment created the Malaysia Defence Industry Council to encourage local\ncompanies to participate in the country's defence sector in 1999.\n\nThe land sector of the defence industry is dominated by DefTech, a subsidiary\nof Malaysia's largest automotive manufacturer, DRB-HICOM. The company focuses\non manufacturing armoured vehicles and specialised logistics vehicles. The\ncompany has supplied ACV-15 infantry fighting vehicles to the Malaysian Army\nin the past and is currently supplying the DefTech AV8 amphibious multirole\narmoured vehicle to the Malaysian Army.\n\nThe sea sector of the defence industry is dominated by Boustead Heavy\nIndustries, who builds warships for the Royal Malaysian Navy (RMN) through\ntransfer of technology with foreign companies. The company has built 4 Kedah-\nclass offshore patrol vessels for the RMN in the past and is currently\nundertaking a project to build 6 more Second Generation Patrol Vessels for the\nRMN."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.5",
    "section_name": "Finance and banking",
    "text": "Headquarters of Maybank, Malaysia's largest bank\n\nKuala Lumpur has a large financial sector, and is ranked the 22nd in the world\nin the Global Financial Centres Index. There are currently 27 commercial banks\n(8 domestic and 19 foreign), 16 Islamic banks (10 domestic and 6 foreign), 15\ninvestment banks (all domestic) and 2 other financial institutions (both\ndomestic) operating in Malaysia.\n\nCommercial banks are the largest and most significant providers of funds in\nthe banking system. The largest banks in Malaysia's finance sector are\nMaybank, CIMB, Public Bank Berhad, followed by RHB Bank, Hong Leong Bank and\nAmBank.\n\nMalaysia is currently also the world's largest centre of Islamic Finance.\nMalaysia has 16 fully-fledged Islamic banks including five foreign ones, with\ntotal Islamic bank assets of US$168.4 billion, which accounts for 25% of the\nMalaysia's total banking assets. This in turn accounts for over 10% of the\nworld's total Islamic banking assets. In comparison, Malaysia's main rival\nUAE, has US$95 billion of assets.\n\nMalaysia is the global leader in terms of the sukuk (Islamic bond) market,\nissuing RM62 billion (US$17.74 billion) worth of sukuk in 2014 - over 66.7% of\nthe global total of US$26.6 billion Malaysia also accounts for around two-\nthirds of the global outstanding sukuk market, controlling $178 billion of\n$290 billion, the global total.\n\nThe Malaysian government is planning to transform the country's capital Kuala\nLumpur into a major financial centre in a bid to raise its profile and spark\ngreater international trade and investment through the construction of the Tun\nRazak Exchange (TRX). The government believes the project will allow Malaysia\nto compete with regional financial superpowers such as Singapore and Hong\nKong, by leveraging on the country's established strength in the rapidly\ngrowing Islamic financial marketplace.\n\nBased in Kuala Lumpur, Bursa Malaysia serves as the country's sole national\nstock exchange. Trading of shares started in 1960 and it is today one of the\nlargest bourses in Southeast Asia."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.6",
    "section_name": "Tourism",
    "text": "South Beach at Perhentian Besar\n\nTourism is a huge sector of the Malaysian economy, with 20.14 million tourists\ngenerating RM71.3 billion (US$15.5 billion) in tourist receipts in 2023, Total\ntourist receipts increased by 9% when compared to the 2013 figure of RM65.4\nbillion (US$20 billion).\n\nMalaysia is ranked 14th of the most visited country in the world in 2024 at\n26.1 million tourists.\n\nMalaysia is rich with diverse natural attractions which become an asset to the\ncountry's tourism industry. This was recognised by the World Travel & Tourism\nCouncil (WTTC), who declared Malaysia as \"a destination full of unrealised\npotential\" with the main strength as the availability of a vast range of\ndiverse attractions to suit all tastes relatively affordable prices and;\nlargely unspoilt destination.\n\nMalaysia's top tourist destinations are the Mulu Caves, Perhentian Islands,\nLangkawi, Petronas Towers and Mount Kinabalu."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.6.1",
    "section_name": "Medical tourism",
    "text": "Tuaran Hospital in Sabah\n\nMedical tourism is a significant sector of Malaysia's economy, with around\n850,000 individuals travelling to Malaysia specifically for medical treatments\nalone in 2022, contributing RM1.3 billion (US$295 million) in revenue to the\neconomy. This is down from pre-pandemic numbers of 1.2 million individuals and\na total contribution of RM1.7 billion (US$416 million) but the Malaysia\nHealthcare Travel Council (MHTC) already expects the figures to surpass by\n2024, with an expected revenue of RM2.4 billion (US$558 million).\n\nMalaysia is reputed as one of the most preferred medical tourism destinations\nwith modern private healthcare facilities and highly efficient medical\nprofessionals. In 2014, Malaysia was ranked the world's best destination for\nmedical tourism by the Nomad Capitalist. Malaysia was also included in the top\n10 medical tourism destinations list by CNBC.\n\nIn 2014, Prince Court Medical Centre, a Malaysian hospital, was ranked the\nworld's best hospital for medical tourists by MTQUA. MHTC announced that two\nMalaysian Hospitals were recognised in the Newsweek & Statista's World's Best\nHospitals 2024, Gleneagles Kuala Lumpur and Sunway Medical Centre."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "9.7",
    "section_name": "Oil and gas",
    "text": "Petronas petrol station in Thailand\n\nMalaysia has a vibrant oil and gas industry. The national oil company,\nPetronas was ranked 216th in the Fortune 500 list in 2022, generating revenue\nof over RM171 billion (US$36.5 billion) and possessing total assets of over\nRM798 billion (US$169 billion) in the first half of 2024. Petronas accounted\nfor more than 20% of the Malaysian government's revenue from 2018 to 2023. The\nMalaysian government has been actively cutting down on its reliance of\npetroleum with an expected contribution of approximately RM32 billion (around\nUS$7 billion) from Petronas and RM64 billion (US$13.9 billion) from petroleum-\nderived revenues, with the latter figure down from RM69.8 billion (US$15.2\nbillion).\n\nPetronas is also the custodian of oil and gas reserves for Malaysia. Hence,\nall oil and gas activities are regulated by Petronas. Malaysia encourages\nforeign oil company participation through production sharing contracts, in\nwhich significant amount of oil will be given away to the foreign oil company\nuntil it reaches a production milestone. Currently, many major oil companies\nsuch as ExxonMobil, Royal Dutch Shell, Nippon Oil, and Murphy Oil are involved\nin such contracts. As a result, 40% of oil fields in Malaysia are developed.\n\nThere are over 3,500 oil and gas (O&G) businesses in Malaysia comprising\ninternational oil companies, independents, services and manufacturing\ncompanies that support the needs of the O&G value chain both domestically and\nregionally. Many major global machinery & equipment (M&E) manufacturers have\nset up bases in Malaysia to complement home-grown M&E companies, while other\nMalaysian oil and gas companies are focused on key strategic segments such as\nmarine, drilling, engineering, fabrication, offshore installation and\noperations and maintenance (O&M)."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Infrastructure",
    "text": "Malaysia's infrastructure is one of the most developed in Asia. In 2016,\nMalaysia was ranked 18th out of 140 countries in the World Economic Forum's\nGlobal Competitiveness Report, the highest among of all developing economies\nin Asia. Its telecommunications network is second only to Singapore's in\nSoutheast Asia, with 4.5 million fixed-broadband subscribers, 8.4 million\nfixed-line subscribers and 50.1 million cellular subscribers in 2023. The\ncountry has 7 international ports, the major one being the Port Klang. There\nare 200 industrial parks along with specialised parks such as Technology Park\nMalaysia and Kulim Hi-Tech Park. Fresh water is available to over 95% of the\npopulation. During the colonial period, development was mainly concentrated in\neconomically powerful cities and in areas forming security concerns. Although\nrural areas have been the focus of great development, they still lag behind\nareas such as those in the west coast of Peninsular Malaysia. The\ntelecommunication network, although strong in urban areas, is less available\nto the rural population."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.1",
    "section_name": "Energy",
    "text": "Bakun Dam under construction in 2009\n\nMalaysia's energy infrastructure sector is largely dominated by Tenaga\nNasional, the largest electric utility company in Southeast Asia, with over\nRM99.03 billion in assets. Customers are connected to electricity through the\nNational Grid, with more than 420 transmission substations in the Peninsular\nlinked together by approximately 11,000 km of transmission lines operating at\n132, 275 and 500 kilovolts.\n\nIn 2013, Malaysia's total power generation capacity was over 29,728 MW. Total\nelectricity generation was 140,985.01 GWh and total electricity consumption\nwas 116,087.51 GWh.\n\nEnergy production in Malaysia is largely based on oil and natural gas, owing\nto Malaysia's oil reserves and natural gas reserves, which is the fourth\nlargest in Asia-Pacific after China, India and Vietnam.\n\nMalaysia has also significant renewable energy resources and has high\npotential for the development of large-scale solar power and it has one of the\nmost advanced legal frameworks in the ASEAN region for promoting renewables.\nThe country set a 20% target of renewable energy in its energy mix by 2025 and\nto achieve this the government will need to improve its renewable energy\ngovernance, investment policy and market entry for foreign investors as well\nto develop a framework for easier grid connection and use. As of 2021,\nMalaysia is one of the major producers of solar panels for the international\nmarket, but paradoxically it has yet to fully capitalize on this for domestic\nelectricity generation."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.1.1",
    "section_name": "Road network",
    "text": "The North–South Expressway, the longest highway in Malaysia\n\nMalaysia's road network is one of the most comprehensive in Asia and covers\napproximately 280,000 kilometres (173,984 mi).\n\nThe main national road network is the Malaysian Federal Roads System, which\nspans over 41,930 km (26,050 mi). Most of the federal roads in Malaysia are\n2-lane roads. In town areas, federal roads may become 4-lane roads to\naccommodate to increased traffic. Nearly all federal roads are paved with\ntarmac except parts of the Skudai–Pontian Highway which is paved with\nconcrete, while parts of the Federal Highway linking Klang to Kuala Lumpur, is\npaved with asphalt.\n\nMalaysia has approximately 5,027 kilometres (3,124 mi) of highways and the\nlongest highway, the North–South Expressway, extends 772 kilometres (480 mi)\non the West Coast of Peninsular Malaysia, connecting major urban centres like\nKuala Lumpur and Johor Bahru. The Pan-Borneo Highway, which connects Sabah and\nSarawak on Borneo Island of East Malaysia, is undergoing a major upgrade to\ndual carriageway since 2015. A total of 1,663 kilometres (1,033 mi) of the\nroad length is being reconstructed, bringing the standard of East Malaysian\nhighways to the same level of quality of Peninsular highways."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.1.2",
    "section_name": "Rail network",
    "text": "There is currently more than 2,900 kilometres (1,800 mi) of railway in\nMalaysia, 767 km (477 mi) are double tracked and electrified.\n\nRail transport in Malaysia comprises heavy rail (KTM), light rapid transit and\nmonorail (Rapid Rail), and a funicular railway line (Penang Hill Railway).\nHeavy rail is mostly used for intercity passenger and freight transport as\nwell as some urban public transport, while LRTs are used for intra-city urban\npublic transport. There two commuter rail services linking Kuala Lumpur with\nthe Kuala Lumpur International Airport. The sole monorail line in the country\nis also used for public transport in Kuala Lumpur, while the only funicular\nrailway line is in Penang. A rapid transit project, the KVMRT, is currently\nunder construction to improve Kuala Lumpur's public transport system.\n\nThe railway network covers most of the 11 states in Peninsular Malaysia. In\nEast Malaysia, only the state of Sabah has railways. The network is also\nconnected to the Thai railway 1,000 mm (3 ft 3+3⁄8 in) network in the north.\nIf the Burma Railway is rebuilt, services to Myanmar, India, and China could\nbe initiated."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.1.3",
    "section_name": "Air network",
    "text": "Kuala Lumpur International Airport\n\nMalaysia has 118 airports, of which 38 are paved. Most of the airports are\nmanaged by Malaysia Airports Holdings Berhad (MAHB). The national airline is\nMalaysia Airlines, providing international and domestic air services. Major\ninternational routes and domestic routes crossing between West Malaysia and\nEast Malaysia are served by Malaysia Airlines and AirAsia while smaller\ndomestic routes are supplemented by smaller airlines like MASwings, Firefly\nand Berjaya Air. Major cargo airlines include MASkargo and Transmile Air\nServices.\n\nKuala Lumpur International Airport (KLIA) is the main and busiest airport of\nMalaysia. In 2019, it was the world's 12th busiest airport by international\npassenger traffic, recording over 44.8 million international passengers. In\n2023, it was the world's 35th busiest airport by passenger traffic, recording\nover 47.2 million passengers. As of 2024, KLIA is the second most connected\nairport globally, following London Heathrow Airport and preceding Haneda\nAirport in terms of international connectivity.\n\nOther major airports include Kota Kinabalu International Airport, which is\nalso Malaysia's second busiest airport and busiest airport in East Malaysia\nwith over 9 million passengers in 2019, and Penang International Airport, with\napproximately 6.8 million passengers in 2023."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.1.4",
    "section_name": "Sea network",
    "text": "Port Klang\n\nMalaysia is strategically located on the Strait of Malacca, one of the most\nimportant shipping lanes in the world. Boasting a highly developed maritime\nshipping sector, Malaysia has been ranked by UNCTAD as the fifth-best linked\ncountry in the world, in terms of shipping trade route connectivity, better\nthan the developed economies of Germany and the Netherlands.\n\nMalaysia has 2 ports that are listed in the top 20 busiest ports in the world,\nPort Klang and Port of Tanjung Pelepas, which are respectively the second and\nthird busiest ports in Southeast Asia after the Port of Singapore.\n\nPort Klang is Malaysia's busiest port, and the 12th busiest port in the world,\nhandling over 14 million TEUs. Port of Tanjung Pelepas is Malaysia's second\nbusiest port, and the 16th busiest port in the world, handling over 10.4\nmillion TEUs."
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.2",
    "section_name": "International trade agreements",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed. _( March 2021)__(Learn how\nand when to remove this message)_\n---|---\nEconomy  | Agreement  | Abbreviation  | Concluded  | Signed  | Effective  | Legal Text\n---|---|---|---|---|---|---\nJapan | Malaysia–Japan Economic Partnership Agreement  | MJEPA  | 13 December 2005  | 13 December 2005  | 13 July 2006  | [1] Archived 8 March 2022 at the Wayback Machine\nPakistan | Malaysia–Pakistan Closer Economic Partnership Agreement  | MPCEPA  | 8 November 2007  | 8 November 2007  | 1 January 2008  | [2] Archived 7 February 2022 at the Wayback Machine\nNew Zealand | Malaysia–New Zealand Free Trade Agreement  | MNZFTA  | 30 May 2009  | 26 October 2009  | 1 August 2010  | [3] Archived 26 June 2022 at the Wayback Machine\nIndia | Malaysia–India Comprehensive Economic Cooperation Agreement  | MICECA  |  | 18 February 2011  | 1 July 2011  | [4] Archived 4 April 2022 at the Wayback Machine\nChile | Malaysia–Chile Free Trade Agreement  | MCFTA  | May 2010  | 13 November 2010  | 25 February 2012  | [5] Archived 8 March 2022 at the Wayback Machine\nAustralia | Malaysia–Australia Free Trade Agreement  | MAFTA  | 30 March 2012  |  | 1 January 2013  | [6] Archived 21 June 2022 at the Wayback Machine\nTurkey | Malaysia–Turkey Free Trade Agreement  | MTFTA  | 15 January 2014  | 17 April 2014  | 1 August 2015  | [7] Archived 24 March 2022 at the Wayback Machine\nChina | ASEAN–China Free Trade Agreement  | ATFTA  |  | November 2002  | 1 January 2010  | [8] Archived 11 April 2022 at the Wayback Machine\nJapan | ASEAN–Japan Comprehensive Economic Partnership Agreement  | AJCEP  |  | 14 April 2008  | 1 February 2009  | [9] Archived 11 April 2022 at the Wayback Machine\nSouth Korea | ASEAN–Korea Free Trade Agreement  | AKFTA  |  |  | 1 January 2010  | [10] Archived 7 February 2022 at the Wayback Machine\nIndia | ASEAN–India Free Trade Agreement  | AIFTA  |  | 13 August 2009  | 1 January 2010  | [11] Archived 21 June 2022 at the Wayback Machine\nAustralia\nNew Zealand | ASEAN–Australia-New Zealand Free Trade Area Agreement  | AANZFTA  |  | 27 February 2009  | 1 January 2010  | [12] Archived 17 June 2022 at the Wayback Machine\nHong Kong | ASEAN–Hong Kong Free Trade Agreement  | AHKFTA  |  | 12 November 2017  | 13 October 2019  | [13] Archived 11 April 2022 at the Wayback Machine\nASEAN\nChina\nJapan\nSouth Korea\nAustralia\nNew Zealand | Regional Comprehensive Economic Partnership | RCEP  |  | 15 November 2020  | 18 March 2022  | [14] Archived 26 November 2020 at the Wayback Machine"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "10.3",
    "section_name": "Trade agreements under negotiation",
    "text": "* Malaysia-EFTA Economic Partnership Agreement since 2012\n* Malaysia–European Union Free Trade Agreement (MEUFTA)\n* Trans-Pacific Partnership Agreement (TPP)\n* Trade Prefential System-Organisation of Islamic Conference (TPS-OIC)\n* Developing Eight (D-8) Preferential Tariff Agreement (PTA)"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Investments",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( April 2022)_\n---|---\n\nMalaysia's total accumulated investments in 2014 was RM235.9 billion, with\n72.6 per cent (RM171.3 billion) being contributed by domestic sources and 27.4\nper cent (RM64.6 billion) coming from foreign sources.\n\nAccording to A.T. Kearney, a global management consulting firm, Malaysia was\nranked 15th in the 2014 Foreign Direct Investment Confidence Index, 9th in\n2012, 16th in 2007 and 21st in 2010. The index assesses the impact of\npolitical, economic and regulatory changes on the FDI intentions and\npreferences of the leaders of top companies around the world.\n\nRank\n2007 | Rank\n2010 | Rank\n2012 | Rank\n2014 | Country | FDI Confidence\nIndex\n---|---|---|---|---|---\n3 | 2 | 4 | 1 |  United States | 2.16\n1 | 1 | 1 | 2 |  China | 1.95\n– | 9 | 20 | 3 |  Canada | 1.93\n4 | 10 | 8 | 4 |  United Kingdom | 1.91\n6 | 4 | 3 | 5 |  Brazil | 1.91\n10 | 5 | 5 | 6 |  Germany | 1.84\n5 | 3 | 2 | 7 |  India | 1.81\n11 | 7 | 6 | 8 |  Australia | 1.76\n7 | 24 | 7 | 9 |  Singapore | 1.75\n8 | 13 | 17 | 10 |  France | 1.74\n20 | 11 | 15 | 11 |  United Arab Emirates | 1.74\n19 | 8 | – | 12 |  Mexico | 1.72\n18 | – | 11 | 13 |  South Africa | 1.70\n– | – | 22 | 14 |  Switzerland | 1.68\n16 | 21 | 10 | 15 |  Malaysia | 1.65\n– | – | – | 16 |  Sweden | 1.64\n– | – | – | 17 |  Chile | 1.64\n- | – | 24 | 18 |  Spain | 1.63\n– | – | 21 | 19 |  Japan | 1.62\n– | – | – | 20 |  Italy | 1.61\n12 | – | 16 | 21 |  Belgium | 1.61\n6 | 6 | 23 | 22 |  Netherlands | 1.61\n– | – | 18 | 23 |  Denmark | 1.61\n13 | – | 19 | 24 |  Turkey | 1.60\n18 | 23 | 13 | 25 |  Indonesia | 1.60"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "11.1",
    "section_name": "Fortune Global 500",
    "text": "Malaysia has 1 company that rank in the Fortune Global 500 ranking for 2022.\n\nWorld Rank  | Company  | Industry  | Sales ($M)  | Profits ($M)  | Assets ($M)  | Employees\n---|---|---|---|---|---|---\n216  | Petronas | Oil and gas | 59,873  | 10,091  | 152,498  | 46,884"
  },
  {
    "chapter_name": "Economy of Malaysia",
    "chapter_id": "1",
    "section_number": "11.2",
    "section_name": "Forbes Global 2000",
    "text": "Malaysia has 8 companies that rank in the Forbes Global 2000 ranking for 2022.\n\nWorld rank | Company | Industry | Sales\n(billion $) | Profits\n(billion $) | Assets\n(billion $) | Market value\n(billion $)\n---|---|---|---|---|---|---\n485 | Maybank | Banking | 9.2 | 2.0 | 213.2 | 24.7\n837 | Tenaga Nasional | Utilities | 12.7 | 0.883 | 43.8 | 11.8\n751 | Public Bank Berhad | Banking | 4.5 | 1.4 | 111.1 | 21.2\n895 | CIMB Group Holdings | Banking | 5.7 | 1.0 | 149.3 | 12.2\n1525 | RHB Capital | Banking | 2.6 | 0.631 | 69.5 | 5.7\n1641 | Hong Leong Financial Group | Business services & supplies | 1.9 | 0.567 | 66.7 | 5.1\n1448 | Top Glove | Health care equipment & services | 3.6 | 1.6 | 3.1 | 10.8\n1236 | Petronas Chemicals | Chemicals | 5.6 | 1.8 | 11.5 | 19.1"
  }
]