[
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| The **factual accuracy** of parts of this article (those related to table)\n**may be compromised due to out-of-date information**. Please help update this\narticle to reflect recent events or newly available information. _( November\n2010)_  \n---|---  \n  \nThe **economy ofLiechtenstein** is based on industry, with a small but\nsignificant agricultural sector, and services (especially general services,\nincluding tourism and information technology). The country participates in a\ncustoms union with Switzerland and uses the Swiss franc as its national\ncurrency. It imports more than 85% of its energy requirements. Liechtenstein\nhas been a member of the European Free Trade Association (EFTA) since 1991\n(previously its interests had been represented by Switzerland). It also has\nbeen a member of the European Economic Area (EEA) since May 1995 and\nparticipates in the Schengen Agreement for passport-free intra-European\ntravel.",
    "openai_summarised_points": [
      "• The economy of Liechtenstein is primarily based on industry, complemented by a small but significant agricultural sector and a service sector that notably includes tourism and information technology.",
      "• Liechtenstein participates in a customs union with Switzerland and uses the Swiss franc as its official national currency.",
      "• The country imports more than 85% of its energy requirements, indicating a high dependency on external energy sources.",
      "• Liechtenstein has been a member of the European Free Trade Association (EFTA) since 1991; prior to this, its interests within EFTA were represented by Switzerland.",
      "• Since May 1995, Liechtenstein has been a member of the European Economic Area (EEA), facilitating economic integration with the European Union.",
      "• The country also participates in the Schengen Agreement, allowing for passport-free travel within participating European countries.",
      "• A note from November 2010 indicates that some parts of the article, particularly those related to tables, may contain outdated information and require updating to reflect recent events or newly available data."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:35.470607",
      "openai_model": "gpt-4.1-mini",
      "content_length": 927,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Liechtenstein's historical customs union with Austria was dissolved in 1919. A\ncustoms treaty was signed in 1923 and since its entering into force in 1924,\nLiechtenstein and Switzerland have been in a customs union with each other and\nas such the borders between the two countries are open. The German village\nBüsingen am Hochrhein and the Italian village Campione d'Italia also form part\nof this customs union (the latter albeit in a _de facto_ manner), which is\noften referred to as the _Swiss customs area_.\n\nLiechtenstein utilizes the Swiss franc as its national currency. Swiss border\npolice and customs officers secure its frontier with Austria. Currently there\nare 21 Swiss border guards stationed in Liechtenstein and 20 Austrian border\nguards securing its border (as of 2011).\n\nLiechtenstein is a member of EFTA, and joined the European Economic Area (EEA)\nin 1995 in order to benefit from the EU internal market. The capitalist\neconomy and tax system make Liechtenstein a safe, trustworthy and success-\noriented place for private and business purposes, especially with its highly\nmodern, internationally laid-out infrastructure and close connections to\nSwitzerland.\n\nIn the last half century, Liechtenstein has developed from a mainly\nagricultural state to one of the most highly industrialized countries in the\nworld.",
    "openai_summarised_points": [
      "• Liechtenstein's historical customs union with Austria was dissolved in 1919, ending their previous economic arrangement.",
      "• In 1923, Liechtenstein signed a customs treaty with Switzerland, which came into force in 1924, establishing a customs union between the two countries.",
      "• Since 1924, Liechtenstein and Switzerland have maintained an open border due to their customs union, facilitating free movement of goods and people.",
      "• The German village Büsingen am Hochrhein and the Italian village Campione d'Italia are also included in this customs union, with Campione d'Italia participating in a de facto manner; this entire arrangement is commonly referred to as the Swiss customs area.",
      "• Liechtenstein uses the Swiss franc as its official national currency, aligning its monetary system closely with Switzerland.",
      "• Swiss border police and customs officers are responsible for securing Liechtenstein’s frontier with Austria, reflecting the close cooperation between the two countries.",
      "• As of 2011, there were 21 Swiss border guards stationed in Liechtenstein and 20 Austrian border guards securing the border between Liechtenstein and Austria.",
      "• Liechtenstein is a member of the European Free Trade Association (EFTA), integrating it into a broader regional economic framework.",
      "• In 1995, Liechtenstein joined the European Economic Area (EEA) to gain access to the European Union’s internal market, enhancing its economic opportunities.",
      "• The country’s capitalist economy and favorable tax system contribute to its reputation as a safe, trustworthy, and success-oriented location for both private individuals and businesses.",
      "• Liechtenstein benefits from a highly modern, internationally oriented infrastructure and maintains close economic and political ties with Switzerland.",
      "• Over the last fifty years, Liechtenstein has transformed from a predominantly agricultural economy into one of the most highly industrialized countries globally, marking significant economic development and diversification."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:43.517646",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1328,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Foreign trade",
    "text": "An office of the Hilti Corporation in Hong Kong pictured in March 2010, an\nexample of Liechtenstein's export economy\n\nBesides its efficient industry, there also is a strong services sector. Four\nout of ten employees work in the services sector, a relatively high proportion\nof whom are foreigners, including those who commute across the border from\nneighboring Switzerland, Austria and Germany. Industrial exports more than\ndoubled in 20 years from $1.21 billion (SFr. 2.2 billion) in 1988 to $2.9\nbillion (SFr. 4.6 billion) in 2008. Some 15.7% of Liechtenstein goods are\nexported to Switzerland, 62.6% to the EU and 21.1% to the rest of the\nworld.[_citation needed_]\n\nThe United States has been the most important export market for Liechtenstein\nin recent times, totaling $561 million (SFr. 876 million); Germany is second,\nwith $479 million (SFr. 748 million) worth of imports, and Switzerland third,\nwith $375 million (SFr. 587 million).\n\nAbout 32% of the country's revenues are invested in research and development,\none of the driving forces of the success of Liechtenstein's economy. Total R&D\nspending in 2000 rose by 20.7% to approximately $140 million (213 million\nfrancs).",
    "openai_summarised_points": [
      "• Liechtenstein's economy features a strong services sector alongside its efficient industrial base, with four out of ten employees working in services, a significant proportion of whom are foreigners, including cross-border commuters from Switzerland, Austria, and Germany.",
      "• Industrial exports from Liechtenstein more than doubled over a 20-year period, increasing from $1.21 billion (SFr. 2.2 billion) in 1988 to $2.9 billion (SFr. 4.6 billion) in 2008.",
      "• The distribution of Liechtenstein’s exports by destination is approximately 15.7% to Switzerland, 62.6% to the European Union (EU), and 21.1% to the rest of the world.",
      "• In recent years, the United States has been the most important export market for Liechtenstein, with exports totaling $561 million (SFr. 876 million).",
      "• Germany ranks as the second largest export market for Liechtenstein, importing goods worth $479 million (SFr. 748 million).",
      "• Switzerland is the third largest export destination for Liechtenstein, with imports valued at $375 million (SFr. 587 million).",
      "• Approximately 32% of Liechtenstein’s national revenues are allocated to research and development (R&D), which is a key factor driving the country’s economic success.",
      "• In the year 2000, total R&D expenditure in Liechtenstein increased by 20.7%, reaching approximately $140 million (213 million Swiss francs)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:50.201195",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1181,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Banking and finance",
    "text": "National Bank of Liechtenstein\n\nThe Principality of Liechtenstein also is known as an important financial\ncentre, primarily because it specializes in financial services for foreign\nentities. The country's low tax rate, loose incorporation and corporate\ngovernance rules, and traditions of strict bank secrecy have contributed\nsignificantly to the ability of financial intermediaries in Liechtenstein to\nattract funds from outside the country's borders. The same factors made the\ncountry attractive and vulnerable to money launderers, although late 2009\nlegislation has strengthened regulatory oversight of illicit funds transfers.\n\nLiechtenstein has chartered 17 banks, three non-bank financial companies, and\n71 public investment companies, as well as insurance and reinsurance\ncompanies. Its 270 licensed fiduciary companies and 81 lawyers serve as\nnominees for, or manage, more than 73,000 entities (primarily corporations,\ninstitutions, or trusts), partly for non-Liechtenstein residents. About one-\nthird of these entities hold the controlling interest in other entities,\nchartered in countries other than Liechtenstein. The Principality's laws\npermit the corporations it charters to issue bearer shares. Until recently,\nthe Principality's banking laws permitted banks to issue numbered accounts,\nbut new regulations require strict know-your-customer practices for all new\naccounts.",
    "openai_summarised_points": [
      "• The Principality of Liechtenstein is recognized as a significant financial centre, mainly due to its specialization in financial services catering to foreign entities.",
      "• Liechtenstein's appeal as a financial hub is largely attributed to its low tax rates, lenient incorporation and corporate governance regulations, and a longstanding tradition of strict bank secrecy.",
      "• These factors have enabled financial intermediaries in Liechtenstein to attract substantial funds from outside the country's borders.",
      "• The same characteristics that made Liechtenstein attractive to legitimate financial activities also rendered it vulnerable to money laundering activities.",
      "• In response to these vulnerabilities, legislation enacted in late 2009 enhanced regulatory oversight concerning illicit funds transfers within the country.",
      "• Liechtenstein has a financial sector comprising 17 chartered banks, three non-bank financial companies, and 71 public investment companies, alongside insurance and reinsurance firms.",
      "• The country hosts 270 licensed fiduciary companies and 81 lawyers who act as nominees or managers for over 73,000 entities, which include primarily corporations, institutions, or trusts.",
      "• A significant portion of these entities managed in Liechtenstein are for non-residents of the country.",
      "• Approximately one-third of these entities hold controlling interests in other entities that are chartered outside of Liechtenstein.",
      "• Liechtenstein’s corporate laws allow the corporations it charters to issue bearer shares, a feature that has implications for ownership transparency.",
      "• Until recently, Liechtenstein’s banking laws permitted banks to offer numbered accounts, which provided anonymity to account holders.",
      "• New regulatory measures now mandate strict know-your-customer (KYC) procedures for all newly opened bank accounts, replacing the previous allowance for numbered accounts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:57.801288",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1387,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Taxation",
    "text": "Silver coin: 5 kronen of Liechtenstein, 1904, the front of the coin is a\nportrait of Johann II\n\nLiechtenstein's standard rate of VAT (Mehrwertsteuer) is identical to\nSwitzerland's for it must mirror the latter's continually and is currently\n7.7%. The reduced rate is 2.5%. A special rate of 3.7% is in use in the hotel\nindustry.\n\nIn July 2015, Liechtenstein and Switzerland signed a new agreement on double\ntaxation, which took effect in December 2016, superseding the previous one\nfrom 1995. Some differences on the withholding tax arose, but Switzerland did\nnot agree to introduce this practice to residents of Liechtenstein working in\nSwitzerland.\n\nIn November 2016, the parliament of the principality decided with a large\nmajority to introduce an agreement of automatic information exchange with 27\nnew treaty partners, including Switzerland. Data collection will start in\n2018, and effectual exchange of account information is planned for 2019.",
    "openai_summarised_points": [
      "• The silver coin of Liechtenstein from 1904, denominated as 5 kronen, features a portrait of Johann II on its front side.",
      "• Liechtenstein's standard rate of Value Added Tax (VAT), known locally as Mehrwertsteuer, is set to mirror Switzerland's rate continuously and is currently fixed at 7.7%.",
      "• The principality applies a reduced VAT rate of 2.5% on certain goods and services.",
      "• A special VAT rate of 3.7% is specifically applied within the hotel industry in Liechtenstein.",
      "• In July 2015, Liechtenstein and Switzerland signed a new double taxation agreement, which came into effect in December 2016, replacing the previous agreement established in 1995.",
      "• The updated double taxation agreement introduced some differences regarding withholding tax; however, Switzerland did not consent to implement withholding tax on residents of Liechtenstein who work in Switzerland.",
      "• In November 2016, the parliament of Liechtenstein overwhelmingly approved an agreement to participate in automatic exchange of financial information with 27 new treaty partners, including Switzerland.",
      "• The data collection under this automatic information exchange agreement was scheduled to commence in 2018.",
      "• The effective exchange of account information between Liechtenstein and its treaty partners was planned to begin in 2019."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:06.511674",
      "openai_model": "gpt-4.1-mini",
      "content_length": 949,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Statistics",
    "text": "* **GDP (PPP):** $4.826 billion (2009)\n* **GDP – real growth rate:** 3.8% (2008)\n* **GDP (PPP) – per capita:** purchasing power parity – $141,100 (2008)\n* **Inflation rate (consumer prices):** 0.7% (2011)\n* **Labor force:** 35,440 of whom about 10,440 are natives 7,550 are foreigners; 17,450 commute from Austria, Switzerland, and Germany to work each day (2008)\n* **Labor force – by occupation:** agriculture: 8%; industry: 41%; services: 51% (31 December 2008)\n* **Unemployment rate:** 1.9% (December 2020)\n* **Currency:** Swiss franc (CHF)\n* **Exchange rates:** Swiss francs per US dollar – 1.3467 (2003), 1.5586 (2002), 1.6876 (2001), 1.6888 (2000), 1.5022 (1999)\n* **Fiscal year:** calendar year",
    "openai_summarised_points": [
      "• Liechtenstein's Gross Domestic Product based on Purchasing Power Parity (GDP PPP) was $4.826 billion in 2009.",
      "• The real GDP growth rate of Liechtenstein was recorded at 3.8% in 2008.",
      "• The GDP (PPP) per capita, reflecting purchasing power parity, was exceptionally high at $141,100 in 2008.",
      "• The inflation rate, measured by consumer prices, stood at a low 0.7% in 2011.",
      "• The total labor force in Liechtenstein was 35,440 in 2008, comprising approximately 10,440 native workers and 7,550 foreign workers.",
      "• Additionally, 17,450 individuals commuted daily from neighboring Austria, Switzerland, and Germany to work in Liechtenstein as of 2008.",
      "• The labor force distribution by occupation as of 31 December 2008 was 8% in agriculture, 41% in industry, and 51% in services.",
      "• The unemployment rate in Liechtenstein was notably low at 1.9% in December 2020.",
      "• The official currency of Liechtenstein is the Swiss franc (CHF).",
      "• Historical exchange rates of Swiss francs per US dollar were: 1.3467 in 2003, 1.5586 in 2002, 1.6876 in 2001, 1.6888 in 2000, and 1.5022 in 1999.",
      "• Liechtenstein’s fiscal year corresponds to the calendar year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:12.859091",
      "openai_model": "gpt-4.1-mini",
      "content_length": 701,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "State budget",
    "text": "* **revenues:** $420.8 million\n* **expenditures:** $420.1 million, including capital expenditures of $NA (2000 est.)",
    "openai_summarised_points": [
      "• The state budget of Liechtenstein in the year 2000 reported total revenues amounting to $420.8 million.",
      "• Total expenditures for the same period were recorded at $420.1 million.",
      "• The expenditures figure includes capital expenditures; however, the exact value for capital expenditures was not available (denoted as $NA) in the 2000 estimate."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:15.822818",
      "openai_model": "gpt-4.1-mini",
      "content_length": 116,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Industries",
    "text": "The principal industries are electronics, metal manufacturing, textiles,\nceramics, pharmaceuticals, food products, precision instruments, and tourism.\n\n* **Industrial production growth rate:** N/A",
    "openai_summarised_points": [
      "• The principal industries in Liechtenstein include electronics, metal manufacturing, textiles, ceramics, pharmaceuticals, food products, precision instruments, and tourism.",
      "• No specific data is provided regarding the industrial production growth rate for Liechtenstein."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:17.760427",
      "openai_model": "gpt-4.1-mini",
      "content_length": 196,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Electricity",
    "text": "* **production by source**[_citation needed_]\n* _fossil fuel:_ 3,330 MWh (3.12%)\n* _hydro:_ 76,166 MWh (94.2%)[_citation needed_]\n* _nuclear:_ none (0%)\n* _solar/wind:_ 1,361 MWh (2.68%)[_citation needed_]\n* **Electricity – production:** 80,105 MWh (2010)\n* **Electricity – consumption:** about 350,645 MWh (2010)\n* **Electricity – exports:** none\n* **Electricity – imports:** about 270,540 MWh (2010)",
    "openai_summarised_points": [
      "• In 2010, Liechtenstein's total electricity production amounted to 80,105 MWh.",
      "• The production of electricity by source in Liechtenstein in 2010 was predominantly hydroelectric, accounting for 76,166 MWh or 94.2% of total production.",
      "• Fossil fuels contributed 3,330 MWh to electricity production, representing 3.12% of the total output in 2010.",
      "• Solar and wind energy sources combined produced 1,361 MWh, which constituted 2.68% of the total electricity production in 2010.",
      "• Nuclear energy was not used for electricity production in Liechtenstein, contributing 0% in 2010.",
      "• The total electricity consumption in Liechtenstein in 2010 was approximately 350,645 MWh.",
      "• Liechtenstein did not export any electricity in 2010.",
      "• To meet its consumption needs, Liechtenstein imported about 270,540 MWh of electricity in 2010."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:11:22.779185",
      "openai_model": "gpt-4.1-mini",
      "content_length": 401,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Agriculture",
    "text": "* **Products**\n* wheat, barley, corn, potatoes; livestock, dairy products"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.5",
    "section_name": "Exports",
    "text": "* **Commodities:** small specialty machinery, dental products, stamps, hardware, pottery\n* **Partners:** EU 62.6%, Others 21.1% (Germany, the US, the UK, France, Italy, Austria, Taiwan and Japan), Switzerland 15.7% as of (2008)"
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.6",
    "section_name": "Imports",
    "text": "* **Commodities:** agricultural products, raw materials, machinery, metal goods, textiles, foodstuffs, motor vehicles\n* **Partners:** member states of the European Union, Switzerland, Germany and the US."
  },
  {
    "chapter_name": "Economy of Liechtenstein",
    "chapter_id": "1",
    "section_number": "5.7",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nLiechtenstein is Services with 7,666 companies followed by Finance, Insurance,\nand Real Estate and Unknown industry with 5,240 and 3,104 companies\nrespectively."
  }
]