[
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofSamoa** is dependent on agricultural exports, development aid\nand private financing from overseas. The country is vulnerable to devastating\nstorms, earthquakes, tsunamis. Agriculture employs two-thirds of the labor\nforce, and furnishes 9% of exports, featuring coconut cream, coconut oil and\ncopra. Outside a large automotive wire harness factory, the manufacturing\nsector mainly processes agricultural products. Tourism is an expanding sector;\nmore than 70,000 tourists visited the islands in 1996 and 120,000 in 2014. The\nSamoan Government has called for[_when?_] deregulation of the financial\nsector, encouragement of investment, and continued fiscal discipline.\nObservers point to the flexibility of the labor market as a basic strength\nfactor for future economic advances.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Trade",
    "text": "Unloading a lighter at Apia Wharf, around 1975–1985.\n\nNew Zealand is Samoa's principal trading partner, typically providing between\n35% and 40% of imports and purchasing 45%–50% of exports. Australia, American\nSamoa, the United States, and Fiji are also important trading partners. Its\nmain imports are food and beverages, industrial supplies, and fuels. The\nprimary sector (agriculture, forestry, and fishing) employs nearly two-thirds\nof the labor force and produces 17% of GDP. Samoa's principal exports are\nrefined petroleum, fish, and coconut products.\n\nFishing has had some success in Samoan waters, but the biggest fisheries\nindustry (headed by Van Camp and StarKist) has been based in American Samoa.\nStarKist Management announced that it was going ahead with setting up at Asau\na blast-freezer project to be operational by 2002. This announcement dispelled\na growing suspicion about the genuine motives of StarKist to move to Samoa.\nThe proposed blast-freezer operations in Asau were expected to bring this\nvillage back to life.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Non-conventional sources of revenue",
    "text": "Samoa annually receives important financial assistance from abroad. More than\n100,000 Samoans who live overseas provide two sources of revenue. Their direct\nremittances have amounted to $12.1 million per year recently, and they account\nfor more than half of all tourist visits. In addition to the expatriate\ncommunity, Samoa also receives roughly $28 million annually in official\ndevelopment assistance from sources led by China, Japan, Australia, and New\nZealand. These three sources of revenue—tourism, private transfers, and\nofficial transfers—allow Samoa to cover its persistently large trade\ndeficit.[_citation needed_]\n\nIn the late 1960s, Potlatch Forests, Inc. (a US company), upgraded the harbour\nand airport at Asau on the northern coast of Savai'i and established a timber\noperation, Samoa Forest Products, for harvesting tropical hardwoods. Potlatch\ninvested about US$2,500,000 in a state-of-the-art sawmill and another\nUS$6,000,000 over several years to develop power, water, and haul roads for\ntheir facility. Asau, with the Potlatch sawmillers and Samoa Forest Products,\nwas one of the busiest parts of Savai'i in the 1960s and 1970s; however, the\ndeparture of Potlatch and the scaling down of the sawmill has left Asau a\nghost town in recent years.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Samoa produced in 2018:\n\n* 180 thousand tons of coconut;\n* 25 thousand tons of taro;\n* 22 thousand tons of banana;\n* 6.6 thousand tons of yam;\n* 4.6 thousand tons of pineapple;\n* 4.1 thousand tons of mango (including mangosteen and guava);\n* 3.4 thousand tons of papaya;\n\nIn addition to smaller productions of other agricultural products."
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Manufacturing",
    "text": "Until 2017 industry accounted for over one-quarter of GDP while employing less\nthan 6% of the work force. The largest industrial venture was Yazaki Samoa, a\nJapanese-owned company processing automotive wire harnesses for export to\nAustralia under a concessional market-access arrangement. The Yazaki plant\nemployed more than 2,000 workers and made up over 20% of the manufacturing\nsector's total output. Net receipts amounted to between $1.5 million and $3.03\nmillion annually, although shipments from Yazaki was counted as services\n(export processing) and therefore did not officially appear as merchandise\nexports. Yazaki Samoa closed down in 2017, but in the same year Fero, a New\nZealand manufacturer producing wiring units, set up in Samoa in the same plant\nused by Yazaki."
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Natural disasters",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( March 2021)_\n---|---\n\nThe effects of three natural disasters in the early 1990s were overcome by the\nmiddle of the decade, but economic growth cooled again with the regional\neconomic downturn. Long-run development depends upon upgrading the tourist\ninfrastructure, attracting foreign investment, and further diversification of\nthe economy.[_citation needed_]\n\nTwo major cyclones hit Samoa at the beginning of the 1990s. Cyclone Ofa left\nan estimated 10,000 islanders homeless in February 1990; Cyclone Val caused 13\ndeaths and hundreds of millions of dollars in damage in December 1991. As a\nresult, gross domestic product declined by nearly 50% from 1989 to 1991. These\nexperiences and Samoa's position as a low-lying island state punctuate its\nconcern about global climate change.[_citation needed_]\n\nFurther economic problems occurred in 1994 with an outbreak of taro leaf\nblight and the near collapse of the national airline Polynesian Airlines.\nTaro, a root crop, traditionally was Samoa's largest export, generating more\nthan half of all export revenue in 1993. But a fungal blight decimated the\nplants, and in each year since 1994 taro exports have accounted for less than\n1% of export revenue. Polynesian Airlines reached a financial crisis in 1994,\nwhich disrupted the tourist industry and eventually required a government\nbailout.[_citation needed_]\n\nThe government responded to these shocks with a major program of road building\nand post-cyclone infrastructure repair. Economic reforms were stepped up,\nincluding the liberalization of exchange controls.[_citation needed_] GDP\ngrowth rebounded to over 6% in both 1995 and 1996 before slowing again at the\nend of the decade."
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Future prospects",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( March 2021)_\n---|---\n\nThe collapse of taro exports in 1994 has had the unintended effect of modestly\ndiversifying Samoa's export products and markets. Prior to the taro leaf\nblight, Samoa's exports consisted of taro ($1.1 million), coconut cream\n($540,000), and \"other\" ($350,000). Ninety percent of exports went to the\nPacific region, and only 1% went to Europe. Forced to look for alternatives to\ntaro, Samoa's exporters have dramatically increased the production of copra,\ncoconut oil, and fish. These three products, which combined to produce export\nrevenue of less than $100,000 in 1993, now account for over $3.8 million.\nThere also has been a relative shift from Pacific markets to European ones,\nwhich now receive nearly 15% of Samoa's exports. Samoa's exports are still\nconcentrated in coconut products ($2.36 million worth of copra, copra meal,\ncoconut oil, and coconut cream) and fish ($1.51 million) but are at least\nsomewhat more diverse than before.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Tourism",
    "text": "In 1972 more than 85,000 visitors arrived in Samoa, contributing over $12\nmillion to the local economy. One-third came from American Samoa, 28% from New\nZealand, and 11% from the United States. Arrivals increased in 2000, as\nvisitors to the South Pacific avoided the political strife in Fiji by\ntraveling to Samoa instead.[_citation needed_]\n\nTourism numbers and revenue more than doubled in the decade 2007–2016. Samoa\nreceived 122,000 visitors in 2007 and 145,176 visitors in 2016. About 46% came\nfrom New Zealand, 20% from Australia and 7% from the United States. Samoans\nliving overseas accounted for about 33% of all tourist numbers. [_page\nneeded_]\n\nResponding to the COVID-19 pandemic in 2020, Samoa banned all international\nflights, inbound and outbound.\n\nThe service sector accounts for more than half of GDP and employs\napproximately 30% of the labor force."
  },
  {
    "chapter_name": "Economy of Samoa",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Statistics",
    "text": "Samoa electricity production by source\n\n**Gdp:** purchasing power parity – US$1.137 billion (2017 est.)\n\n**GDP – real growth rate:** 2.5% (2017 est.)\n\n**GDP – per capita:** purchasing power parity – $5,700 (2017 est.)\n\n**GDP – composition by sector:** (2017 est.)\n_agriculture:_ 10.4%\n_industry:_ 23.6%\n_services:_ 66%\n\n**Population below poverty line:** NA%\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ NA%\n_highest 10%:_ NA%\n\n**Inflation rate (consumer prices):** 1.3% (2017 est.)\n\n**Labor force:** 50,700 (2016 est.)\n\n**Labor force – by occupation::** (2015 est.)\n_agriculture:_ 65%\n_industry:_ 6%\n_services:_ 29%\n\n**Unemployment rate:** 5.2% (2017 est.)\n\n**Ease of Doing Business Rank:** 98th\n\n**Budget:**\n_revenues:_ $110 million\n_expenditures:_ $122 million (2011–12)\n\n**Industries:** tourism, food processing, auto parts, building materials\n\n**Industrial production growth rate:** 5,3% (2010 est.)\n\n**Electricity – production:** 200 GWh (2010)\n\n**Electricity – production by source:**\n_fossil fuel:_ 60%\n_hydro:_ 40%\n_nuclear:_ 0%\n_other:_ 0% (2008)\n\n**Electricity – consumption:** 150 GWh (2008)\n\n**Electricity – exports:** 1 kWh (2008)\n\n**Electricity – imports:** 0 kWh (2008)\n\n**Agriculture – products:** coconuts, bananas, taro, yams, coffee, cocoa\n\n**Exports:** $152 million (f.o.b., 2012)\n\n**Exports – commodities:** coconut oil and cream, copra, fish, beer\n\n**Exports – partners:** American Samoa, Australia, New Zealand, United States,\nGermany\n\n**Imports:** $258 million (f.o.b., 2012)\n\n**Imports – commodities:** machinery and equipment, foodstuffs\n\n**Imports – partners:** Australia, New Zealand, Japan, Fiji, United States\n\n**Debt – external:** $145 million (2010 est.)\n\n**Economic aid – recipient:** $24.3 million (2010)\n\n**Currency:** 1 tala (WS$) = 100 sene\n\n**Exchange rates:** tala (WS$) per US$1 – 3.0460 (January 2000), 3.0120\n(1999), 2.9429 (1998), 2.5562 (1997), 2.4618 (1996), 2.4722 (1995)\n\n**Fiscal year:** calendar year"
  }
]