[
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Part of a series on the  \n---  \nHistory of Cambodia  \nEarly history  \n  \n  * Funan\n  * Chenla\n  * Khmer Empire\n    * Angkor\n    * Khmer–Cham wars\n    * Đại Việt–Khmer War\n\n  \nPost-Angkor period  \n  \n  * Chaktomuk era\n  * Longvek era\n  * Siamese-Cambodian War\n  * Cambodian–Spanish War\n  * Cambodian–Dutch War\n  * Siamese annexation\n  * Oudong era\n  * Loss of Mekong Delta\n  * Dai Viet invasion\n\n  \nColonial period  \n  \n  * French protectorate\n    * French Indochina\n  * Japanese occupation (Cambodia in 1945)\n\n  \nIndependence and conflict  \n  \n  * Post-independence\n    * US bombing\n    * Sihanouk Trail\n    * Cambodian campaign\n    * 1970 coup\n\n  * Khmer Republic\n    * US bombing\n  * Cambodian Civil War\n    * Fall of Phnom Penh\n\n  * Democratic Kampuchea\n    * _Mayaguez_ incident\n    * Cambodian genocide\n  * Cambodian–Vietnamese War\n  * People's Republic of Kampuchea\n    * exiled coalition government\n    * K5 Plan\n\n  \nPeace process  \n  \n  * Cambodian Conflict (1979–1998)\n  * 1991 Paris Peace Agreements\n  * United Nations Administration (UNTAC) (1992-1993)\n  * 1993 election\n  * Khmer Rouge PGNUNSC\n\n  \nModern Cambodia  \n  \n  * Economy\n  * 1997 coup\n  * Khmer Rouge Tribunal\n  * 2003 Phnom Penh riots\n  * Cambodian–Thai border dispute\n  * 2013–2014 protests\n  * COVID-19 pandemic\n\n  \nBy topic  \n  \n  * Buddhism\n  * Economic history\n  * Humanitarian crisis\n  * Military history\n  * Monarchy\n  * Names\n\n  \n  \n  * **Timeline**\n\n  \nCambodia portal  \n  \n  * v\n  * t\n  * e\n\n  \n  \nCambodia's economy that currently follows an open market system (market\neconomy) and has seen rapid economic progress in the last decade. Cambodia had\na gross domestic product (GDP) of $28.54 billion in 2022. Per capita income,\nalthough rapidly increasing, is low compared with most neighboring countries.\nCambodia's two largest industries are textiles and tourism, while agricultural\nactivities remain the main source of income for many Cambodians living in\nrural areas. The service sector is heavily concentrated on trading activities\nand catering-related services. Recently, Cambodia has reported that oil and\nnatural gas reserves have been found offshore. In recent years, illicit\neconomic activities like cyber scam center operations have become an\nincreasingly prominent of Cambodia's economy, representing as much as 40% of\nCambodia's official GDP in 2024.\n\nIn 1995, with a GDP of $2.92 billion the Cambodian government transformed the\ncountry's economic system from a planned economy to its present market-driven\nsystem. Following those changes, growth was estimated at a value of 7% while\ninflation dropped from 26% in 1994 to only 6% in 1995. Imports increased due\nto the influx of foreign aid, and exports, particularly from the country's\ngarment industry, also increased. Cambodia's economic growth translated to\nabout 0.71% for the ASEAN economy in 2016.\n\nAfter four years of improving economic performance, Cambodia's economy slowed\nin 1997–1998 due to the 1997 Asian financial crisis, civil unrest, and\npolitical infighting. Foreign investments declined during this period. Also,\nin 1998 the main harvest was hit by drought. But in 1999, the first full year\nof relative peace in 30 years, progress was made on economic reforms and\ngrowth resumed at 4%.\n\nCurrently, Cambodia's foreign policy focuses on establishing friendly borders\nwith its neighbors (such as Thailand and Vietnam), as well as integrating\nitself into regional (ASEAN) and global (WTO) trading systems. Some of the\nobstacles faced by this emerging economy are the need for a better education\nsystem and the lack of a skilled workforce; particularly in the poverty-ridden\ncountryside, which struggles with inadequate basic infrastructure.\nNonetheless, Cambodia continues to attract investors because of its low wages,\nplentiful labor, proximity to Asian raw materials, and favorable tax\ntreatment.",
    "openai_summarised_points": [
      "• Cambodia's economy operates under an open market system, also known as a market economy, and has experienced rapid economic growth over the past decade.",
      "• In 2022, Cambodia's gross domestic product (GDP) was valued at $28.54 billion.",
      "• Despite rapid increases in per capita income, it remains relatively low compared to most neighboring countries.",
      "• The two largest industries in Cambodia are textiles and tourism.",
      "• Agriculture remains the primary source of income for many rural Cambodians.",
      "• The service sector is heavily focused on trading activities and catering-related services.",
      "• Recently, offshore oil and natural gas reserves have been discovered, contributing to potential future economic development.",
      "• Illicit economic activities, such as cyber scam centers, have become increasingly prominent, accounting for as much as 40% of Cambodia's official GDP in 2024.",
      "• In 1995, Cambodia's GDP was $2.92 billion, and the government transitioned from a planned economy to a market-driven system.",
      "• Post-1995 reforms led to an estimated economic growth rate of 7%, with inflation decreasing from 26% in 1994 to 6% in 1995.",
      "• Foreign aid influx contributed to increased imports and exports, notably from the garment industry.",
      "• Cambodia's economic growth contributed approximately 0.71% to the ASEAN economy in 2016.",
      "• The economy slowed during 1997–1998 due to the Asian financial crisis, civil unrest, and political infighting, leading to a decline in foreign investments and a drought that affected harvests in 1998.",
      "• In 1999, after four years of instability, economic reforms resumed, and growth recovered to 4%.",
      "• Cambodia's current foreign policy emphasizes establishing friendly borders with neighboring countries such as Thailand and Vietnam, and integrating into regional (ASEAN) and global (WTO) trading systems.",
      "• Key obstacles include the need for improved education, a skilled workforce, and better infrastructure, especially in impoverished rural areas.",
      "• Cambodia continues to attract investors due to low wages, abundant labor, proximity to Asian raw materials, and favorable tax policies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:58:42.516871",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3858,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Recent economic history",
    "text": "Following its independence from France in 1953, the Cambodian state has\nundergone five periods of political, social, and economic transformation:\n\n1. First Kingdom of Cambodia (1953–1970)\n2. Khmer Republic (1970–1975)\n3. Democratic Kampuchea (1975–1982, ousted in 1979); became Coalition Government of Democratic Kampuchea in exile (1982–1993)\n4. People's Republic of Kampuchea (1979–1989), later renamed \"State of Cambodia\" (1989–1993)\n5. Second Kingdom of Cambodia (1993–present)\n\nIn 1989, the State of Cambodia implemented reform policies that transformed\nthe Cambodian economic system from a command economy to an open market one. In\nline with the economic reformation, private property rights were introduced\nand state-owned enterprises were privatized. Cambodia also focused on\nintegrating itself into regional and international economic blocs, such as the\nAssociation of South East Asian Nations and the World Trade Organization\nrespectively. These policies triggered a growth in the economy, with its\nnational GDP growing at an average of 6.1% before a period of domestic unrest\nand regional economic instability in 1997 (1997 Asian financial crisis).\nHowever, conditions improved and since 1999, the Cambodian economy has\ncontinued to grow at an average pace of approximately 6–8% per annum.\n\nIn 2007, Cambodia's gross domestic product grew by an estimated 18.6%. Garment\nexports rose by almost 8%, while tourist arrivals increased by nearly 35%.\nWith exports decreasing, the 2007 GDP growth was driven largely by consumption\nand investment. Foreign direct investment (FDI) inflows reached US$600 million\n(7 percent of GDP), slightly more than what the country received in official\naid. Domestic investment, driven largely by the private sector, accounted for\n23.4 percent of GDP. Export growth, especially to the US, began to slow in\nlate 2007 accompanied by stiffer competition from Vietnam and emerging risks\n(a slowdown in the US economy and lifting of safeguards on China's exports).\nUS companies were the fifth largest investors in Cambodia, with more than $1.2\nbillion in investments over the period 1997–2007.\n\nCambodia was severely damaged economically by the 2008 financial crisis, and\nits main economic sector, the garment industry, suffered a 23% drop in exports\nto the United States and Europe. As a result, 60,000 workers were laid off.\nHowever, in the last quarter of 2009 and early 2010, conditions were beginning\nto improve and the Cambodian economy began to recover. Cambodian exports to\nthe US for the first 11 months of 2012 reached $2.49 billion, a 1 per cent\nincrease year-on-year. Its imports of US goods grew 26 per cent for that\nperiod, reaching $213 million. Another factor underscoring the potential of\nthe Cambodian economy is the recent halving of its poverty rate. The poverty\nrate is 20.5 per cent, meaning that approximately 2.8 million people live\nbelow the poverty line.\n\nReal GPD per capita development of Cambodia",
    "openai_summarised_points": [
      "• Following Cambodia's independence from France in 1953, the country experienced five distinct periods of political, social, and economic transformation.",
      "• The first period, known as the First Kingdom of Cambodia, lasted from 1953 to 1970.",
      "• The second period was the Khmer Republic, spanning from 1970 to 1975.",
      "• The third period was Democratic Kampuchea, from 1975 until 1982, although it was ousted in 1979; during 1982–1993, it was known as the Coalition Government of Democratic Kampuchea in exile.",
      "• The fourth period was the People's Republic of Kampuchea from 1979 to 1989, which was later renamed the State of Cambodia from 1989 to 1993.",
      "• The current period, the Second Kingdom of Cambodia, has been ongoing since 1993.",
      "• In 1989, the State of Cambodia implemented comprehensive reform policies that shifted the economy from a command system to an open market economy.",
      "• These reforms included the introduction of private property rights and the privatization of state-owned enterprises.",
      "• Cambodia actively sought integration into regional and international economic organizations, such as the Association of Southeast Asian Nations (ASEAN) and the World Trade Organization (WTO).",
      "• The economic reforms led to growth, with the national GDP increasing at an average rate of 6.1% prior to the 1997 Asian financial crisis, which caused domestic unrest and regional economic instability.",
      "• Post-1999, Cambodia's economy has maintained a robust growth rate averaging approximately 6–8% annually.",
      "• In 2007, Cambodia’s GDP grew by an estimated 18.6%, marking a significant economic expansion.",
      "• During the same year, garment exports increased by nearly 8%, and tourist arrivals surged by approximately 35%.",
      "• The 2007 GDP growth was primarily driven by domestic consumption and investment, despite a decline in exports.",
      "• Foreign direct investment (FDI) inflows in 2007 reached US$600 million, accounting for 7% of GDP, slightly exceeding the amount of official aid received.",
      "• Domestic investment, mainly from the private sector, contributed 23.4% of GDP in 2007.",
      "• Export growth, particularly to the United States, began to slow in late 2007 due to increased competition from Vietnam, a slowdown in the US economy, and the lifting of export safeguards on China.",
      "• US companies invested over US$1.2 billion in Cambodia between 1997 and 2007, making them the fifth-largest investors in the country.",
      "• The 2008 global financial crisis severely impacted Cambodia’s economy, especially its garment sector, which experienced a 23% decline in exports to the US and Europe, leading to the layoff of approximately 60,000 workers.",
      "• By late 2009 and early 2010, economic conditions started to improve, signaling a recovery of the Cambodian economy.",
      "• In the first 11 months of 2012, Cambodia’s exports to the US reached US$2.49 billion, reflecting a 1% increase year-on-year.",
      "• During the same period, US imports to Cambodia grew by 26%, totaling US$213 million.",
      "• A notable development in Cambodia’s economic potential is the halving of its poverty rate, which now stands at 20.5%, indicating that approximately 2.8 million people live below the poverty line."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:58:52.654871",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2958,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1986–2020 (with IMF\nstaff estimates in 2021–2026). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund find them unreliable.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1986  | n/a  | n/a  | 0.2  | 25.71  | n/a  | n/a  | n/a  | n/a\n1987  | 4.3  | 516.02  | 0.1  | 17.1  | n/a  | -31.2%  | n/a  | n/a\n1988  | 4.8  | 569.1  | 0.3  | 32.6  | 9.6%  | 23.0%  | n/a  | n/a\n1989  | 5.2  | 593.1  | 0.3  | 39.7  | 3.3%  | 63.8%  | n/a  | n/a\n1990  | 5.4  | 602.5  | 0.9  | 99.8  | 1.1%  | 141.8%  | n/a  | n/a\n1991  | 6.0  | 647.5  | 2.0  | 215.7  | 7.6%  | 191.0%  | 0.7%  | n/a\n1992  | 6.6  | 684.4  | 2.4  | 252.5  | 7.1%  | 75.0%  | 0.8%  | n/a\n1993  | 7.0  | 703.6  | 2.4  | 242.5  | 4.0%  | 114.3%  | 0.8%  | n/a\n1994  | 7.8  | 745.9  | 2.8  | 265.1  | 8.2%  | 10.4%  | 1.3%  | n/a\n1995  | 8.4  | 781.7  | 3.4  | 319.5  | 6.0%  | 10.1%  | 0.8%  | n/a\n1996  | 9.1  | 818.5  | 3.5  | 316.2  | 5.9%  | 7.1%  | 0.8%  | 30.2%\n1997  | 9.6  | 842.8  | 3.4  | 302.2  | 4.0%  | 10.5%  | 0.9%  | 31.6%\n1998  | 10.2  | 870.1  | 3.1  | 267.9  | 4.7%  | 12.9%  | 0.9%  | 37.2%\n1999  | 11.6  | 971.9  | 3.5  | 293.7  | 12.7%  | 2.0%  | 0.9%  | 34.7%\n2000  | 13.0  | 1,065.4  | 3.7  | 300.0  | 9.6%  | -0.8%  | 1.0%  | 35.2%\n2001  | 14.4  | 1,158.3  | 4.0  | 320.0  | 8.6%  | -0.1%  | 1.0%  | 34.9%\n2002  | 15.6  | 1,230.7  | 4.3  | 337.5  | 6.6%  | 0.0%  | 1.1%  | 39.7%\n2003  | 17.3  | 1,336.5  | 4.7  | 360.7  | 8.5%  | 1.0%  | 1.1%  | 43.1%\n2004  | 19.6  | 1,489.6  | 5.3  | 405.6  | 10.3%  | 3.9%  | 1.1%  | 42.7%\n2005  | 22.9  | 1,712.6  | 6.3  | 470.7  | 13.3%  | 6.3%  | 1.1%  | 35.6%\n2006  | 26.1  | 1,925.8  | 7.3  | 536.2  | 10.8%  | 6.1%  | 1.2%  | 30.7%\n2007  | 29.5  | 2,149.0  | 8.6  | 627.8  | 10.2%  | 7.7%  | 1.3%  | 29.4%\n2008  | 32.1  | 2,305.0  | 10.3  | 741.9  | 6.7%  | 25.0%  | 0.8%  | 27.0%\n2009  | 32.4  | 2,299.1  | 10.4  | 737.2  | 0.1%  | -0.7%  | 0.6%  | 28.5%\n2010  | 34.7  | 2,437.8  | 11.2  | 788.2  | 6.0%  | 4.0%  | 0.8%  | 28.7%\n2011  | 38.0  | 2,635.9  | 12.8  | 889.8  | 7.1%  | 5.5%  | 0.6%  | 29.7%\n2012  | 42.4  | 2,912.1  | 14.1  | 965.4  | 7.3%  | 2.9%  | 0.5%  | 31.5%\n2013  | 45.8  | 3,109.9  | 15.2  | 1,034.8  | 7.4%  | 3.0%  | 0.4%  | 31.7%\n2014  | 48.7  | 3,271.9  | 16.7  | 1,123.2  | 7.1%  | 3.9%  | 0.7%  | 31.9%\n2015  | 52.6  | 3,500.6  | 18.1  | 1,203.5  | 7.0%  | 1.2%  | 0.4%  | 31.2%\n2016  | 57.9  | 3,816.8  | 20.0  | 1,320.3  | 6.9%  | 3.0%  | 0.7%  | 29.1%\n2017  | 62.8  | 4,097.5  | 22.2  | 1,446.9  | 7.0%  | 2.9%  | 0.1%  | 30.0%\n2018  | 69.2  | 4,466.8  | 24.4  | 1,578.0  | 7.5%  | 2.4%  | 0.1%  | 28.6%\n2019  | 75.4  | 4,832.7  | 26.7  | 1,713.3  | 7.0%  | 2.0%  | 0.1%  | 29.0%\n2020  | 73.6  | 4,695.1  | 26.0  | 1,655.4  | -3.5%  | 2.9%  | 0.3%  | 31.6%\n2021  | 78.1  | 4,930.0  | 27.2  | 1,720.2  | 4.2%  | 3.1%  | n/a  | 33.4%\n2022  | 84.6  | 5,289.9  | 29.1  | 1,820.9  | 6.0%  | 2.8%  | n/a  | 35.4%\n2023  | 92.0  | 5,693.4  | 31.3  | 1,938.2  | 6.3%  | 3.0%  | n/a  | 38.0%\n2024  | 100.1  | 6,136.5  | 33.8  | 2,072.1  | 6.6%  | 3.0%  | n/a  | 41.0%\n2025  | 108.9  | 6,610.2  | 36.5  | 2,217.5  | 6.7%  | 3.0%  | n/a  | 43.9%\n2026  | 118.5  | 7,119.0  | 39.5  | 2,375.3  | 6.8%  | 3.0%  | n/a  | 46.7%",
    "openai_summarised_points": [
      "• The table presents key economic indicators for Cambodia from 1986 to 2026, with data spanning over three decades and IMF staff estimates for 2021–2026.",
      "• Inflation rates below 5% are highlighted in green within the table.",
      "• The annual unemployment rate data is sourced from the World Bank; however, the IMF considers these figures unreliable.",
      "• In 1986, Cambodia's GDP in PPP terms is not available, but nominal GDP was approximately US$0.2 billion with a per capita value of US$25.71.",
      "• Between 1987 and 1990, Cambodia experienced fluctuating GDP growth, with nominal GDP rising from US$0.1 billion in 1987 to US$0.9 billion in 1990, and GDP per capita increasing from US$17.1 to US$99.8.",
      "• The year 1988 saw a 9.6% real GDP growth, while 1989 experienced a significant inflation rate of 63.8%, with nominal GDP reaching US$0.3 billion.",
      "• In 1990, inflation peaked at 141.8%, and GDP per capita approached US$100, with nominal GDP at US$0.9 billion.",
      "• The early 1990s marked economic recovery, with GDP growth rates of 7.6% in 1991 and 7.1% in 1992; inflation remained high at 191.0% and 75.0%, respectively.",
      "• From 1993 onwards, Cambodia's economy showed consistent growth, with GDP in PPP terms reaching US$7.0 billion in 1993 and US$9.6 billion in 1997, and GDP per capita rising from US$242.5 to US$302.2.",
      "• The late 1990s and early 2000s saw continued growth, with GDP in PPP terms increasing from US$10.2 billion in 1998 to US$14.4 billion in 2001, and GDP per capita from US$267.9 to US$320.0.",
      "• The 2000s experienced robust economic expansion, with GDP in PPP terms reaching US$29.5 billion in 2007 and GDP per capita at US$627.8, alongside inflation rates fluctuating between 6.7% and 25.0%.",
      "• The global financial crisis of 2008 caused a slowdown, with GDP growth dropping to 6.7% and inflation spiking to 25.0%; nominal GDP in 2008 was US$10.3 billion.",
      "• Post-2009, Cambodia's economy recovered, with GDP growth rates of 6.0% in 2010, 7.1% in 2011, and 7.3% in 2012; inflation stabilized around 2.9% to 5.5%.",
      "• From 2013 onwards, GDP in PPP terms increased steadily, reaching US$45.8 billion in 2013 and US$62.8 billion in 2017; GDP per capita grew from US$1,034.8 to US$1,446.9.",
      "• The COVID-19 pandemic in 2020 caused a contraction of -3.5% in real GDP, with nominal GDP at US$26.0 billion and GDP per capita at US$1,655.4.",
      "• The economic recovery from 2021 to 2026 shows consistent growth, with GDP in PPP terms rising from US$78.1 billion in 2021 to an estimated US$118.5 billion in 2026.",
      "• Per capita GDP in nominal terms is projected to increase from US$1,720.2 in 2021 to approximately US$2,375.3 in 2026.",
      "• Real GDP growth rates are forecasted to hover around 6.7% to 6.8% annually from 2021 to 2026.",
      "• Inflation remains stable at approximately 3.0% throughout the 2021–2026 period.",
      "• The government debt as a percentage of GDP increased from 33.4% in 2021 to an estimated 46.7% in 2026."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:06.487653",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3522,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Garment industry",
    "text": "The garment industry represents the largest portion of Cambodia's\nmanufacturing sector, accounting for 80% of the country's exports. In 2012,\nthe exports grew to $4.61 billion up 8% over 2011. In the first half of 2013,\nthe garment industry reported exports worth $1.56 billion. The sector employs\n335,400 workers, of which 91% are female.\n\nThe sector operates largely on the final phase of garment production, that is\nturning yarns and fabrics into garments, as the country lacks a strong textile\nmanufacturing base. In 2005, there were fears that the end of the Multi Fibre\nArrangement would threaten Cambodia's garment industry; exposing it to stiff\ncompetition with China's strong manufacturing capabilities. On the contrary,\nCambodia's garment industry at present continues to grow rapidly. This is can\nbe attributed to the country's open economic policy which has drawn in large\namounts of foreign investment into this sector of the economy.\n\nGarment Factories by Ownership Nationality in 2010:\n\nNationality of Ownership | Ownership by percentage | Number of factories owned\n---|---|---\nTaiwan | 28% | 66\nChina | 19% | 44\nHong Kong | 17% | 39\nSouth Korea | 13% | 31\nMalaysia | 6% | 14\nCambodia | 5% | 13\nSingapore | 4% | 10\nUSA | 4% | 9\nOthers | 4% | 10\nA garment factory worker in Cambodia undertaking health precautions\n\nIn 2010, 236 garment export-oriented factories were operating and registered\nwith GMAC, the Garment Manufacturers Association in Cambodia, with 93% being\nforeign direct investment (FDI).\n\nAs seen in the table above, Cambodia's garment industry is characterized by a\nsmall percentage of local ownership. This is a reflection of the deficiency of\nskilled workers in the country as well as the limited leverage and autonomy\nCambodian factories have in strategic decisions. Another characteristic of the\nindustry is the country's competitive advantage as the only country where\ngarment factories are monitored and reported according to national and\ninternational standards.\n\nThis has allowed Cambodia to secure its share of quotas for exports to the US\nthrough the US-Cambodia Trade Agreement on Textiles and Apparel (1999–2004),\nwhich linked market access to labor standards. However, the Cambodian garment\nindustry remains vulnerable to global competition due to a lack of adequate\ninfrastructure, labor unrest, the absence of a domestic textile industry, and\nalmost complete dependence on imported textile material.\n\nGMAC is establishing a specialized training institute to train garment\nworkers. The institute is in Phnom Penh Special Economic Zone and will be\ncompleted by late 2016.[_needs update_] It aims to train 1,600 garment workers\nin the first three years and 240 university students each year as part of a\nseparate program.",
    "openai_summarised_points": [
      "• The garment industry constitutes the largest segment of Cambodia's manufacturing sector, accounting for 80% of the country's exports.",
      "• In 2012, garment exports reached $4.61 billion, representing an 8% increase over the previous year, 2011.",
      "• During the first half of 2013, the sector exported goods worth $1.56 billion.",
      "• The industry employs approximately 335,400 workers, of whom 91% are female.",
      "• The sector primarily focuses on the final stages of garment production, transforming yarns and fabrics into finished garments, due to Cambodia's limited textile manufacturing capabilities.",
      "• In 2005, concerns arose that the termination of the Multi Fibre Arrangement would threaten Cambodia’s garment industry by exposing it to intense competition from China’s robust manufacturing sector.",
      "• Contrary to fears, Cambodia’s garment industry has continued to grow rapidly, driven by the country’s open economic policies that attract substantial foreign investment.",
      "• In 2010, the distribution of garment factories by ownership nationality was as follows:",
      "• Taiwan: 28% (66 factories)",
      "• China: 19% (44 factories)",
      "• Hong Kong: 17% (39 factories)",
      "• South Korea: 13% (31 factories)",
      "• Malaysia: 6% (14 factories)",
      "• Cambodia: 5% (13 factories)",
      "• Singapore: 4% (10 factories)",
      "• USA: 4% (9 factories)",
      "• Others: 4% (10 factories)",
      "• In 2010, there were 236 garment export-oriented factories registered with GMAC (Garment Manufacturers Association in Cambodia), with 93% of these being foreign direct investment (FDI).",
      "• The industry is characterized by a small proportion of locally owned factories, reflecting a shortage of skilled labor and limited strategic decision-making power for Cambodian owners.",
      "• Cambodia’s competitive advantage lies in its monitoring and reporting of garment factories according to both national and international standards, making it unique in this regard.",
      "• The country secured its share of export quotas to the US through the US-Cambodia Trade Agreement on Textiles and Apparel (1999–2004), which linked market access to adherence to labor standards.",
      "• Despite growth, the Cambodian garment industry remains vulnerable due to inadequate infrastructure, labor unrest, the absence of a domestic textile industry, and near-total reliance on imported textiles.",
      "• GMAC is establishing a specialized training institute in Phnom Penh Special Economic Zone, expected to be completed by late 2016, to address skill shortages.",
      "• The training institute aims to train 1,600 garment workers in the first three years and 240 university students annually through a separate program."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:13.957548",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2762,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture",
    "text": "Cambodians planting rice, 2004.\n\nAgriculture is the traditional mainstay of the Cambodian economy. Agriculture\naccounted for 90 percent of GDP in 1985 and employed approximately 80 percent\nof the work force. Rice is the principal commodity.\n\nMajor secondary crops include maize, cassava, sweet potatoes, groundnuts,\nsoybeans, sesame seeds, dry beans, and rubber. The principal commercial crop\nis rubber. In the 1980s it was an important primary commodity, second only to\nrice, and one of the country's few sources of foreign exchange.",
    "openai_summarised_points": [
      "• Agriculture has historically been the mainstay of Cambodia's economy, playing a central role in its economic structure.",
      "• In 1985, agriculture contributed approximately 90 percent to Cambodia's Gross Domestic Product (GDP).",
      "• Around 80 percent of the Cambodian workforce was employed in the agricultural sector, highlighting its significance for employment.",
      "• Rice is the principal agricultural commodity in Cambodia, serving as the country's primary crop and economic staple.",
      "• Major secondary crops cultivated in Cambodia include maize, cassava, sweet potatoes, groundnuts, soybeans, sesame seeds, dry beans, and rubber.",
      "• Rubber is identified as the principal commercial crop in Cambodia.",
      "• During the 1980s, rubber was an important primary commodity for Cambodia, ranking second only to rice in economic significance.",
      "• Rubber was one of Cambodia’s few sources of foreign exchange during the 1980s, underscoring its importance for the country's international trade and economic stability."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:17.639415",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 534,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Tourism",
    "text": "In the 1960s, Cambodia was a prominent tourist destination in the Southeast\nAsian region. Due to protracted periods of civil war, insurgencies, and\nespecially the genocidal regime of the Khmer Rouge (see Khmer Rouge Genocide),\nCambodia's tourism industry was reduced to being virtually non-existent. Since\nthe late 1990s, tourism is fast becoming Cambodia's second largest industry,\njust behind the garment manufacturing. In 2006, Cambodia's tourism sector\ngenerated a revenue of US$1.594 billion, which made up approximately 16% of\nthe country's GDP.\n\nAngkor Wat in Siem Reap, Cambodia.\n\nCultural heritage tourism is especially popular in the country, with many\nforeign tourists visiting the ancient Hindu temple of Angkor Wat located in\nthe Siem Reap province. Other popular tourist attractions include the Royal\nPalace, Phnom Penh, as well as ecotourism spots such as Tonlé Sap Lake and the\nMekong River.\n\nThe tourism industry in Cambodia has been perpetuated by the development of\nimportant transportation infrastructure; in particular Cambodia's two\ninternational airports in Phnom Penh and Siem Reap respectively. To the\nCambodian economy, tourism has been a means for the accumulation of foreign\ncurrency earnings and employment for the Cambodian workforce, with about\n250,000 jobs generated in 2006. Meanwhile, challenges to the industry include\nleakage of revenue to foreign markets due to a dependence on foreign goods as\nwell as the prevalence of the Child sex tourism industry.",
    "openai_summarised_points": [
      "• In the 1960s, Cambodia was a prominent tourist destination within Southeast Asia, attracting many visitors due to its rich cultural heritage and historical sites.",
      "• The country's tourism industry was severely impacted by prolonged civil war, insurgencies, and notably the genocidal regime of the Khmer Rouge, which led to a near-total collapse of tourism activities.",
      "• The Khmer Rouge regime, responsible for the Khmer Rouge Genocide, significantly contributed to the decline of Cambodia's tourism sector during its rule from 1975 to 1979.",
      "• Since the late 1990s, Cambodia's tourism industry has experienced rapid growth, becoming the country's second-largest industry after garment manufacturing.",
      "• In 2006, Cambodia's tourism sector generated approximately US$1.594 billion in revenue, accounting for about 16% of the nation's Gross Domestic Product (GDP).",
      "• Cultural heritage tourism remains highly popular, with many foreign visitors attracted to the ancient Hindu temple of Angkor Wat located in Siem Reap province.",
      "• Other major tourist attractions include the Royal Palace in Phnom Penh and ecotourism sites such as Tonlé Sap Lake and the Mekong River.",
      "• The development of key transportation infrastructure, notably Cambodia's two international airports in Phnom Penh and Siem Reap, has facilitated tourism growth.",
      "• Tourism serves as a vital source of foreign currency earnings and employment, with approximately 250,000 jobs created in the industry in 2006.",
      "• Challenges facing Cambodia's tourism industry include revenue leakage to foreign markets due to dependence on foreign goods and the prevalence of child sex tourism."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:21.839117",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1489,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Gambling industry",
    "text": "NagaWorld in Phnom Penh\n\nGambling in Cambodia is officially illegal under the 1996 Law on Suppression\nof Gambling, which outlawed all unauthorized forms of gambling and provided\nfor penalties ranging from monetary fines to short prison sentences, although\nthe Cambodian government's General Department of Prisons does not list\ngambling as one of the 28 offenses punishable by imprisonment.\n\nThe prohibition on gambling, which also extends to all forms of online\ngambling, only applies to Cambodian citizens. As of October 2015, there were\n75 casinos catering to foreign tourists operating within Cambodia, providing\nan estimated US$29 million in revenue to the national government in the first\nnine months of the year and $2 billion in income for the casinos. Cambodian\ncitizens are allowed to gamble through government sponsored gaming including\nfive separate privately run national lotteries. Cambodians were also\npreviously permitted to play the slot machines located in the nation's\ncasinos, however due to complaints of violence related to gambling debts and\nwidespread problem gambling, slot machines were banned in 2009.\n\nGambling as a popular pastime is ingrained in Southeast Asian culture in\ngeneral and Cambodian culture in particular. Men who don't gamble are often\nviewed as not masculine. Consequently, despite the laws against citizens\ngambling, illegal gambling is widespread in Cambodia. The police forces in\nCambodia, ruled by one of the most corrupt governments in the world, often\nlook the other way as casinos freely allow locals to enter and provide private\nrooms for government and law enforcement officials, who oftentimes have a\nvested financial interest in the casinos, to conduct illegal gambling.\n\nExtralegal activities are also widespread outside of the permitted casinos\nranging from cockfights and card rooms to sports book (primarily regional\nfootball and Kun Khmer matches) and unauthorized lotteries. Most of these\nactivities are controlled by organized crime and protected by bribes to law\nenforcement.\n\nA number of societal issues plague Cambodia as a result of gambling, most\nnotably gambling addiction.\n\nRussian Federation Boulevard in Phnom Penh.",
    "openai_summarised_points": [
      "• Gambling in Cambodia is officially illegal under the 1996 Law on Suppression of Gambling, which prohibits all unauthorized forms of gambling and prescribes penalties ranging from monetary fines to short prison sentences; however, the Cambodian government's General Department of Prisons does not list gambling among the 28 offenses punishable by imprisonment.",
      "• The prohibition on gambling extends to all forms of online gambling and applies exclusively to Cambodian citizens, with foreign tourists permitted to gamble legally within licensed casinos.",
      "• As of October 2015, Cambodia hosted 75 casinos catering to foreign tourists, which generated an estimated US$29 million in revenue for the national government during the first nine months of that year and produced approximately US$2 billion in income for the casinos.",
      "• Cambodian citizens are legally allowed to participate in government-sponsored gaming activities, including five separate privately operated national lotteries.",
      "• Previously, Cambodian citizens were permitted to play slot machines located within casinos; however, these machines were banned in 2009 due to complaints linking them to violence related to gambling debts and widespread problem gambling.",
      "• Gambling is deeply ingrained in Southeast Asian and Cambodian culture, with societal perceptions often associating masculinity with gambling; men who abstain from gambling are sometimes viewed as lacking masculinity.",
      "• Despite legal restrictions, illegal gambling is prevalent throughout Cambodia, facilitated by widespread corruption among police forces, which often overlook casino activities allowing locals to gamble freely and provide private rooms for government and law enforcement officials, who frequently have financial interests in these casinos.",
      "• Extralegal gambling activities are widespread outside licensed casinos and include cockfights, card rooms, sports betting (primarily on regional football and Kun Khmer matches), and unauthorized lotteries; these activities are predominantly controlled by organized crime groups and maintained through bribery of law enforcement officials.",
      "• Gambling-related societal issues in Cambodia include significant problems with gambling addiction, which affect various segments of the population and contribute to broader social challenges.",
      "• The section references a notable location, Russian Federation Boulevard in Phnom Penh, although specific details about its relevance to gambling are not provided."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:28.289297",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2185,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Construction",
    "text": "The increase in tourist arrivals has led to growing demand for hotels and\nother forms of accommodation surrounding tourist hotspots. Siem Reap in\nparticular has seen a construction boom in recent years. The capital Phnom\nPenh has also witnessed a growth in the construction and real estate sectors.\nRecently, planned projects that have been on the pipeline for several years\nhave been shelved temporarily due to a reduction in foreign investment. From\n2009, the Cambodian government has allowed foreigners to own condominiums.\nThis has helped in attracting real estate investors from Thailand, Malaysia,\nSingapore and other countries.\n\nThe construction sector attracted investment of $2.1 billion in 2012 which is\na 72 per cent rise compared with 2011. Construction licenses issued stood at\n1,694 projects in 2012, which was 20% lower than 2011 but they were higher in\nvalue.",
    "openai_summarised_points": [
      "• The increase in tourist arrivals in Cambodia has driven a rising demand for hotels and other accommodation options near popular tourist destinations.",
      "• Siem Reap has experienced a significant construction boom in recent years, largely fueled by the growth in tourism.",
      "• The capital city, Phnom Penh, has also seen notable growth in the construction and real estate sectors, indicating urban development and investment.",
      "• Several planned construction projects that had been in development for several years have been temporarily shelved due to a decline in foreign investment, reflecting economic and investment uncertainties.",
      "• Since 2009, the Cambodian government has permitted foreigners to own condominiums, a policy change aimed at attracting more foreign real estate investors.",
      "• This policy has successfully attracted real estate investors from neighboring countries including Thailand, Malaysia, and Singapore, among others.",
      "• In 2012, the construction sector in Cambodia attracted investment totaling $2.1 billion, representing a 72% increase compared to the investment level in 2011.",
      "• In 2012, a total of 1,694 construction licenses were issued, which was 20% fewer than in 2011; however, the projects issued licenses had higher overall value, indicating larger or more expensive developments."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:32.590595",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 875,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Resources",
    "text": "Oil seeps were discovered in Cambodia as early as the 1950s by Russian and\nChinese geologists. Development of the industry was delayed, however, by the\nVietnam and Cambodian Civil Wars and the political uncertainty that followed.\nFurther discoveries of oil and natural gas deposits offshore in the early\n2000s led to renewed domestic and international interest in Cambodia's\nproduction possibilities. As of 2013, the US company Chevron, Japanese JOGMEC\nand other international companies maintained production sites both on shore\nand off. Chevron alone had invested over US$160 million and drilled 18 wells.\n\nSok Khavan, acting director general of the Cambodian National Petroleum\nAuthority, estimated that once the contracts are finalized and legal issues\nresolved, the Cambodian government will receive approximately 70% of the\nrevenues, contributing to an economy in which the GDP is projected to increase\nfive-fold by 2030. In addition, there are 10,000 square miles offshore in the\nGulf of Thailand that holds potential reserves of 12-14 trillion cubic feet of\nnatural gas and an unspecified amount of oil. The rights to this territory are\ncurrently a subject of dispute between Cambodia and Thailand, further delaying\nany possible production developments. In early 2013 it was reported that the\ntwo countries were close to a deal that would allow joint production to begin.",
    "openai_summarised_points": [
      "• Oil seeps in Cambodia were first discovered in the 1950s by Russian and Chinese geologists.",
      "• The development of Cambodia’s oil industry was delayed due to the Vietnam War, Cambodian Civil War, and subsequent political instability.",
      "• In the early 2000s, additional offshore oil and natural gas deposits were discovered, leading to renewed domestic and international interest in Cambodia’s hydrocarbon production potential.",
      "• As of 2013, several international companies, including US-based Chevron and Japanese JOGMEC, maintained production sites both onshore and offshore in Cambodia.",
      "• Chevron had invested over US$160 million and drilled 18 wells in Cambodia by 2013.",
      "• Sok Khavan, acting director general of the Cambodian National Petroleum Authority, estimated that once contracts are finalized and legal issues resolved, the Cambodian government would receive approximately 70% of the revenues from oil and gas production.",
      "• The revenue from these resources is projected to significantly impact Cambodia’s economy, with the GDP expected to increase five-fold by 2030.",
      "• There are offshore reserves in the Gulf of Thailand covering 10,000 square miles, containing an estimated 12-14 trillion cubic feet of natural gas and an unspecified amount of oil.",
      "• The rights to the offshore territory in the Gulf of Thailand are disputed between Cambodia and Thailand, which has delayed development and production activities.",
      "• In early 2013, reports indicated that Cambodia and Thailand were close to reaching a deal that would permit joint production of the offshore resources."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:38.030309",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1378,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Foreign aid",
    "text": "Rice milling is very important to the Cambodian economy.\n\nCambodia's emerging democracy has received strong international support. Under\nthe mandate of the United Nations Transitional Authority in Cambodia (UNTAC),\n$1.72 billion (1.72 G$) was spent in an effort to bring basic security,\nstability and democratic rule to the country. Various news and media reports\nsuggest that since 1993 the country has been the recipient of some US$10\nbillion in foreign aid.\n\nWith regards to economic assistance, official donors had pledged $880 million\nat the Ministerial Conference on the Rehabilitation of Cambodia (MCRRC) in\nTokyo in June 1992. In addition to that figure, $119 million was pledged in\nSeptember 1993 at the International Committee on the Reconstruction of\nCambodia (ICORC) meeting in Paris, and $643 million at the March 1994 ICORC\nmeeting in Tokyo.\n\nCambodia experienced a shortfall in foreign aid in the year 2005 due to the\ngovernment's failure to pass anti-corruption laws, opening up a single\nimport/export window, increasing its spending on education, and complying with\npolicies of good governance. In response, the government adopted the National\nStrategic Development Plan for 2006–10 (also known as the “Third Five-Year\nPlan”). The plan focused on three major areas:\n\n* the speeding up of economic growth at an annual rate of 6-7%\n* eradicating corruption\n* developing public structures in favor of quality (i.e. by education, training, and healthcare) over quantity (i.e. rapid population growth)",
    "openai_summarised_points": [
      "• Rice milling holds significant importance to the Cambodian economy, indicating its role in agricultural productivity and export potential.",
      "• Cambodia's emerging democratic system has garnered substantial international support aimed at stabilization and development.",
      "• Under the mandate of the United Nations Transitional Authority in Cambodia (UNTAC), approximately $1.72 billion was spent to establish basic security, stability, and democratic governance in Cambodia.",
      "• Since 1993, reports suggest that Cambodia has received approximately US$10 billion in total foreign aid, reflecting ongoing international assistance since the post-conflict reconstruction period.",
      "• During the Ministerial Conference on the Rehabilitation of Cambodia (MCRRC) held in Tokyo in June 1992, official donors pledged a total of $880 million in economic assistance.",
      "• Additional pledges included $119 million made in September 1993 at the International Committee on the Reconstruction of Cambodia (ICORC) meeting in Paris.",
      "• Further commitments were made at the March 1994 ICORC meeting in Tokyo, amounting to $643 million in aid.",
      "• In 2005, Cambodia experienced a shortfall in foreign aid due to the government’s failure to pass anti-corruption legislation, which hindered donor confidence and aid disbursement.",
      "• The shortfall was also attributed to the government’s decision to open a single import/export window, which may have affected transparency and efficiency.",
      "• Increased government spending on education was a factor impacting aid flows, as well as challenges in complying with good governance policies.",
      "• In response to the aid shortfall, the Cambodian government adopted the National Strategic Development Plan for 2006–10, also known as the “Third Five-Year Plan.”",
      "• The plan emphasized three major areas:",
      "• Accelerating economic growth at an annual rate of 6-7%.",
      "• Eradicating corruption to improve governance and attract further aid.",
      "• Developing public infrastructure and services focused on quality—such as education, training, and healthcare—over merely increasing population growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:45.366793",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1513,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Banking",
    "text": "There are no significant barriers to bank entry. At the end of 2013, there\nstood 35 commercial banks. Since 2011 new banks with offshore funding have\nbegun to enter the market.",
    "openai_summarised_points": [
      "• As of the end of 2013, Cambodia's banking sector comprised a total of 35 commercial banks, indicating a relatively open and accessible banking environment with no significant barriers to entry for new institutions.",
      "• Since 2011, the Cambodian banking industry has experienced the entry of new banks that are characterized by offshore funding sources, reflecting increased international financial integration and diversification within the sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:47.749105",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 176,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.9",
    "section_name": "Energy",
    "text": "Cambodia has significant potential for developing renewable energy and could\npotentially run its energy system on 100% renewable sources. The country,\nhowever, remains one of the few countries in the ASEAN region that has not\nadopted renewable energy targets. To attract more investment in renewable\nenergy Cambodia could adopt targets, improve renewable energy governance,\ndevelop a regulatory framework, improve project bankability and facilitate\nmarket entry for international investors. Due to high vulnerability to climate\nchange, it is recommended that Cambodia focuses on developing renewable energy\naway from fossil fuels as part of climate change mitigation measures.",
    "openai_summarised_points": [
      "• Cambodia possesses significant potential for the development of renewable energy sources and could potentially operate its entire energy system on 100% renewable energy.",
      "• Despite this potential, Cambodia remains one of the few countries within the ASEAN region that has not established official renewable energy targets.",
      "• To attract increased investment in renewable energy, Cambodia could benefit from adopting clear renewable energy targets, which would serve as a strategic policy framework.",
      "• Improvements in renewable energy governance are necessary, including the development of a comprehensive regulatory framework to facilitate renewable energy projects.",
      "• Enhancing the bankability of renewable energy projects is crucial to attract both domestic and international investors.",
      "• Facilitating market entry for international investors is recommended to boost renewable energy development in Cambodia.",
      "• Cambodia is highly vulnerable to the impacts of climate change, emphasizing the importance of developing renewable energy sources as part of its climate change mitigation strategies.",
      "• It is recommended that Cambodia focus on expanding renewable energy capacity away from fossil fuels to reduce climate vulnerability and promote sustainable development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:51.153617",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 676,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.10",
    "section_name": "Scam centres",
    "text": "Cyber scam center operations in Cambodia have transformed parts of the\ncountry, notably areas like Bokor Mountain, Sihanoukville, Ream City, and Dara\nSakor, into centers for a brutal online fraud industry. This illicit industry,\nprimarily controlled by Chinese billionaires, operates with the complicity of\nhigh-ranking Cambodian political elites who not only profit from it but also\nfacilitated its development through infrastructure projects. The origins of\nthis industry trace back to Cambodia's participation in China's Belt and Road\nInitiative around 2013. This led to a surge of Chinese investment in\ninfrastructure and real estate, including special economic zones (SEZs) and\nmega-casinos. Many of these \"developers\" were later revealed to be fugitives\nor individuals with criminal backgrounds, some of whom have since faced\ninternational sanctions. With China's 2019 ban on online gambling and the\nsubsequent COVID-19 pandemic, many of these empty facilities pivoted to online\nscamming. This period saw a significant increase in human trafficking, with an\nestimated 100,000 people, primarily foreign nationals, trafficked into\nCambodia by September 2023.\n\nA 2024 study found that funds stolen by criminal syndicates in Cambodia was\nestimated to exceed $12.5 billion annually—half the country’s formal GDP,\nbased on a very conservative estimate. Many scam compounds in Cambodia are\nowned by local elites There are lucrative incentives for these elites to\nassociate with and materially support criminal activity, often hidden behind\nlegitimate-seeming fronts like casinos, resorts, and special economic zones\n(SEZs). Criminal groups have established complex money-laundering operations\nto move illicit funds into the formal economy, indicating a flow of fraulent\nfunds that can potentially corrupt international financial institutions and\nlegitimate sectors of the economy.",
    "openai_summarised_points": [
      "• Cyber scam center operations in Cambodia have transformed certain regions, notably Bokor Mountain, Sihanoukville, Ream City, and Dara Sakor, into hubs for a severe online fraud industry.",
      "• This illicit industry is primarily controlled by Chinese billionaires who operate with the complicity of high-ranking Cambodian political elites, who not only profit from these activities but also facilitated their development through infrastructure projects.",
      "• The origins of this scam industry date back to Cambodia's participation in China's Belt and Road Initiative around 2013, which spurred a surge of Chinese investment in infrastructure and real estate development.",
      "• Investments included the establishment of special economic zones (SEZs) and mega-casinos, many of which were later revealed to be fronts for criminal activities; some developers involved are fugitives or individuals with criminal backgrounds, with several facing international sanctions.",
      "• Following China's 2019 ban on online gambling and the impact of the COVID-19 pandemic, many of these previously operational facilities shifted focus to online scamming activities.",
      "• During this period, there was a significant increase in human trafficking, with an estimated 100,000 people, primarily foreign nationals, trafficked into Cambodia by September 2023.",
      "• A 2024 study estimated that the funds stolen by criminal syndicates operating in Cambodia exceed $12.5 billion annually, which is approximately half of the country’s formal GDP, based on a conservative estimate.",
      "• Many scam compounds in Cambodia are owned by local elites who have strong incentives to support and associate with criminal activities, often hiding these operations behind seemingly legitimate businesses such as casinos, resorts, and SEZs.",
      "• Criminal groups have established complex money-laundering operations designed to move illicit funds into the formal economy, raising concerns about potential corruption of international financial institutions and legitimate sectors within Cambodia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:55.323273",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1879,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.11",
    "section_name": "Other industry",
    "text": "Cambodia is encouraging investment in EV assembly plants. Cambodia's 2022\nLong-Term Strategy for Carbon Neutrality to have 40% EV cars and busses and\n70% electric motorbikes by 2050. It has significantly reduced import duties on\nEVs.",
    "openai_summarised_points": [
      "• Cambodia is actively promoting investment in electric vehicle (EV) assembly plants as part of its strategic economic development initiatives.",
      "• The country's 2022 Long-Term Strategy for Carbon Neutrality aims to achieve a significant shift towards electric mobility by 2050, targeting that 40% of cars and buses, and 70% of motorbikes, will be electric.",
      "• To support the growth of the EV sector, Cambodia has substantially reduced import duties on electric vehicles, facilitating easier and more cost-effective access to EVs and related components."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:59:57.886948",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 233,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.12",
    "section_name": "Transport",
    "text": "A national transport map of Cambodia National Highway 1 - Kien Svay, Kandal\nProvince A rural road in Cambodia The system of transport in Cambodia,\nrudimentary at the best of times, was severely damaged in the chaos that\nengulfed the nation in the latter half of the 20th century. The country's weak\ntransport infrastructure hindered emergency relief efforts, exacerbating the\nlogistical issues of procurement of supplies in general and their\ndistribution. Cambodia received Soviet technical assistance and equipment to\nsupport the maintenance of the transportation network.",
    "openai_summarised_points": [
      "• The transport system in Cambodia is considered rudimentary, especially during the latter half of the 20th century when the country experienced significant chaos.",
      "• The country's transport infrastructure was severely damaged during this period, impacting overall functionality.",
      "• The weak state of Cambodia’s transport infrastructure hindered emergency relief efforts, making disaster response more difficult.",
      "• The poor transport infrastructure exacerbated logistical issues related to the procurement and distribution of supplies across the country.",
      "• Cambodia received technical assistance and equipment from the Soviet Union to support the maintenance and rebuilding of its transportation network.",
      "• The national transport map of Cambodia includes key routes such as National Highway 1, which connects to Kien Svay in Kandal Province.",
      "• Visual references include images of a rural road in Cambodia and a national highway, exemplifying the state of transportation infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:00.738345",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 573,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.13",
    "section_name": "Child labour",
    "text": "A Cambodian child scavenging in a landfill site.\n\nChild labour refers to the full-time employment of children under a minimum\nlegal age. In 2003, an International Labour Organization (ILO) survey reported\nthat one in every ten children in the capital above the age of seven was\nengaged in child domestic labour. Children who are too young to work in the\nfields work as scavengers. They spend their days rummaging in dumps looking\nfor items that can be sold for money. Children also often work in the garment\nand textile industry, in prostitution, and in the military.\n\nIn Cambodia, the state had ratified both the Minimum Age Convention (C138) in\n1999 and Worst Forms of Child Labour Convention (C182) in 2006, which are\nadopted by the International Labour Organization (ILO). For the former\nconvention, Cambodia had specified the minimum age to work to be at age 14.\nYet, significant levels of child labour appear to be found in Cambodia.\n\nIn 1998, ILO estimated that 24.1% of children in Cambodia aged between 10 and\n14 were economically active. Many of these children work long hours and\nCambodia Human Development Report 2000 reported that approximately 65,000\nchildren between the ages of 5 and 13 worked 25 hours a week and did not\nattend school. There are also many initiative and policies put in place to\ndecrease the prevalence of child labour such as the United States generalized\nsystem of preferences, the U.S.-Cambodia textile agreement, ILO Garment Sector\nWorking Conditions Improvement Project, and ChildWise Tourism.\n\nThere is a need to eliminate child labour in Cambodia as a report by UNICEF\nstates that child labourers could be missing out on education. When children\ndo not attend school, they are denied the knowledge and skills needed for\nnational development. Without education and vital life skills, they are\nvulnerable to abuse and exploitation, which may exacerbate the existing cycle\nof poverty in their families. Consequently, this lack in productivity due to\nlack of education will hold back economic growth in Cambodia.",
    "openai_summarised_points": [
      "• Child labour is defined as the full-time employment of children below a minimum legal age, which varies by convention and national law.",
      "• In 2003, an International Labour Organization (ILO) survey reported that approximately 10% (one in ten) of children above age seven in Cambodia's capital were engaged in child domestic labour.",
      "• Children too young to work in agriculture often work as scavengers, spending their days rummaging through dumpsites to find items that can be sold for money.",
      "• Child labour in Cambodia also includes employment in the garment and textile industry, involvement in prostitution, and participation in the military.",
      "• Cambodia ratified the ILO conventions: the Minimum Age Convention (C138) in 1999 and the Worst Forms of Child Labour Convention (C182) in 2006, both of which are adopted by the ILO.",
      "• Under the Minimum Age Convention (C138), Cambodia set the minimum age for employment at 14 years old.",
      "• Despite ratification, significant levels of child labour persist in Cambodia, indicating ongoing challenges in enforcement and compliance.",
      "• In 1998, the ILO estimated that 24.1% of children aged 10 to 14 in Cambodia were economically active, highlighting the prevalence of child labour in this age group.",
      "• The Cambodia Human Development Report 2000 reported that approximately 65,000 children aged 5 to 13 worked 25 hours per week and did not attend school, indicating a substantial impact on education.",
      "• Various initiatives and policies have been implemented to reduce child labour, including the United States Generalized System of Preferences, the U.S.-Cambodia Textile Agreement, the ILO Garment Sector Working Conditions Improvement Project, and ChildWise Tourism.",
      "• UNICEF reports emphasize the need to eliminate child labour because child labourers often miss out on education, which is essential for personal development and national progress.",
      "• Children who do not attend school are deprived of the knowledge and skills necessary for contributing to Cambodia’s development and are more vulnerable to abuse and exploitation.",
      "• The cycle of poverty is exacerbated when children lack education and vital life skills, perpetuating economic hardship within families.",
      "• The lack of education and productivity resulting from child labour hampers Cambodia’s overall economic growth and development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:07.744913",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2049,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "2.14",
    "section_name": "Trade - EBA Issues",
    "text": "The announcement from February 12, 2020, was to suspend \"Everything But Arms\"\n(EBA) trade preferences between EU and Cambodia. The country has known to be\nthe second largest beneficiary from EBA's program. The EU's preliminary\nconclusion sent to Cambodian government on November 12, 2019, because Cambodia\nfailed to address serious human and labor rights concerns under Human Rights\nWatch. Moreover, the issue behind ending the opposition party (CNRP) and\ndropping charges against the leader of CNRP violated the right to freedom of\nexpression.",
    "openai_summarised_points": [
      "• On February 12, 2020, the European Union announced the suspension of \"Everything But Arms\" (EBA) trade preferences with Cambodia.",
      "• Cambodia has been the second-largest beneficiary of the EBA program, which provides duty-free and quota-free access to the EU market for least developed countries.",
      "• The EU's preliminary conclusion to the Cambodian government was communicated on November 12, 2019.",
      "• The suspension was due to Cambodia's failure to address serious human rights and labor rights concerns, as reported by Human Rights Watch.",
      "• Specific issues cited include the government's actions against the opposition party, the Cambodia National Rescue Party (CNRP), and the dropping of charges against its leader.",
      "• These actions were viewed as violations of the right to freedom of expression.",
      "• The decision to suspend EBA preferences reflects concerns over Cambodia's human rights record and democratic practices."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:11.301476",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 544,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Challenges for industrial development",
    "text": "Although Cambodia exports mainly garments and products from agriculture and\nfisheries, it is striving to diversify the economy. There is some evidence of\nexpansion in value-added exports from a low starting point, largely thanks to\nthe manufacture of electrical goods and telecommunications by foreign\nmultinationals implanted in the country. Between 2008 and 2013, high-tech\nexports climbed from just US$3.8million to US$76.5 million.\n\nIt will be challenging for Cambodia to enhance the technological capacity of\nthe many small and medium-sized enterprises (SMEs) active in agriculture,\nengineering and the natural sciences. Whereas the large foreign firms in\nCambodia that are the main source of value-added exports tend to specialize in\nelectrical machinery and telecommunications, the principal task for science\nand technology policy will be to facilitate spillovers in terms of skills and\ninnovation capability from these large operators towards smaller firms and\nacross other sectors.\n\nThere is little evidence that the Law on Patents, Utility Model Certificates\nand Industrial Designs (2006) has been of practical use, thus far, to any but\nthe larger foreign firms operating in Cambodia. By 2012, 27 patent\napplications had been filed, all by foreigners. Of the 42 applications for\nindustrial design received up to 2012, 40 had been filed by foreigners.\nNevertheless, the law has no doubt encouraged foreign firms to introduce\ntechnological improvements to their on-shore production systems, which can\nonly be beneficial.",
    "openai_summarised_points": [
      "• Cambodia's primary exports consist of garments, agricultural products, and fisheries, with ongoing efforts to diversify the national economy.",
      "• Evidence indicates some growth in value-added exports, which started from a low baseline, primarily driven by foreign multinational companies manufacturing electrical goods and telecommunications equipment within Cambodia.",
      "• Between 2008 and 2013, high-tech exports increased significantly from US$3.8 million to US$76.5 million, reflecting a notable expansion in this sector.",
      "• A major challenge for Cambodia’s industrial development is enhancing the technological capacity of numerous small and medium-sized enterprises (SMEs) engaged in agriculture, engineering, and natural sciences.",
      "• Large foreign firms in Cambodia, which are the main contributors to value-added exports, predominantly specialize in electrical machinery and telecommunications.",
      "• The key policy focus for science and technology is to promote spillovers—transfers of skills and innovation—from large foreign firms to smaller domestic firms and across different sectors.",
      "• The Law on Patents, Utility Model Certificates, and Industrial Designs enacted in 2006 has shown limited practical utility, benefiting primarily larger foreign firms operating in Cambodia.",
      "• By 2012, only 27 patent applications had been filed, all by foreign entities, indicating low local engagement in patenting activities.",
      "• Up to 2012, 42 applications for industrial designs had been received, with 40 filed by foreigners, further highlighting the dominance of foreign applicants.",
      "• Despite limited direct impact, the law has likely encouraged foreign firms to implement technological improvements in their local production systems, which is viewed as a positive development for technological advancement."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:19.694606",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1528,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Cambodia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "Investment (gross fixed)\n\n3% of GDP (2011 est.)\nHousehold income or consumption by percentage share\n\n* lowest 10%: 2.6%\n* highest 10%: 23.7% (2011)\n\nAgriculture - products\n\n* rice,\n* rubber,\n* corn,\n* vegetables,\n* cashews,\n* tapioca,\n* silk\n\nIndustries\n\n* tourism, garments, construction, rice milling, fishing, wood and wood products, rubber, cement, gem mining, textiles\n\nIndustrial production growth rate\n\n* 5.7% (2011 est.)\n\nElectricity\n\n...  | 2010  | 2011\n---|---|---\nproduction | 1.273 billion kWh | ...\nconsumption | 1.272 billion kWh | ...\nexports | 0 kWh | ...\nimports | 274 million kWh | ...\n\nExchange rates\n\nYear  | Riels (KHR) per US dollar\n---|---\n2012  | 4,097\n2011  | 4,395.62\n2010  | 4,145\n2009  | 4,139.33\n2008  | 4,070.94\n2007  | 4,006\n2006  | 4,103",
    "openai_summarised_points": [
      "• Investment in Cambodia, measured as gross fixed capital formation, accounted for approximately 3% of the country's Gross Domestic Product (GDP) in 2011.",
      "• Household income or consumption distribution by percentage share in 2011 showed that the lowest 10% of households held 2.6% of the total income or consumption, whereas the highest 10% held 23.7%.",
      "• Key agricultural products produced in Cambodia include rice, rubber, corn, vegetables, cashews, tapioca, and silk.",
      "• Major industries contributing to Cambodia's economy encompass tourism, garments, construction, rice milling, fishing, wood and wood products, rubber, cement, gem mining, and textiles.",
      "• The industrial production growth rate in 2011 was estimated at 5.7%.",
      "• Electricity data for Cambodia in 2010 and 2011 shows that electricity production was 1.273 billion kilowatt-hours (kWh) in 2010; the consumption in 2011 was approximately 1.272 billion kWh, with no electricity exports recorded in 2010 and 2011; imports of electricity in 2011 amounted to 274 million kWh.",
      "• Exchange rates between the Cambodian Riel (KHR) and the US dollar (USD) over recent years were as follows: in 2012, 4,097 Riels per USD; in 2011, 4,395.62 Riels per USD; in 2010, 4,145 Riels per USD; in 2009, 4,139.33 Riels per USD; in 2008, 4,070.94 Riels per USD; and in 2007, 4,006 Riels per USD; in 2006, 4,103 Riels per USD."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:29.219510",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 769,
      "bullet_points_count": 7
    }
  }
]