[
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Croatia is a developed mixed economy. It is one of the largest\neconomies in Southeast Europe by nominal gross domestic product (GDP). It is\nan open economy with accommodative foreign policy, highly dependent on\ninternational trade in Europe. Within Croatia, economic development varies\namong its counties, with strongest growth in Central Croatia and its financial\ncentre, Zagreb. It has a very high level of human development, low levels of\nincome inequality, and a high quality of life. Croatia's labor market has been\nperennially inefficient, with inconsistent business standards as well as\nineffective corporate and income tax policy.\n\nCroatia's economic history is closely linked to its historic nation-building\nefforts. Its pre-industrial economy leveraged the country's geography and\nnatural resources to guide agricultural growth. The 1800s saw a shipbuilding\nboom, railroading, and industrial production. During the 1900s, Croatia\nentered into a planned economy (with socialism) in 1941 and a command economy\n(with communism) during World War II. It experienced rapid urbanization in the\n1950s and decentralized in 1965, diversifying its economy before the collapse\nof Yugoslavia during the 1990s. The Croatian War of Independence (1991–95)\ncurbed 21–25% of wartime GDP, leaving behind a developing transition economy.\n\nThe modern Croatian economy is considered high-income and dominated by its\ntertiary service sector, which accounts for 70% of GDP. The high levels of\ntourism in Croatia contributes to nearly 20% of GDP, with a total of 20.6\nmillion tourists visiting in 2023. Croatia is an emerging energy power in\nSoutheast Europe, with strategic investments in liquefied natural gas (LNG),\ngeothermal networks, and electric transport. It supports regional economic\nactivity via transportation networks across the Adriatic Sea and throughout\nPan-European corridors. As a member of the European Union, Eurozone, and\nSchengen Area, it uses the euro (€) as official currency. Croatia has free-\ntrade agreements with many world nations and is a part of the World Trade\nOrganization (2000) and the EEA (2013).",
    "openai_summarised_points": [
      "• The economy of Croatia is classified as a developed mixed economy, characterized by a combination of private and public enterprise.",
      "• It is one of the largest economies in Southeast Europe based on nominal gross domestic product (GDP).",
      "• Croatia operates as an open economy with an accommodative foreign policy, heavily reliant on international trade within Europe.",
      "• Economic development within Croatia varies significantly among its counties, with the most robust growth observed in Central Croatia and its financial hub, Zagreb.",
      "• The country exhibits a very high level of human development, indicating advanced social and economic indicators.",
      "• Croatia maintains low levels of income inequality and a high quality of life for its citizens.",
      "• The Croatian labor market has historically been inefficient, plagued by inconsistent business standards and ineffective policies related to corporate and income taxation.",
      "• The country's economic history is closely tied to its nation-building efforts, reflecting its evolving political and economic landscape.",
      "• In its pre-industrial phase, Croatia's economy was driven by its geography and natural resources, fostering agricultural development.",
      "• The 1800s marked a period of economic expansion with a shipbuilding boom, increased rail infrastructure, and industrial production.",
      "• During the 20th century, Croatia transitioned into a planned economy with socialism in 1941 and adopted a command economy under communism during World War II.",
      "• The 1950s saw rapid urbanization, while economic decentralization occurred in 1965, leading to diversification before the collapse of Yugoslavia in the 1990s.",
      "• The Croatian War of Independence (1991–95) significantly impacted the economy, reducing wartime GDP by approximately 21–25%, and left the country in a transition phase.",
      "• The modern Croatian economy is classified as high-income, with the tertiary (service) sector dominating, contributing about 70% of GDP.",
      "• Tourism is a vital sector, generating nearly 20% of GDP, with 20.6 million tourists visiting Croatia in 2023.",
      "• Croatia is emerging as an energy power in Southeast Europe, with strategic investments in liquefied natural gas (LNG), geothermal energy, and electric transportation infrastructure.",
      "• The country supports regional economic activity through extensive transportation networks across the Adriatic Sea and along Pan-European corridors.",
      "• As a member of the European Union, Eurozone, and Schengen Area, Croatia uses the euro (€) as its official currency.",
      "• Croatia has established free-trade agreements with numerous countries worldwide.",
      "• It became a member of the World Trade Organization in 2000 and joined the European Economic Area (EEA) in 2013."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:02.465295",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2132,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Pre-20th century",
    "text": "Zagreb Stock Exchange Palace in 1927 Oil refinery in Rijeka in the 1930s\n\nWhen Croatia was still part of the Dual Monarchy, its economy was largely\nagricultural. Modern industrial companies were also located in the vicinity of\nthe larger cities. The Kingdom of Croatia had a high ratio of population\nworking in agriculture. Many industrial branches developed in that time, like\nforestry and wood industry (stave fabrication, the production of potash,\nlumber mills, shipbuilding). The most profitable one was stave fabrication,\nthe boom of which started in the 1820s with the clearing of the oak forests\naround Karlovac and Sisak and again in the 1850s with the marshy oak masses\nalong the Sava and Drava rivers. Shipbuilding in Croatia played a huge role in\nthe 1850s Austrian Empire, especially the long-range sailing boats. Sisak and\nVukovar were the centres of river-shipbuilding. Slavonia was also mostly an\nagricultural land and it was known for its silk production. Agriculture and\nthe breeding of cattle were the most profitable occupations of the\ninhabitants. It produced corn of all kinds, hemp, flax, tobacco, and great\nquantities of liquorice.\n\nThe first steps towards industrialization began in the 1830s and in the\nfollowing decades the construction of big industrial enterprises took place.\nDuring the 2nd half of the 19th and early 20th century there was an upsurge of\nindustry in Croatia, strengthened by the construction of railways and the\nelectric-power production. The industrial production was still lower than\nagricultural production. Regional differences were high. Industrialization was\nfaster in inner Croatia than in other regions, while Dalmatia remained one of\nthe poorest provinces of Austria-Hungary. The slow rate of modernization and\nrural overpopulation caused extensive emigration, particularly from Dalmatia.\nAccording to estimates, roughly 400,000 Croats emigrated from Austria-Hungary\nbetween 1880 and 1914. In 1910 8.5% of the population of Croatia-Slavonia\nlived in urban settlements.\n\nIn 1918 Croatia became part of the Kingdom of Yugoslavia, which was in the\ninterwar period one of the least developed countries in Europe. Most of its\nindustry was based in Slovenia and Croatia, but further industrial development\nwas modest and centered on textile mills, sawmills, brick yards and food-\nprocessing plants. The economy was still traditionally based on agriculture\nand raising of livestock, with peasants accounting for more than half of\nCroatia's population.\n\nIn 1941 the Independent State of Croatia (NDH), a World War II puppet state of\nGermany and Italy, was established in parts of Axis-occupied Yugoslavia. The\neconomic system of NDH was based on the concept of \"Croatian socialism\". The\nmain characteristic of the new system was the concept of a planned economy\nwith high levels of state involvement in economic life. The fulfillment of\nbasic economic interests was primarily ensured with measures of repression.\nAll large companies were placed under state control and the property of the\nregime's national enemies was nationalized. Its currency was the NDH kuna. The\nCroatian State Bank was the central bank, responsible for issuing currency. As\nthe war progressed the government kept printing more money and its amount in\ncirculation was rapidly increasing, resulting in high inflation rates.\n\nAfter World War II, the new Communist Party of Yugoslavia converted to a\ncommand economy on the Soviet model of rapid industrial development. In\naccordance with the communist plan, mainly companies in the pharmaceutical\nindustry, the food industry and the consumer goods industry were founded in\nCroatia. Metal and heavy industry was mainly promoted in Bosnia and Serbia. By\n1948 almost all domestic and foreign-owned capital had been nationalized. The\nindustrialization plan relied on high taxation, fixed prices, war reparations,\nSoviet credits, and export of food and raw materials. Forced collectivization\nof agriculture was initiated in 1949. At that time 94% of agricultural land\nwas privately owned, and by 1950 96% was under the control of the social\nsector. A rapid improvement of food production and the standard of living was\nexpected, but due to bad results the program was abandoned three years later.\n\nThroughout the 1950s Croatia experienced rapid urbanization. Decentralization\ncame in 1965 and spurred growth of several sectors including a prosperous\ntourist industry. SR Croatia was, after SR Slovenia, the second most developed\nrepublic in Yugoslavia with a ~55% higher GDP per capita than the Yugoslav\naverage, generating 31.5% of Yugoslav GDP or $30.1Bn in 1990. Croatia and\nSlovenia accounted for nearly half of the total Yugoslav GDP, and this was\nreflected in the overall standard of living. In the mid-1960s, Yugoslavia\nlifted emigration restrictions and the number of emigrants increased rapidly.\nIn 1971 224,722 workers from Croatia were employed abroad, mostly in West\nGermany. Foreign remittances contributed $2 billion annually to the economy by\n1990. Profits gained through Croatia's industry were used to develop poor\nregions in other parts of former Yugoslavia, leading to Croatia contributing\nmuch more to the federal Yugoslav economy than it gained in return. This,\ncoupled with austerity programs and hyperinflation in the 1980s, led to\ndiscontent in both Croatia and Slovenia which eventually fuelled political\nmovements calling for independence.\n\nA ship being built in Split, 2010 GDP of Croatia at constant 2010 prices from\n1990 to 2017 Real GDP growth in Croatia 2005–2015 Unemployment rate from 1996\nto 2019 according to Eurostat\n\nIn the late 1980s and early 1990s, with the collapse of socialism and the\nbeginning of economic transition, Croatia faced considerable economic problems\nstemming from:\n\n* the legacy of longtime communist mismanagement of the economy;\n* damage during the internecine fighting to bridges, factories, power lines, buildings, and houses;\n* the large refugee and displaced population, both Croatian and Bosnian;\n* the disruption of trade agreements; and\n* inefficient privatization\n\nAt the time Croatia gained independence, its economy (and the whole\nYugoslavian economy) was in the middle of a recession. Privatization under the\nnew government had barely begun when war broke out in 1991. As a result of the\nCroatian War of Independence, infrastructure sustained massive damage in the\nperiod 1991–92, especially the revenue-rich tourism industry. The\nprivatization of sovereign assets and transformation from a planned economy to\na market economy was thus slow and unsteady, largely as a result of public\nmistrust when many state-owned companies were sold to politically well-\nconnected at below-market prices. With the end of the war, Croatia's economy\nrecovered moderately, but corruption, cronyism, and a general lack of\ntransparency stymied economic reforms and foreign investment. The\nprivatization of large government-owned companies was practically halted\nduring the war and in the years immediately following the conclusion of peace.\nIn 2000, roughly 70% of Croatia's major companies were still state-owned,\nincluding water, electricity, oil, transportation, telecommunications, and\ntourism.\n\nThe early 1990s experienced high inflation. In 1991 the Croatian dinar was\nintroduced as a transitional currency, but inflation continued to accelerate.\nThe anti-inflationary stabilization steps in 1993 decreased retail price\ninflation from a monthly rate of 38.7% to 1.4%, and by the end of the year,\nCroatia experienced deflation. In 1994 Croatia introduced the kuna as its\ncurrency. As a result of the macro-stabilization programs, the negative growth\nof GDP during the early 1990s stopped and reversed into a positive trend.\nPost-war reconstruction activity provided another impetus to growth. Consumer\nspending and private sector investments, both of which were postponed during\nthe war, contributed to the growth in 1995–1997. Croatia began its\nindependence with a relatively low external debt because the debt of\nYugoslavia was not shared among its former republics at the beginning. In\nMarch 1995 Croatia agreed with the Paris Club of creditor governments and took\n28.5% of Yugoslavia's previously non-allocated debt over 14 years. In July\n1996 an agreement was reached with the London Club of commercial creditors,\nwhen Croatia took 29.5% of Yugoslavia's debt to commercial banks. In 1997\naround 60 percent of Croatia's external debt was inherited from former\nYugoslavia.\n\nAt the beginning of 1998 value-added tax was introduced. The central\ngovernment budget was in surplus in that year, most of which was used to repay\nforeign debt. Government debt to GDP had fallen from 27.30% to 26.20% at the\nend of 1998. However, the consumer boom was disrupted in mid 1998, as a result\nof the bank crisis when 14 banks went bankrupt. Unemployment increased and GDP\ngrowth slowed down to 1.9%. The recession that began at the end of 1998\ncontinued through most of 1999, and after a period of expansion GDP in 1999\nhad a negative growth of −0.9%. In 1999 the government tightened its fiscal\npolicy and revised the budget with a 7% cut in spending.\n\nIn 1999 the private sector share in GDP reached 60%, which was significantly\nlower than in other former socialist countries. After several years of\nsuccessful macroeconomic stabilization policies, low inflation and a stable\ncurrency, economists warned that the lack of fiscal changes and the expanding\nrole of the state in the economy caused the decline in the late 1990s and were\npreventing sustainable economic growth.",
    "openai_summarised_points": [
      "• During the period when Croatia was part of the Dual Monarchy, its economy was predominantly agricultural, with modern industrial companies primarily located near larger cities.",
      "• The Kingdom of Croatia had a high proportion of its population engaged in agriculture, with significant development in forestry and wood industries, including stave fabrication, potash production, lumber mills, and shipbuilding.",
      "• Stave fabrication was the most profitable industry, experiencing a boom starting in the 1820s due to oak forest clearing around Karlovac and Sisak, and again in the 1850s along the Sava and Drava rivers.",
      "• Shipbuilding in Croatia played a crucial role in the 1850s within the Austrian Empire, especially for long-range sailing vessels, with Sisak and Vukovar serving as key centers for river-shipbuilding.",
      "• Slavonia was mainly an agricultural region known for silk production, with the local economy relying heavily on agriculture and cattle breeding, producing crops such as corn, hemp, flax, tobacco, and large quantities of liquorice.",
      "• Industrialization efforts began in the 1830s, with subsequent decades seeing the construction of large industrial enterprises, driven by railway expansion and electricity generation.",
      "• Despite industrial growth, agricultural production remained higher than industrial output, with significant regional disparities: inner Croatia experienced faster industrialization, whereas Dalmatia remained one of Austria-Hungary’s poorest provinces.",
      "• Slow modernization and rural overpopulation led to extensive emigration, especially from Dalmatia, with an estimated 400,000 Croats emigrating from Austria-Hungary between 1880 and 1914.",
      "• In 1910, 8.5% of Croatia-Slavonia’s population resided in urban areas.",
      "• After 1918, Croatia became part of the Kingdom of Yugoslavia, which during the interwar period was among Europe's least developed countries.",
      "• Yugoslavia’s industry was concentrated mainly in Slovenia and Croatia, with modest development focused on textiles, sawmills, brick yards, and food processing; the economy remained largely agricultural with peasant farming constituting over half of the population.",
      "• In 1941, the Independent State of Croatia (NDH), a WWII puppet state of Germany and Italy, was established in parts of Axis-occupied Yugoslavia, adopting a \"Croatian socialism\" economic model characterized by a planned economy with high state involvement.",
      "• The NDH’s economic system involved nationalization of large companies and property of regime enemies, issuance of the NDH kuna currency, and central banking by the Croatian State Bank; inflation soared as the government printed more money during the war.",
      "• Post-World War II, the Communist Party of Yugoslavia implemented a Soviet-style command economy, emphasizing rapid industrial development, with Croatia focusing on pharmaceuticals, food, and consumer goods industries.",
      "• By 1948, nearly all domestic and foreign capital had been nationalized; the industrialization plan relied on high taxation, fixed prices, war reparations, Soviet credits, and export of food and raw materials.",
      "• Forced collectivization of agriculture began in 1949, with private ownership of land decreasing from 94% in 1949 to 96% under social sector control by 1950; the program aimed to improve food production but was abandoned after three years due to poor results.",
      "• Croatia experienced rapid urbanization during the 1950s, and decentralization in 1965 spurred growth in sectors including tourism.",
      "• By the late 20th century, SR Croatia was the second most developed Yugoslav republic after Slovenia, with a GDP per capita approximately 55% higher than the Yugoslav average, contributing 31.5% of Yugoslavia’s GDP, valued at $30.1 billion in 1990.",
      "• Croatia and Slovenia together accounted for nearly half of Yugoslavia’s total GDP, reflecting higher living standards; in 1971, 224,722 Croatian workers were employed abroad, mainly in West Germany, with remittances contributing about $2 billion annually by 1990.",
      "• Profits from Croatian industry were used to develop poorer regions elsewhere in Yugoslavia, resulting in Croatia contributing more to the federal economy than it received, which, along with austerity and hyperinflation in the 1980s, fueled discontent and independence movements.",
      "• In the late 1980s and early 1990s, Croatia faced severe economic challenges due to legacy issues from communist mismanagement, wartime destruction of infrastructure, large refugee and displaced populations, disrupted trade agreements, and inefficient privatization.",
      "• At independence, Croatia’s economy was in recession; privatization was only beginning when the Croatian War of Independence erupted in 1991, causing extensive damage to infrastructure and the tourism sector.",
      "• The transition from a planned to a market economy was slow and unstable, hindered by public mistrust and sale of state companies at below-market prices to politically connected individuals.",
      "• Post-war economic recovery was moderate, but corruption, cronyism, and lack of transparency impeded reforms and foreign investment; by 2000, approximately 70% of major companies, including utilities and tourism enterprises, remained state-owned.",
      "• In 1991, Croatia introduced the Croatian dinar as a transitional currency amid high inflation; stabilization measures in 1993 reduced monthly inflation from 38.7% to 1.4%, leading to deflation by year’s end.",
      "• In 1994, Croatia adopted the kuna as its official currency; macroeconomic stabilization halted GDP decline, and post-war reconstruction spurred growth in 1995–1997.",
      "• Croatia inherited a relatively low external debt initially; in March 1995, it agreed with the Paris Club to assume 28.5% of Yugoslavia’s non-allocated debt over 14 years, and in July 1996, it took 29.5% of Yugoslavia’s debt to commercial banks, with about 60% of its external debt originating from Yugoslavia by 1997.",
      "• In 1998, Croatia introduced a value-added tax, and the central government budget was in surplus, primarily used to repay foreign debt; government debt to GDP decreased from 27.30% to 26.20% at year’s end.",
      "• The bank crisis in mid-1998, which led to the bankruptcy of 14 banks, disrupted consumer spending and slowed GDP growth to 1.9%; recession persisted into 1999, with GDP contracting by −0.9%.",
      "• In 1999, the government implemented fiscal tightening, cutting spending by 7%, as the private sector’s contribution to GDP was 60%, lower than in other post-socialist countries.",
      "• Despite macroeconomic stabilization, concerns arose that lack of fiscal reforms and expanding state role hindered sustainable growth, as inflation remained low and currency stability was maintained."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:12.016707",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 9579,
      "bullet_points_count": 31
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "21st century",
    "text": "The new government led by the president of SDP, Ivica Račan, carried out a\nnumber of structural reforms after it won the parliamentary elections on 3\nJanuary 2000. The country emerged from the recession in the 4th quarter of\n1999 and growth picked up in 2000. Due to overall increase in stability, the\neconomic rating of the country improved and interest rates dropped. Economic\ngrowth in the 2000s was stimulated by a credit boom led by newly privatized\nbanks, capital investment, especially in road construction, a rebound in\ntourism and credit-driven consumer spending. Inflation remained tame and the\ncurrency, the kuna, stable. In 2000 Croatia generated 5,899 billion kunas in\ntotal income from the shipbuilding sector, which employed 13,592 people. Total\nexports in 2001 amounted to $4,659,286,000, of which 54.7% went to the\ncountries of the EU. Croatia's total imports were $9,043,699,000, 56% of which\noriginated from the EU.\n\nUnemployment reached its peak in late 2002, but has since been steadily\ndeclining. In 2003, the nation's economy would officially recover to the\namount of GDP it had in 1990. In late 2003 the new government led by HDZ took\nover the office. Unemployment continued falling, powered by growing industrial\nproduction and rising GDP, rather than only seasonal changes from tourism.\nUnemployment reached an all-time low in 2008 when the annual average rate was\n8.6%, GDP per capita peaked at $16,158, while public debt as percentage of GDP\ndecreased to 29%. Most economic indicators remained positive in this period\nexcept for the external debt as Croatian firms focused more on empowering the\neconomy by taking loans from foreign resources. Between 2003 and 2007,\nCroatia's private-sector share of GDP increased from 60% to 70%. The Croatian\nNational Bank took steps to curb further growth of indebtedness of local banks\nwith foreign banks. The dollar debt figure is adversely affected by the EUR-\nUSD ratio—over a third of the increase in debt since 2002 is due to currency\nvalue changes.\n\nEconomic growth declined due to the 2008 financial crisis. Immediately after\nthe crisis it seemed that Croatia did not suffer serious consequences like\nsome other countries. However, in 2009, the crisis gained momentum and the\ndecline in GDP growth, at a slower pace, continued during 2010. In 2011 the\nGDP stagnated as the growth rate was zero. Since the global crisis hit the\ncountry, the unemployment rate has been steadily increasing, resulting in the\nloss of more than 100,000 jobs. While unemployment was 9.6% in late 2007, in\nJanuary 2014 it peaked at 22.4%. In 2010 Gini coefficient was 0,32. In\nSeptember 2012, Fitch ratings agency unexpectedly improved Croatia's economic\noutlook from negative to stable, reaffirming Croatia's current BBB rating. The\nslow pace of privatization of state-owned businesses and an over-reliance on\ntourism have also been a drag on the economy.\n\nCroatia joined the European Union on 1 July 2013 as the 28th member state. The\nCroatian economy is heavily interdependent on other principal economies of\nEurope, and any negative trends in these larger EU economies also have a\nnegative impact on Croatia. Italy, Germany and Slovenia are Croatia's most\nimportant trade partners. In spite of the rather slow post-recession recovery,\nin terms of income per capita it is still ahead of some European Union member\nstates such as Bulgaria, and Romania. In terms of minimum monthly wage,\nCroatia is ahead of 9 EU members (Greece, Malta, Estonia, Czech Republic,\nSlovakia, Romania, Latvia, Hungary, and Bulgaria) at €970.\n\nThe annual average unemployment rate in 2014 was 17.3% and Croatia has the\nthird-highest unemployment rate in the European Union, after Greece (26.5%),\nand Spain (24.%). Of particular concern is the heavily backlogged judiciary\nsystem, combined with inefficient public administration, especially regarding\nthe issues of land ownership and corruption in the public sector. Unemployment\nis regionally uneven: it is very high in eastern and southern parts of the\ncountry, nearing 20% in some areas, while relatively low in the north-west and\nin larger cities, where it is between 3 and 7%. In 2015 external debt rose by\n€2.7 billion since the end of 2014 and as of December 2022 is around €50.9\nbillion.",
    "openai_summarised_points": [
      "• Following the parliamentary elections on 3 January 2000, the new government led by Ivica Račan, president of the Social Democratic Party (SDP), implemented a series of structural reforms aimed at stabilizing and revitalizing the Croatian economy.",
      "• Croatia emerged from a recession in the 4th quarter of 1999, with economic growth accelerating in 2000, supported by increased stability, improved economic ratings, and declining interest rates.",
      "• The country's economic rating improved during this period, leading to a reduction in interest rates and fostering a more favorable investment climate.",
      "• Economic growth in the 2000s was driven by a credit boom initiated by newly privatized banks, increased capital investment notably in road infrastructure, a rebound in tourism, and credit-fueled consumer spending.",
      "• Inflation remained controlled and stable during this period, and the Croatian kuna maintained currency stability.",
      "• In 2000, Croatia generated a total income of 5,899 billion kunas from the shipbuilding sector, which employed 13,592 workers.",
      "• In 2001, Croatia’s total exports amounted to $4,659,286,000, with 54.7% of these exports directed to EU countries.",
      "• Croatia’s total imports in 2001 were valued at $9,043,699,000, with 56% originating from the EU.",
      "• Unemployment peaked in late 2002 but subsequently declined steadily, reflecting improvements in industrial production and GDP growth.",
      "• By 2003, Croatia’s GDP had recovered to the level recorded in 1990, indicating a significant economic turnaround.",
      "• In late 2003, the government transitioned to leadership under the Croatian Democratic Union (HDZ), which contributed to continued declines in unemployment, driven by industrial growth and rising GDP rather than seasonal tourism effects.",
      "• The unemployment rate reached an all-time low of 8.6% in 2008, with GDP per capita peaking at $16,158, and public debt as a percentage of GDP decreasing to 29%.",
      "• Most economic indicators remained positive during this period, although external debt increased as Croatian firms increasingly relied on foreign loans to strengthen the economy.",
      "• Between 2003 and 2007, the private sector’s share of GDP grew from 60% to 70%, reflecting a shift towards privatization and private enterprise.",
      "• The Croatian National Bank implemented measures to curb excessive growth of bank indebtedness, especially concerning foreign bank loans, with over a third of the increase in debt since 2002 attributable to currency fluctuations, notably the EUR-USD ratio.",
      "• The 2008 global financial crisis caused a decline in Croatia’s economic growth; initially, the country appeared relatively resilient, but by 2009, the crisis intensified, leading to continued GDP decline through 2010 and stagnation in 2011 with zero growth.",
      "• The unemployment rate increased steadily post-2008 crisis, resulting in the loss of over 100,000 jobs; it was 9.6% in late 2007 and peaked at 22.4% in January 2014.",
      "• In 2010, Croatia’s Gini coefficient was 0.32, indicating income inequality levels.",
      "• In September 2012, Fitch Ratings unexpectedly upgraded Croatia’s economic outlook from negative to stable, reaffirming a BBB credit rating.",
      "• Challenges hindering economic growth included slow privatization of state-owned enterprises and over-reliance on tourism.",
      "• Croatia joined the European Union on 1 July 2013 as the 28th member state, increasing economic interdependence with other EU economies, notably Italy, Germany, and Slovenia, which are its primary trade partners.",
      "• Despite slow post-recession recovery, Croatia’s income per capita remains higher than some EU member states such as Bulgaria and Romania.",
      "• Croatia’s minimum monthly wage is €970, surpassing nine EU countries: Greece, Malta, Estonia, Czech Republic, Slovakia, Romania, Latvia, Hungary, and Bulgaria.",
      "• The average unemployment rate in 2014 was 17.3%, making Croatia the third-highest in the EU after Greece (26.5%) and Spain (24%).",
      "• Structural issues include a heavily backlogged judiciary system, inefficient public administration, land ownership disputes, and corruption, which impede economic progress.",
      "• Regional disparities in unemployment are significant: eastern and southern regions experience rates nearing 20%, while larger cities and north-western areas have unemployment between 3% and 7%.",
      "• External debt increased by €2.7 billion in 2015 since the end of 2014, reaching approximately €50.9 billion as of December 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:26.260185",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4272,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "2016–2019",
    "text": "During 2015 the Croatian economy started with slow but upward economic growth,\nwhich continued during 2016 and conclusive at the end of the year seasonally\nadjusted was recorded at 3.5%. The better than expected figures during 2016\nenabled the Croatian Government and with more tax receipts enabled the\nrepayment of debt as well as narrow the current account deficit during Q3 and\nQ4 of 2016 This growth in economic output, coupled with the reduction of\ngovernment debt has made a positive impact on the financial markets with many\nratings agencies revising their outlook from negative to stable, which was the\nfirst upgrade of Croatia's credit rating since 2007. Due to consecutive months\nof economic growth and the demand for labour, plus the outflows of residents\nto other European countries, Croatia had recorded the biggest fall in the\nnumber of unemployed during the month of November 2016 from 16.1% to 12.7%.",
    "openai_summarised_points": [
      "• In 2015, the Croatian economy experienced slow but positive growth, which continued into 2016.",
      "• By the end of 2016, seasonally adjusted economic growth was recorded at 3.5%.",
      "• The better-than-expected economic figures in 2016 allowed the Croatian Government to increase tax receipts.",
      "• Increased tax revenues enabled the government to repay debt and reduce the current account deficit during the third and fourth quarters of 2016.",
      "• The growth in economic output and the reduction of government debt positively impacted financial markets in Croatia.",
      "• Several credit rating agencies revised Croatia’s outlook from negative to stable in 2016, marking the first upgrade of Croatia's credit rating since 2007.",
      "• Due to continuous economic growth and increased demand for labor, Croatia experienced a significant decline in unemployment rates in November 2016, from 16.1% to 12.7%.",
      "• The decline in unemployment was also influenced by outflows of residents to other European countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:29.808033",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 916,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "2020",
    "text": "COVID-19 Pandemic has caused more than 400,000 workers to file for economic\naid of 4000.00 HRK./month. In the first quarter of 2020, Croatian GDP rose by\n0.2% but then in Q2 Government of Croatia announced the biggest quarterly GDP\nplunge of -15.1% since GDP has been measured. Economic activity also plunged\nin Q3 2020 when GDP slid by an additional -10.0%.\n\nIn autumn 2020 European Commission estimated total GDP loss in 2020 to be\n-9.6%. Growth was set to pick up in the last month of Q1 2021 and the second\nquarter of 2021 respectively +1.4% and +3.0%, meaning that Croatia was set to\nreach 2019 levels by 2022.",
    "openai_summarised_points": [
      "• The COVID-19 pandemic led to over 400,000 Croatian workers filing for economic aid, each receiving 4,000 HRK per month.",
      "• In the first quarter of 2020, Croatia's Gross Domestic Product (GDP) increased marginally by 0.2%.",
      "• During the second quarter of 2020, the Croatian government announced a significant GDP decline of -15.1%, marking the largest quarterly decrease since GDP measurement began.",
      "• In the third quarter of 2020, economic activity further contracted, with GDP decreasing by an additional -10.0%.",
      "• The European Commission estimated the total GDP loss for Croatia in 2020 to be -9.6%.",
      "• Economic growth was projected to recover in the last month of the first quarter of 2021, with an estimated increase of +1.4%.",
      "• In the second quarter of 2021, Croatia's GDP was forecasted to grow by +3.0%.",
      "• These projections indicated that Croatia was expected to return to its 2019 GDP levels by the year 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:34.525542",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 615,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "2021",
    "text": "In July 2021 projection was improved to 5.4% due to the strong outturn in the\nfirst quarter and the positive high-frequency indicators concerning\nconsumption, construction, industry and tourism prospects. In November 2021\nCroatia outperformed these projections and the real GDP growth was calculated\nto be 8.1% for the year 2021, improving its projection of 5.4% GDP growth made\nin July. The recovery was supported by strong private consumption, the better-\nthan-expected performance of tourism and the ongoing resilience of the export\nsector. Preliminary data point to tourism-related expenditure already\nexceeding 2019 levels, which has been supportive of both employment and\nconsumption. Exports of goods have also continued to perform strongly (up\n43%yoy in 2Q21) pointing to resilient competitiveness. Croatian merchandise\nexports in the first nine months of 2021 amounted to €13.3 billion, an annual\nincrease of 24.6%. At the same time, imports rose 20.3% to €20.4 billion. The\ncoverage of imports by exports for the first nine months is 65.4%. This made\n2021 Croatian export's record year as the trade off-set from 2019 was exceeded\nby €2 billion.\n\nExports recovered in all major markets, more precisely with all EU countries\nand CEFTA countries. Specifically, on the EU market, only a lower export\nresult is recorded in relations with Sweden, Belgium and Luxembourg. Italy is\nagain the main market for Croatian products, followed by Germany and Slovenia.\nApart from the high contribution of crude oil that Ina sends to Hungary to the\nMol refinery for processing, the export of artificial fertilizers from\nPetrokemija also has a significant contribution to growth.\n\nFor 2022, the Commission revised downwards its projection for Croatia's\neconomic growth to 5.6% from 5.9% previously predicted in July 2021.\nCommission again confirmed that the volume of Croatia's GDP should reach its\n2019 level during 2022, while in 2023 the GDP will grow by 3.4%. The\nCommission warned that the key downside risks stem from Croatia's relatively\nlow vaccination rates, which could lead to stricter containment measures, and\ncontinued delays of the earthquake-related reconstruction. Croatia's entry\ninto the Schengen area and euro adoption towards the end of the forecast\nperiod could benefit investment and trade.\n\nOn Friday, 12 November 2021 Fitch raised Croatia's credit rating by one level,\nfrom ‘BBB−‘ to ‘BBB’, Croatia's highest credit rating in history, with a\npositive outlook, noting progress in preparations for Eurozone membership and\na strong recovery of the Croatian economy from the pandemic crisis. This is\nalso secured by the failure of the eurosceptic party Hrvatski Suverenisti in a\nbid on the referendum to block Euro adoption in Croatia. In December 2021\nCroatia's industrial production increased for the thirteenth consecutive\nmonth, observing the growth of production increasing in all of the five\naggregates. meaning that industrial production in 2021 increased by 6.7\npercent.\n\nIn 2021 Croatia joined the list of countries with its own automobile industry,\nwith Rimac Automobili's Nevera started being produced. The company also took\nover Bugatti Automobiles in November same year and started building its new HQ\nin Zagreb, titled as the \"Rimac Campus\", that will serve as the company's\ninternational research and development (R&D) and production base for all\nfuture Rimac products, as well as home of R&D for future Bugatti models. The\ncompany also plans to build battery systems for different manufacturers from\nthe automotive industry This campus will also become the home of R&D for\nfuture Bugatti models due to the new joint venture, though these vehicles will\nbe built at Bugatti's Molsheim plant in France.",
    "openai_summarised_points": [
      "• In July 2021, Croatia's GDP growth projection was improved to 5.4% due to a strong first quarter performance and positive high-frequency indicators related to consumption, construction, industry, and tourism prospects.",
      "• By November 2021, Croatia outperformed the July projections, with the real GDP growth for 2021 calculated at 8.1%, significantly exceeding the earlier forecast of 5.4%.",
      "• The economic recovery in 2021 was supported by strong private consumption, better-than-expected tourism performance, and the ongoing resilience of the export sector.",
      "• Preliminary data indicated that tourism-related expenditure in 2021 already exceeded 2019 levels, positively impacting employment and consumption.",
      "• Croatian exports of goods in the first nine months of 2021 totaled €13.3 billion, representing an annual increase of 24.6%.",
      "• Imports during the same period rose by 20.3% to €20.4 billion.",
      "• The coverage of imports by exports for the first nine months was 65.4%.",
      "• The year 2021 marked a record year for Croatian exports, with the trade deficit from 2019 being exceeded by €2 billion.",
      "• Export recovery was observed across all major markets, including all EU countries and CEFTA countries, with only lower export results noted in relations with Sweden, Belgium, and Luxembourg.",
      "• Italy remained Croatia's main export market, followed by Germany and Slovenia.",
      "• Key contributors to export growth included crude oil sent by Ina to Hungary for processing at the Mol refinery and artificial fertilizers exported by Petrokemija.",
      "• For 2022, the European Commission revised Croatia's GDP growth forecast downward from 5.9% to 5.6%.",
      "• The Commission confirmed that Croatia's GDP should return to its 2019 level during 2022, with an expected growth of 3.4% in 2023.",
      "• Downside risks identified by the Commission include Croatia's relatively low vaccination rates, which could lead to stricter containment measures, and delays in earthquake-related reconstruction efforts.",
      "• Potential benefits from Croatia's entry into the Schengen area and adoption of the euro towards the end of the forecast period could enhance investment and trade.",
      "• On 12 November 2021, Fitch Ratings upgraded Croatia's credit rating from ‘BBB−’ to ‘BBB’, its highest rating in history, with a positive outlook, citing progress in Eurozone accession preparations and a strong economic recovery from the pandemic.",
      "• The upgrade was also supported by the failure of the eurosceptic party Hrvatski Suverenisti in a referendum attempt to block euro adoption.",
      "• In December 2021, Croatia's industrial production increased for the thirteenth consecutive month, with growth observed across all five industrial aggregates, resulting in a 6.7% increase for the year 2021.",
      "• In 2021, Croatia joined the list of countries with its own automobile industry, notably with Rimac Automobili beginning production of the Nevera model.",
      "• Rimac Automobili acquired Bugatti Automobiles in November 2021 and started constructing the \"Rimac Campus\" in Zagreb, which will serve as the company's international R&D and production hub for future Rimac and Bugatti models.",
      "• The Rimac Campus is planned to host R&D activities for future Bugatti vehicles, which will be manufactured at Bugatti's Molsheim plant in France.",
      "• Rimac Automobili plans to develop battery systems for various automotive manufacturers, expanding its role in the automotive industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:20:41.096433",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3728,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "2022",
    "text": "In late March 2022 Croatian Bureau of Statistics announced that Croatia's\nindustrial output rose by 4% in February, thus growing for 15 months in a row.\nCroatia continued to have strong growth during 2022 fuelled by tourism revenue\nand increased exports. According to a preliminary estimate, Croatia's GDP in\nQ2 grew by 7.7% from the same period of 2021. The International Monetary Fund\n(IMF) projected in early September 2022 that Croatia's economy will expand by\n5.9% in 2022, whilst EBRD expects Croatian GDP growth to reach 6.5% by the end\nof 2022. Pfizer announced launching a new production plant in Savski Marof\nwhilst Croatian IT industry grew 3.3% confirming the trend that started with\nCoronavirus pandemic where the Croatia's digital economy increased by 16\npercent on average annually from 2019 to 2021. It is estimated that by 2030\nits value could reach 15 percent of GDP, with the ICT sector being the main\ndriver of that growth.\n\nIn 2022, Croatian economy is expected to grow between 5.9 and 7.8% in real\nterms and it is expected to reach between $72 and $73.6 billion according to\npreliminary estimates by Croatian Government surpassing early estimates of 491\nbillion kuna or $68.5 billion. Croatian Purchasing Power Parity in 2022 for\nthe first time should exceed $40 000, however considering Croatian economy\nexperienced 6 years of deep recession, catching up will take several more\nyears of high growth. Economic outlook for 2023 for Croatian economy are\nmixed, depends largely on how the big Eurozone economies perform, Croatia's\nlargest trading partners; Italy, Germany, Austria, Slovenia and France are\nexpected to slow down, but avoid recession according to latest economic\nprojections and estimates, so Croatian economy as a result could see better\nthan expected results in 2023, early projections of between 1 and 2.6%\neconomic growth in 2023 with inflation at 7% is a significant slow down for\nthe country, however country is experiencing major internal and inward\ninvestment cycle unparalleled in recent history. EU recovery funds in tune of\n€8.7 billion coupled with large EU investments in recently earthquake affected\nareas of Croatia, as well as major investments by local business in to\nrenewable energy sector, also EU supported and funded, as well as major\ninvestments in transport infrastructure and rapidly expanding Croatia's ICT\nsector, Croatian economy could see continuation of rapid growth in 2023.\n\nOn 12 July 2022, the Eurogroup approved Croatia becoming the 20th member of\nthe Eurozone, with the formal introduction of the Euro currency to take place\non 1 January 2023. Croatia joined the Schengen Area in 2023. By 2023, the\nminimum wage is expected to rise to NET 700 EUR, increasing consumer spending."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Sectors",
    "text": "In 2022, the sector with the highest number of companies registered in Croatia\nis Services with 110,085 companies followed by Retail Trade and Construction\nwith 22,906 and 22,121 companies respectively."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Industry",
    "text": "* Uljanik shipyard\n\n* Asphalt plant in Ivanovec\n\n* Sisak oil refinery\n\n* Maraska liqueur factory in Zadar"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Tourism",
    "text": "* Cruise ship in Dubrovnik.\n\n* Kopački Rit Nature park.\n\n* St. Mark's Church in Zagreb.\n\n* Varaždin Old Town.\n\n* Zlatni Rat beach on the island of Brač.\n\nTourism is a notable source of income during the summer and a major industry\nin Croatia. In 2019, it dominates the Croatian service sector and accounts for\nup to 11.8% of Croatian GDP. In 2023, 15.8 million international tourists\nvisited Croatia. Annual tourist industry income for 2011 was estimated at\n€6.61 billion. Its positive effects are felt throughout the economy of Croatia\nin terms of increased business volume observed in retail business, processing\nindustry orders and summer seasonal employment. The industry is considered an\nexport business, because it significantly reduces the country's external trade\nimbalance. Since the conclusion of the Croatian War of Independence, the\ntourist industry has grown rapidly, recording a fourfold rise in tourist\nnumbers, with more than 10 million tourists each year. The most numerous are\ntourists from Germany, Slovenia, Austria and the Czech Republic as well as\nCroatia itself. Length of a tourist stay in Croatia averages 4.9 days.\n\nThe bulk of the tourist industry is concentrated along the Adriatic Sea coast.\nOpatija was the first holiday resort since the middle of the 19th century. By\nthe 1890s, it became one of the most significant European health resorts.\nLater a large number of resorts sprang up along the coast and numerous\nislands, offering services ranging from mass tourism to catering and various\nniche markets, the most significant being nautical tourism, as there are\nnumerous marinas with more than 16 thousand berths, cultural tourism relying\non appeal of medieval coastal cities and numerous cultural events taking place\nduring the summer. Inland areas offer mountain resorts, agrotourism and spas.\nZagreb is also a significant tourist destination, rivalling major coastal\ncities and resorts.\n\nCroatia has unpolluted marine areas reflected through numerous nature reserves\nand 99 Blue Flag beaches and 28 Blue Flag marinas. Croatia is ranked as the\n18th most popular tourist destination in the world. About 15% of these\nvisitors (over one million per year) are involved with naturism, an industry\nfor which Croatia is world-famous. It was also the first European country to\ndevelop commercial naturist resorts."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Agriculture",
    "text": "* Boškarin cattle.\n\n* Plantations in the fertile Neretva valley.\n\n* Vineyards of Istria.\n\n* Horse breeding\n\nCroatian agricultural sector subsists from exports of blue water fish, which\nin recent years experienced a tremendous surge in demand, mainly from Japan\nand South Korea. Croatia is a notable producer of organic foods and much of it\nis exported to the European Union. Croatian wines, olive oil and lavender are\nparticularly sought after. Value of Croatia's agriculture sector is around 3.1\nbillion according to preliminary data released by the national statistics\noffice.\n\nCroatia has around 1.72 million hectares of agricultural land, however totally\nutilized land for agricultural in 2020 was around 1.506 million hectares, of\nthese permanent pasture land constituted 536 000 hectares or some 35.5% of\ntotal land available to agriculture. Croatia imports significant quantity of\nfruits and olive oil, despite having large domestic production of the same. In\nterms of livestock Croatian agriculture had some 15.2 million poultry, 453 000\nCattle, 802 000 Sheep, 1.157 000 Pork/Pigs,88 000 Goats. Croatia also produced\n67 000 tons of blue fish, some 9000 of these are Tuna fish, which are farmed\nand exported to Japan, South Korea and United States.\n\nA comprehensive summary of Croatia's agricultural output in 2022:\n\n* 1.66 million tons of maize;\n* 970 thousand tons of wheat;\n* 524 thousand tons of sugar beet (the beet is used to manufacture sugar and ethanol);\n* 319 thousand tons of barley;\n* 196 thousand tons of soybean;\n* 154 thousand tons of sunflower seed;\n* 146 thousand tons of grape;\n* 107 thousand tons of potato;\n* 59 thousand tons of rapeseed;\n\nIn addition to smaller productions of other agricultural products, like apple\n(93 thousand tons), triticale (62 thousand tons) and olive (34 thousand tons)."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Transport",
    "text": "The country's longest motorway, A1, in 2010\n\nThe highlight of Croatia's recent infrastructure developments is its rapidly\ndeveloped motorway network, largely built in the late 1990s and especially in\nthe 2000s. By January 2022, Croatia had completed more than 1,300 kilometres\n(810 miles) of motorways, connecting Zagreb to most other regions and\nfollowing various European routes and four Pan-European corridors. The busiest\nmotorways are the A1, connecting Zagreb to Split and the A3, passing east–west\nthrough northwest Croatia and Slavonia. A widespread network of state roads in\nCroatia acts as motorway feeder roads while connecting all major settlements\nin the country. The high quality and safety levels of the Croatian motorway\nnetwork were tested and confirmed by several EuroTAP and EuroTest programs.\n\nCroatia has an extensive rail network spanning 2,722 kilometres (1,691 miles),\nincluding 985 kilometres (612 miles) of electrified railways and 254\nkilometres (158 miles) of double track railways. The most significant railways\nin Croatia are found within the Pan-European transport corridor Vb and\ncorridor X connecting Rijeka to Budapest and Ljubljana to Belgrade, both via\nZagreb. All rail services are operated by Croatian Railways.\n\nThere are international airports in Zagreb, Zadar, Split, Dubrovnik, Rijeka,\nOsijek and Pula. As of January 2011, Croatia complies with International Civil\nAviation Organization aviation safety standards and the Federal Aviation\nAdministration upgraded it to Category 1 rating.\n\nThe busiest cargo seaport in Croatia is the Port of Rijeka and the busiest\npassenger ports are Split and Zadar. In addition to those, a large number of\nminor ports serve an extensive system of ferries connecting numerous islands\nand coastal cities in addition to ferry lines to several cities in Italy. The\nlargest river port is Vukovar, located on the Danube, representing the\nnation's outlet to the Pan-European corridor VII."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Energy",
    "text": "An oil refinery near Rijeka, 2012 A hydroelectric power plant in Međimurje,\n2014\n\nThere are 631 kilometres (392 miles) of crude oil pipelines in Croatia,\nconnecting the JANAF oil terminal with refineries in Rijeka and Sisak, as well\nas several transhipment terminals. The system has a capacity of 20 million\ntonnes per year. The natural gas transportation system comprises 2,544\nkilometres (1,581 miles) of trunk and regional natural gas pipelines, and more\nthan 300 associated structures, connecting production rigs, the Okoli natural\ngas storage facility, 27 end-users and 37 distribution systems.\n\nCroatian production of energy sources covers 29% of nationwide natural gas\ndemand and 26% of oil demand. In 2023, net total electrical power production\nin Croatia reached 16,378 GWh and Croatia imported 26% of its electric power\nenergy needs. The bulk of Croatian imports are supplied by the Krško Nuclear\nPower Plant in Slovenia, 50% owned by Hrvatska elektroprivreda, providing 12%\nof Croatia's electricity.\n\n**Electricity:**\n\n* Production: 13,696 GWh (2022)\n* Consumption: 18,391 GWh (2022)\n* Exports: 7,225 GWh (2022)\n* Imports: 11,920 GWh (2022)\n\n**Electricity:**\n\n* Hydro: 34% (2023)\n* Thermal: 21% (2023)\n* Nuclear: 12% (2023)\n* Renewable: 7% (2023)\n* Imports: 26% (2023)\n\n**Crude Oil:**\n\n* Production: 594 thousand tons (2022)\n* Consumption: 2.306 million tons (2022)\n* Exports: 202 thousand tons (2022)\n* Imports: 1,979 million tons (2022)\n* Proved Reserves: 3,508,900 cubic metres (22,070,000 bbl) (2022)\n\n**Natural Gas:**\n\n* Production: 745 million m3 (2022)\n* Consumption: 2,529 billion m3 (2022)\n* Exports: 1,063 million m3 (2022)\n* Imports: 3,022 billion m3 (2022)\n* Proved Reserves: 15.592,4 million m3 (2022)"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Banking",
    "text": "Croatian National Bank Building in Zagreb, 2014"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Central bank",
    "text": "The country's monetary policy is formulated and implemented by its national\nbank, based in capital city, Zagreb.\n\n* Croatian National Bank"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Stock Exchange",
    "text": "* Zagreb Stock Exchange"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Retail banks",
    "text": "* Zagrebačka banka (owned by UniCredit from Italy)\n* Privredna banka Zagreb (owned by Intesa Sanpaolo from Italy)\n* Hrvatska poštanska banka\n* OTP Banka (owned by OTP Bank from Hungary)\n* Raiffeisen Bank Austria (owned by Raiffeisen from Austria)\n* Erste & Steiermärkische Bank (former Riječka banka, owned by Erste Bank from Austria)"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Central budget",
    "text": "General government gross debt of Croatia from 2000 to 2016\n\nThe central budget is set by the Government of Croatia to cover their upcoming\nfiscal year, which runs from 1 January to 31 December. For 2024, they reported\n€28.52 billion in revenue with €32.61 billion in expenditure, running a €4.09\nbillion budget deficit.\n\nThe breakdown of Croatia's budget for 2023, by ministry (department), is shown\nbelow.\n\n* Labor and Pension System, Family and Social Policy – €10.59 billion\n* Finance – €7.15 billion\n* Health – €4.29 billion\n* Science and Education – €3.84 billion\n* Economy and Sustainable Development – €2.19 billion\n* Maritime Affairs, Transport and Infrastructure – €1.56 billion\n* Agriculture – €1.22 billion\n* Interior – €1.18 billion\n* Defence – €1.17 billion\n* Physical Planning, Construction and State Property – €0.74 billion\n* Justice and Public Administration – €0.68 billion\n* Culture and Media – €0.54 billion\n* Regional Development and EU funds – €0.42 billion\n* Tourism and Sport – €0.28 billion\n* Veterans' Affairs – €0.17 billion\n* Foreign and European Affairs – €0.15 billion"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Economic growth",
    "text": "The Croatian economy is expected to grow to $116 billion by 2029, as measured\nby nominal gross domestic product (GDP). Since 1998, Croatia has been the\nlargest economy by nominal GDP of the former Yugoslav Republics according to\nthe IMF. It has been the second-largest economy of former Yugoslavia by\npurchasing power parity (PPP) since 2008. Its high levels of coastal tourism\nin Southeast Europe and deep integration within the European Union (EU) is a\nmajor contributor to economic growth. From 2022 to 2025, Croatia has\nmaintained average GDP growth of 4.8%, outperforming the majority of fellow EU\nmember states. Economic growth in Croatia is dependent on high levels of\npublic investment and consumption, with key challanges being productivity,\nlabor market inefficiency, and limited private sector involvement."
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators for the period\n2000–2024 according to the Croatian Bureau of Statistics. The purchasing power\nparity (PPP) conversion factors are based on IMF estimates. Croatian\ngovernment debt values are published by the Croatian National Bank. Indicators\nfor 2024-2027 are provided by the IMF, specifically the World Economic Outlook\n(April 2024).\n\nYear  | Population (Mil.) | GDP (in Bil. EUR nominal) | GDP (Bil. USD nominal) | GDP per capita (nominal. EUR) | GDP per capita (nominal, USD) | GDP (Bil., USD PPP) | GDP per capita (PPP, USD) | Exchange Rate (USD/EUR) | PPP (National currency units/USD) | Inflation (%) | GDP growth (real %) | Government debt (% GDP)\n---|---|---|---|---|---|---|---|---|---|---|---|---\n2000  | 4.426  | 24.0  | 21.8  | 5,351  | 4,929  | 47.7  | 10,786  | 0.9236  | 0.503  | 4.6  | 2.9  | 35.4\n2001  | 4.300  | 25.8  | 23.3  | 6,044  | 5,414  | 50.1  | 11,655  | 0.8956  | 0.514  | 3.8  | 3.0  | 36.6\n2002  | 4.302  | 28.3  | 27.1  | 6,688  | 6,293  | 56.0  | 12,771  | 0.9456  | 0.505  | 1.7  | 5.7  | 36.5\n2003  | 4.303  | 31.2  | 35.0  | 7,206  | 8,130  | 58.9  | 13,682  | 1.1312  | 0.529  | 1.8  | 5.5  | 37.9\n2004  | 4.305  | 33.6  | 42.0  | 7,847  | 9,752  | 63.2  | 14,675  | 1.2439  | 0.532  | 2.1  | 4.1  | 40.0\n2005  | 4.310  | 36.2  | 45.8  | 8,539  | 10,620  | 66.7  | 15,439  | 1.2441  | 0.543  | 3.3  | 4.3  | 40.9\n2006  | 4.311  | 39.4  | 50.9  | 9,405  | 11,795  | 75.9  | 17,596  | 1.2556  | 0.520  | 3.2  | 4.9  | 38.5\n2007  | 4.310  | 43.2  | 60.6  | 10,272  | 14,043  | 84.2  | 19,491  | 1.3705  | 0.513  | 2.9  | 4.9  | 37.2\n2008  | 4.310  | 46.5  | 71.0  | 11,216  | 16,419  | 90.4  | 20,924  | 1.4708  | 0.514  | 6.1  | 1.9  | 39.1\n2009  | 4.305  | 44.4  | 63.4  | 10,549  | 14,663  | 87.1  | 20,147  | 1.3948  | 0.510  | 2.4  | -7.3  | 48.4\n2010  | 4.295  | 44.3  | 60.7  | 10,615  | 14,062  | 86.1  | 19,965  | 1.3257  | 0.514  | 1.1  | -1.3  | 57.3\n2011  | 4.281  | 45.0  | 63.4  | 10,608  | 14,758  | 90.3  | 21,013  | 1.3920  | 0.498  | 2.3  | -0.1  | 63.7\n2012  | 4.268  | 44.5  | 57.4  | 10,430  | 13,400  | 91.7  | 21,398  | 1.2848  | 0.486  | 3.4  | -2.3  | 69.4\n2013  | 4.256  | 44.7  | 59.0  | 10,423  | 13,869  | 94.3  | 22,135  | 1.3281  | 0.474  | 2.2  | -0.4  | 80.3\n2014  | 4.238  | 44.6  | 58.4  | 10,386  | 13,783  | 94.8  | 22,366  | 1.3285  | 0.470  | -0.2  | -0.4  | 83.9\n2015  | 4.204  | 45.7  | 50.7  | 10,755  | 11,944  | 98.1  | 23,339  | 1.1095  | 0.466  | -0.5  | 2.5  | 83.3\n2016  | 4.174  | 47.3  | 52.4  | 11,324  | 12,557  | 105.4  | 25,262  | 1.1069  | 0.449  | -1.1  | 3.6  | 79.8\n2017  | 4.125  | 49.5  | 55.9  | 12,101  | 13,657  | 112.3  | 27,201  | 1.1297  | 0.441  | 1.1  | 3.4  | 76.7\n2018  | 4.088  | 51.9  | 61.3  | 12,896  | 15,245  | 118.3  | 28,909  | 1.1810  | 0.439  | 1.5  | 2.8  | 73.3\n2019  | 4.065  | 54.8  | 61.3  | 13,678  | 15,333  | 130.4  | 30,585  | 1.1195  | 0.420  | 0.8  | 3.4  | 71.1\n2020  | 4.048  | 50.5  | 57.6  | 12,408  | 14,205  | 123.1  | 28,911  | 1.1422  | 0.410  | 0.1  | -8.6  | 87.3\n2021  | 3.879  | 58.2  | 68.8  | 15,006  | 17,747  | 143.0  | 34,533  | 1.1827  | 0.407  | 2.6  | 13.1  | 78.3\n2022  | 3.857  | 68.0  | 71.5  | 17,637  | 18,544  | 155.9  | 40,573  | 1.0530  | 0.418  | 10.8  | 6.3  | 70.4\n2023  | 3.856  | 78.0  | 84.4  | 20,239  | 21,878  | 186.7  | 48,586  | 1.0824  | 0.418  | 8.3  | 3.3  | 83.9\n2024  | 3.866  | 85.5  | 92.5  | 22,111  | 23,933  | 190.0  | 49,137  | 1.0824  | 0.45  | 3.0  | 3.8  | \\-\n2025f  | 3.829  | 86.0  | 92.3  | 22,462  | 24,111  | 183.2  | 47,860  | 1.0734  | 0.469  | 2.2  | 2.7\n2026f  | 3.822  | 90.5  | 97.1  | 23,680  | 25,391  | 191.8  | 50,180  | 1.0722  | 0.472  | 2.2  | 2.7\n2027f  | 3.816  | 94.9  | 101.6  | 24,877  | 26,633  | 200.5  | 52,563  | 1.0705  | 0.473  | 2.2  | 2.6"
  },
  {
    "chapter_name": "Economy of Croatia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "GDP by county",
    "text": "Counties of Croatia by GDP, in million Euro\n---\nCounty  | 2000  | 2001  | 2002  | 2003  | 2004  | 2005  | 2006  | 2007  | 2008  | 2009  | 2010  | 2011  | 2012  | 2013  | 2014  | 2015  | 2016  | 2017  | 2018\nBjelovar-Bilogora | 520  | 569  | 639  | 645  | 688  | 698  | 800  | 804  | 953  | 917  | 834  | 823  | 786  | 790  | 789  | 809  | 855  | 874  | 925\nBrod-Posavina | 564  | 628  | 687  | 713  | 779  | 771  | 849  | 918  | 1,032  | 952  | 914  | 917  | 895  | 888  | 853  | 879  | 917  | 969  | 1,016\nDubrovnik-Neretva | 573  | 630  | 676  | 754  | 883  | 977  | 1,083  | 1,292  | 1,340  | 1,267  | 1,248  | 1,208  | 1,202  | 1,234  | 1,260  | 1,313  | 1,403  | 1,532  | 1,587\nIstria | 1,420  | 1,614  | 1,814  | 1,980  | 2,182  | 2,291  | 2,482  | 2,729  | 2,842  | 2,768  | 2,773  | 2,762  | 2,635  | 2,631  | 2,666  | 2,747  | 2,947  | 3,106  | 3,162\nKarlovac | 586  | 713  | 785  | 758  | 777  | 835  | 943  | 1,048  | 1,107  | 998  | 969  | 978  | 948  | 961  | 934  | 961  | 1,008  | 1,031  | 1,035\nKoprivnica-Križevci | 723  | 762  | 830  | 845  | 853  | 855  | 988  | 1,046  | 1,069  | 998  | 935  | 926  | 906  | 919  | 905  | 916  | 961  | 991  | 979\nKrapina-Zagorje | 569  | 655  | 681  | 706  | 729  | 815  | 858  | 947  | 974  | 868  | 807  | 815  | 803  | 823  | 837  | 867  | 928  | 990  | 1,021\nLika-Senj | 235  | 250  | 309  | 384  | 522  | 407  | 429  | 417  | 491  | 445  | 416  | 405  | 382  | 388  | 379  | 388  | 402  | 427  | 436\nMeđimurje | 510  | 562  | 644  | 654  | 691  | 737  | 841  | 892  | 1,034  | 977  | 933  | 941  | 929  | 1,088  | 959  | 986  | 1,045  | 1,109  | 1,142\nOsijek-Baranja | 1,352  | 1,459  | 1,668  | 1,700  | 1,872  | 2,043  | 2,249  | 2,600  | 2,834  | 2,642  | 2,507  | 2,514  | 2,421  | 2,438  | 2,375  | 2,436  | 2,544  | 2,581  | 2,572\nPožega-Slavonia | 325  | 355  | 380  | 420  | 451  | 464  | 478  | 508  | 554  | 504  | 497  | 482  | 458  | 461  | 433  | 440  | 453  | 466  | 499\nPrimorje-Gorski Kotar | 2,111  | 2,138  | 2,261  | 2,543  | 2,685  | 3,066  | 3,371  | 3,560  | 4,060  | 3,820  | 3,822  | 3,905  | 3,981  | 3,849  | 3,849  | 3,854  | 3,961  | 4,177  | 4,270\nSisak-Moslavina | 925  | 938  | 972  | 989  | 1,033  | 1,137  | 1,335  | 1,262  | 1,435  | 1,447  | 1,451  | 1,439  | 1,434  | 1,306  | 1,221  | 1,268  | 1,247  | 1,266  | 1,309\nSplit-Dalmatia | 1,924  | 2,118  | 2,318  | 2,529  | 2,898  | 3,061  | 3,427  | 3,934  | 4,115  | 3,804  | 3,788  | 3,695  | 3,578  | 3,583  | 3,581  | 3,712  | 3,913  | 4,133  | 4,278\nŠibenik-Knin | 423  | 450  | 511  | 581  | 659  | 748  | 765  | 902  | 923  | 802  | 859  | 856  | 835  | 851  | 852  | 862  | 903  | 988  | 1,027\nVaraždin | 894  | 996  | 1,139  | 1,175  | 1,166  | 1,229  | 1,347  | 1,451  | 1,637  | 1,549  | 1,463  | 1,456  | 1,436  | 1,467  | 1,462  | 1,506  | 1,601  | 1,718  | 1,865\nVirovitica-Podravina | 357  | 406  | 438  | 458  | 471  | 476  | 555  | 590  | 615  | 546  | 516  | 526  | 504  | 496  | 455  | 460  | 485  | 500  | 536\nVukovar-Syrmia | 624  | 686  | 762  | 816  | 864  | 928  | 1,079  | 1,109  | 1,260  | 1,171  | 1,090  | 1,092  | 1,049  | 1,048  | 999  | 1,031  | 1,076  | 1,120  | 1,171\nZadar | 627  | 733  | 829  | 982  | 1,055  | 1,166  | 1,238  | 1,443  | 1,618  | 1,478  | 1,405  | 1,383  | 1,366  | 1,386  | 1,395  | 1,445  | 1,527  | 1,671  | 1,797\nZagreb County | 1,284  | 1,272  | 1,583  | 1,653  | 1,823  | 2,059  | 2,128  | 2,419  | 2,653  | 2,555  | 2,398  | 2,449  | 2,439  | 2,450  | 2,466  | 2,549  | 2,651  | 2,832  | 3,011\nCity of Zagreb | 6,912  | 7,806  | 8,569  | 9,458  | 10,400  | 11,717  | 12,954  | 14,059  | 15,439  | 14,561  | 15,586  | 15,383  | 15,055  | 14,778  | 14,754  | 15,206  | 15,818  | 16,782  | 17,544\n**Source** : Croatian Bureau of Statistics\nCounties of Croatia by GDP per capita, in Euro\n---\nCounty  | 2000  | 2001  | 2002  | 2003  | 2004  | 2005  | 2006  | 2007  | 2008  | 2009  | 2010  | 2011  | 2012  | 2013  | 2014  | 2015  | 2016  | 2017  | 2018\nBjelovar-Bilogora | 4,007  | 4,383  | 4,951  | 5,042  | 5,417  | 5,539  | 6,395  | 6,489  | 7,756  | 7,522  | 6,907  | 6,888  | 6,657  | 6,766  | 6,829  | 7,107  | 7,647  | 7,958  | 7,986\nBrod-Posavina | 3,425  | 3,812  | 4,171  | 4,345  | 4,766  | 4,731  | 5,223  | 5,660  | 6,384  | 5,921  | 5,731  | 5,789  | 5,691  | 5,700  | 5,539  | 5,810  | 6,195  | 6,726  | 6,607\nDubrovnik-Neretva | 4,886  | 5,373  | 5,738  | 6,378  | 7,442  | 8,197  | 9,025  | 10,698  | 11,024  | 10,351  | 10,174  | 9,855  | 9,812  | 10,083  | 10,297  | 10,737  | 11,500  | 12,608  | 13,277\nIstria | 7,184  | 8,160  | 9,117  | 9,880  | 10,813  | 11,267  | 12,116  | 13,221  | 13,691  | 13,285  | 13,297  | 13,270  | 12,684  | 12,665  | 12,811  | 13,199  | 14,165  | 14,915  | 15,570\nKarlovac | 4,181  | 5,082  | 5,635  | 5,491  | 5,666  | 6,139  | 6,989  | 7,830  | 8,341  | 7,598  | 7,458  | 7,615  | 7,461  | 7,651  | 7,541  | 7,868  | 8,373  | 8,701  | 8,301\nKoprivnica-Križevci | 5,955  | 6,269  | 6,858  | 7,025  | 7,134  | 7,181  | 8,335  | 8,878  | 9,108  | 8,545  | 8,052  | 8,020  | 7,890  | 8,039  | 7,969  | 8,149  | 8,660  | 9,066  | 8,711\nKrapina-Zagorje | 4,089  | 4,702  | 4,919  | 5,129  | 5,323  | 5,972  | 6,313  | 7,008  | 7,250  | 6,479  | 6,049  | 6,142  | 6,091  | 6,287  | 6,439  | 6,721  | 7,265  | 7,830  | 7,919\nLika-Senj | 4,219  | 4,493  | 5,582  | 6,965  | 9,466  | 7,446  | 7,927  | 7,783  | 9,277  | 8,515  | 8,091  | 7,984  | 7,652  | 7,874  | 7,812  | 8,134  | 8,571  | 9,297  | 8,878\nMeđimurje | 4,472  | 4,930  | 5,644  | 5,729  | 6,056  | 6,459  | 7,375  | 7,830  | 9,086  | 8,583  | 8,196  | 8,273  | 8,176  | 9,592  | 8,480  | 8,751  | 9,328  | 9,989  | 10,302\nOsijek-Baranja | 4,247  | 4,582  | 5,239  | 5,354  | 5,914  | 6,480  | 7,174  | 8,353  | 9,162  | 8,578  | 8,183  | 8,249  | 7,990  | 8,105  | 7,965  | 8,270  | 8,779  | 9,098  | 8,684\nPožega-Slavonia | 3,904  | 4,255  | 4,572  | 5,066  | 5,479  | 5,658  | 5,874  | 6,286  | 6,897  | 6,330  | 6,314  | 6,194  | 5,971  | 6,081  | 5,774  | 5,973  | 6,307  | 6,681  | 6,620\nPrimorje-Gorski Kotar | 7,123  | 7,210  | 7,622  | 8,575  | 9,051  | 10,326  | 11,337  | 11,959  | 13,642  | 12,847  | 12,873  | 13,185  | 13,474  | 13,061  | 13,103  | 13,204  | 13,686  | 14,559  | 14,797\nSisak-Moslavina | 4,884  | 4,952  | 5,158  | 5,285  | 5,552  | 6,156  | 7,292  | 6,966  | 8,018  | 8,184  | 8,321  | 8,372  | 8,465  | 7,832  | 7,459  | 7,899  | 7,939  | 8,284  | 7,868\nSplit-Dalmatia | 4,422  | 4,866  | 5,278  | 5,723  | 6,508  | 6,820  | 7,593  | 8,684  | 9,059  | 8,361  | 8,323  | 8,121  | 7,866  | 7,876  | 7,876  | 8,184  | 8,655  | 9,183  | 9,636\nŠibenik-Knin | 3,855  | 4,094  | 4,631  | 5,254  | 5,946  | 6,733  | 6,863  | 8,081  | 8,262  | 7,202  | 7,788  | 7,855  | 7,764  | 7,998  | 8,086  | 8,267  | 8,776  | 9,737  | 9,713\nVaraždin | 4,952  | 5,516  | 6,327  | 6,550  | 6,525  | 6,890  | 7,564  | 8,165  | 9,233  | 8,758  | 8,298  | 8,281  | 8,193  | 8,412  | 8,434  | 8,752  | 9,389  | 10,176  | 10,899\nVirovitica-Podravina | 3,887  | 4,416  | 4,793  | 5,029  | 5,222  | 5,329  | 6,253  | 6,703  | 7,048  | 6,326  | 6,037  | 6,213  | 6,012  | 5,979  | 5,542  | 5,704  | 6,135  | 6,480  | 6,525\nVukovar-Syrmia | 3,277  | 3,604  | 4,018  | 4,330  | 4,617  | 4,985  | 5,825  | 6,012  | 6,853  | 6,401  | 6,016  | 6,094  | 5,856  | 5,961  | 5,772  | 6,082  | 6,498  | 6,999  | 6,730\nZadar | 4,050  | 4,726  | 5,289  | 6,193  | 6,579  | 7,186  | 7,534  | 8,676  | 9,640  | 8,752  | 8,281  | 8,114  | 7,985  | 8,084  | 8,146  | 8,478  | 9,003  | 9,901  | 10,803\nZagreb County | 4,327  | 4,283  | 5,279  | 5,459  | 5,966  | 6,686  | 6,859  | 7,745  | 8,443  | 8,089  | 7,565  | 7,703  | 7,660  | 7,687  | 7,748  | 8,050  | 8,434  | 9,083  | 9,710\nCity of Zagreb | 8,962  | 10,114  | 11,091  | 12,238  | 13,418  | 15,082  | 16,642  | 18,005  | 19,709  | 18,526  | 19,765  | 19,453  | 18,986  | 18,578  | 18,479  | 18,992  | 19,711  | 20,879  | 22,695\n**Source** : Croatian Bureau of Statistics"
  }
]