[
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofBahrain** is heavily dependent upon oil and gas. The Bahraini\nDinar is the second-highest-valued currency unit in the world. Since the late\n20th century, Bahrain has heavily invested in the banking and tourism sectors.\nThe country's capital, Manama is home to many large financial structures.\nBahrain's finance industry is very successful. In 2008, Bahrain was named the\nworld's fastest growing financial center by the City of London's Global\nFinancial Centres Index. Bahrain's banking and financial services sector,\nparticularly Islamic banking, have benefited from the regional boom driven by\ndemand for oil. Petroleum is Bahrain's most exported product, accounting for\n60% of export receipts, 70% of government revenues, and 11% of GDP. Aluminium\nis the second most exported product, followed by finance and construction\nmaterials.\n\nAccording to the 2020 edition of the _Index of Economic Freedom_ , published\nby The Heritage Foundation and _The Wall Street Journal_ , Bahrain has the\nfourth-freest in the Middle East and North Africa region and is the 40th-\nfreest economy in the world. An alternative index, published by the Fraser\nInstitute, puts Bahrain in 70th place. Bahrain was recognised by the World\nBank as a high income economy.",
    "openai_summarised_points": [
      "• The economy of Bahrain is heavily reliant on oil and gas resources, forming the backbone of its economic activities.",
      "• The Bahraini Dinar is recognized as the second-highest-valued currency unit globally, indicating a strong monetary position.",
      "• Since the late 20th century, Bahrain has made substantial investments in the banking and tourism sectors to diversify its economy.",
      "• The capital city, Manama, hosts numerous large financial institutions and structures, serving as a financial hub for the country.",
      "• Bahrain's finance industry is notably successful, with significant growth and regional influence.",
      "• In 2008, Bahrain was named the world's fastest-growing financial center by the City of London's Global Financial Centres Index, highlighting its rapid development in finance.",
      "• The country's banking and financial services sector, especially Islamic banking, have thrived due to regional economic growth driven by high oil demand.",
      "• Petroleum exports constitute Bahrain's most significant export product, representing 60% of the country's export receipts.",
      "• Petroleum accounts for 70% of Bahrain's government revenues, underscoring its critical role in public finances.",
      "• Petroleum contributes approximately 11% to Bahrain's gross domestic product (GDP).",
      "• Aluminium is the second most exported product from Bahrain, followed by finance and construction materials, indicating a diversified export portfolio.",
      "• According to the 2020 edition of the _Index of Economic Freedom_ published by The Heritage Foundation and _The Wall Street Journal_, Bahrain ranks as the fourth-freest economy in the Middle East and North Africa region.",
      "• Globally, Bahrain is positioned as the 40th-freest economy according to the same index, reflecting a relatively open and free economic environment.",
      "• An alternative ranking by the Fraser Institute places Bahrain at 70th position in terms of economic freedom.",
      "• The World Bank has recognized Bahrain as a high-income economy, indicating a high standard of living and economic development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:31:03.984273",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1258,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economy overview",
    "text": "Oil and natural gas play a dominant role in Bahrain’s economy. Despite efforts\nto diversify the economy, according to the CIA World Fact Book: oil still\ncomprises 85% of Bahraini budget revenues, meaning throughout the last few\nyears lower world energy prices have generated sizeable budget deficits -\nabout 10% of GDP in 2017 alone. Bahrain is a rich country in the middle east\nand the north africa (MENA) region and its economy depends on oil & gas,\ninternational banking and tourism.\n\nIn 2003 and 2004, the balance of payments improved due to rising oil prices\nand increased receipts from the services sector. As a result, the current\naccount balance registered a surplus of US$219 million in 2003 and a surplus\nof US$442 million in 2004, compared to a deficit of US$35 million in 2002.\nBahrain's gross international reserves increased substantially in 2004 to\nUS$1.6 billion, up from US$1.4 billion in the previous three year (2001-2003)."
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Diversification",
    "text": "Though Current GDP per capita Archived 2012-05-04 at the Wayback Machine\nshrank by 2.4% in the 1980s, it bounced back to a growth of 36% in the 1990s\nas a result of successful diversification initiatives. Bahrain's urgency in\nembracing economic liberalisation is due to its need to diversify the economy\naway from its limited oil supplies. Unlike its Persian Gulf neighbours,\nBahrain has little oil wealth and the economy has expanded into banking, heavy\nindustries, retail and tourism. The Kingdom is the main banking hub for the\nPersian Gulf and a centre for Islamic finance, which has been attracted by the\nstrong regulatory framework for the industry. According to the International\nMonetary Fund's Financial System Stability Assessment of Bahrain's financial\nregulatory environment, published on 6 March 2006, found:\n\n* The financial system is enjoying strong performance under favorable circumstances, and is likely to remain a major contributor to overall growth. The main risk stems from potential overheating in the economies of the region, but the system should be resilient to likely shocks.\n* Prudential regulations are modern and comprehensive, and supervision is generally effective, especially in the dominant banking sector. Supervisory capacity needs to be expanded in line with new regulations and to keep up with the growth and increasing sophistication of financial institutions.\n* The further expansion of the Islamic sector, the development of housing finance, and the deepening of securities markets are important for the future growth of the financial system. The banking and insurance sectors will eventually undergo consolidation. [1]\n\nIn 2005, Bahrain signed the US-Bahrain Free Trade Agreement, becoming the\nfirst Persian Gulf state to sign such a bilateral trade agreement with the\nUnited States. A massive privatization programme is underway to sell off key\ngovernment assets: utilities, banks, financial services, and\ntelecommunications have started to come under the control of the private\nsector.\n\nAs a result, the economy has been well positioned to exploit the extra\nrevenues generated in the region thanks to the sustained high oil prices since\n2002. In January 2006, the United Nations Economic and Social Commission for\nWestern Asia cited Bahrain as the fastest growing economy in the Arab world.\n\nBetween 1981 and 1993, Bahrain Government expenditures increased by 64%.\nDuring that same time, government revenues continued to be largely dependent\non the oil industry and increased by only 4%. Bahrain has at times received\nsignificant budgetary support and project grants from Saudi Arabia, Kuwait and\nthe United Arab Emirates.\n\nThe government has used its modest oil revenues to build an advanced\ninfrastructure in transportation and telecommunications. Bahrain is a regional\nfinancial and business center. Tourism, especially from the region, has proved\nanother significant source of income.\n\nBahrain has benefited from the oil boom since 2001, with economic growth of\n5.5%. It has succeeded in attracting investment from other Persian Gulf states\npartly because it used the revenues of the 1970s-early 80s boom to invest in\ninfrastructure development and other projects to improve the standard of\nliving; health, education, housing, electricity, water, and roads all received\nattention.\n\nThe success of ventures such as the Bahrain Grand Prix has raised the\nKingdom's international profile, and combined with the boom in Islamic\nbanking, has encouraged major airlines to resume services to the country, with\nLufthansa announcing on 14 March 2006 that it would schedule three flights a\nweek to Muharraq from Frankfurt Archived 2007-10-11 at the Wayback Machine.\n\nAs part of its efforts to build a modern economy, Bahrain has initiated a\nseries of labour reforms under Minister of Labour Majeed Al Alawi in order to\nbring the labour market into line with international standards. Bahrain\nintends to expand its high tech industries, invest in research and\ndevelopment, and strengthen its competitive edge within a global economy. In\n2006,it was announced that the Bahrain Science and Technology Park,a Kuwait\nFinance House Bahrain initiative would be a reflection of this effort to\ncreate a diversified economy, provide high quality jobs for locals and\ninternational workforce, providing a place for innovative and inventive\nthinking that will have direct benefits to the island nation.\n\nIn 2009 it was announced that the Bahraini Government would be developing land\nnext door to the Bahrain International Circuit. The project being managed by\n@Bahrain is a mix of facilities including an exhibition and convention\nfacility, a choice of hotel accommodations ranging from mid-market to luxury,\na multi-purpose indoor arena, an automotive club and engineering facility,\nretail and leisure establishments, a tech-tainment (technology interacting\nwith entertainment) centre, a research institute, a technology park and a\nfocus on education and training. @Bahrain is part of the Mumtalakat group of\ncompanies and will dedicate more than 1 million square meters of business,\nentertainment and educational space with a value in excess of $2bn (BD 850\nmillion), making it one of the largest investment projects to take place in\nBahrain in the past five years.\n\nIn July 2023, Bahrain's national origin exports decreased by 23%, valued at\nBD323 million, while imports fell by 6% to BD441 million, resulting in a trade\ndeficit of BD68 million, according to the Information & eGovernment Authority\n(iGA) report.\n\nOverall during 2023, Bahrain's GDP grew by 2.45%, with the non-oil sector\nshowing a robust increase of 4.48%, indicating the country's successful\nefforts towards economic diversification. The Bahrain Economic Development\nBoard played a crucial role in enhancing Bahrain's investment climate,\nactively facilitating the entry of international investors and expanding the\nsectors open to 100% foreign ownership, including significant initiatives in\nthe oil and gas sectors under certain conditions."
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Macro-economic trend",
    "text": "This is a chart of trend of gross domestic product of Bahrain at market prices\nestimated by the International Monetary Fund with figures in millions of\nBahraini Dinars.\n\nYear | Gross Domestic Product | US Dollar Exchange | Inflation Index (2000=100)\n---|---|---|---\n1980 | 1,354 | 0.377 Bahraini Dinars | 74\n1985 | 1,609 | 0.377 Bahraini Dinars | 90\n1990 | 1,867 | 0.377 Bahraini Dinars | 89\n1995 | 2,552 | 0.377 Bahraini Dinars | 98\n2000 | 3,408 | 0.377 Bahraini Dinars | 100\n2005 | 6,004 | 0.377 Bahraini Dinars | 105\n2010 | 9,668 | 0.377 Bahraini Dinars | 120\n2015 | 11,675 | 0.377 Bahraini Dinars | 133\n2020 | 13,058 | 0.377 Bahraini Dinars | 139\n\nFor purchasing power parity comparisons, the US Dollar is exchanged at 0.30\nBahraini Dinars only. Mean wages were $19.81 per man-hour in 2009.\n\nThe following table shows the main economic indicators in 1980–2022.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1980  | 7.3  | 20,779  | 3.6  | 7.5 %  | 3.8 %  | ...\n1985  | 11.4  | 27,186  | 4.3  | −0.9 %  | −2.4 %  | ...\n1990  | 14.7  | 30,044  | 5.0  | 3.5 %  | 1.3 %  | 8 %\n1995  | 20.5  | 36,705  | 6.8  | 1.9 %  | 3.1 %  | 14 %\n2000  | 28.0  | 43,920  | 9.1  | 7.0 %  | −0.7 %  | 26 %\n2005  | 40.4  | 45,440  | 16.0  | 6.8 %  | 2.6 %  | 24 %\n2010  | 58.2  | 47,117  | 25.7  | 4.3 %  | 2.0 %  | 30 %\n2011  | 60.6  | 50,673  | 28.8  | 2.0 %  | −0.3 %  | 33 %\n2012  | 65.9  | 54,489  | 30.7  | 3.7 %  | 2.8 %  | 36 %\n2013  | 67.7  | 54,035  | 32.5  | 5.4 %  | 3.3 %  | 44 %\n2014  | 68.3  | 51,938  | 33.4  | 4.4 %  | 2.6 %  | 44 %\n2015  | 62.5  | 45,627  | 31.1  | 2.5 %  | 1.8 %  | 66 %\n2016  | 63.8  | 44,834  | 32.2  | 3.8 %  | 2.8 %  | 81 %\n2017  | 71.3  | 47,486  | 35.5  | 4.9 %  | 1.4 %  | 88 %\n2018  | 74.5  | 48,424  | 37.8  | 2.0 %  | 2.1 %  | 90 %\n2019  | 77.5  | 50,118  | 38.7  | 2.0 %  | 1.0 %  | 97 %\n2020  | 78.7  | 48,166  | 34.6  | −5.9 %  | −2.3 %  | 126 %\n2021  | 82.7  | 48,357  | 39.3  | 4.3 %  | −0.6 %  | 122 %\n2022  | 93.9  | 49,482  | 44.4  | 6.0 %  | 3.6 %  | 111 %\n2023  | 100.1  | 57,213  | 46.1  | 3.0 %  | 0.1 %  | 123 %\n2024  | 105.6  | 57,503  | 47.8  | 3.0 %  | 1.4 %  | 126 %"
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Investment",
    "text": "The stock market capitalisation of listed companies in Bahrain was valued at\n$21,176 million in 2008 by the World Bank.[2] Bahrain is generally a country\nwhich is open to creating a unique economy which is fast growing and open for\nall to create business opportunities."
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Hydrocarbon industry",
    "text": "Nodding donkey crude oil pump in Bahrain (2019)\n\nPetroleum and natural gas are the only significant natural resources in\nBahrain. Because of limited reserves, Bahrain has worked to diversify its\neconomy over the decade prior to 2004. Bahrain has stabilized its oil\nproduction at about 40,000 barrels (6,400 m³) per day, and reserves are\nexpected to last 10 to 15 years. The Bahrain Petroleum Company refinery was\nbuilt in 1935, has a capacity of about 250,000 barrels (40,000 m³) per day,\nand was the first in the Persian Gulf outside of Iran. After selling 60% of\nthe refinery to the state-owned Bahrain National Oil Company in 1980, Caltex,\na U.S. company, now owns 40%. Saudi Arabia provides most of the crude for\nrefinery operation via pipeline. Bahrain also receives a large portion of the\nnet output and revenues from Saudi Arabia's Abu Saafa offshore oilfield.\n\nThe Bahrain National Gas Company operates a gas liquefaction plant that\nutilizes gas piped directly from Bahrain's oilfields. Gas reserves should last\nabout 50 years at present rates of consumption. The Gulf Petrochemical\nIndustries Company (GPIC) is a joint venture of the petrochemical industries\nof Kuwait, the Saudi Basic Industries Corporation, and the Government of\nBahrain. The plant, completed in 1985, produces ammonia, methanol and urea for\nexport.\n\nBahrain's other industries include Aluminum Bahrain, which operates an\naluminum smelter—the largest in the world with an annual production of about\n1,500,000 metric tons—and related factories, such as the Aluminum Extrusion\nCompany and the Gulf Aluminum Rolling Mill Company (GARMCO)[3]. Other plants\ninclude the Arab Iron and Steel Company's iron ore pelletizing plant (4\nmillion tons annually) and a shipbuilding and repair yard.\n\nBahrain's development as a major financial center has been the most widely\nheralded aspect of its diversification effort. International financial\ninstitutions operate in Bahrain, both offshore and onshore, without\nimpediments. In 2001, Bahrain's central bank issued 15 new licenses. More than\n100 offshore banking units and representative offices are located in Bahrain,\nas well as 65 American firms. Bahrain's international airport is one of\nbusiest in the Persian Gulf, serving 22 carriers. A modern, busy port offers\ndirect and frequent cargo shipping connections to the U.S., Europe, and the\nFar East. Internationally recognised Bahraini companies include Investcorp,\nthe venture capital firm credited with turning around the fortunes of Gucci."
  },
  {
    "chapter_name": "Economy of Bahrain",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Taxation",
    "text": "Taxation and import laws apply equally to Bahraini and foreign-owned\ncompanies, and foreign investors must comply with the same requirements and\nlegislation as local firms.\n\nOil and gas companies are taxed 46 percent on income derived from the sale of\nhydrocarbons and derivative products.\n\nThere is no personal income tax in Bahrain.\n\nEmployers and workers must pay social insurance contributions as follows:\n(1) for old-age, disability and survivor protection: for Bahraini employees,\nsince May 2022, employers pay 14% of salary plus constant allowances, the\npercentage will rise by 1% each year (up to 20% in 2028), workers pay 7% plus\nconstant allowances; for non-Bahraini employees, employers pay 3% of salary\nplus constant allowances (then being entitled only to employment injury\nbenefits).\n(2) for unemployment insurance: since June 1, 2007, all wages are subject to a\n2% tax, paid for equally by the employer and the employee, applicable both to\nnationals and non-citizens and supplemented by a government contribution of\n1%. This makes Bahrain the first of the GCC countries to implement a UI\nscheme."
  }
]