[
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Guatemala\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( January 2009)__(Learn how and when to remove this\nmessage)_  \n---|---  \nHistorical GDP per capita development of El Salvador, Guatemala and Honduras\n\nThe **economy of Guatemala** is a considered a developing economy, highly\ndependent on agriculture, particularly on traditional crops such as coffee,\nsugar, and bananas. Guatemala's GDP per capita is roughly one-third of\nBrazil's. The Guatemalan economy is the largest in Central America. It grew\n3.3 percent on average from 2015 to 2018. However, Guatemala remains one of\nthe poorest countries in Latin America and the Caribbean, having highly\nunequal incomes and chronically malnourished children. The country is beset by\npolitical insecurity, and lacks skilled workers and infrastructure. It depends\non remittances for nearly one-tenth of the GDP.\n\nThe 1996 peace accords ended the 36-years-long Guatemalan Civil War, and\nremoved a major obstacle to foreign investment. Since then Guatemala has\npursued important reforms and macroeconomic stabilization. On 1 July 2006, the\nCentral American Free Trade Agreement (CAFTA) entered into force between the\nUnited States and Guatemala. It has since spurred increased investment in the\nexport sector. The distribution of income remains highly unequal, with 12% of\nthe population living below the international poverty line. Guatemala's large\nexpatriate community in the United States, has made it the top remittance\nrecipient in Central America. These inflows are a primary source of foreign\nincome, equivalent to nearly two-thirds of exports.\n\nGuatemala's gross domestic product for 1990 was estimated at $19.1 billion,\nwith real growth slowing to approximately 3.3%. Ten years later, in 2000, it\nrose from 1 to 4% and by 2010 it had fallen back to 3%, according to the World\nBank. The final peace accord in December 1996 left Guatemala well-positioned\nfor rapid economic growth.[_citation needed_]\n\nGuatemala's economy is dominated by the private sector, which generates about\n85% of GDP.[_citation needed_] Most of its manufacturing is light assembly and\nfood processing, geared to the domestic, U.S., and Central American markets.\nIn 1990 the labor force participation rate for women was 42%, later increasing\nby 1% in 2000 to 43% and 51% in 2010. For men, the labor force participation\nrate in 1990 was about 89%, decreased to 88% in 2000, and increased up to 90%\nin 2010 (World Bank). Self-employment for men is about 50%, while the rate for\nwomen is about 32% (Pagàn 1).\n\nOver the past several years, tourism and exports of textiles, apparel, and\nnontraditional agricultural products such as winter vegetables, fruit, and cut\nflowers have boomed, while more traditional exports such as sugar, bananas,\nand coffee continue to represent a large share of the export market.[_citation\nneeded_]Over the past twenty years the percentage of exports of goods and\nservices has fluctuated. In 1990 it was 21% and in 2000, 20%. It increased\nagain in 2010 to 26%. On the other hand, its level of imports of goods and\nservices has continually increased. In 1990 its imports of goods and services\nwas about 25%. In 2000 it increased by 4% up to 29%, and in 2010 it increased\nup to 36%. Migration is another important avenue in Guatemala. According to\nCecilia Menjivar, remittances are \"central to the economy.\" In 2004\nremittances to Guatemala from men's migration to the U.S. accounted for\napproximately 97% (Menjivar 2)......\n\nThe United States is the country's largest trading partner, providing 36% of\nGuatemala's imports and receiving 40% of its exports. The government sector is\nsmall and shrinking, with its business activities limited to public\nutilities—some of which have been privatized—ports and airports and several\ndevelopment-oriented financial institutions. Guatemala was certified to\nreceive export trade benefits under the United States' Caribbean Basin Trade\nand Partnership Act (CBTPA) in October 2000, and enjoys access to U.S.\nGeneralized System of Preferences (GSP) benefits. Due to concerns over serious\nworker rights protection issues, however, Guatemala's benefits under both the\nCBTPA and GSP are currently under review.[_citation needed_]\n\nThe country is predominantly poor, with 49 percent of the population living in\nrural areas. Guatemala is characterized by a markedly unequal distribution of\nwealth, assets, and opportunities: between 2000 and 2014, rural poverty\nincreased from 74.5 to 76.1 percent, while extreme rural poverty increased\nfrom 23.8 to 35.3 percent. Young people and indigenous communities are the\nmost vulnerable. Among indigenous people, who comprise almost 40 percent of\nthe total population, the poverty rate is approximately 80 percent.\n\nThe Inequality-adjusted HDI (IHDI) index for Guatemala is 0.481 (Data from\n2019), below the average for Latin America (0.596) and distant from the\ncountries with very high human development (0.800)."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Historically, the Guatemala economy was heavily dependent on agriculture. In\n1930, coffee was 77% of exports and bananas were 13%."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic development and poverty in Guatemala",
    "text": "From 1990 until 2018, Guatemala was growing with an annual GDP growth\noscillating around 3.5%.\n\nManufacturing (20%), commerce (18%), private services (14%), and agriculture\n(12%) are the biggest estimated economic sectors in Guatemala. The country's\neconomic structure shows a declining trend in the agricultural sector.\n\nGuatemala is the third biggest country in Central America. It has one of the\nhighest disparities between rich and poor as well as one of the highest\npoverty levels worldwide, with 54% of the population living below the poverty\nline in 2006 and 54% in 2011. According to the United Nations Development\nProgramme (UNDP), the Multidimensional Poverty Index (MPI), which looks at\nmultiple deprivations in the same household in regard to education, health and\nstandard of living, found that in 2011, 25.9% of the population experienced\nmultiple deprivations and another 9.8% were vulnerable to such deprivations. A\nhuman development report also states that the average percentage of\nmultidimensional poverty in 2011 was 49.1%."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Poor women and unpaid work",
    "text": "In Guatemala in 2010, 31% of the female population was illiterate. In rural\nGuatemala, 70.5% are poor; women are more likely to be poor in the more rural\nareas. Gammage argues that women in poor households engage more in domestic\ntasks and undertake more household maintenance, social reproduction and care\nwork than men. Similarly, Benería states that the women perform tough work but\ndo not get paid and argues that there is an opportunity cost related, since\nthe women could be paid for other work instead. Unpaid household work is\nassociated with the number of people in the household, the location, and the\navailability of paid employment. This means that women in rural Guatemala are\ngreater victims of poverty than urban women, and most poverty is found in the\nrural parts of Guatemala, so Gammage found that many rural women perform\nunpaid work."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Educated women and the labor force",
    "text": "The labor force participation rate for women in Guatemala was at 41% in 2018.\nWomen have a small pay disadvantage, earning 97% of male wages in most\noccupations. Gender inequality declines if women have a second and/or third\neducational degree, and they are treated more equally with their male\ncounterparts. As in many countries, both men and women earn the most if they\nhave a university degree. The percent of women with a steady income increases\nfor women who have completed the secondary level of schooling, but decreases\nagain after university. This means that women earn about the same as men if\nthey both have a secondary education, but after university, men earn more. The\nsituation changes on the professional level, where women earn more than men.\nMen work more hours in all professions, except in the household, because many\nwomen have part-time jobs."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Child labor",
    "text": "Children in Guatemala are engaged in child labor, primarily in agriculture,\naccording to the U.S. Department of Labor. In fact, 13.4% of children aged 7\nto 14 work; 68% of them are in the agricultural sector, 13% in the industrial\nsector, and 18% in the services sector. The 2013 DOL report stated that\n\"Guatemala [...] lacks Government programs targeting sectors in which children\nare known to engage in exploitative labor, such as domestic service, mining,\nquarrying, and construction.\" In December 2014, the Department's _List of\nGoods Produced by Child Labor or Forced Labor_ included mostly agricultural\ngoods produced in such working conditions, namely broccoli, coffee, corn and\nsugarcane. Guatemala's firework and gravel production also resorted to child\nlabor according to the report."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Maquilas",
    "text": "Among the most important factors in Guatemala's economy are the significant\nnumber of Korean-owned maquila factories in the highlands of Guatemala. Korean\nentrepreneurs have adopted a buyer-driven commodity chain process that depends\non the existence of a large labor force, low capital investment and low\nskills. Korea presents itself to Guatemalan industry and to Guatemalan workers\nby means of subcontractors responsible for delivering finished orders to\nmultiple buyers, mostly located in the United States. Buyers include Macy's\nand JCPenney and brands such as Liz Claiborne, OshKosh and Tracy Evans.\n\nThe first industries began in 1980s. At first, workers were very interested in\nthe new jobs in the factories, because they offered the opportunity to\ntransition to what was seen as a new and modern world, away from agricultural\nwork. However, in the factories, workers' backs hurt, because they sat for\nmany hours on backless benches in front of sewing machines. Workers would\nusually enter the plant at 7:00 a.m. and take a 1-hour break for lunch at\nnoon. They were expected to work until 7:00 or 8:00pm. About 70% of the\nworkers in macula factories were female. Years later, there was a huge\nturnover. Workers started to leave the maquila factories for reasons including\nstress, bad treatment, poor payment, etc.\n\nThe legal framework as of 2024 is the _Law for the Promotion and Development\nof Export Activities and Maquilas_ aimed mainly at the apparel and textile\nsector and at services exporters such as call centers and business processes\noutsourcing (BPO) companies. The government grants investors in these two\nsectors a 10-year income tax exemption. Additionally there is an exemption\nfrom duties and value-added taxes (VAT) on imported machinery and equipment\nand a one-year suspension of the same duties and taxes on imports of\nproduction inputs, samples, and packing material."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Economic priorities",
    "text": "Current economic priorities include:[_citation needed_]\n\n* Liberalizing the trade regime;\n* Financial services sector reform;\n* Overhauling Guatemala's public finances;\n* Simplifying the tax structure, enhancing tax compliance, and broadening the tax base.\n* Improving the investment climate through procedural and regulatory simplification and adopting a goal of concluding treaties to protect investment and intellectual property rights.\n\nImport tariffs have been lowered in conjunction with Guatemala's Central\nAmerican neighbors so that most fall between 0% and 15%, with further\nreductions planned. Responding to Guatemala's changed political and economic\npolicy environment, the international community has mobilized substantial\nresources to support the country's economic and social development objectives.\nThe United States, along with other donor countries—especially France, Italy,\nSpain, Germany, Japan, and the international financial institutions—have\nincreased development project financing. Donors' response to the need for\ninternational financial support funds for implementation of the Peace Accords\nis, however, contingent upon Guatemalan government reforms and counterpart\nfinancing.\n\nProblems hindering economic growth include high crime rates, illiteracy and\nlow levels of education, and an inadequate and underdeveloped capital market.\nThey also include lack of infrastructure, particularly in the transportation,\ntelecommunications, and electricity sectors, although the state telephone\ncompany and electricity distribution were privatized in 1998. The distribution\nof income and wealth remains highly skewed. The wealthiest 10% of the\npopulation receives almost one-half of all income, and the top 20% receives\ntwo-thirds of all income. Approximately 29% of the population lives in\npoverty, and 6% of that number live in extreme poverty. Guatemala's social\nindicators, such as infant mortality and illiteracy, are successively\nimproving, but remain in low growth and are still among the worst in the\nhemisphere. In 2000 the percentage of girls completing primary school was\napproximately 52%. That percentage rose in 2010 to about 81%. The completion\nrate in primary school for boys in 2000 was 63% and rose to 87% in 2010.\n\nIn 2005 Guatemala ratified its signature to the Dominican Republic-Central\nAmerica Free Trade Agreement (DR-CAFTA) between the United States and several\nother Central American countries.\n\nThe electricity sector is being privatized, resulting in very high prices. In\nrural areas, although electricity consumption per household is very low, the\nratings can represent more than 20% of farmers' salaries according to the\nComité de développement paysan (Codeca). Since privatization, the price per\nkilowatthour has risen to the point of becoming one of the most expensive in\nLatin America. To protest against this situation and demand the\nrenationalization of electrical services, Codeca members organized\ndemonstrations and exposed themselves to repression. Between 2012 and 2014, 97\npeople were imprisoned, 220 wounded and 17 killed."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "2009 food crisis",
    "text": "In September 2009, Guatemalan President Álvaro Colom stated that the situation\nreduced the domestic food supply and reduced Guatemala's ability to import\nfood. Colom said the government would immediately seek assistance for\nemergency food supplies.\n\nA number of international organizations expressed concern about Guatemala's\neconomic status in 2009. They were the United Nations World Food Programme\n(WFP) and the World Bank."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Agriculture",
    "text": "Guatemala is the world leader in cardamom production and export. As of 2013,\ndemand for biofuels has resulted in diversion of land from subsistence\nagriculture to sugar cane and African Palm plantations. Much of the land is\nowned by large landlords. Due to legal requirements for production of biofuels\nin the United States the price of maize, a Guatemalan staple, has risen\nsharply. Agriculture accounts for 60% of Guatemalan exports and employs more\nthan 50% of the labor force.\n\nIn 2018, Guatemala produced 35.5 million tons of sugarcane (it's one of the 10\nlargest producers in the world) and 4 million tons of banana (it's one of the\n15 largest world producers). In addition, in the same year it produced 2.3\nmillion tons of palm oil, 245 thousand tons of coffee, 1.9 million tons of\nmaize, 623 thousand tons of melon, 312 thousand tons of pineapple, 564\nthousand tons of potato, 349 thousand tons of rubber, 331 thousand tons of\ntomato, 253 thousand tons of beans, 124 thousand tons of avocado, 124 thousand\ntons of lemon, 177 thousand tons of orange, 120 thousand tons of cauliflower\nand broccoli, 93 thousand tons of papaya, 107 thousand tons of watermelon, 98\nthousand tons of carrot, 75 thousand tons of cabbage, 84 thousand tons of\nlettuce and chicory, 38 thousand tons of cardamom in addition to smaller\nproductions of other agricultural products."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Scale",
    "text": "The agricultural sector of Guatemala's economy consists of two types of\nproducers: numerous small-scale peasant-owned farms in the highlands, and\nfewer medium- to large-scale operations in the more fertile lowlands. The\nsmaller farms produce staples for Guatemalan consumption, such as beans and\nmaize, as well as fruits and vegetables for export. Larger farms produce\nexport and plantation products like bananas, sugar cane, coffee, and rubber\nand palm oil. While 88% of agricultural land in Guatemala is in large-scale\nfarms, 92% of all farms in Guatemala are small. Large farms produce 1/3 more\nper hectare than small farms, but employ fewer people overall."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Non-traditional agricultural exports",
    "text": "The shift to the production of non-traditional agricultural exports (NTAE) is\na strategy used by developing countries like Guatemala to grow the\nagricultural sector and decreasing inequality by including the rural poor in\nthe benefits of globalization. The most important NTAE crops in Guatemala\ninclude\n\n* fruit like mangos, melons, and berries\n* vegetables like cauliflower, cabbage, broccoli, and snow peas\n* organic crops such as coffee. The value of non-traditional agricultural export crops has increased from $146 million US in 1992 to $262 million in 2001. IN 1998, NTAE accounted for 8.7 percent of the total exports. NTAE production largely comes from small-scale farmers. While the farmers who are involved in this market are not failing, this market limits their capital accumulation to slow growth, and therefore they are not able to profit highly off of this market."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "Gender",
    "text": "The agricultural sector of Guatemala is differentiated by gender, and this\ndifferential can be seen in several different areas within the sector. More\nmen than women inherit or buy land individually, although many houses choose\nto rent land instead of buying it. Additionally, there is a gender gap in the\ndivision of agricultural labor. Traditionally, men dominated subsistence\nproduction and agricultural production for domestic markets, while women had\nroles in small animal production, craft production, and the selling of\nproducts in regional rather than national markets. With the shift toward NTAE,\nthere has also been an increase in field labor for women. Additionally, women\nhave been included in land-use decision processes in NTAE production. Sarah\nHamilton, Linda Asturias de Barrios, and Brenda Tevalán have stated that\ndespite a traditional patriarchal structure in Guatemala, NTAE production is\nassociated with increased independence and equality between men and women."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "8.4",
    "section_name": "Climate change",
    "text": "Guatemalan farmers have experienced extreme weather events such as hurricanes,\nas well as erratic weather patterns with spikes and drops in temperature,\ntorrential rains, drought, and unexpected frost. One crop affected has been\npotatoes, which suffer from fungus.\n\nGuatemala's western highlands are particularly susceptible to climate change,\nimpacting the region’s predominantly indigenous population of subsistence\nfarmers. The main crops, potatoes and maize, have been over increasing\npressure as hard frosts in the region have become more frequent since 2013.\nHard frosts can kill a whole season’s worth of crops at once. At lower\nelevations, new pests are becoming more prevalent and there has been decreased\nrainfall.\n\nThe problem of food security and famine has increased, especially in the\n“corredor seco\" (an area extending from the departments of Izabal and Baja\nVerapaz in the north to Santa Rosa and Jutiapa in the south)."
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Macroeconomic development",
    "text": "Guatemala became more economically developed and stable from 1990 to 2011. The\nannual GDP growth rate for Guatemala in 2000 was 3.6%, but just 0.9% in 2009,\nincreasing slightly in 2010 to 2.0% The poverty rate in Guatemala in 2006 was\n54.8%, and the extreme poverty rate was 26.1%. Latin America as a whole had a\npoverty rate of 33% and an extreme poverty rate of 12.9% in 2009. The data\nindicate that Guatemala is behind other Latin American countries, in terms of\nlowering poverty rates, but there has been an increase in economic activity in\nterms of GDP and development. Guatemala's HDI increased from 0.462 in 1990, to\n0.525 in 2000, to 0.550 in 2005, and 0.574 in 2011.3 Guatemala ranked 131st in\nHDI in 2011. Other important human development statistics such as the total\nfertility rate in Guatemala decreased from 4.8 births per woman in 2000 to 4.2\nbirths per woman in 2006. During the same period, life expectancy increased\nfrom 67.9 years in 2000, to 69.9 years in 2006.\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund find them unreliable.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 19.2  | 2,660.2  | 7.7  | 1,070.3  | 3.7%  | 10.7%  | n/a  | n/a\n1981  | 21.1  | 2,857.9  | 8.4  | 1,140.2  | 0.6%  | 11.4%  | n/a  | n/a\n1982  | 21.6  | 2,854.5  | 8.5  | 1,126.2  | -3.5%  | 4.9%  | n/a  | n/a\n1983  | 21.9  | 2,819.3  | 8.9  | 1,140.0  | -2.5%  | 6.7%  | n/a  | n/a\n1984  | 22.8  | 2,862.6  | 9.3  | 1,163.1  | 0.5%  | 3.2%  | n/a  | n/a\n1985  | 23.4  | 2,861.9  | 11.0  | 1,338.7  | -0.6%  | 19.2%  | n/a  | n/a\n1986  | 23.9  | 2,849.4  | 5.9  | 705.8  | 0.1%  | 32.8%  | n/a  | n/a\n1987  | 25.4  | 2,949.2  | 6.9  | 797.0  | 3.6%  | 10.8%  | n/a  | n/a\n1988  | 27.3  | 3,093.7  | 7.4  | 841.8  | 3.9%  | 10.3%  | n/a  | n/a\n1989  | 29.5  | 3,260.3  | 8.6  | 946.8  | 3.9%  | 13.0%  | n/a  | n/a\n1990  | 31.5  | 3,403.7  | 7.5  | 808.9  | 3.1%  | 38.0%  | n/a  | n/a\n1991  | 33.6  | 3,540.5  | 9.2  | 966.0  | 3.0%  | 35.1%  | 2.6%  | n/a\n1992  | 35.9  | 3,699.9  | 10.2  | 1,045.4  | 4.6%  | 10.2%  | 2.6%  | n/a\n1993  | 38.0  | 3,825.6  | 11.0  | 1,110.0  | 3.4%  | 13.4%  | 2.6%  | n/a\n1994  | 40.2  | 3,951.2  | 12.5  | 1,229.0  | 3.5%  | 12.5%  | 2.6%  | n/a\n1995  | 42.8  | 4,116.0  | 14.0  | 1,348.9  | 4.4%  | 8.4%  | 2.6%  | n/a\n1996  | 44.8  | 4,212.4  | 15.0  | 1,408.2  | 2.8%  | 11.1%  | 2.7%  | n/a\n1997  | 47.5  | 4,362.0  | 17.0  | 1,559.6  | 4.1%  | 9.2%  | 2.7%  | n/a\n1998  | 50.2  | 4,512.1  | 18.4  | 1,656.4  | 4.6%  | 6.6%  | 2.7%  | n/a\n1999  | 52.8  | 4,639.2  | 17.4  | 1,527.2  | 3.7%  | 5.2%  | 2.7%  | n/a\n2000  | 55.4  | 4,752.9  | 18.1  | 1,555.6  | 2.5%  | 6.0%  | 2.7%  | 18.0%\n2001  | 58.0  | 4,862.2  | 19.7  | 1,655.0  | 2.4%  | 7.3%  | 2.8%  | 19.1%\n2002  | 61.4  | 5,027.9  | 21.9  | 1,795.8  | 4.2%  | 8.1%  | 2.8%  | 17.4%\n2003  | 64.2  | 5,138.5  | 23.1  | 1,847.3  | 2.6%  | 5.6%  | 2.8%  | 19.8%\n2004  | 67.9  | 5,307.3  | 25.0  | 1,951.8  | 3.0%  | 7.6%  | 3.0%  | 20.6%\n2005  | 72.2  | 5,512.6  | 28.2  | 2,151.7  | 3.1%  | 9.1%  | 3.1%  | 20.0%\n2006  | 78.6  | 5,864.7  | 31.3  | 2,337.0  | 5.6%  | 6.6%  | 3.1%  | 20.9%\n2007  | 85.6  | 6,246.2  | 35.0  | 2,556.8  | 6.0%  | 6.8%  | 3.1%  | 20.8%\n2008  | 90.4  | 6,454.9  | 40.2  | 2,873.1  | 3.7%  | 11.4%  | 3.3%  | 19.6%\n2009  | 91.6  | 6,395.8  | 38.0  | 2,654.1  | 0.6%  | 1.9%  | 3.5%  | 22.8%\n2010  | 95.3  | 6,511.4  | 41.5  | 2,836.1  | 2.8%  | 3.9%  | 3.5%  | 24.0%\n2011  | 101.6  | 6,794.3  | 47.4  | 3,172.1  | 4.4%  | 6.2%  | 3.1%  | 23.8%\n2012  | 107.2  | 7,017.7  | 49.9  | 3,267.8  | 3.1%  | 3.8%  | 2.8%  | 24.6%\n2013  | 112.0  | 7,183.1  | 53.0  | 3,397.6  | 3.5%  | 4.3%  | 3.0%  | 25.0%\n2014  | 118.8  | 7,457.9  | 57.8  | 3,632.1  | 4.4%  | 3.4%  | 2.7%  | 24.7%\n2015  | 127.6  | 7,849.1  | 62.2  | 3,825.9  | 4.1%  | 2.4%  | 2.5%  | 24.8%\n2016  | 130.1  | 7,847.2  | 66.0  | 3,982.0  | 2.7%  | 4.4%  | 2.6%  | 25.0%\n2017  | 133.9  | 7,912.5  | 71.6  | 4,233.0  | 3.1%  | 4.4%  | 2.5%  | 25.1%\n2018  | 141.8  | 8,210.5  | 73.3  | 4,247.5  | 3.4%  | 3.8%  | 2.3%  | 26.4%\n2019  | 150.1  | 8,518.5  | 77.2  | 4,379.8  | 4.0%  | 3.7%  | 2.2%  | 26.4%\n2020  | 149.2  | 8,300.2  | 77.6  | 4,318.6  | -1.8%  | 3.2%  | 3.6%  | 31.5%\n2021  | 167.8  | 9,148.9  | 86.0  | 4,687.8  | 8.0%  | 4.3%  | 3.6%  | 30.8%\n2022  | 185.8  | 9,931.4  | 91.3  | 4,879.9  | 3.4%  | 6.4%  | n/a  | 30.1%\n2023  | 198.6  | 10,402.8  | 95.6  | 5,006.7  | 3.2%  | 5.6%  | n/a  | 30.0%\n2024  | 210.6  | 10,809.0  | 102.9  | 5,280.9  | 3.8%  | 4.3%  | n/a  | 29.7%\n2025  | 222.3  | 11,183.1  | 110.2  | 5,545.5  | 3.6%  | 4.0%  | n/a  | 29.6%\n2026  | 234.6  | 11,564.2  | 117.9  | 5,815.0  | 3.5%  | 4.0%  | n/a  | 29.4%\n2027  | 247.5  | 11,957.2  | 126.1  | 6,094.9  | 3.5%  | 4.0%  | n/a  | 29.3%"
  },
  {
    "chapter_name": "Economy of Guatemala",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Electrical infrastructure in rural Guatemala",
    "text": "Guatemala electricity production by year\n\nIn Guatemala lack of access to electricity is concentrated in rural areas,\nalthough informal settlements around urban peripheries also tend to lack\nmetered service. Guatemala's post-civil war efforts to improve electrical\naccess in the countryside have proceeded under the auspices of the Rural\nElectrification Plan (Spanish: PER), a public-private partnership between the\ngovernment's Ministry of Education and Mines (Mineduc) and private power\ncompanies. Over the period 2000 to 2011, the PER improved rates of electrical\ngrid connectivity among non-indigenous (62 to 82 percent) and indigenous (48\nto 70 percent) households in Guatemala. Continuity of the electrical grid is\nrobust, with both groups reporting only about one hour per day of\nunavailability. Even when rural users are connected to the grid and pay\nsubsidized rates, they often have difficulty affording electrical appliances,\nwhich translates into low power consumption (less than five percent of average\nUS residential usage). This low power usage by rural customers is often not\nprofitable for power companies, disincentivizing further expansion of the\ngrid. As of 2014, one third of Guatemala's poorest rural residents still\nlacked electricity. By contrast, only around 8% of high-income rural residents\nlacked service, demonstrating that affordability plays a role in the\naccessibility of electrical grids.\n\nIn 2016, domestic hydroelectric power supplied the majority (about 34 percent)\nof Guatemala's electricity. The planning process for constructing new\nhydropower dams was updated by the Guatemalan Congress in 1996 and 2007\n(Decree 93–96, the \"General Law of Electricity\"), giving project developers\nmore power over the process, especially with regards to environmental impact\nassessments (EIA). A study in Guatemala covering the period 2009 to 2014 found\nthat private construction firms generally have little knowledge of the rights\nof rural indigenous peoples their projects may be affecting. Firms typically\nhire consultants to perform EIAs and liaise with affected communities.\nHowever, consultants are frequently disinterested in adequately informing\nrural communities of the potential impacts of proposed projects. Instead,\nconsultants frequently resort to bribery and manipulation to obtain consent to\nproceed with hydroelectric projects. Interlocutors from within the government\nsay that there is internal pressure to approve EIAs even if they are performed\ninadequately, showing that visions of Guatemala's energy future may be\noverriding the interests of segments of its populace."
  }
]