[
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The government of the Marshall Islands is the largest employer, employing\n30.6% of the work force, down by 3.4% since 1988. GDP is derived mainly from\npayments made by the United States under the terms of the amended Compact of\nFree Association. Direct U.S. aid accounted for 60% of the Marshall Islands'\n$90 million budget.\n\nThe main economic activities in the Marshall Islands are copra production and\nfisheries. Under the terms of the Compact of Free Association, Marshallese\ncitizens can travel and work in the United States without visas, which has\ncontributed to more than a 22% population decline over the period 2000–2021.\n\nThe Marshall Islands has no central bank. The official currency of the\nMarshall Islands is the US Dollar.\n\nPresident Donald Trump announced a 10% tariff on the Marshall Islands on 2\nApril 2025.",
    "openai_summarised_points": [
      "• The government of the Marshall Islands is the largest employer in the country, employing 30.6% of the workforce, which represents a decrease of 3.4% since 1988.",
      "• The Gross Domestic Product (GDP) of the Marshall Islands is primarily derived from payments made by the United States under the terms of the amended Compact of Free Association.",
      "• Direct financial aid from the United States accounts for 60% of the Marshall Islands' national budget, which totals $90 million.",
      "• The principal economic activities in the Marshall Islands include copra production and fisheries, forming the backbone of the local economy.",
      "• Under the Compact of Free Association, Marshallese citizens have the right to travel and work in the United States without requiring visas, a policy that has contributed to a population decline of more than 22% between the years 2000 and 2021.",
      "• The Marshall Islands does not have a central bank, and its official currency is the United States Dollar (USD).",
      "• On 2 April 2025, then-President Donald Trump announced the imposition of a 10% tariff on goods from the Marshall Islands."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:29.840199",
      "openai_model": "gpt-4.1-mini",
      "content_length": 825,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Subsistence economy",
    "text": "The subsistence economy consists of fishing and breadfruit, banana, taro, and\npandanus cultivation. On the outer islands, production of copra and\nhandicrafts provide cash income. The modern service-oriented economy is\nlocated in Majuro and Ebeye. It is sustained by government expenditures and\nthe U.S. Army installation at Kwajalein Atoll. The airfield there also serves\nas a second national hub for international flights.",
    "openai_summarised_points": [
      "• The subsistence economy of the Marshall Islands primarily involves fishing and the cultivation of breadfruit, banana, taro, and pandanus.",
      "• On the outer islands, the production of copra and handicrafts serves as a source of cash income for local inhabitants.",
      "• The modern, service-oriented economy is concentrated in the urban centers of Majuro and Ebeye.",
      "• This modern economy is supported largely by government expenditures and the presence of the U.S. Army installation located at Kwajalein Atoll.",
      "• The airfield at Kwajalein Atoll functions as a secondary national hub for international flights, complementing the primary airport infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:27.489228",
      "openai_model": "gpt-4.1-mini",
      "content_length": 423,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Modern economy",
    "text": "The modern sector consists of wholesale and retail trade; restaurants; banking\nand insurance; offshore companies registration; construction, repair, and\nprofessional services; and copra processing. Company formation in the Marshall\nIslands is available for residents and non-residents. Non-residents enjoy\nprivacy benefits and zero local taxes. Copra cake and oil are by far the\nnation's largest exports. A tuna processing plant employs 300 workers, mostly\nwomen, at $1.50 per hour. Copra production, the most important single\ncommercial activity for the past 100 years, now depends on government\nsubsidies. The subsidies, more a social policy than an economic strategy, help\nreduce migration from outer atolls to densely populated Majuro and Ebeye.\n\nMarine resources, including fishing, aquaculture, tourism development, and\nagriculture, are top government development priorities. The Marshall Islands\nsells fishing rights to other nations as a source of income. In recent years,\nthe Marshall Islands has begun to offer ship registrations under the Marshall\nIslands flag. As a small nation, the Marshall Islands must import a wide\nvariety of goods, including foodstuffs, consumer goods, machinery, and\npetroleum products.\n\nMarshall Islands has signed a bilateral trade agreement with Taiwan in 2019,\nthis agreement has been approved in 2023 and will take effect at a future\ndate."
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Coconut oil",
    "text": "Power authorities, private companies, and entrepreneurs are experimenting with\ncoconut oil as an alternative to diesel fuel for vehicles, power generators,\nand ships. Coconut trees abound in the Pacific's tropical islands. One liter\nof oil can be produced from the copra of 6–10 coconuts.",
    "openai_summarised_points": [
      "• Power authorities, private companies, and entrepreneurs in the Marshall Islands are actively experimenting with coconut oil as an alternative fuel source to diesel for vehicles, power generators, and ships.",
      "• Coconut trees are abundant throughout the tropical islands of the Pacific, providing a readily available raw material for coconut oil production.",
      "• The production of one liter of coconut oil requires the copra derived from approximately 6 to 10 coconuts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:26.460173",
      "openai_model": "gpt-4.1-mini",
      "content_length": 288,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Digital currency",
    "text": "In February 2018, the Marshallese government enacted the Sovereign Currency\nAct of 2018 to develop a national digital currency, the Marshallese Sovereign\n(SOV), that would reduce the country's dependence on the U.S. dollar. The SOV\nplan prompted a vote of no confidence in President Hilda Heine, who was in\nfavour of the scheme, in November 2018, which failed when parliament\ndeadlocked on the question.\n\nThe SOV is intended to serve as a second legal tender for the Marshall\nIslands, alongside the U.S. dollar; however, the International Monetary Fund\nhas stated that it does not meet the definition of a central bank digital\ncurrency. The IMF also raised concerns about macroeconomic and financial\nintegrity risks associated with the digital currency. Despite the objections\nof the IMF, the U.S. Treasury Department, and banks, the Marshallese\ngovernment has continued to work toward the development of the SOV. The\ncountry is using Algorand open-source blockchain technology for the SOV\nledger.",
    "openai_summarised_points": [
      "• In February 2018, the government of the Marshall Islands enacted the Sovereign Currency Act of 2018 to create a national digital currency called the Marshallese Sovereign (SOV), aiming to reduce the country's reliance on the U.S. dollar.",
      "• The introduction of the SOV led to a vote of no confidence against President Hilda Heine, who supported the digital currency initiative; this vote occurred in November 2018 but failed due to a parliamentary deadlock.",
      "• The SOV is designed to function as a second legal tender in the Marshall Islands, operating alongside the U.S. dollar rather than replacing it.",
      "• The International Monetary Fund (IMF) has stated that the SOV does not qualify as a central bank digital currency and has expressed concerns regarding potential macroeconomic risks and threats to financial integrity associated with the digital currency.",
      "• Despite opposition from the IMF, the U.S. Treasury Department, and various banking institutions, the Marshallese government has persisted in its efforts to develop and implement the SOV.",
      "• The Marshall Islands is utilizing Algorand’s open-source blockchain technology to maintain the ledger for the SOV digital currency."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:28.714963",
      "openai_model": "gpt-4.1-mini",
      "content_length": 997,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Gross domestic product",
    "text": "**GDP:** purchasing power parity - $150 million (2011 est.)\n\n**GDP - real growth rate:** 3% (2011 est.)\n\n**GDP - per capita:** purchasing power parity - $2 500 (2011 est.)\n\n**GDP - composition by sector:**\n_agriculture:_ 22%\n_industry:_ 18%\n_services:_ 60% (2008)\n\nThe islands have few natural resources, and their imports far exceed exports.\nAccording to the CIA, the value of exports in 2013 was approximately $53.7\nmillion while estimated imports were $133.7 million. Agricultural products\ninclude coconuts, tomatoes, melons, taro, breadfruit, fruits, pigs and\nchickens. Industry is made up of the production of copra and craft items, tuna\nprocessing and tourism. The CIA estimates that the GDP in 2016 was an\nestimated $180 million, with a real growth rate of 1.7% while the GDP per\ncapita was $3,300.",
    "openai_summarised_points": [
      "• The Gross Domestic Product (GDP) of the Marshall Islands at purchasing power parity was estimated at $150 million in 2011.",
      "• The real GDP growth rate of the Marshall Islands was approximately 3% in 2011.",
      "• The GDP per capita at purchasing power parity for the Marshall Islands was estimated at $2,500 in 2011.",
      "• The GDP composition by sector in 2008 was as follows: agriculture accounted for 22%, industry for 18%, and services for 60%.",
      "• The Marshall Islands possess few natural resources, resulting in imports significantly exceeding exports.",
      "• According to the CIA World Factbook, the value of exports from the Marshall Islands in 2013 was approximately $53.7 million.",
      "• Estimated imports for the Marshall Islands in 2013 were about $133.7 million, indicating a substantial trade deficit.",
      "• Key agricultural products of the Marshall Islands include coconuts, tomatoes, melons, taro, breadfruit, various fruits, pigs, and chickens.",
      "• The industrial sector comprises the production of copra, craft items, tuna processing, and tourism-related activities.",
      "• The CIA estimated the GDP of the Marshall Islands in 2016 to be approximately $180 million.",
      "• The real GDP growth rate in 2016 was estimated at 1.7%.",
      "• The GDP per capita in 2016 was estimated to be $3,300."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:30.145852",
      "openai_model": "gpt-4.1-mini",
      "content_length": 805,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of the Marshall Islands",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Marshall Island productivity",
    "text": "**Population below poverty line:** NA%\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ NA%\n_highest 10%:_ NA%\n\n**Inflation rate (consumer prices):** 5% (2007)\n\n**Labor force:** NA\n\n**Labor force - by occupation:** agriculture 48%, industry 12%, services 40%\n(2008)\n\n**Unemployment rate:** 8% (2011 est.)\n\n**Budget:**\n_revenues:_ $169.5 million\n_expenditures:_ $112.1 million, including capital expenditures of $19.5\nmillion (FY08/09 est.)\n\n**Industries:** copra, fish, tourism, craft items from shell, wood, and\npearls, offshore banking (embryonic)\n\n**Industrial production growth rate:** NA%\n\n**Electricity - production:** 114 GWh (2008)\n\n**Electricity - production by source:**\n_fossil fuel:_ NA%\n_hydro:_ NA%\n_nuclear:_ NA%\n_other:_ NA%\n\n**Electricity - consumption:** 57 GWh (1994)\n\n**Electricity - exports:** 0 kWh (1994)\n\n**Electricity - imports:** 0 kWh (1994)\n\n**Agriculture - products:** coconuts, cacao, taro, breadfruit, fruits; pigs,\nchickens\n\n**Exports:** $132 million (f.o.b., 2008 est.)\n\n**Exports - commodities:** fish, coconut oil, trochus shells\n\n**Exports - partners:** United States, Japan, Australia, New Zealand\n\n**Imports:** $125 million (f.o.b., 2008 est.)\n\n**Imports - commodities:** foodstuffs, machinery and equipment, fuels,\nbeverages and tobacco\n\n**Imports - partners:** United States, Japan, Australia, New Zealand, Guam,\nSingapore\n\n**Debt - external:** $68 million (2008 est.)\n\n**Economic aid - recipient:** approximately $40 million annually from the US\n\n**Currency:** 1 United States dollar (US$) = 100 cents\n\n**Exchange rates:** US currency is used\n\n**Fiscal year:** 1 October - 30 September"
  }
]