[
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Andorra** is a developed and free market economy driven by\nfinance, retail, and tourism. The country's gross domestic product (GDP) was\nUS$6.00 billion in 2024. Attractive for shoppers from France and Spain as a\nfree port, Andorra also has developed active summer and winter tourist\nresorts. With some 270 hotels and 400 restaurants, as well as many shops, the\ntourist trade employs a growing portion of the domestic labour force. An\nestimated 10 million tourists visit annually.\n\nThere is a fairly active trade in consumer goods, including imported\nmanufactured items, which, because they are duty-free, are less expensive in\nAndorra than in neighboring countries. Andorra's duty-free status also has had\na significant effect on the controversy concerning its relationship with the\nEuropean Union (EU). Its negotiations on duty-free status and relationship\nwith the EU began in 1987, soon after Spain joined. An agreement that went\ninto effect in July 1991 sets duty-free quotas and places limits on certain\nitems – mainly milk products, tobacco products and alcoholic beverages.\nAndorra is permitted to maintain price differences from other EU countries,\nand visitors enjoy limited duty-free allowances.\n\nThe results of Andorra's elections thus far indicate that many support the\ngovernment's reform initiatives and believe the country must, to some degree,\nintegrate into the European Union in order to continue to enjoy its\nprosperity. Although arable land comprises less than 2% of the country,\nagriculture was the mainstay of the Andorran economy until the upsurge in\ntourism. Sheep raising has been the principal agricultural activity, but\ntobacco growing is lucrative. Most of Andorra's food is imported.\n\nIn addition to handicrafts, manufacturing includes cigars, cigarettes and\nfurniture for domestic and export markets. A hydroelectric plant at Les\nEscaldes, with a capacity of 26.5 megawatts, provides 40% of Andorra's\nelectricity; Spain provides the rest.",
    "openai_summarised_points": [
      "• The economy of Andorra is characterized as a developed, free market economy primarily driven by the sectors of finance, retail, and tourism.",
      "• In 2024, Andorra's gross domestic product (GDP) was approximately US$6.00 billion.",
      "• The country is an attractive destination for shoppers from France and Spain, functioning as a free port that facilitates duty-free shopping.",
      "• Andorra has developed extensive summer and winter tourist resorts, supporting its tourism industry.",
      "• The country hosts around 270 hotels and 400 restaurants, along with numerous shops, indicating a robust tourist infrastructure.",
      "• Tourism employs a growing segment of the domestic labor force, with an estimated 10 million tourists visiting annually.",
      "• There is an active trade in consumer goods, including imported manufactured items, which are less expensive due to duty-free status, making them more affordable than in neighboring countries.",
      "• Andorra's duty-free status has significantly influenced its relationship with the European Union (EU), sparking controversy and negotiations.",
      "• Negotiations regarding duty-free status and the broader relationship with the EU began in 1987, shortly after Spain joined the EU.",
      "• An agreement effective from July 1991 established duty-free quotas and imposed limits on certain items, notably milk products, tobacco, and alcoholic beverages.",
      "• Under this agreement, Andorra is allowed to maintain price differences from other EU countries, and visitors are granted limited duty-free allowances.",
      "• Electoral results in Andorra suggest that many citizens support government reform initiatives and believe that some degree of EU integration is necessary to sustain economic prosperity.",
      "• Arable land accounts for less than 2% of Andorra's territory; historically, agriculture was the mainstay of the economy until tourism surged.",
      "• Sheep raising has been the principal agricultural activity, while tobacco cultivation is considered lucrative.",
      "• Most of Andorra's food supplies are imported, reflecting limited domestic agricultural production.",
      "• The country’s manufacturing sector includes the production of cigars, cigarettes, and furniture, serving both domestic consumption and export markets.",
      "• A hydroelectric plant located at Les Escaldes, with a capacity of 26.5 megawatts, supplies approximately 40% of Andorra's electricity needs; the remaining electricity is supplied by Spain."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:13:23.134575",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1985,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Tourism is the mainstay of Andorra's economy, accounting for roughly 80% of\nGDP. An estimated 9 million tourists visit annually, attracted by Andorra's\nduty-free status and by its summer and winter resorts. Andorra's comparative\nadvantage has recently eroded as the economies of neighboring France and Spain\nhave been opened up, providing broader availability of goods and lower\ntariffs. The banking sector, with its \"tax haven\" status, also contributes\nsubstantially to the economy. Agricultural production is limited by a scarcity\nof arable land, and most food has to be imported. The principal livestock\nactivity is sheep raising. Manufacturing consists mainly of cigarettes, cigars\nand furniture. Andorra is a member of the EU Customs Union and is treated as\nan EU member for trade in manufactured goods (no tariffs)."
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Statistics",
    "text": "Sotheby's Andorra office\n\n**GDP:** purchasing power parity - US$3.327 billion (2015)\n_country comparison to the world:_ 190\n\n**GDP - real growth rate:** 8.95% (2015 est.)\n_country comparison to the world:_ 132\n\n**GDP - per capita:** purchasing power parity - US$49,900 (2015)\n_country comparison to the world:_ 29\n\n**GDP - composition by sector:** (2015 est.)\n_agriculture:_ 11.9%\n_industry:_ 33.6%\n_services:_ 54.5%\n\n**Population below poverty line:** N/A\n\n**Household income or consumption by percentage share:**\n_lowest 10%:_ N/A\n_highest 10%:_ N/A\n\n**Inflation rate (consumer prices):** -0.9% (2015 est.)\n_country comparison to the world:_ 225\n\n**Labor force:** 42,230 (2007)\n_country comparison to the world:_ 185\n\n**Labor force - by occupation:** agriculture 0.3%, industry 20.8%, services\n79% (2007)\n\n**Unemployment rate:** 3.7%\n_country comparison to the world:_ 183\n\n**Budget:**\n_revenues:_ US$1.872 billion\n_expenditures:_ US$2.06 billion (2016)\n\n**Industries:** tourism (particularly skiing), banking, timber, furniture\n\n**Industrial production growth rate:** -3.9% (2020 est.)\n_country comparison to the world:_ 184\n\n**Electricity - production:** N/A\n\n**Electricity - production by source:**\n_fossil fuel:_ 0%\n_hydro:_ 40%\n_nuclear:_ 0%\n_other:_ 60% imported from Spain\n\n**Electricity - consumption:** N/A\n\n**Electricity - exports:** N/A\n\n**Electricity - imports:** N/A ; note - imports electricity from Spain and\nFrance; Andorra generates a small amount of hydropower\n\n**Agriculture - products:** small quantities of rye, wheat, barley, oats,\nvegetables, tobacco, sheep, cattle\n\n**Exports:** US$1.842 billion f.o.b. (2020 est.)\n_country comparison to the world:_ 163\n\n**Exports - commodities:** integrated circuits, dental fitting supplies, cars,\ngold, essential oils (2021)\n\n**Exports - partners:** Spain 40%, France 19%, United States 11%, Mauritania\n5% (2019)\n\n**Imports:** US$1.727 billion (2020 est.)\n_country comparison to the world:_ 178\n\n**Imports - commodities:** cars, refined petroleum, perfumes, shaving\nproducts, liquors (2019)\n\n**Imports - partners:** Spain 71%, France 17% (2019)\n\n**Debt - external:** $0 (2016)\n\n**Economic aid - recipient:** none\n\n**Currency:** Euros have replaced the French franc and the Spanish peseta.\n\n**Exchange rates:** euros per US dollar - 0.845 (2021), 0.6827 (2008), 0.7306\n(2007), 0.7964 (2006), 0.8041 (2005), 0.8054 (2004), 0.886 (2003), 1.0626\n(2002), 1.1175 (2001), 0.9867 (January 2000), 0.9386 (1999)\n\n**Fiscal year:** calendar year"
  },
  {
    "chapter_name": "Economy of Andorra",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in Andorra\nis Services with 2,515 companies followed by Retail Trade and Wholesale Trade\nwith 1,157 and 1,144 companies respectively."
  }
]