[
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article **needs additional citations forverification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  \n_Find sources:_ \"Economy of Pakistan\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( January 2023)__(Learn how and when to remove this\nmessage)_  \n---|---  \n| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2023)_  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nThe economy of Pakistan is categorized as a developing economy. It ranks as\nthe 26th-largest based on GDP using purchasing power parity (PPP) and the 44th\nlargest in terms of nominal GDP. With a population of 254.4 million people as\nof 2024, Pakistan's position at per capita income ranks 160th by GDP (nominal)\nand 141st by GDP (PPP) according to the International Monetary Fund (IMF).\n\nIn its early years, Pakistan's economy relied heavily on private industries.\nThe nationalization of a significant portion of the sector, including\nfinancial services, manufacturing, and transportation, began in the early\n1970s under Zulfikar Ali Bhutto. During Zia-ul Haq's regime in the 1980s, an\n\"Islamic\" economy was adopted, outlawing economic practices forbidden in\nSharīʿah and mandating traditional religious practices. The economy started\nprivatizing again in the 1990s.\n\nThe economic growth centers in Pakistan are located along the Indus River;\nthese include the diversified economies of Karachi and major urban centers in\nPunjab (such as Faisalabad, Lahore, Sialkot, Rawalpindi, and Gujranwala),\nalongside less developed areas in other parts of the country. In recent\ndecades, regional connectivity initiatives such as the China-Pakistan Economic\nCorridor (CPEC) have emerged as pivotal contributors to infrastructure and\nenergy development, with long-term implications for economic stability.\nPakistan was classified as a semi-industrial economy for the first time in the\nlate 1990s, albeit an underdeveloped country with a heavy dependence on\nagriculture, particularly the textile industry relying on cotton production.\nPrimary export commodities include textiles, leather goods, sports equipment,\nchemicals, and carpets/rugs.\n\nPakistan is presently undergoing economic liberalization, including the\nprivatization of all government corporations, aimed at attracting foreign\ninvestment and reducing budget deficits. However, the country continues to\ngrapple with challenges such as rapid population growth, widespread\nilliteracy, political instability, hostile neighbors and heavy foreign debt.",
    "openai_summarised_points": [
      "• The economy of Pakistan is classified as a developing economy, ranking as the 26th-largest globally based on GDP using purchasing power parity (PPP) and the 44th-largest by nominal GDP as of 2024.",
      "• Pakistan has a population of approximately 254.4 million people in 2024, with per capita income rankings at 160th by nominal GDP and 141st by GDP (PPP) according to the International Monetary Fund (IMF).",
      "• In its early years post-independence, Pakistan’s economy was heavily reliant on private industries before a significant nationalization drive in the early 1970s under Prime Minister Zulfikar Ali Bhutto, which encompassed sectors such as financial services, manufacturing, and transportation.",
      "• During General Zia-ul Haq’s regime in the 1980s, Pakistan adopted an \"Islamic\" economy framework that outlawed economic practices forbidden under Sharīʿah law and mandated adherence to traditional religious economic principles.",
      "• Economic privatization efforts resumed in the 1990s, reversing some of the earlier nationalization policies to encourage private sector growth.",
      "• The primary economic growth centers in Pakistan are situated along the Indus River, including the diversified economies of Karachi and major urban centers in Punjab such as Faisalabad, Lahore, Sialkot, Rawalpindi, and Gujranwala, contrasted with less developed regions elsewhere in the country.",
      "• Regional connectivity projects like the China-Pakistan Economic Corridor (CPEC) have become crucial in recent decades, significantly contributing to infrastructure and energy development with potential long-term benefits for Pakistan’s economic stability.",
      "• By the late 1990s, Pakistan was classified as a semi-industrial economy, though it remained underdeveloped with a heavy reliance on agriculture, particularly the textile industry, which depends largely on cotton production.",
      "• Pakistan’s primary export commodities include textiles, leather goods, sports equipment, chemicals, and carpets/rugs, reflecting its industrial and agricultural base.",
      "• The country is currently undergoing economic liberalization policies, including the privatization of all government corporations, aimed at attracting foreign investment and reducing budget deficits.",
      "• Despite these reforms, Pakistan faces ongoing challenges such as rapid population growth, widespread illiteracy, political instability, hostile relations with neighboring countries, and a heavy burden of foreign debt.",
      "• The Wikipedia article on the Economy of Pakistan requires additional citations for verification, updates to reflect recent developments as of January 2023, and overall improvement to ensure accuracy and comprehensiveness."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:28:55.761828",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2834,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Inception",
    "text": "In the late 1940s, upon its establishment, Pakistan had an agrarian-based\neconomy. Agriculture constituted 53% of the country's GDP in 1947 and slightly\nincreased to 53.2% in 1949–50. With a population of approximately 30 million,\nincluding around 6 million residing in urban areas, about 65% of the labor\nforce was engaged in agriculture. The agricultural sector played a crucial\nrole, contributing to 99.2% of exports and making up nearly 90% of foreign\nexchange earnings.\n\nDespite possessing significant land and mineral resources in both East and\nWest Pakistan, including natural gas, crude oil, coal, limestone, and marble,\nPakistan faced numerous challenges. In 1950, its per capita income was around\n$360 (in 1985 international dollars), and the literacy rate was only 10%. The\nnation encountered a lack of economic infrastructure, financial resources, and\nan industrial foundation, particularly with poverty rates ranging from 55% to\n60% in the West Pakistan region.\n\nDue to limited capital in the small private sector, the government opted to\nfocus on the public sector to foster economic and industrial development. In\nthe fiscal year 1949–50, Pakistan recorded a national savings rate of 2%, a\nforeign savings rate of 2%, and an investment rate of 4%. Manufacturing\ncontributed 7.8% to the GDP, while services, trade, and other sectors\naccounted for a significant 39%, reflecting a policy centered around import-\nsubstituting industrialization. The trade balance of payments indicated a\ndeficit of 66 million rupees (Rs) during the period spanning 1949/50 to\n1950/51.",
    "openai_summarised_points": [
      "• In the late 1940s, upon its establishment in 1947, Pakistan had an agrarian-based economy with agriculture constituting 53% of the country's GDP in 1947, which slightly increased to 53.2% in the fiscal year 1949–50.",
      "• Pakistan's population at the time was approximately 30 million, including around 6 million urban residents, with about 65% of the labor force engaged in agriculture.",
      "• The agricultural sector was critically important, contributing to 99.2% of Pakistan’s exports and accounting for nearly 90% of foreign exchange earnings during this period.",
      "• Despite possessing significant land and mineral resources in both East and West Pakistan, including natural gas, crude oil, coal, limestone, and marble, Pakistan faced substantial economic challenges.",
      "• In 1950, Pakistan’s per capita income was approximately $360 measured in 1985 international dollars, and the literacy rate was only 10%, indicating low human capital development.",
      "• The country suffered from a lack of economic infrastructure, limited financial resources, and an underdeveloped industrial base, with poverty rates estimated between 55% and 60% in the West Pakistan region.",
      "• Due to limited capital within the small private sector, the government prioritized the public sector to drive economic and industrial development.",
      "• In the fiscal year 1949–50, Pakistan’s national savings rate was recorded at 2%, foreign savings also at 2%, resulting in an overall investment rate of 4%.",
      "• The manufacturing sector contributed 7.8% to the GDP, while services, trade, and other sectors collectively accounted for 39%, reflecting a policy focus on import-substituting industrialization.",
      "• The trade balance of payments showed a deficit of 66 million rupees (Rs) during the period from 1949/50 to 1950/51, highlighting early economic imbalances."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:29:04.733793",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1578,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "1950s",
    "text": "The 1950s marked the initiation of planned development in Pakistan, with the\nintroduction of the Colombo Plan in 1951 leading to a series of Five-Year\nPlans from 1955 to 1998. Concurrently, a Ten-Year Perspective Plan was\nimplemented, complemented by a rolling Three-Year Development Plan.\n\nDuring the 1950s, Pakistan pursued a policy of import-substituting\nindustrialization. Notably, the Korean War (1950–1953) brought substantial\nmerchant profits to Pakistan's public and emerging private sectors, fueling\nindustrialization.\n\nIn 1952, Pakistan imposed bans on the imports of cotton textiles and luxury\ngoods, followed by comprehensive import regulations in 1953, propelling the\ncountry into the ranks of the fastest-growing nations. However, biased\npolicies against agriculture and unfavorable trade terms between agriculture\nand industry led to a decline in the annual growth rate of agriculture.\n\nBy the late 1950s, Pakistan achieved self-sufficiency in cotton textiles,\nemphasizing export development. The influx of US military and economic aid\namounting to US$500 million during 1955–58 contributed to Pakistan's growth\nreliant on foreign aid.\n\nIn 1959, after a military coup d'état in 1958, the martial law regime\nintroduced export bonus vouchers as import licenses and exempted certain goods\nfrom licensing. During this period, Pakistan faced a worsening trade balance,\nwith deficits increasing from −831 million Rupees in 1950/51 to −1043 million\nrupees in 1959/60.\n\nEconomically, agriculture grew at an annual rate of 1.6%, while manufacturing\nexpanded impressively at 7.7% per annum during the 1950s. In the fiscal year\n1959–60, the Per Capita Gross National Product (GNP) stood at Rs. 355 in West\nPakistan and Rs. 269 in East Pakistan, indicating a growing economic disparity\nbetween the two regions.",
    "openai_summarised_points": [
      "• The 1950s marked the beginning of planned economic development in Pakistan, initiated by the introduction of the Colombo Plan in 1951, which led to the implementation of a series of Five-Year Plans spanning from 1955 to 1998.",
      "• Alongside the Five-Year Plans, Pakistan also executed a Ten-Year Perspective Plan and a rolling Three-Year Development Plan during this decade to guide its economic growth.",
      "• Pakistan adopted a policy of import-substituting industrialization throughout the 1950s, aiming to reduce dependency on foreign goods by developing domestic industries.",
      "• The Korean War (1950–1953) significantly benefited Pakistan’s economy by generating substantial merchant profits for both the public sector and emerging private enterprises, thereby accelerating industrialization efforts.",
      "• In 1952, Pakistan imposed bans on the importation of cotton textiles and luxury goods, followed by the introduction of comprehensive import regulations in 1953, which collectively propelled the country into the ranks of the fastest-growing economies.",
      "• Despite industrial growth, biased government policies against the agricultural sector and unfavorable trade terms between agriculture and industry caused a decline in the annual growth rate of agriculture during the 1950s.",
      "• By the late 1950s, Pakistan achieved self-sufficiency in the production of cotton textiles and began focusing on the development of exports in this sector.",
      "• Between 1955 and 1958, Pakistan received substantial US military and economic aid totaling US$500 million, which played a crucial role in supporting the country’s growth that was heavily reliant on foreign assistance.",
      "• Following the military coup d'état in 1958, the martial law regime introduced economic measures in 1959, including export bonus vouchers used as import licenses and exemptions for certain goods from licensing requirements.",
      "• During the late 1950s, Pakistan experienced a worsening trade balance, with trade deficits increasing from −831 million Rupees in the fiscal year 1950/51 to −1043 million Rupees in 1959/60.",
      "• The agricultural sector in Pakistan grew at an annual rate of 1.6% during the 1950s, while the manufacturing sector expanded at a significantly higher rate of 7.7% per annum.",
      "• In the fiscal year 1959–60, the Per Capita Gross National Product (GNP) was recorded at Rs. 355 in West Pakistan and Rs. 269 in East Pakistan, highlighting a growing economic disparity between the two regions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:29:25.021654",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1813,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "1960s",
    "text": "In the 1960s, amid a substantial influx of American aid, Pakistan enjoyed\npolitical stability, fostering robust economic growth. Poverty, measured by\nthe poverty headcount ratio, fluctuated from nearly 50% in the early 1960s to\n54% in 1963–64.\n\nDuring the 1960s, Pakistan achieved an impressive annual agricultural growth\nrate of 5%, driven by substantial investments in water resources, increased\nfarmer incentives, mechanization, greater use of fertilizers and pesticides,\nand expanded cultivation of high-yielding rice and wheat varieties in the\nGreen Revolution.\n\nLarge-scale manufacturing experienced significant growth, expanding at a\nremarkable rate of 16% per annum from 1960/61 to 1964/65, fueled by protective\nmeasures for domestic industries, including export subsidies.\n\nHowever, the Pakistan-India War of 1965 led to reduced foreign economic\nassistance, impacting the growth rate of large-scale manufacturing. From\n1965–70, this sector grew at a comparatively lower rate of 10% per annum.\n\nDespite challenges, Pakistan achieved an impressive average annual GDP growth\nrate of 6.7% throughout the 1960s. In the fiscal year 1969–70, the poverty\nincidence rate decreased to 46%. Per Capita GNP was Rs. 504 in West Pakistan\nand Rs. 314 in East Pakistan, indicating a widening regional economic\ndisparity.",
    "openai_summarised_points": [
      "• In the 1960s, Pakistan experienced political stability accompanied by a substantial influx of American aid, which collectively fostered robust economic growth throughout the decade.",
      "• The poverty headcount ratio in Pakistan fluctuated during the early 1960s, starting at nearly 50% and rising to 54% in the fiscal year 1963–64, indicating persistent poverty challenges despite economic progress.",
      "• Pakistan achieved an impressive annual agricultural growth rate of 5% during the 1960s, driven by significant investments in water resource development, enhanced incentives for farmers, increased mechanization, greater use of fertilizers and pesticides, and the expanded cultivation of high-yielding rice and wheat varieties as part of the Green Revolution.",
      "• Large-scale manufacturing in Pakistan expanded rapidly at an annual growth rate of 16% from 1960/61 to 1964/65, supported by protective government policies for domestic industries, including the provision of export subsidies.",
      "• The outbreak of the Pakistan-India War in 1965 resulted in a reduction of foreign economic assistance, which negatively impacted the growth momentum of large-scale manufacturing, causing its growth rate to decline to 10% per annum during the period 1965–70.",
      "• Despite the setbacks caused by the 1965 war and reduced foreign aid, Pakistan maintained an impressive average annual GDP growth rate of 6.7% throughout the entire 1960s.",
      "• By the fiscal year 1969–70, the incidence of poverty in Pakistan had decreased to 46%, reflecting some improvement in living standards over the decade.",
      "• Regional economic disparities were evident in 1969–70, with Per Capita Gross National Product (GNP) recorded at Rs. 504 in West Pakistan compared to Rs. 314 in East Pakistan, highlighting a significant economic gap between the two wings of the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:29:33.880956",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1313,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "1970s",
    "text": "The economic landscape in the early 1970s witnessed growing disparities\nbetween East and West Pakistan, leading to East Pakistan's declaration of\nindependence and the emergence of Bangladesh in 1971. Subsequently, Pakistan\nunderwent notable transformations in both its political and economic spheres.\n\nUnder martial law authorities, amidst challenging macroeconomic conditions,\nthe socialist Pakistan People's Party gained empowerment. This period grappled\nwith numerous economic challenges, including a surge in poverty incidence to\n55% during 1971–72. Pakistan also confronted heightened import costs due to\nthe global oil price shock in October 1973, a severe global recession from\n1974 to 1977, cotton sector failures in 1974–75, pest infestations affecting\ncrops, and massive floods in 1973, 1974, and 1976–77.\n\nOne significant economic issue during this time was high inflation, with\nprices increasing by an average of 15% per annum between 1972 and 1977. The\nfiscal deficit/GDP ratio averaged 8.1% during 1973–77, indicating substantial\nfiscal challenges. Trade imbalances were apparent, with trade deficits rising\nfrom US$337 million in 1970–71 to US$1,184 million in 1976–77.\n\nThe military coup d'état of 1977, leading to the establishment of a martial\nlaw regime that initiated denationalization, deregulation, and privatization\npolicies. Agriculture experienced modest growth at a rate of 2.4% per annum,\nwhile large-scale manufacturing expanded at a rate of 5.5% per annum during\nthe 1970s.\n\nLarge and medium-scale private manufacturing played a significant role,\ncontributing 75% of the total value-added and investment in manufacturing\nduring the 1970s. The remaining 25% of value-added came from small-scale\nmanufacturing.\n\nOverall, this period was marked by significant political and economic changes,\ndriven by challenges posed by economic disparities, political shifts, and\nefforts to address issues such as inflation, fiscal deficits, and trade\nimbalances.",
    "openai_summarised_points": [
      "• In the early 1970s, growing economic disparities between East and West Pakistan culminated in East Pakistan declaring independence and the formation of Bangladesh in 1971, significantly altering Pakistan's political and economic landscape.",
      "• During the early 1970s, Pakistan was governed under martial law authorities amid difficult macroeconomic conditions, with the socialist Pakistan People's Party gaining empowerment during this period.",
      "• The incidence of poverty in Pakistan surged to 55% during the fiscal year 1971–72, reflecting severe socioeconomic challenges.",
      "• Pakistan faced increased import costs following the global oil price shock in October 1973, which exacerbated economic difficulties.",
      "• From 1974 to 1977, Pakistan endured a severe global recession that negatively impacted its economic performance.",
      "• The cotton sector suffered failures in 1974–75, compounded by pest infestations that affected crop yields, further straining the agricultural economy.",
      "• Pakistan experienced massive floods in the years 1973, 1974, and 1976–77, which caused widespread damage and economic disruption.",
      "• Inflation was a significant economic issue, with prices rising at an average annual rate of 15% between 1972 and 1977.",
      "• The fiscal deficit to GDP ratio averaged 8.1% during the period 1973–77, indicating persistent and substantial fiscal challenges for the government.",
      "• Trade deficits widened considerably, increasing from US$337 million in 1970–71 to US$1,184 million in 1976–77, highlighting growing trade imbalances.",
      "• The military coup d'état of 1977 resulted in the establishment of a martial law regime that implemented policies of denationalization, deregulation, and privatization to reform the economy.",
      "• Agricultural growth during the 1970s was modest, averaging 2.4% per annum despite the various adversities faced.",
      "• Large-scale manufacturing expanded at a faster rate of 5.5% per annum throughout the 1970s, contributing to industrial development.",
      "• Large and medium-scale private manufacturing sectors were dominant in the manufacturing industry, accounting for 75% of the total value-added and investment in manufacturing during the 1970s.",
      "• Small-scale manufacturing contributed the remaining 25% of the total value-added in the manufacturing sector during this decade.",
      "• The 1970s in Pakistan were characterized by significant political upheaval and economic transformation driven by the challenges of economic disparities, inflation, fiscal deficits, trade imbalances, and policy shifts following the 1977 military coup."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:29:43.228386",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1975,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "1980s",
    "text": "The 1980s brought substantial changes to Pakistan's economic landscape, moving\naway from the nationalization policies of the 1970s and fostering private\nsector industrial investment, which greatly contributed to robust economic\ngrowth. Notable developments in this era included a drop in the poverty\nheadcount ratio to 29.1% in 1986–87, showcasing a decline in poverty\nincidence. The unemployment rate exhibited a positive trend, decreasing from\n3.7% in 1980 to 2.6% in 1990.\n\nBetween 1985 and 1988, the government endeavored to implement an Islamic\ninterest-free banking system, introducing business partnerships based on\nprofit and loss sharing. The national savings/GDP ratio reached a notable 16%\nin 1986–87, largely due to significant worker remittances from the Middle\nEast. Despite this growth, challenges emerged, including negative public\nsavings and a declining public investment/GDP ratio throughout the 1980s.\n\nTo address increasing budget deficits in the early 1980s, the government\nheavily relied on non-bank domestic borrowing, resulting in substantial\ndomestic debt growth. Consequently, the public debt/GDP ratio surged to 77.1%\nin 1988, 81.9% in 1989, and 82.6% in 1990, leading to significant interest\npayments and persistent fiscal deficits.\n\nIn 1985, democracy was restored in Pakistan, marking a pivotal political\ndevelopment. The country experienced a commendable average annual GDP growth\nrate of 6.3% between 1980 and 1990. The 1980s saw a surge in manufacturing\nexports, with an annual large-scale manufacturing growth rate of 8.8%, and\nsolid growth in agriculture, with an annual agricultural growth rate of 5.4%.\n\nThese highlights underscore a transformative and recovering economic period in\nthe 1980s, characterized by a shift in economic policies, improved fiscal\nperformance, and substantial progress in poverty reduction and employment. The\nera also witnessed efforts to align financial practices with Islamic\nprinciples and significant economic growth in the manufacturing and\nagricultural sectors.",
    "openai_summarised_points": [
      "• The 1980s marked a significant shift in Pakistan's economic landscape, moving away from the nationalization policies of the 1970s and promoting private sector industrial investment, which substantially contributed to robust economic growth.",
      "• The poverty headcount ratio declined to 29.1% in 1986–87, indicating a notable reduction in poverty incidence during the decade.",
      "• The unemployment rate improved, decreasing from 3.7% in 1980 to 2.6% in 1990, reflecting positive labor market trends.",
      "• Between 1985 and 1988, the Pakistani government attempted to implement an Islamic interest-free banking system, introducing business partnerships based on profit and loss sharing principles.",
      "• The national savings to GDP ratio reached 16% in 1986–87, largely driven by substantial worker remittances from the Middle East.",
      "• Despite growth in savings, the 1980s experienced challenges including negative public savings and a declining public investment to GDP ratio throughout the decade.",
      "• To manage increasing budget deficits in the early 1980s, the government relied heavily on non-bank domestic borrowing, which led to a significant increase in domestic debt.",
      "• The public debt to GDP ratio escalated sharply, reaching 77.1% in 1988, 81.9% in 1989, and 82.6% in 1990, resulting in high interest payments and ongoing fiscal deficits.",
      "• The restoration of democracy in 1985 was a pivotal political event that influenced the economic environment of Pakistan during the 1980s.",
      "• Pakistan achieved an average annual GDP growth rate of 6.3% between 1980 and 1990, indicating strong overall economic performance.",
      "• The manufacturing sector experienced a surge, with an annual large-scale manufacturing growth rate of 8.8% during the 1980s.",
      "• The agricultural sector also demonstrated solid growth, with an annual agricultural growth rate of 5.4% throughout the decade.",
      "• The 1980s were characterized by transformative economic policies, improved fiscal performance, and significant progress in poverty reduction and employment generation.",
      "• Efforts to align financial practices with Islamic principles were notable, particularly through the introduction of interest-free banking and profit and loss sharing mechanisms.",
      "• The decade witnessed substantial economic growth in both manufacturing and agriculture, underscoring a recovering and dynamic economic period for Pakistan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:29:53.982543",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2032,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "1990s",
    "text": "The 1990s posed a formidable economic landscape for Pakistan, marked by a\nseries of challenges and developments. Declining worker remittances and\nescalating external deficits set the tone for economic strains.\nSimultaneously, the decade witnessed the second-worst inflation in Pakistan's\nhistory, driven by diminishing GDP growth rates. Unemployment surged, reaching\n5.9% in 1991 and escalating further to 7.2% in 2000.\n\nPakistan's external debt tripled, soaring to US$30 billion by 1995. The\nexternal debt/GDP ratio rose from 42% to 50%, accompanied by increases in the\nexternal debt/exports ratio (from 209% to 258%) and the debt service ratio\n(from 18% to 27%). A deteriorating external debt profile led to a rise in\ndomestic debt, reaching Rs. 909 billion, and a domestic debt/GDP ratio of 42%.\n\nThe late 1990s witnessed a severe debt crisis, with the public debt/GDP ratio\nskyrocketing from 57.5% in 1975–77 to 102% in 1998–99. The public\ndebt/revenues ratio surged to 624%, and the interest payments/revenues ratio\nreached 42.6%, rendering Pakistan's public debt unsustainable. Concerns over\nexternal debt default emerged in 1996 and 1998, triggered by Western economic\nsanctions in response to Pakistan's nuclear tests in May 1998, causing massive\ncapital flight.\n\nDespite these challenges, Pakistan managed to sustain an agricultural growth\nrate of 4.4% per annum and a large-scale manufacturing growth rate of 4.8% per\nannum throughout the 1990s. However, the era witnessed a significant increase\nin poverty incidence, reaching 30.6% in 1998–99. The decade encapsulated a\ncomplex economic narrative, as Pakistan navigated external debt burdens,\nfiscal imbalances, inflation, and rising unemployment. Amid these\ndifficulties, there were positive aspects, including growth in key sectors\nlike agriculture and manufacturing. Nonetheless, the 1990s also brought forth\na looming threat of debt default, magnified by economic sanctions in response\nto nuclear tests.",
    "openai_summarised_points": [
      "• The 1990s presented a challenging economic environment for Pakistan, characterized by declining worker remittances and increasing external deficits, which contributed to overall economic strain.",
      "• During this decade, Pakistan experienced the second-worst inflation in its history, primarily driven by diminishing GDP growth rates.",
      "• Unemployment rates rose significantly, from 5.9% in 1991 to 7.2% by the year 2000, indicating worsening labor market conditions.",
      "• Pakistan’s external debt tripled during the early to mid-1990s, reaching US$30 billion by 1995, reflecting escalating financial obligations to foreign creditors.",
      "• The external debt-to-GDP ratio increased from 42% to 50%, while the external debt-to-exports ratio rose from 209% to 258%, signaling growing vulnerability in external debt sustainability.",
      "• The debt service ratio, which measures the proportion of export earnings used to service debt, increased from 18% to 27%, indicating heavier debt repayment burdens.",
      "• As external debt pressures mounted, domestic debt also rose sharply, reaching Rs. 909 billion, with the domestic debt-to-GDP ratio climbing to 42%.",
      "• By the late 1990s, Pakistan faced a severe debt crisis, with the public debt-to-GDP ratio escalating dramatically from 57.5% in 1975–77 to 102% in 1998–99.",
      "• The public debt-to-revenues ratio surged to 624%, and the interest payments-to-revenues ratio reached 42.6%, rendering the public debt situation unsustainable.",
      "• Concerns about potential external debt default emerged notably in 1996 and 1998, exacerbated by Western economic sanctions imposed after Pakistan’s nuclear tests in May 1998.",
      "• These sanctions triggered massive capital flight, further destabilizing Pakistan’s financial position during the late 1990s.",
      "• Despite these macroeconomic challenges, Pakistan sustained an average agricultural growth rate of 4.4% per annum throughout the 1990s.",
      "• The large-scale manufacturing sector also maintained a steady growth rate of 4.8% per annum during the same period.",
      "• Poverty incidence increased significantly, reaching 30.6% in 1998–99, reflecting worsening socio-economic conditions for a substantial portion of the population.",
      "• Overall, the 1990s in Pakistan were marked by a complex economic narrative involving rising external and domestic debt burdens, fiscal imbalances, high inflation, and increasing unemployment.",
      "• Positive developments included sustained growth in key sectors such as agriculture and manufacturing, which provided some economic resilience amid broader difficulties.",
      "• The decade concluded with a looming threat of debt default, intensified by international economic sanctions following Pakistan’s nuclear tests, highlighting vulnerabilities in the country’s economic and financial systems."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:03.511674",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1968,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.7",
    "section_name": "2000s",
    "text": "The 2000s witnessed a period of substantial economic challenges and\ntransformations for Pakistan. The impact of high public debt gained\nprominence, identified by the official Debt Reduction and Management Committee\nin 2001, contributing to a decline in the growth rate to less than 4% per\nannum. Despite an initial upturn in the growth rate, the decade unfolded with\npersistent macroeconomic crises. Although achieving a noteworthy growth rate\nof 8.6% in 2004–05, subsequent years were marred by a series of setbacks,\nincluding a growth slowdown, low growth, high inflation, an energy crisis, and\nworsening fiscal and balance of payments positions.\n\nThe economic landscape reflected the complexities faced by the population,\nillustrated by a rise in poverty incidence to 34.5% in 2000–01. However, a\nsubsequent decrease to 22.3% in 2005–06 offered a nuanced perspective on the\ndecade's economic trajectory. The unemployment rate saw fluctuations, rising\nto 7.8% in 2002 but later declining to 5% by 2008.\n\nEfforts to enhance education and literacy rates were evident as adult literacy\nstood at 55% in 2007–08. Nevertheless, challenges persisted, and economic\ncrises hit Pakistan in 2008, primarily influenced by the 2008 financial\ncrisis. Despite these adversities, economic growth in 2009–2010 reached a\nrespectable 4.1%, with positive contributions from various sectors, including\na 2% growth in agriculture, 4.9% growth in industrial output, 4.4% growth in\nlarge-scale manufacturing, and a 4.6% expansion in the services sector.\n\nBy March 2010, public debt had accumulated to Rs. 8,160 billion, with a total\npublic debt/GDP ratio of 56% and a foreign-currency denominated debt/GDP ratio\nof 25%. Amid these economic dynamics, Pakistan underwent a structural\ntransition. The GDP share of agriculture declined from 53% in 1947 to 21.2% in\n2010, while the GDP share of industry rose from 9.6% in 1949–50 to 25.4% in\n2010. Additionally, the GDP share of the services sector increased from 37.2%\nin 1950 to 53.4% in 2010. The 2000s encapsulated a multifaceted economic\nnarrative for Pakistan, marked by challenges, crises, and significant\nstructural shifts, reflecting the nation's resilience and adaptability.",
    "openai_summarised_points": [
      "• The 2000s in Pakistan were characterized by significant economic challenges and transformations, with high public debt becoming a prominent issue as identified by the official Debt Reduction and Management Committee in 2001, which contributed to a decline in the economic growth rate to less than 4% per annum.",
      "• Despite an initial increase in the growth rate, the decade experienced persistent macroeconomic crises, including a peak growth rate of 8.6% in 2004–05, followed by setbacks such as growth slowdowns, low growth periods, high inflation, an energy crisis, and deteriorating fiscal and balance of payments conditions.",
      "• Poverty incidence in Pakistan rose to 34.5% in 2000–01, reflecting economic difficulties faced by the population, but subsequently decreased to 22.3% by 2005–06, indicating some improvement during the decade.",
      "• The unemployment rate fluctuated during the 2000s, increasing to 7.8% in 2002 before declining to 5% by 2008, showing variability in the labor market conditions.",
      "• Efforts to improve education were evident with adult literacy reaching 55% in 2007–08, although economic challenges persisted throughout the decade.",
      "• Pakistan was significantly affected by the 2008 global financial crisis, which contributed to economic difficulties in that year.",
      "• Despite these adversities, Pakistan’s economy grew by 4.1% in 2009–2010, supported by sectoral growth including 2% in agriculture, 4.9% in industrial output, 4.4% in large-scale manufacturing, and 4.6% in the services sector.",
      "• By March 2010, Pakistan’s public debt had reached Rs. 8,160 billion, with a total public debt to GDP ratio of 56%, and a foreign-currency denominated debt to GDP ratio of 25%, highlighting the scale of fiscal challenges.",
      "• The decade witnessed a structural transition in Pakistan’s economy: the GDP share of agriculture declined from 53% in 1947 to 21.2% in 2010, the industry sector’s GDP share increased from 9.6% in 1949–50 to 25.4% in 2010, and the services sector’s share rose from 37.2% in 1950 to 53.4% in 2010.",
      "• Overall, the 2000s encapsulated a complex economic narrative for Pakistan, marked by significant challenges, recurrent crises, and notable structural shifts, demonstrating the country’s resilience and adaptability in the face of economic adversity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:14.467985",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2207,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.8",
    "section_name": "Gross domestic product (GDP)",
    "text": "The table below displays key economic indicators from 1980 to 2024. Inflation\nrates below 5% are highlighted in green.\n\nYear  | GDP (Billion US$ PPP) | GDP per capita (US$ PPP) | GDP (Billion US$ nominal) | GDP per capita (US$ nominal) | GDP growth (Real) | Inflation rate (Percent) | Unemployment (Percent) | Government debt (% of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 74.9  | 950.0  | 38.6  | 418.9  | 6.9%  | 11.9%  | n/a  | n/a\n1981  | 87.1  | 1,072.8  | 45.7  | 481.3  | 6.2%  | 11.9%  | n/a  | n/a\n1982  | 99.5  | 1,190.0  | 49.9  | 511.0  | 7.6%  | 5.9%  | n/a  | n/a\n1983  | 110.4  | 1,283.6  | 46.6  | 463.7  | 6.8%  | 6.4%  | 3.9%  | n/a\n1984  | 118.9  | 1,345.3  | 50.6  | 489.8  | 4.0%  | 6.1%  | 3.8%  | n/a\n1985  | 133.3  | 1,468.4  | 50.6  | 476.7  | 8.7%  | 5.6%  | 3.7%  | n/a\n1986  | 144.7  | 1,551.3  | 51.8  | 475.3  | 6.4%  | 3.5%  | 3.3%  | n/a\n1987  | 156.9  | 1,638.5  | 54.2  | 483.9  | 5.8%  | 4.7%  | 3.1%  | n/a\n1988  | 172.8  | 1,759.4  | 62.4  | 543.1  | 6.4%  | 8.8%  | 3.1%  | n/a\n1989  | 188.3  | 1,868.3  | 65.0  | 552.0  | 4.8%  | 7.9%  | 3.1%  | n/a\n1990  | 204.3  | 1,970.1  | 65.3  | 538.4  | 4.6%  | 9.1%  | 3.1%  | n/a\n1991  | 222.0  | 2,094.8  | 74.2  | 598.4  | 5.4%  | 12.6%  | 5.9%  | n/a\n1992  | 244.3  | 2,211.1  | 79.3  | 614.2  | 7.6%  | 4.8%  | 5.9%  | n/a\n1993  | 255.3  | 2,252.4  | 83.4  | 633.6  | 2.1%  | 9.8%  | 4.7%  | n/a\n1994  | 272.1  | 2,341.1  | 84.6  | 622.8  | 4.4%  | 11.3%  | 4.8%  | 64.8%\n1995  | 291.9  | 2,449.6  | 98.9  | 709.9  | 5.1%  | 13.0%  | 5.4%  | 58.0%\n1996  | 316.9  | 2,594.8  | 103.3  | 723.5  | 6.6%  | 10.8%  | 5.4%  | 58.2%\n1997  | 327.8  | 2,620.8  | 101.8  | 696.4  | 1.7%  | 12.8%  | 6.1%  | 58.5%\n1998  | 343.1  | 2,678.9  | 101.4  | 677.0  | 3.5%  | 6.8%  | 5.9%  | 59.5%\n1999  | 362.5  | 2,765.6  | 96.0  | 626.5  | 4.2%  | 5.7%  | 5.9%  | 67.2%\n2000  | 385.2  | 2,855.1  | 99.4  | 630.3  | 3.9%  | 3.6%  | 7.8%  | 68.4%\n2001  | 408.2  | 2,916.7  | 96.8  | 602.0  | 3.7%  | 4.4%  | 7.8%  | 72.2%\n2002  | 425.4  | 2,995.0  | 98.2  | 593.9  | 2.4%  | 3.5%  | 8.3%  | 67.6%\n2003  | 456.2  | 3,119.8  | 112.5  | 666.1  | 5.6%  | 3.1%  | 8.3%  | 62.7%\n2004  | 504.5  | 3,376.5  | 132.2  | 767.8  | 7.7%  | 4.6%  | 7.7%  | 56.3%\n2005  | 561.9  | 3,722.9  | 145.2  | 842.0  | 7.5%  | 9.3%  | 7.7%  | 52.3%\n2006  | 612.1  | 3,986.8  | 161.9  | 961.4  | 5.6%  | 7.9%  | 6.2%  | 48.4%\n2007  | 660.8  | 4,244.6  | 184.1  | 1,048.4  | 5.5%  | 7.8%  | 5.2%  | 47.1%\n2008  | 703.5  | 4,362.9  | 202.2  | 1,124.0  | 5.0%  | 12.0%  | 5.2%  | 51.9%\n2009  | 715.3  | 4,240.5  | 187.1  | 1,186.5  | 0.4%  | 19.6%  | 5.5%  | 52.8%\n2010  | 740.4  | 4,283.3  | 196.7  | 1,122.7  | 2.6%  | 10.1%  | 6.0%  | 54.5%\n2011  | 779.9  | 4,403.0  | 230.6  | 1,325.8  | 3.6%  | 13.7%  | 6.0%  | 52.8%\n2012  | 819.8  | 4,516.4  | 250.1  | 1,364.8  | 3.8%  | 11.0%  | 6.0%  | 56.7%\n2013  | 865.9  | 4,655.3  | 258.7  | 1,378.6  | 3.7%  | 7.4%  | 6.0%  | 57.9%\n2014  | 912.3  | 4,786.2  | 271.4  | 1,428.4  | 4.1%  |  8.6%  | 6.0%  | 57.1%\n2015  | 955.9  | 4,893.3  | 299.9  | 1,550.5  | 4.1%  | 4.5%  | 5.9%  | 57.0%\n2016  | 1,004.3  | 5,016.6  | 313.6  | 1,566.6  | 4.6%  | 2.9%  | 5.9%  | 60.8%\n2017  | 1,069.4  | 5,212.2  | 339.2  | 1,653.4  | 4.6%  | 4.1%  | 5.8%  | 60.9%\n2018  | 1,130  | 5,387.2  | 356.2  | 1,698.0  | 6.1%  | 3.9%  | 5.8%  | 64.8%\n2019  | 1,162.7  | 5,434.3  | 321.1  | 1,500.7  | 3.1%  | 6.7%  | 6.9%  | 77.5%\n2020  | 1,186.3  | 5,435.7  | 300.4  | 1,376.5  | -0.9%  | 10.7%  | 6.6%  | 79.6%\n2021  | 1,285.3  | 5,774.5  | 348.5  | 1,565.6  | 5.8%  | 8.9%  | 6.3%  | 73.5%\n2022  | 1,462.1  | 6,440.9  | 374.8  | 1651.3  | 6.2%  | 12.2%  | 6.2%  | 76.2%\n2023  | 1,511.6  | 6,530.9  | 337.5  | 1,458.0  | -0.2%  | 29.2%  | 8.5%  | 77.3%\n2024  | 1,584.5  | 6,715.3  | 374.6  | 1,587.6  | 2.4%  | 23.4%  | 8.0%  | 69.2%",
    "openai_summarised_points": [
      "• From 1980 to 2024, Pakistan's GDP (Billion US$ PPP) increased from 74.9 to 1,584.5, showing substantial economic growth over the period.",
      "• GDP per capita (US$ PPP) rose from 950.0 in 1980 to 6,715.3 in 2024, indicating significant improvement in average income levels adjusted for purchasing power parity.",
      "• Nominal GDP (Billion US$) grew from 38.6 in 1980 to 374.6 in 2024, reflecting growth in the economy measured at current market prices.",
      "• Nominal GDP per capita (US$) increased from 418.9 in 1980 to 1,587.6 in 2024, showing growth in average income without adjusting for inflation or purchasing power.",
      "• Real GDP growth rates fluctuated over the years, with notable peaks such as 8.7% in 1985 and 7.7% in 2004, and downturns including -0.9% in 2020 and -0.2% in 2023, reflecting economic contractions in those years.",
      "• Inflation rates varied widely, with rates below 5% highlighted in green; notable low inflation years include 1986 (3.5%), 2000 (3.6%), 2002 (3.5%), and 2016 (2.9%).",
      "• Inflation peaked at 29.2% in 2023, the highest in the dataset, followed by 23.4% in 2024, indicating significant inflationary pressures in recent years.",
      "• Unemployment rates ranged from a low of 3.1% in the late 1980s to a high of 8.5% in 2023, showing varying labor market conditions over time.",
      "• Government debt as a percentage of GDP was first recorded in 1994 at 64.8%, fluctuated over the years, reaching a peak of 79.6% in 2020, and declined to 69.2% by 2024.",
      "• The data shows periods of economic stability and growth, such as the mid-2000s with GDP growth rates above 5% and inflation generally below 10%, contrasted with periods of economic challenges, including high inflation and negative growth in 2020 and 2023.",
      "• The unemployment rate remained relatively stable around 6% for much of the 2000s and 2010s but increased notably in the early 2020s.",
      "• The nominal GDP per capita consistently lagged behind the PPP-adjusted GDP per capita, reflecting the impact of exchange rates and cost of living differences.",
      "• The dataset highlights the economic volatility Pakistan experienced, with inflation and government debt levels showing significant variation, especially in the 2010s and early 2020s.",
      "• The economic indicators collectively illustrate Pakistan's long-term economic development, challenges with inflation control, debt management, and labor market fluctuations from 1980 through 2024."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:26.754739",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3806,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.9",
    "section_name": "Stock market",
    "text": "Statue of a bull outside the Islamabad Stock Exchange\n\nIn the first four years of the twenty-first century, Pakistan's KSE 100 Index\nwas declared the best-performing stock market index in the world by the\ninternational magazine \"Business Week\".[_citation needed_] The stock market\ncapitalization of listed companies in Pakistan was valued at $5,937 million in\n2005 by the World Bank. On 11 January 2016, with the aim of reducing market\nfragmentation and creating a strong case for attracting strategic partnerships\nnecessary for providing technological expertise, all three stock exchanges,\nincluding Karachi Stock Exchange, Lahore Stock Exchange, and Islamabad Stock\nExchange, were inducted into a unified Pakistan Stock Exchange.\n\nIn May 2017, the American provider of stock market indexes and analysis tools,\nMSCI, confirmed that the Pakistan Stock Exchange (PSX) had been reclassified\nfrom Frontier Markets to Emerging Markets in its semi-annual index review. The\nPakistan Stock Exchange also successfully navigated through the initial\nCOVID-19 induced economic downturn and earned the title of being the 'best\nAsian stock market and fourth best-performing market across the world in\n2020.' The PSE-100 index continued to climb throughout the year. Nearly 40\npercent growth in the PSE-100 Index in FY 2021 was driven by the government's\nlarge stimulus package, the central bank's stable policy rate, an uptick in\nlarge scale manufacturing, improvement in external accounts, and reforms\nintroduced by the Security and Exchange Commission of Pakistan (SECP) and PSX\nin the wake of the COVID-19.\n\nPSX 100 index growth rate\n\nList  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n**PSX 100 index growth %** |  -10.8  |  -41.7  |  35.7  |  28.5  |  10.4  |  52.2  |  41.2  |  16.0  |  9.8  |  23.2  | -10.0  | -19.1  |  1.5  |  37.6  |  -12.3  |  -0.2  |  61.6\n\nThe sales of all non-financial companies surged to Rs 16,815 billion in the\nfiscal year 2023, marking a substantial increase of Rs 1,864 billion compared\nto the preceding year. However, the net profit margin of all companies\ndeclined to 5.98% in FY23 from 6.34% in FY22. Return on assets (ROA) and\nreturn on equity (ROE) of all companies also dropped to 6.05 percent and 17.76\npercent respectively in FY23. The key statistics for the last six years of all\npublic and private non-financial companies listed at the Pakistan Stock\nExchange are provided in the following table:\n\nFinancial analysis of companies (non-financial) (billion rupees)  List  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023\n---|---|---|---|---|---|---\nTotal assets  |  8,811  |  10,097  |  10,755  |  12,201  |  15,685  |  17,549\nTotal liabilities  |  5,574  |  6,610  |  7,029  |  7,869  |  10,568  |  11,346\nTotal sales  |  7,662  |  8,811  |  7,999  |  9,437  |  14,568  |  16,815\nProfit before tax  |  608  |  612  |  480  |  1,011  |  1,439  |  1,624\nProfit after tax  |  427  |  413  |  320  |  749  |  924  |  1,005\n**%** |  |\nNet profit margin  |  5.57  |  4.68  |  4.00  |  7.93  |  6.34  |  5.98\nReturn on assets  |  5.19  |  4.36  |  3.07  |  6.52  |  6.63  |  6.05\nReturn on equity  |  13.65  |  12.27  |  8.87  |  18.59  |  19.56  |  17.76\nEarnings per share  |  4.43  |  4.17  |  3.15  |  7.07  |  8.31  | 8.32",
    "openai_summarised_points": [
      "• In the early 2000s, Pakistan's KSE 100 Index was recognized as the best-performing stock market index globally by the international magazine \"Business Week\" (citation needed).",
      "• According to the World Bank, the stock market capitalization of listed companies in Pakistan was valued at $5,937 million in 2005.",
      "• On 11 January 2016, Pakistan unified its three stock exchanges—Karachi Stock Exchange, Lahore Stock Exchange, and Islamabad Stock Exchange—into a single entity called the Pakistan Stock Exchange (PSX) to reduce market fragmentation and attract strategic partnerships for technological expertise.",
      "• In May 2017, MSCI, an American provider of stock market indexes and analysis tools, reclassified the Pakistan Stock Exchange from Frontier Markets to Emerging Markets during its semi-annual index review.",
      "• The Pakistan Stock Exchange was recognized as the best-performing Asian stock market and the fourth best-performing market worldwide in 2020, successfully navigating the initial economic downturn caused by COVID-19.",
      "• The PSE-100 index experienced nearly 40% growth in the fiscal year 2021, driven by factors including the government's large stimulus package, the central bank's stable policy rate, increased large-scale manufacturing, improvements in external accounts, and reforms by the Security and Exchange Commission of Pakistan (SECP) and PSX in response to COVID-19.",
      "• The PSX 100 index growth rates from FY 2008 to FY 2024 are as follows: FY08: -10.8%, FY09: -41.7%, FY10: 35.7%, FY11: 28.5%, FY12: 10.4%, FY13: 52.2%, FY14: 41.2%, FY15: 16.0%, FY16: 9.8%, FY17: 23.2%, FY18: -10.0%, FY19: -19.1%, FY20: 1.5%, FY21: 37.6%, FY22: -12.3%, FY23: -0.2%, FY24: 61.6%.",
      "• In fiscal year 2023, sales of all non-financial companies listed on the Pakistan Stock Exchange surged to Rs 16,815 billion, an increase of Rs 1,864 billion compared to the previous year.",
      "• Despite increased sales in FY23, the net profit margin of all companies declined to 5.98% from 6.34% in FY22.",
      "• Return on assets (ROA) for all companies dropped to 6.05% in FY23 from previous years, and return on equity (ROE) decreased to 17.76% in FY23.",
      "• Key financial statistics for all public and private non-financial companies listed on the Pakistan Stock Exchange over the last six years (2018–2023) are as follows (in billion rupees unless otherwise stated):",
      "• Percentage financial indicators for the same period include:"
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:48.571283",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3464,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.10",
    "section_name": "Middle class",
    "text": "The Dawood Centre in Karachi, M.T. Khan Road\n\nAs of 2017[update], according to the _Wall Street Journal_ , citing estimates\nlargely based on income and the purchase of consumption goods, had suggested\nthat as many as 42% of Pakistan's population may now belong to the upper and\nmiddle classes. If these numbers are correct, or even indicative in any broad\nsense, then 87 million Pakistanis belong to the middle and upper classes, a\npopulation size which is larger than that of Germany. Official figures also\nshow that the proportion of households that own a motorcycle and washing\nmachines has grown impressively over the past 15 years. Furthermore, the IBA-\nSBP Consumer Confidence Index recorded its highest-ever level of 174.9 points\nin January 2017, showing an increase of 17 points from July 2016.\n\nSeparately, consumer financing recorded at Rs. 179 billion during FY 2022.\nAuto finance continued to be the dominant segment, followed by house building,\nwhich showed remarkable growth after the _Mera Pakistan Mera Ghar_ scheme\ninitiated by the State Bank of Pakistan in December 2020.",
    "openai_summarised_points": [
      "• As of 2017, the _Wall Street Journal_, citing estimates based largely on income and consumption goods purchases, suggested that up to 42% of Pakistan's population may belong to the upper and middle classes.",
      "• If the 42% estimate is accurate or broadly indicative, this implies that approximately 87 million Pakistanis are part of the middle and upper classes, a demographic larger than the entire population of Germany.",
      "• Official data over the past 15 years indicate a significant increase in household ownership of motorcycles and washing machines, reflecting rising consumer affluence.",
      "• The IBA-SBP Consumer Confidence Index reached its highest recorded level of 174.9 points in January 2017, marking an increase of 17 points since July 2016, signaling growing consumer optimism.",
      "• In the fiscal year 2022, consumer financing in Pakistan totaled Rs. 179 billion, demonstrating robust growth in credit availability.",
      "• Within consumer financing, the auto finance sector remained the dominant segment, indicating sustained demand for vehicle purchases.",
      "• The house building finance segment experienced remarkable growth following the launch of the _Mera Pakistan Mera Ghar_ housing scheme by the State Bank of Pakistan in December 2020, aimed at promoting home ownership."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:53.537517",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1089,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.11",
    "section_name": "Poverty alleviation expenditures",
    "text": "The Pakistan government spent over 1 trillion rupees (about $16.7 billion) on\npoverty alleviation programs during the past four years, reducing poverty from\n35% in 2000–01 to 29.3% in 2013 and further to 17% in 2015. Rural poverty\nremains a pressing issue, as development in those areas has been significantly\nslower than in major urban areas.",
    "openai_summarised_points": [
      "• The Pakistan government allocated over 1 trillion Pakistani rupees, equivalent to approximately $16.7 billion, towards poverty alleviation programs over a four-year period.",
      "• These poverty alleviation efforts contributed to a reduction in the national poverty rate from 35% in the fiscal year 2000–01 to 29.3% by 2013.",
      "• Further progress was observed with the poverty rate declining to 17% in 2015, indicating significant improvements in poverty reduction within the country.",
      "• Despite these gains, rural poverty remains a critical challenge in Pakistan, as economic and social development in rural areas has progressed at a considerably slower pace compared to major urban centers."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:30:58.370440",
      "openai_model": "gpt-4.1-mini",
      "content_length": 343,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.12",
    "section_name": "Employment",
    "text": "The high population growth in the past few decades has led to a significant\nnumber of young people entering the labor market. Although Pakistan is among\nthe six most populous Asian nations, excessive red tape in the past made\nfiring from jobs, and consequently hiring, difficult. Significant progress in\ntaxation and business reforms has ensured that many firms are no longer\ncompelled to operate in the underground economy.",
    "openai_summarised_points": [
      "• Pakistan has experienced high population growth over the past few decades, resulting in a substantial influx of young people entering the labor market.",
      "• Despite being one of the six most populous countries in Asia, Pakistan historically faced challenges in labor market flexibility due to excessive bureaucratic red tape.",
      "• This bureaucratic complexity made both firing and hiring processes difficult for employers, restricting labor market dynamism.",
      "• Recent significant progress in taxation and business reforms has improved the regulatory environment for firms.",
      "• These reforms have reduced the compulsion for many firms to operate within the underground economy, promoting greater formalization of business activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:31:02.398115",
      "openai_model": "gpt-4.1-mini",
      "content_length": 424,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.13",
    "section_name": "Government revenues and expenditures",
    "text": "Clifton in Karachi\n\nAlthough the country is a Federation with constitutional division of taxation\npowers between the Federal Government and the four provinces, the revenue\ndepartment of the Federal Government, the Federal Board of Revenue, collects\nmore than 80% of the entire national tax collection. The government's revenue\nstreams primarily stem from two sources: taxation and non-tax revenue.\nTaxation, which includes income tax, sales tax, and customs duties,\nconstitutes a substantial portion of revenues, bolstering both federal and\nprovincial government finances. Non-tax revenue sources, such as mark-up from\nstate enterprises, surplus profits from the State Bank of Pakistan, and\nroyalties on oil and gas, further contribute significantly to the fiscal\nframework.\n\nConversely, government expenditures are strategically allocated across\nmultiple sectors, including defense, social services, infrastructure\ndevelopment, and debt servicing. Current expenditures, covering operational\ncosts, interest payments, pensions, and other obligations, are carefully\nbalanced against development expenditures aimed at fostering long-term growth\nand progress. The challenge of achieving equilibrium between revenue\ngeneration and expenditure allocation leads to budgetary deficits that can\nnecessitate borrowing to bridge the gap.\n\nThe data has been sourced from the Ministry of Finance.\n\nConsolidated federal and provincial fiscal operations (amounts in billion PKR)  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n**Total revenue** |  1,499  |  1,851  |  2,078  |  2,253  |  2,567  |  2,982  |  3,637  |  3,931  |  4,447  |  4,937  |  5,228  |  4,901  |  6,272  |  6,903  |  8,035  |  9,634  | 13,269\nTax revenue  |  1,065  |  1,317  |  1,473  |  1,699  |  2,053  |  2,199  |  2,565  |  3,018  |  3,660  |  3,969  |  4,467  |  4,473  |  4,748  |  5,272  |  6,755  |  7,819  | 10,085\nFBR taxes  |  1,008  |  1,161  |  1,327  |  1,558  |  1,883  |  1,946  |  2,255  |  2,590  |  3,113  |  3,368  |  3,842  |  3,830  |  3,998  |  4,764  |  6,143  |  7,169  |  9,311\n**Total expenditure** |  2,277  |  2,531  |  3,007  |  3,447  |  3,936  |  4,816  |  5,026  |  5,388  |  5,796  |  6,801  |  7,488  |  8,346  |  9,649  |  10,307  |  13,295  |  16,155  | 20,476\n**Fiscal deficit** | 777  | 680  | 929  | 1,194  | 1,370  | 1,834  | 1,389  | 1,457  | 1,349  | 1,864  | 2,260  | 3,445  | 3,376  | 3,403  | 5,260  | 6,521  |  7,207\n**As % of GDP** |  |  |\nTotal Revenue  | 14.1  | 14.0  | 14.0  | 12.3  | 12.8  | 13.3  | 14.5  | 14.3  | 13.6  | 13.9  | 13.3  | 11.2  | 13.2  | 12.4  | 12.0  | 11.4  |  12.5\nTax revenue  | 9.9  | 9.1  | 9.9  | 9.3  | 10.2  | 9.8  | 10.2  | 11.0  | 10.4  | 10.4  | 10.8  | 9.7  | 9.3  | 9.4  | 10.1  | 9.2  | 9.5\nTotal expenditure  | 21.4  | 19.2  | 20.2  | 18.9  | 21.4  | 21.5  | 20.0  | 19.6  | 17.7  | 19.1  | 19.1  | 19.1  | 20.3  | 18.5  | 19.9  | 19.1  |  19.3\nFiscal deficit | 7.3  | 5.2  | 6.2  | 6.5  | 8.8  | 8.2  | 5.5  | 5.3  | 4.1  | 5.2  | 5.8  | 7.9  | 7.1  | 6.1  | 7.9  | 7.7  |  6.8",
    "openai_summarised_points": [
      "• Pakistan operates as a Federation with a constitutional division of taxation powers between the Federal Government and the four provinces; however, the Federal Board of Revenue (FBR), the revenue department of the Federal Government, collects more than 80% of the entire national tax revenue.",
      "• The government’s revenue streams primarily originate from two sources: taxation and non-tax revenue.",
      "• Taxation revenue includes income tax, sales tax, and customs duties, which significantly support both federal and provincial government finances.",
      "• Non-tax revenue sources comprise mark-up from state enterprises, surplus profits from the State Bank of Pakistan, and royalties on oil and gas, all of which contribute substantially to the fiscal framework.",
      "• Government expenditures are allocated strategically across multiple sectors, including defense, social services, infrastructure development, and debt servicing.",
      "• Current expenditures encompass operational costs, interest payments, pensions, and other obligations, while development expenditures focus on fostering long-term economic growth and progress.",
      "• Balancing revenue generation with expenditure allocation remains a challenge, often resulting in budgetary deficits that require borrowing to cover the shortfall.",
      "• The fiscal data presented is sourced from the Ministry of Finance of Pakistan.",
      "• Total consolidated federal and provincial revenue increased from 1,499 billion PKR in FY 2008 to 13,269 billion PKR in FY 2024, showing significant growth over the period.",
      "• Tax revenue rose from 1,065 billion PKR in FY 2008 to 10,085 billion PKR in FY 2024, reflecting the increasing importance of tax collection in government finances.",
      "• FBR tax collections grew from 1,008 billion PKR in FY 2008 to 9,311 billion PKR in FY 2024, maintaining its role as the primary tax collector.",
      "• Total government expenditure escalated from 2,277 billion PKR in FY 2008 to 20,476 billion PKR in FY 2024, indicating expanding government spending.",
      "• Fiscal deficits fluctuated, starting at 777 billion PKR in FY 2008, peaking at 6,521 billion PKR in FY 2023, and slightly decreasing to 7,207 billion PKR in FY 2024.",
      "• As a percentage of GDP, total revenue ranged from a low of 11.2% in FY 2019 to a high of 14.5% in FY 2014, with 12.5% recorded in FY 2024.",
      "• Tax revenue as a percentage of GDP varied between 9.1% in FY 2009 and 11.0% in FY 2015, standing at 9.5% in FY 2024.",
      "• Total government expenditure as a percentage of GDP ranged from 17.7% in FY 2016 to 21.5% in FY 2013, recorded at 19.3% in FY 2024.",
      "• Fiscal deficit as a percentage of GDP showed variation from 4.1% in FY 2016 to 8.8% in FY 2012, with a level of 6.8% in FY 2024.",
      "• The data reflects ongoing fiscal challenges in balancing revenue and expenditure, with persistent deficits necessitating borrowing and fiscal management efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:31:12.941593",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3239,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.14",
    "section_name": "Rupee",
    "text": "The basic unit of currency is the rupee, ISO code PKR, and abbreviated Rs,\nwhich is divided into 100 paisas. Currently, the 5,000 rupee note is the\nlargest denomination in circulation. From 13 August 2005, the SBP started\nintroducing its fifth generation design of banknotes with additional security\nfeatures, with the Rs. 20 note being the first issuance. New designs of Rs. 5\n(July 2008, later replaced by a coin), 10 (May 2006), Rs. 20 (March 2008, new\ncolor scheme), Rs. 50 (July 2008), Rs. 100 (November 2006), Rs. 500 (January\n2010), Rs. 1000 (February 2007), and Rs. 5000 (May 2006) were gradually\nintroduced.\n\nThe Pakistani rupee was pegged to the pound sterling until 1982, when the\ngovernment of General Zia-ul-Haq, changed it to a managed float regime. As a\nresult, the rupee devalued by 38.5% between 1982/83, and many of the\nindustries built by his predecessor suffered a huge surge in import costs.\nAfter years of appreciation under Zulfikar Ali Bhutto and despite huge\nincreases in foreign aid, the rupee depreciated."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.15",
    "section_name": "Foreign exchange rate",
    "text": "The Pakistani rupee depreciated against the US dollar until around the start\nof the 21st century, when Pakistan's large current-account surplus pushed the\nvalue of the rupee up versus the dollar. Pakistan's central bank then\nstabilized by lowering interest rates and buying dollars, in order to preserve\nthe country's export competitiveness.\n\nUS$ to PKR average exchange rates  2008  | 2009  | 2010  | 2011  | 2012  | 2013  | 2014  | 2015  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n62.55  | 78.50  | 83.80  | 85.50  | 89.23  | 96.73  | 102.86  | 101.29  | 104.23  | 104.70  | 109.84  | 136.09  | 158.02  | 160.02  | 177.45  | 248.04  | 282.91"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "0.16",
    "section_name": "Foreign exchange reserves",
    "text": "Pakistan maintains foreign reserves with the State Bank of Pakistan. The\ncurrency of the reserves was solely the US dollar, incurring speculated losses\nafter the dollar prices fell during 2005, forcing the then Governor SBP Ishrat\nHussain to step down. In the same year, the SBP issued an official statement\nproclaiming diversification of reserves in currencies including Euro and Yen,\nwithholding the ratio of diversification.\n\nKarachi, the economic capital of Pakistan\n\nFollowing the international credit crisis and spikes in crude oil prices,\nPakistan's economy could not withstand the pressure, and on 11 October 2008,\nthe State Bank of Pakistan reported that the country's foreign exchange\nreserves had gone down by $571.9 million to $7,749.7 million. The foreign\nexchange reserves had declined by more than $10 billion to a level of $6.59\nbillion. In June 2013, Pakistan was on the brink of default on its financial\ncommitments. The country's forex reserves were at a historic low, covering\nonly two weeks' worth of imports. In January 2020, Pakistan's foreign exchange\nreserves stood at US$11.503 billion.\n\nAmounts in billion US dollars  List  | Jun 2008  | Jun 2009  | Jun 2010  | Jun 2011  | Jun 2012  | Jun 2013  | Jun 2014  | Jun 2015  | Jun 2016  | Jun 2017  | Jun 2018  | Jun 2019  | Jun 2020  | Jun 2021  | Jun 2022  | Jun 2023  | Jun 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n**Total reserves** |  11.4  |  12.4  |  16.8  |  18.2  |  15.3  |  11.0  |  14.1  |  18.7  |  23.1  |  21.4  |  16.4  |  14.5  |  18.9  |  24.4  |  15.5  |  9.2  |  14.0\nSBP reserves  | 8.6  | 9.1  | 13.0  | 14.8  | 10.8  | 6.0  | 9.1  | 13.5  | 18.1  | 16.1  | 9.8  | 7.3  | 12.1  | 17.3  | 9.9  | 4.5  | 9.4\nBanks reserves  | 2.8  | 3.3  | 3.8  | 3.5  | 4.5  | 5.0  | 5.0  | 5.2  | 5.0  | 5.3  | 6.6  | 7.2  | 6.8  | 7.1  | 5.6  | 4.7  | 4.6"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Structure of economy",
    "text": "Agriculture accounted for about 53% of the GDP in 1947. While per-capita\nagricultural output has grown since then, it has been outpaced by the growth\nof the non-agricultural sectors, and the share of agriculture has dropped to\nroughly one-fifth of Pakistan's economy. In recent years, the country has seen\nrapid growth in industries, such as apparel, textiles, and cement, and\nservices, such as telecommunications, transportation, advertising, and\nfinance.\n\nSectoral shares % in GDP (at constant basic prices)  Sectors  | FY 2000  | FY 2005  | FY 2010  | FY 2015  | FY 2020  | FY 2024\n---|---|---|---|---|---|---\nAgricultural  |  31.75  |  28.15  |  25.89  |  24.83  |  23.53  |  24.04\nIndustrial  |  16.73  |  19.01  |  19.04  |  19.11  |  18.53  |  18.22\nServices  |  51.52  |  52.84  |  55.07  |  56.06  |  57.94  |  57.74"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "Yellow and green fields in Punjab\n\nThe majority of the population, directly or indirectly, is dependent on this\nsector, contributing about 23.0% of the gross domestic product (GDP) and\naccounting for 37.4% of the employed labor force in 2021. It is the largest\nsource of foreign exchange earnings. The most important crops are wheat,\nsugarcane, cotton, and rice, accounting for more than 75% of the value of\ntotal crop output. Pakistan's largest food crop is wheat. In 2017, Pakistan\nproduced 26,674,000 tonnes of wheat, almost equal to all of Africa (27.1\nmillion tonnes) and more than all of South America (25.9 million tonnes),\naccording to the FAOSTAT. In the market year of 2018/19, Pakistan exported a\nrecord 4.5 million tonnes of rice.\n\nPakistan is a net food exporter, except in occasional years when its harvest\nis adversely affected by droughts. Pakistan exports rice, cotton, fish, fruits\n(especially Oranges and Mangoes), and vegetables and imports vegetable oil,\nwheat, pulses, and consumer foods. The economic importance of agriculture has\ndeclined since independence when its share of GDP was around 53%.\n\n% growth  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nAgriculture sector  |  0.81  |  3.41  |  0.31  |  2.71  |  3.23  |  3.14  |  2.42  |  1.78  |  0.41  |  2.22  |  3.88  |  0.94  |  3.91  |  3.52  |  4.21  |  2.27  |  6.25\nProduction of important crops (million tonnes)\nWheat |  20.9  |  24.0  |  23.3  |  25.2  |  23.5  |  24.2  |  26.0  |  25.1  |  25.6  |  26.7  |  25.1  |  24.3  |  25.2  |  27.5  |  26.2  |  28.2  |  31.6\nRice |  5.6  |  6.9  |  6.9  |  4.8  |  6.2  |  5.6  |  6.8  |  7.0  |  6.8  |  6.8  |  7.5  |  7.2  |  7.4  |  8.4  |  9.3  |  7.3  |  9.9\nSugarcane |  63.9  |  50.0  |  49.4  |  55.3  |  58.4  |  63.8  |  67.5  |  62.8  |  65.5  |  75.5  |  83.3  |  67.2  |  66.4  |  81.0  |  88.7  |  88.0  |  87.6\nCotton *  |  11.7  |  11.8  |  12.9  |  11.5  |  13.6  |  13.0  |  12.8  |  14.0  |  9.9  |  10.7  |  11.9  |  9.9  |  9.1  |  7.1  |  8.3  |  4.9  |  10.2\nMaize / corn |  3.6  |  3.6  |  3.3  |  3.7  |  4.3  |  4.2  |  5.0  |  4.9  |  5.3  |  6.1  |  5.9  |  6.8  |  7.9  |  8.9  |  9.5  |  11.0  |  9.7\n\n* Cotton production in million bales.\n\nPakistan's principal natural resources are arable land and water. About 25% of\nPakistan's total land area is under cultivation and is watered by one of the\nlargest irrigation systems in the world. Pakistan irrigates three times more\nacres than Russia. Pakistan agriculture also benefits from year-round warmth.\nZarai Taraqiati Bank Limited is the largest financial institution geared\ntowards the development of the agriculture sector through the provision of\nfinancial services and technical expertise."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Industry",
    "text": "Factory in Pakistan\n\nPakistan's industrial sector accounts for approximately 19.12% of GDP. In\n2021, it recorded a growth of 7.81%, compared to the negative 5.75% in 2020.\nThe government is privatizing large-scale industrial units, and the public\nsector accounts for a shrinking proportion of industrial output, while growth\nin overall industrial output (including the private sector) has accelerated.\nGovernment policies aim to diversify the country's industrial base and bolster\nexport industries. Large Scale Manufacturing is the fastest-growing sector in\nthe Pakistani economy. Major industries include textiles, fertiliser, cement,\noil refineries, dairy products, food processing, beverages, construction\nmaterials, clothing, paper products, and shrimp.\n\nIn Pakistan, SMEs have a significant contribution to the total GDP of\nPakistan. According to SMEDA and Economic survey reports, the share in the\nannual GDP is 40%, with SMEs generating significant employment opportunities\nfor skilled workers and entrepreneurs. Small and medium-scale firms represent\nnearly 90% of all enterprises in Pakistan and employ 80% of the non-\nagricultural labor force. These figures indicate the potential and further\ngrowth in this sector.\n\n**% growth** List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nIndustrial sector  |  8.78  |  -4.15  |  3.95  |  4.87  |  2.33  |  1.16  |  4.34  |  5.40  |  6.01  |  4.61  |  9.18  |  0.25  |  -5.75  |  8.20  |  7.01  | -3.74  | 1.21\nManufacturing |  6.14  |  -3.94  |  1.73  |  2.61  |  2.01  |  5.37  |  5.76  |  4.12  |  4.03  |  4.87  |  7.08  |  4.52  |  -7.80  |  10.52  |  10.86  | -5.29  | 2.42\nMining  |  3.70  |  -1.04  |  2.42  |  -4.04  |  5.26  |  1.77  |  1.02  |  3.95  |  5.64  |  -0.89  |  7.26  |  0.54  |  -7.17  |  1.72  |  -6.66  | -3.31  | 4.85\nConstruction  | 13.37  | -6.70  | 7.27  | -7.97  | 2.17  | 5.40  | 3.19  | 8.33  | 14.37  | 10.20  | 19.55  | -18.14  | -3.08  |  2.39  |  1.83  | -9.25  | 5.86"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1",
    "section_name": "Manufacturing",
    "text": "Manufacturing is the largest of Pakistan's industrial sectors, accounting for\napproximately 12.13% of GDP. The manufacturing sub-sector is further divided\ninto three components: large-scale manufacturing (LSM) with a share of 79.6%\nin the manufacturing sector, small-scale manufacturing with a share of 13.8%\nin the manufacturing sector, while slaughtering contributes 6.5% to\nmanufacturing. Major sectors in industries include cement, fertiliser, edible\noil, sugar, steel, tobacco, chemicals, machinery, food processing, and medical\ninstruments, primarily surgical. Pakistan is one of the largest manufacturers\nand exporters of surgical instruments.\n\nProduction of selected manufactured goods  Manufactured goods  | Unit of quantity  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---|---\nCotton yarn  | Metric tonne (000)  | 3,406  | 3,428  | 3,430  | 3,431  | 3,060  | 3,442  | 3,459  | 2,695  | 2,477\nJute goods  | 55  | 60  | 74  | 67  | 65  | 70  | 58  | 63  | 41\nCooking oil  | 380  | 390  | 391  | 406  | 442  | 460  | 510  | 567  | 642\nSugar  | 5,115  | 7,049  | 6,566  | 5,260  | 4,881  | 5,694  | 7,921  | 6,709  | 6,796\nCement  | 35,432  | 37,022  | 41,148  | 39,924  | 39,121  | 49,797  | 48,011  | 41,448  | 39,566\nPaper & board  | 610  | 669  | 731  | 704  | 707  | 730  | 825  | 792  | 787\nCaustic soda  | 225  | 224  | 270  | 247  | 342  | 394  | 405  | 476  | 497\nHydrogen chloride  | 172  | 177  | 251  | 425  | 361  | 417  | 510  | 525  | 507\nSulphuric acid  | 75  | 56  | 49  | 49  | 40  | 72  | 111  | 71  | 64\nVegetable ghee  | 1,241  | 1,280  | 1,347  | 1,392  | 1,454  | 1,455  | 1,393  | 1,554  | 1,493\nCotton cloth  | Million meters  | 1,039  | 1,043  | 1,044  | 1,046  | 935  | 1,048  | 1,051  | 921  | 871\nCigarettes  | Billion  | 54  | 34  | 59  | 61  | 46  | 52  | 60  | 43  | 33\nNitrogenous fertilizers  | NT (000)  | 3,018  | 3,063  | 2,758  | 2,990  | 3,139  | 3,324  | 3,391  | 3,163  | 3,483\nPhosphatic fertilizers  | 664  | 683  | 619  | 633  | 631  | 748  | 804  | 616  | 756\nCycle tyres & tubes  | Numbers (000)  | 11,490  | 11,507  | 11,470  | 14,491  | 13,496  | 10,314  | 10,876  | 10,702  | 10,943\nMotor tyres & tubes  | 34,202  | 34,345  | 35,057  | 36,321  | 35,678  | 31,906  | 30,296  | 30,515  | 31,107\nMotorcycles  | 2,071  | 2,501  | 2,825  | 2,460  | 1,813  | 2,476  | 2,190  | 1,289  | 1,235\nBicycles  | 199  | 200  | 200  | 174  | 141  | 79  | 141  | 146  | 159\nElectric transformers  | 33  | 37  | 47  | 31  | 23  | 29  | 35  | 32  | 22\nRefrigerators  | 1,477  | 1,834  | 1,348  | 1,084  | 716  | 1,351  | 1,389  | 1,008  | 818\nAir conditioners  | 388  | 471  | 451  | 518  | 216  | 508  | 540  | 347  | 224\nElectric fans  | 2,033  | 2,523  | 2,596  | 2,591  | 2,124  | 2,499  | 2,600  | 2,182  | 2,283\nElectric meters  | 1,310  | 1,923  | 1,715  | 1,550  | 1,039  | 1,419  | 2,030  | 2,038  | 2,117\nMotor spirits/petrol  | Million liters  | 2,216  | 2,518  | 2,988  | 3,085  | 2,684  | 3,424  | 3,392  | 3,051  | 3,294\nHigh speed diesel  | 5,236  | 5,467  | 6,283  | 5,665  | 4,529  | 5,612  | 5,615  | 4,655  | 5,340\nFurnace oil  | 3,080  | 3,215  | 3,478  | 3,063  | 2,370  | 2,717  | 2,567  | 2,191  | 2,633\nJeeps & cars  | Numbers  | 180,717  | 193,996  | 231,738  | 218,845  | 106,764  | 182,389  | 271,923  | 131,978  | 100,221\nTractors  | Numbers  | 34,914  | 53,975  | 71,894  | 49,902  | 32,608  | 50,700  | 58,922  | 31,752  | 46,275\nTrucks & buses  | Numbers  | 8,331  | 10,548  | 13,425  | 9,684  | 4,848  | 5,977  | 7,934  | 4,839  | 3,240\n\nPakistan's largest corporations are primarily engaged in utilities such as\noil, gas, electricity, automobile, cement, food, chemicals, fertilizer, civil\naviation, textile, and telecommunication.\n\nTheir assets, sales, and profit/loss for the year 2023 are listed below:\n\nAmounts are in billion PKR.  Name  | Total assets  | Sales  | Profit / (loss) after tax\n---|---|---|---\nOil and Gas Development Co. Ltd. | 1,424  | 414  | 224.6\nSui Northern Gas Pipelines Limited | 1,268  | 1,294  | 10.4\nPakistan State Oil Co. Ltd. | 983  | 3,391  | 5.7\nK-Electric | 1,025  | 519  | (30.9)\nSui Southern Gas Co. Ltd | 798  | 376  | (11.4)\nPakistan Petroleum Ltd. | 790  | 286  | 97.9\nLucky Cement Ltd. | 608  | 385  | 49.4\nThe Hub Power Co. Ltd. | 406  | 114  | 62.0\nAttock Refinery Ltd. | 193  | 369  | 28.0\nFatima Fertilizer Co. Ltd. | 234  | 235  | 23.0\nEngro Fertilizers Ltd. | 161  | 224  | 26.2\nFauji Fertilizer Co. Ltd. | 327  | 181  | 19.7\nAttock Petroleum Ltd. | 108  | 474  | 12.5\nIndus Motor Co. Ltd. | 123  | 178  | 9.7\nShell Pakistan Ltd. | 106  | 432  | 5.8\nFauji Fertilizer Bin Qasim Ltd. | 146  | 193  | 4.4\nNational Refinery Ltd. | 112  | 299  | (4.5)\nNestle Pakistan Ltd. | 98  | 201  | 16.5\nCnergyico PK Limited | 365  | 194  | (13.6)\nPakistan Telecommunication Co. Ltd. | 644  | 188  | (15.5)\nPakistan International Airlines Corporation Ltd. | 321  | 179  | (17.5)\nNishat Mills Ltd. | 170  | 142  | 12.2\nFauji Cement Co. Ltd. | 139  | 90  | 29.5\nGul Ahmed Textile Mills Ltd. | 134  | 139  | 4.9\nINTERLOOP (Pvt) Ltd. | 125  | 121  | 21.7\nPakistan Tobacco Co. Ltd. | 110  | 110  | 29.0\nBestway Cement Ltd.  | 175  | 88  | 11.9\nPakistan Refinery Ltd. | 105  | 262  | 1.8"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1.1",
    "section_name": "Cement industry",
    "text": "In 1947, Pakistan inherited four cement plants with a total capacity of 0.5\nmillion tons. Some expansion occurred in 1956–66 but couldn't keep pace with\neconomic development. The country resorted to cement imports in 1976–77,\ncontinuing until 1994–95. The cement sector, comprising 27 plants, contributes\nover Rs 30 billion to the national exchequer in taxes. By 2013, Pakistan's\ncement industry grew rapidly, driven by demand from Afghanistan and countries\nboosting the real estate sector. In April 2020, the government introduced an\nincentive package for the construction industry, including an amnesty scheme,\ntax exemptions, and a Rs 36 billion subsidy for Naya Pakistan Housing Scheme.\nAdditionally, banks were directed to increase construction sector loans to 5\npercent of their total loan book, and FED reduction on cement from Rs 2/kg to\nRs 1.5/kg provided further impetus to the industry.\n\nCement production capacity & dispatches (million tonnes)  Indicators  | 2008  | 2009  | 2010  | 2011  | 2012  | 2013  | 2014  | 2015  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nProduction capacity  | 37.68  | 42.28  | 45.34  | 42.37  | 44.64  | 44.64  | 44.64  | 45.62  | 45.62  | 46.39  | 48.66  | 55.90  | 63.53  | 69.14  | 69.29  | 83.18\nLocal dispatches  | 22.58  | 20.33  | 23.57  | 22.00  | 23.95  | 25.06  | 26.15  | 28.20  | 33.00  | 35.65  | 41.15  | 40.34  | 39.97  | 48.12  | 47.64  | 40.01\nExports  | 7.72  | 10.98  | 10.65  | 9.43  | 8.57  | 8.37  | 8.14  | 7.20  | 5.87  | 4.66  | 4.75  | 6.54  | 7.85  | 9.31  | 5.26  | 4.57\nTotal dispatches  | 30.30  | 31.31  | 34.22  | 31.43  | 32.52  | 33.43  | 34.28  | 35.40  | 38.87  | 40.32  | 45.89  | 46.88  | 47.81  | 57.43  | 52.89  | 44.58"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1.2",
    "section_name": "Fertilizer industry",
    "text": "There are nine urea manufacturing plants, one DAP, three NP, four SSP, two\nCAN, one SOP, and two plants of blended NPKs with a total production capacity\nof 9,172 thousand tonnes per annum in 2021. Urea is the main fertilizer,\nholding a 70 percent share in total production. The installed production\ncapacity of 6,307 thousand tonnes per annum is sufficient to meet local\ndemand, subject to the availability of uninterrupted gas and RLNG supply.\n\n**Fertilizer offtake by nutrients ('000 tonnes)** Nutrients  | 2008  | 2009  | 2010  | 2011  | 2012  | 2013  | 2014  | 2015  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nNitrogen  | 2925  | 3034  | 3476  | 3133  | 3207  | 2853  | 3185  | 3308  | 2672  | 3730  | 3435  | 3408  | 3415  | 3711  | 3838\nPhosphorus  | 630  | 651  | 860  | 767  | 633  | 747  | 881  | 975  | 1007  | 1269  | 1279  | 1153  | 1084  | 1228  | 1093\nPotassium  | 27  | 25  | 24  | 32  | 21  | 21  | 24  | 33  | 20  | 41  | 50  | 53  | 50  | 69  | 71"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1.3",
    "section_name": "Defence industry",
    "text": "HIT-built Al-Khalid tank on display.\n\nThe defence industry of Pakistan, under the Ministry of Defence Production,\nwas established in September 1951 to promote and coordinate the array of\nmilitary production facilities that have emerged since independence. It is\nactively engaged in numerous joint production projects, such as the Al Khalid\n2 tank, advanced trainer aircraft, combat aircraft, artillery systems like\nMRLS, combat and surveillance drones like GIDS Shahpar-1 and Shahpar-2, battle\nmanagement and surveillance radars, electronic warfare systems, navy ships,\nand submarines.\n\nPakistan manufactures and sells weapons to over 40 countries, including\nEuropean customers, generating $620 million annually. The country's\nsophisticated arms imports increased by 119 percent between 2004–2008 and\n2009–13, with China providing 54 percent and the USA 27 percent of Pakistan's\nimports."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1.4",
    "section_name": "Textiles industry",
    "text": "Most of the textile industry is concentrated in Punjab. However, before 1990,\nthe industry was predominantly located in Karachi.\n\nPresently, the textile industry comprises two main segments: a highly\norganized large-scale sector and a considerably fragmented cottage/small-scale\nsector. The organized sector mainly includes integrated Textile Mills, housing\nnumerous spinning units and a limited number of shuttle-less loom units.\nConversely, the unorganized sector encompasses downstream industries like\nWeaving, Finishing, Garment, Towels, and Hosiery, all of which possess\nsignificant export potential. Within this sector, certain enterprises have\nexpanded to an international scale and exhibit progressive business\nphilosophies.\n\nSunday textile market on the sidewalks of Karachi, Pakistan\n\nAs of June 2021, the Pakistani textile industry comprised 517 textile units,\nincluding 40 composite units and 477 spinning units. This landscape also\nincluded 28,500 shuttle-less looms and 375,000 conventional looms. The growth\nof the spinning sector has been fueled by export demands and cotton\nproduction, with subsequent growth observed in the weaving and processing\nsector. Notably, independent air-jet weaving units have emerged, both as\nstandalone entities and in conjunction with spinning or processing units.\n\nA notable trend is the ongoing backward integration of some clothing units,\nwhile spinning units are actively developing weaving, finishing, and assembly\ncapabilities to create a comprehensive supply chain. This symbiotic\nrelationship between the textile and clothing sectors is leading to horizontal\nand vertical integration, often managed by the same entities or through\nbusiness collaborations.\n\nThis sector contributes nearly one-fourth of industrial value-added and\nprovides employment to about 40 percent of the industrial labor force.\nExcluding seasonal and cyclical fluctuations, textile products have maintained\nan average share of about 60 percent in national exports.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.1.5",
    "section_name": "Automobile industry",
    "text": "Cars on Shahrah-e-Faisal in Karachi\n\nThe auto sector constituted about 7 percent of LSM in 2021, contributing\nsignificantly to the country's industrial output. Given government support and\nthe removal of obstacles, the industrial expansion is expected to yield\npositive results soon. Many new investors have joined with commercial\nproduction, while existing players have already made substantial investments,\nwith more in the pipeline. Among the automakers yet to start production,\nProton, MG, and Volkswagen are poised to make a significant impact in the\nlocal passenger vehicle market. Meanwhile, KIA, Hyundai, Changan, and Prince\nDFSK have already commenced productions in Pakistan.\n\nProduction & sale of vehicles  Type  |  | 2006  | 2011  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---\nCar | P  | 170,487  | 133,972  | 179,944  | 188,936  | 217,774  | 209,255  | 94,325  | 151,794  | 226,433  | 101,984  | 79,573\nS  | 165,965  | 127,944  | 181,145  | 185,781  | 216,786  | 207,630  | 96,455  | 151,182  | 234,180  | 96,811  | 81,577\nTruck | P  | 4,518  | 2,901  | 5,666  | 7,712  | 9,326  | 6,035  | 2,945  | 3,808  | 5,659  | 3,074  | 2,204\nS  | 4,273  | 2,942  | 5,550  | 7,499  | 9,331  | 5,828  | 3,088  | 3,695  | 5,802  | 3,182  | 2,187\nBus | P  | 825  | 490  | 1,070  | 1,118  | 803  | 913  | 532  | 570  | 661  | 701  | 419\nS  | 927  | 515  | 1,017  | 1,130  | 762  | 935  | 559  | 652  | 696  | 654  | 454\nJeep & pick-up  | P  | 21,624  | 20,025  | 36,609  | 27,795  | 42,778  | 31,978  | 15,633  | 31,073  | 44,421  | 31,333  | 21,084\nS  | 21,471  | 18,553  | 36,534  | 27,338  | 42,006  | 33,016  | 15,507  | 30,215  | 45,087  | 30,067  | 22,250\nFarm tractor | P  | 48,887  | 70,770  | 34,914  | 53,975  | 71,894  | 49,902  | 32,608  | 50,751  | 58,880  | 31,726  | 45,529\nS  | 48,802  | 69,203  | 33,986  | 54,992  | 70,887  | 50,405  | 32,727  | 50,920  | 58,947  | 30,942  | 45,484\n2/3 wheelers | P  | 520,124  | 838,665  | 1,362,096  | 1,632,965  | 1,928,757  | 1,782,605  | 1,370,417  | 1,902,415  | 1,826,467  | 1,185,532  | 1,150,090\nS  | 516,640  | 835,455  | 1,358,643  | 1,630,735  | 1,931,340  | 1,781,959  | 1,370,005  | 1,903,932  | 1,821,885  | 1,186,969  | 1,150,112\n\nNote: These figures do not include the production/sale of companies which are\nnot members of the Pakistan Automotive Manufacturers Association (PAMA).\n\nAfter the entry of new models and brands by new entrants and due to the\nsignificantly low benchmark interest rate of 7%, consumer financing hit an\nall-time high in 2021. This trend started when a new Automotive Development\nPolicy (2016–2021) was first approved by the ECC in its meeting held on 18\nMarch 2016.\n\nSuch growth in demand for car financing was last seen during President Pervez\nMusharraf's regime (2001–2008) when banks, having ample liquidity, lent a\nsignificant amount for cars without checking borrowers' capabilities to repay\nthe debt. Later, the car financing bubble burst when a large number of people\ndefaulted on paying off the car financing.\n\nOutstanding loans of consumer financing for automobiles (billion PKR)  Jun 2006  | Jun 2007  | Jun 2010  | Jun 2015  | Jun 2016  | Jun 2017  | Jun 2018  | Jun 2019  | Jun 2020  | Jun 2021  | Jun 2022  | Jun 2023  | Jun 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---\n97.78  | 105.44  | 64.20  | 85.12  | 111.96  | 154.25  | 193.60  | 215.46  | 211.11  | 308.10  | 367.85  | 293.728  | 230.501"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.2",
    "section_name": "Mining",
    "text": "Khewra Salt Mine in the Jhelum District\n\nPakistan is endowed with significant mineral resources and is emerging as a\nvery promising area for prospecting/exploration for mineral deposits. In the\nwake of the 18th amendment to the constitution, all the provinces are free to\nexploit and explore the mineral resources within their jurisdiction.\n\nMining and quarrying contribute 13.19% to the industrial sector, with its\nshare in GDP being 2.4%.\n\nIn the recent past, exploration by government agencies as well as\nmultinational mining companies presents ample evidence of the occurrences of\nsizeable mineral deposits. Recent discoveries of a thick oxidised zone\nunderlain by sulphide zones in the shield area of the Punjab province, covered\nby thick alluvial cover, have opened new vistas for metallic minerals\nexploration. Pakistan has a large base for industrial minerals. The discovery\nof coal deposits with over 175 billion tonnes of reserves at Thar in the Sindh\nprovince has given an impetus to develop it as an alternative source of\nenergy. There is vast potential for precious and dimension stones.\n\nExtraction of principal minerals in the last 10 fiscal years is given in the\ntable below:\n\nMinerals  | Unit of quantity  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---\nCoal | Metric ton (000)  | 3,407  | 3,750  | 3,954  | 4,478  | 5,407  |  8,428  |  9,230  |  9,678  |  15,070  |  20,086\nNatural gas | MMCFT (000)  | 1,466  | 1,482  | 1,472  | 1,459  | 1,437  |  1,317  |  1,279  |  1,308  |  1,190  |  1,141\nCrude oil | JSB (000)  | 34,490  | 31,652  | 32,269  | 32,557  | 32,495  |  28,091  |  27,560  |  28,098  |  25,360  |  25,812\nChromite | Metric ton  | 100,516  | 69,333  | 105,238  | 97,420  | 138,244  | 121,435  |  134,000  | 195,000  |  156,000  |  259,000\nDolomite | Metric ton  | 223,117  | 666,755  | 301,124  | 488,825  | 472,474  | 302,045  |  388,000  | 487,000  |  544,000  |  502,000\nGypsum | Metric ton (000)  | 1,417  | 1,872  | 2,080  | 2,476  | 2,518  |  2,150  |  2,527  |  2,325  |  1,640  |  2,136\nLimestone | Metric ton (000)  | 40,470  | 46,123  | 52,149  | 70,819  | 75,596  |  65,810  |  76,632  |  58,362  |  58,941  |  61,387\nRock salt | Metric ton (000)  | 2,136  | 3,553  | 3,534  | 3,654  | 3,799  |  3,369  |  3,366  |  2,716  |  2,907  |  3,200\nSulphur | Metric ton  | 19,730  | 14,869  | 23,740  | 22,040  | 20,715  |  19,948  |  19,000  |  16,000  |  11,690  |  7,200\nBarytes | Metric ton  | 24,689  | 57,024  | 75,375  | 145,189  | 116,480  |  55,341  |  52,000  |  128,000  |  141,000  |  145,000\nMarble | Metric ton (000)  | 2,816  | 4,747  | 4,906  | 8,813  |  7,736  |  5,797  |  7,917  |  6,626  |  5,714  |  7,490"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.2.3",
    "section_name": "Energy",
    "text": "Wind power plant between Karachi and Hyderabad\n\nThe main sources of Pakistan's primary energy supplies are gas, oil, coal,\nliquefied natural gas (LNG), and hydroelectricity, with shares of 29%, 24%,\n15%, 10%, and 11% respectively in 2022. Since coal mining began in the Thar\ndesert and LNG imports from Qatar, coal and imported LNG increased their\nshares manyfold in just five years in the primary energy supplies of the\ncountry. The share of gas has decreased from 50% in 2005 to 24% in 2022, and\noil, since 2015, from 35% to 27% in 2022, being largely replaced by coal and\nLNG. As Pakistan intends to generate around 8,800 megawatts of nuclear power\nby 2030, its share is also increasing gradually.\n\nPrimary energy supplies by source  Fiscal year  | Unit  | Gas  | Oil  | Coal  | Hydro electricity  | LNG  | Nuclear electricity  | LPG  | Renewable electricity  | Imported electricity  | Total\n---|---|---|---|---|---|---|---|---|---|---|---\n2005  | MTOE  |  27.95  |  16.33  |  4.23  |  6.13  | –  |  0.67  |  0.25  | –  |  0.03  |  55.59\n%Share  |  50.3  |  29.4  |  7.6  |  11.0  | –  |  1.2  |  0.5  | –  |  0.0  | 100\n2010  | MTOE  |  30.81  |  19.81  |  4.62  |  6.71  | –  |  0.69  |  0.40  | –  |  0.06  |  63.09\n%Share  |  48.8  |  31.4  |  7.3  |  10.6  | –  |  1.1  |  0.6  | –  |  0.1  | 100\n2015  | MTOE  |  29.98  |  24.97  |  4.95  |  7.75  |  0.47  |  1.38  |  0.46  |  0.19  |  0.11  |  70.26\n%Share  |  42.7  |  35.5  |  7.0  |  11.0  |  0.7  |  2.0  |  0.7  |  0.3  |  0.1  | 100\n2020  | MTOE  |  26.66  |  18.19  |  14.71  |  8.02  |  8.32  |  2.58  |  1.03  |  0.99  |  0.12  |  80.62\n%Share  |  33.0  |  26.7  |  18.2  |  9.9  |  10.3  |  3.2  |  1.3  |  1.2  |  0.2  | 100\n2023  | MTOE  |  23.88  |  20.11  |  12.57  |  8.75  |  8.05  |  6.20  |  1.56  |  1.39  |  0.11  | 82.62\n%Share  |  28.9  |  24.3  |  15.2  |  10.6  |  9.7  |  7.5  |  1.9  |  1.7  |  0.1  | 100\n\n(CPPA-G) procures electricity from power producers, and the National\nTransmission and Despatch Company (NTDC) transmits this electricity via its\ntransmission lines to Distribution Companies (DISCOs), which then distribute\nthis electricity via their distribution lines to end consumers. Balancing\nPakistan's supply of electricity against the demand has been a longstanding\nunresolved issue. Since 2018, there has been an improvement in the\navailability of electricity due to the substantial increase in generation\ncapacity. However, the cost of electricity has risen due to various factors\nsuch as circular debt, capacity payments, fuel costs, currency devaluation,\nlow recovery rates, and transmission and distribution losses. Pakistan faces a\nsignificant challenge in overhauling its electricity supply network.\n\nNEPRA reports  Indicator  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---\nInstalled capacity (MW)  |  25,421  |  28,712  |  35,979  |  38,995  |  38,719  |  39,772  |  43,835  |  45,738  |  45,888\nElectricity generation (GWh)  |  114,093  |  120,622  |  133,588  |  137,005  |  134,242  |  143,589  |  154,056  |  138,539  |  137,196\nElectricity consumption (GWh)  |  94,354  |  99,616  |  110,891  |  113,142  |  112,071  |  121,206  |  133,665  |  121,863  |  118,246\nTransmission losses (%)  |  2.57  |  2.31  |  2.43  |  2.83  |  2.76  |  2.78  |  2.62  |  2.42  |  2.52\nDistribution losses (%)  |  18.14  |  17.93  |  18.32  |  17.61  |  17.82  |  17.32  |  16.85  |  16.45  |  18.31\n(%) **Share in electricity generation**\nHydel  |  30.29  |  26.59  |  21.01  |  24.16  |  28.83  |  27.02  |  23.07  |  26.17  |  29.08\nThermal  |  64.57  |  65.34  |  68.87  |  65.25  |  60.21  |  61.76  |  60.54  |  51.55  |  49.01\nNuclear  |  3.70  |  5.20  |  6.78  |  6.67  |  7.37  |  7.72  |  11.87  |  17.36  |  16.88\nRenewable energy  |  1.04  |  2.45  |  2.92  |  3.57  |  3.21  |  3.15  |  4.18  |  4.56  |  4.75\nImport  | 0.42  |  0.36  |  0.38  |  0.35  |  0.33  |  0.35  |  0.28\n\nThe total demand for petroleum products remained at 23.1 million tonnes during\nFY2022. The transport and power sectors are major petroleum consumers,\ncovering approximately 90 percent of the total demand.\n\nSectoral consumption of petroleum products (FY 2022)  Sector  | Domestic  | Industry  | Agriculture  | Transport  | Power  | Government  | Overseas  | Total\n---|---|---|---|---|---|---|---|---\nQuantity  | (000) MT  | 29.522  | 1,332.899  | 11.822  | 17,409.035  | 3,683.322  | 373.489  | 250.121  | 23,090.210\n\nPakistan is an importer of petroleum products and crude oil. Imports of\npetroleum products during FY2022 amounted to around 12.9 million tonnes,\nvalued at more than US$ 11.1 billion. The major imported products are motor\nspirit/gasoline, high-speed diesel, and furnace oil, with import quantities of\n6,502 thousand tonnes, 3,950 thousand tonnes, and 2,258 thousand tonnes,\nrespectively.\n\nImport of petroleum products (FY 2022)  Product  | MS | HOBC | HSD | FO | JP-1 | Total\n---|---|---|---|---|---|---\nQuantity  | (000) MT  | 6,502.07  | 125.62  | 3,949.97  | 2,258.20  | 53.87  | 12,889.730\nValue  | Million US$  | 6,070.38  | 115.94  | 3,462.71  | 1,414.40  | 47.42  | 11,110.852\n\nThe total production of refineries in Pakistan for fiscal year 2020–21 reached\n10.66 million tons. Among these refineries, PARCO holds the largest share,\naccounting for 41%, followed by ARL, BPPL, NRL, and PRL with shares of 17%,\n16%, 14%, and 12% respectively. OGRA, founded in March 2002, serves as the\nregulatory body with the primary goals of promoting competition and enhancing\nprivate investment and ownership within the petroleum sector by implementing\neffective and efficient regulations. Oil Marketing Companies (OMCs) have\nestablished their infrastructure, including storage facilities and retail\noutlets, to market Petroleum, Oil, and Lubricant (POL) products. Motor Spirit\n(MS) and High-Speed Diesel (HSD) together make up nearly 80% of OMCs' sales.\nBy the conclusion of fiscal year 2021, OMCs had developed a storage capacity\nof 0.58 million tons for MS and 0.88 million tons for HSD, distributed across\nvarious depots throughout the country. Oil Marketing Companies (OMCs) operate\na total of 9,978 retail outlets nationwide. Among these, Pakistan State Oil\n(PSO) holds the highest number of retail outlets, boasting 3,158 outlets,\nwhich accounts for approximately 31.65 percent of the total.\n\nIndigenous natural gas supplies accounted for approximately 30 percent of\nPakistan's total primary energy supply mix in FY2022. Pakistan maintains an\nextensive gas network comprising over 13,775 kilometers of transmission\npipelines, 157,395 kilometers of main pipelines, and 41,352 kilometers of\nservice pipelines. This network serves the needs of more than 10.7 million\nconsumers throughout the country. During FY 2021–22, the natural gas supply in\nPakistan reached 3,982 MMCFD. The country relies on several major gas fields,\nincluding Sui, Uch, Qadirpur, Sawan, Zamzama, Badin, Bhit, Kandhkot, Mari, and\nManzalai, to meet its domestic demand. Additionally, Pakistan has been\nimporting liquefied natural gas (LNG) since 2015, with regasified liquefied\nnatural gas (RLNG) playing a significant role in alleviating natural gas\nshortages. In the year 2021–22, approximately 24 percent of the country's gas\nsupplies were sourced from imported RLNG.\n\nIn FY 2020–21, the primary consumer of natural gas was the power sector, which\naccounted for more than 30 percent of the total consumption, equivalent to\n1,208 MMCFD. Following the power sector, the domestic sector consumed 21\npercent, or 850 MMCFD, while the fertilizer sector consumed 20 percent,\ntotaling 834 MMCFD."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Services",
    "text": "Pakistan's service sector contributes approximately 61.7% to the GDP. Within\nthis sector, transport, storage, communications, finance, and insurance\ncomprise 24%, while wholesale and retail trade constitute about 30%. Pakistan\nis actively promoting the growth of the information industry and other modern\nservice industries by offering incentives such as long-term tax holidays.\n\n**% growth** List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nService sector |  4.72  |  1.84  |  2.63  |  2.86  |  3.48  |  5.13  |  3.82  |  4.20  |  5.03  |  5.62  |  5.95  |  5.00  |  -1.21  |  5.91  | 6.59"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.1",
    "section_name": "Telecommunications",
    "text": "PTCL's One Stop Shop in Islamabad\n\nAfter the deregulation of the telecommunications industry, the sector has\nexperienced exponential growth. Pakistan Telecommunication Company Ltd (PTCL)\nhas emerged as a successful Forbes 2000 conglomerate with over US$1 billion in\nsales in 2005. The mobile telephone market has expanded many-fold since 2003,\nreaching a subscriber base of 140 million users in July 2017, one of the\nhighest mobile teledensities in the world. Pakistan won the prestigious\nGovernment Leadership award of GSM Association in 2006.\n\nIn Pakistan, the following are the top mobile phone operators:\n\n1. Jazz Pakistan (parent: VEON, Netherlands)\n2. Ufone (parent: PTCL (Etisalat), Pakistan/UAE)\n3. Telenor (parent: Telenor, Norway)\n4. Zong (parent: China Mobile, China)\n\nBy March 2009, Pakistan had 91 million mobile subscribers – 25 million more\nsubscribers than reported in the same period in 2008. In addition to the 3.1\nmillion fixed lines, as many as 2.4 million are using Wireless Local Loop\nconnections. Sony Ericsson, Nokia and Motorola along with Samsung and LG\nremain the most popular brands among customers.\n\nSince liberalisation, over the past four years from 2003 to 2007, the\nPakistani telecom sector has attracted more than $9 billion in foreign\ninvestments. During 2007–08, the Pakistani communication sector alone received\n$1.62 billion in Foreign Direct Investment (FDI) – about 30% of the country's\ntotal foreign direct investment.\n\nAccording to the PC World, a total of 6.37 billion text messages were sent\nthrough Acision messaging systems across Asia Pacific over the 2008/2009\nChristmas and New Year period. Pakistan was amongst the top five rankers with\none of the highest SMS traffic with 763 million messages.\n\nOn 14 August 2010, Pakistan became the first country in the world to\nexperience EVDO's RevB 3G technology that offers maximum speeds of 9.3 Mbit/s.\n\n3G and 4G were simultaneously launched in Pakistan on 23 April 2014 through a\nSMRA auction. Three out of five companies got a 3G licence i.e. Ufone,\nMobilink and Telenor while China Mobile's Zong got 3G as well as a 4G licence.\nWhereas the fifth company, Warid Pakistan did not participate in the auction\nprocedure, but they launched 4G LTE services on their existing 2G 1800 MHz\nspectrum due to Technology-neutral terms and became the world's first Telecom\nCompany to transform directly from 2G to 4G. With that, Pakistan joined the 3G\nand 4G world. In December 2017, 3G and 4G subscribers in Pakistan reached 46\nmillion.\n\nAfter the successful implementation of the Device Identification Registration\nand Blocking System (DIRBS) in 2019 along with a comprehensive mobile\nmanufacturing policy, it created a favourable environment for mobile device\nmanufacturing in Pakistan. For the first time in the history of Pakistan,\nlocal mobile phone manufacturing exceeded the number of mobile phones that\nwere imported in 2021. Mobile device manufacturing licences have been issued\nto 26 companies, including Samsung, Redmi, Realme, Nokia, Oppo, TECNO,\nInfinix, Itel, Vgotel, and Q-Mobile.\n\nPTA reports  Indicators  | 2003  | 2004  | 2005  | 2006  | 2007  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---\nTeledensity | 4.31%  | 6.25%  | 11.9%  | 26.24%  | 44.06%  | 72.4%  | 74.1%  | 75.1%  | 76.3%  | 81.7%  | 84.6%  | 81.4%  | 80.5%\nTelecom subscribers (millions)  | 2.4  | 5.0  | 12.7  | 34.5  | 62.3  | 139.8  | 151.5  | 165.0  | 171.1  | 186.8  | 197.2  | 193.5  | 195.1\nBroadband subscribers (millions)  | 0.03  | 0.05  | 44.8  | 58.7  | 71.5  | 83.8  | 102.7  | 118.8  | 127.6  | 138.3\nBroadband penetration  | 0.0%  | 0.0%  | 22.7%  | 28.1%  | 32.6%  | 37.4%  | 44.9%  | 51.0%  | 53.6%  | 57.0%\nCellular mobile data usage (petabytes)  | 690  | 1,262  | 2,493  | 4,510  | 6,853  | 8,970  | 10,850  | 13,021\nTelecom revenues (billion PKR)  | 118  | 144  | 195  | 236  | 528  | 540  | 604  | 595  | 641  | 717  | 817  | 955\nTelecom contribution to exchequer (billion PKR)  | 30.0  | 38  | 67  | 77  | 100  | 161  | 163  | 111  | 286  | 222  | 329  | 341  | 335\nTotal telecom investment (million US $)  | 1,473  | 1,731  | 4,109  | 1,133  | 1,132  | 882  | 1,140  | 1,214  | 1,657  | 770  | 765\nMobile (CBU) imports (million units)  | 18.11  | 12.07  | 16.28  | 24.51  | 10.26  | 1.53  | 1.58  | 1.71\nLocal assembly / manufacturing (million units)  | 1.72  | 5.2  | 11.74  | 13.05  | 24.66  | 21.94  | 21.28  | 31.38"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.1.1",
    "section_name": "Air linkage",
    "text": "Jinnah International Airport in Karachi\n\nThe year 1955 marked the inauguration of the Pakistan airline's first\nscheduled international service – to London, via Cairo and Rome. In 1959, the\nGovernment of Pakistan appointed Air Commodore Nur Khan as the managing\ndirector of PIA. With his visionary leadership, PIA 'took off' and within a\nshort span of 6 years, gained the stature and status of one of the world's\nfrontline carriers. In aviation circles, this period has often been referred\nto as the \"golden years of PIA\". On 29 April 1964, with a Boeing 720B, PIA\nearned the distinction of becoming the first airline from a non-communist\ncountry to fly into the People's Republic of China. Private sector airlines in\nPakistan include Airblue, which serves the main cities within Pakistan in\naddition to destinations in the Persian Gulf and Manchester in the United\nKingdom.\n\nPIA annual reports  Indicators  | 2003  | 2008  | 2013  | 2018  | 2019  | 2020  | 2021  | 2022\n---|---|---|---|---|---|---|---|---\nRoute kilometers  | 290,129  | 311,131  | 411,936  | 332,303  | 389,725  | 705,820  | 374,054  | 341,821\nPassengers carried (000)  | 4,556  | 5,617  | 4,449  | 5,203  | 5,290  | 2,541  | 2,657  | 4,281\nOperating revenue (billion PKR)  | 47.952  | 88.863  | 95.771  | 103.490  | 147.500  | 94.989  | 86.185  | 172.038\nOperating expenses (billion PKR)  | 42.574  | 120.499  | 123.151  | 150.524  | 153.631  | 95.670  | 101.212  | 183.354\nProfit+/-loss after tax (billion PKR)  | +1.298  | −36.138  | −44.322  | −67.328  | −52.602  | −34.643  | −50.101  | −88.008"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.1.2",
    "section_name": "Railway linkage",
    "text": "A Pakistan Railway train\n\nPakistan Railways (PR) is a major mode of transport in the public sector,\ncontributing to the country's economic growth and providing national\nintegration. 13 May 1861 was a historical day when the first railway line was\nopened for public between Karachi City and Kotri, a distance of 169 km. In\n1885, the Sindh, Punjab and Delhi Railways were purchased by the Secretary of\nState for India. On 1 January 1886 this line and other State Railways were\nintegrated and North Western State Railway was formed; this was later renamed\nas North Western Railways (NWR). At the time of Independence, the NWR was\nbifurcated with 1,847 route miles lying in India and 5,048 route miles in\nPakistan. In 2022, Pakistan Railways comprised a total of 467 locomotives (462\ndiesel engines and 05 steam engines) for the 7,479 km route length. Pakistan\nRailways employed 60,643 people in 2022.\n\nPakistan Railway year books  Indicators  | 2016  | 2017  | 2018  | 2019  | 2020  | 2021  | 2022  | 2023  | 2024\n---|---|---|---|---|---|---|---|---|---\nRoute kilometers  | 7,791  | 7,791  | 7,791  | 7,791  | 7,791  | 7,791  | 7,479  | 7,791  | 7,791\nTrack kilometers  | 11,881  | 11,881  | 11,881  | 11,881  | 11,881  | 11,881  | 11,492  | 11,881  | 11,881\nPassengers carried (000)  | 52,192  | 52,388  | 54,907  | 60,387  | 44,304  | 28,424  | 35,681  | 35,404  | 42,103\nGoods carried (000 tonnes)  | 5,001  | 5,630  | 8,355  | 8,376  | 7,412  | 8,213  | 8,098  | 5,748  | 7,854\nOperating revenue (billion PKR)  | 36.58  | 40.06  | 49.57  | 54.51  | 47.58  | 48.65  | 60.09  | 63.29  | 88.73\nOperating expenses (billion PKR)  | 41.86  | 50.07  | 52.07  | 53.77  | 59.29  | 56.33  | 67.56  | 72.12  | 88.31\nNet loss (billion PKR)  | 26.53  | 40.79  | 37.12  | 33.49  | 50.27  | 47.71  | 48.49  | 47.77  | 53.32"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.1.3",
    "section_name": "Road linkage",
    "text": "Karakoram Highway\n\nThe National Highway Authority (NHA) was established in 1991 through an Act of\nParliament for the planning, development, operation, repair, and maintenance\nof National Highways and Strategic Roads specially entrusted to NHA by the\nFederal Government or by a Provincial Government or other authority concerned.\nNHA is the custodian of 39 national highways, motorways, expressways, and\nstrategic routes, with a total length of 12,131 km, constituting 4.6% of the\ntotal national roads network, which is 263,775 km. However, it carries 80% of\ncommercial traffic, and the N-5 National Highway, which is the lifeline of\nPakistan, carries 65% of this load in the country."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.1.4",
    "section_name": "Maritime linkage",
    "text": "Port of Karachi\n\nPakistan National Shipping Corporation (PNSC) is a national flag carrier. It\nwas formed through the merger of the National Shipping Corporation and\nPakistan Shipping Corporation in 1979. PNSC has had worldwide operations in\nthe dry bulk segment of the shipping market since its inception, and has been\ninvolved in the transportation of liquid cargo since 1998, both locally and\ninternationally. The corporation's head office is located in Karachi.\nCurrently, the PNSC fleet comprises eleven vessels of various types and sizes\n(five bulk carriers, four Aframax tankers, and two LR-1 Clean Product tankers)\nwith a total deadweight capacity (cargo carrying capacity) of 831,711 metric\ntons, the highest ever carrying capacity since the inception of PNSC."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.2",
    "section_name": "Finance",
    "text": "Pakistan has a large and diverse banking system. In 1974, a nationalization\nprogramme led to the creation of six government-owned banks. A privatization\nprogramme in the 1990s led to the entry of foreign-owned and local banks into\nthe industry. As of 2010, there were five publicly-owned commercial banks in\nPakistan, as well as 25 domestic private banks, six multinational banks, and\nfour specialised banks.\n\nA part of Downtown Karachi, Showing the MCB Tower and Habib Bank Plaza. The\nheadquarters of many banks in Pakistan can be found here.\n\nSince 2000, Pakistani banks have begun aggressive marketing of consumer\nfinance to the emerging middle class, allowing for a consumption boom (more\nthan a seven-month waiting list for certain car models) as well as a\nconstruction bonanza. Pakistan's banking sector remained remarkably strong and\nresilient during the 2008 financial crisis, a feature which has served to\nattract a substantial amount of FDI in the sector. Stress tests conducted in\nJune 2008 data indicate that the large banks are relatively robust, with the\nmedium and small-sized banks positioning themselves in niche markets.\n\nThe Pakistan Bureau of Statistics provisionally valued this sector at\nRs.807,807 million in 2012, thus registering over 510% growth since 2000.\n\nAn article published in the _Journal of the Asia Pacific Economy_ by Mete\nFeridun of the University of Greenwich in London with his Pakistani colleague\nAbdul Jalil presents strong econometric evidence that financial development\nfosters economic growth in Pakistan.\n\nFinancial statements of major banks 2023 (billion PKR)  Bank  | Total assets | Revenue  | Profit after tax\n---|---|---|---\nState Bank of Pakistan | 19,687  | 1,218  | 1,143.0\nHabib Bank Ltd | 5,202  | 277  | 56.9\nMeezan Bank | 3,012  | 249  | 84.5\nNational Bank of Pakistan | 6,653  | 209  | 51.8\nMCB BANK LTD. | 2,427  | 181  | 59.6\nUnited Bank Limited | 5,575  | 166  | 53.2\nBank Alfalah | 3,346  | 154  | 36.5\nBank AL Habib | 2,741  | 147  | 35.3\nAllied Bank Limited | 2,329  | 138  | 40.7\nStandard Chartered Bank Ltd. | 1,002  | 107  | 42.6\nHabibMetro | 1,556  | 87  | 24.4\n\nIn recent years, banking through digital channels has been gaining popularity\nin the country. These channels offer alternatives resulting in faster delivery\nof financial services to a wide range of customers. Significant progress has\nbeen observed in the usage of internet banking and mobile banking channels\nduring the last few years. In the last five years,[_when?_] internet banking\ntransactions saw compound annualised growth of 31%, whereas mobile banking\ntransactions grew by 86%.\n\n**Payment system infrastructure** | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---\nCommercial banks + MFBs  | 44  | 44  | 44  | 44  | 45\nBank branches  | 16,067  | 16,308  | 17,031  | 17,693  | 18,450\nTotal number of ATMs  | 15,612  | 16,355  | 17,133  | 17,808  | 18,957\nInternet banking users (000)  | 3,983  | 5,239  | 8,370  | 9,637  | 11,996\nMobile phone banking users (000)  | 8,452  | 10,873  | 12,339  | 16,061  | 18,678\nPOS machines  | 49,067  | 71,907  | 104,865  | 115,288  | 125,593\nCredit cards (million)  | 1.66  | 1.72  | 1.80  | 2.01  | 2.04\nDebit cards (million)  | 26.7  | 29.8  | 34.6  | 39.0  | 48.3\nPayment system statistics  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---\nPRISM system*  | Transactions (millions)  | 2.6  | 4.2  | 4.4  | 4.9  | 5.8\nAmount (trillion PKR)  | 394.3  | 444.6  | 681.6  | 640.4  | 1,043.1\nPaper based  | Transactions (millions)  | 598.4  | 582.3  | 599.1  | 574.2  | 571.2\nAmount (trillion PKR)  | 185.6  | 218.9  | 295.7  | 342.7  | 447.7\nMobile banking  | Transactions (millions)  | 82.8  | 193.4  | 387.5  | 660.6  | 1,122.8\nAmount (trillion PKR)  | 1.8  | 4.9  | 11.8  | 23.8  | 46.3\nE-commerce  | Transactions (millions)  | 10.2  | 21.9  | 45.5  | 31.8  | 39.9\nAmount (billion PKR)  | 34.9  | 60.6  | 106.0  | 142.0  | 194.3\n\n* Real-time gross settlement (RTGS) mechanism in Pakistan is named the Pakistan Real-time Interbank Settlement Mechanism (PRISM)."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.3",
    "section_name": "Housing",
    "text": "House on mountains in Murree\n\nThe property sector has expanded 23-fold since 2001, particularly in\nmetropolises like Lahore. Nevertheless, the Karachi Chamber of Commerce and\nIndustry estimated in late 2006 that the overall production of housing units\nin Pakistan has to be increased to 0.5 million units annually to address 6.1\nmillion backlog of housing in Pakistan for meeting the housing shortfall in\nnext 20 years. The report noted that the present housing stock is also rapidly\naging and an estimate suggests that more than 50% of stock is over 50 years\nold. It is also estimated that 50% of the urban population now lives in slums\nand squatter settlements. The report said that meeting the backlog in housing,\nbesides replacement of out-lived housing units, is beyond the financial\nresources of the government. This necessitates putting in place a framework to\nfacilitate financing in the formal private sector and mobilise non-government\nresources for a market-based housing finance system. To promote affordable\nhousing and home ownership among low to middle-income group, who currently do\nnot own a house, SBP in 2020 introduced the Government's Mark-Up Subsidy\nScheme, through which subsidized financing is provided to individuals for\nconstruction or purchase of a new house. Since then, a huge demand for house\nfinancing has been witnessed by the commercial banks.\n\nOutstanding loans of consumer financing for house building (billion PKR)  Jun 2006  | Jun 2010  | Jun 2015  | Jun 2016  | Jun 2017  | Jun 2018  | Jun 2019  | Jun 2020  | Jun 2021  | Jun 2022  | Jun 2023  | Jun 2024\n---|---|---|---|---|---|---|---|---|---|---|---\n43.205  | 54.500  | 40.207  | 48.153  | 60.688  | 82.939  | 92.561  | 79.803  | 103.631  | 200.765  | 212.315  | 203.580"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.3.4",
    "section_name": "Tourism",
    "text": "Tourism in Pakistan has been hailed as the tourism industry's \"next big\nthing\". Pakistan, with its diverse cultures, people, and landscapes, has\nattracted 90 million tourists to the country, almost double that of a decade\nago. Currently, Pakistan ranks 130th in the world by tourist income. Due to\nthe threat of terrorism, the number of foreign tourists has gradually\ndeclined, and the shock of the 2013 Nanga Parbat tourist shooting has severely\nadversely affected the tourism industry. As of 2016[update], tourism has begun\nto recover in Pakistan, albeit gradually, with a current global rank of 130."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Investment",
    "text": "Foreign investment significantly declined by 2010, dropping by 54.6% due to\nPakistan's political instability and weak law and order, according to the Bank\nof Pakistan.\n\nBusiness regulations have been overhauled along liberal lines, especially\nsince 1999. Most barriers to the flow of capital and international direct\ninvestment have been removed. Foreign investors do not face any restrictions\non the inflow of capital, and investment of up to 100% of equity participation\nis allowed in most sectors. Unlimited remittance of profits, dividends,\nservice fees or capital is now the rule. However, doing business has been\nbecoming increasingly difficult over the past decade due to political\ninstability, rising domestic insurgency and insecurity and vehement\ncorruption. This can be confirmed by the World Bank's Ease of Doing Business\nIndex report degrading its ratings for Pakistan each year since September\n2009.\n\nThe World Bank (WB) and International Finance Corporation's flagship report\nEase of Doing Business Index 2020 ranked Pakistan 108 among 190 countries\naround the globe, indicating a continuous improvement and taking a jump from\n136 last year. The top five countries were New Zealand, Singapore, Denmark,\nHong Kong and South Korea.\n\nWith improvement in ease of doing business ranking and giving an investment\nfriendly road map from government, many new auto sector giants like France's\nRenault, South Korean's Hyundai and Kia, Chinese JW Forland and German auto\ngiant Volkswagen are considering entry into Pakistan auto market through joint\nventures with local manufacturers like Dewan Farooque Motors, Khalid Mushtaq\nMotors and United Motors. As of March 2022, only the Hyundai Nishat JV\nmaterialised.\n\nUS oil and gas giant Exxon Mobil returned to Pakistan after nearly three\ndecades gap and has acquired 25% shares in offshore drilling in May 2018, with\ninitial survey showing a potential of huge hydrocarbon reserves discovery\noffshore.\n\nTo boost Pakistan's unstable foreign-exchange reserves, Qatar announced to\ninvest $3 billion in the form of deposits and direct investments in the\ncountry. By the end of June 2019, Qatar sent the first $500 million to\nPakistan.\n\nData is from SBP.\n\nAmounts are in million US$.  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nForeign direct investment  |  5,410  |  3,720  |  2,151  |  1,635  |  821  |  1,457  |  1,699  |  1,034  |  2,393  |  2,407  |  2,780  | 1,362  | 2,598  | 1,821  | 1,936  | 1,627  | 1,902"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Foreign acquisitions and mergers",
    "text": "With the rapid growth in Pakistan's economy, foreign investors are taking a\nkeen interest in the corporate sector of Pakistan. In recent years, majority\nstakes in many corporations have been acquired by multinational groups.\n\n* PICIC by Singapore-based Temasek Holdings for $339 million\n* Union Bank by Standard Chartered Bank for $487 million\n* Prime Commercial Bank by ABN Amro for $228 million\n* PakTel by China Mobile for $460 million\n* PTCL by Etisalat for $1.8 billion\n* Additional 57.6% shares of Lakson Tobacco Company acquired by Philip Morris International for $382 million\n* In 2016, Arçelik acquired Dawlance for $243 million.\n* In 2016, FrieslandCampina acquired 51% stake in Engro Foods for $446.81 million.\n* In 2016, The Abraaj Group sold its 66.4% stake in K-Electric to Shanghai Electric for $1.77 billion.\n\nThe foreign exchange receipts from these sales are also helping cover the\ncurrent account deficit."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Foreign trade",
    "text": "Gwader port in Balochistan\n\nPakistan witnessed the highest export of US$25.4 billion in the FY 2011.\nHowever, in subsequent years exports have declined considerably. This decline\nstarted from the financial year 2015 when an international commodity slump set\nin. This was compounded by structural supply-side constraints including energy\nshortages, high input costs, and an overvalued exchange rate. From the\nfinancial year 2014 to 2016, exports declined by 12.4 percent. The exports\ngrowth trend over this period was similar to the world trade growth patterns.\nPakistan's external sector continued facing stress during 2017. Still,\nPakistan's merchandise trade exports grew by 0.1 percent during the fiscal\nyear 2017. The imports continued to grow at a much faster rate and grew by a\nlarge percentage of 18.0 during the FY 2017 as compared to the previous year.\n\nNote: This is the trade data (export and import) as released by the SBP. This\nmay differ from the data compiled by Pakistan Bureau of Statistics.\n\nAmounts in billion US dollars  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n**Total exports** |  24.01  |  23.21  |  24.89  |  31.11  |  29.73  |  31.53  |  30.42  |  29.96  |  27.43  |  27.92  |  30.62  |  30.22  |  27.97  |  31.58  |  39.60  |  35.47  | 38.67\nGoods  |  20.45  |  19.13  |  19.68  |  25.37  |  24.72  |  24.80  |  25.08  |  24.09  |  21.97  |  22.00  |  24.77  |  24.26  |  22.54  |  25.64  |  32.49  |  27.88  | 30.98\nServices  |  3.56  |  4.09  |  5.21  |  5.75  |  5.01  |  6.72  |  5.35  |  5.87  |  5.46  |  5.92  |  5.85  |  5.97  |  5.44  |  5.95  |  7.10  |  7.60  | 7.69\n**Total imports** |  45.44  |  39.22  |  38.12  |  43.57  |  48.69  |  48.45  |  49.66  |  50.21  |  50.12  |  58.58  |  67.95  |  62.81  |  52.40  |  62.73  |  84.49  |  61.33  | 63.96\nGoods  |  35.28  |  31.67  |  31.13  |  35.80  |  40.37  |  40.16  |  41.67  |  41.36  |  41.12  |  48.00  |  55.67  |  51.87  |  43.65  |  54.27  |  71.54  |  52.70  | 53.16\nServices  |  10.16  |  7.56  |  6.99  |  7.77  |  8.32  |  8.29  |  8.00  |  8.85  |  9.00  |  10.58  |  12.28  |  10.94  |  8.75  |  8.46  |  12.94  |  8.64  | 10.80\n**Trade deficit** |  21.43  |  16.01  |  13.23  |  12.46  |  18.96  |  16.92  |  19.24  |  20.24  |  22.69  |  30.66  |  37.33  |  32.58  |  24.43  |  31.15  |  44.89  |  25.86  | 25.29\n\nPakistan's imports are showing a rising trend at a relatively faster rate due\nto increased economic activity as part of the China Pakistan Economic Corridor\n(CPEC), particularly in the energy sector. The construction projects under\nCPEC require heavy machinery that has to be imported. It is also observed that\nthe economy is currently being led both by investments as well as consumption,\nresulting in relatively higher levels of imports. During FY 2018, Pakistan's\nexports picked up and reached US$24.8 billion, showing a growth of 12.6\npercent over the previous year, FY 2017. Imports, on the other hand, also\nincreased by 16.2 percent, reaching the highest figure of US$56.6 billion. As\na result, the trade deficit widened to US$31.8 billion, which was the highest\nin the last ten years. Pakistan's exports of goods recorded their highest\nlevel of $25.6 billion during the fiscal year 2021, higher than the $25.3\nbillion recorded in 2011."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.6.1",
    "section_name": "Exports",
    "text": "Pakistan's major export commodities since fiscal year 2014 are listed in the\ntable below.\n\n**Amounts are in million US$.** Commodities  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---\nKnitwear |  2,264  |  2,309  |  2,335  |  2,615  |  2,854  |  2,688  |  3,372  |  4,516  |  4,244  | 4,018\nReady-made garments | 2,044  | 2,156  |  2,279  |  2,477  |  2,568  |  2,595  |  2,820  |  3,698  | 3,496  | 3,471\nBed wear  | 2,207  | 2,126  |  2,157  |  2,346  |  2,347  |  2,230  |  2,691  |  3,255  | 2,804  | 2,790\nRice | 2,038  | 1,853  |  1,575  |  1,933  |  2,163  |  2,274  |  2,211  |  2,760  | 2,109  |  3,684\nCotton cloth  | 2,487  | 2,332  |  2,123  |  2,176  |  2,174  |  1,942  |  1,884  |  2,338  | 2,155  | 1,898\nChemical and pharmaceutical | 1,250  | 1,052  |  1,113  |  1,390  |  1,227  |  1,074  |  1,147  |  1,482  |  1,429  | 1,420\nCotton yarn | 1,818  | 1,266  |  1,140  |  1,249  |  1,202  |  1,081  |  921  |  1,200  |  870  | 1,052\nTowels | 716  | 721  |  679  |  750  |  713  |  680  |  882  |  1,080  |  931  |  954\nLeather manufactures  | 547  | 488  |  487  |  615  |  503  |  480  |  560  |  649  |  628  |  606\nSports goods | 585  | 539  |  552  |  551  |  519  |  458  |  471  |  507  |  460  |  439\nSurgical goods & medical instruments  | 401  | 424  |  396  |  442  |  438  |  411  |  480  |  475  |  454  |  456"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.6.2",
    "section_name": "Imports",
    "text": "Pakistan's major import commodities since fiscal year 2014 are listed in the\ntable below.\n\n**Amounts are in million US$**.  Commodities  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022\n---|---|---|---|---|---|---|---|---|---\nPetroleum products | 9,020  |  7,774  |  5,098  |  6,380  |  6,768  |  6,039  |  4,190  |  4,641  |  10,296\nPetroleum crude  | 5,755  |  4,393  | 2,570  |  2,765  |  4,310  |  4,915  |  2,606  |  3,190  |  4,602\nLiquefied natural gas (LNG)  | 0  |  135  |  579  |  1,271  |  2,036  |  2,872  |  2,375  |  1,776  |  3,681\nPlastic material | 1,680  |  1,772  |  1,791  |  1,875  |  2,312  |  2,273  |  1,941  |  2,460  |  3,251\nPalm oil | 1,922  |  1,681  |  1,600  |  1,775  |  1,908  |  1,662  |  1,752  |  2,443  |  3,151\nRoad vehicles | 861  |  1,025  |  1,264  |  1,774  |  2,182  |  1,934  |  1,276  |  2,143  |  3,010\nIron and steel | 1,540  |  1,813  |  2,094  |  1980  |  2,523  |  2,008  |  1,491  |  2,197  |  2,854\nRaw cotton  | 532  |  449  |  1,127  |  909  |  1,198  |  1,181  |  1,342  |  1,894  |  2,283\nTelecom | 1,217  |  1,225  |  1,201  |  1,023  |  1,397  |  1,172  |  1,637  |  2,513  |  2,252\nElectrical machinery & apparatus  | 722  |  935  |  1,651  |  1,317  |  1,801  |  1,287  |  1,135  |  1,452  |  1,817\nTextile machinery  | 658  |  492  |  529  |  652  |  615  |  654  |  588  |  855  |  1,212\nPower generating machinery  | 675  |  898  |  1,356  |  1,337  |  1,577  |  732  |  734  |  930  |  795"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "External imbalances",
    "text": "During FY 2017, the increase in imports of capital equipment and fuel\nsignificantly put pressure on the external account. A reversal in global oil\nprices led to an increase in POL imports, accompanied by falling exports; as a\nresult, the merchandise trade deficit grew by 39.4 percent to US$26.885\nbillion in FY 2017. While remittances and Coalition Support Fund inflows both\ndeclined slightly over the same period last year, however, the impact was\noffset by an improvement in the income account, mainly due to lower profit\nrepatriations by oil and gas firms.\n\nThe current account deficit increased to US$19.2 billion in FY 2018.\n\nHowever, the impact of high current deficit on foreign exchange reserves was\nnot severe, as financial inflows were available to the country to partially\noffset the gap; these inflows helped ensure stability in the exchange rate.\nNet FDI grew by 12.4 percent and reached US$1.6 billion in the nine-month\nperiod, whereas net FPI saw an inflow of US$631 million, against an outflow of\nUS$393 million last year. Encouragingly for the country, the period saw the\ncompletion of multiple merger and acquisition deals between local and foreign\ncompanies. Moreover, multiple foreign automakers announced their intention to\nenter the Pakistani market, and some also entered into joint ventures with\nlocal conglomerates. This indicates that Pakistan is clearly on foreign\ninvestors' radar, and provides a positive outlook for FDI inflows going\nforward. government's successful issuance of a US$1.0 billion Sukuk in the\ninternational capital market, at an extremely low rate of 5.5 percent.\n\nPakistan continued to enjoy support from international financial institutions\n(IFIs) like the World Bank and Asian Development Bank, and from bilateral\npartners like China, in the post-EFF period: net official loan inflows of\nUS$1.1 billion were recorded during the period. As a result, the country's FX\nreserve amounted to US$20.8 billion by 4 May 2017 sufficient to finance around\nfour months of import payments.\n\nAmounts in billion US dollars  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nCredit  | 37.25  | 35.36  | 38.14  | 47.70  | 48.24  | 50.20  | 51.15  | 52.90  | 51.24  | 52.22  | 55.15  | 55.79  | 54.25  | 65.12  | 73.20  | 64.79  | 72.45\nDebit  | 51.12  | 44.62  | 42.08  | 47.49  | 52.90  | 52.69  | 54.28  | 55.71  | 56.20  | 64.49  | 74.34  | 69.23  | 58.70  | 67.94  | 90.68  | 68.06  | 74.14\nNet  | −13.87  | −9.26  | −3.95  | 214  | −4.66  | −2.50  | −3.13  | −2.82  | −4.96  | −12.27  | −19.20  | −13.43  | −4.45  | −2.82  | −17.48  | −3.28  | -1.69\nAs % of GDP  |  |  |\nNet  |  -8.9  |  -5.7  |  -2.3  |  +0.1  |  -2.1  |  -1.1  |  -1.3  |  -1.0  |  -1.7  |  -4.0  |  -6.1  |  -4.8  |  -1.7  |  -0.6  |  |  |"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Economic aid",
    "text": "Pakistan receives economic aid from several sources as loans and grants. The\nInternational Monetary Fund (IMF), World Bank (WB), Asian Development Bank\n(ADB), etc. provide long-term loans to Pakistan. Pakistan also receives\nbilateral aid from developed and oil-rich countries. Foreign aid has been one\nof the main sources of money for the Pakistani economy. Collection of foreign\naid has been one of the priorities of almost every Pakistani Government with\nthe Prime Minister himself leading delegations on a regular basis to collect\nforeign aid.\n\nThe Asian Development Bank will provide close to $6 billion development\nassistance to Pakistan during 2006–9. The World Bank unveiled a lending\nprogramme of up to $6.5 billion for Pakistan under a new four-year, 2006–2009,\naid strategy showing a significant increase in funding aimed largely at\nbeefing up the country's infrastructure. Japan will provide $500 million\nannual economic aid to Pakistan. In November 2008, the International Monetary\nFund (IMF) has approved a loan of 7.6 billion to Pakistan, to help stabilise\nand rebuild the country's economy. Between the 2008 and 2010 fiscal years, the\nIMF extended loans to Pakistan totalling 5.2 billion dollars. The government\ndecided in 2011 to cut off ties with the IMF. However, the government newly\nelected in 2013 re-established these ties, and a negotiated a three-year $6.6\nbillion package which would allow it to deal with ongoing debt issues. In May\n2019, Pakistan finalised a US$6 billion foreign aid with IMF. This is\nPakistan's 22nd such bailout from the IMF.\n\nThe China–Pakistan Economic Corridor is being developed with a contribution of\nmainly concessionary loans from China under the Belt and Road Initiative. Much\nlike BRI, the value of CPEC investments transcends any fiat currency and is\nonly estimated vaguely as it spans over decades of past and future industrial\ndevelopment and global economic influence."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.9",
    "section_name": "Remittances",
    "text": "The remittances of Pakistanis living abroad have played an important role in\nPakistan's economy and foreign exchange reserves. Pakistanis settled in\nWestern Europe and North America are significant sources of remittances to\nPakistan. Since 1973, Pakistani workers in the oil-rich Arab states have been\nsources of billions of dollars of remittances.\n\nThe 9 million-strong Pakistani diaspora contributed US$19.3 billion to the\neconomy in FY2017. The major source countries of remittances to Pakistan\ninclude UAE, US, Saudi Arabia, GCC countries (including Bahrain, Kuwait,\nQatar, and Oman), Australia, Canada, Japan, Norway, Switzerland, UK, and EU\ncountries.\n\nRemittances sent home by overseas Pakistani workers saw a negative growth of\n3.0% in the fiscal year 2017 compared to the previous year when remittances\nreached an all-time high of 19.9 billion US dollars. This decline in\nremittances is mainly due to the adverse economic conditions in Arabian and\nGulf countries after the fall in oil prices in 2016. However, recent\ndevelopment activities in the Qatar FIFA World Cup, Dubai Expo, Saudi Arabia's\nimplementation of its Vision 2030, and particularly the recent visit of the PM\nto Kuwait should all be helpful in opening new avenues for employment in these\ncountries. Going forward, one can expect improvements in the coming years. The\nSBP's data showed that remittances amounted to $29.4 billion for the year\n2021. The government and SBP took measures to incentivise the use of formal\nchannels of sending money home. The orderly foreign exchange market conditions\nalso contributed to the rise in remittances. Remittances helped improve the\ncountry's external sector position despite the challenging global economic\nconditions due to the coronavirus pandemic.\n\nData is taken from SBP and Ministry of Finance.\n\n**Amounts are in billion US$**.  List  | FY 2008  | FY 2009  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nWorkers' remittances |  6.4  |  7.8  |  8.9  |  11.2  |  13.1  |  13.9  |  15.8  |  18.7  |  19.9  |  19.4  |  19.9  |  21.7  |  23.1  |  29.5  |  31.3  |  27.3  | 30.3\n\nRemittances sent home by overseas Pakistanis in the fiscal year 2020/21 are as\nfollows:\n\nCountry | (billion US$)\n---|---\nSaudi Arabia | 7.667\nUAE | 6.114\nUK | 4.067\nGulf Cooperation Council | 3.310\nUSA | 2.754\nEuropean Union | 2.709\nAustralia | 0.594\nCanada | 0.586\nMalaysia | 0.204\nNorway | 0.111\nJapan | 0.085\nSwitzerland | 0.041\nOther countries | 1.130"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.10",
    "section_name": "2022 Pakistan economic crisis",
    "text": "Pakistan bonds\nInverted yield curve in 2019–2020 and 2022  20 year 10 year 5 year 1 year | Pakistan inflation\n---|---"
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.11",
    "section_name": "Corruption",
    "text": "Corruption Perceptions Index for Pakistan compared to other countries, 2020\n\nCorruption is an ongoing issue in the government, with claims of initiatives\nagainst it, particularly at the government and lower levels of police forces.\nIn 2011, the country consistently ranked poorly on the Transparency\nInternational's Corruption Perceptions Index, with scores of 2.5, 2.3 in 2010,\nand 2.5 in 2009 out of 10. In 2011, Pakistan ranked 134th on the index, with\n42 countries ranking worse. In 2012, Pakistan's ranking dropped further from\n134 to 139, making Pakistan the 34th most corrupt country in the world, tied\nwith Azerbaijan, Kenya, Nepal, and Nigeria. However, during the Sharif regime\n(2013–17), Pakistan improved its ranking to 117th out of 180 countries in 2017\n(with an improvement in score from 28, 29, 30, 32, 32 [2013–17]), equal to\nEgypt (better than 59 countries). Due to the adverse effects of corruption on\nthe country, the National Accountability Bureau (NAB) was established in 1999.\nThe primary purpose of NAB was to recover looted money from corrupt elements\nand deposit it in the national exchequer. From 2018 to 2020, NAB recovered Rs\n502 billion from corrupt elements, a record achievement. Since the bureau's\ninception, NAB has recovered Rs 814 billion directly or indirectly from\ncorrupt elements, exceeding the recovery of other such anti-corruption\norganizations."
  },
  {
    "chapter_name": "Economy of Pakistan",
    "chapter_id": "1",
    "section_number": "1.12",
    "section_name": "Debt",
    "text": "Map of countries by external debt in US$, 2006\n\nAccording to the CIA World Factbook, in 2017, Pakistan ranked 57th in the\nworld in terms of public external debt to various international monetary\nauthorities (owing ~$107.527 billion in 2019), accounting for a total of 67.1%\nof GDP (in 2017).\n\nGovernment debt and liabilities data is sourced from the State Bank of\nPakistan.\n\nList  | Jun 2010  | Jun 2011  | Jun 2012  | Jun 2013  | Jun 2014  | Jun 2015  | Jun 2016  | Jun 2017  | Jun 2018  | Jun 2019  | Jun 2020  | Jun 2021  | Jun 2022  | Jun 2023  | Jun 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\n**(Amounts are in billion PKR.)**\nGross public debt |  9,010  |  10,771  |  12,697  |  14,292  |  15,991  |  17,380  |  19,677  |  21,409  |  24,953  |  32,708  |  36,399  |  39,866  |  49,242  |  62,881  | 71,246\nTotal debt of govt.  |  8,411  |  9,928  |  11,890  |  13,457  |  14,624  |  15,986  |  17,823  |  19,635  |  23,024  |  29,521  |  33,235  |  35,669  |  44,362  |  57,779  | 65,080\n**(Amounts are in billion US$.)**\nPublic external debt  |  53.6  |  57.9  |  55.9  |  51.2  |  54.7  |  54.7  |  61.4  |  66.1  |  75.4  |  83.9  |  87.9  |  95.2  |  100.0  |  94.9  |  98.3\n**As % of GDP**\nGross public debt  |  60.6  |  58.9  |  63.3  |  63.9  |  63.5  |  63.3  |  60.1  |  60.2  |  63.7  |  74.7  |  76.6  |  71.5  |  73.9  |  75.0  |  67.2\nTotal debt of govt.  |  56.6  |  54.3  |  59.3  |  60.1  |  58.1  |  58.3  |  54.5  |  55.2  |  58.7  |  67.4  |  69.9  |  63.9  |  66.6  |  68.9  |  61.4\nPublic external debt  |  30.8  |  27.2  |  26.4  |  22.7  |  21.5  |  20.3  |  19.6  |  19.5  |  23.4  |  31.2  |  31.1  |  26.9  |  30.5  |  32.3  |  25.8\n\nPakistan's external debt servicing includes the repayment of both the\nprincipal amount borrowed and the accrued interest.\n\nAmounts are in million US$.  List  | FY 2010  | FY 2011  | FY 2012  | FY 2013  | FY 2014  | FY 2015  | FY 2016  | FY 2017  | FY 2018  | FY 2019  | FY 2020  | FY 2021  | FY 2022  | FY 2023  | FY 2024\n---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---\nPrincipal  | 3,140  | 2,458  | 3,294  | 5,046  | 5,659  | 3,499  | 3,076  | 4,439  | 3,326  | 6,527  | 9,630  | 10,188  | 11,577  | 15,061  | 9,273\nInterest  | 1,015  | 1,074  | 1,019  | 933  | 909  | 1,172  | 1,346  | 1,626  | 2,317  | 2,951  | 3,229  | 2,229  | 2,985  | 4,421  | 5,457\nTotal  | 4,155  | 3,532  | 4,313  | 5,979  | 6,568  | 4,671  | 4,422  | 6,065  | 5,642  | 9,478  | 12,859  | 12,417  | 14,562  | 19,482  | 14,730"
  }
]