[
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( March 2015)_  \n---|---  \n  \nThe **economy of Libya** depends primarily on revenues from the petroleum\nsector, which represents over 95% of export earnings and 60% of GDP. These oil\nrevenues and a small population have given Libya one of the highest nominal\nper capita GDP in Africa.\n\nAfter 2000, Libya recorded favorable growth rates with an estimated 10.6%\ngrowth of GDP in 2010. This development was interrupted by the Libyan Civil\nWar, which resulted in contraction of the economy by 62.1% in 2011. After the\nwar, the economy rebounded by 104.5% in 2012. It crashed again following the\nSecond Libyan Civil War. As of 2024, Libya's per capita PPP GDP stands at only\n65% of its pre-war level in 2010.",
    "openai_summarised_points": [
      "• The economy of Libya is predominantly reliant on the petroleum sector, which accounts for over 95% of the country's export earnings and contributes approximately 60% to its Gross Domestic Product (GDP).",
      "• Libya's substantial oil revenues combined with its relatively small population have resulted in one of the highest nominal per capita GDP figures in the African continent.",
      "• Following the year 2000, Libya experienced favorable economic growth, culminating in an estimated GDP growth rate of 10.6% in 2010.",
      "• The onset of the Libyan Civil War in 2011 caused a severe economic contraction, with the GDP shrinking by 62.1% during that year.",
      "• In the aftermath of the civil war, Libya's economy demonstrated a significant recovery, expanding by 104.5% in 2012.",
      "• The economic recovery was short-lived as the outbreak of the Second Libyan Civil War led to another economic collapse.",
      "• By the year 2024, Libya's per capita GDP measured in Purchasing Power Parity (PPP) terms had declined to only 65% of its pre-war level recorded in 2010.",
      "• The article containing this information was noted as needing an update to reflect recent events or newly available data as of March 2015."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:09:00.676010",
      "openai_model": "gpt-4.1-mini",
      "content_length": 833,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macroeconomic trends",
    "text": "Libyan GDP per capita was about $40 in the early 1920s and it rose to $1,018\nby 1967. In 1947 alone, per capita GDP rose by 42 percent.\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund find them unreliable.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 97.8  | 32,745.5  | 40.2  | 13,449.6  | 0.6%  | 14.3%  | n/a  | n/a\n1981  | 85.6  | 27,398.5  | 34.7  | 11,107.6  | -20.0%  | 13.2%  | n/a  | n/a\n1982  | 92.3  | 28,202.7  | 34.6  | 10,575.6  | 1.5%  | 13.8%  | n/a  | n/a\n1983  | 91.4  | 26,800.2  | 33.0  | 9,671.5  | -4.7%  | 10.5%  | n/a  | n/a\n1984  | 86.8  | 24,406.1  | 30.9  | 8,681.2  | -8.3%  | 12.4%  | n/a  | n/a\n1985  | 90.1  | 25,471.4  | 30.4  | 8,586.4  | 0.6%  | 9.1%  | n/a  | n/a\n1986  | 81.5  | 22,172.1  | 24.8  | 6,734.0  | -11.4%  | 3.4%  | n/a  | n/a\n1987  | 71.2  | 18,585.1  | 23.0  | 6,002.1  | -14.7%  | 4.4%  | n/a  | n/a\n1988  | 79.3  | 18,346.5  | 25.9  | 5,981.6  | 7.6%  | 3.1%  | n/a  | n/a\n1989  | 88.4  | 19,550.0  | 27.4  | 6,070.1  | 7.2%  | 4.5%  | n/a  | n/a\n1990  | 95.1  | 22,327.7  | 31.6  | 7,424.2  | 3.7%  | 0.7%  | n/a  | 4.7%\n1991  | 116.3  | 26,685.3  | 35.0  | 8,026.3  | 18.3%  | 11.7%  | 19.8%  | 9.6%\n1992  | 113.6  | 25,468.7  | 35.5  | 7,950.5  | -4.5%  | 9.5%  | 20.0%  | 1.2%\n1993  | 109.9  | 24,106.1  | 31.9  | 6,998.3  | -5.5%  | 7.5%  | 20.0%  | -4.6%\n1994  | 115.9  | 24,921.7  | 29.7  | 6,391.1  | 3.2%  | 10.7%  | 19.9%  | -1.6%\n1995  | 100.1  | 21,064.9  | 33.7  | 7,102.9  | -15.4%  | 8.3%  | 20.0%  | 4.8%\n1996  | 103.7  | 21,422.2  | 36.8  | 7,608.8  | 1.8%  | 4.0%  | 19.8%  | 12.2%\n1997  | 102.7  | 20,872.4  | 37.7  | 7,663.0  | -2.6%  | 3.6%  | 19.8%  | -1.3%\n1998  | 103.1  | 20,587.9  | 30.9  | 6,171.8  | -0.7%  | 3.7%  | 19.8%  | -1.5%\n1999  | 104.4  | 20,511.0  | 37.1  | 7,294.5  | -0.2%  | 2.6%  | 19.7%  | 6.4%\n2000  | 111.1  | 21,444.4  | 39.5  | 7,625.0  | 4.0%  | -2.9%  | 19.7%  | 13.6%\n2001  | 116.6  | 22,161.2  | 35.2  | 6,693.1  | 2.6%  | -8.8%  | 19.7%  | 0.4%\n2002  | 114.0  | 21,343.2  | 21.1  | 3,956.5  | -3.7%  | -9.9%  | 19.6%  | 7.0%\n2003  | 135.0  | 24,905.2  | 27.0  | 4,986.3  | 16.1%  | -2.1%  | 19.5%  | 6.2%\n2004  | 146.7  | 26,626.3  | 34.1  | 6,180.4  | 5.8%  | 1.3%  | 19.5%  | 11.3%\n2005  | 167.4  | 29,942.7  | 48.9  | 8,739.2  | 10.6%  | 2.7%  | 19.4%  | 30.4%\n2006  | 173.0  | 30,408.6  | 60.1  | 10,561.4  | 0.3%  | 1.5%  | 19.4%  | 29.1%\n2007  | 188.8  | 32,659.5  | 68.2  | 11,801.3  | 6.2%  | 6.2%  | 19.4%  | 28.4%\n2008  | 192.1  | 32,666.6  | 86.8  | 14,762.6  | -0.2%  | 10.4%  | 19.4%  | 27.7%\n2009  | 184.8  | 31,007.5  | 60.8  | 10,202.8  | -4.4%  | 2.4%  | 19.4%  | -5.5%\n2010  | 196.4  | 32,515.4  | 75.4  | 12,478.0  | 5.0%  | 2.5%  | 19.3%  | 11.5%\n2011  | 99.6  | 16,810.9  | 48.2  | 8,132.3  | -50.3%  | 15.9%  | 19.4%  | -11.5%\n2012  | 172.5  | 27,458.8  | 92.5  | 14,728.1  | 86.8%  | 6.1%  | 19.0%  | 24.6%\n2013  | 144.5  | 23,054.5  | 75.4  | 12,025.6  | -18.0%  | 2.6%  | 19.5%  | -16.3%\n2014  | 126.9  | 20,273.6  | 57.4  | 9,166.6  | -23.0%  | 2.4%  | 19.5%  | -30.5%\n2015  | 137.2  | 21,709.9  | 48.7  | 7,706.7  | -0.8%  | 10.0%  | 19.5%  | -28.5%\n2016  | 137.4  | 21,520.7  | 49.9  | 7,817.6  | -1.5%  | 25.9%  | 19.5%  | -29.3%\n2017  | 154.4  | 23,949.3  | 67.2  | 10,414.1  | 32.5%  | 25.9%  | 19.4%  | -11.1%\n2018  | 170.7  | 26,207.0  | 76.7  | 11,773.8  | 7.9%  | 14.0%  | 19.5%  | 9.4%\n2019  | 154.3  | 23,454.9  | 69.2  | 10,526.3  | -11.2%  | -2.9%  | 19.7%  | 11.9%\n2020  | 110.1  | 16,575.1  | 46.9  | 7,056.7  | -29.5%  | 1.5%  | 20.1%  | -22.3%\n2021  | 147.1  | 21,929.0  | 39.0  | 5,813.3  | 28.3%  | 2.8%  | 19.6%  | 11.3%\n2022  | 128.4  | 18,944.7  | 40.8  | 6,025.7  | -18.5%  | 5.5%  | n/a  | 15.8%\n2023  | 156.7  | 22,899.5  | 43.8  | 6,391.8  | 17.9%  | 4.0%  | n/a  | 22.1%\n2024  | 172.8  | 24,997.2  | 45.6  | 6,599.0  | 8.0%  | 3.0%  | n/a  | 18.8%\n2025  | 188.8  | 27,034.7  | 47.7  | 6,836.3  | 7.2%  | 3.0%  | n/a  | 16.5%\n2026  | 200.5  | 28,434.6  | 49.1  | 6,964.6  | 4.2%  | 3.0%  | n/a  | 13.5%\n2027  | 212.8  | 29,874.1  | 50.5  | 7,096.0  | 4.1%  | 3.1%  | n/a  | 9.7%\n\nNotes:\n1\\. For purchasing power parity comparisons, the US Dollar is exchanged at\n0.77 Libyan Dinars only.\n\nMean wages were $9.51 per man-hour in 2009 (amounts to a compensation of $1598\nfor 21 working days of 8 hours).",
    "openai_summarised_points": [
      "• Libyan GDP per capita was approximately $40 in the early 1920s, increasing significantly to $1,018 by 1967, with a notable 42 percent rise in per capita GDP in 1947 alone.",
      "• The economic indicators for Libya from 1980 to 2021, including IMF staff estimates for 2022 to 2027, reveal fluctuations in GDP (both PPP and nominal), GDP per capita, real GDP growth, inflation rates, unemployment, and government debt as a percentage of GDP.",
      "• In 1980, Libya’s GDP was $97.8 billion PPP and $40.2 billion nominal, with a GDP per capita of $32,745.5 PPP and $13,449.6 nominal; real GDP growth was 0.6%, inflation was 14.3%, and unemployment and government debt data were not available.",
      "• The early 1980s saw volatile GDP growth with a sharp decline of -20.0% in 1981, followed by minor recoveries and contractions, with inflation rates consistently above 9% until 1986, when inflation dropped to 3.4%.",
      "• From 1987 to 1990, GDP growth fluctuated, with a significant contraction of -14.7% in 1987 and a recovery to 7.6% in 1988; inflation rates remained low, between 0.7% and 4.5%, and government debt was recorded at 4.7% of GDP in 1990.",
      "• The 1991 economic boom showed an 18.3% GDP growth, inflation at 11.7%, unemployment at 19.8%, and government debt rising to 9.6% of GDP.",
      "• The early to mid-1990s experienced negative GDP growth rates, including -4.5% in 1992 and -15.4% in 1995, with inflation ranging from 3.6% to 10.7%, unemployment steady at approximately 20%, and government debt fluctuating from -4.6% to 12.2% of GDP.",
      "• Between 1996 and 2000, Libya’s GDP growth was modest and occasionally negative, with inflation rates dropping below 5% by 1997 and turning negative in 2000 (-2.9%), unemployment remained around 19.7%, and government debt peaked at 30.4% of GDP in 2005.",
      "• The early 2000s saw a recovery with GDP growth reaching 16.1% in 2003 and inflation rates mostly negative or low, unemployment steady near 19.5%, and government debt varying between 0.4% and 30.4% of GDP.",
      "• From 2005 to 2010, Libya experienced positive GDP growth rates, peaking at 10.6% in 2005, with inflation generally below 7%, unemployment stable at 19.4%, and government debt fluctuating between 11.5% and 30.4% of GDP.",
      "• The year 2011 marked a severe economic contraction with a -50.3% GDP growth rate, inflation rising to 15.9%, unemployment at 19.4%, and government debt at -11.5% of GDP, reflecting the impact of political instability.",
      "• Post-2011, the economy showed volatility with GDP growth rebounding to 86.8% in 2012 but declining again in subsequent years, inflation rates varying widely from 2.4% to 25.9%, unemployment remaining near 19.5%, and government debt fluctuating significantly, reaching -30.5% of GDP in 2014.",
      "• The period 2015 to 2021 was characterized by negative or low GDP growth rates, with a sharp decline of -29.5% in 2020, inflation rates ranging from -2.9% to 25.9%, unemployment steady around 19.5% to 20.1%, and government debt varying from -29.3% to 24.6% of GDP.",
      "• IMF staff estimates for 2022 to 2027 project gradual GDP growth recovery from -18.5% in 2022 to 4.1% in 2027, inflation rates stabilizing around 3%, and government debt decreasing from 15.8% of GDP in 2022 to 9.7% in 2027; unemployment data for these years is not available.",
      "• The exchange rate for purchasing power parity comparisons is set at 0.77 Libyan Dinars to one US Dollar.",
      "• In 2009, the mean wage in Libya was $9.51 per man-hour, equating to a monthly compensation of approximately $1,598 based on 21 working days of 8 hours each."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:09:25.821099",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4684,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Oil sector",
    "text": "Development of oil production in Libya\n\nLibya is an OPEC member and holds the largest proven oil reserves in Africa\n(followed by Nigeria and Algeria), 41.5 Gbbl (6.60×109 m3) as of January 2007,\nup from 39.1 Gbbl (6.22×109 m3) in 2006. About 80% of Libya's proven oil\nreserves are located in the Sirte Basin, which is responsible for 90% of the\ncountry's oil output. The state-owned National Oil Corporation (NOC) dominates\nLibya's oil industry, along with smaller subsidiaries, which combined account\nfor around 50% of the country's oil output. Among NOC's subsidiaries, the\nlargest oil producer is the Waha Oil Company (WOC), followed by the Agoco,\nZueitina Oil Company (ZOC), and Sirte Oil Company (SOC). Oil resources, which\naccount for approximately 95% of export earnings, 75% of government receipts,\nand over 50% of GDP. Oil revenues constitute the principal foreign exchange\nsource. Reflecting the heritage of the command economy, three-quarters of\nemployment is in the public sector, and private investment remains small at\naround 2% of GDP.\n\nA map of world oil reserves according to U.S. EIA, 2017\n\nFalling world oil prices in the early 1980s and economic sanctions caused a\nserious decline in economic activity, eventually leading to a slow private\nsector rehabilitation. At 2.6% per year on average, real GDP growth was modest\nand volatile during the 1990s. Libya's GDP grew in 2001 due to high oil\nprices, the end of a long cyclical drought, and increased foreign direct\ninvestment following the suspension of UN sanctions in 1999. Real GDP growth\nhas been boosted by high oil revenues, reaching 4.6% in 2004 and 3.5% in 2005.\nDespite efforts to diversify the economy and encourage private sector\nparticipation, extensive controls of prices, credit, trade, and foreign\nexchange constrain growth.\n\nAlthough UN sanctions were suspended in 1999, foreign investment in the Libyan\ngas and oil sectors were severely curtailed due to the U.S. Iran and Libya\nSanctions Act (ILSA), which capped the amount foreign companies can invest in\nLibya yearly at $20 million (lowered from $40 million in 2001). As of May\n2006, the U.S. has removed Libya from its list of states that sponsor\nterrorism and has normalised ties and removed sanctions. This clears the road\nfor U.S. oil companies to exploit Libyan oil and is expected to have a\npositive impact on the Libyan economy. [1]\n\nThe NOC hopes to raise oil production from 1.80 million bpd in 2006 to 2\nmillion bpd by 2008. FDI into the oil sector is likely, which is attractive\ndue to its low cost of oil recovery, high oil quality, and proximity to\nEuropean markets. Most Libyan oil is sold on a term basis, including to the\ncountry's Oilinvest marketing network in Europe; to companies like Agip, OMV,\nRepsol YPF, Tupras, CEPSA, and Total; and small volumes to Asian and South\nAfrican companies.\n\nStatistic | Amount\n---|---\nProven Oil Reserves (2007E) | 41.5 Gbbl (6.60×10~~^~~ 9 m3)\nOil Production (2006E) | 1.8 million barrels per day (290×10~~^~~ 3 m3/d) (95% crude)\nOil Consumption (2006E) | 284,000 barrels per day (45,200 m3/d)\nNet Oil Exports (2006E) | 1.5 million barrels per day (240×10~~^~~ 3 m3/d)\nCrude Oil Distillation Capacity (2006E) | 378 kbbl/d (60.1×10~~^~~ 3 m3/d)\nProven Natural Gas Reserves (2007E) | 52.7×10~~^~~ 12 cu ft (1.49×1012 m3)\nNatural Gas Production (2006E) | 3,999×10~~^~~ 9 cu ft (1.132×1011 m3)\nNatural Gas consumption (2005E) | 206×10~~^~~ 9 cu ft (5.8×109 m3)\n\nNotes:\n1\\. Energy Information Administration (2007)",
    "openai_summarised_points": [
      "• Libya is a member of the Organization of the Petroleum Exporting Countries (OPEC) and possesses the largest proven oil reserves in Africa, totaling 41.5 billion barrels (6.60×10^9 m³) as of January 2007, an increase from 39.1 billion barrels (6.22×10^9 m³) in 2006.",
      "• Approximately 80% of Libya's proven oil reserves are situated in the Sirte Basin, which contributes to 90% of the nation's oil production.",
      "• The oil industry in Libya is predominantly controlled by the state-owned National Oil Corporation (NOC) and its subsidiaries, which collectively produce about 50% of the country's oil output.",
      "• Among the NOC subsidiaries, the Waha Oil Company (WOC) is the largest oil producer, followed by the Arabian Gulf Oil Company (Agoco), Zueitina Oil Company (ZOC), and Sirte Oil Company (SOC).",
      "• Oil resources constitute roughly 95% of Libya's export earnings, 75% of government revenues, and over 50% of the Gross Domestic Product (GDP), making oil revenues the principal source of foreign exchange.",
      "• Reflecting Libya's command economy legacy, about 75% of employment is in the public sector, while private investment remains minimal at approximately 2% of GDP.",
      "• In the early 1980s, falling global oil prices combined with economic sanctions led to a significant decline in Libya's economic activity, resulting in a gradual rehabilitation of the private sector.",
      "• During the 1990s, Libya experienced modest and volatile real GDP growth averaging 2.6% per year.",
      "• Libya's GDP growth improved in 2001 due to elevated oil prices, the end of a prolonged drought cycle, and increased foreign direct investment following the suspension of United Nations sanctions in 1999.",
      "• Real GDP growth was further stimulated by high oil revenues, reaching 4.6% in 2004 and 3.5% in 2005.",
      "• Despite government efforts to diversify the economy and promote private sector participation, extensive controls over prices, credit, trade, and foreign exchange continue to restrict economic growth.",
      "• Although UN sanctions were lifted in 1999, foreign investment in Libya's oil and gas sectors remained limited due to the U.S. Iran and Libya Sanctions Act (ILSA), which capped annual foreign investments at $20 million, reduced from $40 million in 2001.",
      "• In May 2006, the United States removed Libya from its list of state sponsors of terrorism, normalized diplomatic relations, and lifted sanctions, thereby facilitating the entry of U.S. oil companies into the Libyan market and expectedly benefiting the Libyan economy.",
      "• The National Oil Corporation aimed to increase oil production from 1.80 million barrels per day (bpd) in 2006 to 2 million bpd by 2008.",
      "• Libya's oil sector is attractive for foreign direct investment due to its low oil recovery costs, high-quality crude oil, and geographic proximity to European markets.",
      "• Most Libyan oil is sold on a term basis through the country's Oilinvest marketing network in Europe and to international companies such as Agip, OMV, Repsol YPF, Tupras, CEPSA, and Total, with smaller volumes sold to Asian and South African firms.",
      "• Key statistics for Libya's oil and gas sector as of 2006-2007 include:",
      "• Proven Oil Reserves (2007 estimate): 41.5 billion barrels (6.60×10^9 m³)",
      "• Oil Production (2006 estimate): 1.8 million barrels per day (290,000 m³/day), with 95% being crude oil",
      "• Oil Consumption (2006 estimate): 284,000 barrels per day (45,200 m³/day)",
      "• Net Oil Exports (2006 estimate): 1.5 million barrels per day (240,000 m³/day)",
      "• Crude Oil Distillation Capacity (2006 estimate): 378,000 barrels per day (60,100 m³/day)",
      "• Proven Natural Gas Reserves (2007 estimate): 52.7 trillion cubic feet (1.49×10^12 m³)",
      "• Natural Gas Production (2006 estimate): 3.999 trillion cubic feet (1.132×10^11 m³)",
      "• Natural Gas Consumption (2005 estimate): 206 billion cubic feet (5.8×10^9 m³)",
      "• These data are sourced from the U.S. Energy Information Administration (EIA) as of 2007."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:09:41.301428",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3501,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Field Development and Exploration",
    "text": "Oil is Libya's major resource.\n\nIn November 2005, Repsol YPF discovered a significant oil deposit of light,\nsweet crude in the Murzuq Basin. Industry experts believe the discovery to be\none of the biggest made in Libya for several years. Repsol YPF is joined by a\nconsortium of partners including OMV, Total and Norsk Hydro. Also located in\nMurzuq Basin is Eni's Elephant field. In October 1997, a consortium led by\nBritish company Lasmo, along with Eni and a group of five South Korean\ncompanies, announced that it had discovered large recoverable crude reserves\nabout 800 kilometres (500 mi) south of Tripoli. Lasmo estimated field\nproduction would cost around $1 per barrel. Elephant began production in\nFebruary 2004.\n\nWOC's Waha fields currently produce around 350,000 bbl/d (56,000 m3/d). In\n2005, ConocoPhillips and co-venturers reached an agreement with NOC to return\nto its operations in Libya and extend the Waha concession 25 years.\nConocoPhillips operates the Waha fields with a 16.33% share in the project.\nNOC has the largest share of the Waha concession, and additional partners\ninclude Marathon and Amerada Hess.",
    "openai_summarised_points": [
      "• Oil constitutes the primary natural resource and economic driver for Libya, underpinning the country's energy sector and export revenues.",
      "• In November 2005, Repsol YPF discovered a significant deposit of light, sweet crude oil in the Murzuq Basin, marking one of the largest oil discoveries in Libya in several years according to industry experts.",
      "• The Repsol YPF discovery in the Murzuq Basin is supported by a consortium of partners including OMV, Total, and Norsk Hydro, indicating a collaborative international investment in Libyan oil exploration.",
      "• The Murzuq Basin also hosts the Elephant oil field, operated by the Italian energy company Eni, highlighting the basin's strategic importance for Libya's oil production.",
      "• In October 1997, a consortium led by the British company Lasmo, together with Eni and a group of five South Korean companies, announced the discovery of large recoverable crude oil reserves approximately 800 kilometers (500 miles) south of Tripoli.",
      "• Lasmo estimated that production costs at the Elephant field would be approximately $1 per barrel, suggesting highly economical extraction potential.",
      "• The Elephant oil field commenced production in February 2004, contributing to Libya's overall oil output.",
      "• The Waha oil fields, operated by the Western Oil Company (WOC), currently produce around 350,000 barrels per day (56,000 cubic meters per day), representing a significant portion of Libya's oil production capacity.",
      "• In 2005, ConocoPhillips and its co-venturers reached an agreement with the National Oil Corporation (NOC) to resume operations in Libya and extend the Waha concession for an additional 25 years, reflecting renewed foreign investment and long-term commitment.",
      "• ConocoPhillips holds a 16.33% operational share in the Waha fields project, demonstrating its active role in Libyan oil production.",
      "• The National Oil Corporation (NOC) maintains the largest share of the Waha concession, underscoring its dominant position in Libya's oil sector.",
      "• Other partners involved in the Waha concession include Marathon Oil and Amerada Hess, indicating a consortium-based approach to field development and exploration in Libya."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:09:45.806671",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1128,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Refining and Downstream",
    "text": "Libya has five domestic refineries:\n\nRefinery | Capacity | Operator\n---|---|---\nZawia Refinery | 120,000 | ZOC\nRas Lanuf Refinery | 220,000 | Ras Lanuf\nEl-Brega Refinery | 10,000 | SOC\nTobruk Refinery | 20,000 | Agoco\nSarir Refinery | 10,000 | Agoco\n\nNotes:\n1\\. Amounts in barrels per day.",
    "openai_summarised_points": [
      "• Libya operates five domestic oil refineries with varying processing capacities and operators.",
      "• The Zawia Refinery has a processing capacity of 120,000 barrels per day and is operated by the Zawia Oil Company (ZOC).",
      "• The Ras Lanuf Refinery is the largest in Libya, with a capacity of 220,000 barrels per day, and is operated by the Ras Lanuf company.",
      "• The El-Brega Refinery processes 10,000 barrels per day and is operated by the state-owned National Oil Corporation (SOC).",
      "• The Tobruk Refinery has a capacity of 20,000 barrels per day and is operated by the Arabian Gulf Oil Company (Agoco).",
      "• The Sarir Refinery also has a capacity of 10,000 barrels per day and is operated by Agoco.",
      "• All refinery capacities are measured in barrels per day, reflecting Libya’s domestic refining capabilities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:09:49.493249",
      "openai_model": "gpt-4.1-mini",
      "content_length": 289,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Diversification",
    "text": "Pivot irrigation in Kufra, southeast Cyrenaica. Oil wealth has enabled Libya\nto pursue extravagant projects such as agriculture and the Great Manmade River\nin the Sahara Desert. Modern buildings in Tripoli before the wars, 2009\n\nIn 2007, mining and hydrocarbon industries accounted for well over 95 percent\nof the Libyan economy.[_citation needed_] Diversification of the economy into\nmanufacturing industries remain a long-term issue.\n\nAlthough agriculture is the second-largest sector in the economy, Libya\ndepends on imports in most foods. Climatic conditions and poor soils severely\nlimit farm output, and domestic food production meets only about 25% of\ndemand. Domestic conditions limit output, while higher incomes and a growing\npopulation have caused food consumption to rise. Because of low rainfall\nlevels in Libya, agricultural projects such as the Kufra oasis rely on\nunderground water sources. Libya's primary agricultural water source remains\nthe Great Manmade River (GMMR), but significant resources are being invested\nin desalinization research to meet growing demand. Libyan agricultural\nprojects and policies are overseen by a General Inspector; there is no\nMinistry of Agriculture, _per se_.\n\nLibya produced in 2018:\n\n* 348 thousand tons of potato;\n* 236 thousand tons of watermelon;\n* 215 thousand tons of tomato;\n* 188 thousand tons of olive;\n* 183 thousand tons of onion;\n* 176 thousand tons of date;\n* 138 thousand tons of wheat;\n* 93 thousand tons of barley;\n* 72 thousand tons of vegetable;\n* 60 thousand tons of plum;\n* 53 thousand tons of orange;\n\nIn addition to smaller productions of other agricultural products.",
    "openai_summarised_points": [
      "• In 2007, mining and hydrocarbon industries constituted well over 95 percent of Libya's economy, highlighting the country's heavy reliance on these sectors for economic activity.",
      "• Economic diversification into manufacturing industries remains a long-term challenge for Libya, indicating limited progress beyond the dominant mining and hydrocarbon sectors.",
      "• Agriculture is the second-largest sector in Libya's economy, yet the country depends heavily on food imports due to climatic constraints and poor soil quality that severely limit domestic farm output.",
      "• Domestic food production in Libya meets only about 25 percent of the national demand, reflecting a significant gap between local agricultural capacity and consumption needs.",
      "• Rising food consumption in Libya is driven by higher incomes and a growing population, exacerbating the reliance on imported food products.",
      "• Libya experiences low rainfall levels, making agricultural projects such as those in the Kufra oasis reliant on underground water sources for irrigation.",
      "• The Great Manmade River (GMMR) is Libya’s primary agricultural water source, supplying vital water resources for farming in the Sahara Desert region.",
      "• Significant investments are being directed towards desalinization research in Libya to address the increasing demand for water in agricultural and other sectors.",
      "• Agricultural projects and policies in Libya are managed by a General Inspector, as the country does not have a formal Ministry of Agriculture.",
      "• In 2018, Libya produced 348 thousand tons of potatoes, making it the highest quantity among listed agricultural products.",
      "• Watermelon production in Libya reached 236 thousand tons in 2018, ranking as the second-largest crop by volume.",
      "• Tomato production was recorded at 215 thousand tons in 2018, indicating substantial cultivation of this vegetable.",
      "• Olive production in Libya amounted to 188 thousand tons in 2018, reflecting the importance of olives in the agricultural sector.",
      "• Onion production totaled 183 thousand tons in 2018, contributing significantly to Libya’s vegetable output.",
      "• Date production was 176 thousand tons in 2018, underscoring the role of date palms in Libyan agriculture.",
      "• Wheat production reached 138 thousand tons in 2018, indicating limited but notable cereal crop cultivation.",
      "• Barley production was 93 thousand tons in 2018, supplementing the cereal crop output in Libya.",
      "• Vegetable production overall was 72 thousand tons in 2018, encompassing various types of vegetables beyond those individually listed.",
      "• Plum production was 60 thousand tons in 2018, representing a smaller but significant fruit crop.",
      "• Orange production in Libya was 53 thousand tons in 2018, contributing to the country’s citrus fruit output.",
      "• Libya also produced smaller quantities of other agricultural products in 2018, demonstrating some diversity in its agricultural sector beyond the major crops listed."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:00.141990",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1641,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Tourism",
    "text": "The tourism industry was heavily hit by the Libyan Civil War. Before the war\ntourism was developing, with 149,000 tourists visiting Libya in 2004, rising\nto 180,000 in 2007, although this still only contributed less than 1% of the\ncountry's GDP. There were 1,000,000 day visitors in the same year. The country\nis best known for its ancient Greek and Roman ruins and Sahara desert\nlandscapes.",
    "openai_summarised_points": [
      "• The tourism industry in Libya experienced a significant decline due to the impact of the Libyan Civil War.",
      "• Prior to the conflict, the tourism sector was showing signs of development, with the number of tourists increasing from 149,000 in 2004 to 180,000 in 2007.",
      "• Despite this growth, tourism contributed less than 1% to Libya's Gross Domestic Product (GDP) during that period.",
      "• In addition to overnight tourists, Libya received approximately 1,000,000 day visitors in 2007.",
      "• Libya's tourism appeal primarily stems from its ancient Greek and Roman archaeological ruins as well as its distinctive Sahara desert landscapes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:03.726686",
      "openai_model": "gpt-4.1-mini",
      "content_length": 391,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Labor market",
    "text": "Libya posted a 3.3% rate of population growth during 1960–2003. In 2003, 86%\nof the population was urban, compared to 45% in 1970. Although no reliable\nestimates are available, unemployment is reportedly acute: over 50% of the\npopulation under the age of 20. Moreover, despite the bias of labor market\nregulations favoring Libyan workers, the mismatch of the educational system\nwith market demand has produced a large pool of expatriate workers, with\ntypically better-suited education and higher productivity. However, because of\nshortages for manual labor, Libya has also attracted important numbers of less\nskilled immigrants. Expatriate workers represent an estimated fifth of the\nlabor force.\n\nAlthough significant, the proportion of expatriate workers is still below oil\nproducing countries in the Persian Gulf. Foreign workers mainly come from the\nMaghreb, Egypt, Turkey, India, the Philippines, Malaysia, Thailand, Vietnam,\nPoland, Chad, Sudan, and Bosnia and Herzegovina. They tend to earn relatively\nhigh wages, taking either skilled or hard manual jobs. Census data for 2000\nshow the share of expatriates earning over LD 300 (US$230) per month was 20%,\ncompared to 12% for Libyan nationals. A campaign encouraging conversion of\nqualified civil servants to entrepreneurs, in the face of public sector over\nemployment and declining productivity, does not seem to be producing the\ndesired results thus far.",
    "openai_summarised_points": [
      "• Libya experienced a population growth rate of 3.3% annually during the period from 1960 to 2003.",
      "• In 2003, 86% of Libya’s population was urban, a significant increase from 45% urbanization recorded in 1970.",
      "• Unemployment in Libya is reportedly acute, particularly among the youth, with over 50% of the population under the age of 20 being unemployed, although no reliable estimates are available.",
      "• Labor market regulations in Libya favor Libyan workers; however, a mismatch between the educational system and market demand has resulted in a large pool of expatriate workers who generally have better-suited education and higher productivity.",
      "• Due to shortages in manual labor, Libya has attracted a significant number of less skilled immigrant workers alongside skilled expatriates.",
      "• Expatriate workers constitute an estimated 20% (one-fifth) of Libya’s total labor force.",
      "• Despite the notable presence of expatriate workers, their proportion remains lower than that found in oil-producing countries of the Persian Gulf.",
      "• The majority of foreign workers in Libya originate from countries including the Maghreb region, Egypt, Turkey, India, the Philippines, Malaysia, Thailand, Vietnam, Poland, Chad, Sudan, and Bosnia and Herzegovina.",
      "• Expatriate workers in Libya tend to earn relatively high wages and occupy either skilled positions or demanding manual labor jobs.",
      "• According to census data from the year 2000, 20% of expatriate workers earned over LD 300 (equivalent to US$230) per month, compared to only 12% of Libyan nationals earning above this threshold.",
      "• A government campaign aimed at encouraging qualified civil servants to transition into entrepreneurship, intended to address issues of public sector overemployment and declining productivity, has so far failed to achieve significant results."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:13.352401",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1413,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "External trade and finance",
    "text": "Libyan export destinations in 2006.\n\nThe Government is in the process of preparing a financial sector reform\nprogram. Recent legislation setting corporate governance standards for\nfinancial institutions makes progress towards better management and greater\noperational independence of public banks. However, Libyan public banks still\nlack management structures supported by skills in critical areas like credit,\ninvestment, risk management, and information and control systems.\n\nThe new banking law reinforces the independence of the Central Bank of Libya\n(CBL) and offers a legal framework for regulating banking activities, even if\nsome provisions call for improvement. Despite progress brought by the new\nbanking Law that specifies and limits its duties and responsibilities, the CBL\nremains the owner of the public banks, with the associated potential conflict\nof interest between ownership and regulation.\n\nFinancial sector reform has also progressed with partial interest rate\nliberalization. Interest rates have been liberalized on deposits, while a\nlending rate ceiling has been set above the discount rate. The Libyan Stock\nExchange, established in 2007, is the first exchange of its kind in the\ncountry.\n\nIn 2011, Libya Oil Holdings had its €38m stake in Irish exploration firm\nCircle Oil frozen on foot of a European Union order that's been put in place\nto put pressure on the Gaddafi regime.\n\nTunisia's exports to Libya, exceeding 18% growth between 2020 and 2024.\n\nTwo trans-African automobile routes pass through Libya:\n\n* Cairo-Dakar Highway\n* Tripoli-Cape Town Highway",
    "openai_summarised_points": [
      "• In 2006, Libya had specific export destinations that shaped its external trade profile, although detailed country-specific data from that year is not provided in this section.",
      "• The Libyan Government is actively preparing a financial sector reform program aimed at improving the overall management and operational independence of financial institutions.",
      "• Recent legislation has introduced corporate governance standards for financial institutions, marking progress toward better management practices and increased autonomy for public banks in Libya.",
      "• Despite legislative progress, Libyan public banks continue to suffer from inadequate management structures and lack essential skills in critical areas such as credit analysis, investment decision-making, risk management, and information and control systems.",
      "• The new banking law in Libya strengthens the independence of the Central Bank of Libya (CBL) and establishes a legal framework for regulating banking activities, although some provisions within the law require further improvement.",
      "• Although the new banking law clarifies and limits the duties and responsibilities of the CBL, the Central Bank remains the owner of public banks, creating a potential conflict of interest between its regulatory role and ownership responsibilities.",
      "• Financial sector reforms have included partial liberalization of interest rates: deposit interest rates have been liberalized, while a ceiling has been imposed on lending rates, set above the discount rate.",
      "• The Libyan Stock Exchange was established in 2007, representing the first stock exchange of its kind in the country and marking a significant development in Libya’s financial sector infrastructure.",
      "• In 2011, Libya Oil Holdings had its €38 million stake in the Irish exploration firm Circle Oil frozen under a European Union order, which was part of sanctions aimed at pressuring the Gaddafi regime during the political crisis.",
      "• Between 2020 and 2024, Tunisia’s exports to Libya experienced growth exceeding 18%, highlighting Libya’s importance as a trading partner in the region.",
      "• Libya is a key transit country for two major trans-African automobile routes: the Cairo-Dakar Highway and the Tripoli-Cape Town Highway, facilitating continental trade and transport connectivity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:21.851139",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1583,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Statistics",
    "text": "**Household income or consumption by percentage share:**\n_lowest 11%:_ NA%\n_highest 10%:_ NA%\n\n**Industrial production growth rate:** 2.7% (2009)\n\n**Electricity - production:** 24 billion kWh (2007 est)\n\n**Electricity - production by source:**\n_fossil fuel:_ 100%\n_hydro:_ 0%\n_nuclear:_ 0%\n_other:_ 0% (1998)\n\n**Electricity - consumption:** 22.17 billion kWh (2007 est)\n\n**Electricity - exports:** 104 million kWh (2007)\n\n**Electricity - imports:** 77 million kWh (2007)\n\n**Agriculture - products:** wheat, barley, olives, dates, citrus, vegetables,\npeanuts, soybeans, cattle, corn",
    "openai_summarised_points": [
      "• Household income or consumption by percentage share data for Libya is not available for both the lowest 11% and the highest 10% segments.",
      "• Libya's industrial production growth rate was recorded at 2.7% in the year 2009.",
      "• The total electricity production in Libya was estimated at 24 billion kilowatt-hours (kWh) in 2007.",
      "• In 1998, Libya's electricity production was entirely dependent on fossil fuels, accounting for 100% of the production, with no contribution from hydroelectric, nuclear, or other sources.",
      "• Electricity consumption in Libya was estimated at 22.17 billion kWh in 2007.",
      "• Libya exported 104 million kWh of electricity in 2007.",
      "• Electricity imports into Libya amounted to 77 million kWh in 2007.",
      "• The primary agricultural products of Libya include wheat, barley, olives, dates, citrus fruits, vegetables, peanuts, soybeans, cattle, and corn."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:27.184789",
      "openai_model": "gpt-4.1-mini",
      "content_length": 581,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Libya",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "International rankings",
    "text": "Organisation  | Survey  | Ranking\n---|---|---\n_The Economist_ | The World in 2005 - Worldwide quality-of-life index, 2005 | 70 out of 111\nEnergy Information Administration | Greatest Oil Reserves by Country, 2006 | 9 out of 20\nReporters Without Borders | Press Freedom Index (2007) | 155 out of 169\nTransparency International | Corruption Perceptions Index 2007 | 131 out of 180\nUnited Nations Development Programme | Human Development Index 2005 | 58 out of 177",
    "openai_summarised_points": [
      "• According to The Economist's \"The World in 2005\" Worldwide Quality-of-Life Index, Libya was ranked 70th out of 111 countries in the year 2005.",
      "• The Energy Information Administration ranked Libya 9th out of 20 countries in terms of greatest oil reserves by country in 2006.",
      "• Reporters Without Borders placed Libya at 155th out of 169 countries in the Press Freedom Index for the year 2007.",
      "• Transparency International's Corruption Perceptions Index for 2007 ranked Libya 131st out of 180 countries.",
      "• The United Nations Development Programme ranked Libya 58th out of 177 countries on the Human Development Index in 2005."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:10:30.863048",
      "openai_model": "gpt-4.1-mini",
      "content_length": 462,
      "bullet_points_count": 5
    }
  }
]