[
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofTogo** has struggled greatly. The International Monetary Fund\n(IMF) ranks it as the tenth poorest country in the world, with development\nundercut by political instability, lowered commodity prices, and external\ndebts. While industry and services play a role, the economy is dependent on\nsubsistence agriculture, with industrialization and regional banking suffering\nmajor setbacks.\n\nIn January 2017, the IMF signed an Extended Credit Facility arrangement,\nconsisting of a three-year $238 million loan package. Progress depends on\nfollow through on privatization, increased transparency in government\nfinancial operations, progress toward legislative elections, and continued\nsupport from foreign donors."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "The majority of the Togolese population depends on subsistence agriculture.\nIts agricultural products includes coffee, cocoa, cotton, yams, cassava\n(tapioca), corn, beans, rice, pearl millet, sorghum and livestock such as\nfish. Food and cash crop production employs the majority of the labor force\nand contributes about 42% to the gross domestic product (GDP). Coffee and\ncocoa are traditionally the major cash crops for export, but cotton\ncultivation increased rapidly in the 1990s, with 173,000 metric tons produced\nin 1999.\n\nAfter a disastrous harvest in 2001 (113,000 metric tons), cash crops\nproduction rebounded to 168,000 metric tons in 2002. Despite insufficient\nrainfall in some areas, the Togolese Government has achieved its goal of self-\nsufficiency in food crops — maize, cassava, yams, sorghum, pearl millet, and\ngroundnut. Small and medium-sized farms produce most of the food crop; the\naverage farm size is one to three hectares.\n\nTogo produced in 2018:\n\n* 1 million tons of cassava;\n* 886 thousand tons of maize;\n* 858 thousand tons of yam;\n* 277 thousand tons of sorghum;\n* 207 thousand tons of beans;\n* 156 thousand tons of palm oil;\n* 143 thousand tons of vegetable;\n* 145 thousand tons of rice;\n* 127 thousand tons of cotton;\n* 43 thousand tons of peanut;\n* 41 thousand tons of cocoa;\n* 26 thousand tons of millet;\n* 26 thousand tons of banana;\n* 21 thousand tons of coffee;\n\nIn addition to smaller productions of other agricultural products.\n\nChoco Togo is the country's first bean-to-bar chocolate manufacturer."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Mining",
    "text": "In the industrial sector, phosphates are Togo's most important commodity, and\nthe country has an estimated 60 million metric tons of phosphate reserves.\nFrom a high point of 2.7 million tons in 1997, production dropped to\napproximately 1.1 million tons in 2002. The fall in production is partly the\nresult of the depletion of easily accessible deposits and the lack of funds\nfor new investment. The formerly state-run company Société Nouvelle des\nPhosphates du Togo (New Phosphate Company of Togo) appears to have benefited\nfrom private management, which took over in 2001. Togo also has substantial\nlimestone and marble deposits.\n\nEncouraged by the commodity boom of the mid-1970s, which resulted in a\nfourfold increase in phosphate prices and sharply increased government\nrevenues, Togo embarked on an overly ambitious program of large investments in\ninfrastructure while pursuing industrialization and development of state\nenterprises in manufacturing, textiles, and beverages. However, following\ndeclines in world prices for commodities, its economy became burdened with\nfiscal imbalances, heavy borrowing, and unprofitable state enterprises."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Other",
    "text": "While Togo itself produces no crude oil, it is the namesake of an illegal\nmarket for stolen oil off the Niger Delta, called the Togo Triangle."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "IMF relationship",
    "text": "Togo turned to the IMF for assistance in 1979, while simultaneously\nimplementing a stringent adjustment effort with the help of a series of IMF\nstandby programs, World Bank loans, and Paris Club debt rescheduling. Under\nthese programs, the Togolese Government introduced a series of austerity\nmeasures and major restructuring goals for the state enterprise and rural\ndevelopment sectors. These reforms were aimed at eliminating most state\nmonopolies, simplifying taxes and customs duties, curtailing public\nemployment, and privatizing major state enterprises. Togo made good progress\nunder the international financial institutions' programs in the late 1980s,\nbut movement on reforms ended with the onset of political instability in 1990.\nWith a new, elected government in place, Togo negotiated new 3-year programs\nwith the World Bank and IMF in 1994.\n\nTogo returned to the Paris Club in 1995 and received Naples terms, the club's\nmost concessionary rates. With the economic downturn associated with Togo's\npolitical problems, scheduled external debt service obligations for 1994 were\ngreater than 100% of projected government revenues (excluding bilateral and\nmultilateral assistance). By 2001, Togo was embarked on an IMF Staff Monitored\nProgram designed to restore macroeconomic stability and financial discipline\nbut without any new IMF resources pending new legislative elections. New IMF,\nWorld Bank and Africa Development Bank (ADB) lending must await the\nwillingness of Togo's traditional donors – the European Union, principally,\nbut the US also – to resume aid flows. So far, Togo's problematic legislative\nand presidential elections and the government's continued unwillingness to\ntransition from an Eyadéma-led autocracy to democracy have deterred these\ndonors from providing Togo with more aid. As of the fall 2002, Togo was $15\nmillion in arrears to the World Bank and owed $3 million to the ADB.\n\nTogo is one of 16 members of the Economic Community of West African States\n(ECOWAS). The ECOWAS development fund is based in Lomé. Togo also is a member\nof the West African Economic and Monetary Union (UEMOA), which groups seven\nWest African countries using the CFA franc. The West African Development Bank\n(BOAD), which is associated with UEMOA, is based in Lomé. Togo long served as\na regional banking center, but that position has been eroded by the political\ninstability and economic downturn of the early 1990s. Historically, France has\nbeen Togo's principal trading partner, although other European Union countries\nare important to Togo's economy. Total United States trade with Togo amounts\nto about $16 million annually."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Open Market",
    "text": "Trade is extremely important to Togo's economy; the combined value of exports\nand imports equals 105 percent of GDP. The average applied tariff rate is 11.4\npercent. Non-tariff barriers impede some trade. Government openness to foreign\ninvestment is above average. Capital transactions are subject to some controls\nor government approval. The evolving banking system continues to expand but\nlacks liquidity."
  },
  {
    "chapter_name": "Economy of Togo",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Statistics",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in bil. US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n**1980** | 2.6  | 934  | 2.0  | −2.3%  | 12.3%  | n/a\n**1981** | 2.8  | 955  | 1.7  | −3.4%  | 19.7%  | n/a\n**1982** | 2.8  | 942  | 1.4  | −3.7%  | 11.1%  | n/a\n**1983** | 2.8  | 898  | 1.3  | −5.2%  | 9.4%  | n/a\n**1984** | 3.1  | 953  | 1.2  | 5.9%  | −3.5%  | n/a\n**1985** | 3.3  | 988  | 1.3  | 3.7%  | −1.8%  | n/a\n**1986** | 3.5  | 1,009  | 1.8  | 3.3%  | 4.1%  | n/a\n**1987** | 3.5  | 978  | 2.1  | −2.5%  | 0.1%  | n/a\n**1988** | 4.0  | 1,082  | 2.3  | 10.1%  | -0.2%  | n/a\n**1989** | 4.3  | 1,137  | 2.3  | 4.1%  | -1.0%  | n/a\n**1990** | 4.7  | 1,213  | 2.8  | 5.9%  | 1.1%  | n/a\n**1991** | 4.8  | 1,210  | 2.7  | −0.6%  | 0.2%  | n/a\n**1992** | 4.8  | 1,164  | 2.9  | −3.2%  | 1.6%  | n/a\n**1993** | 4.1  | 1,004  | 2.2  | −16.3%  | -0.1%  | n/a\n**1994** | 4.8  | 1,165  | 1.7  | 13.9%  | 35.3%  | n/a\n**1995** | 5.8  | 1,361  | 2.2  | 19.7%  | 15.8%  | n/a\n**1996** | 5.7  | 1,282  | 2.4  | −3.9%  | 4.6%  | n/a\n**1997** | 6.0  | 1,311  | 2.5  | 3.8%  | 5.3%  | n/a\n**1998** | 6.0  | 1,258  | 2.4  | −2.3%  | 1.0%  | n/a\n**1999** | 6.2  | 1,271  | 2.4  | 2.5%  | −0.1%  | n/a\n**2000** | 6.3  | 1,251  | 2.0  | −1.0%  | 1.6%  | n/a\n**2001** | 6.5  | 1,256  | 2.0  | 0.8%  | 5.1%  | n/a\n**2002** | 6.8  | 1,290  | 2.3  | 3.8%  | 2.7%  | n/a\n**2003** | 7.4  | 1,368  | 2.9  | 6.7%  | −0.9%  | n/a\n**2004** | 7.5  | 1,354  | 3.0  | −1.0%  | 0.7%  | n/a\n**2005** | 7.4  | 1,298  | 3.1  | −4.7%  | 5.3%  | 63.1%\n**2006** | 7.8  | 1,335  | 3.2  | 2.7%  | 1.1%  | 67.7%\n**2007** | 8.2  | 1,349  | 3.8  | 1.2%  | 0.4%  | 70.5%\n**2008** | 8.6  | 1,390  | 4.6  | 4.0%  | 7.7%  | 67.3%\n**2009** | 9.2  | 1,434  | 4.7  | 5.5%  | 4.1%  | 57.6%\n**2010** | 9.8  | 1,496  | 4.8  | 5.9%  | 0.2%  | 33.5%\n**2011** | 10.6  | 1,573  | 5.4  | 5.8%  | 3.6%  | 33.8%\n**2012** | 11.5  | 1,660  | 5.4  | 6.3%  | 2.6%  | 34.3%\n**2013** | 12.4  | 1,741  | 6.0  | 5.8%  | 1.8%  | 41.1%\n**2014** | 13.3  | 1,825  | 6.4  | 5.6%  | 0.2%  | 44.9%\n**2015** | 14.2  | 1,894  | 5.8  | 5.5%  | 1.8%  | 52.4%\n**2016** | 15.1  | 1,972  | 6.1  | 5.7%  | 0.9%  | 59.9%\n**2017** | 16.0  | 2,037  | 6.4  | 4.0%  | −0.2%  | 57.1%\n**2018** | 17.1  | 2,122  | 7.0  | 4.8%  | 0.9%  | 58.0%\n**2019** | 18.7  | 2,274  | 7.0  | 4.9%  | 0.7%  | 54.9%\n**2020** | 20.4  | 2,417  | 7.4  | 2.0%  | 1.8%  | 62.2%\n**2021** | 22.9  | 2,644  | 8.3  | 6.0%  | 4.5%  | 64.9%\n**2022** | 25.9  | 2,926  | 8.1  | 5.8%  | 7.6%  | 67.4%\n**2023** | 28.3  | 3,125  | 9.1  | 5.6%  | 5.3%  | 68.0%\n**2024** | 30.6  | 3,290  | 9.8  | 5.3%  | 2.7%  | 69.7%"
  }
]