[
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article **needs additional citations forverification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed.  \n_Find sources:_ \"Economy of Madagascar\" – news **·** newspapers **·** books\n**·** scholar **·** JSTOR _( February 2015)__(Learn how and when to remove\nthis message)_  \n---|---  \n| This article **focuses too much on specific examples**. Please help improve\nthis article by adding sources that evaluate within a broader context. _(\nMarch 2015)_  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nChange in per capita GDP of Madagascar, 1950–2018. Figures are inflation-\nadjusted to 2011 International dollars.\n\nThe **economy ofMadagascar** is US$9.769 billion by gross domestic product as\nof 2020, being a market economy and is supported by an agricultural industry\nand emerging tourism, textile and mining industries. Malagasy agriculture\nproduces tropical staple crops such as rice and cassava, as well as cash crops\nsuch as vanilla and coffee.\n\nMalagasy exports from customs protocol in some areas, notably the United\nStates and the European Union. These exemptions have supported the growth of\nthe Malagasy textile industry. Despite natural resources and developing\nindustries, the 2009 Malagasy political crisis—considered by the international\ncommunity to be an illegal coup—deterred foreign investments in Madagascar and\ncaused the Malagasy economy to decline. Foreign investments have resumed\nfollowing the resumption of elections in early 2014.[_citation needed_]\nMadagascar is a least developed country according to United Nations.\n\nMadagascar's economy at 2024 is one of the fastest growing economies in the\nworld.",
    "openai_summarised_points": [
      "• As of 2020, Madagascar's economy has a gross domestic product (GDP) of US$9.769 billion, characterized as a market economy supported primarily by agriculture alongside emerging tourism, textile, and mining industries.",
      "• The agricultural sector in Madagascar produces tropical staple crops including rice and cassava, as well as cash crops such as vanilla and coffee, which are significant to the economy.",
      "• Madagascar benefits from export exemptions under customs protocols in certain regions, notably with the United States and the European Union, which have facilitated the growth of the Malagasy textile industry.",
      "• The 2009 Malagasy political crisis, widely regarded by the international community as an illegal coup, led to a decline in foreign investment and negatively impacted the Malagasy economy.",
      "• Foreign investments in Madagascar began to resume following the resumption of elections in early 2014, signaling a recovery phase for the economy.",
      "• The United Nations classifies Madagascar as a least developed country, reflecting ongoing economic and developmental challenges.",
      "• By 2024, Madagascar's economy is recognized as one of the fastest growing economies globally, indicating significant economic progress despite previous setbacks.",
      "• The article notes that the economy’s per capita GDP has undergone changes from 1950 to 2018, with figures adjusted for inflation to 2011 International dollars, highlighting long-term economic trends.",
      "• The article requires additional citations for verification and broader contextual evaluation, as it currently focuses too much on specific examples without sufficient sourcing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:18:35.334567",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1890,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Over the years, successive French colonial and independence-era governments\nhave sought to modernize Madagascar's economy. The first modern land use\nprojects were established by French settlers or Creole immigrants from the\nMascarene Islands in the nineteenth and twentieth centuries. They introduced\ncash crops such as coffee, sugarcane, vanilla, cloves, and sisal for export.\nThey also built small-scale mines to exploit the island's graphite, chromite,\nand uranium resources. To facilitate the processing and marketing of these\ncommodities, the immigrants established a number of financial and commercial\nenterprises and built a small, modern railroad system. They then brought some\nMalagasy into this modern sector of the economy, either as wage laborers and\nsharecroppers on the foreign-owned plantations, or as low-level employees in\nthe civil service or business enterprises. The foreign owners and managers,\nhowever, retained almost all of the benefits from these operations.\n\nAfter independence the Philibert Tsiranana regime did little to change the\nFrench domination of the modern sector of the economy, despite increasing\noutrage at this continued economic dependence. This anger, together with\ngrowing concern over an unequal distribution of wealth that left the southern\nand western parts of the island in relative poverty, caused the ouster of\nTsiranana in 1972 and a shift in economic policy. The new military regime led\nby Gabriel Ramanantsoa cut most ties with France and began to Malagachize the\neconomy. Slow progress toward this goal, however, helped to precipitate the\nend of the Ramanantsoa regime in mid-1975. Only with the rise of Didier\nRatsiraka to the presidency later that year did the takeover of formerly\nFrench-dominated enterprises begin in earnest.\n\nRatsiraka's policy of \"revolution from above\" went beyond confiscating or\nbuying out foreign firms and turning them over to Malagasy ownership; he\nintended to socialize the economy by nationalizing major enterprises. The\nstate acquired majority or minority ownership in nearly all large financial,\ntransportation, marketing, mining, and manufacturing enterprises. Firms left\nunder private control were required to buy and sell at state-controlled\nprices, and the state closely monitored the repatriation of profits. In the\nrural sector, Ratsiraka aimed to establish local farming cooperatives. Almost\nas important as this institutional reform was the regime's intention,\nannounced in an economic plan for the 1978-80 period, to increase dramatically\nthe level of government capital investment in all sectors of the economy in\norder to improve the availability of goods and services to all.\n\nBy the start of the 1980s, however, Ratsiraka's attempt to fashion viable\nsocialist institutions and to stimulate the economy through increased\ninvestment had failed to improve economic production and welfare. Economic\ngrowth throughout the 1970s had not kept pace with the expanding population.\nDespite the availability of significant agricultural and mineral resources,\nthe economy was less productive than at the start of the decade when the\naverage per capita income was already among the lowest in the world. The only\napparent effect of the enhanced level of investment, which reached all-time\nhighs in the 1978-80 period, was to put the country deeply in debt to foreign\ncreditors and, therefore, pave the way for a series of structural adjustment\nagreements signed with the IMF and the World Bank during the 1980s and the\nearly 1990s. Such agreements were necessary because as a 1993 World Bank study\npointed out, between 1971 and 1991 the per capita income of Malagasy dropped\n40 percent.\n\nEventually admitting that adoption of the socialist model of economic\ncentralization and state control was a mistake, the Ratsiraka regime in 1980\ninitiated a return to a more classic liberal economic model that the Albert\nZafy regime wholeheartedly adopted following its inauguration in 1993. The\npost-1980 Ratsiraka and Zafy regimes have overseen the privatization of\nparastatals, the disbanding of agricultural marketing boards, the ratification\nof more liberal investment codes favoring foreign investment, the\nprivatization of the banking industry, diversification of traditional,\nprimary-product exports, and greater investment in food production. The Zafy\nregime has made reinvigoration of the Malagasy economy its number-one\npriority.\n\nAs of 1994, the majority of Malagasy continued to earn their livelihoods in\nways fundamentally unchanged from those of their ancestors — small-scale farms\nsupporting traditional irrigated rice cultivation, dryland farming of cassava\nand other foods, zebu cattle herding, or the raising of cash crops.\n\nOn April 2, 2025, Donald J. Trump declared \"reciprocal tariffs\" of 47% on\nMadagascar. Madagascar, produces around 80% of the world's vanilla, and such\nexport was put at risk by Trump's new policy towards Madagascar exporters.",
    "openai_summarised_points": [
      "• Successive French colonial and independence-era governments have aimed to modernize Madagascar's economy, beginning with land use projects established by French settlers and Creole immigrants from the Mascarene Islands during the nineteenth and twentieth centuries.",
      "• These settlers introduced cash crops such as coffee, sugarcane, vanilla, cloves, and sisal for export, and developed small-scale mining operations to exploit Madagascar's graphite, chromite, and uranium resources.",
      "• To support commodity processing and marketing, immigrants founded financial and commercial enterprises and constructed a small, modern railroad system, integrating some Malagasy as wage laborers, sharecroppers on plantations, or low-level employees in civil service and business enterprises, while foreign owners retained most benefits.",
      "• After independence, the Philibert Tsiranana regime maintained French dominance over the modern economic sector, despite growing public outrage over economic dependence and unequal wealth distribution, particularly affecting the southern and western regions.",
      "• This discontent led to Tsiranana's ouster in 1972 and a policy shift under the military regime of Gabriel Ramanantsoa, which severed most ties with France and initiated efforts to \"Malagachize\" the economy, though progress was slow and contributed to Ramanantsoa's fall in mid-1975.",
      "• Didier Ratsiraka's presidency, beginning in 1975, marked a vigorous takeover of formerly French-dominated enterprises and implementation of a \"revolution from above,\" aiming to socialize the economy through nationalization of major enterprises.",
      "• Under Ratsiraka, the state acquired majority or minority ownership in nearly all large financial, transportation, marketing, mining, and manufacturing enterprises; private firms were subjected to state-controlled pricing and profit repatriation monitoring.",
      "• In the rural sector, Ratsiraka promoted the establishment of local farming cooperatives and announced an economic plan for 1978-80 to dramatically increase government capital investment across all sectors to improve goods and services availability.",
      "• By the early 1980s, Ratsiraka's socialist institutional reforms and increased investment failed to enhance economic production or welfare; economic growth lagged behind population growth, and per capita income remained among the world's lowest despite abundant agricultural and mineral resources.",
      "• The heightened investment levels during 1978-80 primarily resulted in substantial foreign debt, leading to structural adjustment agreements with the International Monetary Fund (IMF) and the World Bank throughout the 1980s and early 1990s.",
      "• A 1993 World Bank study revealed that Madagascar's per capita income declined by 40 percent between 1971 and 1991, underscoring the failure of the socialist economic model.",
      "• Acknowledging the failure of economic centralization and state control, the Ratsiraka regime began a return to a liberal economic model in 1980, which was fully embraced by the Albert Zafy regime after its 1993 inauguration.",
      "• Post-1980 Ratsiraka and Zafy administrations implemented privatization of parastatals, dismantled agricultural marketing boards, ratified liberal investment codes favoring foreign investment, privatized the banking sector, diversified traditional primary-product exports, and increased investment in food production.",
      "• The Zafy regime prioritized revitalizing the Malagasy economy as its foremost objective.",
      "• As of 1994, the majority of Malagasy people continued traditional livelihoods, including small-scale farming with irrigated rice cultivation, dryland farming of cassava and other crops, zebu cattle herding, and cash crop production.",
      "• On April 2, 2025, former U.S. President Donald J. Trump declared \"reciprocal tariffs\" of 47% on Madagascar, jeopardizing exports, notably Madagascar's production of approximately 80% of the world's vanilla supply."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:18:51.329106",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4944,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture",
    "text": "Madagascar produced, in 2018:\n\n* 4 million tons of rice;\n* 3.1 million tons of sugarcane;\n* 2.5 million tons of cassava;\n* 1 million tons of sweet potato;\n* 388 thousand tons of vegetable;\n* 383 thousand tons of banana;\n* 300 thousand tons of mango (including mangosteen and guava);\n* 257 thousand tons of potato;\n* 230 thousand tons of taro;\n* 215 thousand tons of maize;\n* 93 thousand tons of pineapple;\n* 86 thousand tons of beans;\n* 83 thousand tons of orange;\n* 73 thousand tons of coconut;\n\nIn addition to smaller productions of other agricultural products, like coffee\n(57 thousand tons), clove (23 thousand tons), cocoa (11 thousand tons), cashew\n(7 thousand tons) and vanilla (3 thousand tons).\n\nAgriculture, including fishing and forestry, is Madagascar's largest industry\nand employs 82% of its labor force. Madagascar's varied climate, ranging from\ntropical along the coasts, moderate in the highlands and arid in the south,\nallows for the cultivation of tropical crops such as rice, cassava, beans and\nbananas. In 2011, agricultural products—especially cloves, vanilla, cacao,\nsugar, pepper, and coffee—accounted for Madagascar's top twelve exports by\nvalue. Madagascar produces the largest vanilla harvest in the world and\nMalagasy vanilla accounts for 80-85% of the global vanilla market.\nMadagascar's vanilla market in the US was put at risk in April 2025 following\nDonald J. Trump's declaration of \"reciprocal tariffs\" amounting to 47%."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Fishing",
    "text": "The fishing industry is present with 66 industrial fishing vessels. Fees &\ntaxes for fishing licences are estimated at 3,6 billion Ariary (US$80 million)\nfor 2023."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Textiles",
    "text": "Exports from Madagascar's Export Processing Zones, located around Antananarivo\nand Antsirabe, account for the majority of garment exports and are largely\nexempt from customs restrictions in the United States under the African Growth\nand Opportunity Act (AGOA) and in the European Union under the Everything but\nArms (EBA) agreement."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Mining",
    "text": "A small but growing part of the economy is based on mining of ilmenite, with\ninvestments emerging in recent years, particularly near Tulear and Fort\nDauphin. Mining corporation Rio Tinto started production at its Fort Dauphin\nMandena mine in January 2009, following several years of preparation. The\nmining project is highly controversial, with Friends of the Earth and other\nenvironmental organizations filing reports to detail their concerns about the\nmine's effect on the environment and local communities. Gemstone mining is\nalso an important part of Madagascar's economy.\n\nSeveral major projects are underway in the mining and oil and gas sectors\nthat, if successful, will give a significant boost. In the mining sector,\nthese include the development of coal at Sakoa and nickel near Tamatave. The\nAmbatovy mine (nickel & cobalt - Sherrit International 40%, Sumitomo 27.5%,\nKorea Resources 27.5%, SNC-Lavalin 5%) is a huge operation and has cost\nUS$4.76 million to date and is due to start production in 2011. In oil,\nMadagascar Oil is developing the massive onshore heavy oil field at Tsimiroro\nand ultra heavy oil field at Bemolanga.\n\nTulear"
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Investment climate",
    "text": "| This article **may contain an excessive amount of intricatedetail that may\ninterest only a particular audience**. Please help by spinning off or\nrelocating any relevant information, and removing excessive detail that may be\nagainst Wikipedia's inclusion policy. _( March 2015)__(Learn how and when to\nremove this message)_\n---|---\nFormer President Marc Ravalomanana of Madagascar\n\nFollowing the 2002 political crisis, the government attempted to set a new\ncourse and build confidence, in coordination with international financial\ninstitutions and donors. Madagascar developed a recovery plan in collaboration\nwith the private sector and donors and presented it at a \"Friends of\nMadagascar\" conference organized by the World Bank in Paris in July\n2002.[_citation needed_] Donor countries demonstrated their confidence in the\nnew government by pledging $1 billion in assistance over five years. The\nMalagasy Government identified road infrastructure as its principal priority\nand underlined its commitment to public-private partnership by establishing a\njoint public-private sector steering committee.[_citation needed_]\n\nThe Madagascar-U.S. Business Council was formed as a collaboration between the\nUnited States Agency for International Development (USAID) and Malagasian\nartisan producers in Madagascar in 2002. The U.S.-Madagascar Business Council\nwas formed in the United States in May 2003, and the two organisations\ncontinue to explore ways to work for the benefit of both groups.[_citation\nneeded_]\n\nThe government of former President Marc Ravalomanana was aggressively seeking\nforeign investment and had planned to tackle many of the obstacles to such\ninvestment, including combating corruption, reforming land-ownership laws,\nencouraging study of American and European business techniques, and active\npursuit of foreign investors. [_citation needed_]President Ravalomanana rose\nto prominence through his agro-foods TIKO company, and is known for attempting\nto apply many of the lessons learned in the world of business to running the\ngovernment.[_citation needed_] Prior to Ravalomanana's resignation, concerns\nhad arisen about the conflict of interest between his policies and the\nactivities of his firms. Most notable among them the preferential treatment\nfor rice imports initiated by the government in late 2004 when responding to a\nproduction shortfall in the country.[_citation needed_]\n\nMadagascar's appeal to investors stems from its competitive, trainable work\nforce. More than 200 investors, particularly garment manufacturers, were\norganized under the country's export processing zone (EPZ) system since it was\nestablished in 1989.[_citation needed_] The absence of quota limits on textile\nimports to the European market under the Lomé Convention helped stimulate this\ngrowth.[_citation needed_]\n\nPort Toamasina\n\nGrowth in output in 1992–97 averaged less than the growth rate of the\npopulation. Growth has been taken away by a decline in world coffee demand,\nand the erratic commitment of the government to economic reform. During a\nperiod of solid growth from 1997 to 2001, poverty levels remained stubbornly\nhigh, especially in rural areas. A six-month political crisis triggered by a\ndispute over the outcome of the presidential elections held in December 2001\nvirtually halted economic activity in much of the country in the first half of\n2002. Real GDP dropped 12.7% in 2002, inflows of foreign investment dropped\nsharply, and the crisis tarnished Madagascar's budding reputation as an AGOA\nstandout and a promising place to invest. After the crisis, the economy\nrebounded with GDP growth of over 10% in 2003.[_citation needed_] Currency\ndepreciation and rising inflation in 2004 hampered economic performance, but\ngrowth for the year reached 5.3%, with inflation reaching around 25% at the\nend of the year.[_citation needed_] In 2005, inflation was brought under\ncontrol by tight monetary policy of raising the _Taux Directeur_ (central bank\nrate) to 16% and tightening reserve requirements for banks. Thus growth was\nexpected to reach around 6.5% in 2005.[_citation needed_]\n\nDuring Ravalomanana's presidency, the government adopted a series of business\nlaws and regulations, including the commercial companies law (2003), labor law\n(2003), regulations on the application of commercial companies law (2004),\npublic procurement law (2004), competition law (2005), foreign exchange law\n(2006), investment law (2007), and free zones and free enterprises law (2007)."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Food security, vulnerability and risk management",
    "text": "Vibrant Antananarivo is the political and economic capital of Madagascar\n\nDespite a wealth of abundant and diverse natural resources, Madagascar is one\nof the world's poorest countries. Madagascar holds great potential for\nagricultural development, mainly due to the large variety of soil types and\nclimatic diversity. Nevertheless, natural hazards (cyclones, drought, locust\ninvasions) combined with old-fashioned farming practices limit production.\n\nThe standard of living of the Malagasy population has been declining\ndramatically over the past 25 years. The country has gone from being a net\nexporter of agricultural products in the 1960s to a net importer since 1971.\nInappropriate traditional agricultural methods cause soil to erode and soil\nquality to decline, and the basis of survival for Madagascar's people is under\nserious threat."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Energy",
    "text": "| This section **needs expansion**. You can help by adding to it. _( September\n2022)_\n---|---\nMadagascar has high photovoltaic power potential.\n\nAs of 2018, only 15% of the population of Madagascar has access to\nelectricity. By 2023, this has increased to 34%. Madagascar has a technically\nfeasible hydropower potential of about 180,000 GWh. Less than 1% has been\ndeveloped so far, with 162 MW of installed hydro capacity producing 61% of the\ncountry's electricity. The country has enormous potential for exploiting solar\npower, but general infrastructure is still lacking.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Poverty reduction",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( December 2024)__(Learn how and when to remove this message)_\n---|---\nLocal market vendors.\n\nIn 2000, Madagascar embarked on the preparation of a Poverty Reduction\nStrategy Paper (PRSP) under the Heavily indebted poor countries (HIPC)\nInitiative. The boards of the IMF and of the World Bank concurred in December\n2000 that the country was eligible under the HIPC Initiative, and Madagascar\nreached the decision point for debt relief. On March 1, 2001, the IMF Board\ngranted the country $103 million for 2001–03 under the Poverty Reduction and\nGrowth Facility (PRGR). Resources were intended for improving access to\nhealth, education, rural roads, water, and direct support to communities. In\naddition, on March 7, 2001, the Paris Club approved a debt cancellation of\n$161 million. On February 28, 2001, the African Development Bank (ADB)\napproved under the HIPC a debt cancellation of $71.46 million and granted in\nJune 2001 an additional credit of $20 million to fight against AIDS and\npoverty.\n\nPartly as a result of these credits but also as a result of previous reforms,\naverage GDP growth exceeded the population growth rate of 2.8% in 1997 (3.5%),\n1998 (3.9%), 1999 (4.7%) and 2000 (4.8%).\n\nIn October 2004, the boards of the IMF and the World Bank determined that\nMadagascar had reached the completion point under the enhanced HIPC\nInitiative."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Child labour",
    "text": "Child labour in Brickaville, a city in Atsinanana region of Madagascar\n\nChildren are common in small scale mines of Madagascar. Some are involved in\nsalt mining, quarry work, gem and gold ore collection. About 58% of children\nin these mines are younger than age 12. According to IPEC, Child labourers in\nthese mines usually come from families who are in precarious economic\nsituation.\n\nAccording to a United States-based 2010 report, about 22% of Madagascar\nchildren aged 5–14, or over 1.2 million work. Another French based group\nsuggests Madagascar child labour exceeds 2.4 million, with over 540,000\nchildren aged 5–9 working. About 87% of the child labour is in agriculture,\nmainly in the production of vanilla, tea, cotton, cocoa, copra (dried meat of\ncoconut), sisal, shrimp harvest and fishing. Malagasy children engaged in\ndomestic service work an average of 12 hours per day.\n\nSeveral internationally funded efforts were involved in Madagascar to help\nreduce and prevent child labour. However these stopped, after the government\nchange following 2009 coup, because much of the funding from international\ndonors, including the African Union, European Union, World Bank and the United\nStates, was suspended."
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "9.1",
    "section_name": "Main indicators",
    "text": "The following table shows the main economic indicators in 1980–2023.\n\nYear  | GDP\n(in billion US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in billion US$ nominal) | GDP growth (real)  | Inflation (in Percent)  | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---\n1980  | 8.867  | 1,021.7  | 5.202  | 0.788  | 18.278  | n/a\n1981  | 8.755  | 982.4  | 4.759  | −9.800  | 30.457  | n/a\n1982  | 9.119  | 996.6  | 4.785  | −1.900  | 31.907  | n/a\n1983  | 9.562  | 1,017.7  | 4.686  | 0.900  | 19.469  | n/a\n1984  | 10.081  | 1,045.0  | 3.906  | 1.760  | 9.720  | n/a\n1985  | 10.520  | 1,062.0  | 3.803  | 1.156  | 10.566  | n/a\n1986  | 10.942  | 1,075.8  | 4.348  | 1.960  | 14.492  | n/a\n1987  | 11.345  | 1,086.2  | 3.213  | 1.175  | 15.461  | n/a\n1988  | 12.145  | 1,132.5  | 3.189  | 3.407  | 26.338  | n/a\n1989  | 13.135  | 1,192.9  | 3.176  | 4.075  | 9.017  | n/a\n1990  | 14.053  | 1,243.0  | 3.931  | 3.129  | 11.859  | 92.701\n1991  | 13.612  | 1,172.6  | 3.255  | −6.306  | 8.540  | 113.835\n1992  | 14.087  | 1,181.8  | 3.715  | 1.181  | 14.567  | 110.875\n1993  | 14.724  | 1,203.0  | 4.063  | 2.100  | 9.990  | 105.192\n1994  | 15.032  | 1,192.3  | 3.522  | −0.042  | 38.992  | 95.963\n1995  | 15.605  | 1,201.6  | 3.838  | 1.679  | 49.036  | 95.837\n1996  | 16.233  | 1,213.4  | 4.932  | 2.154  | 19.761  | 98.716\n1997  | 17.123  | 1,242.5  | 4.263  | 3.693  | 4.492  | 89.740\n1998  | 17.994  | 1,267.5  | 4.402  | 3.917  | 6.210  | 108.460\n1999  | 19.105  | 1,306.5  | 4.278  | 4.699  | 7.189  | 104.115\n2000  | 20.408  | 1,354.9  | 4.629  | 4.457  | 11.570  | 90.212\n2001  | 22.116  | 1,425.4  | 5.438  | 5.980  | 7.917  | 82.144\n2002  | 19.674  | 1,230.9  | 5.352  | −12.408  | 16.499  | 86.693\n2003  | 22.025  | 1,337.7  | 6.372  | 9.785  | −1.704  | 85.862\n2004  | 23.805  | 1,403.6  | 5.065  | 5.257  | 13.956  | 81.896\n2005  | 25.719  | 1,472.1  | 5.859  | 4.756  | 18.364  | 74.366\n2006  | 27.944  | 1,552.8  | 6.396  | 5.399  | 10.766  | 32.226\n2007  | 30.338  | 1,636.6  | 8.525  | 5.711  | 10.288  | 28.210\n2008  | 32.996  | 1,727.9  | 10.725  | 6.713  | 9.297  | 31.010\n2009  | 31.886  | 1,621.0  | 9.617  | −3.979  | 8.954  | 34.857\n2010  | 32.469  | 1,602.4  | 9.983  | 0.619  | 9.247  | 32.341\n2011  | 33.667  | 1,613.0  | 11.552  | 1.578  | 9.483  | 29.947\n2012  | 34.211  | 1,591.2  | 11.579  | 3.011  | 5.714  | 30.435\n2013  | 35.257  | 1,591.9  | 12.424  | 2.300  | 5.826  | 36.243\n2014  | 36.702  | 1,608.7  | 12.523  | 3.339  | 6.080  | 37.848\n2015  | 37.486  | 1,595.1  | 11.323  | 3.132  | 7.404  | 44.062\n2016  | 39.997  | 1,652.2  | 11.849  | 3.993  | 6.056  | 40.281\n2017  | 40.515  | 1,624.7  | 13.176  | 3.933  | 8.590  | 40.130\n2018  | 42.814  | 1,667.6  | 13.760  | 3.194  | 8.598  | 42.896\n2019  | 45.504  | 1,715.5  | 14.105  | 4.411  | 5.623  | 41.253\n2020  | 42.808  | 1,565.8  | 13.051  | −7.138  | 4.188  | 52.198\n2021  | 47.298  | 1,678.5  | 14.555  | 5.740  | 5.819  | 52.029\n2022  | 52.636  | 1,817.4  | 15.149  | 4.000  | 8.157  | 55.129\n2023  | 56.754  | 1,906.6  | 15.763  | 4.000  | 10.500  | 54.026"
  },
  {
    "chapter_name": "Economy of Madagascar",
    "chapter_id": "1",
    "section_number": "9.2",
    "section_name": "Other data",
    "text": "**Household income or consumption by percentage share:**\n_lowest 10%:_ 2.3%\n_highest 10%:_ 34.9% (1993)\n\n**Industrial production growth rate:** 5% (1999 est.)\n\n**Electricity – production:** 1.35 billion kWh (2009 est.)\n\n**Electricity – production by source:**\n_fossil fuel:_ 69.5%\n_hydro:_ 30.5%\n_nuclear:_ 0%\n_other:_ 0% (2009)\n\n**Electricity – consumption:** 1.256 billion kWh (2009 est.)\n\n**Electricity – exports:** 0 kWh (2010)\n\n**Electricity – imports:** 0 kWh (2010)\n\n**Exchange rates:** Malagasy ariary (MGA) per US dollar - 2,195 (2012 est.)\n2,025.1 (2011 est.) 2,090 (2010 est.) 1,956.2 (2009) 1,654.78 (2008)"
  }
]