[
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Kenya** is market-based with a few state enterprises. Kenya\nhas an emerging market and is an averagely industrialised nation ahead of its\nEast African peers. Currently a lower middle income nation, Kenya plans to be\na newly industrialised nation by 2030. The major industries driving the Kenyan\neconomy include financial services, agriculture, real estate, manufacturing,\nlogistics, tourism, retail and energy. As of 2020, Kenya had the third largest\neconomy in Sub-Saharan Africa, behind Nigeria and South Africa. Regionally,\nKenya has had a stronger and more stable economy compared to its neighboring\ncountries within East Africa. By 2023, the country had become Africa's largest\nstart-up hub by both funds invested and number of projects.\n\nThe government of Kenya is generally investment-friendly and has enacted\nseveral regulatory reforms to simplify foreign and local investment, including\nthe creation of an export processing zone. An increasingly significant portion\nof Kenya's foreign financial inflows are remittances by Kenyans in the\nDiaspora, who work in the United States, the Middle East, Europe and Asia.\nAccording to data by the Central Bank of Kenya, remittances from Kenyans\nliving abroad make up over 3.4 percent of the Gross Domestic Product (GDP).\n\nAs of September 2018, economic prospects were positive, with above 6% gross\ndomestic product (GDP) growth expected. This growth was attributed largely to\nexpansions in the telecommunications, transport, and construction sectors; a\nrecovery in agriculture; and the rise of small businesses helping to pull the\neconomy. These improvements are supported by a large pool of highly educated\nprofessional workers. There is a high level of IT literacy and innovation,\nespecially among young Kenyans.\n\nIn 2020, Kenya ranked 56th in the World Bank ease of doing business rating, up\nfrom 61st in 2019 (of 190 countries). Compared to its neighbours, Kenya has a\nwell-developed social and physical infrastructure.",
    "openai_summarised_points": [
      "• The economy of Kenya is predominantly market-based, characterized by a limited number of state enterprises.",
      "• Kenya is classified as an emerging market and is considered an averagely industrialized nation, positioned ahead of its East African peers.",
      "• The country is currently designated as a lower middle income nation with a developmental goal to become a newly industrialized nation by the year 2030.",
      "• Major industries driving Kenya’s economy include financial services, agriculture, real estate, manufacturing, logistics, tourism, retail, and energy sectors.",
      "• As of 2020, Kenya ranked as the third largest economy in Sub-Saharan Africa, following Nigeria and South Africa.",
      "• Regionally, Kenya has maintained a stronger and more stable economy compared to neighboring countries within East Africa.",
      "• By 2023, Kenya had become Africa’s largest start-up hub, distinguished by the highest total funds invested and the greatest number of start-up projects.",
      "• The Kenyan government is generally investment-friendly, having implemented several regulatory reforms aimed at simplifying both foreign and local investment procedures.",
      "• One such reform includes the establishment of an export processing zone to promote trade and industrialization.",
      "• A significant and growing source of foreign financial inflows into Kenya is remittances sent by Kenyans living abroad, particularly in the United States, the Middle East, Europe, and Asia.",
      "• According to data from the Central Bank of Kenya, remittances from the Kenyan diaspora constitute over 3.4% of the country’s Gross Domestic Product (GDP).",
      "• As of September 2018, Kenya’s economic outlook was positive, with an expected GDP growth rate exceeding 6%.",
      "• The projected economic growth was primarily driven by expansions in the telecommunications, transport, and construction sectors, along with a recovery in agriculture and the proliferation of small businesses.",
      "• These economic improvements are supported by a large pool of highly educated professional workers, contributing to innovation and development.",
      "• Kenya exhibits a high level of IT literacy and innovation, especially among its youth demographic.",
      "• In 2020, Kenya ranked 56th in the World Bank’s ease of doing business index, improving from 61st position in 2019, out of 190 countries assessed.",
      "• Compared to its neighboring countries, Kenya boasts well-developed social and physical infrastructure, facilitating economic activities and development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:57:26.780168",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1989,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "Between 70 AD and 1500 AD, trade routes — spanning Africa, Asia and Europe —\nintegrated the Kenyan coastal strip into the world economy. Foreign merchants\nwould bring their merchandise to the Kenyan coast and leave with African\ngoods.\n\nIn 1499 AD, Vasco da Gama, a Portuguese explorer, returned to Europe after\ndiscovering the sea route to India through South Africa. This new route\nallowed European nations to dominate the trade economy of the East African\ncoast, with the Portuguese entrenching themselves in the 16th and 17th\ncenturies. In the 18th century, the Portuguese were replaced in this East\nAfrican economic corridor by Omani Arabs. Eventually, the British replaced the\nOmani Arabs. In 1895 they dominated the coastal strip; by 1920, they had\nfollowed the interior trade routes all the way to the Buganda Kingdom. To make\nthis ancient economic trade route more profitable, the British used Indian\nlabourers to build a railway from Mombasa at the coast to Kampala, the capital\nof Buganda kingdom, following old trade routes. Major towns were founded along\nthe railway line, backed by European settler farming communities. The Indian\nlabourers who did not return to India after railway construction ended were\nthe first to establish shops (dukawallahs) in these towns.\n\nDuring the colonial period, the European settler farming community and the\nIndian dukawallahs established the foundations of the modern formal Kenyan\neconomy. Prominent examples of Asian-Kenyan business owners whose businesses\nstarted as dukawallahs include Manu Chandaria and Madatally Manji. While\nEuropeans and Indians enjoyed strong economic growth between 1920 and 1963,\nAfricans were deprived of their land, dehumanised, and forced to work for\nminimal pay under extremely poor working conditions through a well-established\nsystem of racial segregation.\n\nKenya gained its independence in 1963. Under President Jomo Kenyatta, the\nKenyan government promoted africanisation of the Kenyan economy, generating\nrapid economic growth through public investment, encouragement of smallholder\nagricultural production, and incentives for private, often foreign, industrial\ninvestments. An influential sessional paper authored by Tom Mboya and Mwai\nKibaki in 1965 stressed the need for Kenya to avoid both the capitalistic\neconomy of the West and the communism of the East. The paper argued that Kenya\nshould instead concentrate on African socialism, while avoiding linking\nKenya's economic fortunes to any country or group of countries. From 1963 to\n1973, GDP grew at an annual average rate of 6.6%; during the 1970s, it grew at\nan average rate of 7.2%. Agricultural production grew by 4.7% annually in the\nsame period, stimulated by redistributing estates, distributing new crop\nstrains, and opening new areas to cultivation. However, the rate of GDP growth\ndeclined to 4.2% per year in the 1980s, and 2.2% a year in the 1990s.\n\nKenya's policy of import substitution, which started in 1946 with European and\nAsian enterprises, did not achieve the desired result of transforming Kenya's\nindustrial base. In the late 1970s, rising oil prices began to make Kenya's\nmanufacturing sector noncompetitive. In response, the government began a\nmassive intervention in the private sector. Lack of export incentives, tight\nimport controls, and foreign exchange controls made the domestic environment\nfor investment even less attractive.\n\nIn the 1980s and 1990s, Kenya signed structural adjustment loans with the\nWorld Bank and IMF, the loans were to be given on the condition that Kenya\nadopts government reforms, a liberal trade and interest rate regime, and an\noutward-oriented industrial policy, among other reforms. The Kenyan economy\nperformed very poorly during this era of World Bank and IMF-driven\nliberalisation at the height of Daniel Arap Moi administration.\n\nFrom 1991 to 1993, Kenya had its worst economic performance since\nindependence. Growth in GDP stagnated, and agricultural production shrank at\nan annual rate of 3.9%. Inflation reached a record of 100% in August 1993, and\nthe government's budget deficit was over 10% of GDP. As a result of these\nissues, bilateral and multilateral donors suspended their aid programmes in\nKenya in 1991.\n\nIn 1993, the Kenyan government began a major programme of economic reform and\nliberalisation. A new minister of finance and a new governor of the central\nbank undertook a series of economic measures with the assistance of the World\nBank and the International Monetary Fund (IMF). The government eliminated\nprice controls and import licensing, removed foreign exchange controls,\nprivatised a number of publicly owned companies, reduced the number of civil\nservants, and introduced conservative fiscal and monetary policies. From 1994\nto 1996, Kenya's real GDP growth rate averaged just over 4% a year.\n\nKenya's economic performance since independence.\n\nIn 1997, however, the economy entered a period of slow growth, due in part to\nadverse weather conditions and reduced economic activity before the general\nelections in December 1997. In July 1997, the Government of Kenya refused to\nmeet earlier commitments to the IMF on governance reforms. As a result, the\nIMF suspended lending for three years, and the World Bank put a $90 million\nstructural adjustment credit on hold.\n\nThe Kenyan government subsequently took positive steps on reform, including\nthe establishment of the Kenya Anti-Corruption Authority in 1997. The state\nalso implemented measures to improve the transparency of government\nprocurement and reduce the government payroll. In July 2000, the IMF signed a\n$150 million Poverty Reduction and Growth Facility, and the World Bank\nfollowed shortly after with a $157 million Economic and Public Sector Reform\ncredit. However, both were eventually suspended. Despite setbacks, the process\nof reform established Kenya as East Africa's economic powerhouse and the\nregion's business hub.\n\nEconomic growth improved between 2003 and 2008, under the Mwai Kibaki\nadministration. When Kibaki took power in 2003, he immediately established the\nNational Debt Management Department at the treasury, reformed the Kenya\nRevenue Authority (KRA) to increase government revenue, reformed financial\nlaws on banking, wrote off the debts of strategic public enterprises, and\nensured that 30% of government tax revenue was invested in economic\ndevelopment projects. With these reforms, driven by the National Rainbow\nCoalition government, the KRA collected more tax revenue in 2004 than was\nanticipated. The government then initiated investments in infrastructure. By\n2005, the Kenyan public debt had reduced from highs of 80% of GDP in 2002 to\n27% of GDP in 2005. The financial sector greatly improved, and Equity Bank\nKenya became one of the largest banks in East Africa. Economic growth improved\nfrom 2% in 2003 to 7% in 2007. In 2008, the growth slumped to 1% due to post-\nelection violence before returning to an average of 5% between 2009 and 2013.\nHowever, in 2009, due to drought and the 2008 financial crisis, high input\ncosts as well as a fall in demand for some of the country's exports caused the\nagriculture sector to contract by 2.7%.\n\nBetween 2013 and 2018, under the Jubilee Party government led by Uhuru\nKenyatta, the GDP growth averaged above 5%. Growth in small businesses is\ncredited with some of the improvement. Real GDP growth (annualised) was 5.7%\nin Q1 of 2018, 6.0% in Q2 2018 and 6.2% in Q3 2018. Despite this robust\ngrowth, concerns remained about Kenya's debt sustainability, current account\ndeficit, fiscal consolidation and revenue growth.\n\nThe table below shows the GDP of Kenya estimated Archived 11 June 2010 at the\nWayback Machine by the International Monetary Fund, with exchange rates for\nKenyan shillings.\n\nYear | Nominal GDP(USD) | US Dollar Exchange\n---|---|---\n1980 | 7.265 billion | 7.42 shillings\n1985 | 6.135 billion | 16.43 shillings\n1990 | 8.591 billion | 22.86 shillings\n1995 | 9.046 billion | 50.42 shillings\n2000 | 12.71 billion | 78.58 shillings\n2005 | 18.74 billion | 75.55 shillings\n2010 | 40 billion | 78.90 shillings\n2015 | 63.77 billion | 96.85 shillings\n2020 | 101.1 billion | 107 shillings",
    "openai_summarised_points": [
      "• Between 70 AD and 1500 AD, trade routes spanning Africa, Asia, and Europe integrated the Kenyan coastal strip into the global economy, with foreign merchants bringing merchandise to the coast and departing with African goods.",
      "• In 1499 AD, Portuguese explorer Vasco da Gama returned to Europe after discovering the sea route to India via South Africa, enabling European dominance over East African coastal trade in the 16th and 17th centuries.",
      "• During the 18th century, Portuguese influence in East African trade was replaced by Omani Arabs, who later were succeeded by the British.",
      "• By 1895, the British controlled the coastal strip, and by 1920, they extended inland trade routes to the Buganda Kingdom.",
      "• The British built a railway from Mombasa to Kampala, following ancient trade routes, to enhance profitability, employing Indian laborers for construction.",
      "• Major towns along the railway emerged, supported by European settler farming communities; Indian laborers who stayed after construction established shops called dukawallahs.",
      "• During colonial rule, European settlers and Indian dukawallahs laid the foundations of modern Kenya’s economy, with notable Asian-Kenyan entrepreneurs such as Manu Chandaria and Madatally Manji starting as dukawallahs.",
      "• Between 1920 and 1963, Europeans and Indians experienced strong economic growth, while Africans faced land dispossession, dehumanization, and forced labor under racial segregation.",
      "• Kenya gained independence in 1963, with President Jomo Kenyatta promoting Africanization of the economy through public investment, support for smallholder agriculture, and incentives for private and foreign industrial investments.",
      "• The 1965 Sessional Paper by Tom Mboya and Mwai Kibaki emphasized Kenya’s focus on African socialism, avoiding reliance on Western capitalism or Eastern communism, and urged economic independence from external countries or blocs.",
      "• From 1963 to 1973, Kenya’s GDP grew annually by an average of 6.6%; during the 1970s, growth increased to an average of 7.2%; agricultural production grew by 4.7% annually, driven by estate redistribution, new crop strains, and opening new cultivation areas.",
      "• In the 1980s, GDP growth declined to 4.2% annually, and further to 2.2% in the 1990s, with agricultural production shrinking by 3.9% annually from 1991 to 1993.",
      "• Kenya’s import substitution policy, initiated in 1946, failed to transform the industrial base; rising oil prices in the late 1970s made manufacturing sectors uncompetitive.",
      "• The government responded with intervention in the private sector, but lack of export incentives, import controls, and foreign exchange restrictions hindered investment attractiveness.",
      "• During the 1980s and 1990s, Kenya signed structural adjustment loans with the World Bank and IMF, conditioned on reforms such as liberalized trade, interest rates, and outward-oriented industrial policies, but economic performance was poor during this period.",
      "• From 1991 to 1993, Kenya experienced its worst economic performance since independence, with GDP stagnation, a 3.9% annual decline in agriculture, inflation reaching 100% in August 1993, and a government budget deficit exceeding 10% of GDP, leading to suspension of aid programs.",
      "• In 1993, Kenya launched major economic reforms with assistance from the World Bank and IMF, including removing price controls, import licensing, foreign exchange controls, privatization, civil service reduction, and fiscal and monetary tightening; from 1994 to 1996, GDP growth averaged just over 4% annually.",
      "• The economy slowed again in 1997 due to adverse weather and pre-election economic slowdown; Kenya refused to meet IMF governance reforms commitments, resulting in a three-year suspension of IMF lending and a hold on a $90 million World Bank structural adjustment credit.",
      "• The government took reform measures such as establishing the Kenya Anti-Corruption Authority in 1997, improving procurement transparency, and reducing civil service payroll; in 2000, IMF and World Bank provided a $150 million Poverty Reduction and Growth Facility and a $157 million Public Sector Reform credit, both later suspended.",
      "• Despite setbacks, reforms established Kenya as East Africa’s economic powerhouse and regional business hub.",
      "• Between 2003 and 2008, under President Mwai Kibaki, economic performance improved; reforms included establishing the National Debt Management Department, reforming the Kenya Revenue Authority (KRA), reforming banking laws, writing off public enterprise debts, and investing 30% of tax revenue in development projects.",
      "• Tax revenue collection exceeded expectations in 2004; infrastructure investments commenced, and public debt decreased from 80% of GDP in 2002 to 27% in 2005.",
      "• The financial sector strengthened, exemplified by Equity Bank Kenya becoming one of East Africa’s largest banks; GDP growth increased from 2% in 2003 to 7% in 2007.",
      "• In 2008, growth dropped to 1% due to post-election violence, but recovered to an average of 5% from 2009 to 2013; agriculture contracted by 2.7% in 2009 due to drought and the 2008 financial crisis.",
      "• From 2013 to 2018, under the Jubilee Party government led by Uhuru Kenyatta, GDP growth averaged above 5%, with quarterly growth rates of 5.7% in Q1 2018, 6.0% in Q2, and 6.2% in Q3; small business growth contributed to economic improvement.",
      "• Despite robust growth, concerns persisted regarding debt sustainability, current account deficits, fiscal consolidation, and revenue growth.",
      "• The IMF-estimated nominal GDP of Kenya in 1980 was $7.265 billion with an exchange rate of 7.42 shillings per USD; in 1985, $6.135 billion at 16.43 shillings; in 1990, $8.591 billion at 22.86 shillings; in 1995, $9.046 billion at 50.42 shillings; in 2000, $12.71 billion at 78.58 shillings; in 2005, $18.74 billion at 75.55 shillings; in 2010, $40 billion at 78.90 shillings; in 2015, $63.77 billion at 96.85 shillings; and in 2020, $101.1 billion at 107 shillings."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:57:42.847115",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 8159,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Vision 2030 plan",
    "text": "Vision 2030 is Kenya's current blueprint for its economic future, with the\ngoal of creating a prosperous, globally-competitive nation with a high quality\nof life by 2030. The plan aims to transform Kenyan industry and environment in\nthree pillars: economic, social, and political.",
    "openai_summarised_points": [
      "• Vision 2030 is Kenya's strategic blueprint aimed at shaping the country's economic future with the objective of establishing a prosperous, globally competitive nation characterized by a high quality of life by the year 2030.",
      "• The plan seeks to achieve this vision through a comprehensive transformation of Kenya's industry and environment, structured around three core pillars: economic, social, and political.",
      "• The overarching goal of Vision 2030 is to position Kenya as a middle-income country with a sustained economic growth rate that supports improved living standards for its citizens.",
      "• The economic pillar focuses on diversifying and expanding key sectors such as agriculture, manufacturing, tourism, and services to promote economic growth and job creation.",
      "• The social pillar emphasizes investments in education, health, and social protection to enhance human capital development and reduce poverty and inequality.",
      "• The political pillar aims to strengthen governance, institutions, and the rule of law to foster a stable and enabling environment for economic and social development.",
      "• Vision 2030 was launched in 2008 as part of Kenya's long-term development agenda, with specific milestones set to be achieved by 2012, 2017, and 2022, leading up to the 2030 target.",
      "• The plan is implemented through sector-specific flagship projects, including infrastructure development such as roads, ports, energy, and information technology.",
      "• Key initiatives include the expansion of the Standard Gauge Railway (SGR), the development of the Lamu Port-South Sudan-Ethiopia-Transport (LAPSSET) Corridor, and increased investment in renewable energy sources.",
      "• The plan aims to increase Kenya’s GDP growth rate to an average of 10% annually over the period, with the goal of raising per capita income and reducing poverty levels.",
      "• As part of the strategy, Kenya aims to improve its competitiveness by enhancing infrastructure, human capital, and institutional capacity, aligning with global standards.",
      "• The plan emphasizes sustainable development practices, environmental conservation, and climate change mitigation to ensure long-term economic stability.",
      "• The implementation of Vision 2030 involves collaboration among government ministries, private sector stakeholders, development partners, and civil society organizations.",
      "• Progress reports indicate that Kenya has made significant strides in infrastructure development, economic diversification, and social services, although challenges remain in fully achieving all targets by 2030."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:57:48.582795",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 280,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Economic pillar",
    "text": "Vision 2030 seeks economic growth averaging greater than 10% for 23 years,\nbeginning in the year 2007. Economic areas targeted are tourism, agriculture,\nwholesale and retail trade, manufacturing, IT-enabled services, and financial\nservices.",
    "openai_summarised_points": [
      "• Vision 2030 aims for an average annual economic growth rate exceeding 10% over a period of 23 years, starting from the year 2007.",
      "• The strategic focus of Vision 2030 encompasses key economic sectors including tourism, agriculture, wholesale and retail trade, manufacturing, IT-enabled services, and financial services.",
      "• The initiative reflects Kenya’s long-term development plan to transform the country into a newly industrializing, middle-income nation by the year 2030."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:57:50.522039",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 240,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Social pillar",
    "text": "To improve the quality of life for Kenyans, Vision 2030 aims to improve human\nand social welfare programmes, specifically education and training, health,\nenvironment, housing and urbanisation, children and social development, and\nyouth and sports. In 2018, President Uhuru Kenyatta established the Big Four\nAgenda, focusing on universal healthcare, manufacturing, affordable housing\nand food security."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Political pillar",
    "text": "The political pillar envisions a \"democratic system that is issue-based,\ntransparent, people-centred, results-oriented, and accountable to the public\".\nIt targets five main areas: the rule of law under the Constitution of Kenya,\nelectoral and political processes, democracy and public service delivery,\ntransparency and accountability, and security, peace building, and conflict\nmanagement.\n\nThe current Constitution of Kenya was inaugurated on 27 August 2010 to drive\nthis pillar."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Currency, exchange rate, and inflation",
    "text": "Kenya's currency is printed by mandate of the Central Bank of Kenya. The bank\nbegan printing banknotes in 1996. Several versions of Kenya's banknotes and\ncoinage have been circulated since then. The most recent redesign of Kenya's\ncurrency was in 2019.\n\nThe exchange rate of the Kenyan Shilling between 2003 and 2010 averaged about\nKSh74-78 per US Dollar.\n\nThe average inflation between 2005 and July 2015 was 8.5%. In July 2015\nKenya's inflation rate was estimated to be 6.62%."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Revenue and spending",
    "text": "In 2006, Kenyan government revenue totalled US$4.448B and its estimated\nexpenditures totalled US$5.377B. The government budget balance as a percentage\nof the gross domestic product improved to −2.1% in 2006 from −5.5% in 2004.\n\nIn 2012, Kenya set a budget of US$14.59B with a government revenue of\napproximately US$12B.\n\nThe 2018 budget policy report set a budget of US$30B. The government revenue\nwas approximately US$29.5B, and a deficit of US$5B was borrowed.\n\nIn the financial year that ended in June 2020, the Kenya Revenue Authority\ncollected a tax revenue that amounted to approximately US$15B."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Government debt",
    "text": "From 1982, Kenya key public debt indicators rose above critical levels, both\nmeasured as a percentage of GDP and as a percentage of government revenue.\n\nIn 2002, the last year of Daniel arap Moi's administration, Kenya' s public\ndebt stood at almost 80% of GDP. In the last 10 years of the Moi regime, the\ngovernment was spending 94% of all its revenue on salaries and debt servicing\nto the IMF, World Bank and other western countries.\n\nIn 2003, Mwai Kibaki's administration instituted a public debt management\ndepartment within the treasury department to bring Kenya's debt down to\nsustainable levels.\n\nIn 2006, Kenya had a current account deficit of US$1.5B. This figure was a\nsignificant increase over 2005, when the current account had a deficit of\nUS$495 million. In 2006, the current account balance as a percentage of gross\ndomestic product was −4.2.\n\nIn 2006, Kenya's external debt totalled US$6.7B. With a GDP of US$25.83B in\n2006, the public debt level stood at 27% of GDP.\n\nIn 2011, the national treasury noted that the debt was rising, growing to 40%\nof GDP in 2009 and to 54% of GDP by 2012.\n\nIn 2019, Kenya's debt had risen to an absolute amount of US$50B against a GDP\nof US$98B. The public debt level was 51% of GDP in 2019.\n\nIn 2021, Kenya's debt had risen to an absolute amount of US$65B against a GDP\nof US$101B.The public debt level was 65% of GDP in 2021.\n\nKenya's largest bilateral lender since 2011 has been China, and the largest\nmultilateral lender since 1963 has been the World Bank.\n\nIn April 2025, Kenya secured $600 million in short-term financing from\ncommercial banks to support road construction projects, amid persistent\nbudgetary pressures stemming from sluggish tax revenue growth, high debt\nservicing costs, and increased spending obligations, including at the county\nlevel. The financing, backed by securitised collections from the national fuel\nlevy, set at 18 Kenyan shillings (approximately $0.14) per litre, was arranged\nthrough the Kenya Roads Board to enable access to more affordable credit.\nAccording to Finance Minister John Mbadi, the funds will be directed toward\npaying contractors for urgent road maintenance while the government continues\nto pursue a larger funding arrangement, potentially a $1.5 billion privately\nplaced bond or syndicated loan. This initiative complements broader efforts by\nPresident William Ruto’s administration, which came into office in September\n2022, to address infrastructure financing gaps. Separately, Kenya plans to\nissue Africa’s first sustainability-linked bond by November 2025, targeting\n$500 million to support the national budget and contribute to environmental,\nsocial, and energy-related goals. This move is part of the government's\nstrategy to manage an anticipated budget deficit of 3.9% of GDP for the fiscal\nyear ending June 2025."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Economic Stimulus Programme",
    "text": "The Kenya Economic Stimulus Programme was introduced in the 2010–2011 budget\nplan.[82] The initiative aimed to stimulate economic activity in Kenya through\ninvestment in long-term solutions to food insecurity, rural unemployment, and\nunderdevelopment. Business loans in Kenya were a key component of this\nstrategy, providing much-needed financial support to small and medium\nenterprises (SMEs) to drive growth and innovation. Stated improvement\nobjectives included regional development for equity and social stability,\ninfrastructure, education, affordable health care, environmental conservation,\ninformation and communications technology capacity, and access to IT.[83]"
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Integrated Financial Management Information System",
    "text": "The Integrated Financial Management Information System (IFMIS) was launched in\n2003 as a digital platform for Kenya's financial information and services, and\nwas later re-engineered by the Ministry of Finance to curb fraud and other\nmalpractices. IFMIS enables integrated budget planning, being linked to\nplanning policy objectives and budget allocation."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Funds for the Inclusion of Informal Sector",
    "text": "The Fund for the Inclusion of Informal Sector (FIIS) is a fund that allows\nbusinesses in the informal economy to access credit financing and other\nfacilities, including financial and banking services."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "3.6",
    "section_name": "Investor compensation fund",
    "text": "The Investor Compensation Fund compensates investors who suffer losses from\nbreaches of duty by a licensed stockbroker or dealer, up to a maximum of\nSh.50,000 per investor."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Foreign economic relations",
    "text": "Kenyan exports.\n\nForeign investments in Kenya remain relatively weak considering the size of\nits economy and its level of development. As of 2022, Kenya's total FDI stock\nstood at USD 10.4 billion, accounting for a mere 9.5% of the country’s GDP.\n\nInvestments come from China, Japan, Russia, the United States, and the United\nKingdom, among others. Kenya hosts a number of foreign multinational companies\nand international organisations such as the United Nations Environment\nProgramme. China's investments have been increasing, while those of western\ncountries such as the United Kingdom has fallen significantly. Investments\nfrom multilateral agencies, particularly the World Bank and the European\nDevelopment Fund, have also increased. The most active investors currently are\nthe Chinese.\n\nKenya is active within regional trade blocs such as the Common Market for\nEastern and Southern Africa and the East African Community, a partnership of\nKenya, Uganda, Tanzania, Rwanda, Burundi and South Sudan. The aim of the\nlatter is to create a common market of its member states modelled on the\nEuropean Union. Among the early steps toward integration is the bloc's customs\nunion, which has eliminated duties on goods and non-tariff trade barriers\namong members."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Exports",
    "text": "Kenya's chief exports are horticultural products and tea. In 2005, the\ncombined value of these commodities was US$1,150 million, about 10 times the\nvalue of Kenya's third most valuable export, coffee. Kenya's other significant\nexports are petroleum products, fish, cement, pyrethrum, and sisal. The\nleading imports are crude petroleum, chemicals, manufactured goods, machinery,\nand transportation equipment. Africa is Kenya's largest export market,\nfollowed by the European Union.\n\nThe major destinations for exports are Uganda, Tanzania, the United Kingdom,\nand the Netherlands. Major suppliers are China, India, the United Arab\nEmirates, Saudi Arabia, and South Africa. Kenya's main exports to the United\nStates are garments traded under the terms of the African Growth and\nOpportunity Act. Notwithstanding this, Kenya's apparel industry is struggling\nto hold its ground against Asian competition and runs a trade deficit with the\nUnited States. Many of Kenya's problems relating to the export of goods are\nbelieved by economists to be caused by the fact that Kenya's exports are\ninexpensive items that do not bring substantial amounts of money into the\ncountry.\n\nKenya is the dominant trade partner for Uganda (12.3% exports, 15.6% imports)\nand Rwanda (30.5% exports, 17.3% imports)."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Balance of trade",
    "text": "Kenya typically has a substantial trade deficit. The trade balance fluctuates\nwidely because Kenya's main exports are primary commodities subject to the\neffects of both world prices and weather. In 2005 Kenya's income from exports\nwas about US$3.2 billion. The payment for imports was about US$5.7B, yielding\na trade deficit of about US$2.5B.\n\nYear  | Goods exports\n(million US$) | Goods imports\n(in million US$) | Net trade\n(in million US$)\n---|---|---|---\n2023  | $7,220  | $17,243  | −$10,023\n2020  | $6,052  | $14,390  | −$8,338\n2015  | $5,970  | $14,349  | −$8,379\n2010  | $5,211  | $11,442  | −$6,231\n2005  | $3,459  | $5,587  | −$2,127\n2000  | $1,778  | $3,022  | −$1,243\n1990  | $1,090  | $2,005  | −$915\n1980  | $1,421  | $2,345  | −$923"
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Foreign investment policies",
    "text": "Kenyan policies on foreign investment generally have been favourable since\nindependence, with occasional tightening of restrictions to promote the\nafricanisation of enterprises. Foreign investors have been guaranteed\nownership and the right to remit dividends, royalties, and capital.\n\nKenya is currently the most important source of foreign direct investments in\nUganda and Rwanda. Uganda and its neighbouring regions are the main export\ndestinations for Kenyan products. Kenya has had more success in growing its\neconomy and quality of life levels than many of its neighbours in sub-Saharan\nAfrica."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Agriculture",
    "text": "Tea farm, Kericho County Flower production\n\nKenya produced in 2018:\n\n* 5.2 million tons of sugarcane;\n* 4 million tons of maize;\n* 1.8 million tons of potato;\n* 1.4 million tons of banana;\n* 946 thousand tons of cassava;\n* 871 thousand tons of sweet potato;\n* 775 thousand tons of mango (including mangosteen and guava);\n* 765 thousand tons of beans;\n* 599 thousand tons of tomato;\n* 674 thousand tons of cabbage;\n* 492 thousand tons of tea (3rd largest producer in the world, losing only to China and India);\n* 349 thousand tons of pineapple;\n* 336 thousand tons of wheat;\n* 239 thousand tons of carrot;\n* 233 thousand tons of avocado;\n* 206 thousand tons of sorghum;\n* 188 thousand tons of watermelon;\n* 179 thousand tons of cowpea;\n* 169 thousand tons of spinach;\n* 131 thousand tons of papaya;\n* 92 thousand tons of coconut;\n* and 41 thousand tons of coffee.\n\nAgriculture is the second largest contributor to Kenya's GDP, after the\nservice sector, although only 15% of Kenya's total land area has sufficient\nfertility and rainfall to be farmed, and only 7 or 8% can be classified as\nfirst-class land. In 2006, almost 75% of working Kenyans made their living on\nthe land, compared with 80% in 1980. About half of total agricultural output\nis non-marketed subsistence production.\n\nIn 2005, agriculture, including forestry and fishing, accounted for about 24%\nof GDP, as well as for 18% of wage employment and 50% of revenue from exports.\nThat same year, horticulture accounted for 23% and tea for 22% of total export\nearnings. The principal cash crops in Kenyan agriculture are tea,\nhorticultural produce, and coffee. Coffee has declined in importance with\ndepressed world prices, accounting for just 5% of export receipts in 2005. The\nproduction of major food staples such as corn is subject to sharp weather-\nrelated fluctuations. Production downturns also periodically necessitate food\naid. In 2004, aid was needed for 1.8 million people because of Kenya's\nintermittent droughts. However, the expansion of credit to the agricultural\nsector has enabled farmers to better deal with environmental and pricing\nrisks.\n\nTea, coffee, sisal, pyrethrum, corn, and wheat are grown in the fertile\nhighlands, one of the most successful agricultural production regions in\nAfrica. Livestock predominates in the semi-arid savanna to the north and east.\nCoconuts, pineapples, cashew nuts, cotton, sugarcane, sisal, and corn are\ngrown in the lower-lying areas."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Forestry and fishing",
    "text": "Resource degradation has reduced output from forestry. In 2004, roundwood\nremovals came to 22,162,000 cubic meters. Fisheries are of local importance\naround Lake Victoria and have potential at Lake Turkana. Kenya's total catch\nin 2004 was 128,000 metric tons. However, output from fishing has been\ndeclining because of ecological disruption. Pollution, overfishing, and the\nuse of unauthorised fishing equipment have led to falling catches and have\nendangered local fish species."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.6",
    "section_name": "Mining and minerals",
    "text": "Soda ash train, Lake Magadi, Kajiado County\n\nKenya has no significant mineral endowment. The mining and quarrying sector\nmakes a negligible contribution to the economy, accounting for less than 1% of\nGDP. The majority of this is contributed by the soda ash operation at Lake\nMagadi in south-central Kenya. Thanks largely to rising soda ash output,\nKenya's mineral production in 2005 reached more than 1 million tons. One of\nKenya's largest foreign-investment projects in recent years is the planned\nexpansion of Magadi Soda. Apart from soda ash, the chief minerals produced are\nlimestone, gold, salt, large quantities of niobium, fluorspar, and fossil\nfuel.\n\nAll unextracted minerals are government property, under the Mining Act. The\nDepartment of Mines and Geology, under the Ministry of Environment and Natural\nResources, controls exploration and exploitation of minerals."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.7",
    "section_name": "Industry and manufacturing",
    "text": "Although Kenya is the most industrially developed country in East Africa,\nmanufacturing still accounts for only 14% of GDP. This represents only a\nslight increase since independence. The rapid expansion of the sector\nimmediately after independence stagnated in the 1980s, hampered by shortages\nin hydroelectric power, high energy costs, dilapidated transport\ninfrastructure, and the dumping of cheap imports. However, due to\nurbanisation, the industry and manufacturing sectors have become increasingly\nimportant to the Kenyan economy, and this has been reflected by an increasing\nGDP per capita. Industrial activity, concentrated around the three largest\nurban centres, Nairobi, Mombasa, and Kisumu, is dominated by food-processing\nindustries such as grain milling, beer production, sugarcane crushing, and the\nfabrication of consumer goods. Kenya also has an oil refinery that processes\nimported crude petroleum into petroleum products, mainly for the domestic\nmarket. In addition, a substantial and expanding informal sector engages in\nsmall-scale manufacturing of household goods, motor-vehicle parts, and farm\nimplements.\n\nKenya's inclusion among the beneficiaries of the US Government's African\nGrowth and Opportunity Act gave a boost to manufacturing. Since the Act took\neffect in 2000, Kenya's clothing sales to the United States increased from\nUS$44 million to US$270M in 2006. Other initiatives to strengthen\nmanufacturing include favourable tax measures, including the absence of duties\nfor capital equipment and other raw materials."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.8",
    "section_name": "Energy",
    "text": "The largest segment of Kenya's electricity supply comes from hydroelectric\nstations at dams along the upper Tana River, as well as the Turkwel Gorge Dam\nin the west. A petroleum-fired plant on the coast, geothermal facilities at\nOlkaria, and electricity imported from Uganda make up the balance. Kenya's\ninstalled capacity stood at 1,142 megawatts a year between 2001 and 2003. The\nstate-owned Kenya Electricity Generating Company, established in 1997 under\nthe name Kenya Power Company, handles the generation of electricity, while the\nKenya Power and Lighting Company handles transmission and distribution.\nShortfalls of electricity occur periodically when drought reduces water flow.\nIn 1997 and 2000, for example, drought prompted severe power rationing, with\neconomically-damaging 12-hour blackouts. Frequent outages and high costs of\npower remain serious obstacles to economic activity. Tax and other concessions\nare planned to encourage investment in hydroelectricity and in geothermal\nenergy, which Kenya has been a pioneer in adopting.\n\nKenya currently imports all crude petroleum requirements, with petroleum\naccounting for 20% to 25% of the national import bill. Hydrocarbon reserves\nhave been found in Kenya's semi-arid northern region of Turkana after several\ndecades of intermittent exploration. Offshore prospecting also continues.\nKenya Petroleum Refineries, a 50:50 joint venture between the government and\nseveral oil majors, operates the country's sole oil refinery in Mombasa. The\nrefinery's production is transported via Kenya's Mombasa–Nairobi pipeline.\nHowever, the refinery is currently non-operational.[_when?_] In 2004, oil\nconsumption was estimated at 55,000 barrels (8,700 m3) a day.\n\nTotal energy consumption in Terrawatt-hours (TWh) of Kenya  1980  | 1990  | 2000  | 2010  | 2020  | 2021\n---|---|---|---|---|---\n29  | 36  | 46  | 67  | 99  | 104\nPer capita consumption in Kilowatt-hours (KWh)\n1,815  | 1,551  | 1,479  | 1,623  | 1,902  | 1,953"
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.9",
    "section_name": "Tourism",
    "text": "Guided tours. WaterLovers Beach Resort, Diani Beach.\n\nKenya's dependence on tourism has greatly reduced over the years. Tourism,\nboth domestic and international, accounted for around 6% of Kenya’s economy in\n2023. In 2019, foreign tourist revenues stood at $1.76 billion, accounting for\nonly 1.6% of Kenya's GDP and approximately 12% of all international tourism\nreceipts in Eastern Africa.\n\nThe growing middle class in Kenya has also led to a significant growth in\ndomestic tourism over the years. This steady growth in domestic tourism has\ndefied the turmoil of elections or terror attacks. In 2014, for the first\ntime, Kenya National Bureau of Statistics data showed that the number of\nKenyans accommodated in hotel rooms was higher than that of foreign tourists,\npointing to the increasing significance of domestic tourism and highlighting\nthe need for the government to focus on promoting domestic tourism over\ninternational visitors as a way of yielding more sustainable growth in the\ntourism sector\n\nIn 2018, domestic tourists’ bed occupancy accounted for 52.9% of the total bed\noccupancy in the country.\n\nKenya offers numerous large national parks in a wide variety of landscapes.\nBesides the coast, there are large deserts, steppes and mountains. The\nnational parks and nature reserves contain the natural habitats of many animal\nspecies."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.10",
    "section_name": "Financial services",
    "text": "Kenya is East Africa's hub for financial services. The Nairobi Stock Exchange\n(NSE) is ranked 4th in Africa in terms of market capitalisation.\n\nThe banking sector in Kenya is regulated by The Central Bank Of Kenya. Kenya's\nbanking sector is mainly dominated by local commercial banks, namely Equity\nBank, Kenya Commercial Bank, NCBA Bank, Diamond Trust Bank, Cooperative Bank,\nand National Bank. The Kenya Commercial Bank is the largest bank in Kenya by\nasset size and branch network as of 2023.\n\nKenya enjoys the presence of a number of high-profile accounting firms. The\nBig Four firms, Mazars, Grant Thornton International, and PKF International\nactively operate within the financial system, and are often responsible for\nthe audit of Nairobi Stock Exchange firms."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "4.11",
    "section_name": "Shipbuilding",
    "text": "Kenya’s first commercial-sized ship to be built from scratch—not only in Kenya\nbut also in the whole of East Africa—was launched in October 2023. The\n1800-ton vessel, the MV Uhuru II, will ferry goods and petroleum across Lake\nVictoria."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Labour",
    "text": "In 2022, Kenya's labour force was estimated to include about 24 million\nworkers. In recent years, much of Kenya's labour force has moved from the\ncountryside to cities such as Nairobi, as Kenya becomes increasingly\nurbanised.\n\nThe labour force participation rate in Kenya has been constant from 1997 to\n2010 for both women and men. In 1997, 65% of women were employed in some type\nof labour and 76% of men were employed. In 2005, 60% of women and 70% of men\nwere in the labour force, increasing slightly to 61% of women and 72% of men\nin 2010.\n\nIn the past 20 years, many Kenyans have moved away from family farming towards\nwage labour, small business entrepreneurship, and informal work. In 1989, 4.5\nmillion Kenyans out of a total working population of 7.3M worked on family\nfarms. In 2009, only 6.5M Kenyans out of a total working population of 14.3M\nworked on family farms. Of these, 3.8M were women and 2.7M were men.\n\nAccording to the World Bank 2012 Kenya Economic Update, modern wage jobs\ninclude being an \"engineer, telecommunication specialist, cut flower worker,\nteacher, construction worker, housekeepers, professionals, any industrial and\nmanufacturing job, and port and dock workers.\" In 1989, there were only 1.9M\nKenyans employed in wage work. In 2009, this number increased to 5.1M, with\n3.4M men and 1.3M women were employed in wage jobs."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Informal economy (\"Jua Kali\")",
    "text": "In Kenya, the \"Jua Kali\" sector is another name for the informal economy, also\ndescribed as non-farming self-employment. Jua Kali is Swahili for \"hot sun\"\nand refers to the idea that the workers in the informal economy work under the\nfierce sun. The informal sector consists of legally unrecognised and\nunregulated self-employment and wage employment. As a result, informal sector\nemployment does not contribute to Kenya's GDP. Non-farm self-employment has\nrisen from 1989 to 2009.\n\nThe World Bank characterises non-farm self-employment to include jobs such as\n\"street vendor, shop owner, dressmaker, assistant, fishmonger, caterer, etc.\"\nNon-farm self-employment has risen from a total of 0.9 million workers in 1989\nto a total of 2.7 million in 2009. Men make up 1.4 million workers, and women\nworkers number 1.3 million.\n\nAs of 2009, Kenya's informal economy accounts for about 80% of the total\nemployment for the country. Most informal workers are self-employed, with few\nentrepreneurs employing others. The informal sector contributes economic\nactivity equal to 35% of the total GDP in Kenya, and has its own informal\nfinance structure in the form of rotating savings and credit associations.\nThis sector provides an income mainly for those in lower socioeconomic groups.\n\nDrawbacks of the informal economy include the promotion of smuggling and tax\nevasion and the lack of social and legal protection. Most members of the\ninformal sector have low educational attainment. Rising costs of education and\nuncertainty about future employment have caused many workers to enter the\ninformal economy, due to lower entry fees as well as shorter and practical\ntraining and apprenticeships."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Human capital",
    "text": "Kenya has one of the best human capital in Africa. According to the World\nBank's 2019 Human Capital Index (HCI), which measured human capital of the\nnext generation, Kenya ranked first in sub-Saharan Africa with an HCI score of\n0.52. The index combined several key indicators, such as school enrolment,\nchild survival, quality of learning, healthy growth and adult survival into a\nsingle index ranging between 0–1."
  },
  {
    "chapter_name": "Economy of Kenya",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Challenges",
    "text": "The economy's heavy dependence on rain for its agriculture leaves it\nvulnerable to periods of high inflation during droughts. The agricultural\nsector employs nearly 33% of the total labour force.\n\nKenya's economic performance had for a long time been hampered by various\nfactors: heavy dependence on a few agricultural exports vulnerable to global\nprice fluctuations; population growth which has outstripped economic growth;\nprolonged droughts requiring power rationing; deteriorating infrastructure;\nand extreme income inequality. Some of these issues have been addressed by\npolicies, with GDP growth increasing, population growth slowing, rapid\ninfrastructural improvements being made and increased electrification rates\nwith more stable power supplies.\n\nPoor governance and corruption also have had a negative impact on growth,\nmaking it expensive to do business in Kenya.\n\nDespite these challenges, two thirds of Kenyans expect living conditions to\nimprove in the coming decades."
  }
]