[
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Map of NauruTree map of Nauru\n\nThe **economy of Nauru** is tiny, based on a population in 2019 of only 11,550\npeople. The economy has historically been based on phosphate mining. With\nprimary phosphate reserves exhausted by the end of the 2010s, Nauru has sought\nto diversify its sources of income. In 2020, Nauru's main sources of income\nwere the sale of fishing rights in Nauru's territorial waters, and revenue\nfrom the Regional Processing Centre (an offshore Australian immigration\ndetention facility).\n\nNauru is dependent on foreign aid, chiefly from Australia, Taiwan and New\nZealand.",
    "openai_summarised_points": [
      "• The economy of Nauru is very small, with a population of only 11,550 people as of 2019.",
      "• Historically, Nauru's economy was primarily based on phosphate mining, which was the main economic activity for many years.",
      "• By the end of the 2010s, Nauru's primary phosphate reserves were exhausted, necessitating efforts to diversify its sources of income.",
      "• In 2020, Nauru's principal sources of income included the sale of fishing rights within its territorial waters.",
      "• Another significant source of revenue in 2020 was the Regional Processing Centre, an offshore Australian immigration detention facility located in Nauru.",
      "• Nauru is heavily dependent on foreign aid, receiving substantial assistance mainly from Australia, Taiwan, and New Zealand."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:00:38.923206",
      "openai_model": "gpt-4.1-mini",
      "content_length": 590,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic performance",
    "text": "In the years after independence in 1968, Nauru possessed the highest GDP per\ncapita in the world due to its rich phosphate deposits.[_citation needed_] In\nanticipation of the exhaustion of phosphate deposits, a substantial amount of\nthe income from phosphates was invested in trust funds aiming to help cushion\nthe transition and provide for Nauru's economic future. However, because of\nheavy spending, including poor foreign investment, the government is\nnow[_when?_] facing bankruptcy. To cut costs the government called for a\nfreeze on wages, a reduction in public service staffing, privatization of\nnumerous government agencies, and closure of some of Nauru's overseas\nconsulates.[_citation needed_] Economic uncertainty caused by financial\nmismanagement and corruption, combined with shortages of basic goods, resulted\nin domestic unrest.[_citation needed_] In 2004, Nauru was faced with chaos\namid political strife and the collapse of the island's telecommunications\nsystem. Moreover, the deterioration of housing and hospitals has\ncontinued.[_citation needed_]\n\nFew comprehensive statistics on the Nauru economy exist, with estimates of\nNauru's GDP varying widely. According to the U.S. State Department, Nauru's\nGDP volume was US$1 million in 2004.[_need quotation to verify_] Nauru\nreceives about US$20 million foreign aid a year from Australia.\n\nThe nation's economy has grown significantly since 2012, with help from the\nreopening of the Nauru Regional Processing Centre, funded by Australia.\n\nThe most recent 2022-23 Nauru Budget recognized expected revenues of $252.5\nmillion and expenditure of $251.9 million (20% increase from Budget 2021–2022)\nwith a $549,000 surplus balance. The surplus will provide cash reserves at the\nbank and help Nauru manage future economic uncertainties.",
    "openai_summarised_points": [
      "• Following its independence in 1968, Nauru had the highest GDP per capita globally, attributed to its abundant phosphate deposits.",
      "• Anticipating the depletion of phosphate resources, Nauru invested a substantial portion of phosphate-derived income into trust funds intended to support economic transition and future stability.",
      "• Despite these investments, heavy government spending and poor foreign investment decisions have led Nauru to face bankruptcy, though the exact timing of this financial crisis is unspecified.",
      "• To address fiscal challenges, the government implemented cost-cutting measures including a wage freeze, reduction of public service personnel, privatization of multiple government agencies, and closure of several overseas consulates.",
      "• Financial mismanagement and corruption contributed to economic uncertainty, shortages of basic goods, and domestic unrest within Nauru.",
      "• In 2004, Nauru experienced political turmoil and the collapse of its telecommunications infrastructure, alongside ongoing deterioration of housing and hospital facilities.",
      "• Comprehensive economic statistics for Nauru are scarce, with widely varying GDP estimates; the U.S. State Department reported Nauru’s GDP as US$1 million in 2004, though this figure requires verification.",
      "• Nauru receives approximately US$20 million annually in foreign aid from Australia.",
      "• Since 2012, Nauru’s economy has seen significant growth, partly due to the reopening of the Nauru Regional Processing Centre, which is funded by Australia.",
      "• The 2022-23 Nauru Budget projected revenues of $252.5 million and expenditures of $251.9 million, marking a 20% increase from the 2021–2022 budget, resulting in a surplus of $549,000.",
      "• This budget surplus is intended to bolster cash reserves held in banks and assist Nauru in managing future economic uncertainties."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:00:46.189064",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1796,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Balance of payments",
    "text": "Phosphate is Nauru's only export product, although the government also\nreceives relatively significant foreign exchange income from licensing its\nrich skipjack tuna fishing grounds to foreign fishing vessels, which land an\nannual average of 50,000 tonnes of Nauru zone-caught tuna overseas. In 2004\nincome from phosphate export was US$640,000, with Australia, New Zealand and\nJapan serving as the country's major export markets. In the same year the\nNauru government budget shows that income from licensing foreign fishing\nvessels was over US$3,000,000.[_citation needed_]\n\nNauru needs to import almost all basic and capital goods, including food,\nwater, fuel, and manufactured goods, with Australia and New Zealand as its\nmajor import sources. In 2004 Nauru's imports totaled about US$19.8 million.",
    "openai_summarised_points": [
      "• Phosphate constitutes the sole export product of Nauru, representing the primary source of export revenue for the country.",
      "• The Nauru government also generates significant foreign exchange income by licensing its rich skipjack tuna fishing grounds to foreign fishing vessels.",
      "• These foreign fishing vessels catch an annual average of 50,000 tonnes of tuna within the Nauru fishing zone, with the tuna being landed overseas.",
      "• In 2004, income from phosphate exports amounted to US$640,000.",
      "• The major export markets for Nauru's phosphate in 2004 included Australia, New Zealand, and Japan.",
      "• In the same year, the Nauru government budget recorded income exceeding US$3,000,000 from licensing foreign fishing vessels to fish in its waters.",
      "• Nauru is heavily dependent on imports for nearly all basic and capital goods, including essential items such as food, water, fuel, and manufactured goods.",
      "• The principal sources of imports for Nauru are Australia and New Zealand.",
      "• In 2004, the total value of Nauru's imports was approximately US$19.8 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:00:51.724177",
      "openai_model": "gpt-4.1-mini",
      "content_length": 799,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Finance",
    "text": "Nauru has been a cash economy since at least 2004, after the Bank of Nauru and\nthe Republic of Nauru Finance Corporation went bankrupt and ceased operations\nin the early 2000s and the licenses of all offshore banks were revoked by the\nNauru government in 2004. Nauru uses the Australian dollar for its currency.\nMost government payments are executed through electronic funds transfer.\nElectronic funds transfer at point of sale was introduced in 2020. The\ngovernment is required to periodically fly in Australian currency to maintain\nliquidity.\n\nOn 2 June 2015, an agency of Bendigo and Adelaide Bank, Australia's fifth\nlargest bank, was established in Nauru by the Department of Finance. Effective\nfrom the end of April 2016, Westpac, one of Australia's largest banks, ceased\nto have any dealings with the Nauru government. On 21 April 2016, it was\nannounced that the Bendigo Bank was facing pressure also to close its\noperation in Nauru.\n\nOn 14 November 2023, Bendigo and Adelaide Bank announced its intention to\ncease operation in Nauru by December 2024. On 24 January 2024, Nauru formally\nre-established diplomatic ties with the People's Republic of China after\nwithdrawing recognition of Taiwan. In early March 2024, the Bank of China sent\na delegation to Nauru to discuss its banking problems. On 18 March, Bendigo\nand Adelaide Bank announced its intention to delay its exit from Nauru, from\nDecember 2024 to July 2025.",
    "openai_summarised_points": [
      "• Since at least 2004, Nauru has operated as a cash economy following the bankruptcy and cessation of operations of the Bank of Nauru and the Republic of Nauru Finance Corporation in the early 2000s.",
      "• In 2004, the Nauru government revoked the licenses of all offshore banks, reinforcing the cash-based nature of the economy.",
      "• Nauru uses the Australian dollar (AUD) as its official currency for all transactions.",
      "• The majority of government payments in Nauru are conducted via electronic funds transfer, enhancing transactional efficiency.",
      "• Electronic funds transfer at point of sale (EFTPOS) systems were introduced in Nauru in 2020, marking a significant development in the country’s payment infrastructure.",
      "• To maintain liquidity, the Nauru government is required to periodically import Australian currency by air.",
      "• On 2 June 2015, the Department of Finance of Nauru established an agency of Bendigo and Adelaide Bank, which is Australia’s fifth largest bank, to operate within Nauru.",
      "• By the end of April 2016, Westpac, one of Australia’s largest banks, ceased all dealings with the Nauru government, indicating a withdrawal of major Australian banking services.",
      "• On 21 April 2016, it was publicly announced that Bendigo and Adelaide Bank was also facing pressure to close its operations in Nauru, signaling challenges in maintaining banking services on the island.",
      "• On 14 November 2023, Bendigo and Adelaide Bank formally announced its intention to cease operations in Nauru by December 2024.",
      "• On 24 January 2024, Nauru officially re-established diplomatic relations with the People’s Republic of China after withdrawing its recognition of Taiwan, marking a significant geopolitical shift.",
      "• In early March 2024, the Bank of China sent a delegation to Nauru to discuss the country’s banking challenges, indicating potential Chinese involvement in Nauru’s financial sector.",
      "• On 18 March 2024, Bendigo and Adelaide Bank announced a delay in its planned exit from Nauru, extending its operational presence from December 2024 to July 2025."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:00.843556",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1425,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Taxation",
    "text": "On October 1, 2014, an income tax was imposed in Nauru for the first time,\nwith high income earners paying a flat rate of 10%. The government spending in\n2015 was forecast to be under US$92 million. Taxes include an airport\ndeparture tax and a bed tax at the Meneñ Hotel. The 2007–08 Budget saw the\nincrease of existing excises on cigarettes and duty on imports. A tax on\nsugary foods was also introduced, chiefly to help combat Nauru's diabetes\nepidemic.",
    "openai_summarised_points": [
      "• On October 1, 2014, Nauru implemented an income tax for the first time in its history, applying a flat rate of 10% specifically to high income earners.",
      "• The government expenditure for the year 2015 was projected to remain below US$92 million.",
      "• Nauru's taxation system includes an airport departure tax, which is levied on travelers leaving the country.",
      "• A bed tax is imposed at the Meneñ Hotel, contributing to the country's tax revenue.",
      "• The 2007–08 Budget introduced increases to existing excise taxes on cigarettes, as well as raising duties on imported goods.",
      "• A new tax on sugary foods was established primarily as a public health measure aimed at addressing and mitigating Nauru's significant diabetes epidemic."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:04.935061",
      "openai_model": "gpt-4.1-mini",
      "content_length": 455,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Tax haven status",
    "text": "Historically Nauru was regarded as a tax haven due to the operation of its\ninternational financial centre, which offered amongst other things offshore\nbanking services. In 2001, Nauru was blacklisted internationally over concerns\nit had become a haven for money laundering. Amendments made in 2004 abolished\nNauru's Offshore Banking sector and, as recognised in Nauru's latest anti-\nmoney laundering and combating the financing of terrorism (AML/CFT) review,\nNauru's offshore sector is now limited to a small offshore company register.\n\nIn July 2017 the Organisation for Economic Co-operation and Development (OECD)\nupgraded its rating of Nauru's standards of tax transparency. Nauru had been\nlisted alongside fourteen other countries that had failed to show that they\ncould comply with international tax transparency standards and regulations.\nThe OECD subsequently put Nauru through a fast-tracked compliance process and\nthe country was given a \"largely compliant\" rating.",
    "openai_summarised_points": [
      "• Historically, Nauru was regarded as a tax haven primarily due to the operation of its international financial centre, which provided offshore banking services among other financial activities.",
      "• In 2001, Nauru was blacklisted internationally amid concerns that it had become a haven for money laundering activities.",
      "• In response to these concerns, amendments made in 2004 abolished Nauru's Offshore Banking sector entirely.",
      "• According to Nauru's latest anti-money laundering and combating the financing of terrorism (AML/CFT) review, the country's offshore sector is now limited solely to a small offshore company register.",
      "• In July 2017, the Organisation for Economic Co-operation and Development (OECD) upgraded its rating of Nauru’s standards of tax transparency.",
      "• Prior to this upgrade, Nauru had been listed alongside fourteen other countries that failed to demonstrate compliance with international tax transparency standards and regulations.",
      "• The OECD subjected Nauru to a fast-tracked compliance process following its initial listing.",
      "• As a result of this process, Nauru was awarded a \"largely compliant\" rating by the OECD, reflecting significant improvements in its tax transparency practices."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:07.698314",
      "openai_model": "gpt-4.1-mini",
      "content_length": 974,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Relationship with Australia",
    "text": "Currently,[_when?_] Nauru is heavily dependent on Australia as its major\nsource of financial support. In 2001, Nauru signed an agreement with Australia\nto accommodate asylum seekers (mostly from Iraq and Afghanistan) on the\nisland, in return for millions of dollars in aid. This agreement, referred to\nas the \"Pacific Solution\", came to an end in 2007, prompting Nauruan concerns\nabout the future of the island's revenue. Australia has also sent financial\nexperts to Nauru to help the tiny nation overcome its economic problems.\nHowever, serious questions remain about the long-term viability of Nauru's\neconomy, with uncertainties about the rehabilitation of mined land and the\nreplacement of income from phosphates.\n\nIn 2008, talks began between Australia and Nauru regarding the future of the\nformer's economic development aid to the latter. Nauruan Foreign and Finance\nMinister Dr. Kieren Keke stated that his country did not want aid handouts.\nOne possible solution currently[_when?_] being explored would be for Australia\nto assist Nauru in setting up a \"boat repair industry\" for regional fishing\nvessels.",
    "openai_summarised_points": [
      "• Nauru is currently heavily dependent on Australia as its primary source of financial support.",
      "• In 2001, Nauru signed an agreement with Australia to accommodate asylum seekers, mostly from Iraq and Afghanistan, on the island in exchange for millions of dollars in aid.",
      "• This agreement, known as the \"Pacific Solution,\" ended in 2007, leading to concerns in Nauru about the future stability of the island’s revenue streams.",
      "• Australia has deployed financial experts to Nauru to assist the nation in addressing its ongoing economic difficulties.",
      "• Despite these efforts, significant doubts persist regarding the long-term sustainability of Nauru’s economy, particularly concerning the rehabilitation of mined land and the need to replace income previously generated from phosphate mining.",
      "• In 2008, discussions commenced between Australia and Nauru about the future direction of Australia’s economic development aid to Nauru.",
      "• Nauruan Foreign and Finance Minister Dr. Kieren Keke expressed that Nauru does not desire aid handouts, indicating a preference for sustainable economic solutions.",
      "• One potential initiative under consideration involves Australia helping Nauru establish a \"boat repair industry\" aimed at servicing regional fishing vessels, as a means to diversify and strengthen Nauru’s economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:14.046145",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1112,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Nauru detention centre",
    "text": "The Nauru detention centre was established by the Australian government, with\nNauruan agreement, in 2001 to cater for up to 800 refugees and asylum seekers\nunder Australia's Pacific solution. The centre is seen by Nauruans as an\nimportant source of employment opportunities, in addition to the pledge of\nA$20 million for development activities.[_citation needed_] The program was\ngradually scaled back after 14 detainee deaths, multiple suicide attempts and\nsix referrals to the International Criminal Court.",
    "openai_summarised_points": [
      "• The Nauru detention centre was established in 2001 through an agreement between the Australian government and the government of Nauru.",
      "• The centre was designed to accommodate up to 800 refugees and asylum seekers as part of Australia's Pacific Solution policy.",
      "• Nauruans regard the detention centre as a significant source of employment opportunities within the country.",
      "• Alongside employment, the Australian government pledged A$20 million for development activities in Nauru linked to the detention centre arrangement.",
      "• The detention centre program was gradually scaled back following serious incidents, including 14 detainee deaths and multiple suicide attempts.",
      "• Additionally, six referrals related to the detention centre were made to the International Criminal Court, contributing to the reduction of the program."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:17.324329",
      "openai_model": "gpt-4.1-mini",
      "content_length": 508,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Economic statistics",
    "text": "* GDP: purchasing power parity \\- US$60 million (2001 est.)\n* GDP per capita: purchasing power parity \\- US$5,000 (2001 est.)\n* Inflation rate (consumer prices): -3.6% (1993)\n* Budget: revenues: US$23.4 million; expenditures: US$ million (1995/96)\n* External debt: US$33.3 million\n* Economic aid \\- receives around US$2.25 million from Australia (1996/97 est.)\n* Currency: Australian dollar\n\nThe fiscal year runs from July 1 to June 30.",
    "openai_summarised_points": [
      "• The Gross Domestic Product (GDP) of Nauru, measured by purchasing power parity, was estimated at US$60 million in 2001.",
      "• The GDP per capita of Nauru, based on purchasing power parity, was approximately US$5,000 in 2001.",
      "• The inflation rate, as measured by consumer prices, was recorded at -3.6% in the year 1993, indicating deflation during that period.",
      "• For the fiscal year 1995/96, Nauru's government budget revenues amounted to US$23.4 million; however, the expenditures figure is unspecified in the available data.",
      "• Nauru's external debt was reported to be US$33.3 million, reflecting the country's outstanding financial obligations to foreign creditors.",
      "• In the fiscal year 1996/97, Nauru received economic aid totaling approximately US$2.25 million from the government of Australia.",
      "• The official currency used in Nauru is the Australian dollar, facilitating monetary transactions and economic activities.",
      "• Nauru’s fiscal year spans from July 1 to June 30, defining the period for its governmental financial accounting and budgeting."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:22.343934",
      "openai_model": "gpt-4.1-mini",
      "content_length": 436,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Employment",
    "text": "* Labour force are mainly employed in mining phosphates, public administration by RONPhos, education and transport\n* In 2004, the unemployment rate was close to 90%. In February 2008, foreign affairs minister Dr. Kieren Keke stated: \"We have got a major unemployment crisis in front of us.\" By 2011, the unemployment rate had decreased to 23%.\n* Main industries are phosphate mining, offshore banking, coconut products\n* Electricity production (fossil fuels) and consumption are around 30 GWh (2000)\n* Agriculture is not a major employer, coconuts are the main produce",
    "openai_summarised_points": [
      "• The labour force in Nauru is primarily employed in phosphate mining, public administration through the Republic of Nauru Phosphate Corporation (RONPhos), education, and transport sectors.",
      "• In 2004, Nauru experienced an unemployment rate close to 90%, indicating a severe employment crisis.",
      "• By February 2008, the unemployment situation remained critical, with Foreign Affairs Minister Dr. Kieren Keke publicly stating, \"We have got a major unemployment crisis in front of us.\"",
      "• By 2011, the unemployment rate in Nauru had significantly decreased to 23%, reflecting some improvement in employment conditions.",
      "• The main industries driving Nauru’s economy include phosphate mining, offshore banking, and the production of coconut-based products.",
      "• Electricity production and consumption in Nauru, primarily generated from fossil fuels, were approximately 30 gigawatt-hours (GWh) as of the year 2000.",
      "• Agriculture does not constitute a major source of employment in Nauru, with coconuts being the principal agricultural product cultivated."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:01:26.876890",
      "openai_model": "gpt-4.1-mini",
      "content_length": 568,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 2004–2022 (with IMF\nstaff estimates for 2019–2027). Inflation below 3% is in green.\n\nYear  | GDP\n(in mil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in mil. US$\nnominal) | GDP per capita\n(in US$ nominal) | Inflation rate  | Government debt\n(as % of GDP)\n---|---|---|---|---|---|---\n2004  | 35  | 3,174.9  | 32  | 3,504.2  | n/a  | n/a\n2005  | 36  | 3,167.6  | 31  | 3,647.1  | 8.6%  | n/a\n2006  | 40  | 3,200.7  | 29  | 4,438.1  | 19.3%  | n/a\n2007  | 32  | 3,487.7  | 23  | 3,487.7  | 5.6%  | n/a\n2008  | 40  | 3,965.3  | 37  | 4,207.1  | 1.03%  | n/a\n2009  | 43  | 4,587.7  | 44  | 4,541.9  | 3.5%  | 247.9%\n2010  | 49  | 4,748.1  | 47  | 4,892.8  | -1.9%  | 243.2%\n2011  | 55  | 6,529.4  | 66  | 5,473.5  | -3.3%  | 188.1%\n2012  | 62  | 9,382.6  | 97  | 5,980.83  | 0.2%  | 127.5%\n2013  | 83  | 9,103.5  | 99  | 7,642.4  | -1.1%  | 121.6%\n2014  | 107  | 8,865.6  | 105  | 9,042.8  | 0.2%  | 105.8%\n2015  | 112  | 6,994.1  | 87  | 8,974.5  | 9.7%  | 80%\n2016  | 116  | 7,674.4  | 100  | 8,927.4  | 8.1%  | 79.5%\n2017  | 112  | 8,152.9  | 110  | 8,341.6  | 5.1%  | 77.5%\n2018  | 121  | 9,398.5  | 124  | 9,197.2  | 0.4%  | 75.1%\n2019  | 125  | 9,365.4  | 119  | 9,856.4  | 4.3%  | 62.8%\n2020  | 127  | 8,866.8  | 114  | 9,852.9  | -6.5%  | 61.3%\n2021  | 134  | 10,139.1  | 133  | 10,221.4  | 1.2%  | 27%\n2022  | 145  | 10,004.7  | 134  | 10,834.3  | 2.0%  | 27.3%\n2023  | 154  | 10,096.2  | 138  | 11,228.6  | 2.0%  | 24.9%\n2024  | 161  | 10,162.8  | 142  | 11,512.8  | 2.0%  | 22.8%\n2025  | 167  | 10,156.6  | 144  | 11,733.4  | 2.0%  | 20.9%\n2026  | 173  | 10,088.1  | 146  | 11,934.3  | 2.0%  | 19%\n2027  | 180  | 10,071.5  | 149  | 12,150.8  | 2.0%  | 16.5%"
  },
  {
    "chapter_name": "Economy of Nauru",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Trade",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( May 2025)__(Learn how and when to remove this message)_\n---|---\n\n* Exports - valued at US$30 million (2018). Fish, calcium phosphates, low-voltage protection equipment, air conditioners, leather apparel. Major trading partners include Thailand 34%, Australia 16%, United States 13%, and South Korea 10%.\n* Imports - valued at US$90 million (2018). Refined petroleum, construction vehicles, tug boats, poultry meats, cars. Major partners are Taiwan 52% and Australia 28%."
  }
]