[
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Italy** is a highly developed social market economy. It is\nthe third-largest national economy in the European Union, the 8th-largest\neconomy in the world by nominal GDP, and the 11th-largest by PPP-adjusted GDP.\nThe country has the second-largest manufacturing industry in Europe, which is\nalso the 7th-largest in the world. Italy has a diversified economy which is\ndominated by the tertiary service sector. The country is a great power, and is\na founding member of the European Union, the eurozone, the Schengen Area, the\nOECD, the G7 and the G20; it is the eighth-largest exporter in the world, with\n$611 billion exported in 2021. Its closest trade ties are with the other\ncountries of the European Union, with whom it conducts about 59% of its total\ntrade. Its largest trading partners are Germany (12.5%) and France (10.3%),\nfollowed by the United States (9%), Spain (5.2%), the United Kingdom (5.2%)\nand Switzerland (4.6%).\n\nIn the post-World War II period, Italy saw a transformation from an\nagricultural-based economy which had been severely affected by the\nconsequences of the World Wars, into one of the world's most advanced nations,\nand a leading country in world trade and exports. According to the Human\nDevelopment Index, the country enjoys a very high standard of living.\nAccording to _The Economist_ , Italy has the world's 8th highest quality of\nlife. Italy owns the world's third-largest gold reserve, and is the third-\nlargest net contributor to the budget of the European Union. Furthermore, the\nadvanced country private wealth is one of the largest in the world. In terms\nof private wealth, Italy ranks second, after Hong Kong, in private wealth to\nGDP ratio. Among OECD members, Italy has a highly efficient and strong social\nsecurity system, which comprises roughly 24.4% of GDP.\n\nItaly is the world's seventh-largest manufacturing country, characterised by a\nsmaller number of global multinational corporations than other economies of\ncomparable size and many dynamic small and medium-sized enterprises,\nnotoriously clustered in several industrial districts, which are the backbone\nof the Italian economy. Italy is a large manufacturer and exporter of a\nsignificant variety of products. Its products include machinery, vehicles,\npharmaceuticals, furniture, food and clothing. Italy has a significant trade\nsurplus. The country is also well known for its influential and innovative\nbusiness economic sector, an industrious and competitive agricultural sector\n(Italy is the world's largest wine producer), and manufacturers of creatively\ndesigned, high-quality products: including automobiles, ships, home\nappliances, and designer clothing. Italy is the largest hub for luxury goods\nin Europe and the third-largest luxury hub globally. Italy has a strong\ncooperative sector, with the largest share of the population (4.5%) employed\nby a cooperative in the EU.\n\nDespite these important achievements, the country's economy today suffers from\nfew structural and non-structural problems. Annual growth rates have often\nbeen below the EU average. Italy was somewhat hit by the late-2000s recession.\nMassive government spending from the 1980s onwards has produced a severe rise\nin public debt. In addition, Italian living standards are extremely high on\naverage, but have a considerable North–South divide: the average GDP per\ncapita in the much richer Northern Italy significantly exceeds the EU average,\nwhile some regions and provinces in Southern Italy are significantly below the\naverage. In Central Italy, GDP per capita is instead average. In recent years,\nItaly's GDP per capita growth slowly caught-up with the eurozone average,\nwhile its employment rate also did. However, economists dispute the official\nfigures because of the large number of informal jobs (estimated to be between\n10% and 20% of the labour force) that lift the inactivity or unemployment\nrates. The shadow economy is highly represented in Southern Italy, while it\nbecomes less intense as one moves north. In real economic conditions, Southern\nItaly almost matches Central Italy's level.",
    "openai_summarised_points": [
      "• The economy of Italy is classified as a highly developed social market economy.",
      "• Italy is the third-largest national economy within the European Union.",
      "• It ranks as the 8th-largest economy globally by nominal GDP.",
      "• It ranks as the 11th-largest economy worldwide when adjusted for purchasing power parity (PPP).",
      "• Italy possesses the second-largest manufacturing industry in Europe, which is also the 7th-largest in the world.",
      "• The country's economy is diversified but predominantly driven by the tertiary (service) sector.",
      "• Italy is considered a great power and is a founding member of several major international organizations, including the European Union, the eurozone, the Schengen Area, the OECD, the G7, and the G20.",
      "• In 2021, Italy exported goods worth $611 billion, making it the eighth-largest exporter globally.",
      "• Approximately 59% of Italy's total trade occurs with other European Union countries, indicating strong regional trade ties.",
      "• The country's largest trading partners are Germany (12.5% of trade), France (10.3%), the United States (9%), Spain (5.2%), the United Kingdom (5.2%), and Switzerland (4.6%).",
      "• Post-World War II, Italy transitioned from an agriculture-based economy—severely impacted by the World Wars—into one of the world's most advanced nations, a leader in global trade and exports.",
      "• Italy has a very high standard of living, as evidenced by its ranking as the 8th highest quality of life globally according to _The Economist_.",
      "• Italy owns the world's third-largest gold reserve.",
      "• It is the third-largest net contributor to the European Union budget.",
      "• Italy's advanced private wealth is among the largest globally, ranking second after Hong Kong in private wealth to GDP ratio.",
      "• The country maintains a highly efficient and robust social security system, which accounts for approximately 24.4% of GDP among OECD members.",
      "• Italy is the seventh-largest manufacturing country in the world, characterized by a relatively small number of multinational corporations and numerous dynamic small and medium-sized enterprises.",
      "• Industrial districts, often clustered geographically, form the backbone of Italy’s manufacturing sector.",
      "• Italy produces and exports a wide variety of products, including machinery, vehicles, pharmaceuticals, furniture, food, and clothing.",
      "• The country maintains a significant trade surplus.",
      "• Italy is renowned for its influential and innovative business sector, as well as for its industrious and competitive agricultural sector, notably being the world's largest wine producer.",
      "• Italy is a major manufacturer and exporter of high-quality, creatively designed products such as automobiles, ships, home appliances, and designer clothing.",
      "• It is the largest luxury goods hub in Europe and the third-largest globally.",
      "• Italy has a strong cooperative sector, employing 4.5% of its population, the highest share in the European Union.",
      "• Despite economic achievements, Italy faces structural and non-structural challenges, including growth rates often below the EU average.",
      "• The country was affected by the late-2000s recession.",
      "• Massive government spending from the 1980s onward has led to a severe increase in public debt.",
      "• While living standards are generally high, there exists a significant North–South economic divide; Northern Italy's GDP per capita exceeds the EU average, whereas some Southern regions are well below it.",
      "• Central Italy's GDP per capita is approximately average within the country.",
      "• Recent years have seen a slow convergence of Italy’s GDP per capita and employment rates toward the eurozone averages.",
      "• Economists dispute official figures due to the large informal economy, estimated to comprise between 10% and 20% of the labor force, which affects unemployment and inactivity statistics.",
      "• The shadow economy is particularly prominent in Southern Italy but diminishes moving northward.",
      "• In real economic terms, Southern Italy's economic conditions are nearly comparable to those of Central Italy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:03:47.912906",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 4098,
      "bullet_points_count": 33
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "The Barsanti-Matteucci engine, the first proper internal combustion engine\n\nThe Italian Renaissance was remarkable in economic development. Venice and\nGenoa were the trade pioneers, first as maritime republics and then as\nregional states, followed by Milan, Florence, and the rest of northern Italy.\nReasons for their early development are for example the relative military\nsafety of Venetian lagoons, the high population density and the institutional\nstructure which inspired entrepreneurs. The Republic of Venice was the first\nreal international financial center, which slowly emerged from the 9th century\nto its peak in the 15th century. Tradeable bonds as a commonly used type of\nsecurity, were invented by the Italian city-states (such as Venice and Genoa)\nof the late medieval and early Renaissance periods.\n\nAfter 1600 Italy experienced an economic catastrophe. In 1600 Northern and\nCentral Italy comprised one of the most advanced industrial areas of Europe.\nThere was an exceptionally high standard of living. By 1870 Italy was an\neconomically backward and depressed area; its industrial structure had almost\ncollapsed, its population was too high for its resources, its economy had\nbecome primarily agricultural. Wars, political fractionalization, limited\nfiscal capacity and the shift of world trade to north-western Europe and the\nAmericas were key factors.\n\nThe economic history of Italy after 1861 can be divided in three main phases:\nan initial period of struggle after the unification of the country,\ncharacterised by high emigration and stagnant growth; a central period of\nrobust catch-up from the 1890s to the 1980s, interrupted by the Great\nDepression of the 1930s and the two world wars; and a final period of sluggish\ngrowth that has been exacerbated by a double-dip recession following the 2008\nglobal financial crush, and from which the country is slowly reemerging only\nin recent years.",
    "openai_summarised_points": [
      "• The Barsanti-Matteucci engine is recognized as the first proper internal combustion engine, marking a significant technological development in Italy's industrial history.",
      "• During the Italian Renaissance, Italy experienced notable economic development, with Venice and Genoa serving as pioneering maritime republics and regional trade centers.",
      "• Following Venice and Genoa, cities such as Milan, Florence, and other northern Italian regions contributed to economic growth and trade expansion.",
      "• The early economic success of these city-states was attributed to factors including the relative military safety of Venetian lagoons, high population density, and institutional structures that fostered entrepreneurial activity.",
      "• The Republic of Venice emerged as the first major international financial center, developing gradually from the 9th century and reaching its peak in the 15th century.",
      "• Italian city-states invented tradeable bonds during the late medieval and early Renaissance periods, which became a common security instrument in financial markets.",
      "• After 1600, Italy experienced a severe economic catastrophe; by this time, Northern and Central Italy had been among Europe's most advanced industrial regions with high standards of living.",
      "• By 1870, Italy had become an economically backward and depressed area, with its industrial structure nearly collapsed, a population exceeding sustainable resource levels, and an economy primarily based on agriculture.",
      "• Contributing factors to Italy’s economic decline included wars, political fractionalization, limited fiscal capacity, and the shift of global trade to north-western Europe and the Americas.",
      "• Post-1861, Italy’s economic history is divided into three main phases:",
      "• An initial period of struggle characterized by high emigration and stagnant growth following unification.",
      "• A central period of significant economic catch-up from the 1890s to the 1980s, disrupted by the Great Depression of the 1930s and the two World Wars.",
      "• A final phase marked by sluggish growth, further impacted by a double-dip recession after the 2008 global financial crisis, from which Italy has only recently begun to recover."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:03:54.161196",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1911,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Age of Industrialization",
    "text": "Terni steel mills in 1912\n\nPrior to unification, the economy of the many Italian statelets was\noverwhelmingly agrarian; however, the agricultural surplus produced what\nhistorians call a \"pre-industrial\" transformation in North-western Italy\nstarting from the 1820s, that led to a diffuse, if mostly artisanal,\nconcentration of manufacturing activities, especially in Piedmont-Sardinia\nunder the liberal rule of the Count of Cavour.\n\nAlessandro Cruto, creator of the first practical long-lasting incandescent\nlight bulb\n\nAfter the birth of the unified Kingdom of Italy in 1861, there was a deep\nconsciousness in the ruling class of the new country's backwardness, given\nthat the per capita GDP expressed in PPS terms was roughly half of that of\nBritain and about 25% less than that of France and Germany. During the 1860s\nand 1870s, the manufacturing activity was backward and small-scale, while the\noversized agrarian sector was the backbone of the national economy. The\ncountry lacked large coal and iron deposits and the population was largely\nilliterate. In the 1880s, a severe farm crisis led to the introduction of more\nmodern farming techniques in the Po valley, while from 1878 to 1887\nprotectionist policies were introduced with the aim to establish a heavy\nindustry base. Some large steel and iron works soon clustered around areas of\nhigh hydropower potential, notably the Alpine foothills and Umbria in central\nItaly, while Turin and Milan led a textile, chemical, engineering and banking\nboom and Genoa captured civil and military shipbuilding.\n\nHowever, the diffusion of industrialisation that characterised the\nnorthwestern area of the country largely excluded Venetia and, especially, the\nSouth. The resulting Italian diaspora concerned up to 26 million Italians, the\nmost part in the years between 1880 and 1914; by many scholars, it is\nconsidered the biggest mass migration of contemporary times. During the Great\nWar, the still frail Italian state successfully fought a modern war, being\nable of arming and training some 5 million recruits. But this result came at a\nterrible cost: by the end of the war, Italy had lost 700,000 soldiers and had\na ballooning sovereign debt amounting to billions of lira.",
    "openai_summarised_points": [
      "• Prior to Italian unification, the economy of the numerous Italian statelets was predominantly agrarian, with limited industrial activity.",
      "• Starting from the 1820s, a \"pre-industrial\" transformation occurred mainly in Northwestern Italy, driven by agricultural surplus, leading to a diffuse, artisanal concentration of manufacturing activities.",
      "• This early industrial development was especially prominent in Piedmont-Sardinia, which was under the liberal rule of Count of Cavour.",
      "• Alessandro Cruto, an Italian inventor, created the first practical long-lasting incandescent light bulb, marking a significant technological advancement.",
      "• After the unification of Italy in 1861, the ruling class recognized the country's economic backwardness, with per capita GDP in Purchasing Power Standards (PPS) roughly half that of Britain and about 25% less than France and Germany.",
      "• During the 1860s and 1870s, Italy's manufacturing sector remained small-scale and underdeveloped, with the economy heavily reliant on a large agrarian sector.",
      "• Italy lacked significant deposits of coal and iron, essential for industrial growth, and the population was largely illiterate, hindering industrial progress.",
      "• The 1880s farm crisis prompted the adoption of modern farming techniques in the Po Valley, aiming to improve agricultural productivity.",
      "• Between 1878 and 1887, protectionist policies were implemented to foster the development of heavy industry.",
      "• Large steel and iron works began to cluster around areas with high hydropower potential, notably the Alpine foothills and Umbria in central Italy.",
      "• Major cities such as Turin and Milan experienced growth in textiles, chemicals, engineering, and banking sectors, leading to economic booms.",
      "• Genoa became a hub for civil and military shipbuilding industries.",
      "• Industrialization primarily spread across Northwestern Italy, largely excluding Venetia and the southern regions, resulting in regional economic disparities.",
      "• The limited industrial diffusion contributed to a significant Italian diaspora, with up to 26 million Italians emigrating mainly between 1880 and 1914, representing one of the largest mass migrations of contemporary times.",
      "• During World War I, Italy successfully mobilized approximately 5 million recruits, demonstrating military capability despite economic and social fragility.",
      "• The war resulted in the loss of around 700,000 Italian soldiers and caused a substantial increase in national sovereign debt, amounting to billions of lira."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:23.604948",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2221,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Fascist regime",
    "text": "Benito Mussolini giving a speech at the Fiat Lingotto factory in Turin, 1932\n\nItaly emerged from World War I in a poor and weakened condition. The National\nFascist Party of Benito Mussolini came to power in 1922, at the end of a\nperiod of social unrest. However, once Mussolini acquired a firmer hold of\npower, laissez-faire and free trade were progressively abandoned in favour of\ngovernment intervention and protectionism.\n\nIn 1929, Italy was hit hard by the Great Depression. In order to deal with the\ncrisis, the Fascist government nationalized the holdings of large banks which\nhad accrued significant industrial securities, establishing the Istituto per\nla Ricostruzione Industriale. A number of mixed entities were formed, whose\npurpose was to bring together representatives of the government and of the\nmajor businesses. These representatives discussed economic policy and\nmanipulated prices and wages so as to satisfy both the wishes of the\ngovernment and the wishes of business.\n\nThis economic model based on a partnership between government and business was\nsoon extended to the political sphere, in what came to be known as\ncorporatism. At the same time, the aggressive foreign policy of Mussolini led\nto increasing military expenditure. After the invasion of Ethiopia, Italy\nintervened to support Franco's nationalists in the Spanish Civil War. By 1939,\nItaly had the highest percentage of state-owned enterprises after the Soviet\nUnion.\n\nItaly's involvement in World War II as a member of the Axis powers required\nthe establishment of a war economy. The Allied invasion of Italy in 1943\neventually caused the Italian political structure – and the economy – to\nrapidly collapse. The Allies, on the one hand, and the Germans on the other,\ntook over the administration of the areas of Italy under their control. By the\nend of the war, Italian per capita income was at its lowest point since the\nbeginning of the 20th century.",
    "openai_summarised_points": [
      "• Italy emerged from World War I in a poor and weakened condition, facing significant economic and social challenges.",
      "• The National Fascist Party, led by Benito Mussolini, came to power in 1922 following a period of social unrest and instability.",
      "• Once Mussolini consolidated power, Italy shifted away from laissez-faire economics and free trade towards increased government intervention and protectionism.",
      "• In 1929, Italy was severely affected by the Great Depression, which prompted the Fascist government to implement economic reforms.",
      "• To address the economic crisis, the government nationalized the holdings of large banks that had accumulated significant industrial securities, leading to the creation of the Istituto per la Ricostruzione Industriale (IRI).",
      "• The IRI served as a state-controlled holding company aimed at revitalizing Italy’s industrial sector through direct intervention.",
      "• The government established mixed entities composed of representatives from both the state and major businesses, facilitating cooperation on economic policy, price setting, and wage manipulation to align the interests of both sectors.",
      "• This partnership-based economic model, emphasizing collaboration between government and business, was extended into the political realm and became known as corporatism.",
      "• Mussolini’s aggressive foreign policy resulted in increased military expenditure, exemplified by the invasion of Ethiopia in 1935.",
      "• Italy supported Francisco Franco’s Nationalists during the Spanish Civil War (1936–1939), further demonstrating its militarization and expansionist ambitions.",
      "• By 1939, Italy had the highest percentage of state-owned enterprises after the Soviet Union, reflecting extensive state control over the economy.",
      "• Italy’s entry into World War II as a member of the Axis powers necessitated the development of a war economy to support military efforts.",
      "• The Allied invasion of Italy in 1943 led to the rapid collapse of Italy’s political and economic structures, with areas under Allied and German control being administered separately.",
      "• During the final years of the war, Italy’s per capita income declined to its lowest level since the early 20th century, indicating severe economic deterioration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:30.152275",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1936,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Post-war economic miracle",
    "text": "The Fiat 500, launched in 1957, is considered a symbol of Italy's postwar\neconomic miracle. Programma 101, developed in 1965 by Olivetti is considered\none of the first programmable calculators ever and was an economic success\ninternationally.\n\nAfter the end of World War II, Italy was in rubble and occupied by foreign\narmies, a condition that worsened the chronic development gap among the more\nadvanced European economies. However, the new geopolitical logic of the Cold\nWar made possible that the former enemy Italy, a hinge country between Western\nEurope and the Mediterranean, and now a new, fragile democracy threatened by\nthe NATO occupation forces, the proximity of the Iron Curtain and the presence\nof a strong Communist party, was considered by the United States as an\nimportant ally for the Free World, and received under the Marshall Plan over\nUS$1.2 billion from 1947 to 1951.\n\nThe end of aid through the Plan could have stopped the recovery but it\ncoincided with a crucial point in the Korean War whose demand for metal and\nmanufactured products was a further stimulus of Italian industrial production.\nIn addition, the creation in 1957 of the European Common Market, with Italy as\na founding member, provided more investment and eased exports.\n\nThese favourable developments, combined with the presence of a large labour\nforce, laid the foundation for spectacular economic growth that lasted almost\nuninterrupted until the \"Hot Autumn's\" massive strikes and social unrest of\n1969–70, which then combined with the later 1973 oil crisis and put an abrupt\nend to the prolonged boom. It has been calculated that the Italian economy\nexperienced an average rate of growth of GDP of 5.8% per year between 1951 and\n1963, and 5% per year between 1964 and 1973. Italian rates of growth were\nsecond only, but very close, to the West German rates, in Europe, and among\nthe OEEC countries only Japan had been doing better.",
    "openai_summarised_points": [
      "• The Fiat 500, launched in 1957, is widely regarded as a symbol of Italy's postwar economic miracle, representing the rapid industrial and economic recovery of the country during this period.",
      "• The Programma 101, developed in 1965 by Olivetti, is considered one of the first programmable calculators ever created and achieved significant international economic success, reflecting Italy's technological innovation during the postwar era.",
      "• Following World War II, Italy was left in ruins and occupied by foreign armies, which exacerbated the existing development gap with more advanced European economies.",
      "• The geopolitical context of the Cold War transformed Italy from a former enemy into a strategic ally of the United States, due to its position between Western Europe and the Mediterranean, its fragile democracy threatened by NATO occupation forces, proximity to the Iron Curtain, and a strong Communist Party presence.",
      "• Italy received over US$1.2 billion in aid from the Marshall Plan between 1947 and 1951, which was crucial for its economic recovery.",
      "• The end of Marshall Plan aid threatened to halt Italy’s recovery; however, the Korean War (which began in 1950) created increased demand for metal and manufactured products, providing an additional stimulus to Italian industrial production.",
      "• The establishment of the European Common Market in 1957, with Italy as a founding member, further promoted economic growth by attracting more investments and facilitating exports.",
      "• The combination of these favorable conditions, along with a large labor force, laid the groundwork for a prolonged period of spectacular economic growth in Italy.",
      "• Italy’s economic boom lasted almost uninterrupted until the social unrest and massive strikes of the \"Hot Autumn\" in 1969–70, which marked a turning point.",
      "• The boom was subsequently interrupted by the 1973 oil crisis, which contributed to an abrupt end to the long-lasting economic expansion.",
      "• It is estimated that Italy’s GDP grew at an average annual rate of 5.8% between 1951 and 1963.",
      "• From 1964 to 1973, Italy’s GDP growth rate averaged 5% per year.",
      "• During this period, Italy’s economic growth rates were second only to West Germany in Europe, and among OEEC countries, only Japan experienced higher growth rates."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:34.767906",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1924,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "The 1970s and 1980s: from stagflation to \"il sorpasso\"",
    "text": "Prime Minister Giulio Andreotti (far left) with G7 leaders in Bonn, 1978\n\nThe 1970s were a period of economic, political turmoil and social unrest in\nItaly, known as Years of lead. Unemployment rose sharply, especially among the\nyoung, and by 1977 there were one million unemployed people under the age of\n24. Inflation continued, aggravated by the increases in the price of oil in\n1973 and 1979. The budget deficit became permanent and intractable, averaging\nabout 10 per cent of the gross domestic product (GDP), higher than any other\nindustrial country. The lira fell steadily, from Lire 560 to the U.S. dollar\nin 1973 to Lire 1,400 in 1982.\n\nThe economic recession went on into the mid-1980s until a set of reforms led\nto the independence of the Bank of Italy and a big reduction of the indexation\nof wages that strongly reduced inflation rates, from 20.6% in 1980 to 4.7% in\n1987. The new macroeconomic and political stability resulted in a second,\nexport-led \"economic miracle\", based on small and medium-sized enterprises,\nproducing clothing, leather products, shoes, furniture, textiles, jewellery,\nand machine tools. As a result of this rapid expansion, in 1987 Italy overtook\nthe UK's economy (an event known as _il sorpasso_), becoming the fourth\nrichest nation in the world, after the US, Japan and West Germany. The Milan\nstock exchange increased its market capitalization more than fivefold in the\nspace of a few years.\n\nHowever, the Italian economy of the 1980s presented a problem: it was booming,\nthanks to increased productivity and surging exports, but unsustainable fiscal\ndeficits drove the growth. In the 1990s, the new Maastricht criteria boosted\nthe urge to curb the public debt, already at 104% of GDP in 1992. The\nconsequent restrictive economic policies worsened the impact of the global\nrecession already underway. After a brief recovery at the end of the 1990s,\nhigh tax rates and red tape caused the country to stagnate between 2000 and\n2008.",
    "openai_summarised_points": [
      "• The 1970s in Italy were characterized by significant economic, political turmoil, and social unrest, collectively known as the Years of Lead.",
      "• Unemployment increased sharply during this period, with a notable rise among young people; by 1977, there were one million unemployed individuals under the age of 24.",
      "• Inflation persisted throughout the 1970s, exacerbated by the increases in oil prices in 1973 and 1979.",
      "• The Italian budget deficit became a persistent and intractable issue, averaging approximately 10% of the gross domestic product (GDP), which was higher than that of any other industrial country at the time.",
      "• The Italian lira experienced a steady decline in value, depreciating from Lire 560 per U.S. dollar in 1973 to Lire 1,400 per dollar in 1982.",
      "• The recession in Italy extended into the mid-1980s, until a series of reforms were implemented.",
      "• These reforms included the independence of the Bank of Italy and a significant reduction in the indexation of wages, which contributed to a substantial decrease in inflation rates from 20.6% in 1980 to 4.7% in 1987.",
      "• The resulting macroeconomic and political stability fostered a second, export-led \"economic miracle\" in Italy, driven by small and medium-sized enterprises producing clothing, leather products, shoes, furniture, textiles, jewelry, and machine tools.",
      "• By 1987, Italy surpassed the United Kingdom in economic size, an event known as _il sorpasso_, becoming the fourth-richest nation globally after the United States, Japan, and West Germany.",
      "• The Milan stock exchange experienced rapid growth, increasing its market capitalization more than fivefold within a few years.",
      "• Despite the economic boom in the 1980s, the Italian economy faced a significant problem: the growth was fueled by increased productivity and exports but was unsustainable due to large fiscal deficits.",
      "• In the early 1990s, Italy's public debt reached 104% of GDP in 1992, prompting Italy to adopt the Maastricht criteria aimed at fiscal consolidation and currency stability.",
      "• The implementation of restrictive economic policies to meet Maastricht criteria worsened the impact of the ongoing global recession.",
      "• After a brief period of recovery at the end of the 1990s, Italy experienced stagnation between 2000 and 2008, primarily due to high tax rates and extensive red tape."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:41.312864",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1972,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Great Recession",
    "text": "Italy real quarterly GDP GDP per capita of Italy, France, Germany and Britain\nfrom 1970 to 2008\n\nItaly bonds\n\nEuropean debt crisis in 2011\nnegative interest rates 2015-2022\n\n50 year\n\n20 year\n\n10 year\n\n2 year\n\n1 year\n\n3 month\n\nItaly was among the countries hit hardest by the Great Recession of 2008–2009\nand the subsequent European debt crisis. The national economy shrunk by 6.76%\nduring the whole period, totaling seven-quarters of recession. In November\n2011 the Italian bond yield was 6.74 per cent for 10-year bonds, nearing a 7\nper cent level where Italy is thought to lose access to financial markets.\nAccording to Eurostat, in 2015 the Italian government debt stood at 128% of\nGDP, ranking as the second biggest debt ratio after Greece (with 175%).\nHowever, the biggest chunk of Italian public debt is owned by Italian\nnationals and relatively high levels of private savings and low levels of\nprivate indebtedness are seen as making it the safest among Europe's\nstruggling economies. As a shock therapy to avoid the debt crisis and kick-\nstart growth, the national unity government led by the economist Mario Monti\nlaunched a program of massive austerity measures, that brought down the\ndeficit but precipitated the country in a double-dip recession in 2012 and\n2013, receiving criticism from numerous economists.",
    "openai_summarised_points": [
      "• Italy experienced significant economic challenges during the Great Recession of 2008–2009, being among the hardest-hit countries in Europe.",
      "• The Italian economy contracted by a total of 6.76% over the recession period, which included seven consecutive quarters of economic decline.",
      "• In November 2011, the yield on Italy’s 10-year government bonds reached 6.74%, approaching the critical 7% threshold that is widely considered to threaten Italy’s access to international financial markets.",
      "• According to Eurostat data, in 2015, Italy’s government debt was equivalent to 128% of its GDP, making it the second-highest debt-to-GDP ratio in Europe after Greece, which stood at 175%.",
      "• The majority of Italian public debt is owned domestically by Italian nationals, and the country benefits from relatively high levels of private savings and low private indebtedness, which contribute to its relative financial stability within struggling European economies.",
      "• Italy faced the European debt crisis starting in 2011, which exacerbated its economic difficulties and led to increased borrowing costs and financial instability.",
      "• Between 2015 and 2022, Italy experienced periods of negative interest rates, reflecting unconventional monetary policy measures aimed at stimulating growth and managing debt burdens.",
      "• The section references Italy’s historical bond yields over different maturities, including the 50-year, 20-year, 10-year, 2-year, 1-year, 3-month, and other durations, highlighting fluctuations during the crisis and subsequent years.",
      "• Italy’s real quarterly GDP data from 1970 to 2008 is noted, alongside comparative GDP per capita figures for Italy, France, Germany, and Britain, illustrating long-term economic trends.",
      "• The Italian government, led by economist Mario Monti, implemented a series of austerity measures as a shock therapy to prevent a debt crisis and stimulate growth.",
      "• These austerity policies successfully reduced the fiscal deficit but also led Italy into a double-dip recession in 2012 and 2013, attracting criticism from numerous economists regarding their long-term impact."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:47.041371",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1321,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Economic recovery",
    "text": "In the period 2014-2019, the economy partially recovered from the disastrous\nlosses incurred during the Great Recession, primarily thanks to strong\nexports, but nonetheless, growth rates remained well below the Euro area\naverage, meaning that Italy's GDP in 2019 was still 5 per cent below its level\nin 2008.",
    "openai_summarised_points": [
      "• Between 2014 and 2019, Italy's economy experienced a partial recovery from the severe downturn caused by the Great Recession.",
      "• The recovery was primarily driven by strong export performance, which contributed significantly to economic growth during this period.",
      "• Despite this improvement, Italy's economic growth rates remained substantially below the average growth rates of the Euro area.",
      "• As a result of the sluggish growth, Italy's Gross Domestic Product (GDP) in 2019 was still approximately 5 percent lower than its level in 2008, indicating persistent economic stagnation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:49.705093",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 308,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.6.1",
    "section_name": "Economic impact of COVID-19 pandemic (2020-2021)",
    "text": "Starting from February 2020, Italy was the first country of Europe to be\nseverely affected by the COVID-19 pandemic, that eventually expanded to the\nrest of the world. The economy suffered a massive shock as a result of the\nlockdown of most of the country's economic activity. After three months, at\nthe end of May 2020, the pandemic was put under control, and the economy\nstarted to recover, especially, the manufacturing sector. Overall, it remained\nsurprisingly resilient, although GDP plummeted like in most western countries.\nThe Italian government issued special treasury bills, known as BTP Futura as a\nCOVID-19 emergency funding, waiting for the approval of the E.U. response to\nthe outbreak. Eventually, in July 2020, the European Council approved the 750\nbillion € Next Generation EU fund, of which €209 billion will go to Italy.",
    "openai_summarised_points": [
      "• Starting from February 2020, Italy was the first country in Europe to be severely affected by the COVID-19 pandemic, which subsequently spread to the rest of the world.",
      "• The Italian economy experienced a significant shock due to the lockdown measures that halted most of the country's economic activities.",
      "• After approximately three months, by the end of May 2020, the pandemic was brought under control in Italy, leading to an initial economic recovery phase.",
      "• The recovery was particularly noticeable in the manufacturing sector, which showed signs of resilience.",
      "• Despite the recovery efforts, Italy’s GDP experienced a sharp decline, mirroring the trend observed in most Western countries during the same period.",
      "• To address the emergency, the Italian government issued special treasury bills called BTP Futura, intended as COVID-19 emergency funding.",
      "• These financial instruments were issued while awaiting approval of the European Union’s response to the pandemic.",
      "• In July 2020, the European Council approved the €750 billion Next Generation EU fund, a major financial package aimed at economic recovery across member states.",
      "• Out of the total €750 billion, Italy was allocated €209 billion to support its economic recovery efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:53.766259",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 839,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Economic resilience",
    "text": "The Ferrari Portofino represents the synergy of \"Made in Italy\" brands that\nstrengthens the Italian economy.\n\nBeginning in 2022, after the COVID-19 pandemic, Italy restarted with a\nresilient economy which nonetheless had to face the global energy crisis of\n2021-2023, involving an increase in gas and other energy prices due to the\nRussian invasion of Ukraine on 24 February 2022. This crisis created the need\nto find an alternative supplier to Russia, subject to European Union\nsanctions. With rising energy prices, inflation rose in Europe, which was\naddressed by the European Central Bank with a progressive increase in interest\nrates. Furthermore, the PNRR (Piano Nazionale di Ripresa e Resilienza [it])\nhad to be re-calibrated and re-agreed with the European Union, to address the\nnew geopolitical situation which led to the energy crisis and damage to supply\nchains, causing shortages in raw materials. In March 2023, the United States\nbanking crisis occurred with some bankruptcies and restructuring of American\nbanks, however it was soon understood that it was a short-lived economic-\nfinancial phenomenon limited to the United States, although with some concern,\nit has not had an impact in the European area, with the exception of the\ncollapse of Credit Suisse, in Switzerland. As a consequence, Italy is\nwitnessing a tightening of its credit policies.\n\nFor Italian banks, there was an opportunity to strengthen themselves, thanks\nto the high rates imposed by the European Central Bank. The new BTP Valore\nbonds were released, which were very successful among the private operators to\nwhom they were marketed due to the high interest rates. From October 7, 2023,\ngeopolitical tensions are becoming more intense, related to the conflict in\nthe Middle East. In 2024, however, the Italian economy continues to maintain\nits resilient strength, thanks to the reduction in energy prices, and the\nmaintenance or reduction of oil prices, this stability allows a reduction in\ninflation. In September 2024, the European Central Bank has decreased interest\nrates by 0.25 percentage points. The Italian economy copes with a geopolitical\nscenario that was significantly deteriorating with the exacerbation of ongoing\nwar conflicts. Strategic assets are better protected, in particular the\ndefense sector. Furthermore, the implementation of the PNRR plan, which must\nbe completed by 2026, has brought benefits to many economic sectors.",
    "openai_summarised_points": [
      "• The Ferrari Portofino exemplifies the synergy of \"Made in Italy\" brands, contributing to the strengthening of the Italian economy.",
      "• Starting in 2022, Italy experienced a post-COVID-19 pandemic economic restart characterized by resilience despite facing significant external challenges.",
      "• Between 2021 and 2023, Italy confronted the global energy crisis triggered by the Russian invasion of Ukraine on 24 February 2022, which led to increased gas and energy prices.",
      "• The energy crisis necessitated Italy to seek alternative energy suppliers to Russia due to European Union sanctions imposed on Russia.",
      "• Rising energy prices contributed to inflation across Europe, prompting the European Central Bank to implement a series of interest rate hikes to curb inflation.",
      "• The Italian government had to recalibrate and renegotiate the PNRR (Piano Nazionale di Ripresa e Resilienza) with the European Union to address the new geopolitical and energy crisis impacts, including supply chain disruptions and raw material shortages.",
      "• In March 2023, the United States experienced a banking crisis involving bank bankruptcies and restructuring, which was initially perceived as a short-lived phenomenon limited to the U.S. financial sector.",
      "• The U.S. banking crisis raised concerns but did not significantly impact Europe, except for the collapse of Credit Suisse in Switzerland.",
      "• As a consequence of the banking instability, Italy observed a tightening of its credit policies.",
      "• Italian banks seized the opportunity to strengthen their positions amid high interest rates imposed by the European Central Bank.",
      "• The introduction of new BTP Valore bonds proved highly successful among private investors due to their attractive high-interest rates.",
      "• From October 7, 2023, geopolitical tensions intensified, notably related to the conflict in the Middle East.",
      "• In 2024, the Italian economy demonstrated continued resilience, supported by reductions in energy and oil prices, which helped stabilize inflation.",
      "• In September 2024, the European Central Bank decreased interest rates by 0.25 percentage points.",
      "• Italy managed to cope with a deteriorating geopolitical scenario marked by escalating war conflicts, with strategic assets, particularly in the defense sector, being better protected.",
      "• The implementation of the PNRR plan, which is scheduled for completion by 2026, has positively impacted various economic sectors in Italy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:45:58.412922",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2431,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Longevity Economy",
    "text": "The Italian economy would appear to be disadvantaged by the factor of\ndemographic decline, however new technologies including artificial\nintelligence, which can automate and improve some activities, always under\nhuman supervision, optimize work processes with a reduction in costs. In this\nframework of economic transformation, between environmental sustainability and\nthe application of artificial intelligence in industry, disadvantaged by the\npersistence and entrenchment of geopolitical conflicts and tensions, trade\nprotectionism and de-globalization, Italian companies are more flexible and\noptimized to respond to the change in commercial demand. The Italian economy,\nin addition to being resilient, is evolving into an economy of longevity. On\n23 May 2025, Moody's confirmed Italy’s rating at Baa3 and improved the outlook\nfrom stable to positive. Public debt refinancing auctions are always a\nsuccess, with excellent demand among investors, with an ever-increasing\npercentage held by Italian families. The good work done by the Italian\ngovernment in controlling public debt and the high savings and low debt of\nItalian families, combined with a strengthening of the Italian banking sector,\nare a guarantee for the future sustainability of the debt. In June 2025, the\nEuropean Central Bank has decreased interest rates by 0.25 percentage points.\nThe economy, aided by a stable Italian government that protects Italy's\nstrategic assets, particularly the banking, defense, energy and manufacturing\nsectors, is stable and growing. Furthermore, even Southern Italy, for decades\nwith few investment and low growth, is showing extraordinary economic\nprogress, a real auxiliary engine of Italy to expand the economic growth of\nthe entire country."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.9",
    "section_name": "Currency",
    "text": "100 lire coin, 1956, with goddess Minerva holding an olive tree and a long\nspear depicted on the reverse\n\nItaly has a long history of different coinage types, which spans thousands of\nyears. Italy has been influential at a coinage point of view: the medieval\nFlorentine florin, one of the most used coinage types in European history and\none of the most important coins in Western history, was struck in Florence in\nthe 13th century, while the Venetian sequin, minted from 1284 to 1797, was the\nmost prestigious gold coin in circulation in the commercial centers of the\nMediterranean Sea.\n\nDespite the fact that the first Italian coinage systems were used in the Magna\nGraecia and Etruscan civilization, the Romans introduced a widespread currency\nthroughout Italy. Unlike most modern coins, Roman coins had intrinsic value.\nThe early modern Italian coins were very similar in style to French francs,\nespecially in decimals, since it was ruled by the country in the Napoleonic\nKingdom of Italy. They corresponded to a value of 0.29 grams of gold or 4.5\ngrams of silver.\n\nSince Italy has been for centuries divided into many historic states, they all\nhad different coinage systems, but when the country became unified in 1861,\nthe Italian lira came into place, and was used until 2002. The term originates\nfrom _libra_ , the largest unit of the Carolingian monetary system used in\nWestern Europe and elsewhere from the 8th to the 20th century. In 1999, the\neuro became Italy's unit of account and the lira became a national subunit of\nthe euro at a rate of 1 euro = 1,936.27 lire, before being replaced as cash in\n2002."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.10",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2023 (with IMF\nstaff estimates in 2024–2029). Inflation below 5% is in green.\n\nYear  | GDP\n(in Bil. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 614.4  | 10,895.8  | 482.7  | 8,559.5  | 3.1%  | 21.8%  | 7.4%  | n/a\n1981  | 676.3  | 11,973.7  | 437.7  | 7,749.8  | 0.6%  | 19.5%  | 7.6%  | n/a\n1982  | 719.2  | 12,723.3  | 432.6  | 7,652.9  | 0.2%  | 16.5%  | 8.3%  | n/a\n1983  | 754.2  | 13,334.6  | 448.9  | 7,936.2  | 0.9%  | 14.7%  | 7.4%  | n/a\n1984  | 805.0  | 14,231.6  | 443.5  | 7,840.8  | 3.0%  | 10.7%  | 7.8%  | n/a\n1985  | 852.2  | 15,060.2  | 458.0  | 8,093.6  | 2.6%  | 9.0%  | 8.2%  | n/a\n1986  | 893.0  | 15,777.1  | 648.7  | 11,461.2  | 2.7%  | 5.8%  | 8.9%  | n/a\n1987  | 943.1  | 16,664.2  | 814.2  | 14,385.8  | 3.1%  | 4.7%  | 9.6%  | n/a\n1988  | 1,015.7  | 17,942.2  | 902.0  | 15,934.2  | 4.0%  | 5.1%  | 9.7%  | 95.2%\n1989  | 1,089.9  | 19,238.7  | 938.1  | 16,560.6  | 3.3%  | 6.2%  | 9.7%  | 97.9%\n1990  | 1,153.1  | 20,338.1  | 1,170.8  | 20,651.8  | 2.0%  | 6.4%  | 8.9%  | 101.1%\n1991  | 1,209.2  | 21,309.8  | 1,236.8  | 21,795.7  | 1.4%  | 6.2%  | 8.5%  | 104.7%\n1992  | 1,245.7  | 21,941.9  | 1,312.4  | 23,116.6  | 0.7%  | 5.0%  | 8.8%  | 112.3%\n1993  | 1,264.6  | 22,255.4  | 1,055.3  | 18,572.9  | -0.8%  | 4.5%  | 9.8%  | 123.4%\n1994  | 1,318.4  | 23,193.6  | 1,088.5  | 19,149.5  | 2.1%  | 4.2%  | 10.6%  | 130.1%\n1995  | 1,382.1  | 24,314.4  | 1,175.3  | 20,675.3  | 2.7%  | 5.4%  | 11.2%  | 119.4%\n1996  | 1,425.3  | 25,073.3  | 1,312.8  | 23,094.4  | 1.3%  | 4.0%  | 11.2%  | 119.1%\n1997  | 1,476.4  | 25,957.8  | 1,243.2  | 21,858.5  | 1.8%  | 1.8%  | 11.2%  | 116.8%\n1998  | 1,520.0  | 26,712.1  | 1,271.7  | 22,348.1  | 1.8%  | 2.0%  | 11.3%  | 114.1%\n1999  | 1,566.5  | 27,526.6  | 1,253.7  | 22,029.7  | 1.6%  | 1.7%  | 10.9%  | 113.3%\n2000  | 1,662.7  | 29,208.9  | 1,147.2  | 20,153.1  | 3.8%  | 2.6%  | 10.1%  | 109.0%\n2001  | 1,733.3  | 30,429.9  | 1,168.0  | 20,505.9  | 2.0%  | 2.3%  | 9.1%  | 108.9%\n2002  | 1,764.8  | 30,964.9  | 1,275.9  | 22,386.3  | 0.3%  | 2.6%  | 8.6%  | 106.4%\n2003  | 1,802.1  | 31,513.1  | 1,577.2  | 27,580.5  | 0.1%  | 2.8%  | 8.5%  | 105.5%\n2004  | 1,876.8  | 32,577.2  | 1,805.7  | 31,342.8  | 1.4%  | 2.3%  | 8.0%  | 105.1%\n2005  | 1,951.5  | 33,621.3  | 1,859.2  | 32,031.4  | 0.8%  | 2.2%  | 7.8%  | 106.6%\n2006  | 2,047.8  | 35,131.2  | 1,949.7  | 33,448.1  | 1.8%  | 2.2%  | 6.9%  | 106.7%\n2007  | 2,134.4  | 36,478.4  | 2,213.4  | 37,828.3  | 1.5%  | 2.0%  | 6.2%  | 103.9%\n2008  | 2,154.4  | 36,513.9  | 2,408.4  | 40,819.0  | -1.0%  | 3.5%  | 6.8%  | 106.2%\n2009  | 2,053.7  | 34,561.9  | 2,197.5  | 36,982.8  | -5.3%  | 0.8%  | 7.9%  | 116.6%\n2010  | 2,114.0  | 35,415.9  | 2,137.8  | 35,815.6  | 1.7%  | 1.6%  | 8.5%  | 119.2%\n2011  | 2,173.2  | 36,250.6  | 2,294.6  | 38,276.0  | 0.7%  | 2.9%  | 8.6%  | 119.7%\n2012  | 2,172.4  | 36,143.0  | 2,088.3  | 34,743.8  | -3.0%  | 3.3%  | 10.9%  | 126.5%\n2013  | 2,187.4  | 36,288.5  | 2,142.0  | 35,535.0  | -1.8%  | 1.2%  | 12.4%  | 132.5%\n2014  | 2,200.3  | 36,460.7  | 2,162.6  | 35,836.2  | 0.0%  | 0.2%  | 12.8%  | 135.4%\n2015  | 2,241.5  | 37,175.6  | 1,836.8  | 30,463.7  | 0.8%  | 0.1%  | 12.0%  | 135.3%\n2016  | 2,420.4  | 40,230.7  | 1,876.6  | 31,190.8  | 1.3%  | -0.1%  | 11.7%  | 134.8%\n2017  | 2,529.5  | 42,111.5  | 1,961.1  | 32,648.8  | 1.7%  | 1.3%  | 11.3%  | 134.2%\n2018  | 2,613.9  | 43,610.3  | 2,092.9  | 34,917.6  | 0.9%  | 1.2%  | 10.6%  | 134.4%\n2019  | 2,674.0  | 44,702.9  | 2,011.5  | 33,627.9  | 0.5%  | 0.6%  | 9.9%  | 134.1%\n2020  | 2,461.9  | 41,279.1  | 1,891.1  | 31,707.1  | -9.0%  | -0.1%  | 9.3%  | 155.3%\n2021  | 2,734.6  | 46,164.6  | 2,101.3  | 35,472.8  | 8.3%  | 1.9%  | 9.5%  | 150.9%\n2022  | 3,345.9  | 56,682.0  | 2,104.6  | 35,653.8  | 4.0%  | 8.7%  | 8.1%  | 138.1%\n2023  | 3,490.5  | 59,164.5  | 2,301.6  | 39,012.0  | 0.9%  | 5.9%  | 7.6%  | 134.5%\n2024  | 3,597.9  | 60,992.8  | 2,376.5  | 40,286.8  | 0.7%  | 1.2%  | 7.0%  | 136.8%\n2025  | 3,691.2  | 62,603.0  | 2,459.5  | 41,714.4  | 0.8%  | 2.1%  | 7.1%  | 138.6%\n2026  | 3,786.0  | 64,262.3  | 2,534.5  | 43,020.0  | 0.7%  | 2.0%  | 7.3%  | 140.1%\n2027  | 3,878.5  | 65,905.6  | 2,595.7  | 44,108.3  | 0.6%  | 2.0%  | 7.4%  | 141.3%\n2028  | 3,976.4  | 67,663.9  | 2,663.6  | 45,325.3  | 0.7%  | 2.0%  | 7.5%  | 141.9%\n2029  | 4,078.0  | 69,507.6  | 2,736.1  | 46,635.8  | 0.7%  | 2.0%  | 7.6%  | 142.3%\nDevelopment of real GDP per capita, 1900 to 2018"
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.10.1",
    "section_name": "Italian Companies on 2024 _Fortune_ Global 500 List",
    "text": "This list displays all 5 Italian companies on the Fortune Global 500 List,\nwhich ranks the world's largest companies by annual revenue. The figures below\nare given in millions of US dollars and are for the fiscal year 2018\\. Also\nlisted are the headquarters location, net profit and industry sector of each\ncompany.\n\nRank  | Fortune 500 rank  | Name  | Industry  | Revenue (USD millions) | Profits (USD millions) | Employees  | Headquarters\n---|---|---|---|---|---|---|---\n1  | 98  | Enel | Electric utility  | 103,311  | 3,717  | 61,055  | Rome\n2  | 97  | Eni | Oil and gas  | 102,502  | 5,158  | 33,142  | Rome\n3  | 245  | Assicurazioni Generali | Insurance  | 57,023  | 4,051  | 81,879  | Trieste\n4  | 283  | Intesa Sanpaolo | Finance  | 52,004  | 8,351  | 94,368  | Turin\n5  | 314  | UniCredit | Banking  | 48,044  | 10,278  | 70,752  | Milan\n\nIn 2022, the sector with the highest number of companies registered in Italy\nis Services with 654,065 companies followed by Retail Trade and Finance,\nInsurance, and Real Estate with 519,448 and 348,881 companies respectively."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.11",
    "section_name": "Wealth",
    "text": "Stefano Pessina\n\nItaly has 1.3 million people with a net wealth greater than $1 million, a\ntotal national wealth of $11.020 trillion, and represents the 9th largest\ncumulative net wealth globally (it accounts for 2.4% of the net wealth in the\nworld). According to the UBS's Global Wealth Databook 2024, the median wealth\nper adult is $113,754 (14th in the world), while according to the Allianz's\nGlobal Wealth Report 2024, the net financial wealth per capita is €76,930\n(14th in the world).\n\nThe following top 10 list of Italian billionaires is based on an annual\nassessment of wealth and assets compiled and published by Forbes in 2017.\n\nRank (World) | Rank (Italy) | Name | Net Worth ($bn) | Main source  | Main sector\n---|---|---|---|---|---\n29 | 1 | Maria Franca Fissolo Ferrero & family | 25.2 | Ferrero SpA | Food\n50 | 2 | Leonardo Del Vecchio | 17.9 | Luxottica | Eyewear\n80 | 3 | Stefano Pessina | 13.9 | Walgreens Boots | Pharmaceutical retail\n133 | 4 | Massimiliana Landini Aleotti | 9.5 | Menarini | Pharmaceutical\n199 | 5 | Silvio Berlusconi | 7.0 | Fininvest | Financial services\n215 | 6 | Giorgio Armani | 6.6 | Armani | Fashion\n250 | 7 | Augusto & Giorgio Perfetti | 5.8 | Perfetti Van Melle | Confectionery\n385 | 8 | Paolo & Gianfelice Rocca | 3.4 | Techint | Conglomerate\n474 | 9 | Giuseppe De'Longhi | 3.8 | De'Longhi | Small appliance\n603 | 10 | Patrizio Bertelli | 3.3 | Prada | Apparels"
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.12",
    "section_name": "Regional data",
    "text": "Map of Italian regions by GDP per capita in 2018 2022 Gross Domestic Product in Italy  Rank  | Region | GDP €m  | **2015 GDP €m** | % of Nation  | € per capita (2022)\n---|---|---|---|---|---\n–  |  Italy | **1,946,479** | **1,645,439** | **100.00** | **34,084**\n1  |  Lombardy | 439,986.38 | 357,200  | 21.71  | 46,000\n2  |  Lazio | 212,911.42 | 192,642  | 11.09  | 38,800\n3  |  Veneto | 180,173.48 | 151,634  | 9.21  | 38,700\n4  |  Emilia-Romagna | 176,844.9 | 149,525  | 9.08  | 41,600\n5  |  Piedmont | 145,913.79 | 127,365  | 7.74  | 35,700\n6  |  Tuscany | 128,308.37 | 110,332  | 6.70  | 36,500\n7  |  Campania | 119,467.68 | 100,544  | 6.11  | 22,200\n8  |  Sicily | 97,124.1 | 87,383  | 5.31  | 21,000\n9  |  Apulia | 85,960.7 | 72,135  | 4.38  | 22,900\n10  |  Liguria | 53,854.51 | 47,663  | 2.90  | 37,200\n11  |  Marche | 45,859.37 | 40,593  | 2.47  | 32,200\n12  |  Friuli-Venezia Giulia | 43,048.67 | 35,669  | 2.17  | 37,600\n13  |  Sardinia | 37,978.08 | 32,481  | 1.97  | 25,000\n14  |  Calabria | 36,081.42 | 32,795  | 1.99  | 20,300\n15  |  Abruzzo | 34,572.45 | 32,592  | 1.98  | 28,300\n16  |  South Tyrol | 29,106.27 | \\-  |  | 56,900\n17  |  Umbria | 24,264.04 | 21,438  | 1.30  | 29,500\n18  |  Trentino | 24,002.76 | \\-  |  | 46,100\n19  |  Basilicata | 15,252.69 | 11,449  | 0.69  | 29,500\n20  |  Molise | 7,219.42 | 6,042  | 0.36  | 25,800\n21  |  Aosta Valley | 5,404.03 | 4,374  | 0.27  | 45,700"
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.13",
    "section_name": "Southern question",
    "text": "Normalized index of industrialization of the Italian provinces in 1871 (the\nnational average is 1.0). Source: Bank of Italy.\n\nOver 1.4\n\nFrom 1.1 to 1.4\n\nFrom 0.9 to 1.1\n\nUp to 0.9\n\nMap of the Italian diaspora in the world\n\nIn the decades following the unification of Italy, the northern regions of the\ncountry, Lombardy, Piedmont and Liguria in particular, began a process of\nindustrialization and economic development while the southern regions remained\nbehind. At the time of the unification of the country, there was a shortage of\nentrepreneurs in the south, with landowners who were often absent from their\nfarms as they lived permanently in the city, leaving the management of their\nfunds to managers, who were not encouraged by the owners to make the\nagricultural estates to the maximum. Landowners invested not in agricultural\nequipment, but in such things as low-risk state bonds.\n\nIn southern Italy, the unification of the country broke down the feudal land\nsystem, which had survived in the south since the Middle Ages, especially\nwhere land had been the inalienable property of aristocrats, religious bodies\nor the king. The breakdown of feudalism, however, and redistribution of land\ndid not necessarily lead to small farmers in the south winding up with land of\ntheir own or land they could work and make profit from. Many remained\nlandless, and plots grew smaller and smaller and so less and less productive,\nas land was subdivided amongst heirs.\n\nThis gap between northern and southern Italy, called \"southern question\", was\nalso induced by the region-specific policies selected by the post-unitary\ngovernments. For example, the 1887 protectionist reform, instead of\nsafeguarding the arboriculture sectors crushed by 1880s fall in prices,\nshielded the Po Valley wheat breeding and those Northern textile and\nmanufacturing industries that had survived the liberal years due to state\nintervention. A similar logic guided the assignment of monopoly rights in the\nsteamboat construction and navigation sectors and, above all, the public\nspending in the railway sector, which represented 53% of the 1861–1911 total.\n\nThe resources necessary to finance the public spending effort were obtained\nthrough highly unbalanced land property taxes, which affected the key source\nof savings available for investment in the growth sectors absent a developed\nbanking system. Given the inability of the government to estimate the land\nprofitability, especially because of the huge differences among the regional\ncadast:ers, this policy irreparably induced large regional discrepancies. This\npolicy destroyed the relationship between the central state and the Southern\npopulation by unchaining first a civil war called Brigandage, which brought\nabout 20,000 victims by 1864 and the militarization of the area, and then\nfavouring emigration, especially from 1892 to 1921.\n\nThe north–south gap was intensified by language differences. Southerners spoke\nthe Sicilian language or a variation of it: a language that developed from\nLatin and other influences independently of and prior to the Tuscan dialect\nthat was adopted as the official Italian language (\"standard Italian\"). The\nSicilian language is a complete, distinct language with its own vocabulary,\nsyntax and grammar rules, the latter being less complex than standard Italian.\nBut because of its similarity to Italian, northerners incorrectly assumed that\nit was an imperfect dialect of Italian and denigrated it as the \"dialect of\nthe poor and ignorant\". This has led to continued bias by the North against\nsoutherners who \"don't speak proper Italian\".\n\nAfter the rise of Benito Mussolini, the \"Iron Prefect\" Cesare Mori tried to\ndefeat the already powerful criminal organizations flourishing in the South\nwith some degree of success. Fascist policy aimed at the creation of an\nItalian Empire and Southern Italian ports were strategic for all commerce\ntowards the colonies. With the invasion of Southern Italy during World War II,\nthe Allies restored the authority of the mafia families, lost during the\nFascist period, and used their influence to maintain public order. Mussolini\nalso established laws requiring standard Italian to be taught in school, and\ndiscouraging the use of local Italian dialects throughout the nation, as well\nas the Sicilian language.\n\nIn the 1950s the Cassa per il Mezzogiorno was set up as a huge public master\nplan to help industrialize the South, aiming to do this in two ways: through\nland reforms creating 120,000 new smallholdings, and through the \"Growth Pole\nStrategy\" whereby 60% of all government investment would go to the South, thus\nboosting the Southern economy by attracting new capital, stimulating local\nfirms, and providing employment. However, the objectives were largely missed,\nand as a result, the South became increasingly subsidized and state-dependent,\nincapable of generating private growth itself.\n\nThe imbalance between North and South was reduced in the 1960s and 1970s\nthrough the construction of public works, the implementation of agrarian and\nscholastic reforms, the expansion of industrialization and the improved living\nconditions of the population. This convergence process was interrupted,\nhowever, in the 1980s. To date, the per capita GDP of the South is just 58% of\nthat of the Center-North, but this gap is mitigated by the fact that there the\ncost of living is around 10-15% lower on average (with even more differences\nbetween small towns and big cities) than that in the North of Italy. In the\nSouth the unemployment rate is more than double (6.7% in the North against\n14.9% in the South). A study by Censis blames the pervasive presence of\ncriminal organizations for the delay of Southern Italy, estimating an annual\nloss of wealth of 2.5% in the South in the period between 1981–2003 due to\ntheir presence, and that without them the per capita GDP of the South would\nhave reached that of the North."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.14",
    "section_name": "Primary",
    "text": "Vineyards in Langhe and Montferrat, Piedmont. Italy is the world's largest\nwine producer (22% of the global market), as well as the country with the\nwidest variety of indigenous grapevine in the world. Cultivated field in\nUmbria. The Basilica of Saint Francis of Assisi is in the background.\n\nAccording to the last national agricultural census, there were 1.6 million\nfarms in 2010 (−32.4% since 2000) covering 12,700,000 ha or 31,382,383 acres\n(63% of which are located in Southern Italy). The vast majority (99%) are\nfamily-operated and small, averaging only 8 ha (20 acres) in size. Of the\ntotal surface area in agricultural use (forestry excluded), grain fields take\nup 31%, olive tree orchards 8.2%, vineyards 5.4%, citrus orchards 3.8%, sugar\nbeets 1.7%, and horticulture 2.4%. The remainder is primarily dedicated to\npastures (25.9%) and feed grains (11.6%). The northern part of Italy produces\nprimarily maize corn, rice, sugar beets, soybeans, meat, fruits and dairy\nproducts, while the South specializes in wheat, olive and citrus fruits.\nLivestock includes 6 million head of cattle, 8.6 million head of swine, 6.8\nmillion head of sheep, and 0.9 million head of goats. The total annual\nproduction of the fishing industry in Italy from capture and aquaculture,\nincluding crustaceans and molluscs, is around 480,000 tons.\n\nItaly is the largest producer of wine in the world, and one of the leading\nproducers of olive oil, fruits (apples, olives, grapes, oranges, lemons,\npears, apricots, hazelnuts, peaches, cherries, plums, strawberries, and\nkiwifruits), and vegetables (especially artichokes and tomatoes). The most\nfamous Italian wines are the Tuscan Chianti and the Piedmontese Barolo. Other\nfamous wines are Barbaresco, Barbera d'Asti, Brunello di Montalcino, Frascati,\nMontepulciano d'Abruzzo, Morellino di Scansano, Amarone della Valpolicella\nDOCG and the sparkling wines Franciacorta and Prosecco. Quality goods in which\nItaly specialises, particularly the already mentioned wines and regional\ncheeses, are often protected under the quality assurance labels DOC/DOP. This\ngeographical indication certificate, which is attributed by the European\nUnion, is considered important to avoid confusion with low-quality mass-\nproduced ersatz products.\n\nIn fact, Italian cuisine is one of the most popular and copied around the\nworld. The lack or total unavailability of some of its most characteristic\ningredients outside of Italy, also and above all to falsifications (or food\nfraud), leads to the complete denaturalization of Italian ingredients. This\nphenomenon, widespread in all continents, is better known as _Italian\nSounding_ , consisting in the use of words as well as images, colour\ncombinations (the Italian tricolour), geographical references, brands\nevocative of Italy to promote and market agri-food products which in reality\nhave nothing to do with Italian cuisine."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.15",
    "section_name": "Secondary",
    "text": "Eni is considered one of the world's oil and gas \"Supermajors\" Arduino Uno, a\nMCU board made in Italy has gained popularity worldwide\n\nItaly is the world's sixth-largest manufacturing country. Italy has a smaller\nnumber of global multinational corporations than other economies of comparable\nsize, but it has a large number of small and medium-sized enterprises, many of\nthem grouped in clusters, which are the backbone of the Italian industry. This\nresults in a manufacturing sector often focused on the export of niche market\nand luxury products, that is less capable of competing on quantity but is more\ncapable of facing the competition of emerging economies based on lower labour\ncosts, given the higher quality of its products.\n\nThe industrial districts are regionalized: in the Northwest, there is a large\nmodern group of industries, as in the so-called \"industrial triangle\" (Milan-\nTurin-Genoa), where there is an area of intense machinery, automotive,\naerospace production and shipbuilding; in the Northeast, an area that\nexperienced social and economic development mostly around family-based firms,\nthere are mostly small and medium enterprises of lower technology but high\ncraftsmanship, specializing in machinery, clothing, leather products,\nfootwear, furniture, textiles, machine tools, spare parts, home appliances,\nand jewellery. In central Italy, there are mostly small and medium-sized\ncompanies specializing in products such as textiles, leather, jewellery but\nalso machinery. According to a study carried out in 2015 by the Edison\nFoundation and Confindustria on the most industrialized provinces in Europe,\nof the five most industrialized provinces in Europe, three are Italian\nprovinces. Brescia turns out to be the first European province for value added\nby industry, with an added value over 10 billion euros.\n\nThe automotive industry in Italy is a significant part of the manufacturing\nsector, with over 144,000 firms and almost 485,000 employed people in 2015,\nand a contribution of 8.5% to Italian GDP. Italy's automotive industry is best\nknown for its automobile designs and small city cars, sports and supercars.\nItaly is one of the significant automobile producers both in Europe and around\nthe world. Today the Italian automotive industry is almost totally dominated\nby Fiat Group (now included in Stellantis corporation). As well as its own,\npredominantly mass market model range, Stellantis owns the mainstream Fiat\nbrand, the upmarket Alfa Romeo and Lancia brands, and the exotic Maserati\nbrand. Luxury cars such as Ferrari, Lamborghini, Maserati and Ducati\nmotorcycles are also made in the Northeast region of Emilia-Romagna. Italian\ncars have won the annual European Car of the Year award several times (with\nFiat winning more than any other manufacturer), and have also been awarded the\nWorld Car of the Year award."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.16",
    "section_name": "Tertiary",
    "text": "Palazzo Mezzanotte in Milan, the seat of the Italian Bourse Portofino in\nItalian Riviera The Amalfi Coast, one of Italy's major tourist destinations\n\nIn Italy, services represent the most important sector of the economy, both in\nterms of number of employees (67% of the total) and value-added (71%).\nFurthermore, the sector is by far the most dynamic: over 51% of the more than\n5,000,000 companies operating in Italy today belong to the services sector,\nand in this sector over 67% of new businesses are born. Very important\nactivities in Italy are tourism, trade, services to people and businesses\n(advanced tertiary).\n\nIn 2006 the main sectoral data are: for trade, there are 1,600,000\nenterprises, equal to 26% of the Italian entrepreneurial fabric, and over\n3,500,000 work units. Transport, communications, tourism and consumption\noutside the home, over 582,000 businesses, equal to 9.5% of the\nentrepreneurial fabric, almost 3,500,000 work units. Business services:\n630,000 registered companies, equal to 10.3% of the entrepreneurial fabric,\nover 2,800,000 work units. In 2004 the transport sector in Italy generated a\nturnover of about 119.4 billion euros, employing 935,700 persons in 153,700\nenterprises.\n\nItalian Bourse, based in Milan, is the Italian stock exchange. It manages and\norganises the domestic market, regulating procedures for admission and listing\nof companies and intermediaries and supervising disclosures for listed\ncompanies. Following exchange privatisation in 1997, the Italian Bourse was\nestablished and became effective on 2 January 1998. On 23 June 2007, the\nItalian Bourse became a subsidiary of the London Stock Exchange Group. As of\nApril 2018, overall capitalisation for listed companies on Borsa Italiana was\nworth €644.3 billion, representing 37.8% of Italian GDP.\n\nItaly is the fourth most visited country, with a total of 57 million arrivals\nin 2023. The total contribution of the tourism in Italy to GDP (including\nwider effects from investment, the supply chain and induced income impacts)\nwas EUR162.7bn in 2014 (10.1% of GDP) and generated 1,082,000 jobs directly in\n2014 (4.8% of total employment). Factors of tourist interest in Italy are\nmainly culture, cuisine, history, fashion, architecture, art, religious sites\nand routes, wedding tourism, naturalistic beauties, nightlife, underwater\nsites and spas. Winter and summer tourism are present in many locations in the\nAlps and the Apennines, while seaside tourism is widespread in coastal\nlocations on the Mediterranean Sea. Italy is the leading cruise tourism\ndestination in the Mediterranean Sea. Small, historical and artistic Italian\nvillages are promoted through the association _I Borghi più belli d'Italia_\n(literally \"The Most Beautiful Villages of Italy\").\n\nThe origins of modern banking can be traced to medieval and early Renaissance\nItaly, to the rich cities like Florence, Lucca, Siena, Venice and Genoa. The\nBardi and Peruzzi families dominated banking in 14th-century Florence,\nestablishing branches in many other parts of Europe. One of the most famous\nItalian banks was the Medici Bank, set up by Giovanni di Bicci de' Medici in\n1397. The earliest known state deposit bank, the Bank of Saint George, was\nfounded in 1407 in Genoa, while Banca Monte dei Paschi di Siena, founded in\n1472, is the world's oldest or second oldest bank in continuous operation,\ndepending on the definition, and the third-largest Italian commercial and\nretail bank. Today, among the financial services companies, UniCredit is one\nof the largest banks in Europe by capitalization and Assicurazioni Generali is\nsecond largest insurance group in the world by revenue after AXA.\n\nBanca Monte dei Paschi di Siena, founded in 1472, is the world's oldest or\nsecond oldest bank in continuous operation. The headquarters of UniCredit bank\nin Milan\n\nThe following is a list of the main Italian banks and insurance groups ranked\nby total assets and gross premiums written.\n\n_As of 31 December 2013_[_needs update_]\nBanks  | Rank | Company | Headquarters | Assets (€ mil.)\n---|---|---|---\n1 | UniCredit | Milan | 982,151\n2 | Intesa Sanpaolo | Turin | 676,798\n3 | Banca Monte dei Paschi di Siena | Siena | 197,943\n4 | Banco Popolare | Verona | 123,743\n5 | UBI Banca | Bergamo | 121,323\n6 | Banca Nazionale del Lavoro | Rome | 84,892\n7 | Mediobanca | Milan | 72,428\n8 | Banca Popolare dell'Emilia Romagna | Modena | 61,266\n9 | Banca Popolare di Milano | Milan | 49,257\n10 | Cariparma | Parma | 48,235\nInsurance groups  | Rank | Company | Headquarters | Premiums (€ mil.)\n---|---|---|---\n1 | Assicurazioni Generali | Trieste | 70,323\n2 | Poste Vita | Rome | 18,238\n3 | Unipol | Bologna | 15,564\n4 | Intesa Sanpaolo | Turin | 12,464\n5 | Cattolica Assicurazioni | Verona | 5,208\n6 | Reale Mutua Assicurazioni | Turin | 3,847\n7 | Vittoria Assicurazioni | Milan | 1,281"
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.17",
    "section_name": "Energy and natural resources",
    "text": "Solar panels in Piombino. Italy is one of the world's largest producers of\nrenewable energy.\n\nItaly consumed about 185 Mtoe of primary energy in 2010. This came mostly from\nfossil fuels. Among the most used resources are petroleum (mostly used for the\ntransport sector), natural gas (used for electric energy production and\nheating), coal and renewables. Electricity is produced mainly from natural\ngas, which accounts for the source of more than half of the total final\nelectric energy produced. Another important source is hydroelectric power,\nwhich was practically the only source of electricity until 1960.\n\nEni, with operations in 79 countries, is considered one of the seven\n\"Supermajor\" oil companies in the world, and one of the world's largest\nindustrial companies. The Val d'Agri area, Basilicata, hosts the largest\nonshore hydrocarbon field in Europe. Moderate natural gas reserves, mainly in\nthe Po Valley and offshore Adriatic Sea, have been discovered in recent years\nand constitute the country's most important mineral resource.\n\nNatural resources of Italy. Metals are in blue (Al – aluminium ore, Mn —\nmanganese, Fe – iron ore, Hg — mercury, PM – polymetallic ores (Cu, Zn, Ag,\nPb), PY — pyrite). Fossil fuels are in red (C – coal, G – natural gas, L —\nlignite, P – petroleum). Non-metallic minerals are in green (ASB — asbestos, F\n— fluorite, K — potash, MAR — marble, S — sulfur).\n\nMost raw materials needed for manufacturing and more than 80% of the country's\nenergy sources are imported (99.7% of the solid fuels demand, 92.5% of oil,\n91.2% of natural gas and 13% of electricity). Due to its reliance on imports,\nItalians pay approximately 45% more than the EU average for electricity.\n\nIn the last decade, Italy has become one of the world's largest producers of\nrenewable energy, ranking as the second largest producer in the European Union\nand the ninth in the world. Wind power, hydroelectricity, and geothermal power\nare also important sources of electricity in the country. Italy was the first\ncountry to exploit geothermal energy to produce electricity. The first Italian\ngeothermal power plant was built in Tuscany, which is where all currently\nactive geothermal plants in Italy are located. In 2014 the geothermal\nproduction was 5.92 TWh.\n\nSolar energy production alone accounted for almost 9% of the total electric\nproduction in the country in 2014, making Italy the country with the highest\ncontribution from solar energy in the world. The Montalto di Castro\nPhotovoltaic Power Station, completed in 2010, is the largest photovoltaic\npower station in Italy with 85 MW. Other examples of large PV plants in Italy\nare San Bellino (70.6 MW), Cellino san Marco (42.7 MW) and Sant’ Alberto (34.6\nMW). Italy was also the first country to exploit geothermal energy to produce\nelectricity.\n\nRenewable sources account for 27.5% of all electricity produced in Italy, with\nhydro alone reaching 12.6%, followed by solar at 5.7%, wind at 4.1%, bioenergy\nat 3.5%, and geothermal at 1.6%. The rest of the national demand is covered by\nfossil fuels (38.2% natural gas, 13% coal, 8.4% oil) and by imports.\n\nItaly has managed four nuclear reactors until the 1980s, but in 1987, after\nthe Chernobyl disaster, a large majority of Italians passed a referendum\nopting for phasing out nuclear power in Italy. The government responded by\nclosing existing nuclear power plants and stopping work on projects underway,\ncontinuing to work to the nuclear energy program abroad. The national power\ncompany Enel operates seven nuclear reactors in Spain (through Endesa) and\nfour in Slovakia (through Slovenské elektrárne), and in 2005 made an agreement\nwith Électricité de France for a nuclear reactor in France. With these\nagreements, Italy has managed to access nuclear power and direct involvement\nin design, construction, and operation of the plants without placing reactors\non Italian territory.\n\nIn the early 1970s Italy was a major producer of pyrites (from the Tuscan\nMaremma), asbestos (from the Balangero mines), fluorite (found in Sicily), and\nsalt. At the same time, it was self-sufficient in aluminium (from Gargano),\nsulphur (from Sicily), lead, and zinc (from Sardinia). By the beginning of the\n1990s, however, it had lost all its world-ranking positions and was no longer\nself-sufficient in those resources. There are no substantial deposits of iron,\ncoal, or oil. Italy is one of the world's leading producers of pumice,\npozzolana, and feldspar. Another mineral resource for which Italy is well-\nknown is marble, especially the world-famous white Carrara marble from the\nMassa and Carrara quarries in Tuscany."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "1.18",
    "section_name": "Transportation",
    "text": "The _Autostrada dei Laghi_ (\"Lakes Motorway\"; now parts of the Autostrada A8\nand the Autostrada A9) near Besnate, the first motorway built in the world.\n\nRegarding the national road network, in 2002 there were 668,721 km (415,524\nmi) of serviceable roads in Italy, including 6,487 km (4,031 mi) of motorways,\nstate-owned but privately operated by Atlantia. In 2005, about 34,667,000\npassenger cars (590 cars per 1,000 people) and 4,015,000 goods vehicles\ncirculated on the national road network.\n\nItaly was the first country in the world to build motorways, the so-called\n_autostrade_ , reserved for fast traffic and for motor vehicles only. The\n_Autostrada dei Laghi_ (\"Lakes Motorway\"), the first built in the world,\nconnecting Milan to Lake Como and Lake Maggiore, and now parts of the A8 and\nA9 motorways, was devised by Piero Puricelli and was inaugurated in 1924. He\nreceived the first authorization to build a public-utility fast road in 1921.\nBy the end of the 1930s, over 400 kilometres of multi- and dual-single-lane\nmotorways were constructed throughout Italy, linking cities and rural towns.\nItaly is one of the countries with the most vehicles per capita, with 690 per\n1000 people in 2010.\n\nFS' Frecciarossa 1000 high speed train at Milano Centrale railway station,\nwith a maximum speed of 400 km/h (249 mph), is one of the fastest trains in\nEurope.\n\nThe national railway network is also extensive, especially in the north,\ntotalizing 16,862 km of which 69% are electrified and on which 4,937\nlocomotives and railcars circulate. It is the 12th largest in the world, and\nis operated by state-owned Ferrovie dello Stato, while the rail tracks and\ninfrastructure are managed by Rete Ferroviaria Italiana. While a number of\nprivate railroads exist and provide mostly commuter-type services, the\nnational railway also provides sophisticated high-speed rail service that\njoins the major cities. The Florence–Rome high-speed railway was the first\nhigh-speed line opened in Europe when more than half of it opened in 1977. In\n1991 the TAV was created for the planning and construction of high-speed rail\nlines along Italy's most important and saturated transport routes (Milan-Rome-\nNaples and Turin-Milan-Venice). High-speed trains include ETR-class trains,\nwith the Frecciarossa 1000 reaching 400 km/h. Higher-speed trains are divided\ninto three categories: Frecciarossa (English: red arrow) trains operate at a\nmaximum speed of 300 km/h on dedicated high-speed tracks; Frecciargento\n(English: silver arrow) trains operate at a maximum speed of 250 km/h on both\nhigh-speed and mainline tracks; and Frecciabianca (English: white arrow)\ntrains operate on high-speed regional lines at a maximum speed of 200 km/h.\nItaly has 11 rail border crossings over the Alpine mountains with its\nneighbouring countries.\n\n21st Century Silk Road with its connections to Italy\n\nSince October 2021, Italy's flag carrier airline is ITA Airways, which took\nover the brand, the IATA ticketing code, and many assets belonging to the\nformer flag carrier Alitalia, after its bankruptcy. ITA Airways serves 44\ndestinations (as of October 2021[update]) and also operates the former\nAlitalia regional subsidiary, Alitalia CityLiner. The country also has\nregional airlines (such as Air Dolomiti), low-cost carriers, and Charter and\nleisure carriers (including Neos, Blue Panorama Airlines and Poste Air Cargo).\nMajor Italian cargo operators are Alitalia Cargo and Cargolux Italia. Italy is\nthe fifth in Europe by number of passengers by air transport, with about 148\nmillion passengers or about 10% of the European total in 2011. There are\napproximately 130 airports in Italy, of which 99 have paved runways (including\nthe two hubs of Leonardo Da Vinci International in Rome and Malpensa\nInternational in Milan).\n\nItaly has been the final destination of the Silk Road for many centuries. In\nparticular, the construction of the Suez Canal intensified sea trade with East\nAfrica and Asia from the 19th century. Since the end of the Cold War and\nincreasing European integration, trade relations, which were often interrupted\nin the 20th century, have intensified again. In 2004 there were 43 major\nseaports including the Port of Genoa, the country's largest and the third\nbusiest by cargo tonnage in the Mediterranean Sea. Due to the increasing\nimportance of the maritime Silk Road with its connections to Asia and East\nAfrica, the Italian ports for Central and Eastern Europe have become important\nin recent years. In addition, the trade in goods is shifting from the European\nnorthern ports to the ports of the Mediterranean Sea due to the considerable\ntime savings and environmental protection. In particular, the deep water port\nof Trieste in the northernmost part of the Mediterranean Sea is the target of\nItalian, Asian and European investments. The national inland waterway network\ncomprises 1,477 km (918 mi) of navigable rivers and channels. In 2007 Italy\nmaintained a civilian air fleet of about 389,000 units and a merchant fleet of\n581 ships."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Poverty",
    "text": "Two rough sleepers in Milan\n\nIn 2015, poverty in Italy hit the highest levels in the previous 10 years. The\nlevel of absolute poverty for a two-person family was €1050.95/month. The\npoverty line per capita changed by region from €552.39/month to €819.13/month.\nThe number of those in absolute poverty rose nearly an entire per cent in\n2015, from 6.8% in 2014 to 7.6% in 2015. In Southern Italy the numbers are\neven higher, with 10% living in absolute poverty, up from 9 per cent in 2014.\nNorthern Italy is better off at 6.7%, but this is still an increase from 5.7%\nin 2014.\n\nThe national statistics reporting agency, ISTAT, defines absolute poverty as\nthose who can not buy goods and services which they need to survive. In 2015,\nthe proportion of poor households in relative poverty also increased to 13.7\nfrom 12.9 in 2014. ISTAT defines relative poverty as people whose disposable\nincome is less than around half the national average. The unemployment rate in\nFebruary 2016 remained at 11.7%, which has been the same for almost a year,\nbut even having a job does not guarantee freedom from poverty.\n\nThose who have at least one family member employed still suffer from 6.1% to\n11.7% poverty, the higher number being for those who have factory jobs. The\nnumbers are even higher for the younger generations because their unemployment\nrate is over 40%. Also, children are hit hard. In 2014, 32% of those aged 0–17\nwere at risk of poverty or social exclusion, which is one child out of three.\nWhile in the north the poverty rate is about the same as that of France and\nGermany, in the south it is almost double that figure. In the last ISTAT\nreport, poverty is in decline.[_needs update_] According to the 2022 ISTAT\nPoverty Report, 2.18 million households and 5.6 million people live in\nabsolute poverty in Italy.\n\nAccording to Eurostat, by 2023, 63% of Italian households will struggle to\nmake ends meet, making it one of the European countries with the most\nwidespread economic difficulties, surpassing France, Poland, Spain and\nPortugal. The European average is 45.5%.\n\nThe average annual gross salary in Italy was €41,646 ($44,893) in 2022,\nplacing the country at the twenty-first position in the OECD area, with lower\nwages compared to the EU average. Many Italians still face significant\nchallenges in meeting basic living expenses due to high living costs and\nregional economic disparities."
  },
  {
    "chapter_name": "Economy of Italy",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Nobel Prizes",
    "text": "Swiss Nobel laureates Year  | Image  | Laureate  | Born  | Died  | Field  | Rationale\n---|---|---|---|---|---|---\n1985  |  | Franco Modigliani | 18 June 1918 in Rome\nsince 1946 also American citizen | 25 September 2003 in Cambridge, USA | Economics | \"for his pioneering analyses of saving and of financial markets\""
  }
]