[
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( December 2024)_  \n---|---  \n  \nThe **economy of Guyana** is one of the fastest growing economies in the\nworld, with a gross domestic product (GDP) growth of 19.9% in 2021. In 2024,\nGuyana had a per capita gross domestic product (purchasing power parity) of\nInt$80,137 and an average GDP growth of 4.2% over the previous decade.\nGuyana's economy was transformed in 2015 with the discovery of an offshore oil\nfield in the country's waters about 190 km from Georgetown, making the first\ncommercial-grade crude oil draw in December 2019, sending it abroad for\nrefining.",
    "openai_summarised_points": [
      "• The economy of Guyana is recognized as one of the fastest growing economies globally, experiencing a significant GDP growth rate of 19.9% in the year 2021.",
      "• As of 2024, Guyana's per capita gross domestic product (GDP) based on purchasing power parity (PPP) stands at Int$80,137.",
      "• Over the previous decade, Guyana's economy has maintained an average GDP growth rate of 4.2%.",
      "• The economic transformation of Guyana was notably influenced by the discovery of an offshore oil field in 2015, located approximately 190 kilometers from Georgetown.",
      "• The offshore oil field discovery led to the commencement of commercial crude oil production in December 2019, marking a significant milestone for the country's economy.",
      "• The crude oil produced from this offshore field is exported abroad for refining, indicating the development of Guyana’s oil export industry.",
      "• The article referencing these economic details was noted as needing updates as of December 2024, suggesting that recent developments may not be fully reflected."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:21:16.146045",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 697,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Developed in conjunction with the World Bank and the International Monetary\nFund (IMF), an economic recovery program significantly reduced the\ngovernment's role in the economy, encouraged foreign investment, enabled the\ngovernment to clear all its arrears on loan repayments to foreign governments\nand the multilateral banks, and brought about the sale of 15 of the 41\ngovernment-owned (parastatal) businesses. The cellphone company and assets in\nthe timber, rice, and fishing industries also were privatized. International\ncorporations were hired to manage the huge state sugar company, GuySuCo, and\nthe most significant state bauxite mine. An American company was allowed to\nopen a bauxite mine, and two Canadian companies were permitted to develop the\nlargest open-pit gold mine in South America. However, efforts to privatize the\ntwo state-owned bauxite mining companies, Berbice Mining Company and Linden\nMining Company have so far been unsuccessful.\n\nMost price controls were removed, the laws affecting mining and oil\nexploration were improved, and an investment policy receptive to foreign\ninvestment was announced. Tax reforms designed to promote exports and\nagricultural production in the private sector were enacted.",
    "openai_summarised_points": [
      "• The economic recovery program in Guyana was developed in collaboration with the World Bank and the International Monetary Fund (IMF).",
      "• The program significantly reduced the government's role in the economy, promoting a shift towards a more market-oriented system.",
      "• It facilitated the clearance of all arrears on loan repayments to foreign governments and multilateral banks, improving Guyana's international financial standing.",
      "• The program led to the privatization of 15 out of 41 government-owned (parastatal) businesses, including key sectors such as telecommunications, timber, rice, and fishing industries.",
      "• The cellphone company and assets in the timber, rice, and fishing industries were among the entities privatized during this reform process.",
      "• International corporations were engaged to manage major state enterprises, including the large state sugar company, GuySuCo, and the most significant state bauxite mine.",
      "• An American company was authorized to open a bauxite mine, marking foreign investment in the mining sector.",
      "• Two Canadian companies were permitted to develop the largest open-pit gold mine in South America, indicating increased foreign participation in resource extraction.",
      "• Efforts to privatize the two state-owned bauxite mining companies, Berbice Mining Company and Linden Mining Company, have so far been unsuccessful.",
      "• Most price controls previously in place were removed, liberalizing the pricing mechanisms within the economy.",
      "• Laws affecting mining and oil exploration were revised and improved to encourage resource development.",
      "• An investment policy was announced that was receptive to foreign investment, aiming to attract international capital and expertise.",
      "• Tax reforms were enacted with the goal of promoting exports and boosting agricultural production in the private sector, fostering economic growth and diversification."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:21:20.754166",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1227,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Debt",
    "text": "Since 1986, Guyana has received its entire wheat supply from the United States\non concessional terms under a PL 480 Food for Peace programme. It is now\nsupplied on a grant basis. The Guyanese currency generated by the sale of the\nwheat is used for purposes agreed upon by the U.S. and Guyana Governments. As\nwith many developing countries, Guyana is heavily indebted. Reduction of the\ndebt burden has been one of the present administration's top priorities. In\n1999, through the Paris Club \"Lyons terms\" and the Heavily Indebted Poor\nCountries (HIPC) initiative Guyana managed to negotiate $256 million in debt\nforgiveness.\n\nIn qualifying for HIPC assistance, for the first time, Guyana became eligible\nfor a reduction of its multilateral debt. About half of Guyana's debt is owed\nto the multilateral development banks and 20% to its neighbour Trinidad and\nTobago, which until 1986 was its principal supplier of petroleum products.\nAlmost all debt to the U.S. government has been forgiven. In late 1999, net\ninternational reserves were at $123.2 million, down from $254 million in 1994.\nHowever, net international reserves had rebounded to $174.1 million by January\n2001.\n\nGuyana's extremely high debt burden to foreign creditors has meant limited\navailability of foreign exchange and reduced capacity to import necessary raw\nmaterials, spare parts, and equipment, thereby further reducing production.\nThe increase in global fuel costs also contributed to the country's decline in\nproduction and growing trade deficit. The decline of production has increased\nunemployment. Although no reliable statistics exist, combined unemployment and\nunderemployment are estimated at 30%.\n\nEmigration, principally to the U.S. and Canada, remains substantial. Net\nemigration in 1998 was estimated to be about 1.4 percent of the population,\nand in 1999, this figure totalled 1.2 percent. After years of a state-\ndominated economy, the mechanisms for private investment, domestic or foreign,\nare still evolving. The shift from a state-controlled economy to a primarily\nmixed economic system began under Desmond Hoyte and continued under PPP/CIVIC\ngovernments. The current PPP/C administration recognizes the need for foreign\ninvestment to create jobs, enhance technical capabilities, and generate goods\nfor export.\n\nThe foreign exchange market was fully liberalized in 1991, and currency is now\nfreely traded without restriction. The rate is subject to change on a daily\nbasis, but the Guyana dollar has depreciated 17.6% from 1998 to 2000 and may\ndepreciate further pending the stability of the post-election period.",
    "openai_summarised_points": [
      "• Since 1986, Guyana has received its entire wheat supply from the United States under a concessional arrangement through the PL 480 Food for Peace programme, which is now provided on a grant basis.",
      "• The revenue generated from the sale of wheat in Guyana is utilized for purposes mutually agreed upon by the U.S. and Guyana Governments.",
      "• Like many developing countries, Guyana is heavily indebted, making debt reduction a top priority for the current administration.",
      "• In 1999, Guyana negotiated $256 million in debt forgiveness through the Paris Club \"Lyons terms\" and the Heavily Indebted Poor Countries (HIPC) initiative.",
      "• The HIPC assistance enabled Guyana for the first time to qualify for a reduction of its multilateral debt.",
      "• Approximately 50% of Guyana’s debt is owed to multilateral development banks, and 20% is owed to Trinidad and Tobago, which was its principal supplier of petroleum products until 1986.",
      "• Almost all debt owed to the U.S. government has been forgiven.",
      "• In late 1999, Guyana’s net international reserves stood at $123.2 million, a decrease from $254 million in 1994.",
      "• By January 2001, net international reserves had increased to $174.1 million, indicating a partial rebound.",
      "• Guyana’s high debt burden to foreign creditors has led to limited foreign exchange availability, reducing the capacity to import raw materials, spare parts, and equipment, which in turn hampers production.",
      "• Rising global fuel costs have contributed to declines in production and an increasing trade deficit.",
      "• The decline in production has resulted in higher unemployment, with estimates of combined unemployment and underemployment reaching approximately 30%, though precise statistics are unavailable.",
      "• Emigration remains significant, primarily to the U.S. and Canada, with net emigration estimated at about 1.4% of the population in 1998 and 1.2% in 1999.",
      "• After years of a state-dominated economy, mechanisms for private domestic and foreign investment are still developing; the transition from a state-controlled to a mixed economy began under Desmond Hoyte and continued under PPP/CIVIC governments.",
      "• The current PPP/C administration recognizes the importance of foreign investment for creating jobs, improving technical capabilities, and boosting export-oriented goods.",
      "• The foreign exchange market was fully liberalized in 1991, allowing the Guyana dollar to be freely traded without restrictions.",
      "• The exchange rate is subject to daily fluctuations, and the Guyana dollar depreciated by 17.6% from 1998 to 2000, with potential for further depreciation depending on post-election stability."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:21:30.805026",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2601,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "European settlement and plantation workforce",
    "text": "The Dutch were the first to settle Guyana in the 1600s, engaging in trade with\nthe Amerindians and establishing plantations. It was soon discovered that the\nsoil and climate were ideal for growing sugar cane and slaves from Africa were\nbrought in to work on these plantations. The colonies of the Guianas were\nmerged and taken into the British empire. When slavery was abolished, a new\nwave of labour was brought from India as indentured servants. Politics was\ngreatly controlled by powerful plantation owners. Portuguese and Chinese also\ncame into the country as agricultural labour, but eventually settled into\ntheir own specific service industries.",
    "openai_summarised_points": [
      "• The Dutch were the first European settlers in Guyana during the 1600s, initiating trade with the Indigenous Amerindian populations and establishing plantations.",
      "• It was soon found that Guyana's soil and climate were highly suitable for sugar cane cultivation, leading to the development of plantation agriculture.",
      "• To work on these plantations, enslaved Africans were imported in large numbers, establishing a system based on African slave labor.",
      "• The colonies of the Guianas, including Guyana, were eventually merged and incorporated into the British Empire.",
      "• Following the abolition of slavery, the British introduced a new labor force by bringing indentured servants from India to work on the plantations.",
      "• The political landscape was heavily influenced and controlled by powerful plantation owners, who held significant economic and political power.",
      "• In addition to Africans and Indians, Portuguese and Chinese migrants also arrived in Guyana to work as agricultural laborers.",
      "• Over time, Portuguese and Chinese migrants established their own distinct service industries within the country, integrating into the local economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:21:34.167403",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 651,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "Nationalization",
    "text": "When Guyana became independent from British rule, there was a great need to\nensure the economy was locally-owned after centuries of foreign involvement.\nSocialist policies were of great interest at the time, and nearly every sector\nof industry was nationalized during the Burnham presidency of the 1970s, with\nnew agencies established to support the poor and working class. Initially,\ngovernment investment was successful to aid growth, but lacked management\nskills and was weak in the face of world commodity prices and competition.\nEconomic and political strife went hand in hand, and the population dwindled\nfrom resulting waves of emigration.",
    "openai_summarised_points": [
      "• Upon gaining independence from British rule, Guyana faced the critical need to establish a locally-owned economy after centuries of foreign dominance and involvement.",
      "• During the 1970s, under the presidency of Forbes Burnham, Guyana adopted socialist policies, leading to the nationalization of nearly every sector of industry.",
      "• The government established new agencies aimed at supporting the poor and working-class populations as part of its socialist agenda.",
      "• Initial government investments in nationalized industries were successful in promoting economic growth; however, these efforts were hampered by a lack of management skills within the government.",
      "• The nationalized sectors faced challenges due to fluctuating world commodity prices and increasing international competition, which undermined their stability.",
      "• The combination of economic difficulties and political strife contributed to a decline in the population, driven by waves of emigration as citizens sought better opportunities abroad."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:21:38.524825",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 646,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "Opening of markets",
    "text": "The economy made dramatic progress after President Hoyte's 1989 economic\nrecovery program. As a result, Guyana's GDP increased 6% in 1991 following 15\nyears of decline. Growth was consistently above six percent until 1995, when\nit dipped to 5.1 percent. The government reported that the economy grew at a\nrate of 7.9 percent in 1996, 6.2 percent in 1997, and fell 1.3 percent in\n1998. The 1999 growth rate was three percent. The unofficial growth rate in\n2005 was 0.5 percent. In 2006, it was 3.2%."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Infrastructure",
    "text": "Infrastructure is primarily concentrated on the coast, and there is difficulty\nin building up industries in the hinterlands due to limitations of access and\nenergy."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Major economic sectors",
    "text": "Agriculture and mining are Guyana's most important economic activities, with\nsugar, bauxite, rice, and gold accounting for 70–75 percent of export\nearnings. However, the rice sector experienced a decline in 2000, with export\nearnings down 27 percent through the third quarter of 2000. Ocean shrimp\nexports, which were heavily impacted by a one-month import ban to the United\nStates in 1999, accounted for only 3.5 percent of total export earnings that\nyear. Shrimp exports rebounded in 2000, representing 11 percent of export\nearnings through the third quarter of 2000. Other exports include timber,\ndiamonds, garments, rum, and pharmaceuticals. The value of these other exports\nis increasing."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Agriculture",
    "text": "Sugar is the most historically important product of Guyana, however, the\nindustry has been in decline due to global competition and other factors. It\nstill is a major export, along with its related products molasses and rum.\nBanks DIH and Demerara Distilleries are the countries' only distillers, but\nGuyana is world's 14th largest exporter of rum.\n\nIn 2018, Guyana produced 1.2 million tons of sugar cane, 964 thousand tons of\nrice, 136 thousand tons of coconut, in addition to smaller productions of\nother products agricultural products, such as eggplant (47 thousand tons),\npepper (37 thousand tons), pineapple (34 thousand tons), banana (23 thousand\ntons), orange (21 thousand tons), cassava (20 thousand tons), etc."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Mining",
    "text": "Mining has surpassed the economic importance of sugar in recent years, making\nup a sizable portion of Guyana's GDP. The large-scale gold and bauxite mining\noperations are all foreign-owned, but the vast proportion of gold and diamond\nmining is done by small and medium-scale miners."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Petroleum",
    "text": "In the 2010's, significant off-shore oil finds by Exxon has renewed interest\nin foreign investment in the country. A 2018 estimate predicts Guyana's\noilfields are holding over 3.2 billion barrels. Off-shore crude oil extraction\nbegan in 2019.\n\nBy 2024, oil production in Guyana had soared to approximately 645,000 barrels\nper day (bpd), marking a significant increase from 98,000 bpd in its initial\nfull year of production. Guyana increased crude oil production by an annual\naverage of 98,000 b/d from 2020 to 2023, making it the third-fastest growing\nnon-OPEC producing country during this period. The expansion of this sector\nhas significantly contributed to the national economy, with the petroleum\nindustry driving a 62.3 percent GDP growth in 2022, the highest globally\naccording to the IMF. Looking forward, Guyana plans to further boost its\nproduction capacity to about 1.3 million bpd by 2027 through the development\nof new projects like Yellowtail, Uaru, and Whiptail. In December 2024, Guyana\nbecame the third largest per capita petroleum producing country in the world."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "2025",
    "text": "In the first quarter of 2025, Guyana’s Natural Resource Fund (NRF) received\nUSD 605.5 million in oil revenues, including seven profit oil payments and one\nroyalty payment. These payments were for oil produced from January to March\n2025, with two payments related to December 2024 lifts. Despite an increase in\ndaily production, the country's earnings are expected to decline due to a\nprojected 10.9% drop in oil prices, forecasted at USD 71.9 per barrel for\n2025. In 2024, Guyana's oil production grew by 57.7%, yielding 225.4 million\nbarrels and generating USD 2.6 billion in revenue. Under the 2016 Production\nSharing Agreement, Guyana receives a 2% share of oil sold and a 12.5% profit\nshare after ExxonMobil's expenses. The country is also set to have 246 oil\nlifts in 2025."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Forestry",
    "text": "Guyana contains the \"largest unspoiled rainforests on the continent\". Despite\nthe vast forests covering the country, the timber industry has remained small\ndue to infrastructural limitations such as undeveloped roads and lacking or\nunreliable electricity to milling operations.\n\nThe country also sees large financial contributions from international\norganizations looking to protect the forests."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Fishing",
    "text": "Most of what is fished is consumed locally, but there is a sizable export\nmarket for ocean shrimp. Overfishing of shrimp has led to Atlantic seabob\nbecoming the most commercially important catch. Commercial fishing is mostly\nmarine, as inland fishing is mostly attributed to subsistence fishing done by\nAmerindians."
  },
  {
    "chapter_name": "Economy of Guyana",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2028 (with IMF\nstaff estimates for 2021–2028). Inflation below 3% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | **GDP** (in Bil. US$nominal) | **GDP per capita** (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 1.88  | 2,421.5  | 0.84  | 1,101.9  | -2.1%  | 14.1%  | 7.1%  | n/a\n1981  | 2.07  | 2,711.7  | 0.81  | 1,055.8  | 0.6%  | 22.2%  | 7.6%  | n/a\n1982  | 2.01  | 2,625.2  | 0.69  | 904.9  | -8.9%  | 20.6%  | 9.7%  | n/a\n1983  | 1.85  | 2,421.5  | 0.70  | 921.5  | -11.5%  | 15.3%  | 9.6%  | n/a\n1984  | 1.95  | 2,574.7  | 0.65  | 861.1  | 2.1%  | 25.1%  | 7.5%  | n/a\n1985  | 2.02  | 2,682.4  | 0.70  | 924.3  | 0.4%  | 15.0%  | 7.1%  | n/a\n1986  | 2.06  | 2,751.3  | 0.79  | 1,053.7  | -0.2%  | 7.9%  | 7.0%  | n/a\n1987  | 2.11  | 2,841.5  | 0.73  | 982.3  | -0.1%  | 28.7%  | 6.1%  | n/a\n1988  | 2.05  | 2,790.8  | 0.83  | 1,125.9  | -6.0%  | 33.9%  | 5.4%  | n/a\n1989  | 2.03  | 2,791.0  | 0.83  | 1,146.2  | -4.9%  | 89.5%  | 5.2%  | n/a\n1990  | 2.04  | 2,831.7  | 0.69  | 951.0  | -3.0%  | 64.3%  | 5.6%  | n/a\n1991  | 2.24  | 3,112.5  | 0.74  | 1,036.9  | 6.0%  | 103.1%  | 6.8%  | n/a\n1992  | 2.46  | 3,429.4  | 0.82  | 1,145.8  | 7.8%  | 26.7%  | 7.4%  | n/a\n1993  | 3.73  | 3,789.2  | 1.00  | 1,393.0  | 8.2%  | 8.4%  | 6.9%  | n/a\n1994  | 3.02  | 4,180.9  | 1.18  | 1,626.9  | 8.5%  | 12.4%  | 6.1%  | n/a\n1995  | 3.24  | 4,459.7  | 1.33  | 1,832.4  | 5.1%  | 12.2%  | 5.5%  | n/a\n1996  | 3.56  | 4,882.5  | 1.50  | 2,048.5  | 8.0%  | 7.1%  | 5.4%  | n/a\n1997  | 3.85  | 5,245.1  | 1.59  | 2,161.6  | 6.2%  | 3.6%  | 4.9%  | 101.4%\n1998  | 3.83  | 5,192.4  | 1.50  | 2,035.9  | -1.7%  | 4.6%  | 4.5%  | 108.0%\n1999  | 4.00  | 5,400.8  | 1.49  | 2,010.8  | 3.0%  | 7.5%  | 4.2%  | 97.1%\n2000  | 4.03  | 5,434.1  | 1.50  | 2,017.2  | -1.3%  | 6.1%  | 3.9%  | 97.2%\n2001  | 4.22  | 5,673.3  | 1.50  | 2,023.6  | 2.3%  | 2.6%  | 4.7%  | 104.6%\n2002  | 4.33  | 5,828.4  | 1.56  | 2,093.0  | 1.1%  | 5.4%  | 5.7%  | 105.1%\n2003  | 4.39  | 5,909.2  | 1.59  | 2,144.1  | -0.7%  | 6.0%  | 5.9%  | 95.6%\n2004  | 4.58  | 6,116.0  | 1.66  | 2,333.0  | 1.6%  | 4.7%  | 5.5%  | 91.8%\n2005  | 4.63  | 6,233.0  | 1.71  | 2,305.9  | -1.9%  | 6.9%  | 5.0%  | 90.7%\n2006  | 5.02  | 6,741.1  | 1.90  | 2,551.8  | 5.1%  | 6.7%  | 4.6%  | 74.5%\n2007  | 5.51  | 7,389.4  | 2.23  | 2,982.2  | 7.0%  | 12.2%  | 4.6%  | 47.0%\n2008  | 5.73  | 7,659.5  | 2.49  | 3,329.6  | 2.0%  | 8.1%  | 5.8%  | 47.6%\n2009  | 5.96  | 7,932.6  | 2.60  | 3,457.4  | 3.3%  | 3.0%  | 9.2%  | 51.7%\n2010  | 6.29  | 8,356.6  | 2.89  | 3,837.3  | 4.4%  | 4.3%  | 9.6%  | 52.5%\n2011  | 6.77  | 8,958.3  | 3.33  | 4,402.8  | 5.4%  | 4.4%  | 8.9%  | 51.2%\n2012  | 7.92  | 10,443.7  | 4.06  | 5,360.3  | 5.0%  | 2.4%  | 8.0%  | 44.3%\n2013  | 8.37  | 10,998.3  | 4.17  | 5,476.7  | 3.7%  | 1.9%  | 7.3%  | 41.1%\n2014  | 8.36  | 10,942.8  | 4.13  | 5,402.7  | 1.7%  | 0.7%  | 6.1%  | 38.3%\n2015  | 8.59  | 11,204.6  | 4.28  | 5,580.0  | 0.7%  | -0.9%  | 5.2%  | 41.8%\n2016  | 8.71  | 11,268.4  | 4.48  | 5,796.8  | 3.8%  | 0.8%  | 4.8%  | 43.8%\n2017  | 9.31  | 11,964.6  | 4.75  | 6,104.2  | 3.7%  | 1.9%  | 4.3%  | 42.9%\n2018  | 9.95  | 12,725.0  | 4.79  | 6,120.5  | 4.4%  | 1.3%  | 3.8%  | 47.0%\n2019  | 10.68  | 13,605.8  | 5.17  | 6,594.4  | 5.4%  | 2.1%  | 3.6%  | 43.6%\n2020  | 15.52  | 19,717.1  | 5.47  | 6,952.7  | 43.5%  | 1.2%  | 8.0%  | 51.1%\n2021  | 19.47  | 24,661.7  | 7.66  | 9,702.5  | 20.1%  | 3.3%  | 5.3%  | 43.2%\n2022  | 33.80  | 42,698.9  | 14.52  | 18,342.3  | 62.3%  | 6.5%  | 3.5%  | 27.8%\n2023  | 48.16  | 60,648.1  | 16.31  | 20,539.9  | 37.2%  | 6.6%  | 3.5%  | 29.8%\n2024  | 71.54  | 89,924.7  | 22.01  | 27,641.2  | 45.3%  | 5.5%  | 3.9%  | 24.2%\n2025  | 75.38  | 94,370.1  | 22.63  | 28,330.0  | 3.4%  | 5.0%  | 3.9%  | 24.1%\n2026  | 104.9  | 130,912.7  | 29.58  | 36,919.5  | 36.6%  | 5.0%  | 3.9%  | 18.9%\n2027  | 110.4  | 137,334.8  | 30.46  | 37,907.2  | 3.3%  | 5.0%  | 3.9%  | 18.8%\n2028  | 116.2  | 144,160.3  | 31.43  | 38,998.6  | 3.3%  | 5.0%  | 3.9%  | 18.6%"
  }
]