[
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy ofIraq** is dominated by the oil sector, which provided 89% of\nforeign exchange earnings in 2024. During its modern history, the oil sector\nhas provided about 99.7% of foreign exchange earnings. Agrarian economy\nunderwent rapid development following the 14 July Revolution in 1958 which\noverthrew the Hashemite monarchy. It had become the third-largest economy in\nthe Middle East by 1980. This occurred in part because of the\nindustrialization and infrastructure development initiatives led by Saddam\nHussein in the 1970s, which included irrigation projects, railway and highway\nconstruction, and rural electrification.\n\nIn the 1980s, financial problems caused by massive expenditures in the Iran-\nIraq War and damage to oil export facilities by Iran's military led the\nBa'athist government to implement austerity measures, to borrow heavily, and\nto later reschedule foreign debt payments. Iraq suffered economic losses of at\nleast $80 billion from the war. In 1988, the hostilities ended. Oil exports\ngradually increased with the construction of new pipelines and restoration of\ndamaged facilities, but again underwent a sharp decline after the Persian Gulf\nWar. GDP dropped to one-fourth of the country's 1980 GDP and continued to\ndecline under postwar international sanctions, until receiving aid from the\nU.N. Oil-for-Food Programme in 1997. Iraq experienced a modest growth by 2000,\nwhen the government attempted to make improvements and reorganizations in the\neconomic system.\n\nThe Coalition Provisional Authority made efforts to modernize the economy\nafter the 2003 U.S.-led invasion, through privatization and reducing the\ncountry's foreign debt. As a result Iraq's economy expanded rapidly during\nthis time, though growth was stunted by the insurgency, civil war, economic\nmismanagement, and oil shortages caused by outdated technology. Since\nmid-2009, oil export earnings have returned to levels seen before Operation\nNew Dawn. Government revenues rebounded, along with global oil prices. In\n2011, Iraq increased oil exports above their then-current level of 1,900,000\nbbl (300,000 m3) per day as a result of new contracts with international oil\ncompanies. The export was thought likely to fall short of the 2,400,000\nbarrels (380,000 m3) per day forecasting in the budget. Iraq's contracts with\nmajor oil companies had the potential to greatly expand oil revenues, but Iraq\nneeded to upgrade its oil processing, pipeline, and export infrastructure to\nenable these deals to reach their potential.\n\nAn improved security environment and an initial wave of foreign investment\nhelped to spur economic activity, particularly in the energy, construction,\nand retail sectors. Broader economic improvement, long-term fiscal health, and\nsustained increases in the standard of living still depended on the government\npassing major policy reforms and the continued development of Iraq's massive\noil reserves. Although foreign investors viewed Iraq with increasing interest\nin 2010, most were still hampered by difficulties acquiring land for projects\nand other regulatory impediments."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic growth",
    "text": "Historical GDP per capita development\n\nNominal GDP grew by 213% in the 1960s, 1325% in the 1970s, 2% in the 1980s,\n−47% in the 1990s, and 317% in 2000s.\n\nReal GDP per capita (measured in $1990 ) increased significantly during the\n1950s, 60s and 70s, which can be explained by both higher oil production\nlevels as well as oil prices, which famously peaked in the 1970s due to the\nOPEC's oil embargo, causing the 1973 oil crisis. In the following two decades,\nhowever, GDP per capita in Iraq dropped substantially because of multiple\nwars, namely the 1980-88 war with Iran, the 1990-1991 Gulf War."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Iran-Iraq War",
    "text": "Before the outbreak of the war with Iran in September 1980, the economic\noutlook was positive. In 1979, oil production reached a level of 560,000 m³\n(3.5 million barrels) per day, and oil revenues were 21 billion dollars in\n1979 and $27 billion in 1980 due to record oil prices. Iraq had amassed an\nestimated $35 billion in foreign exchange reserves. It was believed to have\none of the best education and health care systems in the Middle East, and\nthousands of migrant workers from Egypt, Somalia, and the Indian subcontinent\nwere employed in construction projects. The Iran–Iraq War and the 1980s oil\nglut depleted Iraq's foreign exchange reserves, devastated its economy and\nleft the country with a foreign debt of more than $40 billion. Oil exports\ngradually increased as new pipelines were constructed and damaged facilities\nwere restored."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Sanctions",
    "text": "Iraq's seizure of Kuwait in August 1990, subsequent international economic\nsanctions on Iraq, and damage from military action by an international\ncoalition beginning in January 1991, drastically reduced economic activity.\nThe regime exacerbated shortages by supporting large military and internal\nsecurity forces and by allocating resources to key supporters of the Ba'ath\nParty. The implementation of the UN's Oil for Food program in December 1996\nhelped improve economic conditions. For the first six six-month phases of the\nprogram, Iraq was allowed to export increasing amounts of oil in exchange for\nfood, medicine, and other humanitarian goods. In December 1999, the UN\nSecurity Council authorized Iraq to export as much oil as required to meet\nhumanitarian needs. Per capita, food imports increased substantially, while\nmedical supplies and health care services steadily improved, though per capita\neconomic production and living standards were still well below their prewar\nlevel.\n\nIraq changed its oil reserve currency from the U.S. dollar to the euro in\n2000. However, 28% of Iraq's export revenues under the program were deducted\nto meet UN Compensation Fund and UN administrative expenses. The drop in GDP\nin 2001 was largely the result of the global economic slowdown and lower oil\nprices."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "After the invasion of Iraq in 2003",
    "text": "The removal of sanctions on 24 May 2003 and rising oil prices in the mid-to-\nlate 2000s led to a doubling in oil production from a low of 1.3 mbpd during\nthe turbulence of 2003 to a high of 2.6 mbpd in 2011. Furthermore, reduced\ninflation and violence since 2007 have translated to real increases in living\nstandards for Iraqis.\n\nOne of the key economic challenges was Iraq's immense foreign debt, estimated\nat $130 billion. Although some of this debt was derived from normal export\ncontracts that Iraq had failed to pay for, some was a result of military and\nfinancial support during Iraq's war with Iran.\n\nThe Jubilee Iraq campaign argued that much of these debts were odious\n(illegitimate). However, as the concept of odious debt is not accepted, trying\nto deal with the debt on those terms would have embroiled Iraq in legal\ndisputes for years. Iraq decided to deal with its debt more pragmatically and\napproached the Paris Club of official creditors.\n\nIn a December 2006 _Newsweek International_ article, a study by Global Insight\nin London was reported to show \"that Civil war or not, Iraq has an economy,\nand—mother of all surprises—it's doing remarkably well. Real estate is\nbooming. Construction, retail and wholesale trade sectors are healthy, too,\naccording to [the report]. The U.S. Chamber of Commerce reports 34,000\nregistered companies in Iraq,[_when?_] up from 8,000 three years ago. Sales of\nsecondhand cars, televisions and mobile phones have all risen sharply.\nEstimates vary, but one from Global Insight puts GDP growth at 17 per cent\nlast year and projects 13 per cent for 2006. The World Bank has it lower: at 4\nper cent this year. But, given all the attention paid to deteriorating\nsecurity, the startling fact is that Iraq is growing at all.\""
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Industry",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed.\n_Find sources:_ \"Economy of Iraq\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( November 2023)__(Learn how and when to remove this\nmessage)_\n---|---\n| This section may **requirecleanup** to meet Wikipedia's quality standards.\nThe specific problem is: **”Industry” section seems out of place and\npotentially irrelevant/redundant.** Please help improve this section if you\ncan. _( November 2023)__(Learn how and when to remove this message)_\n---|---\n\nSince 1974, after the Iraqi Government took direct control of Iraq’s largest\nprivate oil production operations, Mosul Oil and Basra Oil, most of Iraq's\nmanufacturing activity has been closely connected to the oil\nindustry.[_citation needed_] The major industries in that category have been\npetroleum refining and the manufacture of chemicals and fertilizers. Before\n2003, diversification was hindered by limitations on privatization and the\neffects of the international sanctions of the 1990s. Since 2003, security\nproblems have blocked efforts to establish new enterprises. The construction\nindustry is an exception; in 2000 cement was the only major industrial product\nnot based on hydrocarbons. The construction industry has profited from the\nneed to rebuild after Iraq's several wars. In the 1990s, the industry\nbenefited from government funding of extensive infrastructure and housing\nprojects and elaborate palace complexes."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "Agriculture contributes just 3.3% to the gross national product but employs a\nfifth of the labor force.\n\nHistorically, 50 to 60 per cent of Iraq's arable land was under\ncultivation.[_self-published source?_] Under the UN Oil for Food program, Iraq\nimported large quantities of grains, meat, poultry, and dairy products. In\n1981, the government abolished its collective farming program. During the Gulf\nWar, Iraqi agriculture was disrupted physically and suffered from economic\nsanctions imposed by the United Nations. Imports were curtailed, petroleum\nexports were cut off and agricultural production with potential military\napplication was halted. The Iraqi government responded by monopolizing grain\nand oilseed marketing, imposing production quotas, and instituting a Public\nDistribution System for basic foodstuffs. By mid-1991, the government supplied\na \"basket\" of foodstuffs that provided about one-third of the caloric daily\nrequirement and cost consumers about five percent of its market value. With\nsubsidies for agricultural inputs diminished, the government's prices failed\nto cover their costs. Tax on agricultural production reached 20 to 35 percent\nby the mid-1990s. In October 1991 the Baghdad regime withdrew personnel from\nthe northern region controlled by two Kurdish parties. Kurdistan Region was\ndescribed as \"... a market economy essentially left alone by a fragile\ngoverning structure, but heavily influenced by substantial international\nhumanitarian aid flows.\"\n\nIn December 1996, under an \"Oil for Food Program\" negotiated with the United\nNations, Iraq started exporting petroleum and used the proceeds to import\nfoodstuffs. Grain imports averaged $828 million from 1997 to 2001, an increase\nof over 180 percent from the previous five-year period. Due to foreign\ncompetition, Iraqi production declined (29 percent for wheat, 31 percent for\nbarley, and 52 percent for maize). Because the government had neglected the\nproduction of forage crops, fruits, vegetables, and livestock other than\npoultry, those sectors were less buffeted by international affairs.\nNevertheless, they were affected by severe drought, an outbreak of screwworm,\nand an epizootic of foot-and-mouth disease As the Oil for Food Program\nexpanded to cover more agricultural inputs and machinery, the productivity of\nIraqi agriculture stabilized around 2002.\n\nAfter the U.S. invasion in March 2003, many Iraqis became dependent on\ngovernment-subsidized food. The US-funded agricultural reconstruction program\nthus focused on increased productivity under the aegis of Agricultural\nReconstruction and Development Iraq (ARDI). Another program was run by\nDevelopment Alternatives, Inc. (DAI) of Bethesda, Maryland. The restoration of\nIraq's irrigation systems was largely funded by Bechtel International.\n\nARDI conducted trials to improve farming practices and crop varieties of\nwinter cereals (wheat and barley), summer cereals (rice, maize, and sorghum),\npotatoes, and tomatoes. Feed supplements and veterinary treatments were\nintroduced to increase ovulation, conception, and birth weights of livestock.\nSurveys were conducted of poultry growers and apple farmers. Nurseries were\nestablished for date palms and grapes. ARDI had projects promoting trade\nassociations and producers' co-ops and supported extension as an appropriate\ngovernmental function. The contract eventually cost over $100 million and\nlasted through December 2006. Under its Community Action Program, USAID also\nfunded an analysis of markets for sheep and wool. It awarded a contract to the\nUniversity of Hawaii to revitalize higher education in agriculture. It awarded\na contract for $120 million to the Louis Berger Group to promote Iraq's\nprivate sector, including agriculture.\n\nStarting in 2006, Provincial Reconstruction Teams were sent in to promote\ngoodwill and sap the insurgency. \"PRTs\" allowed military commanders to\nidentify local needs and, with few bureaucratic hurdles, to dispense up to\n$500,000. Civilians from many agencies within the U.S. Department of\nAgriculture, as well as USAID, served tours on PRTs. Some participants\ncriticized the absence of a national agricultural strategy, or clear direction\non the design of projects. Others complained that projects emphasized\n\"American-style, 21st-century agricultural technologies and methodologies...\"\nthat were inappropriate for Iraq.\n\nAgricultural production did not rebound from the reconstruction program.\nAccording to the Food and Agriculture Organization (FAO), between 2002 and\n2013, the production of wheat increased 11 percent and milled rice 8 percent,\nbut barley had decreased 13 percent and maize 40 percent. Scaled in\n\"international dollars\" (2004-2006 base equaling 100) Iraq's per capita food\nproduction was 135 in 2002, 96 in 2007, and 94 in 2012. The agricultural\nsector shed workers. In those same years, production per worker was 117, 106,\nand 130, respectively.\n\nThe international Oil-for-Food program (1997–2003) further reduced farm\nproduction by supplying artificially priced foreign foodstuffs. Because of\nfavorable weather conditions, grain production was 22 percent higher than in\n2002. Although growth continued in 2004, experts predicted that Iraq would be\nan importer of agricultural products for the foreseeable future. Long-term\nplans call for investment in agricultural machinery and materials and more\nprolific crop varieties—improvements that did not reach Iraq's farmers under\nthe Hussein regime. In 2004, the main crops were wheat, barley, corn, rice,\nvegetables, dates, and cotton, and the main livestock outputs were cattle and\nsheep.\n\nThe Agricultural Cooperative Bank, capitalized at nearly 1 G$ - by 1984,\ntargets its low-interest, low-collateral loans to private farmers for\nmechanization, poultry projects, and orchard development. Large modern cattle,\ndairy, and poultry farms are under construction. Obstacles to agricultural\ndevelopment include labor shortages, inadequate management and maintenance,\nsalinization, urban migration, and dislocations resulting from previous land\nreform and collectivization programs.\n\nIn 2011, an agricultural adviser to the Iraqi government, Layth Mahdi,\nsummarized the forced United States agricultural reconstruction:\n\n> Before 2003, Iraq had imported about 30 per cent of its food needs annually.\n> The decline in agricultural production after this period, created the need\n> for importing 90 per cent of the food at a cost estimated at more than $12\n> billion annually. Due to the sudden shift in the agricultural policy from\n> subsidized assistance to an immediate shift to a free market policy, the\n> outcomes led to a decline in production. The observed outcome resulted in\n> many farmers abandoning the land and agriculture. The impact on natural\n> resources results in an exploited and degraded environment leaving the land\n> destitute and the people impoverished, unemployed [and] experiencing a sense\n> of losing their human dignity.\n\nImportation of foreign workers and increased entry of women into traditionally\nmale labour roles have helped compensate for agricultural and industrial\nlabour shortages exacerbated by the war. A disastrous attempt to drain the\nsouthern marshes and introduce irrigated farming to this region merely\ndestroyed a natural food producing area, while concentration of salts and\nminerals in the soil due to the draining left the land unsuitable for\nagriculture.\n\nIn the Mada'in Qada region east of Baghdad, hundreds of small farmers united\nto form the Green Mada'in Association for Agricultural Development, an\nagricultural cooperative that provides its members with drip irrigation and\ngreenhouses as well as access to credit.\n\nIn recent years, farmers have been confronted with reduced rainfall and high\ntemperatures. Particularly affected are small scale farmers who, unable to\nwithstand lower water levels, are forced to leave their lands in search of\ndifferent ways to fulfill their livelihoods."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Forestry, fishing, and mining",
    "text": "Throughout the twentieth century, human exploration, shifting agriculture,\nforest fires, and uncontrolled grazing denuded large areas of Iraq's natural\nforests, which in 2005 were almost exclusively confined to the northeastern\nhighlands. Most of the trees found in that region are not suitable for\nlumbering. In 2002, a total of 112,000 cubic meters of wood were harvested,\nnearly half of which was used as fuel.[_citation needed_]\n\nDespite its notable large rivers, Iraq's fishing industry has remained\nrelatively small and based largely on marine species in the Persian Gulf. In\n2001, the approximate yield was 8,000 tons (compared to 18,000/t during the\nperiod between 1981-1997) according to official government estimates.\n\nAside from hydrocarbons, Iraq's mining industry has been confined to\nextraction of relatively small amounts of phosphates (at Akashat), salt, and\nsulfur (near Mosul). Since a productive period in the 1970s, the mining\nindustry has been hampered by the Iran–Iraq War (1980–88), the sanctions of\nthe 1990s, and the economic collapse of 2003."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Energy",
    "text": "A map of world oil reserves according to U.S. EIA, 2017\n\nIraq is one of the most oil-rich countries in the world. The country holding\nthe fifth largest proven crude oil reserves, totaling 147.22 billion barrels\nat the end of 2017. Most of this oil—4 million barrels per day out of 4.3\nmillion barrels produced daily—is exported, making Iraq the third-largest\nexporter of oil. Despite its ongoing civil war, Iraq was able to increase oil\nproduction during 2015 and 2016, with production dipping by 3.5 per cent in\n2017 due to conflict with the Kurdistan Regional Government and OPEC\nproduction limits. By world standards, production costs for Iraqi oil are\nrelatively low. However, four wars—the 1980–1988 Iraq-Iran War, 1991 Gulf War,\nthe 2003–2011 War in Iraq, and the civil war—and the 1991–2003 UN sanctions\nhave left the industry's infrastructure in poor condition.\n\nKhawr Al Amaya Oil Platform in Basra Governorate Power plant and oil refinery\nin Baghdad\n\nIn the 1970s, Iraq produced over 3.5 million barrels of oil per day.\nProduction began to fall during the Iran-Iraq War, before plummeting 85 per\ncent after the 1991 invasion of Kuwait. UN sanctions prevented the export of\noil until 1996, and then allowed exports only in exchange for humanitarian aid\nin the Oil-for-Food Programme. The 2003 lifting of sanctions enabled\nproduction—and exports—to restart. Production has since recovered to pre-Gulf\nWar levels, and most of Iraq's oil infrastructure has been repaired, despite\npersistent sabotage by the Islamic State (ISIL) and others. In 2004, Iraq had\neight oil refineries, the largest of which were at Baiji, Basra, and Daura.\n\nDespite its oil wealth, sabotage and technical problems at refineries have\nforced Iraq to import petroleum, other refined oil products, and electricity\nfrom the neighbouring countries, especially Iran. In 2004, for example, Iraq\nspent $60 million per month for imported gasoline. Sabotage In late 2004 and\nearly 2005, regular sabotage of plants and pipelines reduced export and\ndomestic distribution of oil, particularly to Baghdad. Nationwide fuel\nshortages and power outages resulted. Persistent ISIL sabotage of pipelines,\npower plants and power lines, and theft of oil and electricity have also\ncontributed to the July 2018 protests in southern Iraq.\n\nIn 2004, plans called for increased domestic utilization of natural gas to\nreplace oil and for use in the petrochemical industry. However, because most\nof Iraq's gas output is associated with oil, output growth depends on\ndevelopments in the oil industry.\n\nHalf of Iraq's power plants were destroyed in the Persian Gulf War of 1991,\nand full recovery never occurred. In mid-2004, Iraq had an estimated 5,000\nmegawatts of power-generating capacity, compared with 7,500 megawatts of\ndemand. At that time, the transmission system included 17,700 kilometers of\nline. In 2004, plans called for construction of two new power plants and\nrestoration of existing plants and transmission lines to ease the blackouts\nand economic hardship caused by this shortfall, but sabotage and looting kept\ncapacity below 6,000 megawatts. The ongoing civil war, sabotage of\ntransmission lines, and government corruption caused the electricity shortage\nto worsen: by 2010 demand outstripped supply by 6000 megawatts.\n\nOil continues to dominate Iraq's economy. As of 2018[update], oil is\nresponsible for over 65 per cent of GDP and 90 per cent of total government\nrevenue. Petroleum constitutes 94% of Iraq's exports with a value of $59.73\nbillion in 2017. The central government hopes to diversify the economy away\nfrom oil, and has had some success: non-oil GDP growth, which was below the\nregional average from 2014 to 2016, pushed above the average in 2017. Despite\nthis, the percentage of government spending going to non-oil investment has\ncontinued to decline since 2013 and now[_when?_] stands at only 34 per cent."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.3.1",
    "section_name": "2009 oil services contracts",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( August 2018)_\n---|---\n\nBetween June 2009 and February 2010 the Ministry of Oil tendered for the award\nof Service Contracts to develop Iraq's existing oil fields. The results of the\ntender, which were broadcast live on Iraqi television, are as follows for all\nmajor fields awarded but excluding the Kurdistan Region where Production\nSharing Contracts have been awarded that are currently being disputed by the\nBaghdad government. All contracts are awaiting final ratification of the\nawards by the Iraqi government. Company shares are subject to change as a\nresult of commercial negotiations between parties.\n\nField  | Company  | Home country  | Company type  | Share in field  | Production increase share  | Service fee per bbl  | Gross revenue at plateau - US bn p.a.  | References\n---|---|---|---|---|---|---|---|---\nMajnoon | Shell | Netherlands  | Public  | 45%  | 0.7875  | 1.39  | 0.4  | BBC Archived 7 March 2012 at the Wayback Machine\n| Petronas | Malaysia  | State  | 30%  | 0.525  | 1.39  | 0.266  | Shell\nHalfaya | CNPC | China  | State  | 37.5%  | 0.525  | 1.39  | 0.102  | Upstream Archived 12 January 2016 at the Wayback Machine\n| Petronas | Malaysia  | State  | 18.75%  | 0.099  | 1.4  | 0.051  | Upstream Archived 26 September 2012 at the Wayback Machine\n| TotalEnergies | France  | Public  | 18.75%  | 0.099  | 1.39  | 0.051  |\nRumaila | BP | UK  | Public  | 37.5%  | 0.7125  | 2  | 0.520  | Business Week\n| CNPC | China  | State  | 37.5%  | 0.7125  | 1.39  | 0.520  |\nZubair | ENI | Italy  | Public  | 32.81%  | 0.328  | 2  | 0.240  | Business Week\n| Occidental | US  | Public  | 23.44%  | 0.2344  | 2  | 0.171  | Business Week[_dead link_]\n| KOGAS | Korea  | State  | 18.75%  | 0.1875  | 2  | 0.137  | Business Week Archived 7 October 2011 at the Wayback Machine\nWest Qurna Field Phase 2  | Lukoil | Russia  | Public  | 75.00%  | 1.3500  | 1.15  | 0.567  | Business Week\n| Equinor | Norway  | State  | n/a  | n/a  | n/a  | n/a  | Equinor Archived 25 January 2012 at the Wayback Machine\nBadra | Gazprom | Russia  | State  | 30%  | 0.051  | 5.5  | 0.102  | Business Week\n| Petronas | Malaysia  | State  | 15%  | 0.0255  | 5.5  | 0.051  | Upstream Archived 7 October 2011 at the Wayback Machine\n| KOGAS | Korea  | State  | 23%  | 0.03825  | 5.5  | 0.077  | Upstream Archived 7 October 2011 at the Wayback Machine\n| TPAO | Turkey  | State  | 8%  | 0.01275  | 5.5  | 0.026  |\nWest Qurna Field Phase 1  | Exxon | US  | Public  | 60%  | 1.2276  | 1.9  | 0.851  | Business Week[_dead link_]\n| Shell | United Kingdom / Netherlands  | Public  | 15%  | 0.3069  | 1.9  | 0.213  | Alfred Donovan's blog Archived 29 February 2012 at the Wayback Machine (royaldutchshellplc.com)\n\n_Notes:_\n\n1. _Field shares are as a % of the total. The Iraqi state retains a 25% share in all fields for which service contracts have been awarded._\n2. _Production increase share is the millions of bbls per day that will attract the service fee for the company._\n3. _Gross revenue at plateau is the total payment each company will receive upon reaching their declared target plateau production rate (in between 5 and 8 years, depending on the field), before deduction of any operating costs, in addition to recovery of all development costs as billions of US dollars per annum. The total gross revenue for all companies, after recovery of capital costs, is at plateau production of an additional 9.4 mb/d, 4.34 bn US per annum, at a $70 bbl oil price. The 2010 Iraq govt budget is $60 billion. $300 billion is approximately $10,000 per annum for each Iraqi citizen._\n\nIn summary the shares by region in the increased production are:\n\nRegion  | Production\nShare mb/d  | % of\ntotal\n---|---|---\nIraq  | 1.462  | 25%\nAsia  | 1.9  | 20%\nUK  | 1.81  | 19%\nUS  | 1.462  | 16%\nRussia  | 1.402  | 14%\nEurope (excl UK)  | 0.528  | 6%"
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Finance",
    "text": "Iraq's financial services have been the subject of post-Saddam reforms. The 17\nprivate banks established during the 1990s were limited to domestic\ntransactions and attracted few private depositors. Those banks and two main\nstate banks were badly damaged by the international embargo of the 1990s. To\nfurther privatize and expand the system, in 2003 the Coalition Provisional\nAuthority removed restrictions on international bank transactions and freed\nthe Central Bank of Iraq (CBI) from government control. In its first year of\nindependent operation, the CBI received credit for limiting Iraq's\ninflation.[_citation needed_] In 2004, three foreign banks (HSBC, Standard\nChartered, National Bank of Kuwait) were the first to receive licenses to do\nbusiness in Iraq."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.4.1",
    "section_name": "Banking",
    "text": "Modern-style banking in Iraq roots from the beginning of the 20th century.\n\nIraq's two state-owned banks are the largest banks in Iraq and have a shared\nhistory. In 1988, Rafidain Bank was spun off from Rafidain Bank .\n\nBanking group  | Established  | Number of\nBranches  | Total Assets\n(Iraqi Dinar billion)  | Share of\ntotal\nbanking system\nassets  | Share of\ntotal\nbanking system\ncredit  | Share of\ntotal\nbanking system\ndeposits\n---|---|---|---|---|---|---\nRasheed Bank | 1988  | 162  |  |  |  |\nRafidain Bank | 1941  | 147  |  |  |  |"
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Private security",
    "text": "Because of the danger posed by Iraq's ongoing insurgency, the security\nindustry has been a uniquely prosperous part of the services sector. Often run\nby former US military personnel, in 2005 at least 26 companies offered\npersonal and institutional protection, surveillance, and other forms of\nsecurity."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Retail",
    "text": "Inside a shopping mall in Najaf\n\nIn the early post-Hussein period, a freewheeling retail trade in all types of\ncommodities straddled the line between legitimate and illegitimate commerce,\ntaking advantage of the lack of income tax and import controls.\n\n* Baghdad Mall\n\n* Dream City Mall\n\n* Zayoona Mall\n\n* Babylon Mall\n\n* A mall in Basra\n\n* Basra Times Square"
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Tourism",
    "text": "The Iraq tourism industry, which in peaceful times has profited from Iraq's\nmany places of cultural interest (earning US$14 million in 2001), has been\ndormant since 2003. Despite conditions, in 2005 the Iraqi Tourism Board\nmaintained a staff of 2,500 and 14 regional offices. Between 2009 and 2010,\n165 tourists from 16 countries entered Iraq to visit historic sites; as of\nJanuary 2011, a U.S. State Department grant provided $2 million to help\npreserve Babylon, supporting the re-opening of one of the site's two museums."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Telecommunications",
    "text": "From 2003 to 2008, mobile phone subscriptions had expanded over hundred-fold\nto ten million nationwide, according to the Brookings Institution."
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Labor force",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( May 2025)_\n---|---\n\nIn 2002, Iraq's labour force was estimated at 6.8 million people.\n\nIn 1996, some 66.4 per cent of the labour force worked in services, 17.5 per\ncent in industry, and 16.1 per cent in agriculture. 2004 estimates of Iraq's\nunemployment ranged from 30 per cent to 60 per cent.\n\n**Nationwide unemployment rate since May, 2003** Month  | Unemployment\nrate\n---|---\n2003-2005 May  | N/A\n2003-2006 June  | 50-60%\n2003-2007 July  | N/A\n2003-2008 August  | 50-60%\n2003-2009 September  | N/A\n2003-2010 October  | 40-50%\n2003-2011 November  | N/A\n2003-2012 December  | 45-55%\nJanuary to May 2004  | 30-45%\nJune to November 2004–06  | 30-40%\n2004-12 December  | 28-40%\nJanuary to October 2005  | 27-40%\nNovember to December 2005  | 25-40%\n2006  | 25-40%\n2007  | 25-40%\n2008  | 25-40%\n2009  | 23-38%\n2010  | 15.2%\n2011  | 15.2%\n2012  | 15.3%\n2013  | 15.1%\n2014  | 15%\n2015  | 15.5%\n2016  | 16%\n\nThe CPA has referred to a 25% unemployment rate, the Iraqi Ministry of\nPlanning mentioned a 30% unemployment rate, whereas the Iraqi Ministry of\nSocial Affairs claims it to be 48%. Other sources are claiming a 20%\nunemployment rate and a probably 60% under-employment rate. The actual figure\nis problematic because of high participation in black-market activities and\npoor security conditions in many populous areas. In central Iraq, security\nconcerns discouraged the hiring of new workers and the resumption of regular\nwork schedules. At the same time, the return of Iraqis from other countries\nincreased the number of job seekers. In late 2004, most legitimate jobs were\nin the government, the army, the oil industry, and security-related\nenterprises. Under Saddam Hussein's reign, many of the highest-paid workers\nwere employed by the greatly overstaffed government, whose overthrow disrupted\nthe input of these people to the economy. In 2004, the U.S. Agency for\nInternational Development committed US$1 billion for a worker-training\nprogram. In early 2004, the minimum wage was US$72 per month.[_citation\nneeded_]"
  },
  {
    "chapter_name": "Economy of Iraq",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "External trade",
    "text": "Iraqi exports in 2006\n\nIraq is a founding member of OPEC. Petroleum constitutes 99,7% of Iraq's\nexports with a value of $43,8 billion in 2016.\n\nFrom the 1990s until 2003, the international trade embargo restricted Iraq's\nexport activity almost exclusively to oil. In 2003, oil accounted for about\nUS$7.4 billion of Iraq's total US$7.6 billion of export value, and statistics\nfor earlier years showed similar proportions. After the end of the trade\nembargo in 2003 expanded the range of exports, oil continued to occupy the\ndominant position: in 2004 Iraq's export income doubled (to US$16.5 billion),\nbut oil accounted for all but US$340 million (2 per cent) of the total. In\nlate 2004, sabotage significantly reduced oil output, and experts forecast\nthat output, hence exports, would be below capacity in 2005 as well. In 2004,\nthe chief export markets were the United States (which accounted for nearly\nhalf), Italy, France, Jordan, Canada, and the Netherlands. In 2004, the value\nof Iraq's imports was US$21.7 billion, incurring a trade deficit of about\nUS$5.2 billion. In 2003, the main sources of Iraq's imports were Turkey,\nJordan, Vietnam, the United States, Germany, and Britain. Because of Iraq's\ninactive manufacturing sector, the range of imports was quite large, including\nfood, fuels, medicines, and manufactured goods. By 2010, exports rose to\nUS$50.8 billion and imports rose to US$45.2 billion. Chief 2009 export\npartners were: U.S., India, Italy, South Korea, Taiwan, China, Netherlands,\nand Japan. Chief 2009 import partners were: Turkey, Syria, U.S., China,\nJordan, Italy, and Germany.\n\nIn March 2022, Iran-Iraq trade reached a volume of 10 billion USD, as joint\nventures increased significantly but were still limited due to sanctions\nagainst Iran. Especially goods originating from Iran were subject to a trade\nembargo imposed by the United States and the European Union. Iran and Iraq\nsigned a memorandum of understanding (MOU) on economic cooperation in January\n2021."
  }
]