[
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Kuwait has a petroleum-based economy that is classified as emerging and high-\nincome. By various per-capita measures of economic output, Kuwait is one of\nthe wealthiest countries in the world.",
    "openai_summarised_points": [
      "• Kuwait has an economy primarily based on petroleum, indicating a resource-dependent economic structure.",
      "• The country's economy is classified as both emerging and high-income, reflecting its developing yet affluent status.",
      "• Kuwait ranks among the wealthiest nations globally when assessed through various per-capita measures of economic output.",
      "• The high per-capita income levels are indicative of substantial individual wealth and economic prosperity within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:51.369270",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 192,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Petroleum and natural gas",
    "text": "In 1934, the Emir of Kuwait granted an oil concession to the Kuwait Oil Co.\n(KOC), jointly owned by the Anglo-Persian Oil Company (later British Petroleum\nCompany) and Gulf Oil Corporation In 1976, the Kuwaiti Government nationalized\nKOC.\n\nSmoke from burning Kuwait oil fields after Saddam Hussein set fire to during\nGulf war\n\nThe Kuwait Petroleum Corporation (KPC), an integrated international oil\ncompany, is the parent company of the government's operations in the petroleum\nsector, and includes Kuwait Oil Company, which produced oil and gas; Kuwait\nNational Petroleum Co., refining and domestic sales; Petrochemical Industries\nCo., producing ammonia and urea; Kuwait Foreign Petroleum Exploration Co.,\nwith several concessions in developing countries; Kuwait Oil Tanker Co.; and\nSanta Fe International Corp. The latter, purchased outright in 1982, gives KPC\na worldwide presence in the petroleum industry.\n\nKPC also has purchased from Gulf Oil Co. refineries and associated service\nstations in the Benelux nations and Scandinavia, as well as storage facilities\nand a network of service stations in Italy. In 1987, KPC bought a 19% share in\nBritish Petroleum, which was later reduced to 10%. KPC markets its products in\nEurope under the brand Q8 and is interested in the markets of the United\nStates and Japan.\n\nKuwait has about 94 billion barrels (14.9 km3) of recoverable oil reserves.\nEstimated capacity, before the war, was about 2.4 million barrels per day\n(380×10~~^~~ 3 m3/d). During the Iraqi occupation, Kuwait's oil-producing\ncapacity was reduced to practically nothing. However, tremendous recovery and\nimprovements have been made since. Oil production was 1.5 million barrels per\nday (240×10~~^~~ 3 m3/d) by the end of 1992, and pre-war capacity was restored\nin 1993. Kuwait's production capacity is estimated to be 2.5 million barrels\nper day (400×10~~^~~ 3 m3/d). Kuwait plans to increase its capacity to 3.5\nmillion barrels per day (560×10~~^~~ 3 m3/d) by 2005..\n\nAs part of Kuwait Vision 2035, Kuwait aims to position itself as a global hub\nfor the petrochemical industry. Al Zour Refinery is the largest refinery in\nthe Middle East. Al Zour Refinery is a Kuwait-China cooperation project under\nthe Belt and Road Initiative.",
    "openai_summarised_points": [
      "• In 1934, the Emir of Kuwait granted an oil concession to the Kuwait Oil Company (KOC), which was jointly owned by the Anglo-Persian Oil Company (later British Petroleum Company) and Gulf Oil Corporation.",
      "• The Kuwaiti government nationalized KOC in 1976, taking full control of its operations.",
      "• During the Gulf War, Kuwait's oil fields were set on fire by Saddam Hussein, resulting in significant environmental and economic damage.",
      "• The Kuwait Petroleum Corporation (KPC) is an integrated international oil company that serves as the parent organization for Kuwait's petroleum sector operations.",
      "• KPC includes several subsidiaries: Kuwait Oil Company (producing oil and gas), Kuwait National Petroleum Co. (refining and domestic sales), Petrochemical Industries Co. (producing ammonia and urea), Kuwait Foreign Petroleum Exploration Co. (with concessions in developing countries), Kuwait Oil Tanker Co., and Santa Fe International Corp.",
      "• Santa Fe International Corp., purchased outright in 1982, provides KPC with a global presence in the petroleum industry.",
      "• KPC has acquired refineries and associated service stations from Gulf Oil Co. in the Benelux nations and Scandinavia, as well as storage facilities and a network of service stations in Italy.",
      "• In 1987, KPC purchased a 19% share in British Petroleum, which was later reduced to 10%.",
      "• KPC markets its products in Europe under the brand Q8 and has expressed interest in expanding into the United States and Japanese markets.",
      "• Kuwait possesses approximately 94 billion barrels (14.9 km³) of recoverable oil reserves.",
      "• Estimated pre-war oil production capacity was about 2.4 million barrels per day (380×10³ m³/d).",
      "• During the Iraqi occupation in the Gulf War, Kuwait's oil-producing capacity was drastically reduced to nearly zero.",
      "• Post-war recovery efforts led to oil production reaching 1.5 million barrels per day (240×10³ m³/d) by the end of 1992.",
      "• Kuwait restored its pre-war capacity in 1993.",
      "• Current estimated production capacity is approximately 2.5 million barrels per day (400×10³ m³/d).",
      "• Kuwait has plans to increase its oil production capacity to 3.5 million barrels per day (560×10³ m³/d) by 2005.",
      "• As part of Kuwait Vision 2035, the country aims to establish itself as a global hub for the petrochemical industry.",
      "• The Al Zour Refinery, the largest refinery in the Middle East, is a key project under this vision.",
      "• The Al Zour Refinery is a Kuwait-China cooperation project aligned with the Belt and Road Initiative."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:55.864581",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2244,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Renewable energy",
    "text": "As part of Kuwait Vision 2035, Kuwait inaugurated its largest renewable energy\npark, Shagaya Renewable Energy Park, which includes concentrated solar power,\nsolar photovoltaic, and wind power plants. The park consists of four phases\nwith a target capacity of 4,000 MW. It is set to be one of the largest\nrenewable energy parks in the world.",
    "openai_summarised_points": [
      "• As part of Kuwait Vision 2035, Kuwait inaugurated its largest renewable energy park, the Shagaya Renewable Energy Park.",
      "• The park includes diverse renewable energy technologies such as concentrated solar power, solar photovoltaic, and wind power plants.",
      "• The Shagaya Renewable Energy Park is planned to be developed in four phases.",
      "• The total target capacity of the park is 4,000 megawatts (MW).",
      "• Once completed, the park is expected to be one of the largest renewable energy parks globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:57.502709",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 340,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Steel manufacturing",
    "text": "Steel manufacturing is Kuwait's second biggest industry. United Steel\nIndustrial Company (KWT Steel) is Kuwait's main steel manufacturing company,\nthe company caters to all of Kuwait's domestic market demands (particularly\nconstruction). Kuwait is self-sufficient in steel.",
    "openai_summarised_points": [
      "• Steel manufacturing is the second largest industry in Kuwait, indicating its significant role in the country's industrial sector.",
      "• The primary steel manufacturing company in Kuwait is United Steel Industrial Company, commonly known as KWT Steel.",
      "• KWT Steel is responsible for fulfilling all domestic steel demand within Kuwait, with a particular focus on the construction sector.",
      "• Kuwait achieves self-sufficiency in steel production, meaning it does not rely on imports to meet its steel needs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T09:59:59.550739",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 273,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Agriculture",
    "text": "In 2016, Kuwait's food self-sufficiency ratio was 49.5% in vegetables, 38.7%\nin meat, 12.4% in dairy, 24.9% in fruits, and 0.4% in cereals. 8.5% of\nKuwait's entire territory consists of agricultural land, while arable land\ncovers 0.6% of Kuwait's entire territory. Historically, Jahra was a\npredominantly agricultural area. There are currently various farms in Jahra.\n\nIn 2017, agriculture (including fisheries) accounted for almost 0.4 percent of\nthe gross domestic product. Around 4 percent of the economically active\npopulation works in agriculture, almost all foreigners. The majority of farm\nowners are investors. The total agricultural land covered 1,521 km2 in 2014.\n\nThe agriculture industry is hampered by the limited water and arable land. The\ngovernment has experimented in growing food through hydroponics and carefully\nmanaged farms. However, most of the soil which was suitable for farming in\nsouth central Kuwait was destroyed when Iraqi troops set fire to oil wells in\nthe area and created vast \"oil lakes\". Fish and shrimp are plentiful in\nterritorial waters, and largescale commercial fishing has been undertaken\nlocally and in the Indian Ocean.",
    "openai_summarised_points": [
      "• In 2016, Kuwait's food self-sufficiency ratios were 49.5% for vegetables, 38.7% for meat, 12.4% for dairy, 24.9% for fruits, and 0.4% for cereals.",
      "• Only 8.5% of Kuwait's total territory is designated as agricultural land, with arable land constituting just 0.6% of the total territory.",
      "• Historically, Jahra was a predominantly agricultural region, and it currently hosts various farms.",
      "• In 2017, agriculture, including fisheries, contributed approximately 0.4% to Kuwait's gross domestic product (GDP).",
      "• Around 4% of Kuwait's economically active population works in agriculture, with nearly all workers being foreigners.",
      "• The majority of farm owners are investors rather than small-scale farmers.",
      "• The total agricultural land in Kuwait covered 1,521 km² in 2014.",
      "• The agriculture sector faces significant challenges due to limited water resources and scarce arable land.",
      "• The Kuwaiti government has experimented with alternative food production methods such as hydroponics and carefully managed farms to mitigate resource limitations.",
      "• Much of the soil suitable for farming in south-central Kuwait was destroyed when Iraqi troops set fire to oil wells, creating extensive \"oil lakes.\"",
      "• Kuwait's territorial waters are rich in fish and shrimp, supporting plentiful marine resources.",
      "• Large-scale commercial fishing activities are conducted both locally and in the Indian Ocean."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:00:03.440439",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1163,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Finance",
    "text": "Kuwait has a leading position in the financial industry in the GCC. The Emir\nhas promoted the idea that Kuwait should focus its energies, in terms of\neconomic development, on the financial industry.\n\nThe historical preeminence of Kuwait (among the Gulf monarchies) in finance\ndates back to the founding of the National Bank of Kuwait in 1952. The bank\nwas the first local publicly traded corporation in the Gulf. In the late 1970s\nand early 1980s, an alternative stock market, trading in shares of Gulf\ncompanies, emerged in Kuwait, the Souk Al-Manakh. At its peak, its market\ncapitalization was the third highest in the world, behind only the U.S. and\nJapan, and ahead of the UK and France.\n\nKuwait has a large wealth-management industry. Kuwaiti investment companies\nadminister more assets than those of any other GCC country, save the much\nlarger Saudi Arabia. The Kuwait Financial Centre, in a rough calculation,\nestimated that Kuwaiti firms accounted for over one-third of the total assets\nunder management in the GCC.\n\nThe relative strength of Kuwait in the financial industry extends to its stock\nmarket. For many years, the total valuation of all companies listed on the\nKuwaiti exchange far exceeded the value of those on any other GCC bourse,\nexcept Saudi Arabia. In 2011, financial and banking companies made up more\nthan half of the market capitalization of the Kuwaiti bourse; among all the\nGulf states, the market capitalization of Kuwaiti financial-sector firms was,\nin total, behind only that of Saudi Arabia. In recent years, Kuwaiti\ninvestment companies have invested large percentages of their assets abroad,\nand their foreign assets have become substantially larger than their domestic\nassets.\n\nKuwait is a major source of foreign economic assistance to other states\nthrough the Kuwait Fund for Arab Economic Development, an autonomous state\ninstitution created in 1961 on the pattern of Western and international\ndevelopment agencies. Over the years aid was annually provided to Egypt,\nSyria, and Jordan, as well as the Palestine Liberation Organization. In 1974,\nthe fund's lending mandate was expanded to include all developing countries in\nthe world.",
    "openai_summarised_points": [
      "• Kuwait holds a leading position in the financial industry within the Gulf Cooperation Council (GCC), with the Emir advocating for the country's economic development to focus on the financial sector.",
      "• The prominence of Kuwait in finance among Gulf monarchies dates back to the founding of the National Bank of Kuwait in 1952, which was the first local publicly traded corporation in the Gulf region.",
      "• During the late 1970s and early 1980s, Kuwait saw the emergence of an alternative stock market, the Souk Al-Manakh, which traded shares of Gulf companies.",
      "• At its peak, the Souk Al-Manakh's market capitalization was the third largest in the world, surpassed only by the United States and Japan, and ahead of the United Kingdom and France.",
      "• Kuwait has a substantial wealth-management industry; Kuwaiti investment companies manage more assets than those in any other GCC country except Saudi Arabia, which is significantly larger.",
      "• The Kuwait Financial Centre estimated that Kuwaiti firms account for over one-third of the total assets under management across the GCC.",
      "• Kuwait's stock market has historically been one of the most valuable in the GCC; the total valuation of all listed companies on the Kuwaiti exchange has exceeded that of other GCC markets, except Saudi Arabia.",
      "• In 2011, financial and banking companies constituted more than 50% of the market capitalization of the Kuwaiti bourse.",
      "• Among all Gulf states, the combined market capitalization of Kuwaiti financial-sector firms was second only to Saudi Arabia.",
      "• In recent years, Kuwaiti investment companies have increasingly invested large proportions of their assets abroad, with foreign assets becoming significantly larger than domestic assets.",
      "• Kuwait is a major provider of foreign economic assistance through the Kuwait Fund for Arab Economic Development, an autonomous state institution established in 1961 modeled after Western and international development agencies.",
      "• The Kuwait Fund has historically provided aid annually to countries including Egypt, Syria, Jordan, and the Palestine Liberation Organization.",
      "• In 1974, the fund's lending mandate was expanded to include all developing countries worldwide."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:00:07.332749",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2174,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Reserve funds",
    "text": "The Kuwait Investment Authority (KIA) is Kuwait's sovereign wealth fund\nspecializing in foreign investment. The KIA is the world's oldest sovereign\nwealth fund. Since 1953, the Kuwaiti government has directed investments into\nEurope, the United States and the Asia–Pacific. In 2021, the holdings were\nvalued at around $700 billion in assets. It was the 3rd largest sovereign\nwealth fund in the world.\n\nThe KIA manages two funds: the General Reserve Fund (GRF) and Future\nGenerations Fund (FGF). The GRF is the main treasurer for the government. It\nreceives all state revenues and all national expenditures are paid out of this\nfund. The KIA does not disclose its financial assets in public, but it is\nestimated that the KIA has $410 billion in assets as of February 2014.\n\nThe KIA was the main source of capital for the Kuwaiti government during the\nGulf War. The Kuwaiti government relied on the KIA to pay for coalition\nexpenses and postwar reconstruction. The KIA was worth $100 billion prior to\n1990, KIA funds were depleted to $40–$50 billion after the Gulf War.\n\nIn July 2023, Kuwait plans to create a new sovereign fund, Ciyada, in\npartnership with the Kuwait Investment Authority (KIA). While the value of the\nfund has not been specified, the KIA, which currently manages over $800\nbillion in assets, will play a significant role in studying and implementing\nthe proposed fund. The aim is to develop the local economy, attract foreign\ninvestment, and finance major projects to promote economic diversification in\nKuwait.\n\nFuture Generations Fund\n\nThe Future Generations Fund (FGF) was created in 1976 by transferring 50% from\nthe general reserve fund at that time. The FGF is a saving funds for future\ngenerations. 25% of all state revenues are annually transferred to the fund.\n\nAll of the FGF is invested abroad, with an estimated 75% invested in the US\nand Europe and the rest in emerging markets, mainly China and India.",
    "openai_summarised_points": [
      "• The Kuwait Investment Authority (KIA) is Kuwait's sovereign wealth fund, specializing in foreign investment, and is recognized as the world's oldest sovereign wealth fund.",
      "• Since 1953, the Kuwaiti government has directed investments into Europe, the United States, and the Asia–Pacific region.",
      "• As of 2021, the KIA's holdings were valued at approximately $700 billion in assets, making it the third-largest sovereign wealth fund globally.",
      "• The KIA manages two primary funds: the General Reserve Fund (GRF) and the Future Generations Fund (FGF).",
      "• The General Reserve Fund (GRF) functions as the main treasury for the Kuwaiti government, receiving all state revenues and disbursing all national expenditures.",
      "• The KIA does not publicly disclose its financial assets; however, estimates as of February 2014 suggest the KIA held around $410 billion in assets.",
      "• The KIA was the primary source of capital for the Kuwaiti government during the Gulf War, providing funds for coalition expenses and postwar reconstruction efforts.",
      "• Prior to 1990, the KIA's assets were valued at approximately $100 billion; after the Gulf War, these funds were depleted to an estimated $40–$50 billion.",
      "• In July 2023, Kuwait announced plans to establish a new sovereign fund called Ciyada, in partnership with the KIA.",
      "• While the specific value of the Ciyada fund has not been disclosed, the KIA, which currently manages over $800 billion in assets, will play a key role in its development, study, and implementation.",
      "• The objectives of the Ciyada fund include developing the local economy, attracting foreign investment, and financing major projects to promote economic diversification in Kuwait.",
      "• The Future Generations Fund (FGF) was established in 1976 through the transfer of 50% of the then-existing General Reserve Fund.",
      "• The FGF serves as a savings fund for future generations, with 25% of all state revenues annually transferred to it.",
      "• All investments of the FGF are made abroad, with approximately 75% invested in the United States and Europe, and the remaining in emerging markets, primarily China and India."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:00:13.578371",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1932,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Health",
    "text": "Kuwait has a state-funded healthcare system, which provides treatment without\ncharge to Kuwaiti nationals. There are outpatient clinics in every residential\narea in Kuwait. A public insurance scheme exists to provide reduced cost\nhealthcare to expatriates. Private healthcare providers also run medical\nfacilities in the country, available to members of their insurance schemes. As\npart of Kuwait Vision 2035, many new hospitals have opened. In the years\nleading up to the COVID-19 pandemic, Kuwait invested in its health care system\nat a rate that was proportionally higher than most other GCC countries. As a\nresult, the public hospital sector significantly increased its capacity.\nKuwait currently has 20 public hospitals. The new Sheikh Jaber Al-Ahmad\nHospital is considered the largest hospital in the Middle East. Kuwait also\nhas 16 private hospitals."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Entrepreneurship",
    "text": "In the past five years, there has been a significant rise in entrepreneurship\nand small business creation in Kuwait. The informal sector is also on the\nrise, mainly due to the popularity of Instagram businesses. In 2020, Kuwait\nranked fourth in the MENA region in startup funding after the UAE, Egypt and\nSaudi Arabia.\n\nMany Kuwaiti entrepreneurs use the Instagram-based business model."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Tourism",
    "text": "The Palms Beach Hotel & Spa in Kuwait\n\nIn 2020, Kuwait's domestic travel and tourism spending reached $6.1 billion\n(up from $1.6 billion in 2019) with family tourism a rapidly growing segment.\nThe WTTC named Kuwait as one of the world's fastest-growing countries in\ntravel and tourism GDP in 2019, with 11.6% year-on-year growth. In 2016, the\ntourism industry generated nearly $500 million in revenue. In 2015, tourism\naccounted for 1.5 percent of the GDP.\n\nIn 2023, there was a rise in the spending of Kuwaiti citizens on tourism and\ntravel, recorded to be 4.39 billion dinars, marking an increase of 9.2% from\nthe 4 billion dinars recorded in 2022. The surge in tourism expenditures is\nlargely attributable to the introduction of new travel destinations, expanded\nofferings from airlines catering to family travel, and an increase in interest\nin events like the Riyadh Season and other festivities. The first quarter of\n2023 saw the highest spending (1.36 billion dinars), followed by the second\n(1.01 billion dinars), third (1.15 billion dinars), and the fourth (870\nmillion dinars), making it the year with the highest spending on travel by\nKuwaiti citizens since the outbreak of the COVID-19 pandemic. Moreover,\nspending by foreign tourists in Kuwait increased by approximately 60%,\nreaching 533.3 million dinars by the end of 2023, up from 332.6 million dinars\nin 2022.\n\nThe Amiri Diwan recently inaugurated the new Kuwait National Cultural District\n(KNCD), which comprises Sheikh Abdullah Al Salem Cultural Centre, Sheikh Jaber\nAl Ahmad Cultural Centre, Al Shaheed Park, and Al Salam Palace. With a capital\ncost of more than US$1 billion, the project is one of the largest cultural\ninvestments in the world. In November 2016, the Sheikh Jaber Al Ahmad Cultural\nCentre opened. It is the largest cultural centre and opera house in the Middle\nEast. The Kuwait National Cultural District is a member of the Global Cultural\nDistricts Network. The annual \"Hala Febrayer\" festival attracts tourists from\nneighboring GCC countries, and includes a variety of events including music\nconcerts, parades, and carnivals. The festival is a month-long commemoration\nof the liberation of Kuwait, and runs from 1 to 28 February. Liberation Day\nitself is celebrated on 26 February."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Science and technology",
    "text": "According to the United States Patent and Trademark Office, Kuwait registered\n448 patents as of 31 December 2015, In the early to mid 2010s, Kuwait\nregistered the largest number of scientific publications and patents per\ncapita regionally. The Kuwaiti government has implemented various programs to\nfoster innovation resulting in patent rights. The WIPO Global Innovation Index\nfound that Kuwait ranks 71st over 139 (for its innovation efficiency ratio\n(which shows how much innovation output a country is getting for its inputs).\n\nKuwait was the first country in the region to implement 5G technology. Kuwait\nis among the world's leading countries in 5G penetration. The Chinese company\nHuawei has a $1.7 billion investment license in Kuwait to develop the\ncountry's ICT sector in line with the Kuwait Vision 2035 strategy."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Space",
    "text": "Kuwait Space Rocket\n\nKuwait has an emerging space industry driven by the private sector.\n\nKuwait's first satellite\n\nKuwait's Orbital Space in collaboration with the Space Challenges Program and\nEnduroSat introduced an international initiative called \"Code in Space\". The\ninitiative allows students from around the world to send and execute their own\ncode in space. The code is transmitted from a satellite ground station to a\ncubesat (nanosatellite) orbiting Earth 500 km (310 mi) above sea level. The\ncode is then executed by the satellite's onboard computer and tested under\nreal space environment conditions. The nanosatellite is called \"QMR-KWT\"\n(Arabic: قمر الكويت) which means \"Moon of Kuwait\", translated from Arabic.\n\nQMR-KWT launched to space on 30 June 2021 on SpaceX Falcon 9 Block 5 rocket\nand was part of the payload of a satellite carrier called ION SCV Dauntless\nDavid by D-Orbit. It was deployed into its final orbit (Sun-synchronous orbit)\non 16 July 2021. QMR-KWT is Kuwait's first satellite.\n\nUm Alaish 4\n\nSeven years after the launch of the world's first communications satellite,\nTelstar 1, Kuwait in October 1969 inaugurated the first satellite ground\nstation in the Middle East, \"Um Alaish\". The Um Alaish satellite station\ncomplex housed several satellite ground stations including Um Alaish 1 (1969),\nUm Alaish 2 (1977), and Um Alaish 3 (1981). It provided satellite\ncommunication services in Kuwait until 1990 when it was destroyed by the Iraqi\narmed forces during the Iraqi invasion of Kuwait. In 2019, Kuwait's Orbital\nSpace established an amateur satellite ground station to provide free access\nto signals from satellites in orbit passing over Kuwait. The station was named\nUm Alaish 4 to continue the legacy of \"Um Alaish\" satellite station. Um Alaish\n4 is member of FUNcube distributed ground station network and the Satellite\nNetworked Open Ground Station project (SatNOGS).\n\nKuwait Space Rocket\n\nThe Kuwait Space Rocket (KSR) is a Kuwaiti project to build and launch the\nfirst suborbital liquid bi-propellant rocket in Arabia. The project is divided\ninto two phases with two separate vehicles: an initial testing phase with\nKSR-1 as a test vehicle capable of reaching an altitude of 8 km (5.0 mi) and a\nmore expansive suborbital test phase with the KSR-2 planned to fly to an\naltitude of 100 km (62 mi).\n\nTSCK experiment in space\n\nKuwait's Orbital Space in collaboration with the Kuwait Scientific Center\n(TSCK) introduced for the first time in Kuwait the opportunity for students to\nsend a science experiment to space. The objectives of this initiative was to\nallow students to learn about (a) how science space missions are done; (b)\nmicrogravity (weightlessness) environment; (c) how to do science like a real\nscientist. This opportunity was made possible through Orbital Space agreement\nwith DreamUp PBC and Nanoracks LLC, which are collaborating with NASA under a\nSpace Act Agreement. The students' experiment was named \"Kuwait’s Experiment:\nE.coli Consuming Carbon Dioxide to Combat Climate Change\". The experiment was\nlaunched on SpaceX CRS-21 (SpX-21) spaceflight to the International Space\nStation (ISS) on 6 December 2020. Astronauts Shannon Walker (member of the ISS\nExpedition 64) conducted the experiment on behalf of the students.\n\nNational satellite project\n\nIn July 2021, Kuwait University announced that it is launching a national\nsatellite project as part of state-led efforts to pioneer the country's\nsustainable space sector."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Transport",
    "text": "A highway in Kuwait City\n\nKuwait has a modern network of highways. Roadways extended 5,749 km (3,572\nmi), of which 4,887 km (3,037 mi) is paved. There are more than 2 million\npassenger cars, and 500,000 commercial taxis, buses, and trucks in use. On\nmajor highways the maximum speed is 120 km/h (75 mph). Since there is no\nrailway system in the country, most people travel by automobiles.\n\nThe country's public transportation network consists almost entirely of bus\nroutes. The state owned Kuwait Public Transportation Company was established\nin 1962. It runs local bus routes across Kuwait as well as longer distance\nservices to other Gulf states. The main private bus company is CityBus, which\noperates about 20 routes across the country. Another private bus company,\nKuwait Gulf Link Public Transport Services, was started in 2006. It runs local\nbus routes across Kuwait and longer distance services to neighbouring Arab\ncountries.\n\nThere are two airports in Kuwait. Kuwait International Airport serves as the\nprincipal hub for international air travel. State-owned Kuwait Airways is the\nlargest airline in the country. A portion of the airport complex is designated\nas Al Mubarak Air Base, which contains the headquarters of the Kuwait Air\nForce, as well as the Kuwait Air Force Museum. In 2004, the first private\nairline of Kuwait, Jazeera Airways, was launched. In 2005, the second private\nairline, Wataniya Airways was founded.\n\nKuwait has one of the largest shipping industries in the region. The Kuwait\nPorts Public Authority manages and operates ports across Kuwait. The country's\nprincipal commercial seaports are Shuwaikh and Shuaiba which handled combined\ncargo of 753,334 TEU in 2006. Mina Al-Ahmadi, the largest port in the country,\nhandles most of Kuwait's oil exports. Mubarak Al Kabeer Port in Bubiyan Island\nis currently under construction. The port is expected to handle 2 million TEU\nwhen operations start."
  },
  {
    "chapter_name": "Economy of Kuwait",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Macro-economic",
    "text": "The following table shows the main economic indicators in 1995–2024.\n\nYear  | GDP\n(in billion US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in billion US$ nominal)  | GDP per capita\n(in US$ nominal)  | GDP growth\n(real)  | Gov. debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1995  | 64.3  | 35,659  | 27.2  | 15,088  | 1.7%  | 34.9%\n1996  | 65.8  | 34,744  | 31.5  | 16,623  | 0.6%  | 26.5%\n1997  | 68.6  | 34,663  | 30.4  | 15,330  | 2.5%  | 24.3%\n1998  | 71.9  | 35,484  | 25.9  | 12,797  | 3.7%  | 25.6%\n1999  | 71.6  | 33,999  | 30.1  | 14,297  | −1.8%  | 25.5%\n2000  | 76.7  | 35,873  | 37.7  | 17,639  | 4.7%  | 21.4%\n2001  | 78.6  | 36,010  | 34.9  | 15,993  | 0.2%  | 23.0%\n2002  | 82.2  | 36,350  | 38.1  | 16,857  | 3.0%  | 21.3%\n2003  | 98.4  | 42,303  | 47.9  | 20,585  | 17.3%  | 17.2%\n2004  | 111.4  | 46,584  | 59.4  | 24,864  | 10.2%  | 13.9%\n2005  | 127.0  | 56,588  | 80.8  | 35,991  | 10.6%  | 10.2%\n2006  | 140.8  | 60,477  | 101.5  | 43,618  | 7.5%  | 7.8%\n2007  | 153.3  | 63,579  | 114.6  | 47,539  | 6.0%  | 7.0%\n2008  | 160.1  | 57,636  | 147.4  | 53,059  | 2.5%  | 5.4%\n2009  | 149.7  | 53,888  | 106.0  | 38,156  | −7.1%  | 6.7%\n2010  | 147.9  | 50,429  | 115.4  | 39,342  | −2.4%  | 6.2%\n2011  | 165.5  | 50,979  | 154.0  | 47,440  | 9.6%  | 4.6%\n2012  | 179.8  | 52,446  | 174.1  | 50,784  | 6.6%  | 3.6%\n2013  | 184.9  | 51,538  | 174.2  | 48,544  | 1.1%  | 3.1%\n2014  | 189.1  | 50,508  | 162.7  | 43,459  | 0.5%  | 3.4%\n2015  | 192.0  | 48,904  | 114.6  | 29,195  | 0.6%  | 4.6%\n2016  | 199.5  | 48,857  | 109.4  | 26,796  | 2.9%  | 9.9%\n2017  | 193.5  | 45,771  | 120.7  | 28,552  | −4.7%  | 19.6%\n2018  | 222.1  | 50,248  | 138.7  | 31,369  | 2.7%  | 14.3%\n2019  | 225.2  | 50,451  | 140.9  | 31,550  | 2.3%  | 10.5%\n2020  | 182.4  | 42,076  | 111.0  | 25,611  | −4.8%  | 10.2\n2021  | 221.0  | 52,420  | 148.5  | 35,205  | 2.3%  | 7.2%\n2022  | 250.7  | 52,296  | 184.0  | 38,380  | 5.9%  | 2.9%\n2023  | 250.2  | 50,933  | 163.7  | 33,321  | −3.6%  | 3.2%\n2024  | 249.3  | 49,736  | 161.8  | 32,290  | −2.7%  | 7.2%\n\nIn 2019, Kuwait's main export products were mineral fuels including oil (89.1%\nof total exports), aircraft and spacecraft (4.3%), organic chemicals (3.2%),\nplastics (1.2%), iron and steel (0.2%), gems and precious metals (0.1%),\nmachinery including computers (0.1%), aluminum (0.1%), copper (0.1%), and\nsalt, sulphur, stone and cement (0.1%). Kuwait was the world's biggest\nexporter of sulfonated, nitrated and nitrosated hydrocarbons in 2019. Kuwait\nwas ranked 63rd out of 157 countries in the 2019 Economic Complexity Index\n(ECI). Iraq was Kuwait's leading export market in 2019 and food/agricultural\nproducts accounted for 94.2% of total export commodities.\n\nAccording to data from the Civil Service Commission (CSC), the level of\njoblessness amongst the Kuwaiti population continues to rise annually as of\n2024. This is predominately due to a surplus of graduates in fields that lack\ndemand within the workforce, as well as a discrepancy between labor market\nrequirements and the skills obtained through certain specializations.\nAdditional issues contributing to the unemployment rate include a lack of\nemphasis on the private sector and insufficient coordination among related\nauthorities. Until substantial changes are made regarding the quality of\neducational outputs, the number of graduates in less required fields is likely\nto keep rising, further exacerbating unemployment issues. Statistics from the\nCentral Statistics Bureau as of November 19, 2023 indicate that there are\n8,727 unemployed Kuwaitis, including 4,177 males (approximately 48 percent)\nand 4,550 females (approximately 52 percent).\n\nAccording to recent statistics released by the Central Statistics Bureau, the\npopulation of Kuwait rose to 4.91 million on January 1, 2024 — an increase of\n119,700 from 2024's 4.79 million population. The number of Kuwaiti citizens\nincreased by 28,700, totaling 1.545 million, an increase from the 1.517\nmillion figure from the start of 2023. Notably, the number of male citizens\nreached 758,700 and female citizens rose to 787,000 in January 2024.\nAdditionally, the expatriate population witnessed a rise by 90,990, reaching\n3.36 million, among which the male expatriates accounted for 2.26 million and\nfemale expatriates stood at 1.1 million in the same period."
  }
]