[
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of North Korea** is a centrally planned economy, following\n_Juche_ , where the role of market allocation schemes is limited, although\nincreased to an extent. As of 2024[update], North Korea continues its basic\nadherence to a centralized planned economy. With a total gross domestic\nproduct of $28.500 billion as of 2016, there has been some economic\nliberalization, particularly after Kim Jong Un assumed the leadership in 2012,\nbut reports conflict over particular legislation and enactment. Since the\n1990s, informal market activity has increased, which the government has\ntolerated. These markets are referred to as 'Jangmadang', and were formed as a\nresult of the economic collapse during the 1990s, which made the regime unable\nto distribute food to its people.\n\nAfter the start of the COVID-19 pandemic, the government tightened border\ncontrol and began major crackdowns on private economic activities with a shift\nto a state-run monopoly on food sales, followed by greater centralization of\nforeign trade, and overall control over the economy.\n\nThe collapse of the Eastern Bloc from 1989 to 1992, particularly North Korea's\nprincipal source of support, the Soviet Union, forced the North Korean economy\nto realign its foreign economic relations, including increased economic\nexchanges with South Korea. China is North Korea's largest trading partner.\nNorth Korea's ideology of _Juche_ has resulted in the country pursuing autarky\nin an environment of international sanctions. While the current North Korean\neconomy is still dominated by state-owned industry and collective farms,\nforeign investment and corporate autonomy have increased.\n\nNorth Korea had a similar GDP per capita to its neighbor South Korea from the\naftermath of the Korean War until the mid-1970s, but had a GDP per capita of\nless than $2,000 in the late 1990s and early 21st century. For the first time,\nin 2021, the South Korean Ministry of Unification estimated that the North\nKorean private sector outgrew the public sector until 2020. However, the 8th\nCongress of the Workers' Party of Korea introduced new policies in 2021 which\naim to strengthen the old command economy; it has been gradually implementing\nthese policies forcing markets and private economic activities to\nsignificantly shrink.",
    "openai_summarised_points": [
      "• The economy of North Korea is a centrally planned system based on the ideology of _Juche_, where market allocation mechanisms play a limited but somewhat increasing role as of 2024.",
      "• North Korea maintains a fundamental adherence to a centralized planned economy despite some economic liberalization efforts, particularly following Kim Jong Un's rise to leadership in 2012.",
      "• The total gross domestic product (GDP) of North Korea was approximately $28.5 billion in 2016.",
      "• Since the 1990s, informal market activities known as 'Jangmadang' have expanded; these markets emerged due to the economic collapse in the 1990s which incapacitated the regime's ability to distribute food to its population.",
      "• The North Korean government has tolerated these informal markets despite their unofficial status.",
      "• Following the onset of the COVID-19 pandemic, the North Korean government intensified border controls and initiated major crackdowns on private economic activities, shifting towards a state-run monopoly on food sales.",
      "• Post-pandemic measures also included greater centralization of foreign trade and enhanced overall economic control by the state.",
      "• The collapse of the Eastern Bloc between 1989 and 1992, especially the dissolution of the Soviet Union—North Korea's principal economic supporter—forced North Korea to realign its foreign economic relations, including increasing economic exchanges with South Korea.",
      "• China remains North Korea's largest trading partner.",
      "• The _Juche_ ideology has driven North Korea to pursue autarky (economic self-sufficiency) despite facing international sanctions.",
      "• The North Korean economy continues to be dominated by state-owned industries and collective farms, though there has been an increase in foreign investment and corporate autonomy.",
      "• Historically, North Korea's GDP per capita was comparable to South Korea's from the aftermath of the Korean War until the mid-1970s.",
      "• By the late 1990s and early 21st century, North Korea's GDP per capita had fallen to less than $2,000.",
      "• In 2021, the South Korean Ministry of Unification estimated that the North Korean private sector had outgrown the public sector for the first time, up to 2020.",
      "• However, the 8th Congress of the Workers' Party of Korea in 2021 introduced policies aimed at reinforcing the traditional command economy.",
      "• These new policies have been gradually implemented, resulting in a significant contraction of markets and private economic activities in North Korea."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:18:32.079287",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2289,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Size of the North Korean economy",
    "text": "Estimating gross national product in North Korea is a difficult task because\nof a lack of economic data and the problem of choosing an appropriate rate of\nexchange for the North Korean won, the nonconvertible North Korean currency.\nThe South Korean government's estimate placed North Korea's GNP in 1991 at\nUS$22.9 billion, or US$1,038 per capita. In contrast, South Korea posted\nUS$237.9 billion of GNP and a per capita income of US$5,569 in 1991. North\nKorea's GNP in 1991 showed a 5.2% decline from 1989, and preliminary\nindications were that the decline would continue. South Korea's GNP, by\ncontrast, expanded by 9.3% and 8.4%, respectively, in 1990 and 1991.\n\nIt is estimated that North Korea's GNP nearly halved between 1990 and 1999.\nNorth Korean annual budget reports suggest state income roughly tripled\nbetween 2000 and 2014. By about 2010, external trade had returned to 1990\nlevels.\n\nThe South Korea-based Bank of Korea estimated that over 2000 to 2013 average\ngrowth was 1.4% per year. It has published the following estimates of North\nKorea's GDP growth:\n\nEconomy statistics by year (Bank of Korea estimate)  Year  | GDP (in Bil. KR₩ nominal) | GNI per capita (in KR₩ nominal) | GDP growth (real) | Ref.\n---|---|---|---|---\n1990  |  |  | -4.3%  |\n1995  |  |  | -4.4%  |\n1999  |  |  | 6.1%  |\n2000  |  |  | 0.4%  |\n2001  |  |  | 3.8%  |\n2002  |  |  | 1.2%  |\n2003  |  |  | 1.8%  |\n2004  |  |  | 2.1%  |\n2005  |  |  | 3.8%  |\n2006  |  | 1,058,000  | -1.0%  |\n2007  |  | 1,070,000  | -1.2%  |\n2008  |  | 1,174,000  | 3.1%  |\n2009  | 28,483.5  | 1,190,000  | -0.9%  |\n2010  | 29,879.9  | 1,242,000  | -0.5%  |\n2011  | 32,227.8  | 1,334,000  | 0.8%  |\n2012  | 33,211.9  | 1,371,000  | 1.3%  |\n2013  | 33,614.2  | 1,379,000  | 1.1%  |\n2014  | 33,949.4  | 1,388,000  | 1.0%  |\n2015  | 34,136.7  | 1,393,000  | -1.1%  |\n2016  | 36,103.3  | 1,461,000  | 3.9%  |\n2017  | 36,381.8  | 1,464,000  | -3.5%  |\n2018  | 35,670.5  | 1,428,000  | -4.1%  |\n2019  | 35,278.6  | 1,408,000  | 0.4%  |\n2020  | 34,660.3  | 1,379,000  | -4.5%  |\n2021  | 35,890.8  | 1,423,000  | -0.1%  |\n2022  | 36,214.2  | 1,430,000  | -0.2%  |\n2023  | 40,194.2  | 1,589,000  | 3.1%  |\n\nThis analysis converts production volume estimates into South Korean prices,\nso is subject to price changes over time of South Korean goods. According to\nanalyst Andrei Lankov, writing in 2017, a significant number of observers\nbelieve that the Bank of Korea is too conservative and the real growth rate is\n3–4%. North Korea reported that the government budget has been increasing at\nbetween 5% and 10% annually from 2007 to 2015. Reported planned capital\nexpenditure, mainly on roads and public buildings, increased by 4.3% in 2014,\n8.7% in 2015 to 13.7% in 2016. According to a North Korean economist, the\ngrowth rate was 3.7% in 2017, lifting GDP to $29.6 billion in 2018. The\nAustralian government estimated 1.3% growth in 2017, while the South Korean\ngovernment estimated −3.5%.\n\nIn 2018, North Korea's government budget revenue plan overfulfilled 1.4%, an\nincrease of 4.6% over 2017 year.",
    "openai_summarised_points": [
      "• Estimating North Korea's gross national product (GNP) is challenging due to a lack of reliable economic data and difficulties in selecting an appropriate exchange rate for the nonconvertible North Korean won.",
      "• The South Korean government estimated North Korea's GNP in 1991 at US$22.9 billion, equating to US$1,038 per capita, while South Korea's GNP that year was US$237.9 billion with a per capita income of US$5,569.",
      "• North Korea's GNP in 1991 declined by 5.2% compared to 1989, with preliminary signs indicating a continuing downward trend; in contrast, South Korea's GNP grew by 9.3% in 1990 and 8.4% in 1991.",
      "• Between 1990 and 1999, North Korea's GNP is estimated to have nearly halved, reflecting severe economic contraction during that decade.",
      "• North Korean annual budget reports indicate that state income approximately tripled between 2000 and 2014, suggesting some economic recovery or increased state revenue during this period.",
      "• By around 2010, North Korea's external trade volume had returned to levels comparable to those in 1990.",
      "• The Bank of Korea, based in South Korea, estimated North Korea's average GDP growth at 1.4% per year from 2000 to 2013, providing detailed annual GDP growth rates and nominal GDP and GNI per capita figures in Korean won (KR₩) for selected years.",
      "• According to Bank of Korea estimates, North Korea experienced negative GDP growth in 1990 (-4.3%) and 1995 (-4.4%), followed by a positive growth rebound in 1999 (6.1%), with fluctuating growth rates through the 2000s and 2010s, including declines in 2006 (-1.0%), 2007 (-1.2%), 2009 (-0.9%), and 2015 (-1.1%).",
      "• Nominal GDP figures in billion KR₩ reported by the Bank of Korea include 28,483.5 in 2009, rising to 40,194.2 in 2023, while GNI per capita increased from approximately 1,058,000 KR₩ in 2006 to 1,589,000 KR₩ in 2023.",
      "• The Bank of Korea's GDP growth estimates show volatility in recent years, with negative growth rates in 2017 (-3.5%), 2018 (-4.1%), 2020 (-4.5%), and slight declines in 2021 (-0.1%) and 2022 (-0.2%), but a rebound to 3.1% growth in 2023.",
      "• The Bank of Korea's analysis converts North Korean production volume estimates into South Korean prices, making the data sensitive to price changes in South Korean goods over time.",
      "• Analyst Andrei Lankov, writing in 2017, noted that many observers consider the Bank of Korea's growth estimates conservative, suggesting the real growth rate may be between 3% and 4%.",
      "• North Korea reported government budget increases ranging from 5% to 10% annually between 2007 and 2015, with planned capital expenditures on infrastructure such as roads and public buildings rising by 4.3% in 2014, 8.7% in 2015, and 13.7% in 2016.",
      "• A North Korean economist estimated a 3.7% economic growth rate in 2017, projecting a GDP of US$29.6 billion in 2018.",
      "• The Australian government estimated North Korea's economic growth at 1.3% in 2017, whereas the South Korean government estimated a contraction of −3.5% for the same year.",
      "• In 2018, North Korea's government budget revenue plan was exceeded by 1.4%, representing a 4.6% increase over the 2017 budget revenue."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:18:53.909203",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3055,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic freedom",
    "text": "In 2024, North Korea's \"economic freedom\" score from the free-market oriented\nHeritage Foundation was 2.9, making its economy the world’s least free. The\ncountry’s economic freedom score is lower than the world and regional\naverages. North Korea’s economy is considered “repressed” according to the\n2024 Index.",
    "openai_summarised_points": [
      "• In 2024, North Korea received an economic freedom score of 2.9 from the Heritage Foundation, a free-market oriented organization.",
      "• This score positioned North Korea as having the world’s least free economy in terms of economic freedom.",
      "• North Korea’s economic freedom score of 2.9 is significantly lower than both the global average and the regional average scores.",
      "• According to the 2024 Index of Economic Freedom published by the Heritage Foundation, North Korea’s economy is classified as “repressed.”"
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:18:58.312064",
      "openai_model": "gpt-4.1-mini",
      "content_length": 310,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Colonial period and post Second World War",
    "text": "Japan colonized Korea, officially annexing it on 22 August 1910 as the\nProvince of Choson. Japan encouraged an inflow of Japanese capital to Korea's\nless developed economy. A large majority of major firms in Korea became\nJapanese owned and operated as a result, with key positions reserved for\nJapanese. Koreans were permitted to work in menial roles under harsh labor\nconditions. Most of Korea's coal, iron, and crop production was shipped to\nJapan.\n\nBeginning in the mid-1920s, the Japanese colonial administration in Korea\nconcentrated its industrial-development efforts in the comparatively under-\npopulated and resource-rich northern portion of the country, resulting in a\nconsiderable movement of people northward from the agrarian southern provinces\nof the Korean Peninsula.\n\nThis trend did not reverse until after the end in 1945 of the Second World\nWar, when more than 2 million Koreans moved from North to South following the\ndivision of Korea into Soviet and American military zones of administration.\nThis southward exodus continued after the establishment of the Democratic\nPeople's Republic of Korea (North Korea) in 1948 and during the 1950–53 Korean\nWar.\n\nThe post-World War II division of the Korean Peninsula resulted in imbalances\nof natural and human resources, with disadvantages for both the North and the\nSouth. In 1945, about 80% of Korean heavy industry was in the North but only\n31% of light industry, 37% of agriculture, and 18% of the peninsula's total\ncommerce.\n\nNorth and South Korea both suffered from the massive destruction caused during\nthe Korean War. Historian Charles K. Armstrong stated that \"North Korea had\nbeen virtually destroyed as an industrial society\". In the years immediately\nafter the war, North Korea mobilized its labour force and natural resources in\nan effort to achieve rapid economic development. Large amounts of aid from\nother communist countries, notably the Soviet Union and the People's Republic\nof China, helped the country achieve a high growth-rate in the immediate\npostwar period.",
    "openai_summarised_points": [
      "• Japan officially annexed Korea on 22 August 1910, designating it as the Province of Choson during its colonial rule.",
      "• The Japanese colonial administration encouraged significant inflows of Japanese capital into Korea’s underdeveloped economy, resulting in most major Korean firms becoming Japanese-owned and operated.",
      "• Key managerial and executive positions in Korean firms were reserved exclusively for Japanese personnel, while Koreans were relegated to menial labor roles under harsh working conditions.",
      "• The majority of Korea’s coal, iron, and agricultural production during the colonial period was exported to Japan to support its industrial needs.",
      "• From the mid-1920s, Japanese colonial authorities focused industrial development efforts on the northern part of Korea, which was less populated but rich in natural resources, prompting significant migration from the agrarian southern provinces to the north.",
      "• This northward migration trend reversed after the end of the Second World War in 1945, when over 2 million Koreans moved from North to South Korea following the division of the peninsula into Soviet and American military administrative zones.",
      "• The southward migration continued after the establishment of the Democratic People’s Republic of Korea (North Korea) in 1948 and persisted throughout the Korean War from 1950 to 1953.",
      "• The post-World War II division of Korea created significant imbalances in natural and human resources between North and South Korea, disadvantaging both regions economically.",
      "• In 1945, approximately 80% of Korea’s heavy industry was located in the North, whereas the North only accounted for 31% of light industry, 37% of agricultural production, and 18% of the peninsula’s total commerce.",
      "• Both North and South Korea experienced extensive destruction during the Korean War, severely damaging infrastructure and industrial capacity.",
      "• Historian Charles K. Armstrong noted that North Korea was “virtually destroyed as an industrial society” by the war’s end.",
      "• In the immediate postwar years, North Korea mobilized its labor force and natural resources aggressively to pursue rapid economic development and reconstruction.",
      "• Substantial economic and material aid from communist allies, particularly the Soviet Union and the People’s Republic of China, played a crucial role in supporting North Korea’s high growth rates during the early postwar period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:19:07.732260",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2044,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Early efforts at modernization",
    "text": "Exhibition of North Korean industrial goods\n\nIn 1961, an ambitious seven-year plan was launched to continue industrial\nexpansion and increase living standards, but within three years it became\nclear this was failing and the plan period was extended to 1970. The failure\nwas due to reduced support from the Soviet Union when North Korea aligned more\nwith China, and military pressure from the U.S. leading to increased defense\nspending. In 1965, South Korea's rate of economic growth first exceeded North\nKorea's in most industrial areas, though South Korea's per capita GNP remained\nlower than North Korea's.\n\nIn 1979, North Korea renegotiated much of its international debt, but in 1980\nit defaulted on its loans except those from Japan. By the end of 1986, hard-\ncurrency debt had reached more than US$1 billion. It also owed nearly $2\nbillion to communist creditors, principally the Soviet Union. The Japanese\ndeclared North Korea in default. By 2000, taking into account penalties and\naccrued interest, North Korea's debt was estimated at $10–12 billion. By 2012,\nNorth Korea's external debt had grown to an estimated US$20 billion despite\nRussia reportedly writing off about $8 billion of debt in exchange for\nparticipation in natural resources development. Besides Russia, major\ncreditors included Hungary, the Czech Republic and Iran.\n\nLargely because of these debt problems and because of a prolonged drought and\nmismanagement, North Korea's industrial growth slowed, and per capita GNP fell\nbelow that of the South. By the end of 1979 per capita GNP in North Korea was\nabout one-third of that in the South.\n\nThere were minor efforts toward relaxing central control of the economy in the\n1980s that involve industrial enterprises. Encouraged by Kim Jong Il's call to\nstrengthen the implementation of the independent accounting system (독립채산제,\n_tongnip ch'aesanje_) of enterprises in March 1984, interest in enterprise\nmanagement and the independent accounting system increased, as evidenced by\nincreasing coverage of the topic in North Korean journals. Under the system,\nfactory managers still are assigned output targets but are given more\ndiscretion in decisions about labour, equipment, materials, and funds.\n\nIn addition to fixed capital, each enterprise is allocated a minimum of\nworking capital from the state through the Central Bank and is required to\nmeet operating expenses with the proceeds from sales of its output. Up to 50%\nof the \"profit\" is taxed, the remaining half being kept by the enterprise for\npurchase of equipment, introduction of new technology, welfare benefits, and\nbonuses. As such, the system provides some built-in incentives and a degree of\nmicro-level autonomy, unlike the budget allocation system, under which any\nsurplus is turned over to the government in its entirety.\n\nAnother innovation, the August Third People's Consumer Goods Production\nMovement, is centred on consumer goods production. This measure was so named\nafter Kim Jong Il made an inspection tour of an exhibition of light industrial\nproducts held in Pyongyang on August 3, 1984. The movement charges workers to\nuse locally available resources and production facilities to produce needed\nconsumer goods. On the surface, the movement does not appear to differ much\nfrom the local industry programs in existence since the 1960s, although some\ndegree of local autonomy is allowed. However, a major departure places output,\npricing, and purchases outside central planning. In addition, direct sales\nstores were established to distribute goods produced under the movement\ndirectly to consumers. The movement is characterized as a third sector in the\nproduction of consumer goods, alongside centrally controlled light industry\nand locally controlled traditional light industry. Moreover, there were some\nreports in the mid-1980s of increasing encouragement of small-scale private\nhandicrafts and farm markets. As of 1992[update], however, no move was\nreported to expand the size of private garden plots.\n\nAll these measures appear to be minor stop-gap measures to alleviate severe\nshortages of consumer goods by infusing some degree of incentives. In\nmid-1993, no significant moves signalling a fundamental deviation from the\nexisting system had occurred. The reluctance to initiate reform appears to be\nlargely political. This concern is based on the belief that economic reform\nwill produce new interests that will demand political expression and that\ndemands for the institutionalization of such pluralism eventually will lead to\npolitical liberalization.\n\nBeginning in the mid-1980s and particularly around the end of the decade,\nNorth Korea slowly began to modify its rigid self-reliant policy. The changes,\npopularly identified as the open-door policy, included an increasing emphasis\non foreign trade, a readiness to accept direct foreign investment by enacting\na joint venture law, the decision to open the country to international\ntourism, and economic cooperation with South Korea.\n\nThe main targets of the Third Seven-Year Plan of 1987–1993 were to achieve the\n\"Ten Long-Range Major Goals of the 1980s for the Construction of the Socialist\nEconomy\". These goals, conceived in 1980, were to be fulfilled by the end of\nthe decade. The fact that these targets were rolled over to the end of the\nThird Seven-Year Plan is another indication of the disappointing economic\nperformance during the Second Seven-Year Plan. The three policy goals of self-\nreliance, modernization, and scientification were repeated. Economic growth\nwas set at 7.9% annually, lower than the previous plan. Although achieving the\nten major goals of the 1980s was the main thrust of the Third Seven-Year Plan,\nsome substantial changes have been made in specific quantitative targets. For\nexample, the target for the annual output of steel was reduced by a third:\nfrom 15 million tons to 10 million tons. The output targets of cement and non-\nferrous metals—two major export items—have been increased significantly. The\nJune 1989 introduction of the Three-Year Plan for Light Industry as part of\nthe Third Seven-Year Plan is intended to boost the standard of living by\naddressing consumer needs.\n\nThe Third Seven-Year Plan gave a great deal of attention to developing foreign\ntrade and joint ventures, the first time a plan has addressed these issues.\nThe diversion of resources to build highways, theatres, hotels, airports, and\nother facilities to host the Thirteenth World Festival of Youth and Students\nin July 1989 must have had a negative impact on industrial and agricultural\ndevelopment, although the expansion and improvement of social infrastructure\nhave resulted in some long-term economic benefits."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.2.1",
    "section_name": "State Planning Commission",
    "text": "Although general economic policy objectives are decided by the Central\nPeople's Committee (CPC), it is the task of the State Planning Committee to\ntranslate the broad goals into specific annual and long-term development plans\nand quantitative targets for the economy as a whole, as well as for each\nindustrial sector and enterprise. Under the basic tenets of the 1964 reforms,\nthe planning process is guided by the principles of \"unified planning\" (일원화,\n_ilwŏnhwa_) and of \"detailed planning\" (새분화, _saebunhwa_).\n\nUnder \"unified planning\", regional committees are established in each\nprovince, city, and county to systematically coordinate planning work. These\ncommittees do not belong to any regional organization and are directly\nsupervised by the State Planning Committee. As a result of a reorganization in\n1969, they are separated into provincial planning committees, city/county\ncommittees, and enterprise committees (for large-scale enterprises).\n\nThe planning committees, under the auspices of the State Planning Committee,\ncoordinate their work with the planning offices of the economy-related\ngovernment organizations the corresponding regional and local areas. The\nsystem attempts to enable the regional planning staff to better coordinate\nwith economic establishments in their areas, which are directly responsible to\nthem in planning, as well as communicating directly with staff at the CPC.\n\"Detailed planning\" seeks to construct plans with precision and scientific\nmethods based on concrete assessment of the resources, labour, funds, plant\ncapacities, and other necessary information.\n\nSimplified diagram showing the process of economic policy planning.\n\nThere are four stages in drafting the final national economic plan.\n\n* The first is collecting and compiling preliminary statistical data. These figures, which are used as the basic planning data on the productive capacities of economic sectors, originally are prepared by lower-level economic units and aggregated on a national level by respective departments and committees. Simultaneously, the regional, local, and enterprise planning committees prepare their own data and forward them to the CPC. Through this two-channel system of simultaneous, separate, and independent preparation of statistical data by economic units and planning committees, the government seeks to ensure an accurate, objective, and realistic data base unfettered by local and bureaucratic bias.\n* The second stage is preparing the control figures by the CPC based on the preliminary data in accordance with the basic plan goals presented by the Central People's Committee.\n* In the third stage, a draft plan is prepared. The draft plan, prepared by the CPC, is the result of coordinating all draft figures submitted by the lower-level economic units, which, in turn, base their drafts on the control figures handed down from the committee.\n* In the fourth stage, the CPC submits a unified national draft plan to the Central People's Committee and the State Administration Council for confirmation. After approval by the Supreme People's Assembly, the draft becomes final and is distributed to all economic units and regional and local planning committees.\n\nThe plan then becomes legal and compulsory. Frequent directives from the\ncentral government contain changes in the plan targets or incentives for\nmeeting the plan objectives.\n\nAlthough the central government is most clearly involved in the formulation\nand evaluation of the yearly and long-term plans, it also reviews summaries of\nquarterly or monthly progress. Individual enterprises divide the production\ntime into daily, weekly, ten-day, monthly, quarterly, and annual periods. In\ngeneral, the monthly plan is the basic factory planning period.\n\nThe success of an economic plan depends on the quality and detail of\ninformation received, the establishment of realistic targets, coordination\namong sectors, and correct implementation. High initial growth during the\nThree-Year Plan and, to a lesser extent, during the Five-Year Plan contributed\nto a false sense of confidence among the planners. Statistical over\nreporting—an inherent tendency in an economy where rewards lie in fulfilling\nthe quantitative targets, particularly when the plan target year\napproaches—leads to overestimation of economic potential, poor product\nquality, and eventually to plan errors. Inefficient use of plants, equipment,\nand raw materials add to planning errors. Lack of coordination in planning and\nproduction competition among sectors and regions cause imbalances and disrupt\ninput-output relationships. The planning reforms in 1964 were supposed to\nsolve these problems, but the need for correct and detailed planning and\nstrict implementation of plans was so great that their importance was\nemphasized in the report unveiling the Second Seven-Year Plan, indicating that\nplanning problems persisted in the 1980s.\n\nIn the mid-1990s, North Korea abandoned firm directive planning, and multi-\nyear plans became more of a long-term economic strategy."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.2.2",
    "section_name": "Ch'ŏngsan-ni Method",
    "text": "The _Ch'ŏngsan-ni Method_ (청산리방법) of management was born out of Kim Il Sung's\nFebruary 1960 visit to the Ch'ŏngsan-ni Cooperative Farm in South P'yŏngan\nProvince. Influenced by Mao Zedong's Great Leap Forward Policy, Kim and other\nmembers of the KWP Central Committee offered \"on-the-spot guidance\" (현지지도,\n_hyŏnji chido_) and spent two months instructing and interacting with the\nworkers. The avowed objective of this new method is to combat \"bureaucratism\"\nand \"formalism\" in the farm management system.\n\nThe leadership claimed that farm workers were unhappy and produced low output\nbecause low-ranking functionaries of the Workers' Party of Korea (who\nexpounded abstract Marxist theories and slogans) were using tactics that\nfailed to motivate. To correct this, the leadership recommended that the\nworkers receive specific guidance in solving production problems and be\npromised readily available material incentives. The Ch'ŏngsan-ni Method called\nfor high-ranking party officials, party cadres, and administrative officials\nto emulate Kim Il Sung by making field inspections. The system provided\nopportunities for farmers to present their grievances and ideas to leading\ncadres and managers.\n\nPerhaps more important than involving administrative personnel in on-site\ninspections was the increased use of material incentives, such as paid\nvacations, special bonuses, honorific titles, and monetary rewards. In fact,\nthe Ch'ŏngsan-ni Method appeared to accommodate almost any expedient to spur\nproduction. The method, subsequently, was undercut by heavy-handed efforts to\nincrease farm production and amalgamate farms into ever-larger units. Actual\nimprovement in the agricultural sector began with the adoption of the subteam\ncontract system as a means of increasing peasant productivity by adjusting\nindividual incentives to those of the immediate, small working group. Thus the\nincreasing scale of collective farms was somewhat offset by the reduction in\nthe size of the working unit. \"On-the-spot guidance\" by high government\nfunctionaries, however, continued in the early 1990s, as exemplified by Kim Il\nSung's visits to such places as the Wangjaesan Cooperative Farm in Onsŏng\nCounty and the Kyŏngsŏn Branch Experimental Farm of the Academy of\nAgricultural Sciences between August 20 and 30, 1991. Kim Jong Il carried on\nthe tradition, despite having refused to do so before, and even expanded it to\nthe Korean People's Army. Today, Kim Jong Un continues the practices of the\nmethod."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.2.3",
    "section_name": "Taean work system",
    "text": "The industrial management system developed in three distinct stages. The first\nwas a period of enterprise autonomy that lasted until December 1946. The\nsecond stage was a transitional system based on local autonomy, with each\nenterprise managed by the enterprise management committee under the direction\nof the local people's committee. This system was replaced by the \"one-man\nmanagement system\" (지배인 단독 책임제), with management patterned along Soviet lines\nas large enterprises were nationalized and came under central control. The\nthird stage, the _Taean_ Work System (대안의 사업체계, _Taeanŭi saŏpch'e_), was\nintroduced in December 1961 as an application and refinement of agricultural\nmanagement techniques to industry. The Taean industrial management system grew\nout of the _Ch'ŏngsan-ni_ Method.\n\nThe highest managerial authority under the Taean system is the party\ncommittee. Each committee has approximately 25 to 35 members elected from the\nranks of managers, workers, engineers, and the leadership of \"working people's\norganizations\" at the factory. A smaller \"executive committee\", about one-\nquarter the size of the regular committee, has practical responsibility for\nday-to-day plant operations and major factory decisions. The most important\nstaff members, including the party committee secretary, factory manager, and\nchief engineer, make up its membership. The system focuses on co-operation\namong workers, technicians, and party functionaries at the factory level.\n\nEach factory has two major lines of administration, one headed by the manager,\nthe other by the party committee secretary. A chief engineer and his or her\nassistants direct a general staff in charge of all aspects of production,\nplanning, and technical guidance. Depending on the size of the factory,\nvarying numbers of deputies oversee factory logistics, marketing, and workers'\nservices. The supply of materials includes securing, storing, and distributing\nall materials for factory use, as well as storing finished products and\nshipping them from the factory.\n\nDeputies are assigned workers to their units and handle factory accounts and\npayroll. Providing workers' services requires directing any farming done on\nfactory lands, stocking factory retail shops, and taking care of all staff\namenities. Deputies in charge of workers' services are encouraged to meet as\nmany of the factory's needs as possible using nearby agricultural cooperatives\nand local industries.\n\nThe secretary of the party committee organizes all political activities in\neach of the factory party cells and attempts to ensure loyalty to the party's\nproduction targets and management goals. According to official claims, all\nmanagement decisions are arrived at by consensus among the members of the\nparty committee. Given the overwhelming importance of the party in the\ncountry's affairs, it seems likely that the party secretary has the last say\nin any major factory disputes.\n\nThe Taean system heralded a more rational approach to industrial management\nthan that practised previously. Although party functionaries and workers\nbecame more important to management under the new system, engineers and\ntechnical staff received more responsibility in areas where their expertise\ncould contribute the most. The system recognizes the importance of material as\nwell as \"politico-moral\" incentives for managing the factory workers. The\n\"internal accounting system\", a spin-off of the \"independent accounting\nsystem\", grants bonuses to work teams and workshops that use raw materials and\nequipment most efficiently. These financial rewards come out of enterprise\nprofits.\n\nA measure of the success of the Taean work system is its longevity and its\ncontinued endorsement by the leadership. In his 1991 New Year's address\nmarking the 13th anniversary of the creation of the system, Kim Il Sung said\nthat the\n\n> Taean work system is the best system of economic management. It enables the\n> producer masses to fulfill their responsibility and role as masters and to\n> manage the economy in a scientific and rational manner by implementing the\n> mass line in economic management, and by combining party leadership\n> organically with administrative, economic, and technical guidance."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.2.4",
    "section_name": "Mass production campaigns",
    "text": "Parallel to management techniques such as the Ch'ŏngsan-ni Method and the\nTaean work system, which were designed to increase output in more normalized\nand regularized operations of farms and enterprises, the leadership\ncontinuously resorts to exhortations and mass campaigns to motivate the\nworkers to meet output targets. The earliest and the most pervasive mass\nproduction campaign was the Ch'ŏllima Movement. Introduced in 1958 and\nfashioned after China's Great Leap Forward (1958–1960), the Ch'ŏllima Movement\norganized the labour force into work teams and brigades to compete at\nincreasing production. The campaign was aimed at industrial and agricultural\nworkers and at organizations in education, science, sanitation and health, and\nculture.\n\nIn addition to work teams, units eligible for Ch'ŏllima citations included\nentire factories, factory workshops, and such self-contained units as a ship\nor a railroad station. The \"socialist emulation\" among the industrial sectors,\nenterprises, farms, and work teams under the Ch'ŏllima Movement frantically\nsought to complete the First Five-Year Plan (1957–1960) but instead created\nchaotic disruptions in the economy. This made it necessary to set aside 1959\nas a \"buffer year\" to restore balance in the economy.\n\nAlthough the Ch'ŏllima Movement was replaced in the early 1960s by the\nCh'ŏngsan-ni Method and the Taean Work System, the regime's reliance on mass\ncampaigns continued into the early 1990s. Campaigns conducted after the\nCh'ŏllima to speed battles toward the end of a period (such as a month, a\nyear, or an economic plan) to reach production targets to carry out the\neconomic goals of the decade."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Efforts at modernization since 1991",
    "text": "Following the collapse of the Soviet Union in 1991, the principal source of\nexternal support, North Korea announced in December 1993 a three-year\ntransitional economic policy placing primary emphasis on agriculture, light\nindustry, and foreign trade. However, lack of fertilizer, natural disasters,\nand poor storage and transportation practices caused the country to fall more\nthan a million tons per year short of grain self-sufficiency. Moreover, lack\nof foreign exchange to purchase spare parts and oil for electricity generation\nleft many factories idle.\n\nThe shortage of foreign exchange because of a chronic trade deficit, a large\nforeign debt, and dwindling foreign aid has constrained economic development.\nIn addition, North Korea has been diverting scarce resources from\ndevelopmental projects to defence; it spent more than 20% of GNP on defence\ntoward the end of the 1980s, a proportion among the highest in the world.\nThese negative factors, compounded by the declining efficiency of the central\nplanning system and the failure to modernize the economy, have slowed the pace\nof growth since the 1960s. The demise of the socialist republics in the Soviet\nUnion and East European countries—North Korea's traditional trade partners and\nbenefactors—has compounded the economic difficulties in the early 1990s.\n\nEconomically, the collapse of the Soviet Union and the end of Soviet support\nto North Korean industries caused a contraction of the North Korea's economy\nby 25% during the 1990s. While, by some accounts, North Korea had a higher per\ncapita income than South Korea in the 1970s, by 2006 its per capita income was\nestimated to be only $1108, one seventeenth that of South Korea.\n\nExperimentation in small scale entrepreneurship took place from 2009 to 2013,\nand although there continue to be legal uncertainties this has developed into\na significant sector. By 2016 economic liberalisation had progressed to the\nextent that both locally-responsible and state industrial enterprises gave the\nstate 20% to 50% of their output, selling the remainder to buy raw materials\nat market-based prices akin to a free market.\n\nIn 2014, the Enterprise Act was amended to allow state-owned enterprise\nmanagers to engage in foreign trade and joint ventures, and to accept\ninvestment from non-government domestic sources. Under the new rules the\nenterprise director became more like the western chief executive officer, and\nthe chief engineer had an operational role more like a western chief operating\nofficer. As of 2017 it was unclear if the Taean Work System (described above)\nstill in practice operated to give local people's committees much influence.\n\nIn 2017, Dr. Mitsuhiro Mimura, Senior Research Fellow at Japan's Economic\nResearch Institute for Northeast Asia, who has visited North Korea 45 times,\ndescribed it as the \"poorest advanced economy in the world\", in that while\nhaving comparatively low GDP, it had built a sophisticated production\nenvironment. He described the recent rise of entrepreneurial groups through\n\"socialist cooperation\", where groups of individuals could start small\nenterprises as cooperative groups. Managers in state-owned industries or farms\nwere also free to sell or trade production beyond state plan targets,\nproviding incentives to increase production. Managers could also find\ninvestment for expansion of successful operations, in a process he called\n\"socialist competition\". A state plan was still the basis for production, but\nwas more realistic leaving room for excess production.\n\nIn 2020 North Korea halted its economic reforms that were seen as a risky\ngambit to unleash market forces, and the government shifted back its focus\ntowards more central planning and state control over the economy."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Budget and finance",
    "text": "Comparison of the GDP per capita trends of two Koreas from 1950 to 1977 (in\n1990 international dollars) Historical GDP per capita estimates of North Korea\n\nThe state budget is a major government instrument in carrying out the\ncountry's economic goals. Expenditures represented about three-quarters of GNP\nin the mid-1980s, the allocation of which reflected the priorities assigned to\ndifferent economic sectors. Taxes were abolished in 1974 as \"remnants of an\nantiquated society\". This action, however, was not expected to have any\nsignificant effect on state revenue because the overwhelming proportion of\ngovernment funds—an average of 98.1% during 1961–1970—was from turnover\n(sales) taxes, deductions from profits paid by state enterprises, and various\nuser fees on machinery and equipment, irrigation facilities, television sets,\nand water.\n\nIn order to provide a certain degree of local autonomy as well as to lessen\nthe financial burden of the central government, a \"local budget system\" was\nintroduced in 1973. Under this system, provincial authorities are responsible\nfor the operating costs of institutions and enterprises not under direct\ncentral government control, such as schools, hospitals, shops, and local\nconsumer goods production. In return, they are expected to organize as many\nprofitable ventures as possible and to turn over profits to the central\ngovernment.\n\nAround December of every year, the state budget for the following calendar\nyear is drafted, subject to revision around March. Typically, total revenue\nexceeds expenditure by a small margin, with the surplus carried over to the\nfollowing year. The largest share of state expenditures goes to the \"people's\neconomy\", which averaged 67.3% of total expenditures between 1987 and 1990,\nfollowed in magnitude by \"socio-cultural\", \"defense\", and \"administration\".\n\nDefense spending, as a share of total expenditures, has increased\nsignificantly since the 1960s: from 3.7% in 1959 to 19% in 1960, and, after\naveraging 19.8% between 1961 and 1966, to 30.4% in 1967. After remaining\naround 30% until 1971, the defense share decreased abruptly to 17% in 1972,\nand continued to decline throughout the 1980s. Officially, in both 1989 and\n1990 the defense share remained at 12%, and for 1991 it was 12.3% with 11.6%\nplanned for 1992. The declining trend was consistent with the government's\nannounced intentions to stimulate economic development and increase the social\nbenefits. However, Western experts have estimated that actual military\nexpenditures are higher than budget figures indicate.\n\nIn the 1999 budget, expenditures for the farming and power sectors were\nincreased by 15% and 11%, respectively, compared with those of 1998.\n\nIn the 2007 budget, it was estimated an increase in revenue at 433.2bn won\n($3.072bn, $1 = 141 won). In 2006, 5.9% were considered the public revenue,\nwhereas this year, this figure was raised to 7.1%.\n\nNorth Korea claims that it is the only state in the world that does not levy\ntaxes. Taxes were abolished beginning on April 1, 1974."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Bonds",
    "text": "Since 2003, North Korean authorities issue government bonds called The\n\"People's Life Bonds\", and promoted the slogan \"Buying bonds is patriotic\".\n\nNorth Korea sold bonds internationally in the late 1970s for 680 million\nDeutsche marks and 455 million Swiss francs. North Korea defaulted on these\nbonds by 1984, although the bonds remain traded internationally on speculation\nthat the country would eventually perform on the obligations."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "The latest trends",
    "text": "_The Sydney Morning Herald_ reported that Kim's previous propaganda has\nshifted focus toward patriotism and the economy, and improving its\nrelationships with China, South Korea, and the United States. The state-run\ntelevision promoted a song of praise to the National flag by airing videos\nwith images that included the flag being raised September 2018, during mass\ngames events, marking North Korea's 70th anniversary. In the video, brief\nimages of troops, fighter jets releasing blue, red, and white smoke, scattered\npictures of civilians, new high-rise apartments in the capital, fireworks\ndisplays, and even students in their school uniforms can all be seen at the\nsame event.\n\nThe _South China Morning Post_ , in a 2019 article, stated that already there\nis also some economical and cultural revolution happening recently within\nNorth Korea itself. It started in earnest in February 2018, during the\nPyeongchang Winter Olympic Games, when top musicians from North Korea were\nsent to perform in South Korea. This included a female quintet who performed\nin black shorts and red tops. After two months, Supreme Leader Kim Jong Un saw\nthe performance of South Korean girl group, Red Velvet. This is the first ever\nK-pop show to be held in Pyongyang. The North Korean musicians that performed\nin South Korea were highly praised for their performance that leader Kim\ndecided to send them to Beijing for another goodwill tour in January 2019.\nPart of the revolution was the introduction of other cultures, including\nWestern, which was previously believed to be vulgar and quite corrupt in the\npast, but is now slowly making its way to the North Korean people. Second-hand\nHarry Potter books can now be read at the National Library, and Bollywood\nfilms like the _Three Idiots_ had just had a run in their cinemas. The changes\nhave also found their way to the economic sector with factories that are also\nproducing products that are associated more with the West, like Air Jordan\nshoes, for national consumption.\n\nPer the amendments made to the Constitution in 2019, the former economic\nmethods of management, Ch'ŏngsan-ni in agriculture and Taean in the\nindustries, were now phased out altogether.\n\nAfter the 8th Party Congress, Kim Byung-yeon of the Seoul National University\nsaid that, between 2017 and 2019, the North Korean GDP decreased by 10% and,\nin 2020, the North Korean GDP decreased by 5%."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Manufacturing",
    "text": "Tool-machine factory in Huichon\n\nNorth Korea also implements planned economy in industry. The government will\nprovide fuel and materials for a factory, while the factory will manufacture\nproducts and quantities according to the government's requirements.\n\nNorth Korea's self-reliant development strategy assigned top priority to\ndeveloping heavy industry, with parallel development in agriculture and light\nindustry. This policy was achieved mainly by giving heavy industry\npreferential allocation of state investment funds. More than 50% of state\ninvestment went to the industrial sector during the 1954–1976 period (47.6%,\n51.3%, 57.0%, and 49.0%, respectively, during the Three-Year Plan, Five-Year\nPlan, First Seven-Year Plan, and Six-Year Plan). As a result, gross industrial\noutput grew rapidly.\n\nAs was the case with the growth in national output, the pace of growth has\nslowed markedly since the 1960s. The rate declined from 41.7% and 36.6% a year\nduring the Three-Year Plan and Five-Year Plan, respectively, to 12.8%, 16.3%,\nand 12.2%, respectively, during the First Seven Year Plan, Six-Year Plan, and\nSecond Seven-Year Plan. As a result of faster growth in industry, that\nsector's share in total national output increased from 16.8% in 1946 to 57.3%\nin 1970. Since the 1970s, industry's share in national output has remained\nrelatively stable. From all indications, the pace of industrialization during\nthe Third Seven-Year Plan up to 1991 is far below the planned rate of 9.6%. In\n1990 it was estimated that the industrial sector's share of national output\nwas 56%.\n\nIndustry's share of the combined total of gross agricultural and industrial\noutput climbed from 28% in 1946 to well over 90% in 1980. Heavy industry\nreceived more than 80% of the total state investment in industry between 1954\nand 1976 (81.1%, 82.6%, 80%, and 83%, respectively, during the Three-Year\nPlan, Five-Year Plan, First Seven-Year Plan, and Six-Year Plan), and was\noverwhelmingly favored over light industry.\n\nNorth Korea claims to have fulfilled the Second Seven-Year Plan (1978–1984)\ntarget of raising the industrial output in 1984 to 120% of the 1977 target,\nequivalent to an average annual growth rate of 12.2%. Judging from the\nproduction of major commodities that form the greater part of industrial\noutput, however, it is unlikely that this happened. For example, the increase\nduring the 1978–1984 plan period for electric power, coal, steel, metal-\ncutting machines, tractors, passenger cars, chemical fertilizers, chemical\nfibers, cement, and textiles, respectively, was 78%, 50%, 85%, 67%, 50%, 20%,\n56%, 80%, 78%, and 45%. Raw materials were in short supply and so were energy\nand hard currency. Infrastructure decayed and machinery became obsolete.\nUnlike other socialist countries in the Eastern Bloc, North Korea kept\nplanning in a highly centralized manner and refused to liberalize economic\nmanagement.\n\nHuichon Hard Glass Factory\n\nIn the mid-1980s, the speculation that North Korea would emulate China in\nestablishing Chinese-style special economic zones was flatly denied by then\ndeputy chairman of the Economic Policy Commission Yun Ki-pok (Yun became\nchairman as of June 1989). China's special economic zones typically are\ncoastal areas established to promote economic development and the introduction\nof advanced technology through foreign investment. Investors are offered\npreferential tax terms and facilities. The zones, which allow greater reliance\non market forces, have more decision-making power in economic activities than\ndo provincial-level units. Over the years, China has tried to convince the\nNorth Korean leadership of the advantages of these zones by giving tours of\nthe various zones and explaining their values to visiting high-level\nofficials.\n\nIn April 1982, Kim Il Sung announced a new economic policy giving priority to\nincreased agricultural production through land reclamation, development of the\ncountry's infrastructure—especially power plants and transportation\nfacilities—and reliance on domestically produced equipment. There also was\nmore emphasis on trade.\n\nIn September 1984, North Korea promulgated a joint venture law to attract\nforeign capital and technology. The new emphasis on expanding trade and\nacquiring technology was not, however, accompanied by a shift in priorities\naway from support of the military. In 1991, North Korea announced the creation\nof a Special Economic Zone (SEZ) in the northeast regions of Rason (Rason\nSpecial Economic Zone) and Ch'ŏngjin. Investment in this SEZ has been slow in\ncoming. Problems with infrastructure, bureaucracy, uncertainties about the\nsecurity of investments, and viability have hindered growth and development.\nNevertheless, thousands of small Chinese businesses had set up profitable\noperations in North Korea by 2011.\n\nA government research center, the Korea Computer Center, was set up in 1990,\nstarting the slow development of an information technology industry.\n\nIn 2013 and 2014, the State Economic Development Administration announced a\nnumber of smaller special economic zones covering export handling, mineral\nprocessing, high technology, gaming and tourism. International conferences on\nspecial economic zones took place in 2013 and 2014, and the concept of many\nprovincial economic zones was considered. However from 2019 these\npossibilities have diminished, partly out of a concern of excessive foreign\ninfluence on North Korean society."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.7.1",
    "section_name": "Garment industry",
    "text": "The most successful export industry is the garment industry. Production is by\na North Korean firm for a European or other foreign partner, by a Chinese firm\noperating in North Korea with a North Korean partner, or by North Korean\nworkers working in Chinese or other foreign factories. Wages are the lowest in\nnortheastern Asia."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.7.2",
    "section_name": "Automotive industry",
    "text": "A North Korean manufactured trolleybus, a Chollima 90\n\nThe North Korean motor vehicle production establishes military, industrial and\nconstruction goals, with private car ownership by citizens remaining on low\ndemand. Having Soviet origins (the subsequent practice of cloning foreign\nspecimens, and a recent automobile joint-venture), North Korea has developed a\nwide-range automotive industry with production of all types of vehicles. The\nbasis for production is in urban and off-road minis; luxury cars; SUV cars;\nsmall, medium, heavy, and super-heavy cargo; construction and off-road trucks;\nminibuses/minivans, coach buses, civilian and articulated buses, trolleybuses,\nand trams. However, North Korea produces far fewer vehicles than its\nproduction capability due to the ongoing economic crisis. North Korea has not\njoined or collaborated with the OICA, or with any other automotive\norganization, so any critical information about its motor vehicle industry is\nlimited."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Power and energy",
    "text": "Electrical engineering components\n\nThe energy sector is one of the most serious bottlenecks in the North Korean\neconomy. Since 1990, the supply of oil, coal, and electricity declined\nsteadily, and seriously affected all sectors of the economy. Crude oil was\nformerly imported by pipeline at \"friendship prices\" from the former Soviet\nUnion or China, but the withdrawal of Russian concessions and the reduction of\nimports from China brought down annual imports from about 23 million barrels\n(3.7×10~~^~~ 6 m3) in 1988 to less than 4 million barrels (640×10~~^~~ 3 m3)\nby 1997. As the imported oil was refined for fuels for transportation and\nagricultural machinery, a serious cutback in oil imports caused critical\nproblems in transportation and agriculture.\n\nAccording to statistics compiled by the South Korean agency Statistics Korea\nbased on International Energy Agency (IEA) data, per capita electricity\nconsumption fell from its peak in 1990 of 1247 kilowatt hours to a low of 712\nkilowatt hours in 2000. It slowly rose since then to 819 kilowatt hours in\n2008, a level below that of 1970.\n\nNorth Korea has no coking coal, but has substantial reserves of anthracite in\nAnju, Aoji (Ŭndŏk), and other areas. Coal production peaked at 43 million tons\nin 1989 and steadily declined to 18.6 million tons in 1998. Major causes of\ncoal shortages include mine flooding, and outdated mining technology. As coal\nwas used mainly for industry and electricity generation, decrease in coal\nproduction caused serious problems in industrial production and electricity\ngeneration.\n\nElectricity generation of North Korea peaked in 1989 at about 30 TWh. There\nwere seven large hydroelectric plants in the 1980s. Four were along the Yalu\nRiver, built with Chinese aid, and supplying power to both countries. In 1989,\n60% of electricity generation was hydroelectric and 40% fossil fueled, mostly\ncoal-fired.\n\nIn 1997, coal accounted for more than 80% of primary energy consumption and\nhydro power more than 10%.[_citation needed_] Net imports of coal represented\nonly about 3% of coal consumption. Hydroelectric power plants generated about\n55% of North Korea's electricity and coal-fired thermal plants about 39% in\n1997. However, with only 20% of the per capita electricity generation of\nJapan, North Korea suffered from chronic supply shortages. Coal exports to\nChina accounted for a major portion of North Korea's revenue in mid-2010s.\n\nSome hydroelectric facilities were believed to be out of operation due to\ndamage from major flooding in 1995. Coal-fired power plants were running well\nunder capacity, due in part to a serious decline in coal supply and in part to\nproblems with transportation of coal. The electricity supply steadily declined\nand was 17 TWh in 1998.[_citation needed_] Transmission losses sit at just\nunder 16% (15.8%) as of 2014."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.9",
    "section_name": "Construction",
    "text": "Mansudae People's Theatre, opened in 2012\n\nConstruction has been an active sector in North Korea. This was demonstrated\nnot only through large housing programmes, of which most were visible in the\nhigh-rise apartment blocks in Pyongyang, but also in the smaller modern\napartment complexes widespread even in the countryside. These are dwarfed in\nevery sense by \"grand monumental edifices\". The same may apply even to\napparently economically useful projects such as the Nampo Dam, which cost\nUS$4bn.\n\nThe years of economic contraction in the 1990s slowed this sector as it did\nothers; the shell of the 105-story Ryugyŏng Hotel towered unfinished on\nPyongyang's skyline for over a decade. The Bank of Korea claims that\nconstruction's share of GDP fell by almost one-third between 1992 and 1994,\nfrom 9.1% to 6.3%. This accords with a rare official figure[_citation needed_]\nof 6% for 1993, when the sector was said to have employed 4.2% of the labour\nforce. However, the latter figure excludes the Korean People's Army, which\nvisibly does much of the country's construction work.\n\nSince about 2012, when 18 tower blocks were built in Pyongyang, a construction\nboom has taken place in Pyongyang. Major projects include the Mansudae\nPeople's Theatre (2012), Munsu Water Park (2013), the modernisation of\nPyongyang International Airport (2015) and the Science and Technology Center\n(2015)."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.10",
    "section_name": "Banking",
    "text": "The Central Bank of North Korea, under the Ministry of Finance, has a network\nof 227 local branches. Several reissues of banknotes in recent years suggest\nthat citizens are inclined to hoard rather than bank any savings that they\nmake from their incomes; reportedly they now also prefer foreign currency. At\nleast two foreign aid agencies[_clarification needed_] have recently set up\nmicrocredit schemes, lending to farmers and small businesses.[_citation\nneeded_]\n\nIn late 2009, North Korea revalued its currency, effectively confiscating all\nprivately held money above the equivalent of US$35 per person. The revaluation\neffectively wiped out the savings of many North Koreans. Days after the\nrevaluation the won dropped 96% against the United States dollar. Pak Nam-gi,\nthe director of the Planning and Finance Department of North Korea's ruling\nWorkers' Party, was blamed for the disaster and later executed in 2010.\n\nA Koryo cash card reader in 2012\n\nIn 2004 and 2006 laws were passed to codify rules for savings and commercial\nbanking. However it was not until 2012 that North Korean banks started to\nseriously compete for retail customers. Competing electronic cash cards have\nbecome widely accepted in Pyongyang and other cities, but are generally not\nlinked to bank accounts. North Korean banks have introduced retail products\nwhich permit a mobile phone app to make payments and top-ups.\n\nAs of May 2013, China Merchants Bank, Industrial and Commercial Bank of China,\nChina Construction Bank, and Agricultural Bank of China, stopped \"all cross-\nborder cash transfers, regardless of the nature of the business\" with North\nKorea. The Bank of China, China's primary institution for foreign exchange\ntransactions, said, on May 14, 2013, that \"it had closed the account of\nForeign Trade Bank, North Korea's main foreign exchange bank\". However,\n\"smaller banks based in northeastern China across the border from North Korea\nsaid it was still handling large-scale cross-border transfers.\" For example,\nthe Bank of Dalian branch in Dandong was still doing transfers to North Korea.\n\nKim Jong Un from 2015 has sought to enlarge and reform the banking sector, to\nassist economic growth, with credit cards viewed as a way to increase money\ncirculation. The concept of socialist commercial banks is being developed to\nutilize \"idle funds\" effectively, including the savings of individuals, to\npromote economic growth."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.11",
    "section_name": "Retail",
    "text": "Number One Department Store in Pyongyang\n\nUntil the early 2000s the official retail sector was mainly state-controlled,\nunder the direction of the People's Services Committee. Consumer goods were\nfew and of poor quality, with most provided on a ration basis. There were\nstate-run stores and direct factory outlets for the masses, and special shops\nwith luxuries for the elite—as well as a chain of hard-currency stores (a\njoint venture with the association of pro-Pyongyang Korean residents in Japan,\nthe Ch'ongryŏn), with branches in large cities.\n\nIn 2002 and in 2010, private markets were progressively legalized, mostly for\nfood sales. As of 2013, urban and farmer markets were held every 10 days, and\nmost urban residents lived within 2 km of a market. Since the 2009 economic\nintervention, it is common for North Korean citizens to make purchases with\nChinese yuan and United States dollars.\n\nIn 2012, the third large shopping mall in Pyongyang, the Kwangbok Area\nShopping Center, opened. In 2014 the construction of another large shopping\nmall started. As of 2017, these malls sold competing brands of goods, for\nexample at least ten different kinds of toothpaste were being sold.\n\nIn 2017, the Korea Institute for National Unification estimated there were 440\ngovernment-approved markets employing about 1.1 million people.\n\nIn 2021, the authorities began major crackdowns aimed at reducing the role of\nthe markets with the shift to a state-run monopoly on food sales and measures\nto ensure that food would pass through state-run shops, a network of which the\ngovernment had been building since 2019. These shops monopolized the sale and\ndistribution of domestically produced goods and a great portion of newly\nimported goods."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.11.1",
    "section_name": "Agriculture",
    "text": "Crops growing in North Korea\n\nNorth Korea's sparse agricultural resources limit agricultural production.\nClimate, terrain, and soil conditions are not particularly favorable for\nfarming, with a relatively short cropping season. Only about 17% of the total\nlandmass, or approximately 20,000 km2, is arable, of which 14,000 km2 is well\nsuited for cereal cultivation; the major portion of the country is rugged\nmountain terrain.\n\nThe weather varies markedly according to elevation, and lack of precipitation,\nalong with infertile soil, makes land at elevations higher than 400 meters\nunsuitable for purposes other than grazing. Precipitation is geographically\nand seasonally irregular, and in most parts of the country as much as half the\nannual rainfall occurs in the three summer months. This pattern favors the\ncultivation of paddy rice in warmer regions that are outfitted with irrigation\nand flood control networks. Rice yields are 5.3 tonnes per hectare, close to\ninternational norms. In 2005, North Korea was ranked by the FAO as an\nestimated 10th in the production of fresh fruit and as an estimated 19th in\nthe production of apples.\n\nFarming is concentrated in the flatlands of the four west coast provinces,\nwhere a longer growing season, level land, adequate rainfall, and good\nirrigated soil permit the most intensive cultivation of crops. A narrow strip\nof similarly fertile land runs through the eastern seaboard Hamgyŏng provinces\nand Kangwŏn Province, but the interior provinces of Chagang and Ryanggang are\ntoo mountainous, cold, and dry to allow much farming. The mountains contain\nthe bulk of North Korea's forest reserves while the foothills within and\nbetween the major agricultural regions provide lands for livestock grazing and\nfruit tree cultivation.\n\nSince self-sufficiency remains an important pillar of North Korean ideology,\nself-sufficiency in food production is deemed a worthy goal. Another aim of\ngovernment policies—to reduce the gap between urban and rural living\nstandards—requires continued investment in the agricultural sector. The\nstability of the country depends on steady, if not rapid, increases in the\navailability of food items at reasonable prices. In the early 1990s, there\nwere severe food shortages.\n\nA tractor in North Korea\n\nThe most far-reaching statement on agricultural policy is embodied in Kim Il\nSung's 1964 _Theses on the Socialist Agrarian Question in Our Country_ , which\nunderscores the government's concern for agricultural development. Kim\nemphasized technological and educational progress in the countryside as well\nas collective forms of ownership and management. As industrialization\nprogressed, the share of agriculture, forestry, and fisheries in the total\nnational output declined from 63.5% and 31.4%, respectively, in 1945 and 1946,\nto a low of 26.8% in 1990. Their share in the labor force also declined from\n57.6% in 1960 to 34.4% in 1989.\n\nIn the 1990s, the decreasing ability to carry out mechanized operations\n(including the pumping of water for irrigation), as well as lack of chemical\ninputs, was clearly contributing to reduced yields and increased harvesting\nand post-harvest losses.\n\nIncremental improvements in agricultural production have been made since the\nlate 1990s, bringing North Korea close to self-sufficiency in staple foods by\n2013. In particular, rice yields have steadily improved, though yields on\nother crops have generally not improved. The production of protein foods\nremains inadequate. Access to chemical fertilizer has declined, but the use of\ncompost and other organic fertilizer has been encouraged."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.11.2",
    "section_name": "Fisheries",
    "text": "North Korean fisheries export seafood, primarily crab, to Dandong, Liaoning,\nillicitly. Crabs, clams and conches from the Yellow Sea waters of North Korea\nare popular in China, possibly because the less salty water improves taste."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.11.3",
    "section_name": "Food distribution system",
    "text": "Since the 1950s, a majority of North Koreans have received their food through\nthe public distribution system (PDS). The PDS requires farmers in agricultural\nregions to hand over a portion of their production to the government and then\nreallocates the surplus to urban regions, which cannot grow their own foods.\nAbout 70% of the North Korean population, including the entire urban\npopulation, receives food through this government-run system.\n\nBefore the floods, recipients were generally allotted 600–700 grams per day\nwhile high officials, military men, heavy laborers, and public security\npersonnel were allotted slightly larger portions of 700–800 grams per day. As\nof 2013, the target average distribution was 573 grams of cereal equivalent\nper person per day, but varied according to age, occupation, and whether\nrations are received elsewhere (such as school meals). However, as of 2019,\nthis number has been reduced to 312 grams per day according to an\ninvestigation conducted by the United Nations between March 29 and April 12.\n\nDecreases in production affected the quantity of food available through the\npublic distribution system. Shortages were compounded when the North Korean\ngovernment imposed further restrictions on collective farmers. When farmers,\nwho had never been covered by the PDS, were mandated by the government to\nreduce their own food allotments from 167 kilograms to 107 kilograms of grain\nper person each year, they responded by withholding portions of the required\namount of grain. By 2008, the system had significantly recovered, and, from\n2009 to 2013, daily per person rations averaged at 400 grams per day for much\nof the year, though in 2011 it dropped to 200 grams per day from May to\nSeptember.\n\nIt is estimated that in the early 2000s, the average North Korean family drew\nsome 80% of its income from small businesses that were technically illegal\n(though unenforced) in North Korea. In 2002 and in 2010, private markets were\nprogressively legalized. As of 2013, urban and farmer markets were held every\n10 days, and most urban residents lived within 2 km of a market, with markets\nhaving an increasing role in obtaining food.\n\nIn recent years the government policy shifted towards a more controlled\ncommercial networks, by restricting local markets and pushing sales in State-\nOwned Stores."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.11.4",
    "section_name": "Crisis and famine",
    "text": "From 1994 to 1998, North Korea suffered a famine. Since North Korea is a\nclosed country, the number of specific deaths in the incident is difficult to\nknow. According to different literature, the starved or malnourished death\ntoll is estimated to be between 240,000 and 480,000. Since 1998 there has been\na gradual recovery in agriculture production, which by 2013 brought North\nKorea back close to self-sufficiency in staple foods. However, as of 2013,\nmost households have borderline or poor food consumption, and consumption of\nprotein remains inadequate.\n\nIn the 1990s, the North Korean economy saw stagnation turning into crisis.\nEconomic assistance received from the Soviet Union and China was an important\nfactor of its economic growth. Upon its collapse in 1991, the Soviet Union\nwithdrew its support and demanded payment in hard currency for imports. China\nstepped in to provide some assistance and supplied food and oil, most of it\nreportedly at concessionary prices.[_citation needed_] The North Korean\neconomy was undermined and its industrial output began to decline in 1990.\nDeprived of industrial inputs, including fertilizers, pesticides, and\nelectricity for irrigation, agricultural output also started to decrease even\nbefore North Korea had a series of natural disasters in the mid-1990s. This\nevolution, combined with a series of natural disasters including record floods\nin 1995, caused one of the worst economic crises in North Korea's history.\nOther causes of this crisis were high defense spending (about 25% of GDP) and\nbad governance.\n\nIn December 1991, North Korea established a \"zone of free economy and trade\"\nto include the northeastern port cities of Unggi (Sŏnbong), Ch'ŏngjin, and\nNajin. The establishment of this zone also had ramifications on the questions\nof how far North Korea would go in opening its economy to the West and to\nSouth Korea, the future of the development scheme for the Tumen River area,\nand, more important, how much North Korea would reform its economic system.\n\nNorth Korea announced in December 1993 a three-year transitional economic\npolicy placing primary emphasis on agriculture, light industry, and foreign\ntrade. However, lack of fertilizer, natural disasters, and poor storage and\ntransportation practices have left the country more than a million tons per\nyear short of grain self-sufficiency. Moreover, lack of foreign exchange to\npurchase spare parts and oil for electricity generation left many factories\nidle.\n\nThe 1990s famine paralyzed many of the Stalinist economic institutions. The\ngovernment pursued Kim Jong Il's _Songun_ policy, under which the military is\ndeployed to direct production and infrastructure projects. As a consequence of\nthe government's policy of establishing economic self-sufficiency, the North\nKorean economy has become increasingly isolated from that of the rest of the\nworld, and its industrial development and structure do not reflect its\ninternational competitiveness. Domestic firms are shielded from international\nas well as domestic competition; the result is chronic inefficiency, poor\nquality, limited product diversity, and underutilization of plants.[_citation\nneeded_] This protectionism also limits the size of the market for North\nKorean producers, which prevents taking advantage of economies of scale.\n\nNorth Korea, led by Kim Jong Un, declined external aid for flood recovery,\nrelocating 15,400 displaced people to Pyongyang while emphasizing self-\nreliance. Despite offers from Russia, China, and others, the North has chosen\nto manage the crisis independently.\n\n\nThe food shortage was primarily precipitated by the loss of fuel and other raw\nmaterials imports from China and the Soviet Union which had been essential to\nsupport an energy intensive and energy inefficient farming system. Following\nthe collapse of the Soviet Union, the former concessional trade relationships\nwhich benefited the North Korea were not available. The three flood and\ndrought years between 1994 and 1996 only served to complete the collapse of\nthe agriculture sector. In 2004, more than half (57%) of the population did\nnot have enough food to stay healthy. 37% of children had their growth stunted\nand 1⁄3 of mothers severely lacked nutrition.\n\nIn 2006, the World Food Program (WFP) and FAO estimated a requirement of 5.3\nto 6.5 million tons of grain when domestic production fulfilled only 3.825\nmillion tons. The country also faces land degradation after forests stripped\nfor agriculture resulted in soil erosion. In 2008, a decade after the worst\nyears of the famine, total production was 3.34 million tons (grain equivalent)\ncompared with a need of 5.98 million tons. Thirty seven percent of the\npopulation was deemed to be insecure in food access. Weather continued to pose\nchallenges every year, but overall food production grew gradually, and by\n2013, production had increased to the highest level since the crisis, to 5.03\nmillion tons cereal equivalent, against a minimum requirement of 5.37 MMT.\n\nIn 2014, North Korea had an exceptionally good harvest, 5.08 million tonnes of\ncereal equivalent, almost sufficient to feed the entire population. While food\nproduction had recovered significantly since the hardest years of 1996 and\n1997, the recovery was fragile, subject to adverse weather and year to year\neconomic shortages. Distribution was uneven, with the Public Distribution\nSystem being largely ineffective. North Korea now has in most years lower\nmalnutrition levels than in some richer Asian countries. However, in 2019\nNorth Korea had the worst harvest in over a decade, which the United Nations\ndescribed as a \"hunger crisis\"."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.12",
    "section_name": "Mining",
    "text": "According to a 2012 report by South Korea-based North Korea Resource Institute\n(NKRI), North Korea has substantial reserves of iron ore, coal, limestone, and\nmagnesite. In addition, North Korea is thought to have tremendous potential\nrare metal resources, which have been valued in excess of US$6 trillion.\n\nIt is the world's 18th largest producer of iron and zinc, and has the 22nd\nlargest coal reserves in the world. It is also the 15th largest fluorite\nproducer and 12th largest producer of copper and salt in Asia. Other major\nnatural resources in production include lead, tungsten, graphite, magnesite,\ngold, pyrites, fluorspar, and hydropower.\n\nIn 2015, North Korea exported 19.7 million tonnes of coal, worth $1.06\nbillion, much of it to China. In 2016 it was estimated that coal shipments to\nChina accounted for about 40% of exports.\n\nHowever, starting from February 2017 China suspended all North Korean coal\nimports, although according to China overall trade with North Korea increased."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "2.13",
    "section_name": "Information technology and culture",
    "text": "North Korea has a developing information technology industry. In 2018, a\ntechnological exhibition unveiled a new Wi-Fi service called Mirae (\"Future\"),\nwhich allowed mobile devices to access the intranet network in Pyongyang. The\nexhibition also showcased a home automation system using speech recognition in\nKorean.\n\nNorth Korea established the Artificial Intelligence Research Institute under\nthe Bureau of the Information Industry Guidance in 2013, which in 2021 was\nincorporated into the Ministry of Information Industry.\n\nNorth Korea's cartoon animation studios such as SEK Studio sub-contract work\nfrom South Korean animation studios. Mansudae Overseas Projects builds\nmonuments around the world."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Organization and management",
    "text": "North Korea's economy has been unique in its historical suppression of\nmarkets. By the 1960s, market elements had been suppressed almost completely.\nAlmost all items, from food to clothes, have traditionally been handed out\nthrough a public distribution system, with money only having a symbolic\nmeaning. Ratios of food depend on hierarchy in the system, wherein the\npositions seem to be semi-hereditary. Until the late 1980s, peasants were not\nallowed to cultivate private garden plots.\n\nSince the government is the dominant force in the development and management\nof the economy, bureaus and departments have proliferated at all\nadministrative levels. There are fifteen committees—such as the agricultural\nand state planning committees—one bureau, and twenty departments under the\nsupervision of the Cabinet; of these, twelve committees—one bureau, and\nsixteen departments are involved in economic management. In the early 1990s,\nseveral vice premiers of the then State Administration Council supervised\neconomic affairs. Organizations undergo frequent reorganization. Many of these\nagencies have their own separate branches at lower levels of government while\nothers maintain control over subordinate sections in provincial and county\nadministrative agencies.\n\nAround 1990, with the collapse of the Soviet Union, restrictions on private\nsales, including grain, ceased to be enforced. It is estimated that in the\nearly 2000s, the average North Korean family drew some 80% of its income from\nsmall businesses that were technically illegal (though unenforced) in North\nKorea. In 2002, and in 2010, private markets were progressively legalized. As\nof 2013, urban and farmer markets were held every 10 days, and most urban\nresidents lived within 2 km of a market. However, in recent years the\ngovernment policy shifted towards a more controlled commercial networks, by\nrestricting local markets and pushing sales in State-Owned Stores.\n\nIn 2014, North Korea announced the \"May 30th measures\". These planned to give\nmore freedom to farmers, allowing them to keep around 30% of their produce.\nAlso enterprise managers would be allowed to hire and fire workers within a\nspecific framework, and decide whom they do business with and where they buy\nraw materials and spare parts. Some reports suggest that these measures would\nallow nominally state-run enterprises to be run on capitalist lines like those\nin China. However, the 8th Congress of the Workers' Party of Korea introduced\nnew policies in 2021 which aim to strengthen the old command economy unified\nunder the State Planning Commission."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Economic planning",
    "text": "North Korea, one of the world's most centrally planned and isolated economies,\nfaces desperate economic conditions. Industrial capital stock is nearly beyond\nrepair as a result of years of underinvestment and shortages of spare parts.\nIndustrial and power output have declined in parallel. During what North Korea\ncalled the \"peaceful construction\" period before the Korean War, the\nfundamental task of the economy was to overtake the level of output and\nefficiency attained toward the end of the Japanese occupation; to restructure\nand develop a viable economy reoriented toward the communist-bloc countries;\nand to begin the process of socializing the economy. Nationalization of key\nindustrial enterprises and land reform, both of which were carried out in\n1946, laid the groundwork for two successive one-year plans in 1947 and 1948,\nrespectively, and the Two-Year Plan of 1949–50. It was during this period that\nthe piece-rate wage system and the independent accounting system began to be\napplied and that the commercial network increasingly came under state and\ncooperative ownership.\n\nThe basic goal of the Three-Year Plan, officially named \"The Three-Year Post-\nwar Reconstruction Plan of 1954–56\", was to reconstruct an economy torn by the\nKorean War. The plan stressed more than merely regaining the prewar output\nlevels. The Soviet Union, other East European countries and China provided\nreconstruction assistance. The highest priority was developing heavy industry,\nbut an earnest effort to collectivize farming also was begun. At the end of\n1957, output of most industrial commodities had returned to 1949 levels,\nexcept for a few items such as chemical fertilizers, carbides, and sulfuric\nacid, whose recovery took longer.\n\nHaving basically completed the task of reconstruction, the state planned to\nlay a solid foundation for industrialization while completing the\nsocialization process and solving the basic problems of food and shelter\nduring the Five-Year Plan of 1957–1960. The socialization process was\ncompleted by 1958 in all sectors of the economy, and the Ch'ŏllima Movement\nwas introduced. Although growth rates reportedly were high, there were serious\nimbalances among the different economic sectors. Because rewards were given to\nindividuals and enterprises that met production quotas, frantic efforts to\nfulfill plan targets in competition with other enterprises and industries\ncaused disproportionate growth among various enterprises, between industry and\nagriculture and between light and heavy industries. Because resources were\nlimited and the transportation system suffered bottlenecks, resources were\ndiverted to politically well-connected enterprises or those whose managers\ncomplained the loudest. An enterprise or industry that performed better than\nothers often did so at the expense of others. Such disruptions intensified as\nthe target year of the plan approached.\n\nUntil the 1960s, North Korea's economy grew much faster than South Korea's.\nAlthough North Korea was behind in total national output, it was ahead of\nSouth Korea in per capita national output, because of its smaller population\nrelative to South Korea. For example, in 1960 North Korea's population was\nslightly over 10 million people, while South Korea's population was almost 25\nmillion people. Annual economic growth rates of 30% and 21% during the Three-\nYear Plan of 1954–1956 and the Five-Year Plan of 1957–1960, respectively, were\nreported. After claiming early fulfillment of the Five-Year Plan in 1959,\nNorth Korea officially designated 1960 a \"buffer year\"—a year of adjustment to\nrestore balances among sectors before the next plan became effective in 1961.\nNot surprisingly the same phenomenon recurred in subsequent plans. Because the\nFive-Year Plan was fulfilled early, it became a de facto four-year plan.\nBeginning in the early 1960s, however, North Korea's economic growth slowed\nuntil it was stagnant at the beginning of the 1990s.\n\nVarious factors explain the very high rate of economic development of the\ncountry in the 1950s and the general slowdown since the 1960s. During the\nreconstruction period after the Korean War, there were opportunities for\nextensive economic growth—attainable through the communist regime's ability to\nmarshall idle resources and labor and to impose a low rate of consumption.\nThis general pattern of initially high growth resulting in a high rate of\ncapital formation was mirrored in other Soviet-type economies. Toward the end\nof the 1950s, as reconstruction work was completed and idle capacity began to\ndiminish, the economy had to shift from the extensive to the intensive stage,\nwhere the simple communist discipline of marshaling underutilized resources\nbecame less effective. In the new stage, inefficiency arising from emerging\nbottlenecks led to diminishing returns. Further growth would only be attained\nby increasing efficiency and technological progress.\n\nBeginning in the early 1960s, a series of serious bottlenecks began to impede\ndevelopment. Bottlenecks were pervasive and generally were created by the lack\nof arable land, skilled labor, energy, and transportation, and deficiencies in\nthe extractive industries. Moreover, both land and marine transportation\nlacked modern equipment and modes of transportation. The inability of the\nenergy and extractive industries as well as of the transportation network to\nsupply power and raw materials as rapidly as the manufacturing plants could\nabsorb them began to slow industrial growth.\n\nThe First Seven-Year Plan (initially 1961–1967) built on the groundwork of the\nearlier plans but changed the focus of industrialization. Heavy industry, with\nthe machine tool industry as its linchpin, was given continuing priority.\nDuring the plan, however, the economy experienced widespread slowdowns and\nreverses for the first time, in sharp contrast to the rapid and uninterrupted\ngrowth during previous plans. Disappointing performance forced the planners to\nextend the plan three more years, until 1970. During the last part of the _de\nfacto_ ten-year plan, emphasis shifted to pursuing parallel development of the\neconomy and of defense capabilities. This shift was prompted by concern over\nthe military takeover in South Korea by General Park Chung Hee (1961–1979),\nescalation of the United States involvement in Vietnam, and the widening Sino-\nSoviet split. It was thought that stimulating a technological revolution in\nthe munitions industry was one means to achieve these parallel goals. In the\nend, the necessity to divert resources to defense became the official\nexplanation for the plan's failure.\n\nThe Six-Year Plan of 1971–1976 followed immediately in 1971. In the aftermath\nof the poor performance of the preceding plan, growth targets of the Six-Year\nPlan were scaled down substantially. Because some of the proposed targets in\nthe First Seven-Year Plan had not been attained even by 1970, the Six-Year\nPlan did not deviate much from its predecessor in basic goals. The Six-Year\nPlan placed more emphasis on technological advance, self-sufficiency (_Juche_)\nin industrial raw materials, improving product quality, correcting imbalances\namong different sectors, and developing the power and extractive industries;\nthe last of these had been deemed largely responsible for slowdowns during the\nFirst Seven-Year Plan. The plan called for attaining a self- sufficiency rate\nof 60–70% in all industrial sectors by substituting domestic raw materials\nwherever possible and by organizing and renovating technical processes to make\nthe substitution feasible. Improving transport capacity was seen as one of the\nurgent tasks in accelerating economic development—it was one of the major\nbottlenecks of the Six-Year Plan.\n\nNorth Korea claimed to have fulfilled the Six-Year Plan by the end of August\n1975, a full year and four months ahead of schedule. Under the circumstances,\nit was expected that the next plan would start without delay in 1976, a year\nearly, as was the case when the First Seven-Year Plan was instituted in 1961.\nEven if the Six-Year Plan had been completed on schedule, the next plan should\nhave started in 1977. However, it was not until nearly two years and four\nmonths later that the long-awaited plan was unveiled—1977 had become a \"buffer\nyear\".\n\nThe inability of the planners to continuously formulate and institute economic\nplans reveals as much about the inefficacy of planning itself as the extent of\nthe economic difficulties and administrative disruptions facing the country.\nFor example, targets for successive plans have to be based on the\naccomplishments of preceding plans. If these targets are underfulfilled, all\ntargets of the next plan—initially based on satisfaction of the plan—have to\nbe reformulated and adjusted. Aside from underfulfillment of the targets,\nwidespread disruptions and imbalances among various sectors of the economy\nfurther complicate plan formulation.\n\nThe basic thrust of the Second Seven-Year Plan (1978–1984) was to achieve the\nthree-pronged goals of self-reliance, modernization, and \"scientification\".\nAlthough the emphasis on self-reliance was not new, it had not previously been\nthe explicit focus of an economic plan. This new emphasis might have been a\nreaction to mounting foreign debt originating from large-scale imports of\nWestern machinery and equipment in the mid-1970s. Through modernization North\nKorea hoped to increase mechanization and automation in all sectors of the\neconomy. \"Scientification\" means the adoption of up-to-date production and\nmanagement techniques. The specific objectives of the economic plan were to\nstrengthen the fuel, energy, and resource bases of industry through priority\ndevelopment of the energy and extractive industries; to modernize industry; to\nsubstitute domestic resources for certain imported raw materials; to expand\nfreight-carrying capacity in railroad, road, and marine transportation\nsystems; to centralize and containerize the transportation system; and to\naccelerate a technical revolution in agriculture.\n\nIn order to meet the manpower and technology requirements of an expanding\neconomy, the education sector also was targeted for improvements. The quality\nof the comprehensive eleven-year compulsory education system was to be\nenhanced to train more technicians and specialists, and to expand the training\nof specialists, particularly in the fields of fuel, mechanical, electronic,\nand automation engineering.\n\nSuccessful fulfillment of the so-called nature-remaking projects also was part\nof the Second Seven-Year Plan. These projects referred to the five-point\nprogram for nature transformation unveiled by Kim Il Sung in 1976: completing\nthe irrigation of non-paddy fields; reclaiming 1,000 square kilometres of new\nland; building 1,500 to 2,000 km2 of terraced fields; carrying out\nafforestation and water conservation work; and reclaiming tidal land.\n\nFrom all indications, the Second Seven-Year Plan was not successful. North\nKorea generally downplayed the accomplishments of the plan, and no other plan\nreceived less official fanfare. It was officially claimed that the economy had\ngrown at an annual rate of 8.8% during the plan, somewhat below the planned\nrate of 9.6%. The reliability of this aggregate measure, however, is\nquestionable. During the plan, the target annual output of 10 million tons of\ngrains (cereals and pulses) was attained. However, by official admission, the\ntargets of only five other commodities were fulfilled. Judging from the growth\nrates announced for some twelve industrial products, it is highly unlikely\nthat the total industrial output increased at an average rate of 12.2% as\nclaimed. After the plan concluded, there was no new economic plan for two\nyears, indications of both the plan's failure and the severity of the economic\nand planning problems confronting the economy in the mid-1980s. From 1998 to\n2003, the government implemented a plan for scientific and technical\ndevelopment, which focused on the nation's IT and electronic industry."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Corruption",
    "text": "In 2019, North Korea was ranked 172nd in the Transparency International\nCorruption Perceptions Index with a score of 17 out of 100."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Labor",
    "text": "Growth and changes in the structure and ownership pattern of the economy also\nhave changed the labor force. By 1958 individual private farmers, who once\nconstituted more than 70% of the labor force, had been transformed into or\nreplaced by state or collective farmers. Private artisans, merchants, and\nentrepreneurs had joined state or cooperative enterprises. In the industrial\nsector in 1963, the last year for which such data are available, there were\n2,295 state enterprises and 642 cooperative enterprises. The size and\nimportance of the state enterprises can be surmised by the fact that state\nenterprises, which constituted 78% of the total number of industrial\nenterprises, contributed 91% of total industrial output.\n\nLabor force (12.6 million)—by occupation:\n\n* Agricultural: 35%\n* Industry and services: 65% (2008 est.)"
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "External trade",
    "text": "Statistics from North Korea's trade partners are collected by international\norganizations like the United Nations and the International Monetary Fund, and\nby the South Korean Ministry of Unification.\n\nIt has also been estimated that imports of arms from the Soviet Union in the\nperiod 1988 to 1990 accounted for around 30% of North Korea's total imports,\nand that between 1981 and 1989 North Korea earned approximately $4 billion\nfrom the export of arms, approximately 30% of North Korea's total exports in\nthat period. The nominal dollar value of arms exports from North Korea in 1996\nwas estimated to have been around $50 million.\n\nNorth Korea's foreign trade deteriorated in the 1990s. After hitting the\nbottom of $1.4 billion in 1998, it recovered slightly. North Korea's trade\ntotal in 2002 was $2.7 billion: only about 50% of $5.2 billion in 1988, even\nin nominal US dollars. These figures exclude intra-Korean trade, deemed\ninternal, which rose in 2002 to $641 million. During the late 2000s trade grew\nstrongly, almost tripling between 2007 and 2011 to $5.6 billion, with much of\nthe growth being with China. By about 2010 external trade had returned to 1990\nlevels, and by 2014 was near double 1990 levels, with trade with China\nincreasing from 50% of total trade in 2005 to near 90% in 2014. In 2015, it\nwas estimated that exports to China were $2.3 billion—83% of total exports of\n$2.83 billion.\n\nIn addition to Kaesŏng and Kŭmgang-san, other special economic areas were\nestablished at Sinŭiju in the northwest (on the border with China), and at\nRasŏn in the northeast (on the border with China and Russia).\n\nInternational sanctions impeded international trade to some degree, many\nrelated to North Korea's development of weapons of mass destruction. United\nStates President Barack Obama approved an executive order in April 2011 that\ndeclared \"the importation into the United States, directly or indirectly, of\nany goods, services, or technology from North Korea is prohibited\".\nOperational sanctions included United Nations Security Council Resolutions\n1695, 1718, 1874, 1928, 2087, and 2094. Reports in 2018 indicated that trade\nsanctions (bans on almost all exports and the freezing of overseas accounts)\nwere seriously affecting the economy. The main paper Rodong Sinmun was running\nshort of paper and was publishing only a third of its normal print run, two\nenergy plants supplying electricity to Pyongyang had to be shut down\nintermittently due to lack of coal, causing blackouts, coal mines were\noperating under capacity due to lack of fuel, coal could not be transported\ndue to lack of fuel and food rations had been cut by half.\n\nThe Taep'oong International Investment Group of Korea is the official company\nthat manages oversea investments to North Korea.\n\nAfter 1956, North Korea reached out to the Third World in the hope of making\ntrade deals. However, according to analyst Benjamin R Young: \"In the end, this\napproach proved ineffective, and Pyongyang never succeeded in developing\nrobust trade relations with the Global South — a situation that appears\nunlikely to change anytime soon\"."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "North–South economic ties",
    "text": "North and South Korea's economic ties have fluctuated greatly over the past 30\nyears or so. In the late 1990s and most of the 2000s, north–south relations\nwarmed under the Sunshine Policy of President Kim Dae-jung. Many firms agreed\nto invest in North Korea, encouraged by the South Korean government's\ncommitment to cover their losses, should investment projects in the north fail\nto become profitable.[_citation needed_]\n\nFollowing a 1988 decision by the South Korean Government to allow trade with\nthe North (see Reunification efforts since 1971), South Korean firms began to\nimport North Korean goods. Direct trade with the South began in the fall of\n1990 after the unprecedented September 1990 meeting of the two Korean Prime\nMinisters. Trade between the countries increased from $18.8 million in 1989 to\n$333.4 million in 1999, much of it processing or assembly work undertaken in\nthe North.\n\nDuring this decade, the chairman of the South Korean company Daewoo visited\nNorth Korea and reached agreement on building a light industrial complex at\nNamp'o. In other negotiations, Hyundai Asan obtained permission to bring tour\ngroups by sea to Kŭmgang-san on the North Korea's southeast coast (see\nKŭmgang-san Tourist Region), and more recently to construct the 800 acres (3.2\nkm2) Kaesŏng Industrial Region, near the Korean Demilitarized Zone (DMZ), at a\ncost of more than $1 billion.\n\nIn response to the summit between Kim Jong Il and Kim Dae-jung in 2000, North\nand South Korea agreed in August 2000 to reconnect the section of the\nSeoul–Pyongyang Gyeongui Railway Line across the DMZ. In addition, the two\ngovernments said they would build a four-lane highway bypassing the truce\nvillage at Panmunjeom.\n\nTV commercials for Samsung's Anycall cell phone featuring North Korean dancer\nCho Myong-ae and South Korea's Lee Hyo-ri were first broadcast on June 11,\n2006.\n\nTrade with South Korea declined after Lee Myung-bak was elected President of\nSouth Korea in 2008, who reduced trade to put pressure on North Korea over\nnuclear matters. Trade with South Korea fell from $1.8 billion to $1.1 billion\nbetween 2007 and 2013, most of the remaining trade being through the Kaesŏng\nIndustrial Region. The Park has been subject to frequent shutdowns due to\npolitical tensions."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "China",
    "text": "With the collapse of the Soviet Union, China has been North Korea's primary\ntrading partner. Bilateral trade rose sharply after 2007. In 2007 trade\nbetween the two countries was $1.97 billion (₩1.7 trillion). By 2011 trade had\nincreased to $5.6 billion (₩5.04 trillion). Trade with China represented 57%\nof North Korea's imports and 42% of exports.\n\nChinese statistics for 2013 indicate that North Korean exports to China were\nnearly $3 billion, with imports of about $3.6 billion. Exports to China in\n2015 were estimated at $2.3 billion."
  },
  {
    "chapter_name": "Economy of North Korea",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Joint ventures",
    "text": "Some South Korean companies launched joint ventures in areas like animation\nand computer software, and Chinese traders have done a booming business back\nand forth across the China–North Korea border. In a 2007 survey of 250 Chinese\noperations in North Korea, a majority reported paying bribes. Robert Suter,\nwho headed the Seoul office of Swedish-Swiss power generation company ABB,\nsays ABB was staking out a position in North Korea, \"It is the same as it was\nin China years ago. You had to be there and you had to build trust.\" A number\nof South Korean enterprises were mainly active in a specially developed\nindustrial zone in Kaesŏng Industrial Region and Chinese enterprises were\nknown to be involved in a variety of activities in trade and manufacturing in\nNorth Korea. European enterprises founded in 2005 the European Business\nAssociation (EBA), Pyongyang, a _de facto_ chamber of commerce representing a\nnumber of European-invested joint ventures and other businesses. Ch'ongryŏn,\nthe pro-North Korean General Association of Korean Residents in Japan,\nbroadcast on their TV channel in 2008 a TV film in three parts featuring\nforeign investment and business in North Korea. This film was put on a YouTube\nchannel called \"BusinessNK\" and could be watched together with a number of\nother videos on foreign joint ventures as well as other investment and\nbusiness activities in North Korea.\n\nThough no international banks operated in the isolated socialist state in\n2013, foreign companies were said to be increasingly interested in dealing\nwith North Korea.\n\nA flat LCD television factory in North Korea was funded by the Ch'ongryŏn in\n2010.\n\nThe Rason Special Economic Zone was established in the early 1990s, in the\nnortheastern corner of the country bordering China and Russia. In June 2011,\nan agreement with China was made to establish a joint free trade area on North\nKorea's Hwanggumpyong and Wihwa Islands and China's border area near Dandong.\nNorth Korea designated over a dozen new special economic zones in 2013 and\n2014."
  }
]