[
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Economy of Greece  \n---  \nOverview  \n  \n  *   * Agriculture\n  * Banking\n  * (Bank of Greece, National Bank of Greece, list)\n  * Communications\n  * Companies\n  * Energy\n  * Industry\n  * Ports\n  * Shipping\n  * Stock Exchange\n  * (companies listed)\n  * Tourism\n  * Transport\n\n  \nHistory  \n  \n  * Economic history of Greece and the Greek world\n  * Greek economic miracle\n  * Greek debt crisis\n\n  \nRelated  \n  \n  * Brands\n  * Greece and the International Monetary Fund\n  * International rankings\n  * Thessaloniki International Fair\n\n  \n  \n  * Greece portal\n\n  \n  \n  * v\n  * t\n  * e\n\n  \n  \nThe economy of Greece is an advanced, high-income economy. It is the 50th-\nlargest in the world, with an annual nominal gross domestic product (GDP) of\n$267.348 billion. In terms of purchasing power parity, Greece is the world's\n54th-largest economy, at $467.590 billion in annual output. It is the 16th-\nlargest economy in the European Union and eleventh largest in the eurozone.\nAccording to the International Monetary Fund's figures for 2025, Greece's GDP\nper capita is $25,756 at nominal value and $45,048 at purchasing power parity.\nGreece is a welfare state and ranks relatively highly among OECD nations in\nterms of social spending, which stood at 23.7% of GDP in 2024.\n\nIt is a developed country, with an economy based on the service (80%) and\nindustrial sectors (16%), and the agricultural sector contributing an\nestimated 4% of national economic output in 2017. Important Greek industries\ninclude tourism and shipping. With 31.3 million international tourists in\n2019, Greece was the 7th-most-visited country in the European Union and 13th\nin the world, marking a steady increase from 18 million tourists in 2013. The\nGreek Merchant Navy is the largest in the world, with Greek-owned vessels\naccounting for 21% of global deadweight tonnage as of 2021; the total capacity\nof the Greek-owned fleet has increased by 45.8% compared to 2014. The\nincreased demand for international maritime transportation between Greece and\nAsia has resulted in unprecedented investment in the shipping industry.\n\nThe country is a significant agricultural producer within the EU. Greece has\nthe largest economy in Southeast Europe and is an important regional investor.\nGreece was the largest foreign investor in Albania in 2013, the third in\nBulgaria, in the top-three in Romania and Serbia and the most important\ntrading partner and largest foreign investor in North Macedonia. The Greek\ntelecommunications company OTE has made significant public investment across\nSoutheast Europe.\n\nGreece was a founding member of the Organisation for Economic Co-operation and\nDevelopment (OECD) and of the Organization of the Black Sea Economic\nCooperation (BSEC). The country joined what is now the European Union in 1981.\nIn 2001 Greece adopted the euro as its currency, replacing the Greek drachma\nat an exchange rate of 340.75 drachmae per euro. Greece is a member of the\nInternational Monetary Fund and of the World Trade Organization, and ranked\n34th on Ernst & Young's Globalization Index 2011\\.\n\nWorld War II (1939–1945) devastated the country's economy, but the high levels\nof economic growth that followed from 1950 to 1980 have been called the Greek\neconomic miracle. From 2000 Greece saw high levels of GDP growth above the\nEurozone average, peaking at 5.8% in 2003, 5.4% in 2004 and 6.4% in 2006. The\nsubsequent Great Recession and Greek government-debt crisis, a central focus\nof the wider euro area crisis, plunged the economy into a sharp downturn, with\nreal GDP growth rates of −4.1% in 2009, −5.7% in 2010, −9.9% in 2011, −8.3% in\n2012 and −2.3% in 2013. In 2011, the country's government debt reached €356\nbillion (172% of nominal GDP). After negotiating the biggest debt\nrestructuring in history with the private sector, which sustained losses in\nthe order of €100 billion for private bond investors, Greece reduced its\nsovereign debt burden to €280 billion (137% of GDP) in the first quarter of\n2012. Greece achieved a real GDP growth rate of 0.8% in 2014—after five\nconsecutive years of economic decline—but the economy contracted by 0.2% in\n2015 and recorded zero growth in 2016. The country returned to modest growth\nrates of 1.5% in 2017, 2.1% in 2018 and 2.3% in 2019. GDP contracted by 9.2%\nin 2020 during the global recession caused by the COVID-19 pandemic. However,\nthe economy rebounded by 8.7% in 2021, 5.7% in 2022, 2.3% in 2023 and 2.3% in\n2024. On 20 August 2022, Greece formally exited the EU's \"enhanced\nsurveillance framework\", which had been in place since the conclusion of the\nthird bailout programme exactly four years earlier. On 2 December 2022,\nBerlin-based credit rating agency Scope assigned a positive outlook to\nGreece's BB+ rating, presaging the country's return to investment grade. On 31\nJuly 2023, Greece's investment-grade status was restored by Japanese credit\nrating agency R&I. Scope, DBRS, S&P and Fitch followed suit on 4 August, 8\nSeptember, 20 October and 1 December 2023 respectively, but Moody's delayed\ndoing so until 14 March 2025. _The Economist_ ranked Greece the world's top\neconomic performer for 2022 and 2023, citing significant improvements in five\nkey economic and financial indicators. Tourism reached an all-time record in\n2023, with approximately 32 million tourists making Greece one of the most\nvisited countries in the world.",
    "openai_summarised_points": [
      "• The economy of Greece is classified as an advanced, high-income economy, ranking as the 50th-largest in the world with an annual nominal gross domestic product (GDP) of $267.348 billion.",
      "• In terms of purchasing power parity (PPP), Greece is the 54th-largest economy globally, with an annual output of $467.590 billion.",
      "• Greece is the 16th-largest economy within the European Union and the 11th-largest in the eurozone.",
      "• According to the International Monetary Fund's projections for 2025, Greece's GDP per capita is estimated at $25,756 at nominal value and $45,048 at PPP.",
      "• Greece is a welfare state, with social spending constituting 23.7% of GDP in 2024, ranking relatively high among OECD nations.",
      "• The Greek economy is predominantly service-based (80%), with industrial sectors accounting for 16%, and agriculture contributing approximately 4% of economic output in 2017.",
      "• Key industries include tourism and shipping, with Greece being a major global maritime nation; its Merchant Navy is the largest in the world, with Greek-owned vessels representing 21% of global deadweight tonnage as of 2021, and the fleet's capacity increasing by 45.8% since 2014.",
      "• Greece attracted 31.3 million international tourists in 2019, making it the 7th most-visited country in the European Union and 13th worldwide, up from 18 million tourists in 2013.",
      "• The country has a significant agricultural sector within the EU and is the largest economy in Southeast Europe.",
      "• Greece was the largest foreign investor in Albania in 2013, and also a major investor in Bulgaria, Romania, Serbia, and North Macedonia, with the telecommunications company OTE making notable investments across Southeast Europe.",
      "• Greece has the largest Greek Merchant Navy globally, with increased demand for maritime transportation between Greece and Asia leading to substantial investments in shipping infrastructure.",
      "• The country is a significant agricultural producer within the EU and a regional investor, with Greece being a key trading partner and foreign investor in neighboring Balkan countries.",
      "• Greece was a founding member of the Organisation for Economic Co-operation and Development (OECD) and the Organization of the Black Sea Economic Cooperation (BSEC).",
      "• Greece joined the European Union in 1981 and adopted the euro as its currency in 2001, replacing the Greek drachma at an exchange rate of 340.75 drachmae per euro.",
      "• The country is a member of the International Monetary Fund and the World Trade Organization, and ranked 34th on Ernst & Young's Globalization Index in 2011.",
      "• Historically, WWII devastated Greece's economy, but the post-1950 to 1980 period experienced rapid growth known as the Greek economic miracle.",
      "• Greece experienced high GDP growth rates in the early 2000s, peaking at 6.4% in 2006, but was severely impacted by the Great Recession and the Greek debt crisis, with GDP contracting sharply from 2009 to 2013, reaching -9.9% in 2011.",
      "• In 2011, Greece's government debt reached €356 billion, equivalent to 172% of its nominal GDP.",
      "• Following a major debt restructuring involving private sector losses of approximately €100 billion, Greece reduced its sovereign debt to €280 billion, or 137% of GDP, in early 2012.",
      "• Greece achieved a modest GDP growth of 0.8% in 2014 after five years of decline, but contracted again by 0.2% in 2015 and remained stagnant in 2016.",
      "• The economy experienced renewed growth of 1.5% in 2017, 2.1% in 2018, and 2.3% in 2019.",
      "• The COVID-19 pandemic caused a contraction of 9.2% in 2020, but the economy rebounded with growth rates of 8.7% in 2021, 5.7% in 2022, 2.3% in 2023, and 2.3% in 2024.",
      "• On 20 August 2022, Greece officially exited the EU's \"enhanced surveillance framework,\" which had been in place since the third bailout program concluded four years earlier.",
      "• On 2 December 2022, the credit rating agency Scope, based in Berlin, assigned a positive outlook to Greece's BB+ rating, indicating a potential return to investment grade.",
      "• Greece's investment-grade status was restored on 31 July 2023 by Japanese credit rating agency R&I, with subsequent upgrades by Scope, DBRS, S&P, and Fitch occurring between August and December 2023, although Moody's delayed until 14 March 2025.",
      "• The Economist ranked Greece as the world's top economic performer for 2022 and 2023, citing significant improvements in key economic and financial indicators.",
      "• Tourism reached an all-time record in 2023, with approximately 32 million tourists visiting Greece, making it one of the most visited countries globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:13:38.990145",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5365,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "| This section **appears to beslanted towards recent events.** Please try to\nkeep recent events in historical perspective and add more content related to\nnon-recent events. _( October 2011)_\n---|---\nExport of raisin from the port of Patras, late 19th century Historical GDP per\ncapita development\n\nThe evolution of the Greek economy during the 19th century (a period that\ntransformed a large part of the world because of the Industrial Revolution)\nhas been little researched. Recent research from 2006 examines the gradual\ndevelopment of industry and further development of shipping in a predominantly\nagricultural economy, calculating an average rate of per capita GDP growth\nbetween 1833 and 1911 that was only slightly lower than that of the other\nWestern European nations. Industrial activity, (including heavy industry like\nshipbuilding) was evident, mainly in Ermoupolis and Piraeus. Nonetheless,\nGreece faced economic hardships and defaulted on its external loans in 1843,\n1860 and 1893.\n\nOther studies support the above view on the general trends in the economy,\nproviding comparative measures of standard of living. The per capita income\n(in purchasing power terms) of Greece was 65% that of France in 1850, 56% in\n1890, 62% in 1938, 75% in 1980, 90% in 2007, 96.4% in 2008 and 97.9% in 2009.\n\nThe country's post-World War II development has largely been connected with\nthe Greek economic miracle. During that period, Greece saw growth rates second\nonly to those of Japan, while ranking first in Europe in terms of GDP growth.\nIt is indicative that between 1960 and 1973 the Greek economy grew by an\naverage of 7.7%, in contrast to 4.7% for the EU15 and 4.9% for the OECD. Also\nduring that period, exports grew by an average annual rate of 12.6%.",
    "openai_summarised_points": [
      "• The section appears to be biased towards recent events, and there is a suggestion to contextualize recent developments within a broader historical framework and include more non-recent historical content. (October 2011)",
      "• The export of raisins from the port of Patras in the late 19th century exemplifies Greece’s historical trade activities.",
      "• The historical GDP per capita development during the 19th century reflects Greece’s economic transformation amid the global impact of the Industrial Revolution.",
      "• Research from 2006 indicates that Greece experienced gradual industrial development and expansion of shipping in a predominantly agricultural economy during the 19th century.",
      "• The average per capita GDP growth rate between 1833 and 1911 was only slightly lower than that of other Western European countries, indicating relatively steady economic progress.",
      "• Industrial activity in Greece during this period included heavy industries such as shipbuilding, primarily concentrated in Ermoupolis and Piraeus.",
      "• Greece faced multiple economic hardships in the 19th century, including defaulting on external loans in the years 1843, 1860, and 1893.",
      "• Comparative studies of living standards show that Greece’s per capita income (measured in purchasing power terms) was 65% of France’s in 1850, decreasing to 56% in 1890, then rising to 62% in 1938.",
      "• Post-World War II, Greece’s economic development is largely associated with the Greek economic miracle, a period of rapid growth.",
      "• During the Greek economic miracle, Greece’s growth rates were second only to Japan’s, and Greece ranked first in Europe in terms of GDP growth.",
      "• Between 1960 and 1973, Greece’s economy grew at an average annual rate of 7.7%, compared to 4.7% for the EU15 and 4.9% for the OECD.",
      "• During the same period, Greek exports increased at an average annual rate of 12.6%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:13:43.633482",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1755,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Strengths and weaknesses",
    "text": "Greece enjoys a high standard of living and very high Human Development Index,\nbeing ranked 32nd in the world in 2019. However, the severe recession of\nrecent years saw GDP per capita fall from 94% of the EU average in 2009 to 67%\nbetween 2017 and 2019. During the same period, Actual Individual Consumption\n(AIC) per capita fell from 104% to 78% of the EU average.\n\nGreece's main industries are tourism, shipping, industrial products, food and\ntobacco processing, textiles, chemicals, metal products, mining and petroleum.\nGreece's GDP growth has also, as an average, since the early 1990s been higher\nthan the EU average. However, the Greek economy continues to face significant\nproblems, including high unemployment levels, inefficient public sector\nbureaucracy, tax evasion, corruption and low global competitiveness.\n\nGreece is ranked 59th in the world, and 21st among EU member states, on the\nCorruption Perceptions Index. Thus, it has roughly returned to its ranking\nprior to the 2010–2018 debt crisis. However, Greece still has the EU's lowest\nIndex of Economic Freedom and second lowest Global Competitiveness Index,\nranking 113th and 59th in the world respectively.\n\nGDP growth rates of the Greek economy between 1961 and 2010\n\nAfter fourteen consecutive years of economic growth, Greece went into\nrecession in 2008. By the end of 2009, the Greek economy faced the highest\nbudget deficit and government debt-to-GDP ratio in the EU. After several\nupward revisions, the 2009 budget deficit is now estimated at 15.7% of GDP.\nThis, combined with rapidly rising debt levels (127.9% of GDP in 2009) led to\na precipitous increase in borrowing costs, effectively shutting Greece out of\nthe global financial markets and resulting in a severe economic crisis.\n\nGreece was accused of trying to cover up the extent of its massive budget\ndeficit during the 2008 financial crisis. The allegation was prompted by the\nmassive revision of the 2009 budget deficit forecast by the new PASOK\ngovernment elected in October 2009, from \"6–8%\" (estimated by the previous New\nDemocracy government) to 12.7% (later revised to 15.7%). However, the accuracy\nof the revised figures has also been questioned, and in February 2012 the\nHellenic Parliament voted in favor of an official investigation following\naccusations by a former member of the Hellenic Statistical Authority that the\ndeficit had been artificially inflated in order to justify harsher austerity\nmeasures.\n\nAverage GDP growth by era  1961–1970  | 8.44%\n---|---\n1971–1980  | 4.70%\n1981–1990  | 0.70%\n1991–2000  | 2.36%\n2001–2007  | 4.11%\n2008–2011  | −4.8%\n2012–2015  | −2.52%\n2016-2019  | 1.05%\n2020-2022  | 1.78%\n\nThe Greek labor force, which amount around 5 million workers, average 2,032\nhours of work per worker annually in 2011, is ranked fourth among OECD\ncountries, after Mexico, South Korea and Chile. The Groningen Growth &\nDevelopment Centre has published a poll revealing that between 1995 and 2005,\nGreece was the country whose workers have the most hours/year work among\nEuropean nations; Greeks worked an average of 1,900 hours per year, followed\nby Spaniards (average of 1,800 hours/year).\n\nAs a result of the ongoing economic crisis, industrial production in the\ncountry went down by 8% between March 2010 and March 2011, The volume of\nbuilding activity saw a reduction of 73% in 2010. Additionally, the turnover\nin retail sales saw a decline of 9% between February 2010 and February 2011.\n\nBetween 2008 and 2013 unemployment skyrocketed, from a generational low of\n7.2% in the second and third quarters of 2008 to a high of 27.9% in June 2013,\nleaving over a million jobless. Youth unemployment peaked at 64.9% in May\n2013. Unemployment figures have steadily improved in recent years, with the\noverall rate falling to 8.3% in April 2025 and youth unemployment dropping to\n16.1% in September 2024.",
    "openai_summarised_points": [
      "• Greece has a high standard of living and a very high Human Development Index, ranking 32nd in the world in 2019.",
      "• The country experienced a severe recession in recent years, causing GDP per capita to decline from 94% of the EU average in 2009 to 67% between 2017 and 2019.",
      "• During the same period, Actual Individual Consumption (AIC) per capita decreased from 104% to 78% of the EU average.",
      "• Greece's main industries include tourism, shipping, industrial products, food and tobacco processing, textiles, chemicals, metal products, mining, and petroleum.",
      "• Since the early 1990s, Greece's GDP growth has been higher than the EU average on average.",
      "• Despite this, Greece faces significant economic challenges such as high unemployment, inefficient public sector bureaucracy, tax evasion, corruption, and low global competitiveness.",
      "• Greece is ranked 59th in the world and 21st among EU member states on the Corruption Perceptions Index, roughly returning to its pre-2010–2018 debt crisis ranking.",
      "• Greece holds the EU's lowest Index of Economic Freedom and the second lowest Global Competitiveness Index, ranking 113th and 59th globally respectively.",
      "• Between 1961 and 2010, Greece experienced various GDP growth rates, with an average of 8.44% during 1961–1970, and a decline to negative growth during 2008–2011 at −4.8%.",
      "• Greece entered recession in 2008 after fourteen consecutive years of economic growth.",
      "• By the end of 2009, Greece had the highest budget deficit and government debt-to-GDP ratio in the EU, with the deficit estimated at 15.7% of GDP after revisions, and debt at 127.9% of GDP.",
      "• The rising debt levels and deficit led to increased borrowing costs, effectively excluding Greece from global financial markets and precipitating a severe economic crisis.",
      "• Greece was accused of attempting to conceal the extent of its budget deficit during the 2008 financial crisis, with the 2009 deficit forecast revised from 6–8% (by the previous government) to 12.7%, later revised to 15.7%.",
      "• An investigation was approved by the Hellenic Parliament in February 2012 following allegations that the deficit had been artificially inflated to justify austerity measures.",
      "• The average GDP growth rates by era are: 8.44% (1961–1970), 4.70% (1971–1980), 0.70% (1981–1990), 2.36% (1991–2000), 4.11% (2001–2007), −4.8% (2008–2011), −2.52% (2012–2015), 1.05% (2016–2019), and 1.78% (2020–2022).",
      "• Greece's labor force comprises approximately 5 million workers, who worked an average of 2,032 hours annually in 2011, ranking fourth among OECD countries after Mexico, South Korea, and Chile.",
      "• A poll by the Groningen Growth & Development Centre indicated that between 1995 and 2005, Greece had the highest average annual working hours among European nations at 1,900 hours, followed by Spain at 1,800 hours.",
      "• The ongoing economic crisis caused industrial production to decline by 8% between March 2010 and March 2011.",
      "• Building activity volume decreased by 73% in 2010, and retail sales turnover fell by 9% between February 2010 and February 2011.",
      "• Unemployment rose sharply from 7.2% in the second and third quarters of 2008 to 27.9% in June 2013, leaving over one million people unemployed.",
      "• Youth unemployment peaked at 64.9% in May 2013.",
      "• Recent trends show unemployment decreasing to 8.3% in April 2025 overall, and youth unemployment falling to 16.1% in September 2024."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:13:56.024107",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3860,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Eurozone entry",
    "text": "Average Public Debt-to-GDP\n(1909–2008)  Country  | Average Public\nDebt-to-GDP (% of GDP)\n---|---\nUnited Kingdom  | 104.7\nBelgium  | 86.0\nItaly  | 76.0\nCanada  | 71.0\nFrance  | 62.6\nGreece  | 60.2\nUnited States  | 47.1\nGermany  | 32.1\nGreece entered the Eurozone in 2001\n\nGreece was accepted into the Economic and Monetary Union of the European Union\nby the European Council on 19 June 2000, based on a number of criteria\n(inflation rate, budget deficit, public debt, long-term interest rates,\nexchange rate) using 1999 as the reference year. After an audit commissioned\nby the incoming New Democracy government in 2004, Eurostat revealed that the\nstatistics for the budget deficit had been under-reported. However, even after\nall corrections that followed, the reference year budget deficit did not\nexceed the allowable upper limit (3%) according to the Eurostat accounting\nmethod in force at the time of application, and thus Greece had still met all\ncritiera for Eurozone entry (details given below).\n\nMost of the differences in the revised budget deficit numbers were due to a\ntemporary change of accounting practices by the new government, i.e.,\nrecording expenses when military material was ordered rather than received.\nHowever, it was the retroactive application of ESA95 methodology (applied\nsince 2000) by Eurostat, that finally raised the reference year (1999) budget\ndeficit to 3.38% of GDP, thus exceeding the 3% limit. This led to claims that\nGreece (similar claims have been made about other European countries like\nItaly) had not actually met all five accession criteria, and the common\nperception that Greece entered the Eurozone through \"falsified\" deficit\nnumbers.\n\nIn the 2005 OECD report for Greece, it was clearly stated that \"the impact of\nnew accounting rules on the fiscal figures for the years 1997 to 1999 ranged\nfrom 0.7 to 1 percentage point of GDP; this retroactive change of methodology\nwas responsible for the revised deficit exceeding 3% in 1999, the year of\n[Greece's] EMU membership qualification\". The above led the Greek minister of\nfinance to clarify that the 1999 budget deficit was below the prescribed 3%\nlimit when calculated with the ESA79 methodology in force at the time of\nGreece's application, and thus the criteria had been met.\n\nThe original accounting practice for military expenses was later restored in\nline with Eurostat recommendations, theoretically lowering even the\nESA95-calculated 1999 Greek budget deficit to below 3% (an official Eurostat\ncalculation is still pending for 1999).\n\nAn error sometimes made is the confusion of discussion regarding Greece's\nEurozone entry with the controversy regarding usage of derivatives' deals with\nU.S. Banks by Greece and other Eurozone countries to artificially reduce their\nreported budget deficits. A currency swap arranged with Goldman Sachs allowed\nGreece to \"hide\" 2.8 billion Euros of debt, however, this affected deficit\nvalues after 2001 (when Greece had already been admitted into the Eurozone)\nand is not related to Greece's Eurozone entry.\n\nA study of the period 1999–2009 by forensic accountants has found that data\nsubmitted to Eurostat by Greece, among other countries, had a statistical\ndistribution indicative of manipulation; \"Greece with a mean value of 17.74,\nshows the largest deviation from Benford's law among the members of the\neurozone, followed by Belgium with a value of 17.21 and Austria with a value\nof 15.25\".",
    "openai_summarised_points": [
      "• The average public debt-to-GDP ratios from 1909 to 2008 for selected countries were as follows: United Kingdom at 104.7%, Belgium at 86.0%, Italy at 76.0%, Canada at 71.0%, France at 62.6%, Greece at 60.2%, United States at 47.1%, and Germany at 32.1%.",
      "• Greece officially entered the Eurozone in 2001, becoming a member of the Economic and Monetary Union of the European Union.",
      "• Greece was accepted into the EMU by the European Council on 19 June 2000, based on criteria including inflation rate, budget deficit, public debt, long-term interest rates, and exchange rate, using 1999 as the reference year.",
      "• In 2004, an audit commissioned by Greece’s new government (New Democracy) revealed that Eurostat had under-reported Greece’s budget deficit figures.",
      "• Despite corrections, Greece’s 1999 budget deficit, after applying the ESA95 methodology, was revised to 3.38% of GDP, exceeding the 3% limit, which raised concerns about the accuracy of Greece’s Eurozone entry data.",
      "• The primary reason for the revised deficit figures was a change in accounting practices by the Greek government, notably recording military expenses upon ordering rather than receipt.",
      "• The retroactive application of the ESA95 methodology by Eurostat was responsible for increasing the 1999 deficit to 3.38%, thus surpassing the 3% threshold, leading to claims that Greece had not fully met all five accession criteria.",
      "• There was a perception that Greece’s entry into the Eurozone involved \"falsified\" deficit numbers, similar to claims made about other countries like Italy.",
      "• The 2005 OECD report clarified that the impact of the new accounting rules on Greece’s fiscal figures from 1997 to 1999 ranged from 0.7 to 1 percentage point of GDP, and the revised deficit exceeded 3% only after applying the ESA95 methodology.",
      "• Greece’s finance minister clarified that when using the ESA79 methodology, which was in force at the time of application, the 1999 deficit was below 3%, indicating Greece met the criteria.",
      "• The original accounting practice for military expenses was later restored in line with Eurostat recommendations, which would theoretically lower Greece’s 1999 deficit below 3% when recalculated under ESA95, although an official Eurostat calculation for 1999 remains pending.",
      "• A common misconception is confusing Greece’s Eurozone entry criteria with the controversy over Greece and other countries using derivatives deals with U.S. banks, such as Goldman Sachs, to artificially reduce reported deficits; Greece’s use of a currency swap with Goldman Sachs to hide 2.8 billion Euros of debt affected deficit figures after 2001 and is unrelated to the initial Eurozone accession.",
      "• Forensic analysis of data submitted to Eurostat from 1999–2009 found that Greece’s statistical data had a distribution indicative of manipulation, with Greece showing the largest deviation from Benford’s law among Eurozone members, with a mean value of 17.74, followed by Belgium at 17.21 and Austria at 15.25."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:05.038347",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3435,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.3",
    "section_name": "2010–2018 government debt crisis",
    "text": "Greece's debt percentage since 1977, compared to the average of the Eurozone",
    "openai_summarised_points": [
      "• Since 1977, Greece's government debt as a percentage of GDP has consistently exceeded the Eurozone average, reflecting persistent fiscal challenges.",
      "• The debt-to-GDP ratio in Greece has experienced significant fluctuations over the decades, often surpassing 100%, indicating high levels of public indebtedness relative to economic output.",
      "• During the period leading up to the 2010–2018 government debt crisis, Greece's debt ratio markedly increased, reaching approximately 146% of GDP in 2011, one of the highest levels among Eurozone countries.",
      "• The Eurozone average debt-to-GDP ratio during this period remained substantially lower, generally below 80%, highlighting Greece's comparatively severe debt burden.",
      "• The elevated debt levels contributed to Greece's financial instability, leading to multiple bailout programs and austerity measures imposed by the European Union and International Monetary Fund.",
      "• The crisis period from 2010 to 2018 was characterized by severe economic contraction, high unemployment, and austerity policies aimed at stabilizing Greece's fiscal situation.",
      "• Despite some fiscal adjustments and economic reforms, Greece's debt-to-GDP ratio remained high, posing ongoing challenges to sustainable economic growth and fiscal sovereignty.",
      "• The persistent high debt levels since 1977 underscore Greece's long-term fiscal vulnerabilities relative to the broader Eurozone economic environment."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:09.027914",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 76,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.3.1",
    "section_name": "Historical Debt",
    "text": "Greece, like other European nations, had faced debt crises in the 19th\ncentury, as well as a similar crisis in 1932 during the Great Depression. In\ngeneral, however, during the 20th century it enjoyed one of the highest GDP\ngrowth rates on the planet (for a quarter century from the early 1950s to mid\n1970s, second in the world after Japan). Average Greek government debt-to-GDP\nfor the entire century before the crisis (1909–2008) was lower than that for\nthe UK, Canada, or France, while for the 30-year period (1952–1981) until\nentrance into the European Economic Community, the Greek government debt-to-\nGDP ratio averaged only 19.8%.\n\nBetween 1981 and 1993 Greece's government debt-to-GDP ratio steadily rose,\nsurpassing the average of what is today the Eurozone in the mid-1980s (see\nchart right). For the next 15 years, from 1993 to 2007 (i.e., before the 2008\nfinancial crisis), Greece's government debt-to-GDP ratio remained roughly\nunchanged (the value was not affected by the 2004 Athens Olympics), averaging\n102% - a value lower than that for Italy (107%) and Belgium (110%) during the\nsame 15-year period, and comparable to that for the U.S. or the OECD average\nin 2017.\n\nDuring the latter period, the country's annual budget deficit usually exceeded\n3% of GDP, but its effect on the debt-to-GDP ratio was counterbalanced by high\nGDP growth rates. The debt-to-GDP values for 2006 and 2007 (about 105%) were\nestablished after audits resulted in corrections according to Eurostat\nmethodology, of up to 10 percentage points for the particular years (as well\nas similar corrections for the years 2008 and 2009). These corrections,\nalthough altering the debt level by a maximum of about 10%, resulted in a\npopular notion that \"Greece was previously hiding its debt\".",
    "openai_summarised_points": [
      "• Greece experienced debt crises in the 19th century, similar to other European nations, and faced a significant crisis in 1932 during the Great Depression.",
      "• Throughout the 20th century, Greece enjoyed one of the highest GDP growth rates globally, notably from the early 1950s to the mid-1970s, during which it ranked second in the world after Japan.",
      "• The average Greek government debt-to-GDP ratio for the entire century prior to the financial crisis (1909–2008) was lower than that of the United Kingdom, Canada, or France.",
      "• During the 30-year period from 1952 to 1981, until Greece's entry into the European Economic Community, the country's government debt-to-GDP ratio averaged only 19.8%.",
      "• Between 1981 and 1993, Greece's government debt-to-GDP ratio steadily increased, surpassing the average of the Eurozone in the mid-1980s.",
      "• From 1993 to 2007, a span of 15 years before the 2008 financial crisis, Greece's debt-to-GDP ratio remained relatively stable, averaging approximately 102%.",
      "• During this period, Greece's debt-to-GDP ratio was lower than Italy's (107%) and Belgium's (110%), and was comparable to the United States and the OECD average in 2017.",
      "• Throughout the 1993–2007 period, Greece's annual budget deficit frequently exceeded 3% of GDP; however, high GDP growth rates mitigated the impact on the debt-to-GDP ratio.",
      "• The debt-to-GDP ratio for 2006 and 2007 was about 105%, but these figures were adjusted after audits based on Eurostat methodology, which introduced corrections of up to 10 percentage points for those years.",
      "• Similar corrections were applied to the years 2008 and 2009, which altered the debt figures by a maximum of approximately 10%.",
      "• These adjustments led to a popular perception that Greece had been concealing or \"hiding\" its debt prior to the corrections."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:15.171434",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1774,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.3.2",
    "section_name": "Evolution of the debt crisis",
    "text": "The Greek crisis was triggered by the turmoil of the Great Recession, which\nled the budget deficits of several Western nations to reach or exceed 10% of\nGDP. In Greece's case, the high budget deficit (which, after several\ncorrections, was revealed that it had been allowed to reach 10.2% and 15.1% of\nGDP in 2008 and 2009, respectively) was coupled with a high public debt to GDP\nratio (which, until then, was relatively stable for several years, at just\nabove 100% of GDP - as calculated after all corrections). Thus, the country\nappeared to lose control of its public debt to GDP ratio, which already\nreached 127% of GDP in 2009. In addition, being a member of the Eurozone, the\ncountry had essentially no autonomous monetary policy flexibility. Finally,\nthere was an effect of controversies about Greek statistics (due the\naforementioned drastic budget deficit revisions which lead to an increase in\nthe calculated value of the Greek public debt by about 10%, i.e., a public\ndebt to GDP of about 100% until 2007), while there have been arguments about a\npossible effect of media reports. Consequently, Greece was \"punished\" by the\nmarkets which increased borrowing rates, making impossible for the country to\nfinance its debt since early 2010, exacerbating the euro area crisis.\n\nThe Greek economy faced its most-severe crisis since the restoration of\ndemocracy in 1974 as the Greek government revised its deficit forecasts from\n3.7% in early 2009 and 6% in September 2009, to 12.7% of gross domestic\nproduct (GDP) in October 2009.\n\nThe aforementioned budget deficit and debt revisions were connected with\nfindings that, through the assistance of Goldman Sachs, JPMorgan Chase and\nnumerous other banks, financial products were developed which enabled the\ngovernments of Greece, Italy and many other European countries to hide parts\nof their borrowing. Dozens of similar agreements were concluded across Europe\nwhereby banks supplied cash in advance in exchange for future payments by the\ngovernments involved; in turn, the liabilities of the involved countries were\n\"kept off the books\".\n\nAccording to _Der Spiegel_ , credits given to European governments were\ndisguised as \"swaps\" and consequently did not get registered as debt because\nEurostat at the time ignored statistics involving financial derivatives. A\nGerman derivatives dealer had commented to _Der Spiegel_ that \"The Maastricht\nrules can be circumvented quite legally through swaps,\" and \"In previous\nyears, Italy used a similar trick to mask its true debt with the help of a\ndifferent US bank.\" These conditions had enabled Greek as well as many other\nEuropean governments to spend beyond their means, while meeting the deficit\ntargets of the European Union and the monetary union guidelines. In May 2010,\nthe Greek government deficit was again revised and estimated to be 13.6% which\nwas among the highest relative to GDP, with Iceland in first place at 15.7%\nand the United Kingdom third with 12.6%.[_dubious – discuss_] Public debt was\nforecast, according to some estimates, to hit 120% of GDP during 2010.\n\nGreek bonds\n\n20 year\n\n15 year\n\n10 year\n\n5 year\n\n1 year\n\n3 month\n\n1 month\n\nAs a consequence, there was a crisis in international confidence in Greece's\nability to repay its sovereign debt, as reflected by the rise of the country's\nborrowing rates (although their slow rise – the 10-year government bond yield\nonly exceeded 7% in April 2010 – coinciding with a large number of negative\narticles, has led to arguments about the role of international news media in\nthe evolution of the crisis). In order to avert a default (as high borrowing\nrates effectively prohibited access to the markets), in May 2010 the other\nEurozone countries, and the IMF, agreed to a \"rescue package\" which involved\ngiving Greece an immediate €45 billion in bail-out loans, with more funds to\nfollow, totaling €110 billion. In order to secure the funding, Greece was\nrequired to adopt harsh austerity measures to bring its deficit under control.\nTheir implementation was to be monitored and evaluated by the European\nCommission, the European Central Bank and the IMF.\n\nThe 2008 financial crisis – particularly the austerity package put forth by\nthe EU and the IMF – has been met with anger by the Greek public, leading to\nriots and social unrest, while there have been theories about the effect of\ninternational media. Despite - others say because of - the long range of\nausterity measures, the government deficit has not been reduced accordingly,\nmainly, according to many economists, because of the subsequent recession.\n\nPublic sector workers have come out on strike in order to resist job cuts and\nreductions to salaries as the government promises that a large scale\nprivatisation programme will be accelerated. Immigrants are sometimes treated\nas scapegoats for economic problems by far-right extremists.\n\nIn 2013, Greece became the first developed market to be reclassified as an\nemerging market by different financial rating companies.\n\nBy July 2014 there were still anger and protests about the austerity measures,\nwith a 24-hour strike among government workers timed to coincide with an audit\nby inspectors from the International Monetary Fund, the European Union and\nEuropean Central Bank in advance of a decision on a second bailout of one\nbillion euros ($1.36 billion), due in late July.\n\nGreece exited its six-year recession in the second quarter of 2014, but the\nchallenges of securing political stability and debt sustainability remained.\n\nA third bailout was agreed in July 2015, after a confrontation with the newly\nelected leftist government of Alexis Tsipras. In June 2017, news reports\nindicated that the \"crushing debt burden\" had not been alleviated and that\nGreece was at the risk of defaulting on some payments. The International\nMonetary Fund stated that the country should be able to borrow again \"in due\ncourse\". At the time, the Euro zone gave Greece another credit of\n$9.5-billion, $8.5 billion of loans and brief details of a possible debt\nrelief with the assistance of the IMF. On 13 July, the Greek government sent a\nletter of intent to the IMF with 21 commitments it promised to meet by June\n2018. They included changes in labour laws, a plan to cap public sector work\ncontracts, to transform temporary contracts into permanent agreements and to\nrecalculate pension payments to reduce spending on social security.\n\nGreece's bailouts successfully ended (as declared) on 20 August 2018.",
    "openai_summarised_points": [
      "• The Greek debt crisis was triggered by the broader turmoil of the Great Recession, which caused several Western nations' budget deficits to reach or exceed 10% of GDP.",
      "• In Greece, the budget deficit reached 10.2% of GDP in 2008 and 15.1% in 2009 after several corrections, indicating a severe fiscal imbalance.",
      "• Greece's public debt-to-GDP ratio was relatively stable for years, just above 100%, but it was revised to about 100% due to drastic deficit revisions; by 2009, it had surged to 127% of GDP.",
      "• As a member of the Eurozone, Greece lacked autonomous monetary policy flexibility, limiting its ability to respond independently to economic shocks.",
      "• Controversies surrounding Greek statistical data, including significant deficit revisions that increased the public debt-to-GDP ratio by approximately 10%, contributed to market distrust; prior to 2007, Greece's debt was about 100%.",
      "• Media reports and statistical revisions led to market punishment, with increased borrowing rates making it impossible for Greece to finance its debt from early 2010, exacerbating the euro area crisis.",
      "• Greece's economy faced its most severe crisis since the restoration of democracy in 1974, with deficit forecasts revised from 3.7% in early 2009 and 6% in September 2009 to 12.7% of GDP in October 2009.",
      "• The deficit revisions were linked to financial products developed with the assistance of Goldman Sachs, JPMorgan Chase, and other banks, which enabled Greek and other European governments to hide parts of their borrowing.",
      "• Multiple European countries used similar financial arrangements, where banks provided cash in advance in exchange for future payments, keeping liabilities \"off the books.\"",
      "• _Der Spiegel_ reported that credits to European governments were disguised as \"swaps,\" which did not register as debt because Eurostat ignored financial derivatives; a German derivatives dealer noted that \"The Maastricht rules can be circumvented quite legally through swaps,\" with Italy having used similar tricks.",
      "• These practices allowed Greece and other European governments to spend beyond their means while meeting EU deficit targets and monetary union guidelines.",
      "• In May 2010, Greece's deficit was revised again to 13.6%, ranking among the highest relative to GDP, with Iceland at 15.7% and the UK at 12.6%; public debt was forecasted to reach 120% of GDP during 2010.",
      "• The crisis in confidence was reflected by rising borrowing rates; the 10-year government bond yield exceeded 7% in April 2010, although the slow increase led to debates about the influence of international media on the crisis.",
      "• To prevent default, in May 2010, the Eurozone countries and the IMF agreed on a rescue package providing Greece with an immediate €45 billion bailout, with total funds reaching €110 billion, contingent on austerity measures.",
      "• Greece was required to implement harsh austerity measures monitored by the European Commission, the European Central Bank, and the IMF to control its deficit.",
      "• The 2008 financial crisis and subsequent austerity measures sparked widespread public anger, riots, and social unrest in Greece, with some theories attributing the unrest to international media influence.",
      "• Many economists argued that austerity measures failed to reduce the deficit significantly due to the recession they induced.",
      "• Public sector workers protested through strikes against job cuts and salary reductions, amid government plans to accelerate privatization.",
      "• Immigrants were sometimes scapegoated by far-right extremists for Greece’s economic problems.",
      "• In 2013, Greece became the first developed market to be reclassified as an emerging market by various financial rating agencies.",
      "• By July 2014, protests and anger persisted over austerity, including a 24-hour strike by government workers during an IMF, EU, and ECB inspection prior to a second bailout decision of €1 billion ($1.36 billion).",
      "• Greece exited its six-year recession in Q2 2014, but challenges related to political stability and debt sustainability remained.",
      "• A third bailout was agreed upon in July 2015 after confrontation with the newly elected leftist government of Alexis Tsipras.",
      "• In June 2017, reports indicated Greece’s \"crushing debt burden\" persisted, with risks of default; the IMF stated Greece should be able to borrow again \"in due course.\"",
      "• The Eurozone provided Greece with an additional credit of $9.5 billion (€8.5 billion), including loans and potential debt relief measures involving the IMF.",
      "• On 13 July 2017, Greece sent a letter of intent to the IMF with 21 commitments, including reforms in labor laws, public sector employment, and pension recalculations, to be fulfilled by June 2018.",
      "• Greece’s bailout programs were declared successfully concluded on 20 August 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:34.016206",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 6469,
      "bullet_points_count": 27
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.3.3",
    "section_name": "Effects of the bailout programmes on the debt crisis",
    "text": "There was a 25% drop in Greece's GDP, connected with the bailout programmes.\nThis had a critical effect: the Debt-to-GDP ratio, the key factor defining the\nseverity of the crisis, would jump from its 2009 level of 127% to about 170%,\nsolely due to the GDP drop (i.e., for the same Debt). Such a level is\nconsidered unsustainable. Reports show that, for government debt, the\nthreshold for unhealthy Debt-to-GDPT ratio is around 85%. In a 2013 report,\nthe IMF admitted that it had underestimated the effects of so extensive tax\nhikes and budget cuts on the country's GDP and issued an informal apology.",
    "openai_summarised_points": [
      "• Greece's GDP experienced a 25% decline, which was directly associated with the implementation of bailout programmes.",
      "• This significant reduction in GDP had a critical impact on Greece's debt metrics, specifically causing the Debt-to-GDP ratio to increase markedly.",
      "• The Debt-to-GDP ratio, a key indicator of the severity of the debt crisis, was 127% in 2009; due solely to the GDP decline, it was projected to rise to approximately 170%.",
      "• The increase in the Debt-to-GDP ratio from 127% to about 170% was driven entirely by the decrease in GDP, assuming the debt level remained constant.",
      "• A Debt-to-GDP ratio of around 170% is considered unsustainable for Greece's economy.",
      "• Reports indicate that the threshold for an unhealthy or unsustainable government debt-to-GDP ratio is approximately 85%.",
      "• In a 2013 report, the International Monetary Fund (IMF) acknowledged that it had underestimated the negative effects of extensive tax hikes and austerity measures on Greece’s GDP.",
      "• The IMF issued an informal apology for its earlier miscalculations regarding the economic impact of the bailout policies."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:37.804387",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 600,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.4",
    "section_name": "COVID-19 recession",
    "text": "The COVID-19 pandemic significantly impacted all sectors of the Greek economy,\nand tourism in particular. As a result, GDP shrank by 9.2% in 2020, but\nrebounded by 8.7% in 2021, 5.7% in 2022, 2.3% in 2023 and 2.3% in 2024. In\nJune 2021, the European Commission agreed to disburse approximately 30 billion\nEuros in COVID-19 related economic aid (12 billion in loans and 18 billion in\ngrants).",
    "openai_summarised_points": [
      "• The COVID-19 pandemic had a profound impact on all sectors of the Greek economy, with tourism being particularly affected.",
      "• Greece's Gross Domestic Product (GDP) contracted by 9.2% in 2020 due to the pandemic's economic disruptions.",
      "• Following the contraction, Greece experienced a strong economic rebound with GDP increasing by 8.7% in 2021.",
      "• The recovery continued with GDP growth of 5.7% in 2022.",
      "• In 2023, Greece's GDP grew by 2.3%, maintaining a positive growth trajectory.",
      "• The GDP growth rate remained at 2.3% in 2024, indicating ongoing economic recovery.",
      "• In June 2021, the European Commission approved a disbursement of approximately 30 billion Euros to Greece as COVID-19 related economic aid.",
      "• The aid package consisted of 12 billion Euros in loans and 18 billion Euros in grants to support Greece's economic recovery efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:40.259297",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 391,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.5",
    "section_name": "Current Greek economy",
    "text": "In 2024, the Greek economy is forecast to grow nearly 3%, meaning it\napproaches its pre-crisis size of 2009 and far outpacing the euro zone average\neconomic growth of 0.8%.",
    "openai_summarised_points": [
      "• In 2024, the Greek economy is forecast to grow by approximately 3%, indicating a significant recovery trajectory.",
      "• This growth projection suggests that Greece's economy will approach its pre-crisis size as of 2009.",
      "• The anticipated growth rate of nearly 3% notably exceeds the euro zone average economic growth rate of 0.8% for the same period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:41.900256",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 172,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.6",
    "section_name": "Agriculture and fishery",
    "text": "* A vineyard in Naoussa, central Macedonia\n\n* Sacks with Fava Santorinis\n\n* Olive oil production\n\nIn 2010, Greece was the European Union's largest producer of cotton (183,800\ntons) and pistachios (8,000 tons) and ranked second in the production of rice\n(229,500 tons) and olives (147,500 tons), third in the production of figs\n(11,000 tons) and almonds (44,000 tons), tomatoes (1,400,000 tons) and\nwatermelons (578,400 tons) and fourth in the production of tobacco (22,000\ntons). Agriculture contributes 3.8% of the country's GDP and employs 12.4% of\nthe country's labor force.\n\nGreece is a major beneficiary of the Common Agricultural Policy of the\nEuropean Union. As a result of the country's entry to the European Community,\nmuch of its agricultural infrastructure has been upgraded and agricultural\noutput increased. Between 2000 and 2007 organic farming in Greece increased by\n885%, the highest change percentage in the EU.\n\nIn 2007, Greece accounted for 19% of the EU's fishing haul in the\nMediterranean Sea, ranked third with 85,493 tons, and ranked first in the\nnumber of fishing vessels in the Mediterranean between European Union members.\nAdditionally, the country ranked 11th in the EU in total quantity of fish\ncaught, with 87,461 tons.\n\nIn September 2023, the main agricultural production was severely affected by a\ndeadly flood in the Thessaly region, with estimated losses of 3.7 billion.",
    "openai_summarised_points": [
      "• The section features images of a vineyard in Naoussa, located in central Macedonia, and sacks containing Fava Santorinis, highlighting notable Greek agricultural products.",
      "• Olive oil production is a significant aspect of Greece's agriculture, emphasizing the country's long-standing tradition in olive cultivation.",
      "• In 2010, Greece was the European Union's leading producer of cotton, with a total output of 183,800 tons.",
      "• Greece also led the EU in pistachio production, yielding 8,000 tons in 2010.",
      "• The country ranked second in the EU for rice production, with a total of 229,500 tons in 2010.",
      "• Greece was the second-largest producer of olives within the EU in 2010, with an output of 147,500 tons.",
      "• It ranked third in the EU for fig production, producing 11,000 tons, and for almonds, with 44,000 tons.",
      "• Greece also ranked third in tomato production, with 1,400,000 tons, and watermelon production, totaling 578,400 tons in 2010.",
      "• The country was fourth in the EU for tobacco production, with 22,000 tons.",
      "• Agriculture contributed approximately 3.8% to Greece's gross domestic product (GDP) and employed about 12.4% of the national labor force.",
      "• Greece is a major beneficiary of the European Union’s Common Agricultural Policy, which has facilitated significant upgrades to its agricultural infrastructure and increased output.",
      "• Following Greece’s accession to the European Community, agricultural development was notably enhanced.",
      "• Between 2000 and 2007, organic farming in Greece increased by 885%, representing the highest growth percentage in the EU during that period.",
      "• In 2007, Greece accounted for 19% of the EU’s total fishing haul in the Mediterranean Sea, with a catch of 85,493 tons, ranking third among EU countries.",
      "• Greece had the highest number of fishing vessels among EU Mediterranean nations.",
      "• The country ranked 11th in the EU for total fish caught, with a total of 87,461 tons.",
      "• In September 2023, a severe flood in the Thessaly region caused extensive damage to agricultural production, with estimated losses amounting to 3.7 billion euros."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:48.965487",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1403,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.7",
    "section_name": "Industry",
    "text": "Karelia Tobacco Company factory in Kalamata\n\nBetween 2005 and 2011, Greece has had the highest percentage increase in\nindustrial output compared to 2005 levels out of all European Union members,\nwith an increase of 6%. Eurostat statistics show that the industrial sector\nwas hit by the Greek government-debt crisis throughout 2009 and 2010, with\ndomestic output decreasing by 5.8% and industrial production in general by\n13.4%. Currently, Greece is ranked third in the European Union in the\nproduction of marble (over 920,000 tons), after Italy and Spain.\n\nBetween 1999 and 2008, the volume of retail trade in Greece increased by an\naverage of 4.4% per year (a total increase of 44%), while it decreased by\n11.3% in 2009. The only sector that did not see negative growth in 2009 was\nadministration and services, with a marginal growth of 2.0%.\n\nIn 2009, Greece's labor productivity was 98% that of the EU average, but its\nproductivity-per-hour-worked was 74% that the Eurozone average. The largest\nindustrial employer in the country (in 2007) was the manufacturing industry\n(407,000 people), followed by the construction industry (305,000) and mining\n(14,000).\n\nGreece has a significant shipbuilding and ship maintenance industry. The six\nshipyards around the port of Piraeus are among the largest in Europe. In\nrecent years, Greece has become a leader in the construction and maintenance\nof luxury yachts.\n\n* HSY-55-class gunboat _Polemistis_ , built by Hellenic Shipyards Co. for the Hellenic Navy\n\n* The fuselage for the Dassault nEUROn stealth jet is produced in Greece by the Hellenic Aerospace Industry",
    "openai_summarised_points": [
      "• Between 2005 and 2011, Greece experienced the highest percentage increase in industrial output among all European Union member states, with a growth rate of 6% relative to 2005 levels.",
      "• Eurostat statistics indicate that the Greek industrial sector was significantly impacted by the Greek government-debt crisis during 2009 and 2010, resulting in a domestic output decline of 5.8% and an overall industrial production decrease of 13.4%.",
      "• Greece is currently ranked third in the European Union for marble production, with an annual output exceeding 920,000 tons, following Italy and Spain.",
      "• From 1999 to 2008, the volume of retail trade in Greece increased at an average annual rate of 4.4%, totaling a 44% increase over the period; however, in 2009, retail trade decreased by 11.3%.",
      "• The only sector in Greece that did not experience negative growth in 2009 was administration and services, which grew marginally by 2.0%.",
      "• In 2009, Greece's labor productivity was 98% of the EU average, but productivity per hour worked was only 74% of the Eurozone average.",
      "• The largest industrial employer in Greece in 2007 was the manufacturing industry, employing 407,000 people, followed by the construction industry with 305,000 employees, and mining, which employed 14,000.",
      "• Greece maintains a significant shipbuilding and ship maintenance industry, with six major shipyards located around the port of Piraeus, among the largest in Europe.",
      "• In recent years, Greece has become a leader in the construction and maintenance of luxury yachts.",
      "• The HSY-55-class gunboat _Polemistis_ was built by Hellenic Shipyards Co. for the Hellenic Navy.",
      "• The fuselage for the Dassault nEUROn stealth jet is produced in Greece by the Hellenic Aerospace Industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:54.495503",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1608,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.8",
    "section_name": "Mining",
    "text": "* Aluminium of Greece facilities\n\n* Gold mine in Thasos\n\n* Gerakini mine\n\n* Skouries mine\n\n* Marble quarry in Sifnos\n\n* Calcium carbonate loaded at the port of Argostoli",
    "openai_summarised_points": [
      "• Aluminium of Greece operates facilities dedicated to the processing and production of aluminum, contributing significantly to Greece's mining sector and industrial economy.",
      "• Greece possesses a gold mine located on the island of Thasos, which is notable for its gold extraction activities and has been historically significant for the country's mineral resources.",
      "• The Gerakini mine is another important mining site in Greece, primarily extracting minerals such as baryte and other industrial minerals, playing a vital role in the country's mineral output.",
      "• The Skouries mine is a prominent mining project in Greece, involving the extraction of gold and copper; it has been subject to environmental and economic discussions due to its scale and impact.",
      "• Greece features a marble quarry in Sifnos, renowned for its high-quality marble production, which has been historically significant and contributes to Greece’s reputation in the global stone industry.",
      "• Calcium carbonate is loaded at the port of Argostoli, indicating the presence of calcium carbonate mining and export activities, with the port serving as a key point for mineral export logistics."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:14:58.285835",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 169,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.9",
    "section_name": "Maritime industry",
    "text": "The Port of Thessaloniki Neorion shipyard, located in Ermoupolis 23.2% of the\nworld's total merchant fleet is owned by Greek companies[_citation needed_],\nmaking it the largest in the world. They are ranked in the top 5 for all kinds\nof ships, including first for tankers and bulk carriers.\n\nShipping has traditionally been a key sector in the Greek economy since\nancient times. In 1813, the Greek merchant navy was made up of 615 ships. Its\ntotal tonnage was 153,580 tons and was manned with 37,526 crewmembers and\n5,878 cannons. In 1914 the figures stood at 449,430 tons and 1,322 ships (of\nwhich 287 were steam boats).\n\nDuring the 1960s, the size of the Greek fleet nearly doubled, primarily\nthrough the investment undertaken by the shipping magnates Onassis,\nVardinoyannis, Livanos and Niarchos. The basis of the modern Greek maritime\nindustry was formed after World War II when Greek shipping businessmen were\nable to amass surplus ships sold to them by the United States Government\nthrough the Ship Sales Act of the 1940s.\n\nGreece has the largest merchant navy in the world, accounting for more than\n15% of the world's total deadweight tonnage (dwt) according to the United\nNations Conference on Trade and Development. The Greek merchant navy's total\ndwt of nearly 245 million is comparable only to Japan's, which is ranked\nsecond with almost 224 million. Additionally, Greece represents 39.52% of all\nof the European Union's dwt. However, today's fleet roster is smaller than an\nall-time high of 5,000 ships in the late 1970s.\n\nGreece is ranked third in the world by number of ships, with 4,709, behind\nJapan, with 5,974, and China, which leads with 7,114 owned vessels. A European\nCommunity Shipowners' Associations report for 2011–2012 reveals that the Greek\nflag is the seventh-most-used internationally for shipping, while it ranks\nsecond in the EU.\n\nIn terms of ship categories, Greek companies have 22.6% of the world's tankers\nand 16.1% of the world's bulk carriers (in dwt). An additional equivalent of\n27.45% of the world's tanker dwt is on order, with another 12.7% of bulk\ncarriers also on order. Shipping accounts for an estimated 6% of Greek GDP,\nemploys about 160,000 people (4% of the workforce), and represents 1/3 of the\ncountry's trade deficit. Earnings from shipping amounted to €14.1 billion in\n2011, while between 2000 and 2010 Greek shipping contributed a total of €140\nbillion (half of the country's public debt in 2009 and 3.5 times the receipts\nfrom the European Union in the period 2000–2013). The 2011 ECSA report showed\nthat there are approximately 750 Greek shipping companies in operation.\n\nThe latest available data from the Union of Greek Shipowners show that \"the\nGreek-owned ocean-going fleet consists of 3,428 ships, totaling 245 million\ndeadweight tonnes in capacity. This equals 15.6 percent of the carrying\ncapacity of the entire global fleet, including 23.6 percent of the world\ntanker fleet and 17.2 percent of dry bulk\".\n\nCounting shipping as quasi-exports and in terms of monetary value, Greece\nranked 4th globally in 2011 having exported shipping services worth 17,704.132\nmillion $; only Denmark, Germany and South Korea ranked higher during that\nyear. Similarly counting shipping services provided to Greece by other\ncountries as quasi-imports and the difference between exports and imports as a\ntrade balance, Greece in 2011 ranked in the latter second behind Germany,\nhaving imported shipping services worth 7,076.605 million US$ and having run a\ntrade surplus of 10,712.342 million US$. In 2022, Greek used vessel sales were\nsecond only to China's.\n\n**Greece, shipping services** Year | 2000 | 2001 | 2002 | 2003 | 2004 | 2005 | 2006–2008 | 2009 | 2010 | 2011\n---|---|---|---|---|---|---|---|---|---|---\nExports:  |\nGlobal ranking  | 5th | 5th | 5th | 4th | 3rd | 5th | -b | 5th | 6th | 4th\nValue (US$ million)  | 7,558.995 | 7,560.559 | 7,527.175 | 10,114.736 | 15,402.209 | 16,127.623 | -b | 17,033.714 | 18,559.292 | 17,704.132\nValue (€ million)  | 8,172.559 | 8,432.670 | 7,957.654 | 8,934.660 | 12,382.636 | 12,949.869 | -b | 12,213.786 | 13,976.558 | 12,710.859\nValue (%GDP)  | 5.93 | 5.76 | 5.08 | 5.18 | 6.68 | 6.71 | n/a | 5.29 | 6.29 | 6.10\nImports:  |\nGlobal ranking  | 14th | 13th | 14th | -b | 14th | 16th | -b | 12th | 13th | 9th\nValue (US$ million)  | 3,314.718 | 3,873.791 | 3,757.000 | -b | 5,570.145 | 5,787.234 | -b | 6,653.395 | 7,846.950 | 7,076.605\nValue (€ million)  | 3,583.774 | 4,320.633 | 3,971.863 | -b | 4,478.129 | 4,646.929 | -b | 4,770.724 | 5,909.350 | 5,080.720\nValue (%GDP)  | 2.60 | 2.95 | 2.54 | n/a | 2.42 | 2.41 | n/a | 2.06 | 2.66 | 2.44\nTrade balance:  |\nGlobal ranking  | 1st | 2nd | 1st | 1ste | 1st | 1st | -b | 2nd | 1st | 2nd\nValue (US$ million)  | 4,244.277 | 3,686.768 | 3,770.175 | 10,114.736e | 9,832.064 | 10,340.389 | -b | 10,340.389 | 10,380.319  | 10,712.342\nValue (€ million)  | 4,588.785 | 4,112.037 | 3,985.791 | 8,934.660e | 7,904.508 | 8,302.940 | -b | 7,443.063 | 8,067.208 | 7,630.140\nValue (%GDP)  | 3.33 | 2.81 | 2.54 | 5.18e | 4.27 | 4.30 | n/a | 3.22 | 3.63 | 3.66\nGDP (€ million)  | 137,930.1 | 146,427.6 | 156,614.3 | 172,431.8 | 185,265.7 | 193,049.7b | n/a | 231,081.2p | 222,151.5p | 208,531.7p\n| **b** source reports break in time series; **p** source characterises data\nas provisional; **e** reported data may be erroneous because of relevant break\nin \"Imports\" time series",
    "openai_summarised_points": [
      "• The Port of Thessaloniki and the Neorion shipyard located in Ermoupolis are significant maritime infrastructure assets in Greece, with the latter being notable for its shipbuilding activities.",
      "• Greek companies own 23.2% of the world's total merchant fleet, making Greece's fleet the largest globally; Greece is ranked in the top 5 for all types of ships, including first place for tankers and bulk carriers.",
      "• Shipping has been a vital sector of the Greek economy since ancient times, with historical data indicating that in 1813, the Greek merchant navy comprised 615 ships with a total tonnage of 153,580 tons, manned by 37,526 crew members and armed with 5,878 cannons.",
      "• By 1914, the Greek merchant navy expanded to 449,430 tons across 1,322 ships, of which 287 were steam-powered vessels.",
      "• During the 1960s, the Greek fleet nearly doubled in size, primarily due to investments by prominent shipping magnates such as Aristotle Onassis, Vardinoyannis, the Livanos family, and the Niarchos family.",
      "• The modern Greek maritime industry was significantly shaped after World War II, facilitated by surplus ships sold to Greek shipping entrepreneurs by the U.S. Government under the Ship Sales Act of the 1940s.",
      "• Greece possesses the largest merchant navy in the world, accounting for over 15% of global deadweight tonnage (dwt), with a total of approximately 245 million dwt, second only to Japan's nearly 224 million dwt.",
      "• Greece's merchant fleet represents 39.52% of all European Union dwt.",
      "• The fleet size has decreased from a peak of about 5,000 ships in the late 1970s to its current smaller size.",
      "• Greece ranks third worldwide in the number of ships owned, with 4,709 vessels, behind Japan (5,974 ships) and China (7,114 ships).",
      "• According to the European Community Shipowners' Associations report for 2011–2012, the Greek-flagged ships are the seventh most used internationally and second within the EU.",
      "• Greek companies control 22.6% of the world's tankers and 16.1% of the world's bulk carriers by dwt; additionally, 27.45% of the world's tanker dwt and 12.7% of bulk carrier dwt are on order.",
      "• Shipping contributes approximately 6% to Greece's GDP, employs around 160,000 people (about 4% of the workforce), and accounts for one-third of Greece's trade deficit.",
      "• In 2011, earnings from shipping activities amounted to €14.1 billion.",
      "• From 2000 to 2010, Greek shipping contributed a total of €140 billion, which was half of Greece's public debt in 2009 and 3.5 times the receipts from the European Union during 2000–2013.",
      "• The Union of Greek Shipowners reports that the Greek-owned ocean-going fleet includes 3,428 ships with a total capacity of 245 million dwt, representing 15.6% of the global fleet capacity, including 23.6% of the world's tanker fleet and 17.2% of dry bulk ships.",
      "• Greece ranked 4th globally in shipping services exports in 2011, with a value of approximately $17.7 billion, behind Denmark, Germany, and South Korea.",
      "• In the same year, Greece imported shipping services worth about $7.08 billion, resulting in a trade surplus of approximately $10.71 billion, ranking second after Germany in trade balance for shipping services.",
      "• In 2022, Greek used vessel sales were the second largest globally, after China.",
      "• From 2000 to 2011, Greece's shipping exports fluctuated, ranking consistently around 4th or 5th globally, with export values rising from approximately $7.56 billion in 2000 to over $17.7 billion in 2011.",
      "• During the same period, shipping imports ranged from about $3.3 billion in 2000 to approximately $7.08 billion in 2011, with the trade surplus increasing correspondingly.",
      "• Greece's shipping trade balance consistently ranked first or second globally, with the surplus reaching over $10.7 billion in 2011.",
      "• The Greek shipping sector's contribution to the national GDP ranged from approximately 5% to over 6% during 2000–2011.",
      "• The total Greek GDP in euros increased from about €137.9 billion in 2000 to approximately €208.5 billion in 2011, with shipping trade values constituting a significant portion of economic activity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:06.067114",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5400,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.10",
    "section_name": "Telecommunications",
    "text": "OTE headquarters in Athens\n\nBetween 1949 and the 1980s, telephone communications in Greece were a state\nmonopoly by the Hellenic Telecommunications Organization, better known by its\nacronym, OTE. Despite the liberalization of telephone communications in the\ncountry in the 1980s, OTE still dominates the Greek market in its field and\nhas emerged as one of the largest telecommunications companies in Southeast\nEurope. Since 2011, the company's major shareholder is Deutsche Telekom with a\n40% stake, while the Greek state continues to own 10% of the company's shares.\nOTE owns several subsidiaries across in Southeast Europe, including Cosmote,\nGreece's top mobile telecommunications provider, Cosmote Romania and Albanian\nMobile Communications.\n\nOther mobile telecommunications companies active in Greece are Wind Hellas and\nVodafone Greece. The total number of active cellular phone accounts in the\ncountry in 2009 based on statistics from the country's mobile phone providers\nwas over 20 million, a penetration of 180%. Additionally, there are 5.745\nmillion active landlines in the country.\n\nGreece has tended to lag behind its European Union partners in terms of\nInternet use, with the gap closing rapidly in recent years. The percentage of\nhouseholds with Internet access more than doubled between 2006 and 2013, from\n23% to 56% respectively (compared with an EU average of 49% and 79%). At the\nsame time, there was a massive increase in the proportion of households with a\nbroadband connection, from 4% in 2006 to 55% in 2013 (compared with an EU\naverage of 30% and 76%). By 2023, the percentage of Greek households with\nInternet access had reached 86.9%.",
    "openai_summarised_points": [
      "• Between 1949 and the 1980s, telephone communications in Greece were operated as a state monopoly by the Hellenic Telecommunications Organization, commonly known as OTE.",
      "• Despite the liberalization of the telecommunications sector in Greece during the 1980s, OTE has continued to dominate the Greek market and has grown to become one of the largest telecommunications companies in Southeast Europe.",
      "• Since 2011, Deutsche Telekom has been the major shareholder of OTE, holding a 40% stake in the company.",
      "• The Greek state retains ownership of 10% of OTE's shares.",
      "• OTE owns several subsidiaries across Southeast Europe, including Cosmote, Greece's leading mobile telecommunications provider, as well as Cosmote Romania and Albanian Mobile Communications.",
      "• Other active mobile telecommunications providers in Greece include Wind Hellas and Vodafone Greece.",
      "• In 2009, the total number of active cellular phone accounts in Greece exceeded 20 million, representing a penetration rate of 180%.",
      "• Greece had approximately 5.745 million active landline telephone connections in 2009.",
      "• Greece has historically lagged behind its European Union counterparts in Internet usage, but the gap has been narrowing rapidly in recent years.",
      "• The percentage of Greek households with Internet access increased from 23% in 2006 to 56% in 2013, whereas the EU average was 49% in 2013.",
      "• The proportion of Greek households with broadband connections grew significantly from 4% in 2006 to 55% in 2013, compared to the EU averages of 30% and 76% respectively.",
      "• By 2023, the percentage of Greek households with Internet access had risen to 86.9%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:10.263871",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1661,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "1.11",
    "section_name": "Tourism",
    "text": "Porto Carras resort, Chalkidiki The island of Santorini, popular tourist\ndestination.\n\nTourism in the modern sense only started to flourish in Greece in the years\npost-1950, although tourism in ancient times is also documented in relation to\nreligious or sports festivals such as the Olympic Games. Since the 1950s, the\ntourism sector saw an unprecedented boost as arrivals went from 33,000 in 1950\nto 11.4 million in 1994.\n\nGreece attracts more than 16 million tourists each year, thus contributing\n18.2% to the nation's GDP in 2008 according to an OECD report. The same survey\nshowed that the average tourist expenditure while in Greece was $1,073,\nranking Greece 10th in the world. The number of jobs directly or indirectly\nrelated to the tourism sector were 840,000 in 2008 and represented 19% of the\ncountry's total labor force. In 2009, Greece welcomed over 19.3 million\ntourists, a major increase from the 17.7 million tourists the country welcomed\nin 2008.\n\nAmong the member states of the European Union, Greece was the most popular\ndestination for residents of Cyprus and Sweden in 2011.\n\nThe ministry responsible for tourism is the Ministry of Culture and Tourism,\nwhile Greece also owns the Greek National Tourism Organization which aims in\npromoting tourism in Greece.\n\nIn recent years a number of well-known tourism-related organizations have\nplaced Greek destinations in the top of their lists. In 2009 Lonely Planet\nranked Thessaloniki, the country's second-largest city, the world's fifth best\n\"Ultimate Party Town\", alongside cities such as Montreal and Dubai, while in\n2011 the island of Santorini was voted as the best island in the world by\nTravel + Leisure. The neighbouring island of Mykonos was ranked as the 5th\nbest island Europe. Thessaloniki was the European Youth Capital in 2014.",
    "openai_summarised_points": [
      "• The Porto Carras resort is located in Chalkidiki, Greece, and the island of Santorini is recognized as a popular tourist destination.",
      "• Tourism in Greece in its modern form began to flourish after 1950, although historical tourism related to religious and sports festivals, such as the Olympic Games, is documented in ancient times.",
      "• The tourism sector experienced an unprecedented growth starting in the 1950s, with tourist arrivals increasing from 33,000 in 1950 to 11.4 million in 1994.",
      "• Greece attracts more than 16 million tourists annually, significantly contributing to the national economy.",
      "• According to an OECD report from 2008, tourism contributed 18.2% to Greece’s Gross Domestic Product (GDP).",
      "• The same OECD survey indicated that the average tourist expenditure in Greece was $1,073, ranking Greece 10th globally in terms of tourist spending.",
      "• In 2008, the number of jobs directly or indirectly related to the tourism sector in Greece was 840,000, representing 19% of the country’s total labor force.",
      "• Greece’s tourist arrivals increased to over 19.3 million in 2009, up from 17.7 million in 2008, marking a significant growth in tourism activity.",
      "• In 2011, Greece was the most popular European Union destination for residents of Cyprus and Sweden.",
      "• The Ministry of Culture and Tourism is the governmental body responsible for tourism in Greece.",
      "• Greece owns the Greek National Tourism Organization, which is tasked with promoting tourism across the country.",
      "• In 2009, Lonely Planet ranked Thessaloniki, Greece’s second-largest city, as the fifth best \"Ultimate Party Town\" in the world, alongside cities such as Montreal and Dubai.",
      "• In 2011, the island of Santorini was voted the best island in the world by Travel + Leisure magazine.",
      "• The neighboring island of Mykonos was ranked as the 5th best island in Europe by the same publication.",
      "• Thessaloniki was designated as the European Youth Capital in 2014, highlighting its significance as a cultural and tourism hub."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:15.793616",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1808,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Trade and investment",
    "text": "The Bank of Greece/National Bank of Greece and former Ionian Bank (today Alpha\nBank) buildings in Thessaloniki",
    "openai_summarised_points": [
      "• The section discusses Greece's trade and investment landscape, highlighting key financial institutions and historical banking infrastructure.",
      "• The Bank of Greece and the National Bank of Greece are prominent financial institutions within the country, playing significant roles in Greece’s economic activities.",
      "• The former Ionian Bank, now known as Alpha Bank, is also a major banking entity operating in Greece.",
      "• In Thessaloniki, Greece’s second-largest city, notable banking buildings include the Bank of Greece, the National Bank of Greece, and the former Ionian Bank building, now Alpha Bank.",
      "• The Bank of Greece building in Thessaloniki is a significant architectural and financial landmark, symbolizing Greece’s central banking history.",
      "• The National Bank of Greece building in Thessaloniki also holds historical and architectural importance, representing the country’s long-standing banking tradition.",
      "• The former Ionian Bank building, which has been rebranded as Alpha Bank, is part of Thessaloniki’s financial architecture, reflecting the evolution of Greece’s banking sector.",
      "• These buildings collectively illustrate the historical development and presence of major banking institutions in Thessaloniki, emphasizing their importance in Greece’s economic infrastructure."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:19.378301",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 110,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Foreign investment",
    "text": "Since the fall of communism, Greece has invested heavily in neighbouring\ncountries in Southeast Europe. Between 1997 and 2009, 12.11% of foreign direct\ninvestment capital in North Macedonia was Greek, ranking fourth. In 2009\nalone, Greeks invested €380 million in the country, with companies such as\nHellenic Petroleum having made important strategic investments.\n\nGreece invested €1.38 billion in Bulgaria between 2005 and 2007 and many\nimportant companies (including Bulgarian Postbank, United Bulgarian Bank Coca-\nCola Bulgaria) are owned by Greek financial groups. In Serbia, 250 Greek\ncompanies are active with a total investment of over €2 billion. Romanian\nstatistics from 2016 show that Greek investment in the country exceeded €4\nbillion, ranking Greece fifth or sixth among foreign investors. Greece has\nbeen the largest investor in Albania since the fall of communism with 25% of\nforeign investments in 2016 coming from Greece, in addition business relations\nbetween both are extremely strong and continuously rising.",
    "openai_summarised_points": [
      "• Since the fall of communism, Greece has significantly increased its investments in neighboring Southeast European countries.",
      "• Between 1997 and 2009, Greek foreign direct investment (FDI) in North Macedonia accounted for 12.11% of the total FDI capital in the country, making Greece the fourth-largest investor.",
      "• In 2009 alone, Greek investors contributed €380 million to North Macedonia, with notable companies such as Hellenic Petroleum making strategic investments.",
      "• Greece invested a total of €1.38 billion in Bulgaria during the period from 2005 to 2007.",
      "• Several prominent Bulgarian companies, including Bulgarian Postbank, United Bulgarian Bank, and Coca-Cola Bulgaria, are owned by Greek financial groups.",
      "• In Serbia, approximately 250 Greek companies are operational, with a combined investment exceeding €2 billion.",
      "• According to 2016 statistics from Romania, Greek investment in Romania surpassed €4 billion, positioning Greece as the fifth or sixth largest foreign investor in the country.",
      "• Greece has been the largest foreign investor in Albania since the fall of communism, with Greek investments constituting 25% of all foreign investments in Albania in 2016.",
      "• Business relations between Greece and Albania are extremely strong and continue to grow steadily."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:24.088603",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1028,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Trade",
    "text": "During the debt crisis and subsequent COVID-19 recession, Greece's negative\nbalance of trade decreased significantly–from €44.3 billion in 2008 to €18.15\nbillion in 2020–due to a substantial drop in imports. However, the trade boom\nof recent years has seen the balance approach pre-crisis levels. Exports\nincreased by 30.9% in 2021 and 38.3% in 2022, while imports rose by 34.6% and\n43.6% during the same period. This was followed by a correction in 2023, with\nexports and imports decreasing by 8.5% and 12.1% respectively. In 2024,\nexports decreased by 2.1% and imports increased by 2.2%.\n\nGreece is also the largest import partner of Cyprus (18.0%) and the largest\nexport partner of Palau (82.4%).\n\n**Imports and exports in 2012** | Imports |  | Exports\n---|---|---|---\nRank | Origin | Value\n(€ mil)  | Value\n(% of total) | Rank  | Destination | Value\n(€ mil)  | Value\n(% of total)\n0 | a | 0 |  | -1 | 0 | a | 0 | -1\n1 |  Russia | 5,967.20132 | 12.6 | 1 |  Turkey | 2,940.25203 | 10.8\n2 |  Germany | 4,381.92656 | 9.2 | 2 |  Italy | 2,033.77413 | 7.5\n3 |  Italy | 3,668.88622 | 7.7 | 3 |  Germany | 1,687.03947 | 6.2\n4 |  Saudi Arabia | 2,674.00587 | 5.6 | 4 |  Bulgaria | 1,493.75355 | 5.5\n5 |  China | 2,278.03883 | 4.8 | 5 |  Cyprus | 1,319.28598 | 4.8\n6 |  Netherlands | 2,198.57126 | 4.6 | 6 |  United States | 1,024.73686 | 3.8\n7 |  France | 1,978.48460 | 4.2 | 7 |  United Kingdom | 822.74077 | 3\n#α | OECD | 23,849.94650 | 50.2 | #α | OECD | 13,276.48107 | 48.8\n#β | G7 | 11,933.75417 | 25.1 | #β | G7 | 6,380.86705 | 23.4\n#γ | BRICS | 8,682.10265 | 18.3 | #ε | BRICS | 1,014.17146 | 3.7\n#δ | BRIC | 8,636.02946 | 18.2 | #ζ | BRIC | 977.76016 | 3.6\n#ε | OPEC | 8,090.76972 | 17 | #γ | OPEC | 2,158.60420 | 7.9\n#ζ | NAFTA | 751.80608 | 1.6 | #δ | NAFTA | 1,215.70257 | 4.5\n#a |  European Union 27 | 21,164.89314 | 44.5 | #a |  European Union 27  | 11,512.31990 | 42.3\n#b |  European Union 15 | 17,794.19344 | 37.4 | #b |  European Union 15  | 7,234.83595 | 26.6\n#3 | Africa | 2,787.39502 | 5.9 | #3 | Africa | 1,999.46534 | 7.3\n#4 | America | 1,451.15136 | 3.1  | #4 | America | 1,384.04068 | 5.1\n#2 | Asia | 14,378.02705 | 30.2 | #2  | Asia | 6,933.51200 | 25.5\n#1 | Europe | 28,708.38148 | 60.4 | #1 | Europe | 14,797.20641 | 54.4\n#5 | Oceania | 71.70603 | 0.2 | #5 | Oceania | 169.24085 | 0.6",
    "openai_summarised_points": [
      "• During Greece's debt crisis and subsequent COVID-19 recession, the country's negative trade balance significantly decreased, from €44.3 billion in 2008 to €18.15 billion in 2020, primarily due to a substantial decline in imports.",
      "• The recent trade boom has seen Greece's trade balance approach pre-crisis levels, with exports increasing by 30.9% in 2021 and 38.3% in 2022, and imports rising by 34.6% in 2021 and 43.6% in 2022.",
      "• In 2023, a correction occurred, with exports decreasing by 8.5% and imports decreasing by 12.1%.",
      "• In 2024, exports further decreased by 2.1%, while imports increased by 2.2%.",
      "• Greece is the largest import partner of Cyprus, accounting for 18.0% of Cyprus's imports.",
      "• Greece is also the largest export partner of Palau, representing 82.4% of Palau's exports.",
      "• In 2012, Greece's import and export data showed the following key figures:",
      "• Top import origin was Russia (€5,967.20 million, 12.6% of total imports), followed by Germany (€4,381.93 million, 9.2%), Italy (€3,668.89 million, 7.7%), Saudi Arabia (€2,674.01 million, 5.6%), China (€2,278.04 million, 4.8%), Netherlands (€2,198.57 million, 4.6%), and France (€1,978.48 million, 4.2%).",
      "• The total imports from OECD countries amounted to €23,849.95 million (50.2%), G7 countries €11,933.75 million (25.1%), BRICS countries €8,682.10 million (18.3%), BRIC countries €8,636.03 million (18.2%), OPEC countries €8,090.77 million (17%), and NAFTA countries €751.81 million (1.6%).",
      "• Within regional groupings, imports from the European Union 27 totaled €21,164.89 million (44.5%), and from the European Union 15, €17,794.19 million (37.4%).",
      "• Other regional imports included Africa (€2,787.40 million, 5.9%), America (€1,451.15 million, 3.1%), Asia (€14,378.03 million, 30.2%), Oceania (€71.71 million, 0.2%).",
      "• Greece's main export destinations in 2012 were:",
      "• Turkey (€2,940.25 million, 10.8%),",
      "• Italy (€2,033.77 million, 7.5%),",
      "• Germany (€1,687.04 million, 6.2%),",
      "• Bulgaria (€1,493.75 million, 5.5%),",
      "• Cyprus (€1,319.29 million, 4.8%),",
      "• United States (€1,024.74 million, 3.8%),",
      "• United Kingdom (€822.74 million, 3%).",
      "• Greece's total exports to OECD countries were €13,276.48 million (48.8%), G7 countries €6,380.87 million (23.4%), BRICS €1,014.17 million (3.7%), BRIC €977.76 million (3.6%), OPEC €2,158.60 million (7%), and NAFTA €1,215.70 million (4.5%).",
      "• Regional export destinations included Europe (€14,797.21 million, 54.4%), Asia (€6,933.51 million, 25.5%), America (€1,384.04 million, 5.1%), Africa (€1,999.47 million, 7.3%), and Oceania (€169.24 million, 0.6%)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:29.216358",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2304,
      "bullet_points_count": 21
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "invalid_level",
    "section_name": "| World | 47,537.63847 | 100 | # | World  | 27,211.06362 | 100",
    "text": "24 | z | 1000000000000000000 | 101 | 24 | z | 1000000000000000000 | 101\nthe International Organisations or Country Groups list and ranking presented\nabove (i.e. _#greek_letters_ and/or _#latin_letters_),\nis not indicative of the whole picture of Greece's trade;\nthis is instead only an incomplete selection of some major and well known such\nOrganisations and Groups;\nrounding errors possibly present",
    "openai_summarised_points": [
      "• The section references a list and ranking of international organizations or country groups related to Greece's economy, indicated by placeholders such as _#greek_letters_ and/or _#latin_letters_.",
      "• It emphasizes that this list is not comprehensive and does not represent the entire scope of Greece's trade activities.",
      "• The listed organizations and groups are only a partial selection, focusing on some major and well-known entities.",
      "• The data includes large numerical values, such as 24, with associated identifiers like 'z' and extremely large figures (e.g., 1,000,000,000,000,000,000), possibly representing economic metrics or trade volumes.",
      "• The figures 24 and 101 appear multiple times, potentially indicating ranking positions or categorical identifiers within the dataset.",
      "• The mention of \"rounding errors possibly present\" suggests that some numerical data may be subject to minor inaccuracies due to rounding.",
      "• The overall context indicates that the provided data and rankings are partial and should not be interpreted as fully representative of Greece's global trade profile."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:32.484694",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 399,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Transport",
    "text": "The Egnatia Odos, part of European route E90. Corinth Canal OSE HQs\n\nAs of 2012, Greece had a total of 82 airports, of which 67 were paved and six\nhad runways longer than 3,047 meters. Of these airports, two are classified as\n\"international\" by the Hellenic Civil Aviation Authority, but 15 offer\ninternational services. Additionally Greece has 9 heliports. Greece does not\nhave a flag carrier, but the country's airline industry is dominated by Aegean\nAirlines and its subsidiary Olympic Air.\n\nBetween 1975 and 2009, Olympic Airways (known after 2003 as Olympic Airlines)\nwas the country's state-owned flag carrier, but financial problems led to its\nprivatization and relaunch as Olympic Air in 2009. Both Aegean Airlines and\nOlympic Air have won awards for their services; in 2009 and 2011, Aegean\nAirlines was awarded the \"Best regional airline in Europe\" award by Skytrax,\nand also has two gold and one silver awards by the ERA, while Olympic Air\nholds one silver ERA award for \"Airline of the Year\" as well as a _\"Condé Nast\nTraveller 2011 Readers Choice Awards: Top Domestic Airline\"_ award.\n\nThe Greek road network is made up of 116,986 km of roads, of which 1863 km are\nhighways, ranking 24th worldwide, as of 2016. Since the entry of Greece to the\nEuropean Community (now the European Union), a number of important projects\n(such as the Egnatia Odos and the Attiki Odos) have been co-funded by the\norganization, helping to upgrade the country's road network. In 2007, Greece\nranked 8th in the European Union in goods transported by road at almost 500\nmillion tons.\n\nGreece's rail network is estimated to be at 2,548 km. Rail transport in Greece\nis operated by TrainOSE, a current subsidiary of the Ferrovie dello Stato\nItaliane after the Hellenic Railways Organisation had sold its 100% stake on\nthe operator. Most of the country's network is standard gauge (1,565 km),\nwhile the country also has 983 km of narrow gauge. A total of 764 km of rail\nare electrified. Greece has rail connections with Bulgaria, North Macedonia\nand Turkey. A total of three suburban railway systems (Proastiakos) are in\noperation (in Athens, Thessaloniki and Patras), while one metro system, the\nAthens Metro, is operational in Athens with another, the Thessaloniki Metro,\nunder construction.\n\nAccording to Eurostat, Greece's largest port by tons of goods transported in\n2010 is the port of Aghioi Theodoroi, with 17.38 million tons. The Port of\nThessaloniki comes second with 15.8 million tons, followed by the Port of\nPiraeus, with 13.2 million tons, and the port of Eleusis, with 12.37 million\ntons. The total number of goods transported through Greece in 2010 amounted to\n124.38 million tons, a considerable drop from the 164.3 million tons\ntransported through the country in 2007. Since then, Piraeus has grown to\nbecome the Mediterranean's third-largest port thanks to heavy investment by\nChinese logistics giant COSCO. In 2013, Piraeus was declared the fastest-\ngrowing port in the world.\n\nIn 2010 Piraeus handled 513,319 TEUs, followed by Thessaloniki, which handled\n273,282 TEUs. In the same year, 83.9 million people passed through Greece's\nports, 12.7 million through the port of Paloukia in Salamis, another 12.7\nthrough the port of Perama, 9.5 million through Piraeus and 2.7 million\nthrough Igoumenitsa. In 2013, Piraeus handled a record 3.16 million TEUs, the\nthird-largest figure in the Mediterranean, of which 2.52 million were\ntransported through Pier II, owned by COSCO and 644,000 were transported\nthrough Pier I, owned by the Greek state.",
    "openai_summarised_points": [
      "• As of 2012, Greece possessed a total of 82 airports, with 67 being paved runways and six airports featuring runways longer than 3,047 meters.",
      "• Among these airports, two are classified as \"international\" by the Hellenic Civil Aviation Authority, while 15 airports offer international services.",
      "• Greece has 9 heliports available for air transportation.",
      "• The country does not have a flag carrier airline; however, the airline industry is primarily dominated by Aegean Airlines and its subsidiary Olympic Air.",
      "• Olympic Airways, rebranded as Olympic Airlines after 2003, served as Greece's state-owned flag carrier from 1975 until 2009, when financial difficulties prompted its privatization and relaunch as Olympic Air.",
      "• Both Aegean Airlines and Olympic Air have received multiple awards: Aegean Airlines was named \"Best regional airline in Europe\" by Skytrax in 2009 and 2011, and has earned two gold and one silver ERA awards; Olympic Air has received a silver ERA award for \"Airline of the Year\" and the Condé Nast Traveller 2011 Readers' Choice Award for Top Domestic Airline.",
      "• Greece's road network spans approximately 116,986 km, including 1,863 km of highways, ranking 24th worldwide as of 2016.",
      "• Since Greece's accession to the European Community (now the European Union), major infrastructure projects such as the Egnatia Odos and Attiki Odos have been co-funded by the EU to modernize the road network.",
      "• In 2007, Greece ranked 8th in the European Union for goods transported by road, with nearly 500 million tons of freight moved.",
      "• Greece's rail network is estimated at 2,548 km, operated by TrainOSE, a subsidiary of Ferrovie dello Stato Italiane, following the sale of the Hellenic Railways Organisation's stake.",
      "• The majority of Greece's rail network (1,565 km) is standard gauge, with an additional 983 km of narrow gauge, and 764 km of rail are electrified.",
      "• Greece maintains rail connections with Bulgaria, North Macedonia, and Turkey.",
      "• The country has three suburban railway systems (Proastiakos) in Athens, Thessaloniki, and Patras, with the Athens Metro operational and the Thessaloniki Metro under construction.",
      "• According to Eurostat data from 2010, the port of Aghioi Theodoroi was Greece's largest port by goods transported, handling 17.38 million tons; the Port of Thessaloniki was second with 15.8 million tons; Piraeus handled 13.2 million tons; and Eleusis processed 12.37 million tons.",
      "• Total goods transported through Greece in 2010 amounted to 124.38 million tons, a decline from 164.3 million tons in 2007.",
      "• Piraeus has experienced significant growth, becoming the Mediterranean's third-largest port due to heavy investment by Chinese logistics company COSCO, and was declared the fastest-growing port in the world in 2013.",
      "• In 2010, Piraeus handled 513,319 TEUs, with Thessaloniki handling 273,282 TEUs; overall, 83.9 million passengers traveled through Greek ports that year.",
      "• Passenger traffic in 2010 included 12.7 million through the port of Paloukia in Salamis, 12.7 million through Perama, 9.5 million through Piraeus, and 2.7 million through Igoumenitsa.",
      "• In 2013, Piraeus handled a record 3.16 million TEUs, ranking as the third-largest container port in the Mediterranean, with 2.52 million TEUs transported through Pier II (owned by COSCO) and 644,000 TEUs through Pier I (owned by the Greek state)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:43.764775",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3546,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Energy",
    "text": "Solar-power generation potential in Greece\n\nEnergy production in Greece is dominated by the Public Power Corporation\n(known mostly by its acronym ΔΕΗ, or in English DEI). In 2009 DEI supplied for\n85.6% of all energy demand in Greece, while the number fell to 77.3% in 2010.\nAlmost half (48%) of DEI's power output is generated using lignite, a drop\nfrom the 51.6% in 2009. Another 12% comes from Hydroelectric power plants and\nanother 20% from natural gas. Between 2009 and 2010, independent companies'\nenergy production increased by 56%, from 2,709 Gigawatt hour in 2009 to 4,232\nGWh in 2010.\n\nIn 2008 renewable energy accounted for 8% of the country's total energy\nconsumption, a rise from the 7.2% it accounted for in 2006, but still below\nthe EU average of 10% in 2008. 10% of the country's renewable energy comes\nfrom solar power, while most comes from biomass and waste recycling. In line\nwith the European Commission's Directive on Renewable Energy, Greece aims to\nget 18% of its energy from renewable sources by 2020. In 2013 and for several\nmonths, Greece produced more than 20% of its electricity from renewable energy\nsources and hydroelectric power plants. Greece currently does not have any\nnuclear power plants in operation, however in 2009 the Academy of Athens\nsuggested that research in the possibility of Greek nuclear power plants\nbegin.\n\nGreece had 10 million barrels of proven oil reserves as of 1 January 2012.\nHellenic Petroleum is the country's largest oil company, followed by Motor Oil\nHellas. Greece's oil production stands at 1,751 barrels per day (bbl/d),\nranked 95th worldwide, while it exports 19,960 bbl/d, ranked 53rd, and imports\n355,600 bbl/d, ranked 25th.\n\nIn 2011 the Greek government approved the start of oil exploration and\ndrilling in three locations within Greece, with an estimated output of 250 to\n300 million barrels over the next 15 to 20 years. The estimated output in\neuros of the three deposits is €25 billion over a 15-year period, of which\n€13–€14 billion will enter state coffers. Greece's dispute with Turkey over\nthe Aegean poses substantial obstacles to oil exploration in the Aegean Sea.\n\nIn addition to the above, Greece is also to start oil and gas exploration in\nother locations in the Ionian Sea, as well as the Libyan Sea, within the Greek\nexclusive economic zone, south of Crete. The Ministry of the Environment,\nEnergy and Climate Change announced that there was interest from various\ncountries (including Norway and the United States) in exploration, and the\nfirst results regarding the amount of oil and gas in these locations were\nexpected in the summer of 2012. In November 2012, a report published by\nDeutsche Bank estimated the value of natural gas reserves south of Crete at\n€427 billion.\n\nA number of oil and gas pipelines are currently under construction or under\nplanning in the country. Such projects include the _Interconnector Turkey-\nGreece-Italy_ (ITGI) and _South Stream_ gas pipelines.\n\nEuroAsia Interconnector will electrically connect Attica and Crete in Greece\nwith Cyprus and Israel with 2000 MW HVDC undersea power cable. EuroAsia\nInterconnector is specially important for isolated systems, like Cyprus and\nCrete. Crete is energetically isolated from mainland Greece and Hellenic\nRepublic covers for Crete electricity costs difference of around €300 million\nper year.\n\n* Amyntaio Power Plant\n\n* Agios Dimitrios Power Plant\n\n* View of a wind farm, Panachaiko mountain\n\n* Prinos oil field near Kavala\n\n* Plastiras Hydroelectric Dam",
    "openai_summarised_points": [
      "• Energy production in Greece is primarily managed by the Public Power Corporation (ΔΕΗ or DEI), which supplied 85.6% of Greece's energy demand in 2009, decreasing to 77.3% in 2010.",
      "• Nearly half (48%) of DEI's electricity generation in 2010 was from lignite, down from 51.6% in 2009.",
      "• DEI's energy mix also includes 12% from hydroelectric power plants and 20% from natural gas.",
      "• Independent energy producers increased their output by 56% between 2009 and 2010, from 2,709 GWh to 4,232 GWh.",
      "• In 2008, renewable energy sources accounted for 8% of Greece’s total energy consumption, up from 7.2% in 2006, but still below the EU average of 10% in 2008.",
      "• Of Greece’s renewable energy, 10% is derived from solar power, with the majority coming from biomass and waste recycling.",
      "• Greece aims to generate 18% of its energy from renewable sources by 2020, in accordance with the European Commission's Directive on Renewable Energy.",
      "• In 2013, Greece produced over 20% of its electricity from renewable sources, including hydroelectric power, for several months.",
      "• Greece currently has no operational nuclear power plants; however, in 2009, the Academy of Athens suggested initiating research into nuclear power possibilities.",
      "• As of 1 January 2012, Greece had proven oil reserves totaling 10 million barrels.",
      "• The country's largest oil companies are Hellenic Petroleum and Motor Oil Hellas.",
      "• Greece's oil production is approximately 1,751 barrels per day (bbl/d), ranking 95th worldwide; it exports about 19,960 bbl/d (ranked 53rd) and imports around 355,600 bbl/d (ranked 25th).",
      "• In 2011, the Greek government approved oil exploration and drilling in three locations, with an estimated total output of 250–300 million barrels over 15–20 years, valued at €25 billion over 15 years, with €13–€14 billion expected to benefit the state.",
      "• Oil exploration in Greece faces significant geopolitical challenges due to disputes with Turkey over the Aegean Sea.",
      "• Greece plans to explore additional oil and gas reserves in the Ionian Sea and Libyan Sea within its exclusive economic zone, south of Crete, with initial results expected in summer 2012.",
      "• Deutsche Bank estimated the natural gas reserves south of Crete at a value of €427 billion in November 2012.",
      "• Ongoing or planned pipeline projects include the Interconnector Turkey-Greece-Italy (ITGI) and South Stream gas pipelines.",
      "• The EuroAsia Interconnector will connect Attica and Crete in Greece with Cyprus and Israel via a 2000 MW HVDC undersea power cable, crucial for isolated systems like Crete and Cyprus.",
      "• Crete is energetically isolated from mainland Greece, with the Hellenic Republic subsidizing its electricity costs by approximately €300 million annually.",
      "• Notable energy infrastructure includes Amyntaio Power Plant, Agios Dimitrios Power Plant, a wind farm on Panachaiko mountain, Prinos oil field near Kavala, and Plastiras Hydroelectric Dam."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:15:49.382231",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3514,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Taxation and tax evasion",
    "text": "Revenues of Greece between 1999 and 2010 as a percentage of GDP, compared to\nthe EU average.\n\nGreece has a tiered tax system based on progressive taxation. Greek law\nrecognizes six categories of taxable income: immovable property, movable\nproperty (investment), income from agriculture, business, employment, and\nincome from professional activities. Greece's personal income tax rate, until\nrecently, ranged from 0% for annual incomes below €12,000 to 45% for annual\nincomes over €100,000. Under the new 2010 tax reform, tax exemptions have been\nabolished.\n\nAlso under the new austerity measures and among other changes, the personal\nincome tax-free ceiling has been reduced to €5,000 per annum while further\nfuture changes, for example abolition of this ceiling, are already being\nplanned.\n\nGreece's corporate tax dropped from 40% in 2000 to 20% in 2010. For 2011 only,\ncorporate tax was at 24%. Value added tax (VAT) has gone up in 2010 compared\nto 2009: 23% as opposed to 19%.\n\nThe lowest VAT possible is 6.5% (previously 4.5%) for newspapers, periodicals\nand cultural event tickets, while a tax rate of 13% (from 9%) applies to\ncertain service sector professions. Additionally, both employers and employees\nhave to pay social contribution taxes, which apply at a rate of 16% for white\ncollar jobs and 19.5% for blue collar jobs, and are used for social insurance.\nIn 2017 the VAT tax rate was 24% with minor exceptions, 13% reduced for some\nbasic foodstuffs which will be soon abolished and everything, as it seems,\nwill soon go to 24% in order to fight the phantom of tax evasion.[_needs\nupdate_]\n\nThe Ministry of Finance expected tax revenues for 2012 to be €52.7 billion\n(€23.6 billion in direct taxes and €29.1 billion in indirect taxes), an\nincrease of 5.8% from 2011. In 2012, the government was expected to have\nconsiderably higher tax revenues than in 2011 on a number of sectors,\nprimarily housing (an increase of 217.5% from 2011)."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Tax evasion",
    "text": "Greece suffers from very high levels of tax evasion. In the last quarter of\n2005, tax evasion reached 49%, while in January 2006 it fell to 41.6%. It is\nworth noting that the newspaper Ethnos which published these figures went\nbankrupt; it is no longer published and some sources suggest that the\ninformation it had published was highly debatable. A study by researchers from\nthe University of Chicago concluded that tax evasion in 2009 by self-employed\nprofessionals alone in Greece (accountants, dentists, lawyers, doctors,\npersonal tutors and independent financial advisers) was €28 billion or 31% of\nthe budget deficit that year.\n\nGreece's \"shadow economy\" was estimated at 24.3% of GDP in 2012, compared with\n28.6% for Estonia, 26.5% for Latvia, 21.6% for Italy, 17.1% for Belgium, 14.7%\nfor Sweden, 13.7% for Finland, and 13.5% for Germany, and is certainly related\nto the fact that the percentage of Greeks that are self-employed is more than\ndouble the EU average (2013 est.).\n\nThe Tax Justice Network estimated in 2011 that there were over 20 billion\neuros in Swiss bank accounts held by Greeks. The former Finance Minister of\nGreece, Evangelos Venizelos, was quoted as saying, \"Around 15,000 individuals\nand companies owe the taxman 37 billion euros\". Additionally, the TJN put the\nnumber of Greek-owned off-shore companies at over 10,000.\n\nIn 2012, Swiss estimates suggested that Greeks had some 20 billion euros in\nSwitzerland of which only one percent had been declared as taxable in Greece.\nEstimates in 2015 were even more dramatic. They indicated that the amount due\nto the government of Greece from Greeks' accounts in Swiss banks totaled\naround 80 billion euros.\n\nA mid-2017 report indicated Greeks have been \"taxed to the hilt\" and many\nbelieved that the risk of penalties for tax evasion were less serious than the\nrisk of bankruptcy. One method of evasion is the so-called black market, grey\neconomy or shadow economy: work is done for cash payment which is not declared\nas income; as well, VAT is not collected and remitted. A January 2017 report\nby the DiaNEOsis think-tank indicated that unpaid taxes in Greece at the time\ntotaled approximately 95 billion euros, up from 76 billion euros in 2015, much\nof it was expected to be uncollectable. Another early 2017 study estimated\nthat the loss to the government as a result of tax evasion was between 6% and\n9% of the country's GDP, or roughly between 11 billion and 16 billion euros\nper annum.\n\nThe shortfall in the collection of VAT (sales tax) is also significant. In\n2014, the government collected 28% less than was owed to it; this shortfall\nwas about double the average for the EU. The uncollected amount that year was\nabout 4.9 billion euros. The DiaNEOsis study estimated that 3.5% of GDP is\nlost due to VAT fraud, while losses due to smuggling of alcohol, tobacco and\npetrol amounted to approximately another 0.5% of the country's GDP."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "5.1.1",
    "section_name": "Planned solutions",
    "text": "Following similar actions by the United Kingdom and Germany, the Greek\ngovernment was in talks with Switzerland in 2011, attempting to force Swiss\nbanks to reveal information on the back accounts of Greek citizens. The\nMinistry of Finance stated that Greeks with Swiss bank accounts would either\nbe required to pay a tax or reveal information such as the identity of the\nbank account holder to the Greek internal revenue services. The Greek and\nSwiss governments were to reach a deal on the matter by the end of 2011.\n\nThe solution demanded by Greece still had not been effected as of 2015. That\nyear, estimates indicated that the amount of evaded taxes stored in Swiss\nbanks was around 80 billion euros. By then, however, a tax treaty to address\nthis issue was under serious negotiation between the Greek and Swiss\ngovernments. An agreement was finally ratified by Switzerland on 1 March 2016\ncreating a new tax transparency law that would allow for a more effective\nbattle against tax evasion. Starting in 2018, banks in both Greece and\nSwitzerland will exchange information about the bank accounts of citizens of\nthe other country to minimize the possibility of hiding untaxed income.\n\nIn 2016 and 2017, the government was encouraging the use of credit cards or\ndebit cards to pay for goods and services in order to reduce cash only\npayments. By January 2017, taxpayers were only granted tax-allowances or\ndeductions when payments were made electronically, with a \"paper trail\" of the\ntransactions that the government could easily audit. This was expected to\nreduce the problem of businesses taking payments but not issuing an invoice;\nthat tactic had been used by various companies to avoid payment of VAT (sales)\ntax as well as income tax.\n\nBy 28 July 2017, numerous businesses were required by law to install a point\nof sale device to enable them to accept payment by credit or debit card.\nFailure to comply with the electronic payment facility can lead to fines of up\nto 1,500 euros. The requirement applied to around 400,000 firms or individuals\nin 85 professions. The greater use of cards was one of the factors that had\nalready achieved significant increases in VAT collection in 2016."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "National and regional GDP",
    "text": "GDP per capita of the regions of Greece in 2008. The country's two largest\nmetropolitan areas account for almost 62% of the national economy.\n\nGreece's most economically important regions are Attica, which contributed\n€87.378 billion to the economy in 2018, and Central Macedonia, which\ncontributed €25.558 billion. The smallest regional economies were those of the\nNorth Aegean (€2.549 billion) and Ionian Islands (€3.257 billion).\n\nIn terms of GDP per capita, Attica (€23,300) far outranks any other Greek\nregion. The poorest regions in 2018 were the North Aegean (€11,800), Eastern\nMacedonia and Thrace (€11,900) and Epirus (€12,200). At the national level,\nGDP per capita in 2018 was €17,200.\n\n**Regional GDP, 2018** Rank  | Region  | GDP\n(€, billions)  | Share in EU-27/national GDP\n(%)  | GDP\nper capita\n(€)  | GDP\nper capita\n(PPS)  | GDP\nper capita\n(€, EU27=100)  | GDP\nper capita\n(PPS, EU27=100)  | GDP\nper person employed\n(PPS, EU27=100)\n---|---|---|---|---|---|---|---|---\n0 | a | 0 | 0 | 0 | 0 | 0 | 0 | 0\n1 | Attica | 87.378 | 47.3 | 23,300 | 28,000 | 77 | 93 | 99\n2 | Central Macedonia | 25.558 | 13.8 | 13,600 | 16,400 | 45 | 54 | 69\n3 | Thessaly | 9.658 | 5.2 | 13,400 | 16,100 | 44 | 53 | 65\n4 | Crete | 9.386 | 5.1 | 14,800 | 17,800 | 49 | 59 | 68\n5 | Central Greece | 8.767 | 4.7 | 15,800 | 18,900 | 52 | 63 | 81\n6 | Western Greece | 8.322 | 4.5 | 12,700 | 15,200 | 42 | 50 | 65\n7 | Peloponnese | 8.245 | 4.5 | 14,300 | 17,200 | 48 | 57 | 68\n8 | Eastern Macedonia and Thrace | 7.166 | 3.9 | 11,900 | 14,300 | 40 | 48 | 61\n9 | South Aegean | 6.387 | 3.5 | 18,700 | 22,400 | 62 | 74 | 79\n10 | Epirus | 4.077 | 2.2 | 12,200 | 14,700 | 40 | 49 | 63\n11 | Western Macedonia | 3.963 | 2.1 | 14,800 | 17,700 | 49 | 59 | 79\n12 | Ionian Islands | 3.257 | 1.8 | 16,000 | 19,100 | 53 | 63 | 71\n13 | North Aegean | 2.549 | 1.4 | 11,800 | 14,200 | 39 | 47 | 67\n– | Greece | 184.714 | 1 | 17,200 | 20,700 | 57 | 69 | 81\n– | EU27 | 13,483.857 | 100 | 30,200 | 30,200 | 100 | 100 | 100\n100 | z | 1000000000000000 | 1000 | 100 | 1000000000 | 1000"
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Welfare state",
    "text": "Greece is a welfare state which provides a number of social services such as\nquasi-universal health care and pensions. In the 2012 budget, expenses for the\nwelfare state (excluding education) stand at an estimated €22.487 billion\n(€6.577 billion for pensions and €15.910 billion for social security and\nhealth care expenses), or 31.9% of the all state expenses."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Largest companies by revenue 2024",
    "text": "According to the 2024 Forbes Global 2000 index, Greece's largest publicly\ntraded companies are:\n\n**Forbes Global 2000** Rank | Company | Revenues\n(€ billion) | Profit\n(€ billion) | Assets\n(€ billion)\n---|---|---|---|---\n1 | Eurobank Ergasias | 6.1  | 1.3  | 85.7\n2 | National Bank of Greece | 3.9  | 1.3  | 78.2\n3 | Piraeus Bank | 3.7  | 0.9  | 83.4\n4 | Alpha Bank | 4.7  | 0.7  | 80.3\n5 | Bank of Greece | 7.5  | 0.1  | 250.2\n6 | Motor Oil Hellas | 14.4  | 0.8  | 8.4\n7 | Hellenic Petroleum | 14.1  | 0.6  | 9.0\n8 | Public Power Corporation | 8.8  | 0.4  | 21.2"
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Working hours",
    "text": "In 2011, 53.3 percent of employed persons worked more than 40 to 49 hours a\nweek and 24.8 percent worked more than 50 hours a week, totaling up to 78.1\npercent of employed persons working 40 or more hours a week. When accounting\nfor varying age groups, the percentage of employees working 40 to 49 hours a\nweek peaked in the 25 to 29 age range. As workers got older, they gradually\ndecreased in percentage working 40 to 49 hours, but increased in working 50+\nhours, suggesting a correlation that as employees grow older, they work more\nhours. Of different occupation groups, skilled agricultural, forestry, and\nfishery workers and managers were the most likely to work 50+ hours; however,\nthey do not take up a significant portion of the labor force, only 14.3\npercent. In 2014, the average number of working hours for Greek employees was\n2124 hours, ranking as the third highest among OECD countries and the highest\nin the Eurozone.\n\nRecent trends in employment indicate that the number of working hours will\ndecrease in the future due to the rise of part-time work. Since 2011, average\nworking hours have decreased. In 1998, Greece passed legislation introducing\npart-time employment in public services with the goal of reducing\nunemployment, increasing the total, but decreasing the average number of hours\nworked per employee. Whether the legislation was successful in increasing\npublic-sector part-time work, labor market trends show that part-time\nemployment has increased from 7.7 percent in 2007 to 11 percent in 2016 of\ntotal employment. Both men and women have had the part-time share of\nemployment increase over this period. While women still constitute a majority\nof part-time workers, recently men have been taking a larger share of part-\ntime employment."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Currency",
    "text": "Between 1832 and 2002 the currency of Greece was the drachma. After signing\nthe Maastricht Treaty, Greece applied to join the eurozone. The two main\nconvergence criteria were a maximum budget deficit of 3% of GDP and a\ndeclining public debt if it stood above 60% of GDP. Greece met the criteria as\nshown in its 1999 annual public account. On 1 January 2001, Greece joined the\neurozone, with the adoption of the euro at the fixed exchange rate ₯340.75 to\n€1. However, in 2001 the euro only existed electronically, so the physical\nexchange from drachma to euro only took place on 1 January 2002. This was\nfollowed by a ten-year period for eligible exchange of drachma to euro, which\nended on 1 March 2012.\n\nPrior to the adoption of the euro, 64% of Greek citizens viewed the new\ncurrency positively, but in February 2005 this figure fell to 26% and by June\n2005 it fell further to 20%. Since 2010 the figure has risen again, and a\nsurvey in September 2011 showed that 63% of Greek citizens viewed of the euro\npositively."
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Charts gallery",
    "text": "* Greek social expenditures as a percentage of GDP (1998–2009)\n\n* Distribution of income in Greece over the years\n\n* Distribution of total income in Greece over the years\n\n* Employment and unemployment in Greece since 2004\n\n* Greek GDP, Debt (various) and Budget Deficit over the years\n\n* Greek GDP, Debt and Deficit (Int. 1990 Geary-Khamis dollars)\n\n* Greek bank deposits (including repos) since 1998\n\n* Domestic bank deposits of Greek households by type of account\n\n* Domestic lending by domestic banks in Greece since 1980\n\n* House Price Index, Greece (including flats)"
  },
  {
    "chapter_name": "Economy of Greece",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Poverty rate",
    "text": "As a result of the recession sparked by the public debt crisis, poverty has\nincreased. The rate of people at risk of poverty or social exclusion reached a\nhigh of 36% in 2014, before subsiding over the following years to 26.1% in\n2023. The rate of extreme poverty rose to 15% in 2015, up from 8.9% in 2011\nand a huge increase from 2009 when it did not exceed 2.2%. In 2015, the rate\namong children aged 0–17 was 17.6% and for young people aged 18–29 the rate\nwas 24.4%. With unemployment on the rise, those without jobs between 2012 and\n2015 were at the highest risk of poverty (70–75%), up from less than 50% in\n2011. Those out of work lose their health insurance after two years, further\nexacerbating the poverty rate. Younger unemployed people tend to rely on the\nolder generations of their families for financial support. However, long-term\nunemployment has depleted pension funds due to fewer workers making social\nsecurity contributions, resulting in higher poverty rates in intergenerational\nhouseholds reliant on the reduced pensions received by their retired members.\nOver the course of the economic crisis, Greeks have endured significant job\nlosses and wage cuts, as well as deep cuts to workers' compensation and\nwelfare benefits. From 2008 to 2013, Greeks became 40% poorer on average, and\nin 2014 saw their disposable household income drop below 2003 levels.\n\n| This graph was using the legacy Graph extension, which is no longer\nsupported. It needs to be converted to the new Chart extension.\n---|---\n\nIMF projection (%)\n\nActual unemployment rate (%)"
  }
]