[
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article **is missing information** about Yemen's economy during the civil war and in recent years. Please expand the article to include this information. Further details may exist on the talk page. _( September 2018)_  \n---|---  \n| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Yemen\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( October 2009)__(Learn how and when to remove this\nmessage)_  \n---|---  \n| This article's **factual accuracy may be compromised due to out-of-date\ninformation**. Please help update this article to reflect recent events or\nnewly available information. _( December 2017)_  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nThe **economy of Yemen** is weak and underdeveloped, even more so since the\nbreakout of the Yemeni Civil War which led to instability and a growing\nhumanitarian crisis. At the time of unification, South Yemen and North Yemen\nhad different but equally struggling underdeveloped economic systems. Since\nunification, the economy was further harmed by Yemen's support for Iraq during\nthe 1990–91 Persian Gulf War: Saudi Arabia expelled almost 1 million Yemeni\nworkers, and both Saudi Arabia and Kuwait significantly reduced economic aid\nto Yemen. The 1994 civil war further drained Yemen's economy. As a\nconsequence, Yemen has relied heavily on aid from multilateral agencies to\nsustain its economy. In return, it pledged to implement significant economic\nreforms. In 1997 the International Monetary Fund (IMF) approved two programs\nto increase Yemen's credit significantly: the enhanced structural adjustment\nfacility (now known as the poverty reduction and growth facility, or PRGF) and\nthe extended funding facility (EFF). In the ensuing years, Yemen's government\nattempted to implement recommended reforms: reducing the civil service\npayroll, eliminating diesel and other subsidies, lowering defense spending,\nintroducing a general sales tax, and privatizing state-run industries.\nHowever, limited progress led the IMF to suspend funding between 1999 and\n2001.\n\nIn late 2005, the World Bank (which extended Yemen a four-year US$2.3 billion\neconomic support package in October 2002, together with other bilateral and\nmultilateral lenders) announced that, as a consequence of Yemen's failure to\nimplement significant reforms, the World Bank would reduce financial aid by\none-third over the period July 2005 through July 2008. A key component of the\n$2.3 billion package — $300 million in concessional financing — was withheld,\npending the renewal of Yemen's PRGF with the IMF, which was under negotiation.\nHowever, in May 2006 the World Bank adopted an assistance strategy for Yemen\nproviding for $400 million in International Development Association (IDA)\ncredits in 2006-2009. In November 2006, at a meeting of Yemen's development\npartners, a total of $4.7 billion in grants and concessional loans was pledged\nfor the period 2007–2010. Despite possessing significant oil and gas resources\nand a considerable amount of agriculturally productive land, Yemen remains one\nof the poorest of the world's low-income countries. In 2018, more than 80\npercent (2018) of the population lived in poverty. The influx of an average\n1,000 Somali refugees per month into Yemen looking for work was an added drain\non the economy, which already coped with a 20 to 40 percent rate of\nunemployment. Yemen remained under significant pressure to implement economic\nreforms, lest it face the loss of badly needed international financial\nsupport.\n\nIn the north, disruptions of the civil war (1962–1970) and frequent periods of\ndrought dealt severe blows to a previously prosperous agricultural sector.\nCoffee production, formerly the north's main export and principal form of\nforeign exchange, declined as the cultivation of khat increased. Low domestic\nindustrial output and a lack of raw materials made the Yemeni Arab Republic\ndependent on a wide variety of imports.\n\nBlack market fuel for sale in Sanaa during the ongoing civil war.\n\nThe Yemeni Civil War and air bombing campaign by the coalition during the\nSaudi-led intervention devastated the Yemeni economy further.\n\nAs a result of civil war, Yemen suffered from inflation and devaluation of the\nYemeni rial, and Yemen's economy contracted by 50% from the start of the civil\nwar on 19 March 2015 to October 2018.",
    "openai_summarised_points": [
      "• The economy of Yemen is characterized as weak and underdeveloped, a condition exacerbated by the outbreak of the Yemeni Civil War, which has caused significant instability and a worsening humanitarian crisis.",
      "• Prior to unification, South Yemen and North Yemen each had distinct but equally struggling and underdeveloped economic systems.",
      "• Yemen's economy suffered further after its support for Iraq during the 1990–91 Persian Gulf War, leading to Saudi Arabia expelling nearly 1 million Yemeni workers and both Saudi Arabia and Kuwait significantly reducing economic aid to Yemen.",
      "• The 1994 civil war in Yemen further depleted the country's economic resources and stability.",
      "• Due to these challenges, Yemen has heavily relied on aid from multilateral agencies to sustain its economy, committing in return to implement significant economic reforms.",
      "• In 1997, the International Monetary Fund (IMF) approved two programs to substantially increase Yemen's credit: the Enhanced Structural Adjustment Facility (later renamed the Poverty Reduction and Growth Facility, PRGF) and the Extended Funding Facility (EFF).",
      "• Yemen's government attempted to implement IMF-recommended reforms including reducing the civil service payroll, eliminating diesel and other subsidies, lowering defense spending, introducing a general sales tax, and privatizing state-run industries.",
      "• Limited progress on reforms led the IMF to suspend funding to Yemen between 1999 and 2001.",
      "• In October 2002, the World Bank extended a four-year economic support package to Yemen worth US$2.3 billion, alongside other bilateral and multilateral lenders.",
      "• Due to Yemen's failure to implement significant reforms, the World Bank announced in late 2005 a planned reduction of financial aid by one-third over July 2005 to July 2008, withholding a key component of $300 million in concessional financing pending renewal of Yemen's PRGF with the IMF.",
      "• In May 2006, the World Bank adopted an assistance strategy for Yemen that included $400 million in International Development Association (IDA) credits for 2006–2009.",
      "• In November 2006, Yemen's development partners pledged a total of $4.7 billion in grants and concessional loans for the period 2007–2010.",
      "• Despite possessing significant oil and gas resources and considerable agriculturally productive land, Yemen remains one of the poorest low-income countries globally.",
      "• By 2018, over 80 percent of Yemen’s population lived in poverty.",
      "• The economy faced additional strain from an average monthly influx of 1,000 Somali refugees seeking work, compounding existing challenges including a 20 to 40 percent unemployment rate.",
      "• Yemen remained under considerable international pressure to implement economic reforms to avoid losing critical international financial support.",
      "• In North Yemen, the civil war from 1962 to 1970 and frequent droughts severely damaged what was previously a prosperous agricultural sector.",
      "• Coffee production, once the northern region’s main export and primary source of foreign exchange, declined as cultivation of khat increased.",
      "• Low domestic industrial output and a lack of raw materials made the Yemeni Arab Republic heavily dependent on a wide variety of imports.",
      "• The ongoing Yemeni Civil War and the Saudi-led coalition’s air bombing campaign have further devastated Yemen’s economy.",
      "• As a result of the civil war, Yemen experienced inflation and devaluation of the Yemeni rial.",
      "• Yemen’s economy contracted by approximately 50 percent from the start of the civil war on 19 March 2015 through October 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:42.878937",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4670,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "Historical GDP per capita development\n\nThis is a chart of trend of gross domestic product of Yemen (since\nunification) at market prices estimated by the International Monetary Fund\nwith figures in millions of Yemeni Rials.\n\nYear | Gross domestic product | US dollar exchange | Inflation index (2000=100)\n---|---|---|---\n1989 | 125,562 | 11.70 Yemeni Rials | 5.10\n1995 | 516,643 | 40.49 Yemeni Rials | 51\n2000 | 1,539,386 | 161.00 Yemeni Rials | 100\n2005 | 2,907,636 | 191.37 Yemeni Rials | 175\n\nFor purchasing power parity comparisons, the US Dollar exchanged at 150.11\nYemeni Rials and mean wages were $1.06 per man-hour in 2009.\n\nRemittances from Yemenis working abroad and foreign aid paid for perennial\ntrade deficits. Substantial Yemeni communities exist in the Arabian Peninsula,\nIndonesia, India, East Africa, the United Kingdom, and the United States.\nBeginning in the mid-1950s, the Soviet Union and People's Republic of China\nprovided large-scale assistance to the YAR. This aid included funding of\nsubstantial construction projects, scholarships, and considerable military\nassistance.\n\nThe following table shows the main economic indicators in 1994–2023 (with IMF\nstaff estimates in 2025–2029).\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---\n1990  | 24.20  | 1,845  | 12.64  | n/a  | n/a  | n/a\n1991  | 26.59  | 1,951  | 14.67  | 6.3  | 44.9  | n/a\n1992  | 29.43  | 2,078  | 17.96  | 8.2  | 51.2  | n/a\n1993  | 31.33  | 2,131  | 21.74  | 4.0  | 61.7  | n/a\n1994  | 34.15  | 2,237  | 28.02  | 6.7  | 71.3  | n/a\n1995  | 36.85  | 2,327  | 12.80  | 5.7  | 63.9  | n/a\n1996  | 39.26  | 2,398  | 6.50  | 4.6  | 38.8  | n/a\n1997  | 42.03  | 2,493  | 6.84  | 5.2  | 4.6  | n/a\n1998  | 45.05  | 2,595  | 6.32  | 6.0  | 11.5  | n/a\n1999  | 47.42  | 2,655  | 7.64  | 3.8  | 7.9  | 96\n2000  | 51.49  | 2,803  | 9.68  | 6.2  | 11.0  | 61\n2001  | 54.65  | 2,894  | 9.85  | 3.8  | 11.9  | 61\n2002  | 57.68  | 2,973  | 10.69  | 3.9  | 12.2  | 58\n2003  | 61.02  | 3,063  | 11.78  | 3.7  | 10.8  | 57\n2004  | 65.15  | 3,185  | 13.87  | 4.0  | 12.5  | 52\n2005  | 70.96  | 3,377  | 16.73  | 5.6  | 9.9  | 44\n2006  | 75.46  | 3,489  | 19.06  | 3.2  | 10.8  | 41\n2007  | 80.09  | 3,591  | 21.65  | 3.3  | 7.9  | 40\n2008  | 84.62  | 3,682  | 26.91  | 3.6  | 19.0  | 36\n2009  | 88.43  | 3,735  | 25.13  | 3.9  | 3.7  | 50\n2010  | 96.40  | 3,953  | 30.91  | 7.7  | 11.2  | 42\n2011  | 85.88  | 3,421  | 32.73  | −12.7  | 19.5  | 46\n2012  | 85.44  | 3,306  | 35.40  | 2.4  | 9.9  | 48\n2013  | 92.76  | 3,487  | 40.42  | 4.8  | 11.0  | 48\n2014  | 94.19  | 3,442  | 43.23  | −0.2  | 8.2  | 49\n2015  | 68.45  | 2,433  | 42.44  | −28.0  | 22.0  | 58\n2016  | 62.63  | 2,167  | 31.32  | −9.4  | 21.3  | 77\n2017  | 60.51  | 2,041  | 26.84  | −5.1  | 30.4  | 84\n2018  | 62.37  | 2,051  | 21.61  | 0.8  | 33.6  | 87\n2019  | 64.73  | 2,077  | 21.89  | 2.1  | 15.7  | 91\n2020  | 60.01  | 1,880  | 20.22  | −8.5  | 21.7  | 87\n2021  | 62.12  | 1,903  | 19.39  | −1.0  | 31.5  | 76\n2022  | 67.55  | 2,027  | 23.53  | 1.5  | 29.5  | 66\n2023  | 68.58  | 2,013  | 18.81  | −2.0  | 0.9  | 81\n2024  | 69.52  | 1,996  | 16.19  | −1.0  | 16.3  | 85\n2025e  | 71.84  | 2,017  | 16.22  | 1.5  | 20.7  | 78\n2026e  | 78.30  | 2,152  | 18.19  | 7.0  | 13.7  | 70\n2027e  | 84.92  | 2,284  | 21.05  | 6.5  | 11.2  | 58\n2028e  | 91.67  | 2,415  | 22.94  | 6.0  | 10.0  | 53\n2029e  | 98.48  | 2,542  | 24.52  | 5.5  | 10.0  | 50",
    "openai_summarised_points": [
      "• The gross domestic product (GDP) of Yemen since unification is measured at market prices in millions of Yemeni Rials, with historical data provided by the International Monetary Fund (IMF).",
      "• In 1989, Yemen's GDP was 125,562 million Yemeni Rials, with a US dollar exchange rate of 11.70 Yemeni Rials and an inflation index of 5.10 (base year 2000=100).",
      "• By 1995, GDP increased to 516,643 million Yemeni Rials, the exchange rate depreciated to 40.49 Yemeni Rials per US dollar, and the inflation index rose to 51.",
      "• In 2000, GDP reached 1,539,386 million Yemeni Rials, the exchange rate was 161.00 Yemeni Rials per US dollar, and the inflation index was set at the base level of 100.",
      "• By 2005, GDP further grew to 2,907,636 million Yemeni Rials, with the exchange rate at 191.37 Yemeni Rials per US dollar and an inflation index of 175.",
      "• For purchasing power parity (PPP) comparisons in 2009, the US dollar exchanged at 150.11 Yemeni Rials, and the mean wage was $1.06 per man-hour.",
      "• Yemen's perennial trade deficits have been financed by remittances from Yemenis working abroad and foreign aid.",
      "• Significant Yemeni diaspora communities exist in the Arabian Peninsula, Indonesia, India, East Africa, the United Kingdom, and the United States.",
      "• Since the mid-1950s, the Soviet Union and the People's Republic of China provided large-scale assistance to the Yemen Arab Republic (YAR), including funding for major construction projects, scholarships, and military aid.",
      "• The main economic indicators from 1990 to 2023, with IMF staff estimates for 2025 to 2029, show the following trends:",
      "• GDP in billion US dollars (PPP) grew from 24.20 in 1990 to an estimated 98.48 in 2029.",
      "• GDP per capita in US dollars (PPP) increased from 1,845 in 1990 to an estimated 2,542 in 2029.",
      "• Nominal GDP in billion US dollars rose from 12.64 in 1990 to an estimated 24.52 in 2029.",
      "• Real GDP growth fluctuated, with notable declines during conflict periods, such as −12.7% in 2011 and −28.0% in 2015, but is projected to recover with positive growth rates of 5.5% to 7.0% from 2025 to 2029.",
      "• Inflation rates varied widely, peaking at 51.2% in 1992 and reaching a low of 0.9% in 2023, with projections stabilizing around 10% by 2029.",
      "• Government debt as a percentage of GDP showed significant variation, with data unavailable for early years, peaking at 96% in 1999, and estimated to decline to 50% by 2029.",
      "• Specific yearly highlights include:",
      "• In 1991, GDP was $26.59 billion PPP with 6.3% real growth and 44.9% inflation.",
      "• In 1999, government debt reached 96% of GDP despite a GDP of $47.42 billion PPP.",
      "• The years 2011 to 2017 saw negative GDP growth rates (−12.7% in 2011, −28.0% in 2015, −9.4% in 2016, and −5.1% in 2017) reflecting economic contraction likely due to political instability and conflict.",
      "• Inflation spiked to 22.0% in 2015 and remained elevated through 2017 at 30.4%.",
      "• Government debt increased to 87% of GDP in 2020 and remained high through 2024.",
      "• From 2025 onwards, the IMF projects economic recovery with GDP growth rates between 5.5% and 7.0%, inflation rates declining to around 10%, and government debt gradually decreasing to 50% of GDP by 2029."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:52.483362",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3531,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Integration issues",
    "text": "In the south, pre-independence economic activity was overwhelmingly\nconcentrated in the port city of Aden. The seaborne transit trade, upon which\nthe port relied, collapsed with the closure of the Suez Canal and Britain's\nwithdrawal from Aden in 1967. Only extensive Soviet aid, remittances from\nsouth Yemenis working abroad, and revenues from the Aden refinery (built in\nthe 1950s) kept the PDRY's centrally planned Marxist economy afloat. With the\ndissolution of the Soviet Union and a cessation of Soviet aid, the south's\neconomy effectively collapsed.\n\nSince unification, the government has worked to integrate two relatively\ndisparate economic systems. However, severe shocks — including the return of\napproximately 850,000 Yemenis in 1990 from the Persian Gulf states, a\nsubsequent major reduction of aid flows, and internal political disputes\nculminating in the 1994 civil war — hampered economic growth."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture and fishing",
    "text": "Khat cultivation in western Yemen near At Tawilah Fish market in Yemen (2013)\n\nAgriculture is the mainstay of Yemen's economy, generating more than 20\npercent of gross domestic product (GDP) since 1990 (20.4 percent in 2005\naccording to the Central Bank of Yemen). Agriculture employs more than half\n(54.2 percent in 2003) of the working Yemeni population. However, a U.S.\ngovernment estimate suggests that the sector accounted for only 13.5 percent\nof GDP in 2005. Numerous environmental problems hamper growth in this sector —\nsoil erosion, sand dune encroachment, and deforestation — but the greatest\nproblem by far is the scarcity of water. As a result of low levels of\nrainfall, agriculture in Yemen relies heavily on the extraction of\ngroundwater, a resource that is being depleted. Yemen's water tables are\nfalling by approximately two meters per year; it is estimated that Sanaa's\ngroundwater supplies could be exhausted by 2030. The use of irrigation has\nmade fruit and vegetables Yemen's primary cash crops. With the rise in the\noutput of irrigated crops, the production of traditional rain-fed crops such\nas cereals has declined. According to the Central Bank of Yemen, the\nproduction of khat, a mildly narcotic and heavily cultivated plant that\nproduces natural stimulants when its leaves are chewed, rose 6.7 percent in\n2005 and accounted for 5.8 percent of GDP; the consumption of khat is\nwidespread in Yemen. According to the World Bank and other economists,\ncultivation of this plant plays a dominant role in Yemen's agricultural\neconomy, constituting 10 percent of GDP and employing an estimated 150,000\npersons while consuming an estimated 30 percent of irrigation water and\ndisplacing land areas that could otherwise be used for exportable coffee,\nfruits, and vegetables.\n\nAlthough Yemen's extensive territorial waters and marine resources have the\npotential to produce 840,000 tons of fish each year, its fishing industry is\nrelatively underdeveloped and consists largely of individual fishermen in\nsmall boats. After the government lifted restrictions on fish exports,\nproduction reached one-quarter of capacity, yielding revenues valued at US$260\nmillion in 2005. Fish and fish products constituted only 1.7 percent of\nYemen's GDP but were the second largest export. In December 2005, the World\nBank approved a US$25 million credit for a Fisheries Management and\nConservation Project in all coastal governorates along the Red Sea and the\nGulf of Aden. This project was expected to improve fish landing and auction\nfacilities; provide ice plants for fish preservation; and enable Yemen's\nMinistry of Fisheries to undertake more effective research, resource\nmanagement planning, and regulatory activities.",
    "openai_summarised_points": [
      "• Agriculture has been the mainstay of Yemen's economy since 1990, contributing more than 20 percent of the gross domestic product (GDP), with the Central Bank of Yemen reporting a 20.4 percent contribution in 2005.",
      "• The agricultural sector employed over half of Yemen's working population, specifically 54.2 percent in 2003, highlighting its significance as a primary source of employment.",
      "• Contrasting estimates exist regarding agriculture's GDP contribution, with a U.S. government estimate indicating the sector accounted for only 13.5 percent of GDP in 2005.",
      "• Yemen's agricultural growth is hindered by multiple environmental challenges including soil erosion, sand dune encroachment, deforestation, and most critically, water scarcity.",
      "• Due to low rainfall levels, Yemeni agriculture heavily depends on groundwater extraction, leading to rapid depletion of water tables, which are falling by approximately two meters annually.",
      "• It is estimated that groundwater supplies in Sanaa, Yemen's capital, could be completely exhausted by the year 2030 if current trends continue.",
      "• The adoption of irrigation techniques has shifted Yemen's agricultural focus toward fruit and vegetable production, making these the primary cash crops.",
      "• As irrigated crop output has increased, production of traditional rain-fed crops such as cereals has declined.",
      "• Khat cultivation, a mildly narcotic plant whose leaves produce natural stimulants when chewed, increased by 6.7 percent in 2005 according to the Central Bank of Yemen, accounting for 5.8 percent of GDP that year.",
      "• Khat consumption is widespread throughout Yemen, reflecting its cultural and economic significance.",
      "• The World Bank and other economists estimate that khat cultivation dominates Yemen's agricultural economy, constituting approximately 10 percent of GDP and employing an estimated 150,000 people.",
      "• Khat farming consumes an estimated 30 percent of Yemen's irrigation water and displaces agricultural land that could otherwise be used for exportable crops such as coffee, fruits, and vegetables.",
      "• Yemen possesses extensive territorial waters and marine resources with the potential to produce up to 840,000 tons of fish annually.",
      "• Despite this potential, Yemen's fishing industry remains underdeveloped, primarily consisting of individual fishermen operating small boats.",
      "• Following the government's removal of restrictions on fish exports, fishing production reached about one-quarter of its capacity, generating revenues valued at US$260 million in 2005.",
      "• Fish and fish products accounted for only 1.7 percent of Yemen's GDP but represented the country's second largest export sector.",
      "• In December 2005, the World Bank approved a US$25 million credit to fund a Fisheries Management and Conservation Project covering all coastal governorates along the Red Sea and the Gulf of Aden.",
      "• The Fisheries Management and Conservation Project aimed to improve fish landing and auction facilities, provide ice plants for fish preservation, and enhance the capacity of Yemen's Ministry of Fisheries for research, resource management planning, and regulatory activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:43.170400",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2725,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Oil and gas",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( February 2019)_\n---|---\n\nYemen is an oil producer and has significant untapped offshore oil and gas\ndeposits. Unlike many regional oil producers, Yemen relies heavily on foreign\noil companies that have production-sharing agreements with the government.\nIncome from oil production constitutes 70 to 75 percent of government revenue\nand about 90 percent of exports. Yemen contains proven crude oil reserves of\nmore than 9 billion barrels (1.4×109 m3), although that is falling from the\ncountry's older fields, which have been wrecked by war and corruption, both\ndriven by the fact that oil provides around 90% of the country's exports. The\nWorld Bank predicted that Yemen's oil and gas revenues would plummet during\n2009 and 2010, and fall to zero by 2017 as supplies ran out; the UK's Royal\nInstitute for International Affairs warned that instability in Yemen could\nexpand a zone of lawlessness from northern Kenya to Saudi Arabia, while\ndescribing Yemen's democracy as \"fragile\" and pointing to armed conflicts with\nIslamists and tribal insurgents as causes of instability. As a result, Western\nentities and other diplomats and leaders have an interest in maintaining\nYemen's stability averting adverse outcomes. According to statistics published\nby the Energy Information Administration, crude oil output averaged 413,300\nbarrels per day (65,710 m3/d) in 2005, a reduction from 423,700 bbl/d (67,360\nm3/d) in 2004. For the first eight months of 2006, crude oil output was flat,\naveraging 412,500 bbl/d (65,580 m3/d).\n\nFollowing a minor discovery in 1982 in the south, an American company found an\noil basin near Ma'rib in 1984. A total of 27,000 cubic metres per day (170,000\nbarrels per day) were produced there in 1995. A small oil refinery began\noperations near Ma'rib in 1986. A Soviet discovery in the southern governorate\nof Shabwah has proven only marginally successful even when taken over by a\ndifferent group. A Western consortium began exporting oil from Masila in the\nHadhramaut in 1993, and production there reached 67,000 m3/d (420,000 bbl/d)\nin 1999. There are new finds in the Jannah (formerly known as the Joint Oil\nExploration Area) and east Shabwah blocks. Yemen's oil exports in 1995 earned\nabout US$1 billion. Yemen's offshore oil and gas deposits are estimated to\ncontain billions of barrels of oil and gas. Marib oil contains associated\nnatural gas. In September 1995, the Yemeni Government signed an agreement that\ndesignated TotalEnergies of France to be the lead company for a project for\nthe export of liquefied natural gas (LNG). In 1997, Yemen Gas Company joined\nwith various privately held companies to establish Yemen LNG (YLNG). In August\n2005, the government gave final approval to three LNG supply agreements,\nenabling YLNG to award a $2 billion contract to an international consortium to\nbuild the country's first liquefaction plant at Balhat on the Arabian Sea\ncoast. The project is a $3.7 billion investment over 25 years, producing\napproximately 6.7 million tons of LNG annually, with shipments likely to go to\nthe United States and South Korea. Production of LNG began in October 2009.\nThe Yemen government expects the LNG project to add $350 million to its budget\nand enable it to develop a petrochemicals industry.",
    "openai_summarised_points": [
      "• Yemen is an oil producer with significant untapped offshore oil and gas deposits, relying heavily on foreign oil companies through production-sharing agreements with the government.",
      "• Income from oil production accounts for 70 to 75 percent of Yemen's government revenue and approximately 90 percent of its exports.",
      "• Yemen has proven crude oil reserves exceeding 9 billion barrels (1.4×10^9 m³), although reserves are declining due to damage to older fields caused by war and corruption.",
      "• Oil provides around 90 percent of Yemen's exports, underscoring the country's economic dependence on this sector.",
      "• The World Bank predicted that Yemen's oil and gas revenues would sharply decline during 2009 and 2010 and fall to zero by 2017 as oil supplies were depleted.",
      "• The UK's Royal Institute for International Affairs warned that instability in Yemen could extend a zone of lawlessness from northern Kenya to Saudi Arabia, describing Yemen's democracy as \"fragile\" and citing armed conflicts with Islamists and tribal insurgents as sources of instability.",
      "• Western entities, diplomats, and international leaders have vested interests in maintaining Yemen's stability to prevent adverse regional outcomes.",
      "• According to the U.S. Energy Information Administration, Yemen's crude oil output averaged 413,300 barrels per day (65,710 m³/d) in 2005, a decrease from 423,700 barrels per day (67,360 m³/d) in 2004.",
      "• For the first eight months of 2006, crude oil output remained steady, averaging 412,500 barrels per day (65,580 m³/d).",
      "• A minor oil discovery occurred in southern Yemen in 1982, followed by an American company discovering an oil basin near Ma'rib in 1984.",
      "• By 1995, the Ma'rib oil basin produced 27,000 cubic meters per day (170,000 barrels per day).",
      "• A small oil refinery near Ma'rib began operations in 1986.",
      "• A Soviet-discovered oil field in the southern governorate of Shabwah proved only marginally successful, even after being taken over by another group.",
      "• A Western consortium began exporting oil from the Masila field in Hadhramaut in 1993, with production reaching 67,000 m³/d (420,000 barrels per day) by 1999.",
      "• New oil finds have been reported in the Jannah block (formerly the Joint Oil Exploration Area) and east Shabwah blocks.",
      "• Yemen's oil exports in 1995 generated approximately US$1 billion in revenue.",
      "• Yemen's offshore oil and gas deposits are estimated to contain billions of barrels of oil and gas.",
      "• The Ma'rib oil fields contain associated natural gas reserves.",
      "• In September 1995, the Yemeni government signed an agreement designating TotalEnergies (France) as the lead company for a liquefied natural gas (LNG) export project.",
      "• In 1997, Yemen Gas Company partnered with various private companies to establish Yemen LNG (YLNG).",
      "• In August 2005, the Yemeni government granted final approval to three LNG supply agreements, enabling YLNG to award a $2 billion contract to an international consortium to build Yemen's first LNG liquefaction plant at Balhat on the Arabian Sea coast.",
      "• The LNG project represents a $3.7 billion investment over 25 years, with an expected annual production of approximately 6.7 million tons of LNG.",
      "• LNG shipments from Yemen are likely to be exported to the United States and South Korea.",
      "• LNG production commenced in October 2009.",
      "• The Yemeni government anticipates that the LNG project will contribute an additional $350 million annually to its budget and facilitate the development of a petrochemicals industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:42.860709",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3388,
      "bullet_points_count": 25
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Industry and manufacturing",
    "text": "The US government estimates that Yemen's industrial sector constitutes 47.2\npercent of gross domestic product (GDP). Together with services, construction,\nand commerce, industry accounts for less than 25 percent of the labor force.\nThe largest contributor to the manufacturing sector's output is oil refining,\nwhich generates roughly 40 percent of total revenue. The remainder of this\nsector consists of the production of consumer goods and construction\nmaterials. Manufacturing constituted approximately 9.5 percent of Yemen's GDP\nin 2005. In 2000 Yemen had almost 34,000 industrial establishments with a\ntotal of nearly 115,000 workers; the majority of the establishments were small\nbusinesses (one to four employees). Almost half of all industrial\nestablishments are involved in processing food products and beverages; the\nproduction of flour and cooking oil has increased in recent years.\nApproximately 10 percent of the establishments are classified as manufacturing\nmixed metal products, such as water-storage tanks, doors, and windows.",
    "openai_summarised_points": [
      "• The US government estimates that Yemen's industrial sector constitutes 47.2 percent of the country's gross domestic product (GDP).",
      "• Industry, combined with services, construction, and commerce, employs less than 25 percent of Yemen's labor force.",
      "• Oil refining is the largest contributor to the manufacturing sector's output, generating roughly 40 percent of total revenue within the sector.",
      "• The remainder of the manufacturing sector consists primarily of the production of consumer goods and construction materials.",
      "• Manufacturing accounted for approximately 9.5 percent of Yemen's GDP in the year 2005.",
      "• In 2000, Yemen had nearly 34,000 industrial establishments employing close to 115,000 workers.",
      "• The majority of these industrial establishments were small businesses, defined as having one to four employees.",
      "• Almost half of all industrial establishments in Yemen were involved in processing food products and beverages.",
      "• The production of flour and cooking oil in Yemen has increased in recent years.",
      "• Approximately 10 percent of Yemen's industrial establishments are classified as manufacturing mixed metal products, including items such as water-storage tanks, doors, and windows."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:35.178129",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1042,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Services and tourism",
    "text": "Economists have reported that Yemen's services sector constituted 51.7 percent\nof gross domestic product (GDP) in 2002 and 52.2 percent of GDP in 2003. The\nUS government estimated that the services sector accounted for 39.7 percent of\nGDP in 2004 and 39.3 percent in 2005.\n\nYemen's tourism industry is hampered by both limited infrastructure and\nsignificant security concerns. The country's hotels and restaurants are below\ninternational standards, and air and road transportation is largely\ninadequate. Kidnappings of foreign tourists remain a threat, especially\noutside the main cities. Coupled with terrorist bombings at the Port of Aden\nin 2000 and 2002, the threat of kidnappings presents a significant deterrent\nto tourism. In September 2006, tribesmen in the Shabwa province, east of\nSanaa, kidnapped four French tourists on their way to Aden; the tourists were\nfreed two weeks later. In October 2006, the U.S. Department of State\nreiterated warnings to U.S. citizens, strongly urging them to carefully\nconsider the risks of traveling to Yemen. Britain's Foreign Office issued a\nsimilar advisory. However, the number of tourist arrivals rose to 274,000 in\n2004 from 155,000 in 2003.",
    "openai_summarised_points": [
      "• Economists reported that Yemen's services sector constituted 51.7 percent of gross domestic product (GDP) in 2002 and increased slightly to 52.2 percent of GDP in 2003.",
      "• The US government estimated a lower contribution of the services sector to Yemen's GDP, accounting for 39.7 percent in 2004 and 39.3 percent in 2005.",
      "• Yemen's tourism industry faces significant challenges due to limited infrastructure and substantial security concerns.",
      "• The quality of Yemen's hotels and restaurants is below international standards, negatively impacting the tourism experience.",
      "• Air and road transportation infrastructure in Yemen is largely inadequate, further hindering tourism development.",
      "• Kidnappings of foreign tourists remain a persistent threat, particularly outside Yemen's main cities, deterring potential visitors.",
      "• Terrorist bombings at the Port of Aden in 2000 and 2002 have heightened security concerns and contributed to the deterrence of tourism.",
      "• In September 2006, tribesmen in the Shabwa province, located east of Sanaa, kidnapped four French tourists traveling to Aden; these tourists were released two weeks later.",
      "• In October 2006, the U.S. Department of State issued a travel warning, strongly urging U.S. citizens to carefully consider the risks associated with traveling to Yemen.",
      "• The British Foreign Office issued a similar advisory cautioning travelers about security risks in Yemen.",
      "• Despite these challenges, the number of tourist arrivals in Yemen increased significantly, rising to 274,000 in 2004 from 155,000 in 2003."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:41.220498",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1189,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Labor",
    "text": "According to the US government, the agriculture and herding sector employs the\nmajority of Yemen's working population (54.2 percent in 2003). Industry,\nservices, construction, and commerce collectively account for less than 25\npercent of the labor force.\n\nAccording to the World Bank, Yemen's civil service is characterized by a\nlarge, poorly paid work force and inadequate salary differential between high\nand low skilled jobs to attract and retain qualified workers. In 2004, the\ngovernment increased civil service salaries by 20 to 40 percent in order to\nalleviate the impact of anticipated economic reforms that were never\nimplemented. The result was a 20 percent rise in wage costs; civil service\nwages constituted 7 percent of gross domestic product (GDP) in 2004. The 2005\nbudget reduced economic subsidies, but in exchange the new budget required the\ngovernment to make various concessions, including increasing civil service\nwages another 10 to 15 percent by 2007 as part of a national wage strategy.\n\nThe economic assistance package that the International Monetary Fund (IMF)\npledged to Yemen is contingent on the implementation of civil service reform,\nwhich the government has resisted because of the country's estimated 20 to 40\npercent unemployment rate. In 2004, the government claimed to have reduced the\ncivil service labor force through retirements and layoffs, but it appears that\nthe large salary increases have lessened the impact of any reforms. The IMF\nhas stated that civil service salaries as a component of GDP should be reduced\nby 1 to 2 percent, a level that can only be achieved with continued reductions\nin the size of the civil service. It is unclear whether the national wage\nstrategy, which may succeed in streamlining the system and removing\nirregularities, will in fact be able to reduce employment costs.",
    "openai_summarised_points": [
      "• According to the US government, the agriculture and herding sector employed the majority of Yemen's working population, accounting for 54.2 percent in 2003.",
      "• Industry, services, construction, and commerce collectively comprised less than 25 percent of Yemen's labor force as of 2003.",
      "• The World Bank characterizes Yemen's civil service as having a large workforce that is poorly paid, with insufficient salary differentials between high-skilled and low-skilled jobs to attract and retain qualified personnel.",
      "• In 2004, the Yemeni government increased civil service salaries by 20 to 40 percent to mitigate the anticipated effects of economic reforms that ultimately were not implemented.",
      "• This salary increase resulted in a 20 percent rise in wage costs, with civil service wages constituting 7 percent of Yemen’s gross domestic product (GDP) in 2004.",
      "• The 2005 national budget reduced economic subsidies but required the government to make concessions, including plans to increase civil service wages by an additional 10 to 15 percent by 2007 as part of a national wage strategy.",
      "• The International Monetary Fund (IMF) pledged an economic assistance package to Yemen contingent upon the implementation of civil service reform, which the Yemeni government resisted due to the country’s estimated unemployment rate of 20 to 40 percent.",
      "• In 2004, the Yemeni government claimed to have reduced the civil service labor force through retirements and layoffs; however, the substantial salary increases appear to have diminished the impact of these reforms.",
      "• The IMF stated that civil service salaries as a percentage of GDP should be reduced by 1 to 2 percent, a target achievable only through continued reductions in the size of the civil service workforce.",
      "• It remains uncertain whether the national wage strategy, which aims to streamline the civil service system and eliminate irregularities, will effectively reduce employment costs in Yemen."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:47.480667",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1840,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Currency, exchange rate, and inflation",
    "text": "Yemen's currency is the Yemeni riyal (YR), which was floated on the open\nmarket in July 1996. Periodic intervention by the Central Bank of Yemen has\nenabled the riyal to gradually depreciate approximately 4 percent per year\nsince 1999. Its valued averaged YR191.5 per U.S. dollar in 2005, and has\naveraged YR197.5 in 2006. In late November 2006, the exchange rate was about\nYR198 per dollar. In March 2023 the exchange rate for new rials in government-\ncontrolled areas was YR1,252 on average.\n\nDuring the years immediately following unification (1990–96), Yemen\nexperienced a very high average rate of inflation, at 40%. Economic reforms\nbrought the inflation rate down to only 5.4 percent in 1997, but high oil\nprices and cuts in the fuel subsidy in recent years have had a negative impact\non the inflation rate, which has generally been on the rise despite some\nfluctuations. In 2004, efforts by the Central Bank of Yemen to tighten the\nmoney supply were offset by a weakening U.S. dollar - to which the Yemeni\nriyal is linked in a managed float - and by rising global commodity prices,\nresulting in an inflation rate of 12.5%. In 2018 the inflation rate was\n33.65%.\n\nIn July 2005, the government succumbed to public opposition and lowered the\nnew general sales tax from 10 to 5 percent. There are special rates for\ntelecommunication mobile services (10%) and cigarettes (90%).",
    "openai_summarised_points": [
      "• Yemen's official currency is the Yemeni riyal (YR), which was floated on the open market in July 1996, allowing its value to be determined by market forces rather than a fixed rate.",
      "• Since 1999, the Central Bank of Yemen has periodically intervened in the currency market to enable the Yemeni riyal to gradually depreciate at an approximate rate of 4 percent per year.",
      "• The exchange rate of the Yemeni riyal averaged YR191.5 per U.S. dollar in 2005 and slightly depreciated to an average of YR197.5 per U.S. dollar in 2006.",
      "• By late November 2006, the exchange rate was approximately YR198 per U.S. dollar, indicating a continued gradual depreciation of the currency.",
      "• In March 2023, the exchange rate for new Yemeni rials in government-controlled areas averaged YR1,252 per U.S. dollar, reflecting significant depreciation over time.",
      "• Following Yemen’s unification in 1990, the country experienced a very high average inflation rate of 40% during the period 1990–1996, indicating severe inflationary pressures in the immediate post-unification years.",
      "• Economic reforms implemented by the government successfully reduced the inflation rate to 5.4 percent in 1997, demonstrating initial stabilization efforts.",
      "• Despite these reforms, inflation generally increased in subsequent years due to factors such as high oil prices and reductions in fuel subsidies, which negatively impacted the inflation rate despite some fluctuations.",
      "• In 2004, the Central Bank of Yemen attempted to tighten the money supply to control inflation; however, these efforts were offset by a weakening U.S. dollar— to which the Yemeni riyal is linked in a managed float system—and rising global commodity prices, resulting in an inflation rate of 12.5%.",
      "• By 2018, the inflation rate had risen significantly to 33.65%, reflecting ongoing economic challenges and inflationary pressures in Yemen.",
      "• In July 2005, the Yemeni government reduced the new general sales tax from 10% to 5% in response to public opposition, indicating sensitivity to social and political pressures regarding taxation.",
      "• Special sales tax rates apply to certain goods and services, including a 10% tax on telecommunication mobile services and a notably high 90% tax on cigarettes, reflecting targeted fiscal policies on specific sectors."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:50.640599",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1380,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Banking and finance",
    "text": "According to economists, Yemen's financial services sector is underdeveloped\nand dominated by the banking system. Yemen has no public stock exchange. The\nbanking system consists of the Central Bank of Yemen, 15 commercial banks\n(nine private domestic banks, four of which are Islamic banks; four private\nforeign banks; and two state-owned banks), and two specialized state-owned\ndevelopment banks. The Central Bank of Yemen controls monetary policy and\noversees the transfer of currencies abroad. It is the lender of last resort,\nexercises supervisory authority over commercial banks, and serves as a banker\nto the government. Since the end of 2005 and up to the end of 2010, Tadhamon\nInternational Islamic Bank has maintained the top spot of all banks in Yemen\n(both Commercial and Islamic) in terms of total assets, capital, and trade\nbusiness. The largest commercial bank, the state-owned Credit and Agricultural\nCooperative Bank, and the majority state-owned Yemen Bank for Reconstruction\nand Development are each currently being restructured with the goal of\neventual privatization. Because of fiscal difficulties in both banks, Yemen\ngovernment adopted a plan to merge all three banks in 2004; the new publicly\nowned Development Bank will have a minimum capital of US$50 million. As of\nApril 2011, this step has not yet materialized.\n\nThe large volume of non-performing loans, low capitalization, and weak\nenforcement of regulatory standards hamper Yemen's banking sector as a whole.\nNumerous banks are technically insolvent. Because many debtors are in default,\nYemen's banks limit their lending activities to a select group of consumers\nand businesses. As a result, the entire banking system holds less than 60\npercent of the money supply; the bulk of the economy operates with cash.\nLegislation adopted in 2000 gave the Central Bank the authority to enforce\ntougher lending requirements, and in mid-2005 the Central Bank promulgated\nseveral new capital requirements for commercial banks, together aimed at\ncurtailing currency speculation and protecting deposits.\n\nIn March 2023, the Houthi-controlled parliament in Sana’a passed a law banning\nthe charging of interest. MP Ahmed Saif said the law would have catastrophic\nconsequences for banks and citizens, the Minister of Finance and the governor\nof the Sana’a-based Central Bank of Yemen refused to endorse the law publicly,\nand a Sana’a banking official said that religious hardliners in the Houthi\nmovement had pushed for the legislation.",
    "openai_summarised_points": [
      "• Yemen's financial services sector is considered underdeveloped by economists and is primarily dominated by the banking system, with no public stock exchange present in the country.",
      "• The banking system in Yemen comprises the Central Bank of Yemen, 15 commercial banks (including nine private domestic banks—four of which are Islamic banks—four private foreign banks, and two state-owned banks), as well as two specialized state-owned development banks.",
      "• The Central Bank of Yemen is responsible for controlling monetary policy, overseeing currency transfers abroad, acting as the lender of last resort, supervising commercial banks, and serving as the government's banker.",
      "• From the end of 2005 through the end of 2010, Tadhamon International Islamic Bank consistently ranked as the top bank in Yemen—across both commercial and Islamic banks—in terms of total assets, capital, and trade business.",
      "• The largest commercial bank, the state-owned Credit and Agricultural Cooperative Bank, along with the majority state-owned Yemen Bank for Reconstruction and Development, are undergoing restructuring aimed at eventual privatization.",
      "• Due to fiscal difficulties faced by these two banks, the Yemeni government adopted a plan in 2004 to merge them with a third bank to form a new publicly owned Development Bank, which was to have a minimum capital of US$50 million; however, as of April 2011, this merger had not yet been realized.",
      "• Yemen’s banking sector is significantly hampered by a large volume of non-performing loans, low capitalization levels, and weak enforcement of regulatory standards, resulting in many banks being technically insolvent.",
      "• Due to widespread debtor defaults, Yemeni banks restrict their lending activities to a limited group of consumers and businesses, causing the banking system to hold less than 60 percent of the money supply, with the majority of economic transactions conducted in cash.",
      "• Legislation passed in 2000 empowered the Central Bank to enforce stricter lending requirements, and in mid-2005, the Central Bank introduced new capital requirements for commercial banks aimed at curbing currency speculation and safeguarding deposits.",
      "• In March 2023, the Houthi-controlled parliament in Sana’a enacted a law banning the charging of interest, a move criticized by MP Ahmed Saif as having potentially catastrophic consequences for both banks and citizens.",
      "• The Minister of Finance and the governor of the Sana’a-based Central Bank of Yemen publicly refused to endorse the 2023 anti-interest law, while a Sana’a banking official indicated that religious hardliners within the Houthi movement had driven the legislation."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:53.761145",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2501,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Energy",
    "text": "Yemen's state-owned Public Electricity Corporation (PEC) operates an estimated\n80 percent of the country's electricity generating capacity (810–900\nmegawatts) as well as the national power grid. Over the past 10 years, the\ngovernment has considered various means of alleviating the country's\nsignificant electricity shortage, including restructuring the PEC, integrating\nthe power sector through small-scale privatization of power stations, creating\nindependent power projects (IPPs), and introducing gas-generated power plants\nto free up oil supplies for export. However, because of inadequate\ninfrastructure, large-scale IPPs and privatization proposals have failed to\nmaterialize; several smaller-scale projects in Mukalla and Aden, however, have\nbeen completed, and contracts have been signed for future projects. In 2004,\nYemen's diesel-run power plants generated 4.1 billion kilowatt-hours of\nelectricity, a level of production that is insufficient to maintain a\nconsistent supply of electricity. Although demand for electricity increased 20\npercent between 2000 and 2004, it is estimated that only 40 percent of the\ntotal population has access to electricity from the national power grid, and\nsupply is intermittent. To meet this demand, the government plans to increase\nthe country's power generating capacity to 1,400 megawatts by 2002.",
    "openai_summarised_points": [
      "• Yemen's state-owned Public Electricity Corporation (PEC) operates approximately 80 percent of the country's electricity generating capacity, estimated between 810 and 900 megawatts, as well as managing the national power grid.",
      "• Over the past decade, the Yemeni government has explored various strategies to address the country's significant electricity shortage, including restructuring the PEC, integrating the power sector through small-scale privatization of power stations, establishing independent power projects (IPPs), and introducing gas-generated power plants to conserve oil supplies for export.",
      "• Due to inadequate infrastructure, large-scale independent power projects (IPPs) and privatization initiatives have not been realized; however, several smaller-scale projects have been successfully completed in the cities of Mukalla and Aden, with contracts signed for additional future projects.",
      "• In 2004, Yemen's diesel-run power plants produced 4.1 billion kilowatt-hours of electricity, a production level insufficient to ensure a consistent and reliable electricity supply across the country.",
      "• Between 2000 and 2004, electricity demand in Yemen increased by 20 percent, yet it is estimated that only 40 percent of the total population has access to electricity from the national power grid, with supply remaining intermittent.",
      "• To address growing demand, the Yemeni government planned to increase the country's power generating capacity to 1,400 megawatts by the year 2002."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:30:54.224843",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1345,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Government budget",
    "text": "In 1995, in order to comply with conditions stipulated by the International\nMonetary Fund (IMF), Yemen began an economic reform program, one component of\nwhich is fiscal policy reform aimed at reducing deficits and expanding the\nrevenue base. However, the government has failed to significantly reduce its\nprimary expenditure—subsidies, especially the fuel subsidy. In January 2005,\nYemen's parliament narrowly adopted a 2005 budget that forecast a reduced\nbudget deficit of about 3 percent of gross domestic product (GDP). The budget\nwas predicated on the adoption of a reform package that included a broad-\nbased, 10 percent general sales tax (GST) and a 75 percent reduction in the\nfuel subsidy. Strong public opposition to these reforms led the government in\nJuly 2005 to defer the 10 percent GST for 18 months, adopting instead a hybrid\n5 percent GST, and to modify the fuel subsidy reduction. Nonetheless, the cost\nof subsidies, primarily for fuel, rose dramatically (almost 90 percent) in\n2005, accounting for the largest share (almost 25 percent) of total government\nexpenditures and approximately 9 percent of GDP. These costs, coupled with a\n24 percent increase in civil service wages and salaries and a 42 percent\nincrease in defense spending, resulted in a government budget deficit of\nUS$350.8 million, or more than 2 percent of GDP, in 2005. The government has\nbudgeted a sharp (41 percent) rise in overall spending for 2006, which\neconomists estimate will result in a fiscal deficit of US$800 million, or 4.2\npercent of GDP."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "History and overview",
    "text": "During the 1990–91 Persian Gulf War, Yemen supported Iraq in its invasion of\nKuwait, thereby alienating Saudi Arabia and Kuwait, which both had provided\ncritical financial assistance to Yemen. In addition to withdrawing this aid,\nSaudi Arabia expelled almost 1 million Yemeni workers. The resultant fall in\nexpatriate remittances had a disastrous impact on Yemen's governmental budget.\nThe civil war of 1994 further drained the economy, and in 1995 Yemen sought\nthe aid of multilateral agencies. In 1996 the International Monetary Fund\n(IMF) granted Yemen a US$190 million stand-by credit facility, and the\nfollowing year it approved two funding facilities that increased the country's\ncredit by approximately US$500 million. The funding was contingent on Yemen's\nadoption of stringent economic reforms, a requirement that the country had\nlimited success in fulfilling. As a result, the IMF suspended lending to Yemen\nfrom late 1999 until February 2001. The extension of the two funding\nfacilities, particularly the poverty reduction and growth facility (PRGF),\nthrough October 2001 was again contingent on Yemen's commitment to economic\nreform. Because of Yemen's failure to comply sufficiently with the terms\nimposed by the IMF, since 2002 the IMF has withheld US$300 million in\nconcessional financing. Discussions over the renewal of the PRGF are ongoing.\nIn 2000 Kuwait and Saudi Arabia resumed financial aid to Yemen.\n\nIn October 2002, bilateral and multilateral lenders led by the World Bank\nagreed to give Yemen a four-year economic support package worth US$2.3\nbillion, 20 percent in grants and 80 percent in concessional loans. This\nfunding is almost eight times the amount of financial support Yemen received\nunder the IMF's PRGF. However, in December 2005 the World Bank announced that\nbecause of the government's continued inability to effect significant economic\nreforms and stem corruption, funding would be reduced by more than one-third,\nfrom US$420 million to US$240 million for the period July 2005 – July 2008. In\nMay 2006, the World Bank adopted a new Country Assistance Strategy (CAS) for\nYemen for the period FY 2006 to FY 2009, providing a blueprint for fostering\nthe country's fiscal and human development improvement. The bank pledged to\ncontribute approximately US$400 million in International Development\nAssociation (IDA) credits over the CAS time frame. At present, Yemen owes\napproximately US$264 million to Japan, one of its largest donors. In December\n2005, the Japanese government pledged to write off US$17 million of the debt.\nThat same month, Germany pledged to increase its annual aid to Yemen to\nUS$83.6 million over the next two years; funding will go primarily to\neducation and water improvement projects. In November 2006, the United Kingdom\nannounced that aid to Yemen would increase 400 percent, to US$222 million\nthrough 2011.\n\nYemen is a member of the Arab Fund for Economic and Social Development, which\nsince 1974 has contributed to the financing of economic and social development\nin Arab states and countries through loans and guarantees. In March 2004, the\nArab League provided US$136 million to Yemen to finance infrastructure\nimprovements. At a mid-November 2006 meeting in London, a group of bilateral\nand multilateral donors pledged US$4.7 billion over four years (2007–10) to\nfund economic development in Yemen. The goal of the meeting, which was jointly\nchaired by the World Bank and the government of Yemen, was to provide\nsufficient economic aid to Yemen to enable it to qualify for future Gulf\nCooperation Council (GCC) membership. More than 55 percent of the aid, which\nis primarily in the form of grants, will come from the GCC. Yemen was granted\nobserver status at the World Trade Organization (WTO) in 1999, and its\napplication for full membership was under negotiation as of December 2006."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7.2",
    "section_name": "Foreign trade",
    "text": "Imports totaled an estimated US$4.7 billion in 2005 and are projected to\nincrease to US$5 billion in 2006 and to US$5.4 billion in 2007. Yemen is a net\nimporter of all major categories of products except fuels. Principal imports\nare machinery and transport equipment, food and livestock, and processed\nmaterials. According to the United Nations, Yemen imports more than 75 percent\nof its main dietary staple—wheat. The principal source of Yemen's imports in\n2005 was the United Arab Emirates (13.4 percent of total imports); the bulk of\nthese imports are actually re-exports from the United States and Kuwait. Yemen\nreceived 10.6 percent of its total imports from Saudi Arabia and 9 percent\nfrom China.\n\nIn 2005 Yemen's exports totaled US$6.4 billion. Exports are expected to\nincrease to reach a record US$8.6 billion in 2006 as a result of strong oil\nrevenues. Petroleum is Yemen's main export, accounting for 92 percent of total\nexports in 2004 and 87 percent in 2005. Yemen's non-oil exports are primarily\nagricultural products, mainly fish and fish products, vegetables, and fruits.\nIn 2005 Asia was the most important market for Yemen's exports, primarily\nChina (37.3 percent of total exports), Thailand, and Japan. Chile was also a\nprimary export market (19.6 percent of total exports).\n\nYemen's import and export values have increased and decreased dramatically in\nthe past 10 years owing to shifts in global oil prices. As a result, the\ncountry's trade balance has fluctuated significantly from a deficit of almost\nUS$800 million in 1998 to a surplus of US$1 billion in 2000. Rising oil prices\nresulted in a surplus of US$817 million in 2004 and a surplus of US$1.7\nbillion in 2005.\n\nIn recent years, Yemen has reported increasing non-merchandise deficits. These\ndeficits have, however, been offset by record export earnings, which have\nresulted in large enough trade surpluses to keep the current account in\nsurplus—US$175.7 million in 2003, US$524.6 million in 2004, and US$633.1\nmillion (about 4 percent of gross domestic product) in 2005."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7.3",
    "section_name": "External debt",
    "text": "In 1990 the newly unified Republic of Yemen inherited an unsustainable debt\nburden amounting to roughly 106 percent of gross domestic product. Debt\nrescheduling by the Paris Club creditor countries in the 1990s coupled with\nassistance from the World Bank's International Development Agency resulted in\na drop in Yemen's debt stock to US$5.4 billion (an estimated 39 percent of\ngross domestic product) by year-end 2004. According to the Central Bank of\nYemen, Yemen's debt stock was US$5.2 billion (an estimated 33 percent of gross\ndomestic product) by year-end 2005. According to the U.S. government, Yemen's\nreserves of foreign exchange and gold were US$6.1 billion in 2005."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7.4",
    "section_name": "Foreign investment",
    "text": "Yemen does not have a stock exchange, therefore limiting inward portfolio\ninvestment. Portfolio investment abroad is also very limited, with the result\nthat portfolio flows are largely unrecorded by authorities. In the early\n1990s, net direct investment was at its peak as foreign investors tapped\nYemeni oil reserves, but since 1995 net direct investment flows have been\nnegative because cost recovery for foreign oil companies has exceeded new\ndirect investment. A five-year US$3 billion liquid natural gas (LNG)\nconstruction project involving a consortium of foreign companies is planned\nfollowing government approval in August 2005. Such a project raises the\nprospect of increased foreign investment in the future as LNG facilities are\nbuilt."
  },
  {
    "chapter_name": "Economy of Yemen",
    "chapter_id": "1",
    "section_number": "7.5",
    "section_name": "International aid",
    "text": "Beginning in the mid-1950s, the Soviet Union and China provided large-scale\nassistance. For example, China was involved with the expansion of the Sana'a\nInternational Airport. In the south, pre-independence economic activity was\noverwhelmingly concentrated in the port city of Aden. The seaborne transit\ntrade, which the port relied upon, collapsed with the temporary closure of the\nSuez Canal and Britain's withdrawal from Aden in 1967.[_citation needed_]\n\nIn early 1995, the government of Yemen launched an economic, financial, and\nadministrative reform program (EFARP) with the support of the World Bank and\nthe IMF, as well as international donors. These programs had a positive impact\non Yemen's economy and led to the reduction of the budget deficit to less than\n3% of gross domestic product during the period 1995–1999 and the correction of\nmacro-financial imbalances. The real growth rate in the non-oil sector rose by\n5.6% from 1995 to 1997.\n\nYemen is missing some international support because, as of 2024, it is one of\nthree countries which have not ratified the Paris Agreement to limit climate\nchange."
  }
]