[
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Tajikistan** is dependent upon agriculture and services.\nSince independence, Tajikistan has gradually followed the path of transition\neconomy, reforming its economic policies. With foreign revenue precariously\ndependent upon exports of cotton and aluminium, the economy is highly\nvulnerable to external shocks. Tajikistan's economy also incorporates a\nmassive black market, primarily focused on the drug trade with Afghanistan.\nHeroin trafficking in Tajikistan is estimated to be equivalent to 30-50% of\nnational GDP as of 2012.\n\nIn the fiscal year (FY) 2000, international assistance remained an essential\nsource of support for rehabilitation programs that reintegrated former\ncombatants of the Tajikistani Civil War into the civilian economy, thus\nhelping maintain the peace. International assistance also was necessary to\naddress the second year of severe drought that resulted in a continued\nshortfall of food production. Tajikistan's economy grew substantially after\nthe war. The gross domestic product (GDP) of Tajikistan expanded at an average\nrate of 9.6% over the period of 2000-2007 according to the World Bank data.\nThis improved Tajikistan's position among other Central Asian countries\n(namely Turkmenistan and Uzbekistan), which have degraded economically ever\nsince. As of August 2009, an estimated 60% of Tajikistani citizens live below\nthe poverty line. The 2008 financial crisis hit Tajikistan hard, both\ndomestically and internationally. Tajikistan has been hit harder than many\ncountries because it already has a high poverty rate and because many of its\ncitizens depend on remittances from expatriate Tajikistanis.",
    "openai_summarised_points": [
      "• The economy of Tajikistan is primarily dependent on agriculture and services sectors.",
      "• Since gaining independence, Tajikistan has progressively transitioned towards a market economy by reforming its economic policies.",
      "• The country’s foreign revenue is precariously reliant on exports of cotton and aluminium, making its economy highly susceptible to external shocks.",
      "• Tajikistan’s economy includes a substantial black market, largely centered on drug trafficking, particularly heroin from Afghanistan.",
      "• As of 2012, heroin trafficking in Tajikistan was estimated to constitute between 30% and 50% of the national GDP.",
      "• In the fiscal year 2000, international assistance was crucial for funding rehabilitation programs aimed at reintegrating former combatants of the Tajikistani Civil War into civilian economic activities, thereby contributing to peace maintenance.",
      "• International aid was also necessary in 2000 to mitigate the effects of a severe drought, which caused a continued shortfall in food production for the second consecutive year.",
      "• Following the civil war, Tajikistan’s economy experienced significant growth, with the gross domestic product (GDP) expanding at an average annual rate of 9.6% from 2000 to 2007, according to World Bank data.",
      "• This economic growth improved Tajikistan’s standing relative to other Central Asian countries such as Turkmenistan and Uzbekistan, which experienced economic decline during the same period.",
      "• Despite economic growth, as of August 2009, approximately 60% of Tajikistan’s population lived below the poverty line.",
      "• The 2008 global financial crisis severely impacted Tajikistan both domestically and internationally.",
      "• Tajikistan was disproportionately affected by the financial crisis due to its already high poverty rate and the heavy dependence of many citizens on remittances sent by Tajik expatriates abroad."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:08:11.466593",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1652,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "This is a chart of trend of gross domestic product of Tajikistan at market\nprices estimated by the International Monetary Fund with figures in millions\nof ruling currency.\n\nYear | Gross Domestic Product | US Dollar Exchange\n---|---|---\n1995 | 65,000 | 123.33 Tajik roubles\n2000 | 1,807 | 1.82 somoni\n2005 | 7,201 | 3.11 somoni\n\nFor purchasing power parity comparisons, the US Dollar is exchanged at SM 0.82\nonly.\n\nThe Tajikistani economy has been gravely weakened by six years of civil\nconflict and loss of markets for its products. Tajikistan thus depends on\ninternational humanitarian assistance for much of its basic subsistence needs.\nEven if the peace agreement of June 1997 is honoured, the country faces major\nproblems in integrating refugees and former combatants into the economy. The\nfuture of Tajikistan's economy and the potential for attracting foreign\ninvestment depend upon stability and continued progress in the peace process.\n\nIn 2006 GDP per capita of Tajikistan was 85% of 1990s level. While population\nhas increased from 5.3 million in 1991 to 7.3 million in 2009.\n\nDespite resistance from vested interests, the Government of Tajikistan\ncontinued to pursue macroeconomic stabilization and structural reform in FY\n2000. In December 1999, the government announced that small-enterprise\nprivatization had been successfully completed, and the privatization of\nmedium-sized and large-owned enterprises (SOEs) continued incrementally. The\ncontinued privatization of medium-sized and large SOEs, land reform, and\nbanking reform and restructuring remain top priorities. Shortly after the end\nof FY 2000, the Board of the International Monetary Fund gave its vote of\nconfidence to the government's recent performance by approving the third\nannual Poverty Reduction and Growth Facility Loan for Tajikistan. Improved\nfiscal discipline by the Government of Tajikistan has supported the return to\npositive economic growth. The government budget was nearly in balance in 2001\nand the government's 2002 budget targets a fiscal deficit of 0.3% of GDP,\nincluding recent increases in social sector spending.\n\nThe following table shows the main economic indicators in 1997–2024.\n\nYear  | GDP\n(in billion US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP\n(in billion US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Gov. debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1993  | 6.43  | 1,154  | 0.68  | −11.1%  | 2,600.7%  | n/a\n1994  | 5.17  | 921  | 0.83  | −21.4%  | 350.4%  | n/a\n1995  | 4.61  | 814  | 0.57  | −12.5%  | 612.5%  | n/a\n1996  | 4.49  | 784  | 1.05  | −4.4%  | 418.5%  | n/a\n1997  | 4.65  | 798  | 1.12  | 1.7%  | 88.0%  | n/a\n1998  | 4.95  | 834  | 1.32  | 5.3%  | 43.2%  | 96.6%\n1999  | 5.21  | 851  | 1.09  | 3.7%  | 27.5%  | 107.8%\n2000  | 5.77  | 928  | 0.99  | 8.3%  | 32.9%  | 111.4%\n2001  | 6.50  | 1,027  | 1.06  | 10.2%  | 38.6%  | 99.4%\n2002  | 7.20  | 1,116  | 1.21  | 9.1%  | 12.2%  | 98.3%\n2003  | 8.09  | 1,230  | 1.56  | 10.2%  | 16.4%  | 69.8%\n2004  | 9.19  | 1,369  | 2.07  | 10.6%  | 7.2%  | 49.4%\n2005  | 10.11  | 1,475  | 2.31  | 6.7%  | 7.3%  | 45.8%\n2006  | 11.15  | 1,593  | 2.81  | 7.0%  | 10.0%  | 36.8%\n2007  | 12.35  | 1,726  | 3.71  | 7.8%  | 13.2%  | 34.3%\n2008  | 13.58  | 1,858  | 5.14  | 7.9%  | 20.4%  | 30.2%\n2009  | 14.20  | 1,900  | 4.98  | 3.9%  | 6.4%  | 36.9%\n2010  | 15.30  | 2,002  | 5.64  | 6.5%  | 6.5%  | 36.8%\n2011  | 16.77  | 2,146  | 6.52  | 7.4%  | 12.4%  | 35.5%\n2012  | 18.37  | 2,297  | 7.59  | 7.5%  | 5.8%  | 32.5%\n2013  | 20.06  | 2,453  | 8.51  | 7.4%  | 5.0%  | 29.3%\n2014  | 21.78  | 2,604  | 9.24  | 6.7%  | 6.1%  | 27.9%\n2015  | 23.30  | 2,726  | 7.86  | 6.0%  | 5.8%  | 35.0%\n2016  | 25.15  | 2,879  | 6.99  | 6.9%  | 5.9%  | 42.2%\n2017  | 27.41  | 3,073  | 7.54  | 7.1%  | 7.3%  | 46.3%\n2018  | 28.57  | 3,137  | 7.76  | 7.6%  | 3.8%  | 46.6%\n2019  | 32.97  | 3,549  | 8.30  | 7.4%  | 7.8%  | 43.5%\n2020  | 35.62  | 3,760  | 8.13  | 4.4%  | 8.6%  | 51.8%\n2021  | 39.73  | 4,114  | 8.93  | 9.4%  | 9.0%  | 42.1%\n2022  | 45.96  | 4,673  | 10.49  | 8.0%  | 6.6%  | 32.5%\n2023  | 51.55  | 5,148  | 11.86  | 8.3%  | 3.7%  | 30.9%\n2024  | 56.37  | 5,533  | 13.00  | 6.8%  | 4.5%  | 30.7%"
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Gross domestic product",
    "text": "Real GPD per capita development of Tajikistan\n\nIn 2005 Tajikistan's GDP grew by 6.7%, to about US$1.89 billion, and growth\nfor 2006 was about 8%, marking the fifth consecutive year of annual growth\nexceeding 6%. The official forecast for GDP growth in 2007 is 7.5%. Per capita\nGDP in 2005 was US$258, lowest among the 15 countries of the former Soviet\nUnion. In 2005 services contributed 48%, agriculture 23.4%, and industry 28.6%\nto GDP. The recent global recession has reduced Tajikistan's GDP growth rate\nto 2.8% in the first half of 2009. Remittances from expatriate Tajikistanis is\nestimated to account for 30-50% of Tajikistan's GDP.",
    "openai_summarised_points": [
      "• In 2005, Tajikistan's Gross Domestic Product (GDP) grew by 6.7%, reaching approximately US$1.89 billion.",
      "• The GDP growth rate for 2006 was about 8%, marking the fifth consecutive year with annual growth exceeding 6%.",
      "• The official forecast for Tajikistan's GDP growth in 2007 was projected at 7.5%.",
      "• In 2005, Tajikistan's per capita GDP was US$258, the lowest among the 15 countries of the former Soviet Union.",
      "• The composition of Tajikistan's GDP in 2005 included 48% from services, 23.4% from agriculture, and 28.6% from industry.",
      "• The global recession led to a reduction in Tajikistan's GDP growth rate to 2.8% during the first half of 2009.",
      "• Remittances from expatriate Tajikistanis were estimated to account for between 30% and 50% of Tajikistan's GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:08:10.750101",
      "openai_model": "gpt-4.1-mini",
      "content_length": 639,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "Although the government has announced an expedited land reform program, many\nSoviet-era state farms still existed in 2006, and the state retains control of\nproduction and harvesting on privatized farms. Privatization of cotton farms\nhas been especially slow, and unresolved debts of cotton farmers remained a\nproblem in 2006. In the early 2000s, the major crops were cotton (which\noccupied one-third of arable land in 2004 but decreased after that date),\ncereals (mainly wheat), potatoes, vegetables (mainly onions and tomatoes),\nfruits, and rice. Cotton makes an important contribution to both the\nagricultural sector and the national economy. Cotton accounts for 60 percent\nof agricultural output, supports 75 percent of the rural population, and uses\n45 percent of irrigated arable land. More than 80% of the 8,800 square\nkilometers of land in use for agriculture depends on irrigation. Tajikistan\nmust import grain from Kazakhstan and Uzbekistan.\n\nTajikistan produced in 2018:\n\n* 964 thousand tons of potato;\n* 778 thousand tons of wheat;\n* 680 thousand tons of onion;\n* 641 thousand tons of watermelon;\n* 443 thousand tons of tomato;\n* 356 thousand tons of carrot;\n* 308 thousand tons of vegetable;\n* 300 thousand tons of cotton;\n* 241 thousand tons of grape;\n* 238 thousand tons of apple;\n* 237 thousand tons of maize;\n* 211 thousand tons of cucumber;\n* 116 thousand tons of cabbage;\n* 108 thousand tons of barley;\n* 90 thousand tons of rice;\n\nIn addition to smaller productions of other agricultural products, like\napricot (31 thousand tons)."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Forestry",
    "text": "3% of Tajikistan is forested, mainly at elevations between 1,000 and 3,000\nmeters. No forest region is classified as commercially usable; most are under\nstate protection. Wood production is negligible, but local inhabitants harvest\nnon-wood forest products.",
    "openai_summarised_points": [
      "• Forests cover approximately 3% of Tajikistan's land area, predominantly located at elevations ranging from 1,000 to 3,000 meters above sea level.",
      "• None of the forested regions in Tajikistan are classified as commercially usable for timber or large-scale wood production.",
      "• The majority of forest areas in Tajikistan are under state protection, limiting exploitation and commercial activities.",
      "• Wood production in Tajikistan is negligible due to the limited forest resources and protective regulations.",
      "• Local inhabitants primarily harvest non-wood forest products from these forested areas, relying on them for subsistence and local use rather than commercial purposes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:08:07.680996",
      "openai_model": "gpt-4.1-mini",
      "content_length": 257,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Fishing",
    "text": "Streams and lakes produce a limited amount of fish, and some fish is produced\nby aquaculture. In 2003 some 158 tons of fish were caught and 167 tons raised\non fish farms.",
    "openai_summarised_points": [
      "• Streams and lakes in Tajikistan produce a limited quantity of fish, indicating a relatively small-scale natural fishery sector.",
      "• Aquaculture contributes to fish production in Tajikistan, supplementing the limited catch from natural water bodies.",
      "• In the year 2003, Tajikistan's total fish catch from natural sources amounted to approximately 158 tons.",
      "• During the same year, fish farms in Tajikistan raised around 167 tons of fish, slightly exceeding the quantity caught from natural streams and lakes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:08:06.756304",
      "openai_model": "gpt-4.1-mini",
      "content_length": 170,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Mining and minerals",
    "text": "Tajikistan has rich deposits of gold, silver, and antimony. The largest silver\ndeposits are in Sughd Province, where Tajikistan's largest gold mining\noperation is also located. Russia's Norilsk nickel company has explored a\nlarge new silver deposit at Bolshoy Kanimansur. Tajikistan also produces\nstrontium, salt, lead, zinc, fluorspar, and mercury. Uranium, an important\nmineral in the Soviet era, remains in some quantity but is no longer\nextracted. Fossil fuel deposits are limited to coal, of which about 30,000\ntons are mined annually. Tajikistan's extensive aluminium processing industry\ndepends entirely on imported ore.",
    "openai_summarised_points": [
      "• Tajikistan possesses rich mineral deposits, including gold, silver, and antimony, which constitute significant components of its mining sector.",
      "• The largest silver deposits in Tajikistan are located in Sughd Province, which is also home to the country's largest gold mining operation.",
      "• Russia's Norilsk Nickel company has conducted exploration activities and discovered a large new silver deposit at Bolshoy Kanimansur in Tajikistan.",
      "• In addition to gold and silver, Tajikistan produces other minerals such as strontium, salt, lead, zinc, fluorspar, and mercury, contributing to the diversity of its mineral resources.",
      "• Uranium, once an important mineral resource during the Soviet era, still exists in some quantity in Tajikistan but is no longer actively extracted.",
      "• Fossil fuel deposits in Tajikistan are limited, with coal being the primary fossil fuel mined; approximately 30,000 tons of coal are extracted annually.",
      "• Tajikistan has an extensive aluminium processing industry; however, this industry relies entirely on imported ore, as the country does not have sufficient domestic bauxite or aluminium ore deposits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:08:10.930314",
      "openai_model": "gpt-4.1-mini",
      "content_length": 627,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Industry and manufacturing",
    "text": "The output of most industries declined sharply during the mid-1990s; despite\nwidespread privatization, in the early 2000s industry rallied very slowly. In\n2006 an estimated one-third of Tajikistan's 700 major industrial enterprises\nwere completely idle, and the remainder were operating at 20 or 25% of\ncapacity. The causes are outmoded equipment, low investment levels, and lack\nof markets. To revitalize the sector, in 2006 the government was considering\nrenationalizing some enterprises. Tajikistan's only major heavy industries are\naluminium processing and chemical production. The former, which provided 40%\nof industrial production in 2005, is centered at the Tursunzoda processing\nplant, the latter in Dushanbe, Qurghonteppa, and Yovon. Aluminium production\nincreased by 6% in 2005. Some small light industrial plants produce textiles\nand processed foods, using mainly domestic agricultural products. The textile\nindustry processes about 20% of domestically grown cotton. The expansion of\nlight industry output contributed significantly to GDP growth in 2005. The\nconstruction industry, about half of which is state-owned, has suffered from\nlow investment in capital projects and from shoddy workmanship that has\ndiscouraged international contracts. However, new infrastructure projects and\nincreased housing construction brought a 60% increase in output from 2004 to\n2005. As of 2009, one third of industrial plants and factories are inactive,\naccording to Tajikistan's Institute of Economic Studies. Industrial output has\nfallen by 13% in the first six months of 2009, leading to a fall in export\nrevenues of 48%."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Energy",
    "text": "The rivers of Tajikistan, such as the Vakhsh and the Panj, have great\nhydropower potential, and the government has focused on attracting investment\nfor projects for internal use and electricity exports. Tajikistan is home to\nthe hydroelectric power station Nurek, the second highest dam in the world.\nSangtuda 1 Hydroelectric Power Plant of 670 megawatts (MW) capacity, operated\nby Russian Inter RAO UES, commenced operations on 18 January 2008 and was\nofficially commissioned on 31 July 2009. Other projects at the development\nstage include Sangduta 2 by Iran, Zerafshan by Chinese SinoHydro and Rogun\npower plant, which, at 335 metres (1,099 ft), is projected to supersede the\nNurek Dam as tallest in the world if completed. The Rogun Dam was originally\nplanned to be built by Russia's Inter RAO UES, but following disagreements,\nRussia pulled out. In 2010, production resumed with Iranian investment and\nChinese assistance. Besides hydropower, other energy resources include sizable\ncoal deposits and smaller reserves of natural gas and petroleum. In December\n2010, Russian Gazprom announced discovery of significant natural gas reserves\nin Sarykamish field with 60 bcm of natural gas, enough for 50 years of\nTajikistan's domestic consumption. The national power company is Barqi Tojik.\n\nTajikistan is a partner country of the EU INOGATE energy programme, which has\nfour key topics: enhancing energy security, convergence of member state energy\nmarkets on the basis of EU internal energy market principles, supporting\nsustainable energy development, and attracting investment for energy projects\nof common and regional interest."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.7",
    "section_name": "Services",
    "text": "Throughout the early 2000s, the overall output of the services sector has\nincreased steadily. The banking system has improved significantly because of\nstrengthened oversight by the National Bank of Tajikistan, relaxed\nrestrictions on participation by foreign institutions, and regulatory reform.\nThe system includes 16 commercial banks and the central bank, or National\nBank. The state controls the system, although in principle most banks have\nbeen privatized. An internationally assisted restructuring program was\ncompleted in 2003. Banks provide a narrow range of services, concentrating on\nproviding credit to state-owned enterprises. Only an estimated 10% of the\ncapital in Tajikistan moves through the banking system, and small businesses\nrarely borrow from banks.\n\nAbdujabbor Shirinov, Chairman of the National Bank of Tajikistan announced 142\ncredit organizations, including 16 banks and 299 their branches, two non-bank\nfinancial institutions and 124 microfinance organizations functioned in\nTajikistan at the first of 2013."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "2.8",
    "section_name": "Tourism",
    "text": "The tourism industry of Tajikistan was eliminated by the civil war, but has\nbegun to re-establish itself in recent years. In 2018, the British Backpacker\nSociety ranked Tajikistan as the 7th best adventure travel destination on\nearth. The Tajik Committee on Tourism Development responded to this accolade\nby stating that \"the inclusion of Tajikistan in the British Backpacker\nSociety’s top 20 adventure travel destinations testifies the development of\ntourism in [the] country.\""
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Labour",
    "text": "In 2003 Tajikistan's active labour force was estimated at 3.4 million, of whom\n64% were employed in agriculture, 24% in services, and 10% in industry and\nconstruction. After declining in the early 2000s, the real wages of state\nemployees were raised in 2004 and 2005. Because of the continued dominance of\nstate farms, the majority of workers are government employees, although only a\nsmall number rely completely on wages. Driven by high unemployment, in 2006 an\nestimated 700,000 workers found seasonal or permanent employment in Russia and\nother countries. Their remittances, estimated at US$600 million in 2005, are\nan important economic resource in Tajikistan; in 2004 an estimated 15% of\nhouseholds depended mainly on those payments. In May 2009 remittances to\nTajiks had fallen to $525 million, a 34% decline from the previous year.\nImmediately before the 2008 financial crisis, there were an estimated 1.5\nmillion foreign workers sending remittances back to Tajikistan. In 2006 the\naverage wage was US$27 per month. The national unemployment rate was estimated\nunofficially as high as 40% in 2006, but in rural areas, unemployment has\nexceeded 60%. Unemployment has been higher in the southern Khatlon Province\nthan in the northern Soghd Province. Mean wages were $0.66 per man-hour in\n2009.\n\nTajikistan's informal employment sector has been reported to use both child\nlabour and forced labour in the country's cotton industry according to the\nU.S. Department of Labor's _List of Goods Produced by Child Labor or Forced\nLabor_."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Currency, exchange rate, and inflation",
    "text": "The somoni (SM) was introduced in 2000 to replace the Tajikistani rouble,\nwhich had been the currency since 1995. In December 2015, some 7 somoni\nequaled US$1. Throughout the post-Soviet era, inflation has been a serious\nobstacle to economic growth and improvement of the standard of living. For the\nyears 2001–3, Tajikistan's inflation rates were 33%, 12.2%, and 16.3%,\nrespectively, but in 2004 the rate fell to 6.8%, and the rate for 2005 was\n7.1%. In late 2006, inflation approached the 10% level. The official forecast\nfor 2007 is 7%."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Government budget",
    "text": "The year 2004 was the first year of budget deficit after three consecutive\nyears of budget surpluses, which in turn had followed four years of deficits\nbetween 1997 and 2000. In 2005 revenues totalled US$442 million (aided by\nimprovements in tax collection), and expenditures were US$542 million, a\ndeficit of US$100 million. The approved 2007 state budget calls for revenues\nof US$926 million and expenditures of US$954 million, leaving a deficit of\nUS$28 million."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Foreign economic relations",
    "text": "Tajikistani exports in 2006\n\nIn the post-Soviet era, Tajikistan has substantially shifted its markets away\nfrom the former Soviet republics; in 2005, more than 80% of total exports went\nto customers outside the Commonwealth of Independent States (CIS), including\nmore than 70% to countries of the European Union (EU) and Turkey. However,\nbecause most of Tajikistan's food and energy are imported from CIS countries,\nin 2005 only about 53% of total trade activity was outside the CIS. In 2005,\nthe top overall buyers of Tajikistan's exports, in order of value, were the\nNetherlands, Turkey, Russia, Uzbekistan, Latvia, and Iran. Besides aluminium,\nwhich accounts for more than half of export value, the main export commodities\nare cotton, electric power, fruits, vegetable oils, and textiles. In 2005 the\nlargest suppliers of Tajikistan's imports, in order of value, were Russia,\nKazakhstan, Uzbekistan, Azerbaijan, China, and Ukraine. Those import rankings\nare determined largely by the high value of fuels and electric power that\nTajikistan buys from its neighbours. Another significant import is alumina\n(aluminium oxide) to supply the aluminium industry. The major suppliers of\nalumina are Azerbaijan, Kazakhstan, and Ukraine.\n\nTajikistan has suffered trade deficits throughout the post-Soviet era. In\n2003, the deficit was US$97 million, based on exports of US$705 million and\nimports of US$802 million. In 2004, exports were worth US$736 million and\nimports, US$958 billion, creating a trade deficit of US$222 million. The\ndeficit increased again in 2005, to US$339 million, mainly because cotton\nexports decreased and domestic demand for goods increased.\n\nIn 2005, the current account deficit was US$86 million, having shown a general\ndownward trend since the late 1990s. The estimated current account deficit for\nboth 2006 and 2007 is 4.5% of GDP, or about US$90 million in 2006. In 2005 the\noverall balance of payments was US$14 million. The estimated overall balance\nof payments for 2006 is US$8 million.\n\nAt the end of 2006, Tajikistan's external debt was estimated at US$830\nmillion, most of which was long-term international debt. This amount grew\nsteadily through the 1990s and early 2000s because of state borrowing policy.\nIn 2004 Tajikistan eliminated about 20% of its external debt by exchanging\ndebt to Russia for Russian ownership of the Nurek space tracking station, and\nby 2006, rescheduling negotiations had reduced the debt by about two-thirds as\na percentage of gross domestic product.\n\nIn the early 2000s, foreign direct investment has remained low because of\npolitical and economic instability, corruption, the poor domestic financial\nsystem, and Tajikistan's geographic isolation. The establishment of businesses\nnearly always requires bribing officials and often encounters resistance from\nentrepreneurs with government connections. To attract foreign investment and\ntechnology, Tajikistan has offered to establish free economic zones in which\nfirms receive advantages on taxes, fees, and customs. In 2004, the parliament\npassed a law on free economic zones and in 2008 passed a decree creating two\nzones: the Panj Free Economic Zone and the Sughd Free Economic Zone. In 2003\nforeign direct investment totaled US$41 million; it increased to US$272\nmillion in 2004 because of the debt-reduction transaction with Russia. In the\nfirst half of 2005, the figure was US$16 million. Beginning in 2005, the\nRussian Rusal aluminium company resumed operations to complete the\nhydroelectric station at Rogun on the Vakhsh River and expand aluminium\nproduction at the Tursunzade plant. That plant was scheduled for possible sale\nto Rusal in 2007. Also in 2005, Russia and Iran resumed work on the Vakhsh\nRiver Sangtuda hydroelectric project. Gazprom, the Russian natural gas\nmonopoly, allocated US$12 million for oil and gas exploration in Tajikistan in\n2007 after spending US$7 million in 2006. In 2005 the Russian\ntelecommunications company VimpelCom bought a controlling share of\nTajikistan's Tacom mobile telephone company. As of 2006, Turkey tentatively\nplanned to invest in a luxury hotel and a cotton processing plant."
  },
  {
    "chapter_name": "Economy of Tajikistan",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "WTO",
    "text": "Tajikistan joined the World Trade Organization (WTO) on 2 March 2013, becoming\nthe 159th country to join the organization. The Working Party on the accession\nof Tajikistan was established by the General Council on 18 July 2001.\nTajikistan completed its membership negotiations on 26 October 2012, when the\nWorking Party adopted the accession package. The General Council approved the\naccession on 10 December 2012. The Working Party held its sixth meeting in\nJuly 2011 to continue the examination of Tajikistan's foreign trade regime. As\npart of bilateral market access negotiations, Tajikistan agreed to lower\ntariffs on cooking equipment, refrigerators, ovens and water heaters in\ndiscussions to gain Thailand's backing. Earlier, the government of Tajikistan\nconfirmed that it had concluded negotiations with Japan, and had received\nsupport from the nation for its accession in an agreement signed on July 31,\n2012."
  }
]