[
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Infrastructure in an industrial area at Doha Map showing the mineral resources\nof Qatar.\n\nThe **economy of Qatar** is one of the highest in the world based on GDP per\ncapita, ranking generally among the top ten richest countries on world\nrankings for 2015 and 2016 data compiled by the World Bank, the United\nNations, and the International Monetary Fund (IMF). The country's economy has\ngrown despite sanctions by its neighbors, Saudi Arabia and the United Arab\nEmirates. Mainly because the country exports primarily to Japan, South Korea,\nIndia and China, making the sanctions effectively redundant as neither Saudi\nArabia nor the United Arab Emirates have imposed trading penalties such as\ntariffs or embargoes on any of these countries for trading with Qatar, or\noffering incentives such as discounts for their own energy exports to reduce\nQatari exports.\n\nPetroleum and natural gas are the cornerstones of Qatar's economy and account\nfor more than 70% of total government revenue, more than 60% of gross domestic\nproduct, and roughly 85% of export earnings. Qatar has the world's third\nlargest proven natural gas reserve and is the third-largest exporter of\nnatural gas.\n\nQatar’s economy has been shaped by a unique development model that leverages\nrevenues from its natural gas and oil sectors to drive modernization and\neconomic diversification. Through initiatives like Qatar National Vision 2030,\nthe country aims to reduce its reliance on hydrocarbons while promoting\nsustainability, human development, and private sector growth. This strategy\nincludes significant investment in state-led projects, such as infrastructure\ndevelopment and sovereign wealth funds, which have supported diversification\nand global competitiveness. Qatar’s approach distinguishes it from traditional\nresource-dependent states by prioritizing strategic investments and fostering\na diversified, knowledge-based economy. This model emphasizes sustainability,\ninnovation, and global competitiveness, reflecting a long-term commitment to\ndevelopment and economic resilience that extends beyond reliance on natural\nresource wealth."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Energy sector",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed.\n_Find sources:_ \"Economy of Qatar\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( September 2021)__(Learn how and when to remove this\nmessage)_\n---|---\n\nBefore the emergence of petrol-based industry, Qatar was a poor pearl diving\ncountry. The exploration of oil and gas fields began in 1939. In 1973, oil\nproduction and revenues increased dramatically, moving Qatar out of the ranks\nof the world's poorest countries and providing it with one of the highest per\ncapita incomes in the world.\n\nQatar's economy was in a downturn from 1982 to 1989. OPEC (Organization of\nPetroleum Exporting Countries) quotas on crude oil production, the lower price\nfor oil, and the generally unpromising outlook on international markets\nreduced oil earnings. In turn, the Qatari government's spending plans had to\nbe cut to match lower income. The resulting recessionary local business\nclimate caused many firms to lay off expatriate staff. With the economy\nrecovering in the 1990s, expatriate populations, particularly from Egypt and\nSouth Asia, have grown again.\n\nOil production will not long remain at peak levels of 500,000 barrels (80,000\nm3) per day, as oil fields are projected to be mostly depleted by 2023.\nHowever, large natural gas reserves have been located off Qatar's northeast\ncoast. These offshore gas fields also may contain significant oil and\ncondensate reserves. For example, the state owned QatarEnergy corporation\nfound two offshore oil fields in the 1960s. At the time production was too\nexpensive. However, technological development led to production over 30 years\nlater.\n\nThe gas condensate can be refined to usual oil products in specialised\nrefineries. The costs are a bit higher but it is normal today for companies to\nuse the gas condensate too. Oil offshore production in 2008 for PS-2 and PS-3\nblocks was about 31.1 million barrels (84,995 b/d). Joint Ventures facilities\n(PS-1, ALK, K & A): Combined oil production from these three joint venture\nproduction facilities in 2008 was 57.4 million barrels (156,873 b/d). Like\nwith gas fields there are more offshore blocks which need to be explored and\ncould increase the oil output. So the 500,000 bpd peak and a depletion in 2023\nis delayed. With higher oil prices it is expected that the offshore\nexploration of oil and/or natural gas fields will go on. Oil production in\nJune 2016 seemed to be around 670,000 barrels per day, a bit down from\nFebruary 2016 production of 692,000 barrels per day. Taking all liquids\ntogether Qatar is already far beyond a million barrels per day.\n\nQatar's proved reserves of gas are the third-largest in the world, exceeding\n7000 km3 (250 trillion cubic feet). The economy was boosted in 1991 by\ncompletion of the $1.5-billion Phase I of North Field gas development. In\n1996, the Qatargas project began exporting liquefied natural gas (LNG) to\nJapan. Further phases of North Field gas development costing billions of\ndollars are in various stages of planning and development.\n\nQatar's heavy industrial projects, all based in Umm Said, include a refinery\nwith a 50,000 barrels (8,000 m3) per day capacity, a fertilizer plant for urea\nand ammonia, a steel plant, and a petrochemical plant. All these industries\nuse gas for fuel. Most are joint ventures between European and Japanese firms\nand the state-owned QatarEnergy corporation (formerly QGPC). The U.S. is the\nmajor equipment supplier for Qatar's oil and gas industry, and U.S. companies\nare playing a major role in North Field gas development.\n\nQatar pursues a vigorous program of \"Qatarization\", under which all joint\nventure industries and government departments strive to move Qatari nationals\ninto positions of greater authority. Growing numbers of foreign-educated\nQataris, including many educated in the U.S., are returning home to assume key\npositions formerly occupied by expatriates. In order to control the influx of\nexpatriate workers, Qatar has tightened the administration of its foreign\nmanpower programs over the past several years. Security is the principal basis\nfor Qatar's strict entry and immigration rules and regulations."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Industry",
    "text": "The government considers industry to be an integral part of its plan to\ndiversify the economy and maximize its huge natural gas reserves, which serve\nas the primary feed stock for the sector. Accordingly, careful planning has\ngone into industrial development. With an eye towards exports, development has\nbeen clustered around the ports of Ras Laffan Industrial City and Mesaieed\nIndustrial Area, which are key centers of energy. The result has seen\nconsiderable growth over the years. Industries Qatar (IQ), a producer of\npetrochemicals, fertilizers and steel, is a regional powerhouse, surpassed\nonly in size by Saudi Basic Industries Corporation (SABIC), the Middle East's\nlargest chemical producer. In 2007 the manufacturing sector made the third-\nlargest contribution to GDP among non-oil and gas sectors, equivalent to about\n7.5% of GDP. Industry in Qatar is regulated by the Ministry of Business and\nTrade.\n\nPetrochemicals and fertilizers supply make up a large portion of the\nindustrial base, along with steel and other construction materials, through\nQatar Steel and Qatar Primary Material Company (QPMC). Indeed, over the past\nfew years, demand for construction materials experienced a major surge as the\ndevelopment boom swept the Persian Gulf region. The 2008 financial crisis\nreduced demand in the region, as project credit lines dry up and investor\nsentiment remains cautious. The crisis impacted the whole of the industrial\nsector – IQ saw its net profit drop in the fourth quarter of 2008 more than\n90% over the same period the previous year. But in relative terms, the sector\nhas fared better than most and IQ still managed to post an annual profit of\n$2bn. Large profit chunks from years past have been channeled into capital\ninvestments, which should help the sector ride out the storm. IQ, for example,\nis pushing several major expansion projects, worth almost $6bn, ahead."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "North Field LNG project",
    "text": "On 8 February 2021, the world's largest LNG supplier, Qatar Petroleum (now\nQatarEnergy), signed an EPC-contract with Chiyoda and Technip for the North\nField East (NFE) expansion project to increase QE's annually LNG output by 40%\nuntil 2026. For the $28.7 billion NFE expansion project, QatarEnergy has\npartnered with five global energy companies that have acquired 25% stake in\nthe project. These include Shell, TotalEnergies and ExxonMobil, each with\n6.25%, and Eni and ConocoPhillips, each with 3.125% stakes. In a first phase,\nLNG export capacity is expected to increase from 77 million tons per year to\n110 million tons per year by 2026.\n\nOn 20 June 2022, Minister of State for Energy Saad Sherida Al-Kaabi said at a\npress conference at the QatarEnergy that the expected production increase from\nthis project will be 32.6 million tonnes annually. Ethane produced from the\nproject would be 1.5 million tonnes per year, LPG 4 million tonnes per year,\n250.000 barrels of condensate and 5.000 tonnes of helium per day.\n\nIn a second phase, the North Field South (NFS) project, Shell and\nTotalEnergies have each acquired 9.375% and ConocoPhillips 6.25% stakes.\nQatarEnergy plans to increase LNG production with the NFS project to 126\nmillion tons per year beginning in 2028.\n\nIn April 2023, Sinopec acquired a 5% stake in an 8 million tonnes per year LNG\ntrain."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Financial sector",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed.\n_Find sources:_ \"Economy of Qatar\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( September 2021)__(Learn how and when to remove this\nmessage)_\n---|---\n\nThe Qatari banking sector managed to escape the direct impact of the global\nsubprime fallout, but was not altogether unscathed by its aftershocks.\nOverall, it was the best performing of the Gulf Cooperation Council markets in\nthe last quarter of 2008 and most banks posted substantial profits for 2008.\nBut the sector is also facing issues of liquidity, declining customer\nconfidence and a forced reluctance to lend. In a bid to strengthen the banks’\npositions, the Qatar Investment Authority (QIA) announced in early 2009 that\nit was willing to take a 10-20% stake in any interested local listed banks by\nway of a capital injection, although this was later reduced to 5% stakes and\nan additional 5% at the end of 2009.\n\nThe Qatari government also announced in March 2009 that it was planning to buy\nthe investment portfolio of the banks in the hope this would encourage them to\ncontinue lending. Cautious sector sentiment has also been compounded by the\nQatar Central Bank's (QCB's) lending restrictions, which demand a loan-to-\ndeposit ratio of 90%. Given the high level of integration between Qatar's\neconomy and the Persian Gulf region, as well as the wider world, a slowdown in\nbusiness and banking activity seemed inevitable. Nevertheless, Qatar's banking\nsector has been faring relatively well, considering the strife experienced in\nother countries, and insiders are confident that activity will return to its\nprevious brisk pace in the second half of 2009 as confidence slowly rebuilds\naround the globe.\n\nThe International Monetary Fund in its spring assessment 2019 said that Qatar\nhas \"successfully absorbed the shocks\" of the blockade imposed in 2017 and the\ndropped oil prices from 2014 to 2016. S&P Global had marked Qatar's outlook to\nnegative in 2017, but changed it to stable in 2019.\n\nIn August 2019, Qatar Central Bank stated that the country's economic growth\nwill see a boost over the next two years amid expectations of stable oil\nprices and continued strong exports. The GDP is expected to grow at an average\nrate of 2.8% between 2018 and 2020, with the budget surplus falling to 4.35\nbillion riyals in 2019, from a surplus of 15.1 billion riyals in 2018.\n\nQatar's GDP is anticipated to scale up to $208 billion in 2024 from $162\nbillion in 2022, according to a report by FocusEconomics. The World Bank has\nprojected Qatar's economy to be the fastest growing in the GCC in 2023 and\n2024."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Islamic finance",
    "text": "| This section **does notcite any sources**. Please help improve this section\nby adding citations to reliable sources. Unsourced material may be challenged\nand removed. _( January 2023)__(Learn how and when to remove this message)_\n---|---\n\nThe Islamic finance sector enjoyed increased activity in 2008 and is expected\nto continue to grow into 2009 as more sophisticated financial instruments\nspark the interest of investors. In addition to Islamic banks, such as Qatar\nIslamic Bank (QIB), Qatar International Islamic Bank (QIIB) and newcomer\nMasraf Al Rayyan, conventional banks have also been entering the sharia-\ncompliant sector and are coming to view an Islamic subsidiary as a virtual\nnecessity in order to maintain market standing. Islamic banks currently take\nthe lion's share of sharia-compliant business, though the conventional banks\nare working hard to take a greater share of market activity. Both Islamic\nbanks and Islamic subsidiaries did remarkably well in the first three quarters\nof 2008, during which overall financing activity increased by 70.6% compared\nto the same period in the previous year. The 2008 financial crisis slowed this\ngrowth. Poor market conditions have contributed to a marked slowdown of\nIslamic bond, or sukuk, activity in 2008 throughout the Persian Gulf. But\nother segments, such as Islamic insurance, or takaful, have not seen a similar\ndownturn. Overall, challenges to further growth remain, including a lack of\nqualified staff to meet the growing demand for sharia-compliant banking\nservices."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Capital market",
    "text": "The stock market capitalisation of listed companies in Qatar was valued at\n$95,487 million in 2007 by the World Bank. As 2008 drew to a close, no capital\nmarkets around the globe, including Qatar's, were immune to the effects of the\nsub-prime fallout. That said, there is considerable optimism that Qatar's\nbourse, the Doha Securities Market (DSM), will remain relatively resilient to\nthe ongoing international turbulence. It has followed the same peak-trough\ntrajectory as many others around the globe, hitting record highs in mid-2008,\nbefore diving in late 2008 and early 2009. Between December 2006 and July 2008\nthe DSM Index rose about 117% before the 2008 financial crisis wiped out most\nof these gains. In the first few months of 2009, the DSM lost about 40% of its\nvalue. In an effort to stave off further losses, the government announced in\nFebruary 2009 that it would step in to buy up shares of troubled banks\namounting to about 10% of the market's capitalisation. The move improved\ninvestor optimism and is hoped to prevent the market from falling further. The\nproposal to create a single unified regulator as early as 2010 to oversee all\nbanking and financial services is viewed as another promising development that\nwill transform the financial sector for the better."
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Travel and tourism",
    "text": "The Pearl Qatar\n\nUnder the ambitious five-year development plan of the Qatar Tourism and\nExhibitions Authority (QTEA), the government aimed to boost the number of\nvisitors from 964,000 as of 2007 to 1.5m by 2010. The funding required to meet\nthis goal was present in sufficient amounts; in 2008 the state allocated some\n$17bn for tourism development through 2014, most of which was allocated\ntowards hotels, exhibition space and infrastructure. In order to keep up with\na rising number of visitors, the government set a goal of increasing hotel\ncapacity 400% by 2012. In addition to financial support, the government has\nalso worked to ease business regulations in a bid to increase private sector\nactivity. A major aspect of expansion plans is the Hamad International\nAirport, which has the capacity to handle up to 24m passengers.\n\nQatar Airways is an airline owned by the Qatar government and was founded in\n1993. It travels to over a hundred destinations.\n\nOther niche tourism segments receiving special focus include cultural tourism\non the back of the high publicity opening of Doha's Museum of Islamic Art, and\nsports tourism, initially spurred by the Asian Games, to which Qatar played\nhost in 2006. Qatar hosted the 2022 FIFA World cup,"
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Transport",
    "text": "Highway Q3 (from Doha to Dukhan)\n\nWith a fast-expanding population and substantial economic growth over the past\ndecade, a reliable and extensive transportation network is becoming\nincreasingly necessary within Qatar. So far the government, the primary\ntransport developer, has done well in terms of keeping up with demand for new\ntransportation options. In 2008 the Public Works Authority (Ashghal), one of\nthe bodies that oversees infrastructure development, underwent a major\nreorganisation in order to streamline and modernise the authority in\npreparation for major project expansions across all segments in the near\nfuture. Ashghal works in tandem with the Urban Planning and Development\nAuthority (UPDA), the body that designed the transportation master plan,\ninstituted in March 2006 and running to 2025.[_citation needed_]\n\nScene in the harbour of Al Khor. Fisheries is a minor sector in Qatar, and\nproduction is almost exclusively for domestic consumption.\n\nAs driving is the primary mode of transport in Qatar, the road network is a\nmajor focus of the plan. Project highlights in this segment include the\nmultibillion-dollar Doha Expressway and the Qatar Bahrain Causeway, which will\nconnect Qatar to Bahrain and Saudi Arabia and is considered a milestone in\nregional interconnectivity. Mass-transit options, such as a Doha metro, light-\nrail system and more extensive bus networks, are also under development to\nease road congestion. In addition, the railway system is being significantly\nexpanded and could eventually form an integral part of a GCC-wide network\nlinking all of the six member states. The airport, too, is expanding capacity\nto keep up with rising visitor numbers. The New Doha International Airport is\none of the largest projects in Qatar today and will boast a capacity of 50m\npassengers upon completion in 2015. Finally, port infrastructure is seen as an\nintegral part of Qatar's economic development as it focuses on LNG and\nindustrial exports. The port at Mesaieed is undergoing expansion. While the\n2008 financial crisis may present challenges to infrastructure development,\nonce all projects are completed Qatar will have one of the most advanced and\nmodern transport infrastructures in the region.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Qatar",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Macro-economic trend",
    "text": "Qatar is now among the richest countries in the world, on a per person basis.\nCurrent GDP per capita registered a world record-breaking peak growth of\n1,156% in the 70s. This became quickly unsustainable due to the 1980s oil\nglut, and Qatar's current GDP per capita contracted 53% in the 80s. But rising\nglobal oil demand helped current GDP per capita to expand 94% in the 90s.\nDespite efforts to promote the non-hydrocarbon sectors and diversify the\neconomy from hydrocarbons to knowledge-based sectors, the oil and gas sector\nhas consistently contributed to at least 80 percent of the government of\nQatar’s total revenues since 2014, as well as 90 percent of Qatar’s total\nexports.\n\nIn 2020 GDP PPP ~260 billion dollars.\n\nThis table is of Qatar's gross domestic product at market prices as estimated\nby the International Monetary Fund with figures in millions of Qatari Rials.\n\nYear | Gross Domestic Product | US Dollar Exchange | Inflation Index\n(2000=100) | Per Capita Income\n(as % of USA)\n---|---|---|---|---\n1980 | 28,631 | 3.65 Qatari Riyals | 53 | 266.18\n1985 | 22,829 | 3.63 Qatari Riyals | 64 | 104.82\n1990 | 26,792 | 3.64 Qatari Riyals | 77 | 67.85\n1995 | 29,622 | 3.63 Qatari Riyals | 85 | 55.75\n2000 | 64,646 | 3.63 Qatari Riyals | 100 | 86.03\n2005 | 137,784 | 3.64 Qatari Riyals | 115 | 127.05\n\nFor purchasing power parity comparisons only, the US Dollar is exchanged at\n3.67 Qatari Riyals. Mean wages were $59.99 per man-hour in 2009.\n\nIn February 2012, the International Bank of Qatar reported that GDP grew by\n19.9% in 2011, but estimated that 2012 growth would slow to 9.8%\n\nAccording to the International Monetary Fund, Qatar's economic performance\nimproved in 2018 despite the economic embargo. The GDP growth is expected to\nincrease to 2.6% in 2019 from 2.2% in 2018.\n\nThe following table shows the main economic indicators in 1980–2024. Inflation\nbelow 2% is in green.\n\nYear  | GDP\n(in Bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---\n1980  | 13.7  | 56,086  | 6.7  | −1.0%  | 6.8%  | n/a\n1981  | 14.4  | 54,463  | 7.4  | −3.9%  | 8.5%  | n/a\n1982  | 14.1  | 49,289  | 6.5  | −8.2%  | 5.7%  | n/a\n1983  | 13.8  | 45,257  | 5.5  | −5.3%  | 2.7%  | n/a\n1984  | 16.6  | 50,989  | 5.7  | 16.0%  | 1.1%  | n/a\n1985  | 14.9  | 43,310  | 5.3  | −13.0%  | 1.1%  | n/a\n1986  | 15.8  | 43,626  | 4.2  | 3.7%  | 1.9%  | n/a\n1987  | 16.3  | 43,280  | 4.4  | 0.9%  | 4.5%  | n/a\n1988  | 17.7  | 45,085  | 4.3  | 4.7%  | 4.8%  | n/a\n1989  | 19.4  | 47,486  | 4.5  | 5.3%  | 3.3%  | n/a\n1990  | 17.1  | 35,983  | 6.3  | −14.6%  | 3.0%  | 12.6%\n1991  | 17.5  | 35,983  | 5.6  | −1.5%  | 4.5%  | 21.8%\n1992  | 19.7  | 40,268  | 6.4  | 10.4%  | 2.9%  | 19.9%\n1993  | 20.0  | 40,657  | 5.8  | −0.9%  | -0.7%  | 46.3%\n1994  | 20.8  | 42,060  | 5.9  | 1.9%  | 1.4%  | 54.8%\n1995  | 21.3  | 42,576  | 6.9  | 0.4%  | 3.0%  | 50.2%\n1996  | 22.6  | 44,191  | 7.8  | 4.2%  | 7.0%  | 57.8%\n1997  | 29.4  | 55,580  | 10.0  | 27.7%  | 2.7%  | 54.4%\n1998  | 32.8  | 59,617  | 8.5  | 10.3%  | 2.9%  | 76.6%\n1999  | 34.5  | 60,349  | 11.3  | 3.8%  | 2.2%  | 81.8%\n2000  | 37.8  | 63,609  | 18.1  | 6.9%  | 1.6%  | 51.6%\n2001  | 40.4  | 65,955  | 17.5  | 4.5%  | 1.7%  | 59.2%\n2002  | 43.8  | 69,545  | 19.3  | 6.9%  | 0.2%  | 47.7%\n2003  | 46.4  | 70,339  | 23.7  | 4.0%  | 2.3%  | 38.8%\n2004  | 56.9  | 78,927  | 30.7  | 19.2%  | 6.8%  | 30.1%\n2005  | 63.2  | 76,976  | 44.6  | 7.8%  | 9.0%  | 19.1%\n2006  | 83.5  | 86,252  | 58.6  | 28.1%  | 11.7%  | 13.9%\n2007  | 101.3  | 87,909  | 76.0  | 18.2%  | 13.7%  | 9.4%\n2008  | 121.3  | 78,088  | 112.6  | 17.5%  | 15.1%  | 11.4%\n2009  | 138.0  | 84,231  | 88.2  | 13.1%  | −4.9%  | 36.0%\n2010  | 164.5  | 95,908  | 119.7  | 17.7%  | −2.4%  | 30.4%\n2011  | 186.9  | 107,842  | 167.8  | 11.3%  | 2.0%  | 33.5%\n2012  | 199.3  | 108,758  | 186.8  | 4.7%  | 1.8%  | 32.1%\n2013  | 214.0  | 106,802  | 198.7  | 5.6%  | 3.1%  | 30.9%\n2014  | 229.3  | 103,485  | 206.2  | 5.3%  | 4.2%  | 24.9%\n2015  | 242.5  | 99,464  | 161.7  | 4.8%  | 0.9%  | 35.5%\n2016  | 252.3  | 96,376  | 151.7  | 3.1%  | 2.7%  | 46.7%\n2017  | 252.9  | 92,839  | 161.1  | −1.5%  | 0.6%  | 51.6%\n2018  | 284.0  | 102,880  | 183.3  | 1.2%  | 0.1%  | 52.2%\n2019  | 283.7  | 101,337  | 176.4  | 0.7%  | −0.9%  | 62.1%\n2020  | 229.5  | 81,003  | 144.4  | −3.6%  | −2.5%  | 72.6%\n2021  | 292.7  | 106,491  | 179.7  | 1.6%  | 2.3%  | 58.4%\n2022  | 326.6  | 111,396  | 235.7  | 4.2%  | 5.0%  | 42.6%\n2023  | 342.4  | 111,789  | 213.0  | 1.2%  | 3.1%  | 43.3%\n2024  | 356.0  | 115,075  | 221.4  | 1.5%  | 1.0%  | 41.2%"
  }
]