[
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Armenia** grew by 5.9% in 2024, according to estimates by the\nInternational Monetary Fund, with total output amounting to $25.5 billion. GDP\ncontracted sharply in 2020 by 7.1%, mainly due to the COVID-19 recession and\nthe Second Nagorno-Karabakh War with Azerbaijan. In contrast it grew by 7.6%\nin 2019, 5.8% in 2021, 12.6% in 2022 and 8.3% in 2023. Between 2012 and 2018\nGDP grew 40.7%, and key banking indicators like assets and credit exposures\nalmost doubled.\n\nWhile part of the Soviet Union, the economy of Armenia was based largely on\nmanufacturing industry—chemicals, electronic products, machinery, processed\nfood, synthetic rubber and textiles; it was highly dependent on outside\nresources. Armenian mines produce copper, zinc, gold and lead. The vast\nmajority of energy is produced with imported fuel from Russia, including gas\nand nuclear fuel for Armenia's Metsamor nuclear power plant. The main domestic\nenergy source is hydroelectric.[_dubious – discuss_] Small amounts of coal,\ngas, and petroleum have not yet been developed.\n\nThe severe trade imbalance has been somewhat offset by international aid and\nremittances from Armenians abroad, and foreign direct investment. Armenia is a\nmember of the Eurasian Economic Union and ties with Russia remain close,\nespecially in the energy sector.",
    "openai_summarised_points": [
      "• The economy of Armenia grew by 5.9% in 2024, according to estimates by the International Monetary Fund, with the total output reaching $25.5 billion.",
      "• In 2020, Armenia's GDP contracted sharply by 7.1%, primarily due to the COVID-19 recession and the Second Nagorno-Karabakh War with Azerbaijan.",
      "• The country's GDP growth rates in recent years include 7.6% in 2019, 5.8% in 2021, 12.6% in 2022, and 8.3% in 2023.",
      "• Between 2012 and 2018, Armenia's GDP increased by 40.7%, with significant growth in key banking indicators such as assets and credit exposures, which nearly doubled during this period.",
      "• Historically, while part of the Soviet Union, Armenia's economy was primarily based on manufacturing industries, including chemicals, electronic products, machinery, processed food, synthetic rubber, and textiles, and was highly dependent on external resources.",
      "• Armenian mines produce copper, zinc, gold, and lead, contributing to the country's mineral resource sector.",
      "• The majority of Armenia's energy is generated using imported fuel from Russia, including natural gas and nuclear fuel for the Metsamor nuclear power plant.",
      "• The main domestic energy source in Armenia is hydroelectric power, although small amounts of coal, gas, and petroleum are present but underdeveloped.",
      "• Armenia faces a severe trade imbalance, which has been partially mitigated by international aid, remittances from Armenians abroad, and foreign direct investment.",
      "• Armenia is a member of the Eurasian Economic Union, maintaining close ties with Russia, especially in the energy sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:19:33.146396",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1320,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Under the old Soviet central planning system, Armenia had developed a modern\nindustrial sector, supplying machine tools, textiles, and other manufactured\ngoods to sister republics in exchange for raw materials and energy. Since the\nimplosion of the USSR in December 1991, Armenia has switched to small-scale\nagriculture away from the large agroindustrial complexes of the Soviet era.\nThe agricultural sector has long-term needs for more investment and updated\ntechnology. Armenia began borrowing soon after declaring independence. In\n2000, Armenian governmental debt reached its greatest level relative to GDP\n(49.3 percent of GDP).\n\nArmenia is a food importer, and its mineral deposits (gold and bauxite) are\nsmall. The ongoing conflict with Azerbaijan over the ethnic Armenian-dominated\nregion of Nagorno-Karabakh and the breakup of the centrally directed economic\nsystem of the former Soviet Union contributed to a severe economic decline in\nthe early 1990s. Political instability and the threat of war placed a\nsignificant strain on economic development. Despite robust growth in recent\nyears, the problem of geopolitical uncertainty resurfaced during the 2020 war,\ncontributing to a 7.1% drop in GDP. Armenia's public debt rose to 67.4% in\n2020, but fell below 50% again in 2022.",
    "openai_summarised_points": [
      "• Under the Soviet central planning system, Armenia developed a modern industrial sector that supplied machine tools, textiles, and other manufactured goods to sister republics in exchange for raw materials and energy.",
      "• Following the collapse of the USSR in December 1991, Armenia shifted from large agroindustrial complexes to small-scale agriculture.",
      "• The agricultural sector in Armenia has long-term needs for increased investment and modernization through updated technology.",
      "• Armenia began borrowing funds shortly after declaring independence in 1991.",
      "• In 2000, Armenia's governmental debt reached its highest level relative to GDP at 49.3 percent.",
      "• Armenia is primarily a food importer.",
      "• The country's mineral deposits, including gold and bauxite, are relatively small.",
      "• The ongoing conflict with Azerbaijan over the Nagorno-Karabakh region, which is predominantly inhabited by ethnic Armenians, and the disintegration of the Soviet Union’s centrally planned economy contributed to a severe economic decline in the early 1990s.",
      "• Political instability and the threat of war significantly hindered economic development during this period.",
      "• Despite recent robust growth, geopolitical uncertainty resurfaced during the 2020 war, leading to a 7.1 percent decrease in Armenia’s GDP.",
      "• Armenia’s public debt increased to 67.4 percent of GDP in 2020.",
      "• By 2022, Armenia’s public debt had decreased to below 50 percent of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:19:37.723769",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1284,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Global competitiveness",
    "text": "In the 2020 report of Index of Economic Freedom by The Heritage Foundation,\nArmenia is classified as \"mostly free\" and ranks 34th, improving by 13\npositions and ahead of all other Eurasian Economic Union countries and several\nEU countries including Cyprus, Bulgaria, Romania, Poland, Belgium, Spain,\nFrance, Portugal and Italy.\n\nIn the 2019 report (data for 2017) of Economic Freedom of the World published\nby Fraser Institute Armenia ranks 27th (classified most free) out of 162\neconomies.\n\nIn the 2019 report of Global Competitiveness Index Armenia ranks 69th out of\n141 economies.\n\nIn the 2020 report (data for 2019) of Doing Business Index Armenia ranks 47th\nwith 10th rank on \"starting business\" sub-index.\n\nIn the 2019 report (data for 2018) of Human Development Index by UNDP Armenia\nranked 81st and is classified into \"high human development\" group.\n\nIn the 2021 report (data for 2020) of Corruption Perceptions Index by\nTransparency International Armenia ranked 49 of 179 countries.",
    "openai_summarised_points": [
      "• In the 2020 report of the Index of Economic Freedom published by The Heritage Foundation, Armenia is classified as \"mostly free\" and is ranked 34th globally, representing an improvement of 13 positions from previous rankings.",
      "• Armenia's 2020 Index of Economic Freedom ranking places it ahead of all other countries within the Eurasian Economic Union.",
      "• Armenia also outperforms several European Union member states, including Cyprus, Bulgaria, Romania, Poland, Belgium, Spain, France, Portugal, and Italy, according to the 2020 report.",
      "• The 2019 report of the Economic Freedom of the World, published by the Fraser Institute, based on data from 2017, ranks Armenia 27th out of 162 economies, categorizing it as \"most free.\"",
      "• In the 2019 Global Competitiveness Index report, Armenia is ranked 69th out of 141 economies.",
      "• The 2020 Doing Business Index (based on 2019 data) ranks Armenia 47th globally, with a particularly high score of 10th place on the \"starting a business\" sub-index.",
      "• According to the 2019 Human Development Index report by UNDP, based on 2018 data, Armenia was ranked 81st and classified within the \"high human development\" group.",
      "• The 2021 Corruption Perceptions Index by Transparency International, based on 2020 data, ranks Armenia 49th out of 179 countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:19:42.399672",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 991,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "History of the modern Armenian economy",
    "text": "At the beginning of the 20th century, the territory of present-day Armenia was\nan agricultural region with some copper mining and cognac production. From\n1914 through 1921, Caucasian Armenia suffered from the genocide of about 1.5\nmillion Armenian inhabitants in their own homeland which caused total property\nand financial collapse when all of their assets and belongings were forcibly\ntaken away by the Turks, the consequences of which after 105 years to this day\nremain incalculable, revolution, the influx of refugees from Turkish Armenia,\ndisease, hunger and economic misery. About 200,000 people died in 1919 alone.\nAt that point, only American relief efforts saved Armenia from total collapse.\nThus, Armenians went from being one of the wealthiest ethnic groups in the\nregion to suffering from poverty and famine.[_citation needed_] Armenians were\nthe second richest ethnic group in Anatolia after the Greeks, and they were\nheavily involved in very high productive sectors such as banking,\narchitecture, and trade. However, after the mass killings of Armenian\nintellectuals in April 1915 and the genocide targeted towards the whole\nArmenian population left the people and the country in ruins. The genocide was\nresponsible for the loss of many high-quality skills that the Armenians\npossessed.\n\n100 million rubles banknote\n\nThe first Soviet Armenian government regulated economic activity stringently,\nnationalizing all economic enterprises, requisitioning grain from peasants,\nand suppressing most private market activity. This first experiment of state\ncontrol ended with the advent of Soviet leader Vladimir Lenin's New Economic\nPolicy (NEP) of 1921–1927. This policy continued state control of the large\nenterprises and banks, but peasants could market much of their grain, and\nsmall businesses could function. In Armenia, the NEP years brought partial\nrecovery from the economic disaster of the post-World War I period. By 1926\nagricultural production in Armenia had reached nearly three-quarters of its\nprewar level.\n\nBy the end of the 1920s, Stalin's regime had revoked the NEP and re-\nestablished the centralised state monopoly on all economic activity. Once this\noccurred, the main goal of the Soviet economic policy in Armenia was to turn a\npredominantly agrarian and rural republic into an industrial and urban one.\nAmong other restrictions, peasants now were forced to sell nearly all of their\noutput to state procurement agencies rather than at the open market. From the\n1930s through the 1960s, an industrial infrastructure has been constructed.\nBesides hydroelectric plants and canals, roads were built and gas pipelines\nwere laid to bring fuel and food from Azerbaijan and Russia.\n\nThe state socialist command economy, in which market forces were suppressed\nand all orders for production and distribution came from the state\nauthorities, survived in all its essential features until the fall of the\nSoviet regime in 1991. In the early stages of the communist economic\nrevolution, Armenia underwent a fundamental transformation into a\n\"proletarian\" society. Between 1929 and 1939, the percentage of Armenia's work\nforce categorised as industrial workers grew from 13% to 31%. By 1935 industry\nsupplied 62% of Armenia's economic production. Highly integrated and sheltered\nwithin artificial barter economy of the Soviet system from the 1930s until the\nend of the communist era, the Armenian economy showed few signs of self-\nsufficiency at any time during that period. In 1988, Armenia produced only\n0.9% of the net material product of the Soviet Union (1.2% of industry, 0.7%\nof agriculture). The republic retained 1.4% of total state budget revenue,\ndelivered 63.7% of its NMP to other republics, and exported only 1.4% of what\nit produced to markets outside the Soviet Union.\n\nAgriculture accounted for only 20% of net material product and 10% of\nemployment before the breakup of the Soviet Union in 1991.\n\nArmenia's industry was especially dependent on the Soviet military-industrial\ncomplex. About 40% of all enterprises in the republic were devoted to defense,\nand some factories lost 60% to 80% of their business in the last years of the\nSoviet Union, when massive cuts were made in the national defense\nexpenditures. As the republic's economy faced the prospects of competing in\nworld markets in the mid-1990s, the great liabilities of Armenia's industry\nwere its outdated equipment and infrastructure and the pollution emitted by\nmany of the country's heavy industrial plants.\n\nThe economic downturn that began in 1989 worsened dramatically in 1992.\nAccording to statistics, the GDP declined by 37.5 percent in 1991 compared to\n1990, and all sectors contributing to the GDP decreased in production. The\ncollapse of industry in favor of agriculture, whose products were mostly\nimported throughout the Soviet period, changed the structure of sectoral\ncontributions to GDP.\n\nIn 1991, Armenia's last year as a Soviet republic, national income fell 12%\nfrom the previous year, while per capita gross national product was 4,920\nrubles, only 68% of the Soviet average. In large part due to the earthquake of\n1988, the Azerbaijani blockade that began in 1989 and the collapse of the\ninternational trading system of the Soviet Union, the Armenian economy of the\nearly 1990s remained far below its 1980 production levels. In the first years\nof independence (1992–93), inflation was extremely high, productivity and\nnational income dropped dramatically, and the national budget ran large\ndeficits.\n\nA period of chronic shortages, was the first stage of price deregulation,\nwhich allowed goods to stay in Armenia as opposed to being exported for better\nprices; the inflation rates were 10 percent in 1990, 100 percent in 1991, and\n642.5 percent during the first four months of 1992, compared with the first\nfour months of 1991. Thus, there were two opposing dynamics: price increases\nin response to shortages and falling incomes due to the recession and\nunemployment.",
    "openai_summarised_points": [
      "• At the beginning of the 20th century, present-day Armenia was primarily an agricultural region with some copper mining and cognac production.",
      "• Between 1914 and 1921, Caucasian Armenia experienced a genocide that resulted in approximately 1.5 million Armenian deaths and caused a total economic collapse due to the confiscation of assets by the Turks.",
      "• The genocide's consequences, including revolution, refugee influx, disease, hunger, and economic misery, remain incalculable after 105 years; about 200,000 Armenians died in 1919 alone.",
      "• American relief efforts in 1919 played a crucial role in preventing Armenia's total collapse during this period.",
      "• Prior to the genocide, Armenians were the second wealthiest ethnic group in Anatolia after the Greeks, heavily involved in banking, architecture, and trade.",
      "• The genocide in April 1915 and the targeting of Armenian intellectuals devastated the population and economy, leading to significant loss of skilled human capital.",
      "• The first Soviet Armenian government implemented strict economic regulation, including nationalization of enterprises, requisitioning grain from peasants, and suppression of private market activity.",
      "• This initial Soviet economic control ended with Vladimir Lenin's New Economic Policy (NEP) of 1921–1927, which maintained state control over large enterprises and banks but allowed peasants to sell surplus grain and small businesses to operate.",
      "• During the NEP years, Armenia experienced partial economic recovery; by 1926, agricultural production reached nearly 75% of prewar levels.",
      "• By the late 1920s, Stalin's regime revoked the NEP, re-establishing centralized state monopoly over all economic activity in Armenia.",
      "• Under Stalin, the primary goal was transforming Armenia from an agrarian society into an industrial and urban one, with peasants now required to sell nearly all output to state procurement agencies.",
      "• From the 1930s to the 1960s, Armenia developed an industrial infrastructure including hydroelectric plants, canals, roads, and gas pipelines connecting to Azerbaijan and Russia.",
      "• The Soviet socialist command economy persisted until the fall of the Soviet Union in 1991, characterized by suppressed market forces and centralized planning.",
      "• Between 1929 and 1939, Armenia's industrial workforce increased from 13% to 31%, and by 1935, industry contributed 62% of the republic’s economic output.",
      "• Throughout the Soviet era, Armenia's economy remained highly integrated within the Soviet barter system, showing little signs of self-sufficiency; in 1988, Armenia produced only 0.9% of the Soviet Union’s net material product, with 1.2% from industry and 0.7% from agriculture.",
      "• Armenia's share of total Soviet state budget revenue was 1.4%, and it exported only 1.4% of its production outside the USSR.",
      "• Agriculture constituted approximately 20% of Armenia’s net material product and 10% of employment before the 1991 Soviet breakup.",
      "• Armenia's industry was heavily dependent on the Soviet military-industrial complex, with about 40% of enterprises dedicated to defense; many factories lost 60–80% of their business in the late Soviet period due to defense budget cuts.",
      "• In the mid-1990s, Armenia faced significant industrial liabilities, including outdated equipment, infrastructure deficiencies, and pollution from heavy industrial plants, hindering competitiveness in global markets.",
      "• The economic downturn intensified in 1992, with GDP declining by 37.5% in 1991 compared to 1990, and all sectors contributing to GDP experiencing decreased production.",
      "• The collapse of industry in favor of import-dependent agriculture altered Armenia’s sectoral contribution to GDP during this period.",
      "• In 1991, Armenia's last Soviet year, national income decreased by 12% from the previous year, with per capita gross national product at 4,920 rubles—only 68% of the Soviet average.",
      "• The 1988 earthquake, the Azerbaijani blockade starting in 1989, and the collapse of the Soviet international trade system caused Armenia’s early 1990s economy to remain well below 1980 levels.",
      "• During 1992–93, Armenia experienced extremely high inflation, significant drops in productivity and national income, and large deficits in the national budget.",
      "• Early post-independence shortages led to price deregulation, with inflation rates rising from 10% in 1990 to 100% in 1991, and reaching 642.5% in the first four months of 1992, compared to the same period in 1991.",
      "• The economic crisis was characterized by conflicting dynamics: rising prices due to shortages and falling incomes due to recession and unemployment."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:19:55.494098",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 5985,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Post-communist economic reforms",
    "text": "Armenia introduced elements of the free market and privatisation into their\neconomic system in the late 1980s, when Mikhail Gorbachev began advocating\neconomic reform. To supply the country's basic needs, the first decision was\nland reform and the privatization of land. This allowed for the emergence of\nsmall-parcel agriculture supplying markets and supporting self-sustenance\nduring the period of shortages. Cooperatives were set up in the service\nsector, particularly in restaurants, although substantial resistance came from\nthe Communist Party of Armenia (CPA) and other groups that had enjoyed\nprivileged position in the old economy. In the late 1980s, much of Armenia's\neconomy already was opening either semi-officially or illegally, with\nwidespread corruption and bribery. The so-called mafia, made up of\ninterconnected groups of powerful officials and their relatives and friends,\nsabotaged the efforts of reformers to create a lawful market system. When the\nDecember 1988 earthquake brought millions of dollars of foreign aid to the\ndevastated regions of Armenia, much of the money went to corrupt and criminal\nelements.\n\nBeginning in 1991, the democratically elected government pushed vigorously for\nprivatisation and market relations, although its efforts were frustrated by\nthe old ways of doing business in Armenia, the Azerbaijani blockade, and the\ncosts of the First Nagorno-Karabakh War. In 1992, the Law on the Programme of\nPrivatisation and Decentralisation of Incompletely Constructed Facilities\nestablished a state privatisation committee, with members from all political\nparties. In the middle of 1993, the committee announced a two-year\nprivatisation programme, whose first stage would be privatisation of 30% of\nstate enterprises, mostly services and light industries. The remaining 70%,\nincluding many bankrupt, nonfunctional enterprises, were to be privatised in a\nlater stage with a minimum of government restriction, to encourage private\ninitiative. For all enterprises, the workers would receive 20% of their firm's\nproperty free of charge; 30% would be distributed to all citizens by means of\nvouchers; and the remaining 50% was to be distributed by the government, with\npreference given to members of the labour organisations. A major problem of\nthis system, however, was the lack of supporting legislation covering foreign\ninvestment protection, bankruptcy, monopoly policy, and consumer protection.\n\nIn the first post-communist years, efforts to interest foreign investors in\njoint enterprises were only moderately successful because of the blockade and\nthe energy shortage. Only in late 1993 was a department of foreign investment\nestablished in the Ministry of Economy, to spread information about Armenia's\ninvestment opportunities and improve the legal infrastructure for investment\nactivity. A specific goal of this agency was creating a market for scientific\nand technical intellectual property.\n\nA few Armenians living abroad made large-scale investments. Besides a toy\nfactory and construction projects, diaspora Armenians built a cold storage\nplant (which in its first years had little produce to store) and established\nthe American University of Armenia in Yerevan to teach the techniques\nnecessary to run a market economy.\n\nArmenia was admitted to the International Monetary Fund in May 1992 and to the\nWorld Bank in September. A year later, the government complained that those\norganisations were holding back financial assistance and announced its\nintention to move toward fuller price liberalisation, and the removal of all\ntariffs, quotas, and restrictions of foreign trade. Although privatisation had\nslowed because of catastrophic collapse of the economy, Prime Minister Hrant\nBagratyan informed the United States officials in the fall of 1993 that plans\nhad been made to embark on a renewed privatisation programme by the end of the\nyear.\n\nLike other former states, Armenia's economy suffers from the legacy of a\ncentrally planned economy and the breakdown of former Soviet trading patterns.\nSoviet investment in and support of Armenian industry has virtually\ndisappeared, so that few major enterprises are still able to function. In\naddition, the effects of the 1988 earthquake, which killed more than 25,000\npeople and made 500,000 homeless, are still being felt. Although a cease-fire\nhas held since 1994, the conflict with Azerbaijan over Nagorno-Karabakh has\nnot been resolved. The consequent blockade along both the Azerbaijani and\nTurkish borders has devastated the economy, because of Armenia's dependence on\noutside supplies of energy and most raw materials. Land routes through\nAzerbaijan and Turkey are closed; routes through Georgia and Iran are adequate\nand reliable. In 1992–93, the GDP had fallen nearly 60% from its 1989 level.\nThe national currency, the dram, suffered hyperinflation for the first few\nyears after its introduction in 1993.\n\nArmenia has registered strong economic growth since 1995 and inflation has\nbeen negligible for the past several years. New sectors, such as precious\nstone processing and jewelry making and communication technology (primarily\nArmentel, which is left from the USSR era and is owned by external investors).\nThis steady economic progress has earned Armenia increasing support from\ninternational institutions. The International Monetary Fund (IMF), World Bank,\nEBRD, as well as other international financial institutions (IFIs) and foreign\ncountries are extending considerable grants and loans. Total loans extended to\nArmenia since 1993 exceed $800 million. These loans are targeted at reducing\nthe budget deficit, stabilizing the local currency; developing private\nbusinesses; energy; the agriculture, food processing, transportation, and\nhealth and education sectors; and ongoing rehabilitation work in the\nearthquake zone.\n\nBy 1994, however, the Armenian government had launched an ambitious IMF-\nsponsored economic liberalization program that resulted in positive growth\nrates in 1995–2005. The economic growth of Armenia expressed in GDP per capita\nwas one of strongest in the CIS. GDP went from $350 to more than $800 on\naverage between 1995 and 2003. Three principal factors explain this result:\nthe credibility of the macroeconomic policies of stabilization, the correction\neffect following the depression, and the importance of external transfers, in\nparticular since 2000. Armenia became a member of the World Trade Organization\n(WTO) in January 2003. Armenia also has managed to slash inflation, stabilize\nits currency, and privatize most small- and medium-sized enterprises.\nArmenia's unemployment rate, however, remains high, despite strong economic\ngrowth.\n\nThe chronic energy shortages Armenia suffered in the early and mid-1990s have\nbeen offset by the energy supplied by one of its nuclear power plants at\nMetsamor. Armenia is now a net energy exporter, although it does not have\nsufficient generating capacity to replace the Metsamor nuclear plant, which is\nunder international pressure to close due to its old design. The European\nUnion had classified the VVER 440 Model V230 light-water-cooled reactors as\nthe \"oldest and least reliable\" category of all the 66 Soviet reactors built\nin the former Eastern Bloc. However the IAEA has found that the Metsamor NPP\nhas adequate safety and can function beyond its design lifespan.\n\nThe country's electricity distribution system was privatized in 2002.",
    "openai_summarised_points": [
      "• Armenia began introducing elements of the free market and privatization into its economic system in the late 1980s, coinciding with Mikhail Gorbachev's advocacy of economic reform.",
      "• The initial reform measures included land reform and land privatization, enabling small-parcel agriculture to supply markets and support self-sustenance amid shortages.",
      "• Cooperatives were established in the service sector, notably in restaurants, but faced substantial resistance from the Communist Party of Armenia (CPA) and other privileged groups from the old economy.",
      "• By the late 1980s, much of Armenia's economy was already operating semi-officially or illegally, characterized by widespread corruption and bribery, with a mafia composed of interconnected groups of officials, relatives, and friends sabotaging reform efforts.",
      "• During the December 1988 earthquake, which caused extensive destruction and displaced over 25,000 people, foreign aid totaling millions of dollars was largely diverted to corrupt and criminal elements.",
      "• Starting in 1991, Armenia’s democratically elected government actively promoted privatization and market reforms, but faced obstacles such as entrenched old business practices, the Azerbaijani blockade, and the costs associated with the First Nagorno-Karabakh War.",
      "• In 1992, the Law on the Programme of Privatisation and Decentralisation of Incompletely Constructed Facilities established a state privatization committee with representatives from all political parties.",
      "• In mid-1993, the committee announced a two-year privatization program targeting 30% of state enterprises—mainly services and light industries—in the first stage, with the remaining 70% to be privatized later with minimal government restrictions to foster private initiative.",
      "• The privatization scheme allocated 20% of each enterprise’s property to workers free of charge, 30% to citizens via vouchers, and 50% to the government with a preference for labor organization members.",
      "• A significant challenge of the privatization system was the absence of supporting legislation on foreign investment protection, bankruptcy, monopoly policy, and consumer protection.",
      "• Early efforts to attract foreign investment through joint enterprises were only moderately successful due to the Azerbaijani blockade and energy shortages; a department of foreign investment was established in the Ministry of Economy in late 1993 to promote investment opportunities and improve legal infrastructure.",
      "• The department aimed to develop a market for scientific and technical intellectual property.",
      "• Diaspora Armenians made large-scale investments, including a toy factory, construction projects, a cold storage plant (initially with limited produce), and the American University of Armenia in Yerevan to teach market economy techniques.",
      "• Armenia joined the International Monetary Fund (IMF) in May 1992 and the World Bank in September 1992; by 1993, the government criticized these organizations for delaying financial aid and announced plans to liberalize prices and eliminate tariffs, quotas, and trade restrictions.",
      "• Despite economic slowdown due to the collapse, Prime Minister Hrant Bagratyan in fall 1993 announced plans to renew privatization efforts by the end of that year.",
      "• Armenia’s economy inherited the legacy of a centrally planned system and the collapse of Soviet trading patterns, with Soviet industrial support virtually vanished, leaving few major enterprises operational.",
      "• The 1988 earthquake, which resulted in over 25,000 deaths and 500,000 homeless, continued to impact the economy, compounded by unresolved conflict with Azerbaijan over Nagorno-Karabakh and a blockade along Azerbaijani and Turkish borders.",
      "• Land routes through Azerbaijan and Turkey were closed, forcing reliance on routes through Georgia and Iran, which were adequate and reliable.",
      "• Between 1992–93, Armenia’s GDP declined nearly 60% from its 1989 level; the national currency, the dram, experienced hyperinflation in its initial years after introduction in 1993.",
      "• Since 1995, Armenia experienced strong economic growth and negligible inflation, with new sectors emerging such as precious stone processing, jewelry making, and communication technology (notably Armentel, a former USSR asset owned by external investors).",
      "• This steady growth garnered increased support from international institutions, with total loans exceeding $800 million since 1993, aimed at reducing the budget deficit, stabilizing the currency, developing private businesses, and rehabilitating earthquake-affected zones.",
      "• By 1994, Armenia launched an IMF-sponsored economic liberalization program, leading to positive GDP growth from 1995 to 2005, with GDP per capita rising from $350 to over $800 between 1995 and 2003.",
      "• The principal factors behind this growth included credible macroeconomic stabilization policies, economic correction after depression, and increased external transfers, especially post-2000.",
      "• Armenia became a member of the World Trade Organization (WTO) in January 2003.",
      "• The country successfully reduced inflation, stabilized its currency, and privatized most small- and medium-sized enterprises, although unemployment remained high despite economic growth.",
      "• Early and mid-1990s energy shortages were mitigated by nuclear power from the Metsamor plant; Armenia is now a net energy exporter, but the plant faces international pressure to close due to its outdated design.",
      "• The European Union classified the Metsamor VVER 440 Model V230 reactor as the \"oldest and least reliable\" among Soviet reactors, but the IAEA has affirmed its safety and capacity to operate beyond its design lifespan.",
      "• The electricity distribution system was privatized in 2002."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:14.471755",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 7422,
      "bullet_points_count": 28
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Outperforming GDP growth",
    "text": "GDP growth rates in Armenia and some neighboring countries and some regions in\nyears 2010–2017\n\nAccording to official preliminary data GDP grew by 7.6 per cent in 2019,\nlargest recording growth since 2008, leading to Armenia being described as a\n\"Caucasian Tiger.\" Nominal GDP per capita was approximately $4,196 in 2018 and\nis expected to reach $8,283 in 2023, surpassing neighbouring Azerbaijan and\nGeorgia.\n\nWith 8.3%, Armenia recorded highest degree of GDP growth among Eurasian\nEconomic Union countries in 2018 January–June against the same period of 2017.\n\nThe economy of Armenia had grown by 7.5% in 2017 and reached a nominal GDP of\n$11.5 billion per annum, while per capita figure grew by 10.1% and reached\n$3880. With 7.29% Armenia was second best in GDP per capita growth terms in\nEurope and Central Asia in 2017.\n\nArmenian GDP PPP grew total of 316% per capita in 2000–2017, marking it the\nsixth-highest worldwide.\n\nGDP grew 40.7% between 2012 and 2018, and key banking indicators like assets\nand credit exposures almost doubled.\n\nGDP (PPP) per capita of Armenia, Azerbaijan and Georgia in years 1994–2022, IMF data. Year | GDP (millions of drams) | GDP Growth | GDP per capita (drams) | GDP deflator\n---|---|---|---|---\n2000 | 1,031,338.3 | +5.9% | 320,182 | −1.4%\n2001 | 1,175,876.8 | +9.6% | 365,849 | +4.1%\n2002 | 1,362,471.7 | +13.2% | 424,234 | +0.7%\n2003 | 1,624,642.7 | +14.0% | 505,914 | +4.6%\n2004 | 1,907,945.4 | +10.5% | 593,635 | +6.3%\n2005 | 2,242,880.9 | +13.9% | 697,088 | +3.2%\n2006 | 2,656,189.8 | +13.2% | 824,621 | +4.6%\n2007 | 3,149,283.4 | +13.7% | 976,067 | +4.2%\n2008 | 3,568,227.6 | +6.9% | 1,103,348 | +5.9%\n2009 | 3,141,651.0 | −14.1% | 968,539 | +2.6%\n2010 | 3,460,202.7 | +2.2% | 1,062,683 | +7.8%\n2011 | 3,776,443.0 | +4.7% | 1,155,405 | +4.2%\n2012 | 4,000,722.0 | +7.2% | 1,322,946 | -1.2%\n2013 | 4,555,638.2 | +3.3% | 1,507,491 | +3.4%\n2014 | 4,828,626.3 | +3.6% | 1,602,172 | +2.3%\n2015 | 5,032,089.0 | +3.0% | 1,674,795 | +1.2%\n2016  | 5,067,293.5  | +0.2%  |  | +0.3%\n2017  | 5,564,493.3  | +7.5%  |  | +2.1%\n2018  | 6,017,035.2  | +5.2%  |  | +2.8%\n2019  | 6,543,321.8  | +7.6%  |  | +1.0%\n2020  | 6,181,664.1  | -7.5%  |  | +2.0%\n2021 | 6,991,777.8 | +5.8% |  | +6.9%\n2022 | 8,501,435.5 | +12.6% |  | +8.0%\n2023 | 9,502,778.6 | +8.7% |  | +2.8%",
    "openai_summarised_points": [
      "• In 2019, Armenia's GDP grew by 7.6%, marking the largest growth rate since 2008, which led to Armenia being described as a \"Caucasian Tiger\" due to its rapid economic expansion.",
      "• The nominal GDP per capita in Armenia was approximately $4,196 in 2018 and is projected to reach $8,283 by 2023, surpassing neighboring countries Azerbaijan and Georgia in per capita income.",
      "• Armenia recorded the highest GDP growth among Eurasian Economic Union countries in the first half of 2018 (January–June) with a rate of 8.3%, compared to the same period in 2017.",
      "• In 2017, Armenia's economy grew by 7.5%, reaching a nominal GDP of $11.5 billion annually; during the same year, the per capita GDP increased by 10.1% to $3,880, making Armenia the second-best in Europe and Central Asia for GDP per capita growth at 7.29%.",
      "• From 2000 to 2017, Armenia's GDP based on Purchasing Power Parity (PPP) increased by a total of 316% per capita, ranking as the sixth-highest worldwide in this metric.",
      "• Between 2012 and 2018, Armenia's GDP grew by 40.7%, with key banking indicators such as assets and credit exposures nearly doubling in this period.",
      "• According to IMF data covering 1994–2022, Armenia's GDP in millions of drams experienced consistent growth, with notable increases in GDP growth rates and per capita figures, despite some fluctuations such as a -14.1% GDP decline in 2009 and a -7.5% contraction in 2020.",
      "• Armenia's GDP in 2000 was approximately 1,031,338.3 million drams with a 5.9% growth rate; by 2010, GDP increased to 3,460,202.7 million drams with a 2.2% growth rate, and in 2017, it reached 5,564,493.3 million drams with a 7.5% growth rate.",
      "• The GDP deflator, which measures inflation, varied over the years, with notable increases such as +7.8% in 2010, +4.2% in 2011, and fluctuations including a decrease of -1.2% in 2012.",
      "• In 2009, Armenia's GDP contracted by 14.1%, but subsequent years saw recovery and growth, with 2012 experiencing a 7.2% increase, and 2018 recording a 5.2% growth rate.",
      "• The data indicates a resilient Armenian economy with periods of rapid growth, especially post-2010, and a trajectory toward higher GDP per capita and overall economic output."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:21.866940",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2293,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Regional GDP",
    "text": "This is a list of provinces of Armenia by nominal GDP shown in Armenian dram\nand US$. Statistics shown are for 2017.\n\nRank  | Region  | GDP (bil. ֏)  | GDP (bil. US$)  | GDP per capita (֏)  | GDP per capita (US$)\n---|---|---|---|---|---\n1  |  Yerevan | 3,032.454  | 6.286  | 2,816,433  | 5,838\n2  | Ararat Province | 381.659  | 0.791  | 1,478,727  | 3,065\n3  | Kotayk Province | 346.843  | 0.719  | 1,375,270  | 2,851\n4  | Armavir Province | 340.604  | 0.706  | 1,284,327  | 2,662\n5  | Syunik Province | 335.238  | 0.695  | 2,417,001  | 5,010\n6  | Lori Province | 276.931  | 0.574  | 1,263,372  | 2,619\n7  | Shirak Province | 238.001  | 0.493  | 1,002,954  | 2,079\n8  | Gegharkunik Province | 224.241  | 0.465  | 974,118  | 2,019\n9  | Aragatsotn Province | 175.229  | 0.363  | 1,371,121  | 2,842\n10  | Tavush Province | 118.657  | 0.246  | 956,908  | 1,984\n11  | Vayots Dzor Province | 94.636  | 0.196  | 1,892,716  | 3,924\n| **Armenia** | 5,564.493  | 11.535  | 1,867,656  | 3,872",
    "openai_summarised_points": [
      "• The provided data presents the nominal Gross Domestic Product (GDP) of Armenian provinces, measured in Armenian dram (֏) and US dollars ($), based on statistics from the year 2017.",
      "• The list ranks the provinces by their nominal GDP, highlighting the economic output of each region within Armenia.",
      "• Yerevan, the capital city, has the highest nominal GDP, totaling 3,032.454 billion ֏ (approximately 6.286 billion US$), with a GDP per capita of 2,816,433 ֏ (about 5,838 US$).",
      "• Ararat Province ranks second with a GDP of 381.659 billion ֏ (0.791 billion US$) and a GDP per capita of 1,478,727 ֏ (3,065 US$).",
      "• Kotayk Province is third, with a GDP of 346.843 billion ֏ (0.719 billion US$) and a per capita GDP of 1,375,270 ֏ (2,851 US$).",
      "• Armavir Province follows, with a GDP of 340.604 billion ֏ (0.706 billion US$) and a per capita GDP of 1,284,327 ֏ (2,662 US$).",
      "• Syunik Province has a GDP of 335.238 billion ֏ (0.695 billion US$), and a notably high GDP per capita of 2,417,001 ֏ (5,010 US$).",
      "• Lori Province’s GDP is 276.931 billion ֏ (0.574 billion US$), with a per capita GDP of 1,263,372 ֏ (2,619 US$).",
      "• Shirak Province reports a GDP of 238.001 billion ֏ (0.493 billion US$) and a per capita GDP of 1,002,954 ֏ (2,079 US$).",
      "• Gegharkunik Province has a GDP of 224.241 billion ֏ (0.465 billion US$), with a per capita GDP of 974,118 ֏ (2,019 US$).",
      "• Aragatsotn Province’s GDP is 175.229 billion ֏ (0.363 billion US$), and its GDP per capita is 1,371,121 ֏ (2,842 US$).",
      "• Tavush Province has a GDP of 118.657 billion ֏ (0.246 billion US$), with a per capita GDP of 956,908 ֏ (1,984 US$).",
      "• Vayots Dzor Province’s GDP totals 94.636 billion ֏ (0.196 billion US$), and its per capita GDP is 1,892,716 ֏ (3,924 US$).",
      "• The total nominal GDP of Armenia across all provinces is 5,564.493 billion ֏ (approximately 11.535 billion US$).",
      "• The national GDP per capita is 1,867,656 ֏ (about 3,872 US$)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:28.148648",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 981,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "2020 recession",
    "text": "The Armenian economy performed poorly in 2020, and contracted by 7.2% after\nyears of consecutive growth. The two biggest contributing factors were the\nCOVID-19 recession and the Second Nagorno-Karabakh War. In the first half of\n2020, the Armenian economy was negatively impacted by the economic\nrestrictions that were implemented in response to the COVID-19 pandemic. These\nrestrictions included a stay-at-home order, an indoor social distancing\nrequirement, and a mask mandate. These restrictions had a negative impact on\nbusinesses; according to the World Bank, individual consumption dropped by 9%\nin the first six months of 2020 due to the stay-at-home order.\n\nThe economy was further impacted by the war against Azerbaijan later in the\nyear.",
    "openai_summarised_points": [
      "• The Armenian economy experienced a significant decline in 2020, contracting by 7.2%, marking a reversal after years of consecutive economic growth.",
      "• The two primary factors contributing to this economic downturn were the COVID-19 pandemic-induced recession and the Second Nagorno-Karabakh War.",
      "• In the first half of 2020, the economy was adversely affected by measures implemented to curb the spread of COVID-19, including stay-at-home orders, indoor social distancing requirements, and a mask mandate.",
      "• These COVID-19 restrictions negatively impacted business activities and consumer behavior; specifically, the World Bank reported that individual consumption decreased by 9% during the first six months of 2020 due to the stay-at-home order.",
      "• The economic impact was compounded later in the year by the outbreak of hostilities in the Second Nagorno-Karabakh War against Azerbaijan, which further destabilized the Armenian economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:30.753429",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 746,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Agricultural sector",
    "text": "Armenia produced in 2018:\n\n* 415 thousand tons of potatoes;\n* 199 thousand tons of vegetables;\n* 187 thousand tons of wheat;\n* 179 thousand tons of grapes;\n* 138 thousand tons of tomatoes;\n* 126 thousand tons of watermelons;\n* 124 thousand tons of barley;\n* 109 thousand tons of apples;\n* 104 thousand tons of apricots (12th-largest world producer);;\n* 89 thousand tons of cabbages;\n* 54 thousand tons of sugar beet;\n* 52 thousand tons of peaches;\n* 50 thousand tons of cucumbers;\n* 39 thousand tons of onions;\n\nIn addition to smaller productions of other agricultural products.\n\nCornelian cherries, figs, pears, peaches and apples sold at a market in\nYerevan are among a few of Armenian agricultural products\n\nAs of 2010, the agricultural production comprises on average 25 percent of\nArmenia's GDP. In 2006, the agricultural sector accounted for about 20 percent\nof Armenia's GDP.\n\nArmenia's agricultural output dropped by 17.9 percent in the period of\nJanuary–September 2010. This was owing to bad weather, a lack of a government\nstimulus package, and the continuing effects of decreased agricultural\nsubsidies by the Armenian government (per WTO requirements). In addition, the\nshare of agriculture in Armenia's GDP hovered around 17.9% until 2012\naccording to the World Bank. Then already in 2013 the share of it was a bit\nhigher comprising 18.43%. Afterwards a declining trend was registered in the\nperiod of 2013-2017 reaching to around 14.90% in 2017. By comparing the share\nof agriculture as a component of GDP with the neighboring countries (Georgia,\nAzerbaijan, Turkey, Iran) one can notice that the percentage is highest for\nArmenia. As of 2017 the contribution of agriculture to the GDP for the\nneighboring countries was 6.88, 5.63, 6.08 and 9.05 respectively.\n\nIn 2022, the industry with the highest number of companies registered in\nArmenia is Services with 1,907 companies followed by Wholesale Trade and\nManufacturing with 510 and 408 companies respectively.",
    "openai_summarised_points": [
      "• In 2018, Armenia's agricultural production included 415 thousand tons of potatoes, 199 thousand tons of vegetables, 187 thousand tons of wheat, 179 thousand tons of grapes, 138 thousand tons of tomatoes, 126 thousand tons of watermelons, 124 thousand tons of barley, 109 thousand tons of apples, 104 thousand tons of apricots, 89 thousand tons of cabbages, 54 thousand tons of sugar beet, 52 thousand tons of peaches, 50 thousand tons of cucumbers, and 39 thousand tons of onions.",
      "• Armenia also produced smaller quantities of other agricultural products not specified in detail.",
      "• Market sales of Armenian agricultural products include cornelian cherries, figs, pears, peaches, and apples, particularly in Yerevan.",
      "• As of 2010, agricultural production constituted approximately 25 percent of Armenia's Gross Domestic Product (GDP).",
      "• In 2006, the agricultural sector accounted for about 20 percent of Armenia's GDP.",
      "• Armenia's agricultural output experienced a 17.9 percent decline during January–September 2010, attributed to adverse weather conditions, absence of a government stimulus package, and the ongoing effects of reduced agricultural subsidies mandated by the World Trade Organization (WTO).",
      "• The share of agriculture in Armenia's GDP was around 17.9 percent until 2012, according to the World Bank.",
      "• In 2013, the share increased slightly to 18.43 percent.",
      "• A declining trend was observed from 2013 to 2017, with agriculture's contribution decreasing to approximately 14.90 percent in 2017.",
      "• When comparing neighboring countries, Armenia's percentage of GDP from agriculture is the highest; in 2017, neighboring countries' contributions were Georgia at 6.88 percent, Azerbaijan at 5.63 percent, Turkey at 6.08 percent, and Iran at 9.05 percent.",
      "• In 2022, the sector with the highest number of registered companies in Armenia was Services, with 1,907 companies.",
      "• Following Services, Wholesale Trade had 510 companies, and Manufacturing had 408 companies registered in Armenia in 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:38.228006",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1975,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Mining",
    "text": "Armenia's largest mine, the Kajaran copper-molybdenum open-pit mine in\nsouthern Armenia\n\nIn 2017, mining industry output with grew by 14.2% to 172 billion AMD at\ncurrent prices and run at 3.1% of Armenia's GDP.\n\nIn 2017, mineral product (without precious metals and stones) exports grew by\n46.9% and run at US$692 million, which comprised 30.1% of all exports.",
    "openai_summarised_points": [
      "• Armenia's largest mine is the Kajaran copper-molybdenum open-pit mine located in southern Armenia.",
      "• In 2017, the country's mining industry output increased by 14.2%, reaching a total value of 172 billion AMD at current prices.",
      "• The mining sector contributed approximately 3.1% to Armenia's Gross Domestic Product (GDP) in 2017.",
      "• In the same year, exports of mineral products excluding precious metals and stones grew by 46.9%, totaling US$692 million.",
      "• Mineral exports (excluding precious metals and stones) accounted for 30.1% of all Armenian exports in 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:41.315960",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 360,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.3",
    "section_name": "Construction sector",
    "text": "Real estate transactions count grew by 36% in September 2019 compared to\nSeptember 2018. Also, the average market value of one square meter of housing\nin apartment buildings in Yerevan in September 2019 grew by 10.8% from\nSeptember 2018.\n\nIn 2017, construction output increased by 2.2% reaching 416 billion AMD.\n\nArmenia experienced a construction boom during the latter part of the 2000s.\nAccording to the National Statistical Service, Armenia's booming construction\nsector generated about 20 percent of Armenia's GDP during the first eight\nmonths of 2007. According to a World Bank official, 30 percent of Armenia's\neconomy in 2009 came from the construction sector.\n\nHowever, during the January to September 2010 period, the sector experienced a\n5.2 percent year-on-year decrease, which according to the Civilitas Foundation\nis an indication of the unsustainability of a sector based on an elite market,\nwith few products for the median or low budgets. This decrease comes despite\nthe fact that an important component of the government stimulus package was to\nsupport the completion of ongoing construction projects.",
    "openai_summarised_points": [
      "• In September 2019, the number of real estate transactions in Armenia increased by 36% compared to September 2018, indicating significant growth in the property market during that period.",
      "• The average market value of one square meter of housing in apartment buildings in Yerevan in September 2019 rose by 10.8% compared to September 2018, reflecting a substantial increase in housing prices.",
      "• In 2017, Armenia's construction output grew by 2.2%, reaching a total value of 416 billion AMD, demonstrating moderate expansion in the sector.",
      "• Armenia experienced a construction boom in the late 2000s, during which the sector played a crucial role in the economy.",
      "• According to the National Statistical Service, the construction sector contributed approximately 20% of Armenia's GDP during the first eight months of 2007, highlighting its significant economic impact at that time.",
      "• A World Bank official stated that in 2009, about 30% of Armenia's economy was derived from the construction sector, emphasizing its importance in the national economy.",
      "• Between January and September 2010, the construction sector in Armenia experienced a 5.2% decrease year-on-year, indicating a slowdown in activity.",
      "• The Civilitas Foundation attributed the decline in 2010 to the sector's reliance on an elite market with limited products for median or low-income budgets, suggesting issues of sustainability.",
      "• Despite government efforts to stimulate the sector through a package aimed at supporting ongoing construction projects, the sector still faced a downturn in the first nine months of 2010."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:47.592936",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1119,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.4",
    "section_name": "Energy",
    "text": "In 2017, electricity generation increased by 6.1% reaching 7.8 billion KWh.",
    "openai_summarised_points": [
      "• In 2017, Armenia's electricity generation experienced a 6.1% increase compared to previous years.",
      "• The total electricity produced in 2017 amounted to 7.8 billion kilowatt-hours (KWh)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:49.700305",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 75,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.5",
    "section_name": "Digital economy",
    "text": "The digital economy is a branch of the economy based on digital computing\ntechnologies. The digital economy is sometimes referred to as the Internet\neconomy or the web economy. The digital economy is often intertwined with the\ntraditional economy, making it difficult to distinguish between them. Aimed at\nthe sector's development on November 15, 2021, the Silicon Mountains Summit\ndedicated to introducing intelligent solutions in the economy was held in\nYerevan. The main topic of the summit was the prospect of digitalization of\nthe economy in Armenia. The main driving force of this sphere in Armenia is\nthe banks. Digital transformation is a necessity for banks and financial\ninstitutions. At the moment, ACBA Bank is the leader․",
    "openai_summarised_points": [
      "• The digital economy is a sector of the economy that is based on digital computing technologies.",
      "• It is sometimes referred to as the Internet economy or the web economy.",
      "• The digital economy is often intertwined with the traditional economy, which makes it challenging to distinguish between the two.",
      "• On November 15, 2021, the Silicon Mountains Summit was held in Yerevan, focusing on the development of the digital economy in Armenia.",
      "• The summit's primary theme was the prospects of digitalization of Armenia's economy and introducing intelligent solutions within it.",
      "• The digital economy in Armenia is primarily driven by the banking sector, which acts as the main force behind its development.",
      "• Digital transformation is considered a necessity for banks and financial institutions in Armenia to stay competitive and innovative.",
      "• Currently, ACBA Bank is recognized as the leader in digital banking and financial services within Armenia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:52.306620",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 734,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.6",
    "section_name": "Industrial sector",
    "text": "In 2017, industrial output increased by 12.6% annually reaching 1661 billion\nAMD.\n\nIndustrial output was relatively positive throughout 2010, with year-on-year\naverage growth of 10.9 percent in the period January to September 2010, due\nlargely to the mining sector where higher global demand for commodities led to\nhigher prices. According to the National Statistical Service, during the\nJanuary–August 2007 period, Armenia's industrial sector was the single largest\ncontributor to the country's GDP, but remained largely stagnant with\nindustrial output increasing only by 1.7 percent per year. In 2005, Armenia's\nindustrial output (including electricity) made up about 30 percent of GDP.",
    "openai_summarised_points": [
      "• In 2017, Armenia's industrial output increased by 12.6% annually, reaching a total value of 1661 billion AMD.",
      "• Throughout 2010, the industrial sector experienced relatively positive growth, with a year-on-year average increase of 10.9% from January to September 2010.",
      "• The notable growth in 2010 was primarily driven by the mining sector, which benefited from higher global demand for commodities, leading to increased prices.",
      "• According to the National Statistical Service, during January–August 2007, Armenia's industrial sector was the largest contributor to the country's GDP.",
      "• Despite its significant contribution, the industrial sector remained largely stagnant during this period, with industrial output increasing only by 1.7% per year.",
      "• In 2005, Armenia's industrial output, including electricity, accounted for approximately 30% of the country's GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:20:56.633252",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 688,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.7",
    "section_name": "Services sector",
    "text": "In the 2000s, along with the construction sector, the services sector was the\ndriving force behind Armenia's recent high economic growth rate. Between 2017\nand 2019, Armenia's economy increased fast, with annual rate of GDP growth\naveraging 6.8 percent. Following the political realignment of 2018, prudent\nmacroeconomic policy helped develop a track record of macroeconomic stability\nand an enhanced business environment. In Armenia, the service sector in 2020\nreduced volumes by 14.7%, against 15% growth a year earlier, amounting to 1.7\ntrillion drams ($3.5 billion). According to the Statistical Committee, a\nnegative trend was recorded in all service segments except finance, as well as\ninformation and communication.\n\nHeadquarters of VivaCell MTS, Armenia's leading mobile services provider",
    "openai_summarised_points": [
      "• During the 2000s, the services sector, alongside the construction sector, was a primary driver of Armenia's recent high economic growth rate.",
      "• Between 2017 and 2019, Armenia's economy experienced rapid growth, with an average annual GDP growth rate of 6.8 percent.",
      "• Following the political realignment of 2018, Armenia implemented prudent macroeconomic policies that contributed to macroeconomic stability and improved the business environment.",
      "• In 2020, the volume of services in Armenia decreased by 14.7 percent compared to the previous year, which saw a 15 percent growth, totaling 1.7 trillion drams ($3.5 billion).",
      "• According to the Armenian Statistical Committee, in 2020, all service segments experienced negative trends except for the finance sector and information and communication services.",
      "• The headquarters of VivaCell MTS, Armenia's leading mobile services provider, is a notable entity within the country's service sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:01.756430",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 796,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.7.1",
    "section_name": "Retail trade",
    "text": "In 2010, retail trade turnover was largely unaltered compared to 2009. The\nexisting monopolies throughout the retail sector have made the sector non-\nresponsive to the crisis and resulted in near zero growth. The aftermath of\nthe crisis has started to shift the structure in the retail sector in favor of\nfood products.\n\nNowadays(2019), Armenia has improved standards of living and growing income,\nwhich brought to the improvement of retail sector in Armenia. retail sector\nhas the highest employment level. While the sector improves, currently the\nmajor sector is still in Yerevan, and not in the other cities of Armenia. The\ndevelopment that happened in this sector was the opening of Dalma Garden Mall,\nand later Yerevan mall, Rio mall and Rossia mall, which dramatically increased\nthe quality of retail in Yerevan. Currently there is a new development, as in\nGyumri there is a new mall opened called Shirak Mall. Another reason for the\ndevelopment of the retail is the development that happened in the banking\nindustry. Today people can easily get financial assistance from the banks\nright to their credit cards, without visiting the bank.",
    "openai_summarised_points": [
      "• In 2010, retail trade turnover in Armenia remained largely unchanged compared to 2009, indicating minimal growth during that period.",
      "• The retail sector was characterized by existing monopolies across its various segments, which rendered the sector unresponsive to economic crises and resulted in near zero growth rates.",
      "• The aftermath of the economic crisis initiated a structural shift within Armenia’s retail sector, with a noticeable increase in the proportion of food products in retail sales.",
      "• As of 2019, Armenia experienced improved standards of living and rising income levels, which contributed to the overall enhancement of the retail sector.",
      "• The retail sector in Armenia has the highest employment levels among various economic sectors.",
      "• Despite sector improvements, retail activity remains predominantly concentrated in Yerevan, with less developed retail infrastructure in other cities of Armenia.",
      "• Significant developments in retail infrastructure include the opening of major shopping malls such as Dalma Garden Mall and subsequently Yerevan Mall, Rio Mall, and Rossia Mall, which significantly elevated the quality and scope of retail services in Yerevan.",
      "• A recent development is the opening of Shirak Mall in Gyumri, indicating expansion of retail infrastructure beyond Yerevan.",
      "• The growth of the retail sector has been supported by advancements in the banking industry, notably the increased ease of obtaining financial assistance, such as credit cards, directly from banks without the need for physical bank visits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:07.318724",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1143,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.7.2",
    "section_name": "Information and Communication Technologies",
    "text": "As of February 2019 nearly 23 thousand employees were counted in ICT sector.\nWith 404 thousand AMD they enjoyed highest pay rate among surveyed sectors of\neconomy. Average salaries in pure IT sector (excluding communications sub-\nsector) stood at 582 thousand AMD.",
    "openai_summarised_points": [
      "• As of February 2019, approximately 23,000 employees were working in the Information and Communication Technologies (ICT) sector in Armenia.",
      "• Employees in the ICT sector earned an average monthly salary of 404,000 AMD, representing the highest pay rate among the surveyed sectors of the Armenian economy.",
      "• The average salary in the pure IT sector, excluding the communications sub-sector, was 582,000 AMD."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:09.302118",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 264,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.7.3",
    "section_name": "Financial Services",
    "text": "In January 2019 there were 20.5 thousand employees registered in the financial\nsector.\n\nAccording to Moody's, robust economic growth will benefit banks with GDP\ngrowth remaining robust at around 4.5% in 2019–20.\n\nDevelopment of Financial Services in 2017 according to CBA report  Financial Services Segments  | 2017  | 2016\n---|---|---\n**Banking system** |  |\nNet profit  | 39.7 billion AMD  | 31.7 billion AMD\nReturn on assets (ROA)  | 1.0%  | 0.9%\nReturn on equity (ROE)  | 6.0%  | 5.8%\nAssets growth rate  | 9.2%  |\nTotal capital growth rate  | 4.9%  |\nLiabilities growth rate  | 10.1%  |\nLoans provided to businesses growth rate  | 8.5%  |\nGeneral liquidity normative indicator (minimum 15%)  | 32.1%  |\nOngoing liquidity normative indicator (minimum 60%)  | 141.7%  |\n**Credit organizations** |  |\nAssets growth rate  | 21.1%  |\nTotal capital growth rate  | 41.4%  |\nLiabilities growth rate  | 3.5%  |\n**Insurance system** |  |\nAssets growth rate  | 6.1%  |\nTotal capital growth rate  | –11%  |\nLiabilities growth rate  | 11.2%  |\n**Investment companies** |  |\nAssets growth rate  | 54.8%  |\nTotal capital growth rate  | 51.9%  |\nLiabilities growth rate  | 55.3%  |\n**Mandatory pension funds** |  |\nNet assets growth rate  | 67.0%  |\nNet assets  | 105.6 billion AMD  |\n\nIndustry report on banking sector prepared by AmRating presents slightly\nvarying figures for some of above data.",
    "openai_summarised_points": [
      "• As of January 2019, there were 20,500 employees registered in the Armenian financial sector.",
      "• Moody's forecasts that Armenia's robust economic growth, projected at approximately 4.5% GDP increase for 2019–2020, will positively impact the banking sector.",
      "• According to the 2017 CBA (Central Bank of Armenia) report, the financial services sector experienced notable growth across various segments compared to 2016.",
      "• In the banking system, net profit increased from 31.7 billion AMD in 2016 to 39.7 billion AMD in 2017.",
      "• The banking system's return on assets (ROA) slightly improved from 0.9% in 2016 to 1.0% in 2017.",
      "• Return on equity (ROE) in the banking sector increased from 5.8% in 2016 to 6.0% in 2017.",
      "• Assets within the banking system grew by 9.2% in 2017.",
      "• Total capital of banks increased by 4.9% in 2017.",
      "• Banking liabilities grew by 10.1% during 2017.",
      "• Loans provided to businesses by banks increased by 8.5% in 2017.",
      "• The general liquidity normative indicator (minimum requirement of 15%) stood at 32.1% in 2017, more than double the minimum.",
      "• The ongoing liquidity normative indicator (minimum requirement of 60%) was at 141.7% in 2017, significantly exceeding the minimum threshold.",
      "• The assets of credit organizations grew by 21.1% in 2017.",
      "• Total capital of credit organizations increased by 41.4% in 2017.",
      "• Liabilities of credit organizations grew by 3.5% during 2017.",
      "• The insurance system's assets increased by 6.1% in 2017.",
      "• Total capital in the insurance sector declined by 11% in 2017.",
      "• Insurance liabilities grew by 11.2% in 2017.",
      "• Investment companies experienced a 54.8% growth in assets in 2017.",
      "• Total capital of investment companies increased by 51.9% in 2017.",
      "• Liabilities of investment companies grew by 55.3% during 2017.",
      "• Mandatory pension funds saw a net assets growth rate of 67.0% in 2017.",
      "• The net assets of mandatory pension funds amounted to 105.6 billion AMD in 2017.",
      "• An industry report on the banking sector prepared by AmRating indicates slight variations in some of the above figures."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:15.018227",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1387,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.7.4",
    "section_name": "Tourism",
    "text": "Grand Hotel Yerevan, established in 1926\n\nTourism in Armenia has been a key sector to the Armenian economy since the\n1990s when tourist numbers exceeded half a million people visiting the country\nevery year (mostly ethnic Armenians from the Diaspora). The Armenian Ministry\nof Economy reports that most international tourists come from Russia, EU\nstates, the United States and Iran. Though relatively small in size, Armenia\nhas three UNESCO world heritage sites.\n\nDespite internal and external problems, the number of incoming tourists has\nbeen continually increasing. 2018 saw a record high of over 1.6 million\ninbound tourists.\n\nIn 2018 receipts from international tourism amounted to $1.2 billion, nearly\ntwice the value for 2010. In per capita terms these stood at $413, ahead of\nTurkey and Azerbaijan, but behind Georgia.\n\nIn 2019 the largest growth at 27.2% was shown by accommodation and catering\nsector, which came as a result of the growth of tourist flows.",
    "openai_summarised_points": [
      "• The Grand Hotel Yerevan was established in 1926, serving as a notable landmark in Armenia’s hospitality industry.",
      "• Tourism has been a vital sector of Armenia’s economy since the 1990s, with annual tourist numbers exceeding half a million, primarily consisting of ethnic Armenians from the Diaspora.",
      "• According to the Armenian Ministry of Economy, the majority of international tourists originate from Russia, European Union member states, the United States, and Iran.",
      "• Despite its relatively small geographical size, Armenia possesses three UNESCO World Heritage sites, highlighting its cultural and historical significance.",
      "• The number of inbound tourists to Armenia has been steadily increasing despite internal and external challenges faced by the country.",
      "• In 2018, Armenia recorded a record high of over 1.6 million inbound tourists, marking a significant milestone in its tourism development.",
      "• Tourism receipts in 2018 totaled approximately $1.2 billion, nearly doubling the income generated in 2010, indicating substantial growth in the sector.",
      "• Per capita tourism expenditure in Armenia in 2018 was $413, which surpasses Turkey and Azerbaijan but remains below Georgia.",
      "• The accommodation and catering sector experienced the largest growth in 2019, increasing by 27.2%, driven by the overall growth in tourist flows."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:21.616880",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 966,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.8",
    "section_name": "Foreign debt",
    "text": "The amount of interest paid on the public debt rose significantly (from AMD 11\nbillion in 2008 to AMD 46.5 billion in 2013), as did the amount of principle\nrepayments (from annual repayments of US$15–16 million in 2005-2008 exceeding\nUS$150 million in 2013). This is a significant financial load on the state\nbudget. Because of additional borrowings and lower concessionality of new\nloans, the burden might rise in the future years.\n\nIn 2019, the Armenian government planned to obtain about $490 million in fresh\nloans rising public debt to about $7.5 billion. Just over $6.9 billion of that\nwould be the government's debt.\n\nAfter reaching nearly 60.0 per cent of GDP, the public debt to GDP ratio\ndecreased by approximately three percentage points in 2018 compared with a\nyear before and stood at 55.7 per cent at the end of 2018.\n\nThe government's public debt at the end of 2019 stood at $6.94 billion, making\n50.3% of its GDP.\n\nIn March 2019 sovereign debt was $5488 million, $86.5 million (about 2%) less\nthan a year ago.\n\nOther sources quote Armenia's debt at $10.8 billion in September 2018,\npossibly including non-public debt too.\n\nIn 2018 debt-to-GDP ratio stood at 55.7% down from 58.7% in 2017.\n\nArmenia revised the country's fiscal rules in 2018, setting a permissible\nthreshold for public debt in the amount of 40, 50 and 60% of GDP. At the same\ntime, it established that in case of force majeure situations such as natural\ndisasters, wars, the government will be allowed to exceed this threshold.\n\nThe debt rose by $863.5 million in 2016 and by another $832.5 million in 2017.\nIt totalled just $1.9 billion (13.5% of GDP) before the 2008 financial crisis\nand the Great Recession.",
    "openai_summarised_points": [
      "• The interest paid on Armenia's public debt increased significantly from AMD 11 billion in 2008 to AMD 46.5 billion in 2013, reflecting a substantial rise in debt servicing costs.",
      "• The amount of principal repayments on public debt also grew markedly, from annual repayments of US$15–16 million during 2005-2008 to exceeding US$150 million in 2013.",
      "• This escalation in debt servicing represents a significant financial burden on the Armenian state budget.",
      "• Due to additional borrowings and the decreasing concessionality of new loans, the debt burden is projected to increase further in future years.",
      "• In 2019, the Armenian government planned to secure approximately $490 million in new loans, which would raise the total public debt to about $7.5 billion.",
      "• Of this total, just over $6.9 billion would constitute the government's direct debt.",
      "• The public debt-to-GDP ratio reached nearly 60.0% but decreased by approximately three percentage points in 2018 compared to the previous year, ending at 55.7% at the end of 2018.",
      "• The government's public debt at the end of 2019 was valued at $6.94 billion, accounting for 50.3% of Armenia's GDP.",
      "• As of March 2019, Armenia's sovereign debt was $5,488 million, which was about $86.5 million (approximately 2%) less than the amount recorded a year earlier.",
      "• Other sources reported Armenia's total debt at $10.8 billion in September 2018, potentially including non-public debt.",
      "• The debt-to-GDP ratio in 2018 stood at 55.7%, down from 58.7% in 2017.",
      "• In 2018, Armenia revised its fiscal rules to set permissible public debt thresholds at 40%, 50%, and 60% of GDP, with provisions allowing the government to exceed these thresholds in force majeure situations such as natural disasters and wars.",
      "• The public debt increased by $863.5 million in 2016 and by an additional $832.5 million in 2017.",
      "• Prior to the 2008 financial crisis and the Great Recession, Armenia's total public debt was approximately $1.9 billion, representing 13.5% of GDP."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:30.199497",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1692,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.9",
    "section_name": "Exchange rate of national currency",
    "text": "National Statistics Office publishes official reference exchange rates for\neach year.",
    "openai_summarised_points": [
      "• The National Statistics Office of Armenia is responsible for publishing official reference exchange rates for each year.",
      "• These reference rates serve as the official benchmark for the Armenian currency's value in relation to foreign currencies annually.",
      "• The publication of these rates provides a standardized measure for economic analysis, policy formulation, and international transactions.",
      "• The reference exchange rates are used by government agencies, financial institutions, and businesses within Armenia to ensure consistency in currency valuation.",
      "• The rates are updated annually, reflecting changes in the foreign exchange market and economic conditions.",
      "• The official reference exchange rates are considered authoritative and are often used in official reports, statistical analyses, and economic planning.",
      "• The specific methodology or sources used by the National Statistics Office to determine these rates are not detailed in the section."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:32.566936",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 85,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.10",
    "section_name": "Inflation",
    "text": "For 2023 the IMF forecasts inflation at 3.5%, which is below most neighbouring\ncountries.\n\nThe Armenian government projects inflation at 2.7% in 2019.\n\nThe inflation rate in Armenia in 2020 was 1.21 percent, a 0.23 percent\ndecrease over 2019, in 2019 was 1.44 percent, a 1.08 percent decrease over\n2018, in 2018 was 2.52 percent, up 1.55 percent from 2017 and in 2017 was 0.97\npercent, a 2.37 percent rise from 2016.",
    "openai_summarised_points": [
      "• For 2023, the International Monetary Fund (IMF) forecasts Armenia's inflation rate at 3.5%, which is lower than that of most neighboring countries.",
      "• The Armenian government projected the inflation rate at 2.7% for the year 2019.",
      "• In 2020, Armenia experienced an inflation rate of 1.21%, representing a decrease of 0.23 percentage points compared to 2019.",
      "• The inflation rate in 2019 was 1.44%, which is a decrease of 1.08 percentage points from the 2.52% recorded in 2018.",
      "• In 2018, Armenia's inflation rate was 2.52%, an increase of 1.55 percentage points from 2017.",
      "• The inflation rate in 2017 was 0.97%, marking a rise of 2.37 percentage points from the 2016 inflation rate."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:35.976280",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 416,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.11",
    "section_name": "Cash remittances",
    "text": "Central Bank of Armenia's Educational Center in Dilijan\n\nCash remittances from Armenians working abroad — mostly in Russia and the\nUnited States — contribute significantly to Armenia's Gross Domestic Product\nmaking up 14% of GDP in 2018. They help Armenia sustain double-digit economic\ngrowth and finance its massive trade deficit.\n\nIn 2008 transfers reached record high of $2.3 billion. In 2015 they reached\n10-year low at $1.6 billion. In 2018, they run at round $1.8 billion. $0.8\nbillion were transferred in first half of 2019. According to CBA their impact\non economy is decreasing, as GDP grows at outperforming rate.\n\nNet private transfers decreased in 2009, but saw a continuous increase during\nthe first six months of 2010. Since private transfers from the Diaspora tend\nto be mostly injected into consumption of imports and not in high value-added\nsectors, the transfers have not resulted in sizeable increases in\nproductivity.\n\nAccording to the Central Bank of Armenia, during the first half of 2008, cash\nremittances sent back to Armenia by Armenians working abroad rose by 57.5\npercent and totaled US$668.6 million, equivalent to 15 percent of the\ncountry's first-half Gross Domestic Product. However, the latter figures only\nrepresent cash remittances processed through Armenian commercial banks.\nAccording to RFE/RL, comparable sums are believed to be transferred through\nnon-bank systems, implying that cash remittances make up approximately 30\npercent of Armenia's GDP in the first half of 2008.\n\nIn 2007 cash remittances through bank transfers rose by 37 percent to a\nrecord-high level of US$1.32 billion. According to the Central Bank of\nArmenia, in 2005, cash remittances from Armenians working abroad reached a\nrecord-high level of $1 billion, which is worth more than one fifth of the\ncountry's 2005 GDP.",
    "openai_summarised_points": [
      "• Cash remittances from Armenians working abroad, primarily in Russia and the United States, significantly contribute to Armenia's economy, accounting for 14% of the Gross Domestic Product (GDP) in 2018.",
      "• These remittances play a crucial role in supporting Armenia's double-digit economic growth and financing its substantial trade deficit.",
      "• In 2008, remittances reached a record high of $2.3 billion, marking the peak of financial inflows from the diaspora.",
      "• In 2015, remittances declined to a 10-year low of $1.6 billion, reflecting fluctuations in diaspora income and economic conditions.",
      "• By 2018, remittances slightly increased to approximately $1.8 billion.",
      "• In the first half of 2019, $0.8 billion was transferred to Armenia via remittances.",
      "• According to the Central Bank of Armenia (CBA), the impact of remittances on the national economy is decreasing, as Armenia's GDP grows at an outperforming rate.",
      "• Net private transfers decreased in 2009 but experienced continuous growth during the first six months of 2010.",
      "• Most private transfers from the Armenian diaspora are primarily used for consumption, especially imports, rather than invested in high value-added sectors, limiting their effect on productivity increases.",
      "• During the first half of 2008, cash remittances sent home by Armenians abroad increased by 57.5%, totaling $668.6 million, which was equivalent to 15% of Armenia's first-half GDP.",
      "• These figures represent cash remittances processed through Armenian commercial banks; however, comparable sums are believed to be transferred via non-bank systems, suggesting that total cash remittances may constitute approximately 30% of Armenia's GDP in the first half of 2008.",
      "• In 2007, cash remittances through bank transfers rose by 37% to a record-high of $1.32 billion.",
      "• In 2005, cash remittances from Armenians abroad reached $1 billion, which was more than one-fifth of Armenia's GDP for that year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:42.326261",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1826,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.12",
    "section_name": "Banking",
    "text": "Ameriabank headquarters in Yerevan\n\nThe central bank has set additional capital buffers in the banking sector. In\nforce since April 2019, the regulator set three buffers exceeding the current\ncapital adequacy requirement compliant with the Basel III regulation: a\ncapital conservation buffer, a counter-cyclical capital buffer and a systemic\nrisk buffer. Full implementation of the buffers over the course of the next\nfew years will strengthen the financial sector's resistance to economic shocks\nand help increase the efficiency of macroprudential policies.\n\nArmenian banks' lending grew by 10 percent in 2019.",
    "openai_summarised_points": [
      "• The central bank of Armenia has established additional capital buffers within the banking sector to enhance financial stability.",
      "• These capital buffers have been in force since April 2019.",
      "• The regulator implemented three specific buffers that exceed the existing capital adequacy requirements aligned with Basel III standards:",
      "• A capital conservation buffer",
      "• A counter-cyclical capital buffer",
      "• A systemic risk buffer",
      "• The full implementation of these buffers is planned over the next few years, aiming to strengthen the resilience of the financial sector against economic shocks.",
      "• The introduction of these buffers is also intended to improve the effectiveness of macroprudential policies.",
      "• In 2019, Armenian banks experienced a 10 percent growth in lending.",
      "• The image caption indicates that Ameriabank's headquarters is located in Yerevan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:45.806748",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 611,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.13",
    "section_name": "Microfinance",
    "text": "The establishment of Microfinance institutions in Armenia was dependent on\nthem making a complementary effort to fill the gap in the financial services\nsector. Its primary goal was to deal with the rising unemployment and poverty\nbrought on by transitory shock. In this context, self-employment in the\ncountry emerged as one of the best options to unemployment. Commercial banking\ninstitutions in Armenia overlooked micro-business enterprises that lacked\ncredit histories and sufficient funding. Microfinance has been proposed as an\nadaptable instrument to assist people in transition economies take advantage\nof new opportunities.",
    "openai_summarised_points": [
      "• The establishment of microfinance institutions in Armenia was driven by the need to complement existing financial services and address gaps within the sector.",
      "• The primary goal of these institutions was to combat rising unemployment and poverty caused by transitory economic shocks.",
      "• In the Armenian context, self-employment emerged as one of the most effective strategies to mitigate unemployment.",
      "• Commercial banking institutions in Armenia tended to overlook micro-business enterprises that lacked established credit histories and sufficient funding.",
      "• Microfinance was proposed as a flexible and adaptable instrument to support individuals in transition economies, enabling them to capitalize on new economic opportunities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:48.283790",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 631,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14",
    "section_name": "Government revenues",
    "text": "In August 2019 Moody's Investors Service upgraded Armenia to Ba3 rating with\nstable outlook.\n\nAccording to the National Statistical Service, Armenia's government debt stood\nat AMD 3.1 trillion (about $6,4 billion, including $5,1 billion of external\ndebt) as of November 30, 2017. Armenia's debt-to-GDP ratio will drop by 1% in\n2018 according to finance minister.\n\nIn Armenia's external debt ($5.5 billion as of January 1, 2018), the arrears\nfor multi-country credit programs dominate – 66.2% or $3.6 billion, followed\nby debt on bilateral loan programs - 17.5% or $958.9 million and investments\nof non-residents in Armenian Eurobonds – 15,4% or $844.9 million.\n\nFor the whole Armenian economy and international commerce, 2020 was a year of\ndecline. In a variety of areas Armenian commodities are being exported and\nimported at a lower rate. According to the Armenian Statistical Committee,\nArmenia exported goods worth $2.544 billion in 2020, a fall of 3.9 percent\nfrom 2019. Armenia imported items worth 4.559 billion dollars in 2020, down\n17.7% from the previous year.The volume of Armenia's international trade has\nvaried throughout the previous 10 years.",
    "openai_summarised_points": [
      "• In August 2019, Moody's Investors Service upgraded Armenia's credit rating to Ba3 with a stable outlook, indicating a moderate investment risk and stable economic prospects.",
      "• According to the National Statistical Service, Armenia's government debt was AMD 3.1 trillion as of November 30, 2017, which is approximately $6.4 billion, including $5.1 billion of external debt.",
      "• Armenia's debt-to-GDP ratio was projected to decrease by 1% in 2018, as stated by the Armenian finance minister, reflecting efforts to improve fiscal stability.",
      "• As of January 1, 2018, Armenia's external debt totaled $5.5 billion, with the majority comprising arrears for multi-country credit programs, accounting for 66.2% or $3.6 billion.",
      "• Bilateral loan program debts constituted 17.5% or $958.9 million of Armenia's external debt, while investments by non-residents in Armenian Eurobonds made up 15.4% or $844.9 million.",
      "• The year 2020 marked a decline for Armenia's economy and international commerce, characterized by reduced export and import activities across various sectors.",
      "• According to the Armenian Statistical Committee, Armenia exported goods worth $2.544 billion in 2020, representing a 3.9% decrease compared to 2019.",
      "• In 2020, Armenia imported goods valued at $4.559 billion, which is a 17.7% reduction from the previous year.",
      "• Over the past decade, Armenia's international trade volume has experienced fluctuations, reflecting varying economic conditions and external factors impacting trade activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:53.292408",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1158,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.1",
    "section_name": "Employee income tax",
    "text": "From January 1, 2020, Armenia will switch to a flat income taxation system,\nwhich, regardless of the amount will tax wages at 23%. Moreover, until 2023\nthe taxation rate will gradually decrease from 23% to 20%.",
    "openai_summarised_points": [
      "• Starting from January 1, 2020, Armenia implemented a transition to a flat income taxation system.",
      "• Under this new system, all wages are taxed at a uniform rate of 23%, regardless of income level.",
      "• The taxation rate is scheduled to gradually decrease from 23% to 20% by the year 2023.",
      "• This gradual reduction in the income tax rate is part of Armenia’s fiscal policy adjustments over the specified period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:55.613430",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 210,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.2",
    "section_name": "Corporate income tax",
    "text": "The reform adopted in June 2019 aims to boost medium-term economic activity\nand to increase tax compliance. Among other measures, the corporate income tax\nwas reduced by two percentage points to 18.0 per cent and the tax on dividends\nfor non-resident organisations halved to 5.0 per cent.",
    "openai_summarised_points": [
      "• The reform adopted in June 2019 was designed to stimulate medium-term economic activity in Armenia.",
      "• One of the primary objectives of the reform was to enhance tax compliance among taxpayers.",
      "• As part of the reform measures, the corporate income tax rate was reduced by two percentage points, lowering it from its previous rate to 18.0 percent.",
      "• The tax on dividends paid to non-resident organizations was halved, decreasing from its previous rate to 5.0 percent."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:21:58.293433",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 288,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.3",
    "section_name": "Special taxation for small business",
    "text": "From January 1, 2020, the republic will abandon two alternative tax systems -\nself-employed and family entrepreneurship. They will be replaced by micro-\nentrepreneurship with a non-taxable threshold of up to 24 million drams.\nBusiness entities that carry out specialized activities, in particular,\naccounting, advocacy, and consulting will not be considered as micro-business\nentities. Micro business will be exempted from all types of taxes other than\nincome tax, which will be 5 thousand drams per employee.",
    "openai_summarised_points": [
      "• Starting from January 1, 2020, Armenia will abolish two alternative tax systems: the self-employed system and the family entrepreneurship system.",
      "• These abolished systems will be replaced by a new micro-entrepreneurship regime.",
      "• The micro-entrepreneurship system will have a non-taxable income threshold of up to 24 million drams.",
      "• Business entities engaged in specialized activities such as accounting, advocacy, and consulting will not be classified as micro-business entities under this new regime.",
      "• Micro-business entities will be exempt from all types of taxes except for income tax.",
      "• The income tax for micro-business entities will be set at 5 thousand drams per employee."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:00.582442",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 509,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.4",
    "section_name": "Value-added tax",
    "text": "Over half of the tax revenues in January–August 2008 were generated from\nvalue-added taxes (VAT) of 20%. By comparison, corporate profit tax generated\nless than 16 percent of the revenues. This suggests that tax collection in\nArmenia is improving at the expense of ordinary citizens, rather than wealthy\ncitizens (who have been the main beneficiaries of Armenia's double-digit\neconomic growth in recent years).\n\nVAT (Value Added Tax): In Armenia, VAT-paying individuals subtract the VAT\npaid on their inputs from the VAT levied on their sales and account to the tax\nauthorities for the difference. The standard rate of VAT on domestic sales of\ngoods and services, as well as imports importation, is 20%. Exports of\nproducts and services are not taxed.",
    "openai_summarised_points": [
      "• In the period of January–August 2008, over 50% of Armenia's tax revenues were derived from value-added taxes (VAT) at a rate of 20%.",
      "• During the same period, corporate profit tax contributed less than 16% of the total tax revenues, indicating a relatively smaller share compared to VAT.",
      "• The data suggests that Armenia's tax collection efforts are primarily benefiting ordinary citizens rather than the wealthy, who have historically been the main beneficiaries of the country's recent double-digit economic growth.",
      "• In Armenia, VAT-paying individuals calculate their tax obligations by subtracting the VAT paid on their inputs from the VAT charged on their sales, and then remit the difference to the tax authorities.",
      "• The standard VAT rate applied to domestic sales of goods and services, as well as imports, is 20%.",
      "• Exports of products and services in Armenia are exempt from VAT, meaning they are not taxed."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:03.751411",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 751,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.5",
    "section_name": "Exports",
    "text": "| This graph was using the legacy Graph extension, which is no longer\nsupported. It needs to be converted to the new Chart extension.\n---|---\n\n* minerals: 692 million USD (32.3%)\n* food: 531 million USD (24.8%)\n* textile: 130.6 million USD (6.1%)\n* precious metals and products of these: 289.6 million USD (13.5%)\n* non-precious metals and products of these: 177.5 million USD (8.3%)\n* other exports: 321.8 million USD (15.0%)\n\n* Bulgaria: 12.8%\n* Germany: 5.9%\n* Netherlands: 4%\n* Other EU countries: 5.5%\n* Switzerland: 12%\n* United States: 3.1%\n* Russia: 24.1%\n* Other CIS countries: 1.7%\n* Georgia: 6.9%\n* China: 5.5%\n* Iran: 3.8%\n* Iraq: 5.4%\n* UAE: 4.6%\n* exports to other countries: 4.7%\n\nAccording to the National Statistical Committee, in 2018, exports amounted to\n$2.411.9 billion, having grown by 7.8% from the previous year. After a boom of\nalmost 93% in 2022, the IMF expects exports of goods and services to grow by\n22% in 2023 and 8% in 2024.\n\nThe goods export structure changed considerably in 2018 as the export of the\ntraditional mining sector decreased while the share of textiles, agriculture\nand precious metals increased.\n\nGeographical location of the country and relatively low electricity costs are\ncomparative advantages supporting to boost the production of the textile and\nleather products in Armenia. Proximity to Europe in comparison with\nmanufacturers in East Asia creates opportunity to strengthen Armenia's\nposition as contract manufacturing destination for European brands. Foreign\ncompanies that put orders to Armenian companies are mainly famous European\nbrands, particularly, from Italy (La Perla, SARTIS, VERSACE etc.) and Germany\n(LEBEK International Fashion, KUBLER Bekleidungswerk). With the Armenia's\nentry into Eurasian Economic Commission, the opportunity to increase its\npresence with textile and leather production raised also in the countries of\nEurasian Economic Commission as no customs duty applies to Armenian products\nin the export markets within the customs union.\n\nAccording to the study \"Regional and International Trade of Armenia\", authors\ninvestigated the trade potential of Armenia for different product groups by\nemploying a gravity model of trade approach. The study explored Armenia's\ntrade flows to 139 countries for the period of 2003 to 2007. According to the\nresults of the paper, the authors concluded that \"Armenia has exceeded its\nexport potential almost with all the CIS countries\". In addition, the authors\nconcluded that the most perspective product groups of Armenian export tend to\nbe \"Industrial products\", \"Food and beverages\" and \"Consumer goods\". On the\nother hand, the paper \"The effects of exchange rate volatility on exports:\nevidence from Armenia\" analyzes the effect of Armenian floating exchange rate\nregime and exchange rate volatility on Armenian exports to Russia. According\nto the paper exchange rate volatility has long-run and short-run negative\neffects on exports. Moreover, authors stated that high exchange rate risk\nresulted in decreasing exports to Russia.\n\nAccording to most recent (2019 Jan-Feb compared to 2018 Jan-Feb) ArmStat\ncalculations, biggest growth in export quantities was measured towards\nTurkmenistan by 23.6 times (from $37K to $912K), Estonia by 15 times (from\n$8.4K to $136.5K) and Canada by 11.5 times (from $623K to $7.8 mln).\nMeanwhile, exports to Russia, Germany, USA and UAE dropped.",
    "openai_summarised_points": [
      "• Armenia's exports are categorized into several sectors with specific monetary values and percentages: minerals valued at 692 million USD (32.3%), food at 531 million USD (24.8%), textiles at 130.6 million USD (6.1%), precious metals and related products at 289.6 million USD (13.5%), non-precious metals and related products at 177.5 million USD (8.3%), and other exports totaling 321.8 million USD (15.0%).",
      "• Major export destinations include Bulgaria (12.8%), Germany (5.9%), Netherlands (4%), other EU countries (5.5%), Switzerland (12%), United States (3.1%), Russia (24.1%), other CIS countries (1.7%), Georgia (6.9%), China (5.5%), Iran (3.8%), Iraq (5.4%), UAE (4.6%), and other countries (4.7%).",
      "• According to the Armenian National Statistical Committee, in 2018, Armenia's total exports reached approximately $2.412 billion, reflecting a 7.8% increase compared to the previous year.",
      "• After a significant growth of nearly 93% in 2022, the International Monetary Fund (IMF) forecasts that Armenia's exports of goods and services will increase by 22% in 2023 and by 8% in 2024.",
      "• The structure of Armenia's exports changed notably in 2018, with a decline in traditional mining sector exports and an increase in textiles, agriculture, and precious metals.",
      "• Armenia's geographical location and low electricity costs serve as competitive advantages, enhancing its capacity to produce textile and leather products.",
      "• Proximity to Europe, relative to East Asian manufacturers, offers Armenia opportunities to strengthen its role as a contract manufacturing hub for European brands, including notable companies from Italy (La Perla, SARTIS, VERSACE) and Germany (LEBEK International Fashion, KUBLER Bekleidungswerk).",
      "• Armenia's accession to the Eurasian Economic Commission has increased prospects for expanding textile and leather exports within the Eurasian Customs Union, benefiting from the absence of customs duties on Armenian products in member countries.",
      "• A study titled \"Regional and International Trade of Armenia\" employed a gravity model to analyze Armenia's trade potential with 139 countries from 2003 to 2007, concluding that Armenia exceeded its export potential with nearly all CIS countries.",
      "• The same study identified \"Industrial products,\" \"Food and beverages,\" and \"Consumer goods\" as the most promising product groups for Armenian exports.",
      "• The study \"The effects of exchange rate volatility on exports: evidence from Armenia\" found that exchange rate volatility under Armenia's floating exchange rate regime negatively impacts exports to Russia in both the short and long term, with high exchange rate risk reducing exports.",
      "• Recent data from ArmStat (January-February 2019 compared to January-February 2018) shows the largest growth in export quantities to Turkmenistan (23.6 times increase from $37K to $912K), Estonia (15 times increase from $8.4K to $136.5K), and Canada (11.5 times increase from $623K to $7.8 million).",
      "• Conversely, exports to Russia, Germany, the USA, and UAE experienced declines during the same period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:15.615939",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3399,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.6",
    "section_name": "Imports",
    "text": "In 2017 Armenia imported $3.96B, making it the 133rd largest importer in the\nworld. During the last five years the imports of Armenia have decreased at an\nannualized rate of -1.2%, from $3.82B in 2012 to $3.96B in 2017. The most\nrecent imports are led by Petroleum Gas which represent 8.21% of the total\nimports of Armenia, followed by Refined Petroleum, which account for 5.46%.\nArmenia's main imports are oil, natural gas, cereals, rubber manufactures,\ncork and wood, and electrical machinery. Armenia's main imports partners are\nRussia, China, Ukraine, Iran, Germany, Italy, Turkey, France and Japan.\n\nThe European Union (28.7% of total exports), Russia (26.9%), Switzerland\n(14.1%), and Iraq (14.1%) are Armenia's largest export partners (6.3 percent\n). The Russian Federation is the most important import partner (26.2%),\nfollowed by the EU (22.6%), China (13.8%), and Iran (13.8%). (5.6 percent ).\nAfter the 2008 Russian-Georgian conflict, which briefly halted the nation's\nhydrocarbon supply and exposed the country's energy vulnerabilities, the\ncountry has been looking for other energy sources. Tensions with its\nneighbors, notably Azerbaijan and Turkey, continue to exist, affecting\ncommerce. Armenia's ties to Russia, as well as its membership in the Eurasian\nEconomic Union, constrain the country's potential to integrate further with\nthe EU.\n\nImports in 2017 amounted to $4.183 billion, up 27.8% from 2016.\n\nIn 2018 the country's structural trade imbalance was predicted to be 15.7\npercent of GDP (World Bank). According to World Trade Organization data,\nArmenia exported commodities worth US$2.4 billion in 2018, up 7% from the\nprevious year, and imported goods worth US$4.9 billion, up 18%. In terms of\nservices, the country exported US$2 billion in 2018 and imported US$2.1\nbillion.\n\nThe global economic crisis has had less impact on imports because the sector\nis more diversified than exports. In the first nine months of 2010, imports\ngrew about 19 percent, just about equal to the decline of the same sector in\n2009.",
    "openai_summarised_points": [
      "• In 2017, Armenia imported goods valued at $3.96 billion, ranking as the 133rd largest importer globally.",
      "• Over the past five years (2012–2017), Armenia's imports decreased at an annualized rate of -1.2%, from $3.82 billion in 2012 to $3.96 billion in 2017.",
      "• The most recent import data indicates Petroleum Gas as the leading import, accounting for 8.21% of Armenia's total imports.",
      "• Refined Petroleum is the second-largest import, representing 5.46% of total imports.",
      "• Armenia's primary imports include oil, natural gas, cereals, rubber manufactures, cork and wood, and electrical machinery.",
      "• The main import partners of Armenia are Russia, China, Ukraine, Iran, Germany, Italy, Turkey, France, and Japan.",
      "• Armenia's largest export partners are the European Union (28.7% of total exports), Russia (26.9%), Switzerland (14.1%), and Iraq (14.1%), with the EU's share constituting 6.3% of exports.",
      "• Russia is Armenia's most significant import partner, accounting for 26.2% of imports.",
      "• Other key import partners include the EU (22.6%), China (13.8%), and Iran (13.8%), with Iran's share at 5.6%.",
      "• Following the 2008 Russian-Georgian conflict, which temporarily halted Armenia's hydrocarbon supply and exposed energy vulnerabilities, Armenia has sought alternative energy sources.",
      "• Ongoing tensions with neighboring countries, notably Azerbaijan and Turkey, continue to impact Armenia's commerce and economic relations.",
      "• Armenia's close ties with Russia and its membership in the Eurasian Economic Union limit its potential for further integration with the European Union.",
      "• In 2017, Armenia's imports increased by 27.8% from 2016, reaching $4.183 billion.",
      "• In 2018, Armenia's structural trade imbalance was projected to be 15.7% of GDP, according to the World Bank.",
      "• According to World Trade Organization data, Armenia exported goods worth US$2.4 billion in 2018, a 7% increase from the previous year, and imported goods valued at US$4.9 billion, an 18% increase.",
      "• In services, Armenia exported US$2 billion and imported US$2.1 billion in 2018.",
      "• The global economic crisis had a comparatively limited impact on Armenia's imports due to the sector's diversification relative to exports.",
      "• During the first nine months of 2010, Armenia's imports grew approximately 19%, offsetting the decline observed in 2009."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:26.373647",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2035,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.7",
    "section_name": "Deficit",
    "text": "According to the National Statistical Service foreign trade deficit amounted\nto US$1.94 billion in 2017.\n\nThe current account deficit represented 2.4 percent of GDP in 2017 and\nincreased up to 8.1 percent of GDP during the first three quarters of 2018.\nThis was a result of about 8 percent increase in goods export and 21 percent\nincrease on goods import in nominal terms year on year in 2018.\n\nArmenia's foreign trade turnover increased by 11.6 percent in January–May\n2021, compared to an 11.2 percent decline a year earlier, owing to a reversal\nof the y-o-y dynamics of exports and imports from 8.1 to 12.8 percent decline\nto 20.8-6.7 percent growth, according to preliminary data from the RA\nStatistical Committee. As a consequence, Armenia's foreign trade turnover\nreached 1.5 trillion drams ($2.9 billion), with exports totaling 567.4 billion\ndrams ($1.1 billion) and imports being 931.8 billion drams ($1.8 billion),\nresulting in a 364.4 billion drams ($695 million) international trade deficit.\nForeign trade turnover climbed by 3.9 percent in May 2021,resulting to a 7.9%\nincrease in exports and a minimal 1.5 percent increase in imports. As a\nconsequence, Armenia's international trade deficit in May 2021 was 83.4\nbillion drams ($160 million), decreasing 7.4% from the same month in 2020. (by\n21.1 percent ). Foreign trade turnover increased by 13% year over year in May\n2020, due to a 30.7 percent increase in exports and a moderate 4.3 percent\nincrease in imports.",
    "openai_summarised_points": [
      "• According to the National Statistical Service, Armenia's foreign trade deficit amounted to US$1.94 billion in 2017.",
      "• The current account deficit in Armenia represented 2.4 percent of GDP in 2017.",
      "• During the first three quarters of 2018, the current account deficit increased to 8.1 percent of GDP.",
      "• The rise in the deficit during this period was driven by approximately an 8 percent increase in goods exports and a 21 percent increase in goods imports in nominal terms year-on-year in 2018.",
      "• Armenia's foreign trade turnover increased by 11.6 percent in January–May 2021, compared to an 11.2 percent decline in the same period of the previous year.",
      "• The change in trade dynamics was due to a reversal of the year-over-year trends of exports and imports, shifting from an 8.1 percent decline to a 12.8 percent growth in exports, and from a 20.8 percent decline to a 6.7 percent growth in imports, according to preliminary data from the RA Statistical Committee.",
      "• In 2021, Armenia's foreign trade turnover reached 1.5 trillion drams ($2.9 billion).",
      "• The total value of exports in 2021 was 567.4 billion drams ($1.1 billion), while imports totaled 931.8 billion drams ($1.8 billion).",
      "• The resulting international trade deficit in 2021 was 364.4 billion drams ($695 million).",
      "• Foreign trade turnover increased by 3.9 percent in May 2021.",
      "• In May 2021, exports increased by 7.9 percent, and imports increased by a minimal 1.5 percent, leading to a trade deficit of 83.4 billion drams ($160 million).",
      "• The May 2021 trade deficit decreased by 7.4 percent compared to the same month in 2020, which experienced a 21.1 percent decline.",
      "• In May 2020, Armenia's foreign trade turnover increased by 13 percent year-over-year, driven by a 30.7 percent increase in exports and a moderate 4.3 percent increase in imports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:32.620669",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1476,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.8",
    "section_name": "European Union",
    "text": "In 2022 Armenia's bilateral trade with the EU topped $2.3 billion, making the\nEU one of Armenia's biggest and most important economic partners.\n\nEU-Armenia trade increased by 15% in 2018 reaching a total value of €1.1\nbillion.\n\nIn 2017 EU countries accounted for 24.3 percent of Armenia's foreign trade.\nWhereby exports to EU countries grew by 32,2% to $633 million.\n\nIn 2010 EU countries accounted for 32.1 percent of Armenia's foreign trade.\nGermany is Armenia's largest trading partner among EU member states,\naccounting for 7.2 percent of trade; this is due largely to mining exports.\nArmenian exports to EU countries have skyrocketed by 65.9 percent, making up\nmore than half of all 2010 January to September exports. Imports from EU\ncountries increased by 17.1 percent, constituting 22.5 percent of all imports.\n\nDuring January–February 2007, Armenia's trade with the European Union totaled\n$200 million. During the first 11 months of 2006, the European Union remained\nArmenia's largest trading partner, accounting for 34.4 percent of its $2.85\nbillion commercial exchange during the 11-month period.",
    "openai_summarised_points": [
      "• In 2022, Armenia's bilateral trade with the European Union (EU) exceeded $2.3 billion, establishing the EU as one of Armenia's most significant and key economic partners.",
      "• EU-Armenia trade volume increased by 15% in 2018, reaching a total value of €1.1 billion.",
      "• In 2017, EU countries accounted for 24.3% of Armenia's total foreign trade, with exports to EU countries growing by 32.2% to a value of $633 million.",
      "• In 2010, EU countries represented 32.1% of Armenia's foreign trade, indicating a substantial share in Armenia's international commerce.",
      "• Armenia's exports to EU countries experienced a sharp increase of 65.9% in 2010, comprising more than half of all Armenian exports from January to September of that year.",
      "• Imports from EU countries into Armenia increased by 17.1% in 2010, making up 22.5% of Armenia's total imports.",
      "• Germany is Armenia's largest trading partner within the EU, accounting for 7.2% of Armenia's total trade, primarily due to exports in the mining sector.",
      "• During the first nine months of 2010, Armenian exports to the EU surged, constituting more than half of the total exports for that period.",
      "• During January–February 2007, Armenia's trade with the EU totaled approximately $200 million.",
      "• In the first 11 months of 2006, the EU remained Armenia's largest trading partner, representing 34.4% of Armenia's total commercial exchange of $2.85 billion during that period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:39.442295",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1106,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.9",
    "section_name": "Russia and former Soviet republics",
    "text": "On 14 October 2024, Armenia notified its ratification of the Commonwealth of\nIndependent States Agreement on Free Trade in Services, Establishment,\nOperations and Investment, which entered into force on 13 November 2024 for\nArmenia.\n\nIn the first quarter of 2019, share of Russia in foreign trade turnover fell\nto 11% from 29% from the previous year.\n\nIn 2017, CIS countries accounted for 30 percent of Armenia's foreign trade.\nExports to CIS countries rose by 40,3% to $579,5 million.\n\nBilateral trade with Russia stood at more than $700 million for the first nine\nmonths of 2010 – on track to rebound to $1 billion mark first reached in 2008\nprior to the global economic crisis.\n\nDuring January–February 2007, Armenia's trade with Russia and other former\nSoviet republics was $205.6 million (double the amount from the same period\nthe previous year), making them the country's number one trading partner.\nDuring the first 11 months of 2006, the volume of Armenia's trade with Russia\nwas $376.8 million or 13.2 percent of the total commercial exchange.",
    "openai_summarised_points": [
      "• On 14 October 2024, Armenia officially notified its ratification of the Commonwealth of Independent States Agreement on Free Trade in Services, Establishment, Operations, and Investment, which subsequently entered into force on 13 November 2024 for Armenia.",
      "• In the first quarter of 2019, Armenia's share of Russia in its foreign trade turnover decreased significantly from 29% in the previous year to 11%.",
      "• In 2017, CIS countries collectively accounted for 30% of Armenia's total foreign trade, highlighting their importance in Armenia's trade relations.",
      "• Armenia's exports to CIS countries increased by 40.3%, reaching a total value of $579.5 million in 2017.",
      "• Bilateral trade between Armenia and Russia exceeded $700 million during the first nine months of 2010, indicating a recovery trend toward the $1 billion level first achieved in 2008 before the global economic crisis.",
      "• During January–February 2007, Armenia's trade with Russia and other former Soviet republics was valued at $205.6 million, which was double the amount recorded during the same period in the previous year, establishing these countries as Armenia's primary trading partners.",
      "• In the first 11 months of 2006, Armenia's trade volume with Russia was $376.8 million, representing 13.2% of Armenia's total commercial exchange for that period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:43.593621",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1053,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.10",
    "section_name": "China",
    "text": "In 2017 trade with China grew by 33.3 percent.\n\nAs of early 2011 trade with China is dominated by imports of Chinese goods and\naccounts for about 10 percent of Armenia's foreign trade. The volume of\nChinese-Armenian trade soared by 55 percent to $390 million in\nJanuary–November 2010. Armenian exports to China, though still modest in\nabsolute terms, nearly doubled in that period.",
    "openai_summarised_points": [
      "• In 2017, Armenia's trade with China increased by 33.3 percent, indicating significant growth in economic exchanges between the two countries during that year.",
      "• As of early 2011, trade with China was primarily characterized by imports of Chinese goods into Armenia, reflecting a trade imbalance favoring Chinese products.",
      "• Chinese imports accounted for approximately 10 percent of Armenia's total foreign trade as of early 2011, highlighting China's substantial role in Armenia's international trade portfolio.",
      "• The volume of Chinese-Armenian trade experienced a substantial increase of 55 percent in the period from January to November 2010, reaching a total value of $390 million.",
      "• During the same period (January–November 2010), Armenian exports to China, although relatively small in absolute terms, nearly doubled compared to previous figures, indicating a growing trade relationship."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:46.436269",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 381,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.11",
    "section_name": "Iran",
    "text": "Armenia's trade with Iran grew significantly from 2015 and 2020. Because\nArmenia's land borders to the east and west have been closed by the\ngovernments of Turkey and Azerbaijan, domestic firms have looked to Iran as a\nkey economic partner. In 2020, trade between the countries exceeded $300\nmillion. The number of Iranian tourists has risen in recent years, with an\nestimated 80,000 Iranian tourists in 2010. In January 2021, Iran's finance\nminister Farhad Dejpasand said that trade between the two countries could\nreach $1 billion annually as Iran looks to become a regional economic force.",
    "openai_summarised_points": [
      "• Armenia's trade with Iran experienced significant growth between 2015 and 2020.",
      "• Due to the closure of Armenia's land borders to the east and west by Turkey and Azerbaijan, respectively, Armenian domestic firms increasingly relied on Iran as a key economic partner.",
      "• In 2020, the total trade volume between Armenia and Iran exceeded $300 million.",
      "• The number of Iranian tourists visiting Armenia has increased in recent years, with an estimated 80,000 Iranian tourists recorded in 2010.",
      "• In January 2021, Iran's finance minister Farhad Dejpasand stated that trade between Iran and Armenia could potentially reach $1 billion annually.",
      "• Iran aims to establish itself as a regional economic force, which is reflected in its aspirations to significantly expand bilateral trade with Armenia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:50.405199",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 592,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.12",
    "section_name": "United States",
    "text": "From January to September 2010, bilateral trade with the United States was\nabout $150 million, on track for about a 30 percent increase over 2009. An\nincrease in Armenia's exports to the US in 2009 and 2010 has been due to\nshipments of aluminum foil.\n\nDuring the first 11 months of 2006 US–Armenian trade totaled $152.6 million.",
    "openai_summarised_points": [
      "• From January to September 2010, bilateral trade between Armenia and the United States was approximately $150 million.",
      "• The trade volume in this period was on track to achieve about a 30 percent increase compared to the year 2009.",
      "• The increase in Armenia's exports to the United States during 2009 and 2010 was primarily attributed to shipments of aluminum foil.",
      "• During the first 11 months of 2006, the total trade between the United States and Armenia amounted to $152.6 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:53.295636",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 328,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.13",
    "section_name": "Georgia",
    "text": "The volume of Georgian–Armenian trade remains modest in both relative and\nabsolute terms. According to official Armenian statistics it rose by 11\npercent to $91.6 million in January–November 2010. The figure was equivalent\nto just over 2 percent of Armenia's overall foreign trade.",
    "openai_summarised_points": [
      "• The volume of Georgian–Armenian trade remains modest both in relative and absolute terms.",
      "• According to official Armenian statistics, the trade volume increased by 11 percent during January–November 2010.",
      "• The total trade volume between Georgia and Armenia in this period was $91.6 million.",
      "• The $91.6 million figure represented just over 2 percent of Armenia's overall foreign trade for the same period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:55.141297",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 281,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.14.14",
    "section_name": "Turkey",
    "text": "In 2019 the volume of bilateral trade with Turkey was about $255 million, with\ntrade taking place across Georgian territory. This figure is not expected to\nincrease significantly so long as the land border between the Armenia and\nTurkey remains closed.",
    "openai_summarised_points": [
      "• In 2019, the total volume of bilateral trade between Armenia and Turkey was approximately $255 million.",
      "• The trade activities between Armenia and Turkey occurred across Georgian territory, indicating that goods were transported through Georgia rather than directly between the two countries.",
      "• The volume of trade is not anticipated to increase significantly in the foreseeable future.",
      "• The primary reason for the limited growth in trade is the continued closure of the land border between Armenia and Turkey.",
      "• The land border between Armenia and Turkey remains closed, serving as a major obstacle to expanding economic and trade relations between the two nations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:22:57.495379",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 252,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15",
    "section_name": "Foreign direct investments",
    "text": "Between 40%-53% of all foreign direct investments in Armenia between 1988 and\n2022 originate from Russia. Foreign direct investment (FDI) into Armenia\ndecreased by US$2.7 million in December 2020, compared to a reduction of\nUS$10.3 million the previous quarter.\n\nArmenia foreign direct investment: USD mn Net Flows data is available from\nMarch 1993 through December 2020, and is updated quarterly.\n\nThe statistics ranged from a high of US$425.9 million in December 2008 to a\nlow of –67.6 USD mn in December 2014.\n\nArmenia's current account surplus is US$51.7 million in December 2020,\naccording to the most recent statistics.\n\n-In June 2021, Armenian Direct Investment Abroad increased by 12.8 million dollars.\n\n-In June 2021, it boosted its Foreign Portfolio Investment by $14.6 million.\n\n-In December 2020 the country's nominal GDP was reported to be 3.8 billion dollars.",
    "openai_summarised_points": [
      "• Between 1988 and 2022, approximately 40% to 53% of all foreign direct investments (FDI) in Armenia originated from Russia.",
      "• FDI into Armenia decreased by US$2.7 million in December 2020, compared to a reduction of US$10.3 million in the previous quarter.",
      "• Data on Armenia's foreign direct investment net flows is available from March 1993 through December 2020, with updates on a quarterly basis.",
      "• The highest recorded FDI net flow was US$425.9 million in December 2008.",
      "• The lowest recorded FDI net flow was –US$67.6 million in December 2014.",
      "• Armenia's current account surplus was US$51.7 million in December 2020, according to the most recent statistics.",
      "• In June 2021, Armenian direct investment abroad increased by US$12.8 million.",
      "• Also in June 2021, Armenia boosted its foreign portfolio investment by US$14.6 million.",
      "• In December 2020, Armenia's nominal gross domestic product (GDP) was reported to be US$3.8 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:00.874047",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 873,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15.1",
    "section_name": "Yearly FDI figures",
    "text": "| This graph was using the legacy Graph extension, which is no longer\nsupported. It needs to be converted to the new Chart extension.\n---|---\n\nDespite robust economic growth foreign direct investment (FDI) in Armenia\nremain low as of 2018.\n\nin January–September 2019 the net flow of direct foreign investment in the\nreal sector of the Armenian economy stood at about $267 million.\n\nFDI inward flows as percentage of gross fixed capital formation  Year  | Armenia  | Georgia  | South-East Europe and the CIS  | World\n---|---|---|---|---\n2005–2007 p.a. average  | 20.0%  |  |  |\n2016  | 17.6%  | 35.9%  | 15.8%  | 10.2%\n2017  | 11.4%  | 42.3%  | 9.6%  | 7.5%\n2018  | 9.5%  | 25.3%  | 6.4%  | 6.0%\n\nJersey was the main source of FDI in 2017. Moreover, combined net FDI from all\nother sources was negative, indicating capital outflow. The tax haven Jersey\nis home to an Anglo-American company, Lydian International, which is currently\nbuilding a controversial massive gold mine in the southeastern Vayots Dzor\nProvince. Lydian has pledged to invest a total of $370 million in the Amulsar\ngold mine.\n\nCountry (with FDI net flow exceeding 1 billion AMD)  | Net flow of FDI\nin 2017, in billion AMD  | Net flow of FDI in 9 months of 2018, in billion AMD\n---|---|---\nJersey  | 108  | 20.6\nGermany  | 14  | 14.3\nNetherlands  | 3  | 0.4\nArgentina  | 3  | 1.72\nUK  | 2  | 1.31\nHungary  | 2  | 0\nIreland  | 0.6  | 0.6\nCyprus  | −1  | 1.76\nFrance  | −6  | −2\nLebanon  | −7  | 3.4\nRussia  | −12  | 11.7\nLuxembourg  | −22  | −1\nItaly  | −0.68  | −0.5\nUSA  | 0.5  | 1.78\n\nNegative values indicate investments of Armenian corporations to foreign\ncountry exceeding investments from that country in Armenia.",
    "openai_summarised_points": [
      "• Despite experiencing robust economic growth, Armenia's foreign direct investment (FDI) remained relatively low as of 2018.",
      "• In the first nine months of 2019 (January–September), the net flow of FDI into Armenia's real sector was approximately $267 million.",
      "• The FDI inward flows as a percentage of gross fixed capital formation for Armenia and comparative regions are as follows:",
      "• In 2017, Jersey was the primary source of FDI into Armenia, with a net inflow of 108 billion AMD.",
      "• During the first nine months of 2018, Jersey's net FDI inflow was approximately 20.6 billion AMD.",
      "• Other significant sources with net FDI flows exceeding 1 billion AMD in 2017 included:",
      "• Negative net FDI flows indicate that Armenian corporations invested more abroad than foreign entities invested in Armenia; for example, Luxembourg and France showed negative net flows in 2017.",
      "• The data highlights Jersey's dominant role as an FDI source, notably through Lydian International, an Anglo-American company involved in constructing the controversial Amulsar gold mine in Vayots Dzor Province, with a pledged investment of $370 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:13.568403",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1687,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15.2",
    "section_name": "Stock FDI",
    "text": "FDI stock to GDP ratio grew continuously during 2014–2016 and reached 44.1% in\n2016, surpassing average figures for Commonwealth of Independent States\ncountries, transition economies and the world.\n\nStock inward FDI  Year  | Million dollars  | Share of GDP\n---|---|---\n2015  | 4 338  |\n2016  | 4 635  | 43.9%\n2017  | 4 752  | 41.2%\n2018  | 5 511  | 44.4%\n\nBy the end of 2017 stock net FDI (for the period 1988–2017) reached 1824\nbillion AMD, while gross flow of FDI for the same period reached 3869 billion\nAMD.\n\nCountries with largest positions  | Stock net FDI\nby end of 2017, in billion AMD\n---|---\nRussia  | 773\nJersey  | 159\nArgentina  | 112\nFrance  | 83\nLebanon  | 77\nCyprus  | 77\nUSA  | 73\nGermany  | 73\nUK  | 53\nNetherlands  | 50\nU.A.E.  | 29\nLuxembourg  | 24\nItaly  | 14\nSwitzerland  | 10\n\nAs of February 2019, the European Investment Bank (EIB) has invested about 380\nmillion euros in the various projects implemented in Armenia.",
    "openai_summarised_points": [
      "• The stock Foreign Direct Investment (FDI) to Gross Domestic Product (GDP) ratio in Armenia experienced continuous growth from 2014 through 2016, reaching 44.1% in 2016, thereby surpassing the average figures for the Commonwealth of Independent States (CIS), transition economies, and the global average.",
      "• In 2015, Armenia's inward FDI stock was valued at approximately 4,338 million USD.",
      "• In 2016, the inward FDI stock increased to approximately 4,635 million USD, representing 43.9% of Armenia’s GDP.",
      "• In 2017, the inward FDI stock further grew to approximately 4,752 million USD, which was 41.2% of GDP.",
      "• By 2018, the inward FDI stock reached approximately 5,511 million USD, accounting for 44.4% of GDP.",
      "• By the end of 2017, Armenia’s total stock of net FDI (covering the period from 1988 to 2017) was approximately 1,824 billion AMD.",
      "• During the same period, the gross flow of FDI into Armenia was approximately 3,869 billion AMD.",
      "• The countries with the largest positions in Armenia’s FDI stock as of the end of 2017, measured in billion AMD, included:",
      "• Russia: 773 billion AMD",
      "• Jersey: 159 billion AMD",
      "• Argentina: 112 billion AMD",
      "• France: 83 billion AMD",
      "• Lebanon: 77 billion AMD",
      "• Cyprus: 77 billion AMD",
      "• USA: 73 billion AMD",
      "• Germany: 73 billion AMD",
      "• UK: 53 billion AMD",
      "• Netherlands: 50 billion AMD",
      "• U.A.E.: 29 billion AMD",
      "• Luxembourg: 24 billion AMD",
      "• Italy: 14 billion AMD",
      "• Switzerland: 10 billion AMD",
      "• As of February 2019, the European Investment Bank (EIB) had invested approximately 380 million euros in various projects implemented in Armenia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:18.582697",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 939,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15.3",
    "section_name": "FDI in founding capital of financial institutions",
    "text": "During the sector consolidation process in 2014–2017 the share of foreign\ncapital in the authorized capital of the Armenian commercial banks decreased\nfrom 74,6% to 61,8%.\n\nNet FDI in founding capital of financial institutions accumulated by end of\nSeptember 2017 is presented in pie chart below.\n\n* Cyprus: 98.06 bill. AMD (20.6%)\n* UK: 82.42 bill. AMD (17.3%)\n* Russia: 58.28 bill. AMD (12.2%)\n* USA: 54.18 bill. AMD (11.4%)\n* Lebanon: 38.32 bill. AMD (8.0%)\n* Iran: 33.71 bill. AMD (7.1%)\n* Luxembourg: 21.86 bill. AMD (4.6%)\n* EBRD: 21.2 bill. AMD (4.4%)\n* Netherlands: 16.57 bill. AMD (3.5%)\n* France: 16.22 bill. AMD (3.4%)\n* Virgin Islands: 14.54 bill. AMD (3.1%)\n* Lichtenstein: 10.78 bill. AMD (2.3%)\n* Switzerland: 6.73 bill. AMD (1.4%)\n* Latvia: 2.06 bill. AMD (0.4%)\n* Canada: 0.6 bill. AMD (0.1%)\n* Germany: 0.55 bill. AMD (0.1%)\n* Austria: 0.46 bill. AMD (0.1%)",
    "openai_summarised_points": [
      "• During the sector consolidation process in Armenia from 2014 to 2017, the share of foreign capital in the authorized capital of Armenian commercial banks decreased significantly from 74.6% to 61.8%.",
      "• The net foreign direct investment (FDI) in the founding capital of financial institutions in Armenia accumulated by the end of September 2017 is detailed in a pie chart, illustrating the distribution by country and organization.",
      "• Cyprus was the leading source of FDI, contributing 98.06 billion AMD, which accounted for 20.6% of the total FDI in founding capital of financial institutions.",
      "• The United Kingdom contributed 82.42 billion AMD, representing 17.3% of the total FDI.",
      "• Russia's FDI amounted to 58.28 billion AMD, making up 12.2% of the total.",
      "• The United States contributed 54.18 billion AMD, accounting for 11.4%.",
      "• Lebanon contributed 38.32 billion AMD, representing 8.0%.",
      "• Iran's FDI was 33.71 billion AMD, or 7.1%.",
      "• Luxembourg contributed 21.86 billion AMD, which is 4.6%.",
      "• The European Bank for Reconstruction and Development (EBRD) invested 21.2 billion AMD, constituting 4.4%.",
      "• The Netherlands contributed 16.57 billion AMD, or 3.5%.",
      "• France's FDI was 16.22 billion AMD, representing 3.4%.",
      "• The Virgin Islands contributed 14.54 billion AMD, accounting for 3.1%.",
      "• Liechtenstein's FDI amounted to 10.78 billion AMD, or 2.3%.",
      "• Switzerland contributed 6.73 billion AMD, representing 1.4%.",
      "• Latvia's FDI was 2.06 billion AMD, or 0.4%.",
      "• Canada contributed 0.6 billion AMD, which is 0.1%.",
      "• Germany's FDI was 0.55 billion AMD, also 0.1%.",
      "• Austria contributed 0.46 billion AMD, accounting for 0.1%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:23.752644",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 875,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15.4",
    "section_name": "United States",
    "text": "The Armenian government receives foreign aid from the government of the United\nStates through the United States Agency for International Development and the\nMillennium Challenge Corporation.\n\nOn March 27, 2006, the Millennium Challenge Corporation signed a five-year,\n$235.65 million compact with the Government of Armenia. The single stated goal\nof the \"Armenian Compact\" is \"the reduction of rural poverty through a\nsustainable increase in the economic performance of the agricultural sector.\"\nThe compact includes a $67 million to rehabilitate up to 943 kilometers of\nrural roads, more than a third of Armenia's proposed \"Lifeline road network\".\nThe Compact also includes a $146 million project to increase the productivity\nof approximately 250,000 farm households through improved water supply, higher\nyields, higher-value crops, and a more competitive agricultural sector.\n\nIn 2010 the volume of US assistance to Armenia remained near 2009 levels;\nhowever, longer-term decline continued. The original Millennium Challenge\nAccount commitment for $235 million had been reduced to about $175 million due\nto Armenia's poor governance record. Thus, the MCC would not complete road\nconstruction. Instead, the irrigated agriculture project was headed for\ncompletion with apparently no prospects for extension beyond 2011.\n\nOn May 8, 2019, conditioned with the political events in Armenia since April\n2018, United States Agency for International Development signed an extension\nof US–Armenia bilateral agreement in the area of governance and public\nadministration, which would add additional US$8.5 million to the agreement. By\nsigning another document on the same day, USAID increased the aid by\nadditional US$7.5 million in support for more competitive and diversified\nprivate sector in Armenia. The financial allocations will be directed to the\nfinancing of the USAID-funded project in infrastructures, agriculture,\ntourism․ After the signing of the new bilateral agreements, the total amount\nof the U.S. grants to Armenia amounted to around US$81 million.",
    "openai_summarised_points": [
      "• The Armenian government receives foreign aid from the United States through two primary agencies: the United States Agency for International Development (USAID) and the Millennium Challenge Corporation (MCC).",
      "• On March 27, 2006, the Millennium Challenge Corporation signed a five-year compact with the Government of Armenia valued at $235.65 million, known as the \"Armenian Compact.\"",
      "• The main goal of the Armenian Compact is to reduce rural poverty by sustainably increasing the economic performance of Armenia's agricultural sector.",
      "• The compact includes a $67 million component dedicated to rehabilitating up to 943 kilometers of rural roads, which constitutes more than one-third of Armenia's proposed \"Lifeline road network.\"",
      "• An additional $146 million from the compact is allocated to enhance the productivity of approximately 250,000 farm households through improved water supply, increased crop yields, higher-value crops, and fostering a more competitive agricultural sector.",
      "• In 2010, U.S. assistance to Armenia remained close to the levels of 2009; however, there was a continued long-term decline in aid amounts.",
      "• The original Millennium Challenge Account commitment of $235 million was reduced to approximately $175 million due to Armenia's poor governance record, which affected the scope of projects.",
      "• As a result, MCC was unable to complete the road construction projects; instead, the irrigated agriculture project was scheduled for completion with no clear prospects for extension beyond 2011.",
      "• On May 8, 2019, amidst political developments in Armenia since April 2018, USAID signed an extension of the US–Armenia bilateral agreement focusing on governance and public administration, adding an additional $8.5 million in aid.",
      "• On the same day, USAID also increased aid by $7.5 million to support the development of a more competitive and diversified private sector in Armenia.",
      "• The funds from these agreements are targeted toward projects in infrastructure, agriculture, and tourism sectors.",
      "• Following the signing of these new bilateral agreements, the total U.S. grants to Armenia amounted to approximately $81 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:29.725634",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2056,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "6.15.5",
    "section_name": "European Union",
    "text": "According to the agreement signed in 2020 EU will provide Armenia with 65\nmillion euros for implementation of three programs in such areas as energy\nefficiency, environment and community development and formation of tools for\nimplementation of the Comprehensive and Enhanced Partnership Agreement.\n\nWith curtailment of the MCC funding, the European Union may replace the US as\nArmenia's chief source of foreign aid for the first time since independence.\nFrom 2011 to 2013 the EU is expected to advance at least €157.3 million ($208\nmillion) in aid to Armenia.",
    "openai_summarised_points": [
      "• According to the agreement signed in 2020, the European Union (EU) will provide Armenia with 65 million euros to support the implementation of three key programs.",
      "• The three programs focus on areas including energy efficiency, environmental protection, and community development.",
      "• The aid also aims to facilitate the formation of tools necessary for the implementation of the Comprehensive and Enhanced Partnership Agreement between the EU and Armenia.",
      "• Following the curtailment of Millennium Challenge Corporation (MCC) funding, the European Union has the potential to replace the United States as Armenia's primary source of foreign aid for the first time since Armenia's independence.",
      "• Between 2011 and 2013, the EU is expected to provide at least €157.3 million (equivalent to approximately $208 million) in aid to Armenia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:33.205402",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 559,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Domestic business environment",
    "text": "Headquarters of the Armenian State Revenue Committee (housing both the\nArmenian Customs Service and the Armenian Tax Service).\n\nSince transition of power to new leadership in 2018 Armenian government works\non improving domestic business environment. Numerous formerly privileged\nbusiness are now required to pay taxes and officially register all workers.\nMainly due to this there were 9.7% more payroll employees registered in\nJanuary 2019 as compared to January 2018.\n\nIn April 2019 Armenian parliament approved reforms of management of joint\nstock companies effectively enacting a blocking minority shareholders stake of\n25% to cope with shareholder oppression.\n\nFollowing the advice of economic advisers who cautioned Armenia's leadership\nagainst the consolidation of economic power in the hands of a few, in January\n2001 the government of Armenia established the State Commission for the\nProtection of Economic Competition. Its members cannot be dismissed by the\ngovernment.",
    "openai_summarised_points": [
      "• The headquarters of the Armenian State Revenue Committee houses both the Armenian Customs Service and the Armenian Tax Service.",
      "• Since the transfer of power to new leadership in 2018, the Armenian government has been actively working to improve the domestic business environment.",
      "• As part of these reforms, many formerly privileged businesses are now required to pay taxes and officially register all workers.",
      "• Due to these reforms, there was a 9.7% increase in the number of payroll employees registered in January 2019 compared to January 2018.",
      "• In April 2019, the Armenian parliament approved reforms concerning the management of joint stock companies, specifically enacting a provision for a blocking minority shareholder stake of 25% to address shareholder oppression.",
      "• Following advice from economic advisers who warned against the concentration of economic power in the hands of a few, the Armenian government established the State Commission for the Protection of Economic Competition in January 2001.",
      "• The members of the State Commission for the Protection of Economic Competition cannot be dismissed by the government, ensuring its independence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:37.507238",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 978,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Foreign trade facilitation",
    "text": "In June 2011 Armenia adopted a Law on Free Economic Zones (FEZ), and developed\nseveral key regulations at the end of 2011 to attract foreign investments into\nFEZs: exemptions from VAT (value added tax), profit tax, customs duties, and\nproperty tax.\n\nThe “Alliance” FEZ was opened in August 2013, and currently has nine\nbusinesses taking advantage of its facilities. The focus of “Alliance” FEZ is\non high-tech industries which include information and communication\ntechnologies, electronics, pharmaceuticals and biotechnology, architecture and\nengineering, industrial design and alternative energy. In 2014, the government\nexpanded operations in the Alliance FEZ to include industrial production as\nlong as there is no similar production already occurring in Armenia.\n\nIn 2015 another “Meridian” FEZ, focused on jewelry production, watch-making,\nand diamond-cutting opened in Yerevan, with six businesses operating in it.\nThe investment programs for these companies must still be approved by\ngovernment.\n\nThe Armenian government approved the program to construct the Meghri free\neconomic zone at the border with Iran, which is expected to open in 2017.",
    "openai_summarised_points": [
      "• In June 2011, Armenia adopted a Law on Free Economic Zones (FEZ), establishing a legal framework to promote economic development through specialized zones.",
      "• At the end of 2011, Armenia developed several key regulations aimed at attracting foreign investments into FEZs, including exemptions from value-added tax (VAT), profit tax, customs duties, and property tax.",
      "• The “Alliance” Free Economic Zone was officially opened in August 2013 and currently hosts nine businesses utilizing its facilities.",
      "• The primary focus of the “Alliance” FEZ is on high-tech industries, specifically including information and communication technologies, electronics, pharmaceuticals and biotechnology, architecture and engineering, industrial design, and alternative energy.",
      "• In 2014, the Armenian government expanded the operational scope of the Alliance FEZ to include industrial production, provided that such production does not already exist within Armenia.",
      "• The “Meridian” FEZ, dedicated to jewelry production, watch-making, and diamond-cutting, was inaugurated in Yerevan in 2015, with six businesses operating within it.",
      "• Investment programs for companies within the Meridian FEZ require approval from the Armenian government before proceeding.",
      "• The Armenian government approved a development program for constructing the Meghri free economic zone at the Armenia-Iran border, with an expected opening date in 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:42.250100",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1152,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "7.1.1",
    "section_name": "Monopolies",
    "text": "Major monopolies in Armenia include:\n\n1. Natural gas import and distribution, held by Gazprom Armenia, formerly named ArmRosGazprom (controlled by Russian monopoly Gazprom)\n2. Armenia's railway, South Caucasus Railway, owned by Russian Railways (RZD)\n3. Electricity transmission and distribution (see Electricity sector in Armenia)\n4. Newspaper distribution, held by Haymamul\n\nFormer notable monopolies in Armenia :\n\n1. Wireless (mobile) telephony, held by Armentel until 2004\n2. Internet access, held by Armentel until September 2006\n3. Fixed-line telephony, held by Armentel until August 2007\n\nAssumed (unofficial) monopolies until 2018 velvet revolution:\n\n1. Oil import and distribution (claimed by Armenian opposition parties to belonging to a handful of government-linked individuals, one of which – \"Mika Limited\" – is owned by Mikhail Baghdasarian, while the other – \"Flash\" – is owned by Barsegh Beglarian, a \"prominent representative of the Karabakh clan\")\n2. Aviation kerosene (supplying to Zvartnots airport), held by Mika Limited\n3. Various basic foodstuffs such as rice, sugar, wheat, cooking oil and butter (the Salex Group enjoys a de facto monopoly on imports of wheat, sugar, flour, butter and cooking oil. Its owner was a parliament deputy Samvel Aleksanian (a.k.a. \"Lfik Samo\") and close to the country's leadership.).\n\nAccording to one analyst, Armenia's economic system in 2008 was\nanticompetitive due to the structure of the economy being a type of \"monopoly\nor oligopoly\". \"The result is the prices with us do not drop even if they do\non international market, or they do quite belated and not to the size of the\ninternational market.\"\n\nAccording to the 2008 estimate of a former prime minister, Hrant Bagratyan, 55\npercent of Armenia's GDP is controlled by 44 families.\n\nIn early 2008 the State Commission for the Protection of Economic Competition\nnamed 60 companies having \"dominant positions\" in Armenia.\n\nIn October 2009, when visiting Yerevan, the World Bank’s managing director,\nNgozi Okonjo-Iweala, warned that Armenia will not reach a higher level of\ndevelopment unless its leadership changes the \"oligopolistic\" structure of the\nnational economy, bolsters the rule of law and shows \"zero tolerance\" towards\ncorruption. \"I think you can only go so far with this economic model,\" Ngozi\nOkonjo-Iweala told a news conference in Yerevan. \"Armenia is a lower middle-\nincome country. If it wants to become a high-income or upper middle-income\ncountry, it can not do so with this kind of economic structure. That is\nclear.\" She also called for a sweeping reform of tax and customs\nadministration, the creation of a \"strong and independent judicial system\" as\nwell as a tough fight against government corruption. The warning was echoed by\nthe International Monetary Fund.",
    "openai_summarised_points": [
      "• Major monopolies in Armenia include the import and distribution of natural gas, controlled by Gazprom Armenia, formerly known as ArmRosGazprom, which is part of the Russian monopoly Gazprom.",
      "• The country's railway system, South Caucasus Railway, is owned by Russian Railways (RZD).",
      "• Electricity transmission and distribution are monopolized within the electricity sector in Armenia.",
      "• Newspaper distribution is dominated by Haymamul.",
      "• Former notable monopolies included wireless (mobile) telephony, which was held by Armentel until 2004.",
      "• Internet access was also monopolized by Armentel until September 2006.",
      "• Fixed-line telephony services were controlled by Armentel until August 2007.",
      "• Until the 2018 Velvet Revolution, Armenia had assumed (unofficial) monopolies in several sectors:",
      "• Oil import and distribution, claimed by Armenian opposition parties to be owned by a small group of government-linked individuals; one such entity, \"Mika Limited,\" is owned by Mikhail Baghdasarian, and another, \"Flash,\" is owned by Barsegh Beglarian, a prominent representative of the Karabakh clan.",
      "• Aviation kerosene supply to Zvartnots airport, held by Mika Limited.",
      "• Basic foodstuffs such as rice, sugar, wheat, cooking oil, and butter, with the Salex Group enjoying a de facto monopoly on imports of wheat, sugar, flour, butter, and cooking oil; its owner, Samvel Aleksanian (also known as \"Lfik Samo\"), was a parliament deputy and close to the country's leadership.",
      "• An analyst in 2008 characterized Armenia’s economic system as anticompetitive, describing it as a form of \"monopoly or oligopoly,\" resulting in prices that do not decrease in line with international market trends or do so belatedly and insufficiently.",
      "• In 2008, former Prime Minister Hrant Bagratyan estimated that 55 percent of Armenia’s GDP was controlled by 44 families.",
      "• In early 2008, the State Commission for the Protection of Economic Competition identified 60 companies holding \"dominant positions\" in Armenia.",
      "• In October 2009, Ngozi Okonjo-Iweala, the World Bank’s managing director, visited Yerevan and warned that Armenia’s economic development would be hindered unless the country’s leadership reforms the \"oligopolistic\" structure, strengthens the rule of law, and adopts a \"zero tolerance\" approach to corruption.",
      "• Okonjo-Iweala emphasized that Armenia, being a lower middle-income country, cannot progress to high-income or upper middle-income status under its current economic model.",
      "• She called for comprehensive reforms including overhauling tax and customs administration, establishing a \"strong and independent judicial system,\" and intensifying efforts against government corruption.",
      "• The International Monetary Fund echoed these warnings, highlighting the need for structural reforms to improve Armenia’s economic prospects."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:23:48.276780",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2794,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "7.1.2",
    "section_name": "Takeover of Armenian industrial property by the Russian state and Russian",
    "text": "companies\n\nSince 2000 the Russian state has acquired several key assets in the energy\nsector and Soviet-era industrial plants. Property-for-debt or equity-for-debt\nswaps (acquiring ownership by simply writing off the Armenian government's\ndebts to Russia) are usually the method of acquiring assets. The failure of\nmarket reforms, clan-based economics, and official corruption in Armenia have\nallowed the success of this process.\n\nIn August 2002 the Armenian government sold an 80 percent stake in the\nArmenian Electricity Network (AEN) to Midland Resources, a British offshore-\nregistered firm which is said to have close Russian connections.\n\nIn September 2002 the Armenian government handed over Armenia's largest cement\nfactory to the Russian ITERA gas exporter in payment for its $10 million debt\nfor past gas deliveries.\n\nOn November 5, 2002, Armenia transferred control of 5 state enterprises to\nRussia in an assets-for-debts transaction which settled $100 million of\nArmenian state debts to Russia. The document was signed for Russia by Prime\nMinister Mikhail Kasyanov and Industry Minister Ilya Klebanov, while Prime\nMinister Andranik Markarian and National Security Council Secretary Serge\nSarkisian signed for Armenia. The five enterprises which passed to 100 percent\nRussian state ownership are:\n\n* Armenia's largest thermal gas-burning power plant, which is in the town of Hrazdan\n* \"Mars\" — electronics and robotics plant in Yerevan, a Soviet-era flagship for both civilian and military production\n* three research-and-production enterprises — for mathematical machines, for the study of materials, and for automated control equipment — these being Soviet-era military-industrial plants\n\nIn January 2003 the Armenian government and United Company RUSAL signed an\ninvestment cooperation agreement, under which United Company RUSAL (which\nalready owned a 76% stake) acquired the Armenian government's remaining 26%\nshare of RUSAL ARMENAL aluminum foil mill, giving RUSAL 100% ownership of\nRUSAL ARMENAL.\n\nOn November 1, 2006, the Armenian government handed de facto control of the\nIran-Armenia gas pipeline to Russian company Gazprom and increased Gazprom's\nstake in the Russian-Armenian company ArmRosGazprom from 45% to 58% by\napproving an additional issue of shares worth $119 million. This left the\nArmenian government with a 32% stake in ArmRosGazprom. The transaction will\nalso help finance ArmRosGazprom's acquisition of the Hrazdan electricity\ngenerating plant’s fifth power bloc (Hrazdan-5), the leading unit in the\ncountry.\n\nIn October 2008 the Russian bank Gazprombank, the banking arm of Gazprom,\nacquired 100 percent of Armenian bank Areximbank after previously buying 80\npercent of said bank in November 2007 and 94.15 percent in July of the same\nyear.\n\nIn December 2017 government transferred natural gas distribution networks in\ncities Meghri and Agarak to Gazprom Armenia for cost-free use. Construction of\nthese was funded by foreign aid and costed about 1.3 billion AMD."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "7.1.3",
    "section_name": "Non-transparent deals",
    "text": "Critics of the Robert Kocharyan government (in office until 2008) say that the\nArmenian administration never considered alternative ways of settling the\nRussian debts. According to economist Eduard Aghajanov, Armenia could have\nrepaid them with low-interest loans from other, presumably Western sources, or\nwith some of its hard currency reserves which then totaled about $450 million.\nFurthermore, Aghajanov points to the Armenian government's failure to\neliminate widespread corruption and mismanagement in the energy sector –\nabuses that cost Armenia at least $50 million in losses each year, according\nto one estimate.\n\nPolitical observers say that Armenia's economic cooperation with Russia has\nbeen one of the least transparent areas of the Armenian government's work. The\ndebt arrangements have been personally negotiated by (then) Defense Minister\n(and later President) Serge Sarkisian, initially Kocharyan's closest political\nassociate. Other top government officials, including former Prime Minister\nAndranik Markarian, had little say on the issue. Furthermore, all of the\ncontroversial agreements have been announced after Sarkisian's frequent trips\nto Moscow, without prior public discussion.\n\nWhile Armenia is not the only ex-Soviet state that has incurred multi-million-\ndollar debts to Russia over the past decades, it is the only state to have so\nfar given up such a large share of its economic infrastructure to Russia. For\nexample, pro-Western Ukraine and Georgia (both of which owe Russia more than\nArmenia) have managed to reschedule repayment of their debts."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Transportation routes and energy lines",
    "text": "Zvartnots International Airport main concourse"
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Internal",
    "text": "Since early 2008, Armenia's entire rail network is managed by the Russian\nstate railway under brand South Caucasus Railways."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.1.1",
    "section_name": "Metros",
    "text": "Yerevan Metro was launched in 1981. It serves 11 active stations."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.1.2",
    "section_name": "Buses",
    "text": "Yerevan Central Bus Station, also known as Kilikia Bus Station, is Yerevan's\nprimary bus terminal, linking buses to both domestic and foreign destinations."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.1.3",
    "section_name": "Roadways",
    "text": "Total length: 8,140 km,\nWorld ranking: 112 (7,700 km paved including 1561 km of expressways)."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Through Georgia",
    "text": "Russian natural gas reaches Armenia via a pipeline through Georgia.\n\nThe only operational rail link into Armenia is from Georgia. During Soviet\ntimes, Armenia's rail network connected to Russia's via Georgia through\nAbkhazia along the Black Sea. However, the rail link between Abkhazia and\nother Georgian regions has been closed for a number of years, forcing Armenia\nto receive rail cars laden with cargo only through the relatively expensive\nrail-ferry services operating between Georgian and other Black Sea ports.\n\nThe Georgian Black Sea ports of Batumi and Poti process more than 90 percent\nof freight shipped to and from landlocked Armenia. The Georgian railway, which\nruns through the town of Gori in central Georgia, is the main transport link\nbetween Armenia and the aforementioned Georgian seaports. Fuel, wheat and\nother basic commodities are transported to Armenia by rail.\n\nArmenia's main rail and road border-crossing with Georgia (at 41°13′41.97″N\n44°50′9.12″E﻿ / ﻿41.2283250°N 44.8358667°E﻿ / 41.2283250; 44.8358667) is at\nthe Debed river near the Armenian town of Bagratashen and the Georgian town of\nSadakhlo.\n\nThe Upper Lars border crossing (at Darial Gorge) between Georgia and Russia\nacross the Caucasus Mountains serves as Armenia's sole overland route to the\nformer Soviet Union and Europe. It was controversially shut down by the\nRussian authorities in June 2006, at the height of a Russian-Georgian spy\nscandal. Upper Lars is the only land border crossing that does not go through\nGeorgia's Russian-backed breakaway regions of South Ossetia and Abkhazia. The\nother two roads linking Georgia and Russia run through South Ossetia and\nAbkhazia, effectively barring them to international traffic."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "Through Iran",
    "text": "A new gas pipeline to Iran has been completed, and a road to Iran through the\nsouthern city of Meghri allows trade with that country. An oil pipeline to\npump Iranian oil products is also in the planning stages.\n\nAs of October 2008 the Armenian government was considering implementing an\nambitious project to build a railway to Iran. The 400 kilometer railway would\npass through Armenia's mountainous southern province of Syunik, which borders\nIran. Economic analysts say that the project would cost at least $1 billion\n(equivalent to about 40 percent of Armenia's 2008 state budget). As of 2010,\nthe project has been continuously delayed, with the rail link estimated to\ncost as much as $4 billion and stretch 313 km (194 mi). In June 2010,\nTransport Minister Manuk Vartanian revealed that Yerevan is seeking as much as\n$1 billion in loans from China to finance the railway's construction."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.4",
    "section_name": "Through Turkey and Azerbaijan",
    "text": "The border closures by Turkey and Azerbaijan have severed Armenia's rail link\nbetween Gyumri and Kars; the rail link with Iran through the Azeri exclave of\nNakhichevan; and a natural gas and oil pipeline with Azerbaijan. Also closed\nare road links with Turkey and Azerbaijan. Despite the economic blockade of\nTurkey on Armenia, every day dozens of Turkish trucks laden with goods enter\nArmenia through Georgia.\n\nIn 2010 it was confirmed that Turkey will keep the border closed for the\nforeseeable future after the Turkey-Armenia normalization process collapsed."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.5",
    "section_name": "Labor occupation",
    "text": "According to the 2018 HDI statistical update, Armenia had the highest\npercentage of employment in services (49.7%) and lowest share in agriculture\n(34.4%) among the South Caucasus countries."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.6",
    "section_name": "Unionization",
    "text": "In 2018, about 30% of wage workers were organized in unions. At the same time,\nrate of unionization was dropping at average rate of 1% since 1993."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.7",
    "section_name": "Monthly wages",
    "text": "According to preliminary figures from Statistical Committee of Armenia monthly\nwages averaged to 172 thousand AMD in February 2019.\n\nIt is estimated that wages rise at 0.8% for each additional year of experience\nand \"the ability to solve problems and learn new skills yields a wage premium\nof nearly 20 percent\"."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.8",
    "section_name": "Unemployment",
    "text": "It was reported that in 2020 there was a drop in the unemployment rate in\nArmenia from 16.99% in 2019 to 16.63% in 2020. The Statistical Committee of\nArmenia reported that in 2020, the unemployment rate has been volatile\nreaching to 19.8% during the first quarter of the year and then decreasing to\n16% during the fourth quarter. According to the latest reports on population\nof Armenia, in December 2020 the population consisted of 2.96million people\nand the average monthly earning during February 2021 was US$366.05.\n\nAccording to prime minister Nikol Pashinyan in January 2019, 562,043 payroll\njobs were recorded, against of 511,902 in January 2018, an increase of\n9.7%.Statistical Committee of Armenia publication based on data retrieved from\nemployers and national income service cites 560,586 payroll positions in\nJanuary 2019, an increase of 9.9% against previous year. This however does not\nmatch survey data published by the Statistical Committee of Armenia, according\nto which in 4th quarter of 2018 there were 870.1 thousand persons employed\nagainst 896.7 thousand employed persons in 4th quarter of 2017. The mismatch\nwas highlighted by former PM Hrant Bagratyan. For the whole year of 2018\nStatistical Committee of Armenia survey counted 915.5 thousand employed\npersons, an increase of 1.4% against previous year. In the same period\nunemployment rate of economically active population dropped from 20.8% to\n20.4%.\n\nThe unemployment rate, which stood at 38.4% in 2001, has fallen significantly\nover the past two and a half decades. It fluctuated between 16% and 19% from\n2008 to 2020, before dropping to 15.5% in 2021, 13.5% in 2022 and 12.6% in\n2023 due to the strong economic growth of recent years. At the same time, an\nestimated 60% of workers were employed in the informal economy in 2019. World\nBank research also reveals that employment rate fell in years 2000–2015 in\nmiddle- and low-skill occupations, while it grew high-skill occupations.\n\nSee also Statistical Committee of Armenia publication (in English) \"Labour\nmarket in the Republic of Armenia, 2018\"."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.9",
    "section_name": "Female unemployment in Armenia",
    "text": "Worldwide, women's unemployment rate is 6%, higher than men's by about 0.8\npoints. According to International Labor Organization, Armenia has the highest\nwomen's unemployment rate in post-Soviet countries, equaling 17.3% for women\nabove 25. If we compare this rate with those of the neighboring countries\n(Latvia: 8.6%, Georgia: 7.7%, Azerbaijan: 4.8%), we can see that it is very\nhigh. In 2017, the National Statistical Service of Armenia stated that more\nthan 60% of officially registered unemployed people in Armenia are women. One\nof the lecturers of Yerevan State University, Ani Kojoyan, mentioned that even\nthough there is no issue in the legislation that becomes a reason for women's\nunemployment; however, there are some issues that are not mentioned in the\nlegislation. Some of those issues are the fact that potential employers\nconsider women's marital status, how many children they have, or if they are\nplanning to get pregnant any time soon. Moreover, some women are not allowed\nto work by their husbands after graduating from higher educational\ninstitutions. She mentions that the most crucial problem affecting this\nphenomenon is the fact women do not stand up for their rights. It is also\nmentioned that according to various sources, there is an inequality in men's\nand women's monthly wages. In all the sectors, the average monthly salary of\nmen is much higher than women even with the same years of education. It is\nstated that eliminating the discrimination between two genders would\npositively impact the country's economy. Ani Kojoyan mentions that this is a\ncrucial problem for the economy except for being a women's rights violation.\nThus, the Armenian government should take care that unemployed women can find\njobs and become taxpayers."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "8.10",
    "section_name": "Migrant workers",
    "text": "Since gaining independence in 1991, hundreds of thousands of Armenia's\nresidents have gone abroad, mainly to Russia, in search of work. Unemployment\nhas been the major cause of this massive labor emigration. OSCE experts\nestimate that between 116,000 and 147,000 people left Armenia for economic\nreasons between 2002 and 2004, with two-thirds of them returning home by\nFebruary 2005. According to estimates by the National Statistical Survey, the\nrate of labor emigration was twice as higher in 2001 and 2002.\n\nAccording to an OSCE survey, a typical Armenian migrant worker is a married\nman aged between 41 and 50 years who \"began looking for work abroad at the age\nof 32–33.\"\n\nFor Armenians another feature of migration was an increase in a variety of\nthreats. The journey itself was extremely dangerous. To pay their way, may\ndeparting migrants took out loans failed, the whole family's future was put at\na risk. As a consequence, the practice of delaying or refusing to pay part or\nall of a migrant workers wages has become common. The risks were also\nheightened by many emigrants failure. This type of migration inherited almost\nall of the negative characteristics that described pre-transition labor\nmigration.\n\nDuring the workshop, participants addressed the increasing importance of\nmigration as a growth factor, as well as the significance of SDG Target 10.7\non anticipated and well-managed migration policies for Armenia."
  },
  {
    "chapter_name": "Economy of Armenia",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Natural environment protection",
    "text": "Environmental Project Implementation Unit implements projects related to\nNatural environment protection.\n\nArmenia's greenhouse gas emissions decreased 62% from 1990 to 2013, averaging\n−1.3% annually.\n\nArmenia is working on addressing its environmental problems. Ministry of\nEnvironment has introduced a pollution fee system by which taxes are levied on\nair and water emissions and solid waste disposal."
  }
]