[
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Morocco** is a market economy, governed by the law of supply\nand demand. Since 1993, in line with many Western world changes, Morocco has\nfollowed a policy of privatisation. Morocco has become a major player in\nAfrican economic affairs, and is the 6th largest African economy by GDP (PPP).\nThe World Economic Forum placed Morocco as the most competitive economy in\nNorth Africa, in its African Competitiveness Report 2014–2015.\n\nThe economic system of the country demonstrated resilience to the climate,\ncommodity, and pandemic shocks of the early 2020s. As of 2022, Morocco had the\neighth-highest GDP in the Arab world, despite not being a significant oil-\nproducing country. Since the early-1980s, the Moroccan government has pursued\nan economic programme toward accelerating economic growth with the support of\nthe International Monetary Fund, the World Bank, and the Paris Club of\ncreditors. From 2018, the country's currency, the Moroccan dirham, is fully\nconvertible for current account transactions; reforms of the financial sector\nhave been implemented; and state enterprises are being privatised.\n\nThe services sector accounts for just over half of the GDP. The industry\nsector– consisting of mining, construction and manufacturing – is an\nadditional quarter. The sectors that recorded the highest growth are the\ntourism, telecommunications, and textile sectors. Morocco, however, still\ndepends to an inordinate degree on agriculture, which accounts for around 14%\nof GDP but employs 40–45% of the Moroccan population. With a semi-arid\nclimate, it is difficult to assure good rainfall and Morocco's GDP varies\ndepending on the weather. Fiscal prudence has allowed for consolidation, with\nboth the budget deficit and debt falling as a percentage of GDP. The major\nresources of the Moroccan economy are agriculture, phosphate minerals, and\ntourism. Sales of fish and seafood are important as well. Industry and mining\ncontribute about one-third of the annual GDP. Morocco is the world's third-\nlargest producer of phosphates (after the United States and China), and the\nprice fluctuations of phosphates on the international market greatly influence\nMorocco's economy. Tourism and workers' remittances have played a critical\nrole since independence. The production of textiles and clothing is part of a\ngrowing manufacturing sector that accounted for approximately 34% of total\nexports in 2002, employing 40% of the industrial workforce. The government\nwishes to increase 3 exports from $1.27 billion in 2001 to $3.29 billion in\n2010 and has raised this to 5.7 billion in 2019.\n\nThe high cost of imports, especially of petroleum imports, is a major problem.\nMorocco suffers both from structural unemployment and a large external debt.\nThe youth unemployment rate was 27.2% in 2021. About 80% of jobs are informal\nand the income gaps are very high. In 2022, Morocco ranked 120th out of 191\ncountries in the world on the Human Development Index (HDI), behind Algeria\n(93rd) and Tunisia (101st). It is the most unequal country in North Africa\naccording to the NGO Oxfam.",
    "openai_summarised_points": [
      "• The economy of Morocco operates as a market economy governed by the law of supply and demand, with a policy of privatisation initiated since 1993, aligning with changes in many Western countries.",
      "• Morocco is a significant player in African economic affairs, ranking as the 6th largest African economy by GDP based on purchasing power parity (PPP).",
      "• According to the World Economic Forum’s African Competitiveness Report 2014–2015, Morocco was identified as the most competitive economy in North Africa.",
      "• The Moroccan economy demonstrated resilience to climate, commodity, and pandemic shocks during the early 2020s.",
      "• As of 2022, Morocco held the eighth-highest GDP in the Arab world despite lacking significant oil production.",
      "• Since the early 1980s, Morocco has pursued an economic growth acceleration program supported by the International Monetary Fund (IMF), the World Bank, and the Paris Club of creditors.",
      "• From 2018, the Moroccan dirham became fully convertible for current account transactions; concurrently, financial sector reforms were implemented and state enterprises underwent privatisation.",
      "• The services sector constitutes just over 50% of Morocco’s GDP, while the industry sector—which includes mining, construction, and manufacturing—accounts for approximately 25%.",
      "• The tourism, telecommunications, and textile sectors have recorded the highest growth rates within the Moroccan economy.",
      "• Agriculture remains a critical sector, contributing around 14% of GDP but employing 40–45% of the population, despite Morocco’s semi-arid climate and variable rainfall impacting GDP stability.",
      "• Fiscal prudence has enabled consolidation efforts, resulting in reductions in both the budget deficit and national debt as percentages of GDP.",
      "• Morocco’s major economic resources include agriculture, phosphate minerals, and tourism, with fish and seafood sales also playing an important role.",
      "• Industry and mining collectively contribute about one-third of Morocco’s annual GDP.",
      "• Morocco is the world’s third-largest producer of phosphates, following the United States and China; international phosphate price fluctuations significantly affect the Moroccan economy.",
      "• Since independence, tourism and workers’ remittances have been critical to Morocco’s economic development.",
      "• The textile and clothing manufacturing sector is growing, accounting for approximately 34% of total exports in 2002 and employing 40% of the industrial workforce.",
      "• The Moroccan government aimed to increase exports from $1.27 billion in 2001 to $3.29 billion by 2010, achieving an increase to $5.7 billion by 2019.",
      "• A major economic challenge is the high cost of imports, particularly petroleum imports.",
      "• Morocco faces structural unemployment and a large external debt burden.",
      "• The youth unemployment rate was 27.2% in 2021.",
      "• Approximately 80% of jobs in Morocco are informal, and income inequality is very high.",
      "• In 2022, Morocco ranked 120th out of 191 countries on the Human Development Index (HDI), trailing Algeria (93rd) and Tunisia (101st).",
      "• According to the NGO Oxfam, Morocco is the most unequal country in North Africa."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:45:43.217230",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3090,
      "bullet_points_count": 23
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( December 2024)_\n---|---\n\nMorocco is a fairly stable economy with continuous growth over the past half-\ncentury. Current GDP per capita grew 47% in the 1960s, reaching a peak growth\nof 274% in the 1970s. However, this proved unsustainable and growth scaled\nback sharply to just 8.2% in the 1980s and 8.9% in the 1990s.\n\nIn recent years, Morocco's economy has demonstrated resilience amid global\nchallenges. Real GDP growth rebounded to 3.4% in 2023, driven by a resurgence\nin tourism, robust manufacturing exports (notably in the automotive and\naeronautics sectors), and increased private consumption. However, agricultural\noutput contracted due to drought conditions, which lead to a projected\nslowdown in overall growth to 3.2% in 2024. The IMF anticipated growth to\naccelerate to approximately 3.9% in 2025, supported by infrastructure projects\nand structural reforms.\n\nYear | Gross Domestic Product | US Dollar Exchange | Inflation Index\n(2000=100) | Per Capita Income\n(as % of USA)\n---|---|---|---|---\n1980 | 74,090 | 3.93 Dirhams | 33 | 8.87\n1985 | 129,507 | 10.06 Dirhams | 53 | 3.72\n1990 | 212,819 | 8.24 Dirhams | 67 | 5.17\n1995 | 281,702 | 8.54 Dirhams | 91 | 5.03\n\nInflation significantly declined from a peak of 10.1% in early 2023 to an\naverage of 1.5% in 2024, primarily due to falling food prices. In response,\nthe central bank, Bank Al-Maghrib, reduced the key interest rate from 3.0% to\n2.75% in June 2024. The IMF projected inflation to stabilize around 2% in the\nmedium term.\n\nFiscal consolidation efforts led to a reduction in the budget deficit, which\ndecreased from 5.2% of GDP in 2022 to 4.7% in 2023. Public debt was projected\nto gradually decline from 69.5% of GDP in 2023 to 68.2% by 2025. The current\naccount deficit narrowed significantly to 0.6% of GDP in 2023, the lowest\nlevel since 2007, bolstered by strong tourism revenues, manufacturing exports,\nand remittances. Foreign direct investment also increased, particularly in\nsectors like green hydrogen and electric vehicle battery components.\n\nThe unemployment rate remained elevated at 13% in 2023, with higher rates\namong youth (35.8%), women (18.3%), and recent graduates (19.7%).\nAdditionally, the poverty rate increased from 3% in 2021 to 4.9% in 2022. In\nterms of GDP per capita, Morocco reached $3,672 in 2023, a 6.69% increase from\n2022. The IMF estimated GDP per capita (PPP) at $10,615 in 2024.\n\nThe following table shows the main economic indicators in 1980–2022. Inflation\nbelow 5% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---\n1980  | 31.4  | 1,615  | 23.8  | 3.8%  | 9.4%  | n/a  | n/a\n1981  | 33.4  | 1,675  | 19.3  | -2.8%  | 12.5%  | n/a  | n/a\n1982  | 38.9  | 1,900  | 19.5  | 9.6%  | 10.5%  | n/a  | n/a\n1983  | 40.2  | 1,918  | 17.6  | -0.6%  | 6.2%  | n/a  | n/a\n1984  | 43.4  | 2,025  | 16.1  | 4.3%  | 12.4%  | n/a  | n/a\n1985  | 47.6  | 2,169  | 16.3  | 6.3%  | 7.7%  | n/a  | n/a\n1986  | 52.6  | 2,342  | 21.5  | 8.3%  | 8.7%  | n/a  | n/a\n1987  | 52.5  | 2,284  | 23.7  | -2.5%  | 2.7%  | n/a  | n/a\n1988  | 60.1  | 2,553  | 28.1  | 10.4%  | 2.4%  | n/a  | n/a\n1989  | 63.9  | 2,654  | 28.9  | 2.4%  | 3.1%  | n/a  | n/a\n1990  | 69.0  | 2,853  | 32.7  | 4.0%  | 6.0%  | n/a  | 70.5%\n1991  | 76.4  | 3,103  | 34.9  | 7.2%  | 9.0%  | n/a  | 59.1%\n1992  | 76.5  | 3,050  | 36.5  | -2.1%  | 5.7%  | n/a  | 67.0%\n1993  | 77.8  | 3,044  | 34.3  | -0.7%  | 5.2%  | n/a  | 74.7%\n1994  | 87.8  | 3,379  | 38.5  | 10.6%  | 5.1%  | n/a  | 69.3%\n1995  | 84.8  | 3,215  | 42.2  | -5.4%  | 6.1%  | 16.0%  | 72.2%\n1996  | 97.1  | 3,628  | 46.7  | 12.4%  | 3.0%  | 15.5%  | 65.3%\n1997  | 97.2  | 3,582  | 42.4  | -1.6%  | 1.0%  | 15.4%  | 68.0%\n1998  | 105.4  | 3,831  | 45.2  | 7.2%  | 2.7%  | 15.2%  | 64.5%\n1999  | 108.1  | 3,873  | 45.1  | 1.1%  | 0.7%  | 14.0%  | 63.4%\n2000  | 112.6  | 3,982  | 42.1  | 1.9%  | 1.9%  | 13.5%  | 64.9%\n2001  | 123.6  | 4,311  | 42.7  | 7.3%  | 0.6%  | 12.3%  | 60.4%\n2002  | 129.4  | 4,455  | 45.7  | 3.1%  | 2.8%  | 11.4%  | 59.4%\n2003  | 139.9  | 4,751  | 56.3  | 6.0%  | 1.2%  | 11.5%  | 56.9%\n2004  | 150.5  | 5,046  | 64.5  | 4.8%  | 1.5%  | 10.7%  | 54.4%\n2005  | 160.3  | 5,306  | 67.5  | 3.3%  | 1.0%  | 11.0%  | 54.8%\n2006  | 177.8  | 5,809  | 74.3  | 7.6%  | 3.3%  | 10.9%  | 50.6%\n2007  | 189.1  | 6,099  | 85.5  | 3.5%  | 2.0%  | 9.7%  | 47.1%\n2008  | 204.1  | 6,502  | 100.1  | 5.9%  | 3.9%  | 9.5%  | 42.0%\n2009  | 214.1  | 6,736  | 100.5  | 4.2%  | 2.2%  | 9.0%  | 42.6%\n2010  | 225.0  | 6,990  | 100.9  | 3.8%  | 0.9%  | 9.2%  | 45.3%\n2011  | 241.7  | 7,418  | 109.7  | 5.2%  | 0.8%  | 8.5%  | 48.6%\n2012  | 244.7  | 7,421  | 106.3  | 3.0%  | 0.8%  | 8.7%  | 52.3%\n2013  | 256.1  | 7,674  | 115.6  | 4.5%  | 1.6%  | 9.5%  | 57.1%\n2014  | 259.3  | 7,679  | 119.1  | 2.7%  | 0.4%  | 9.7%  | 58.6%\n2015  | 269.8  | 7,905  | 110.4  | 4.3%  | 1.4%  | 9.2%  | 58.4%\n2016  | 274.0  | 7,944  | 111.6  | 0.5%  | 1.5%  | 9.0%  | 60.1%\n2017  | 285.6  | 8,193  | 118.5  | 5.1%  | 0.7%  | 10.6%  | 60.3%\n2018  | 301.3  | 8,556  | 127.3  | 3.1%  | 1.6%  | 9.4%  | 60.5%\n2019  | 315.6  | 8,868  | 128.9  | 2.9%  | 0.2%  | 10.2%  | 60.3%\n2020  | 296.4  | 8,245  | 121.4  | -7.2%  | 0.6%  | 12.2%  | 72.2%\n2021  | 333.2  | 9,177  | 141.8  | 7.9%  | 1.4%  | 11.9%  | 68.9%\n2022  | 359.7  | 9,808  | 130.9  | 0.8%  | 6.2%  | 11.1%  | 70.3%",
    "openai_summarised_points": [
      "• Morocco has maintained a fairly stable economy with continuous growth over the past fifty years, with GDP per capita increasing by 47% during the 1960s and peaking at 274% growth in the 1970s, though growth slowed significantly to 8.2% in the 1980s and 8.9% in the 1990s due to unsustainable expansion.",
      "• In recent years, Morocco's economy showed resilience despite global challenges, with real GDP growth rebounding to 3.4% in 2023, driven by a resurgence in tourism, strong manufacturing exports—especially in the automotive and aeronautics sectors—and increased private consumption.",
      "• Agricultural output contracted in 2023 due to drought conditions, leading to a projected slowdown in overall economic growth to 3.2% in 2024; however, the International Monetary Fund (IMF) projected growth to accelerate to approximately 3.9% in 2025, supported by infrastructure projects and structural reforms.",
      "• Key economic indicators from 1980 to 1995 show GDP in millions of US dollars, exchange rates, inflation index (base year 2000=100), and per capita income as a percentage of the USA: for example, in 1980, GDP was $74,090 million, exchange rate was 3.93 Dirhams per USD, inflation index was 33, and per capita income was 8.87% of the USA.",
      "• Inflation in Morocco declined significantly from a peak of 10.1% in early 2023 to an average of 1.5% in 2024, primarily due to falling food prices; in response, Bank Al-Maghrib, the central bank, reduced the key interest rate from 3.0% to 2.75% in June 2024.",
      "• The IMF projected inflation to stabilize around 2% in the medium term, reflecting successful monetary policy adjustments.",
      "• Fiscal consolidation efforts reduced the budget deficit from 5.2% of GDP in 2022 to 4.7% in 2023, while public debt was projected to decline gradually from 69.5% of GDP in 2023 to 68.2% by 2025.",
      "• The current account deficit narrowed significantly to 0.6% of GDP in 2023, the lowest since 2007, supported by strong tourism revenues, manufacturing exports, and remittances.",
      "• Foreign direct investment increased notably in emerging sectors such as green hydrogen and electric vehicle battery components, indicating diversification and modernization of Morocco’s economy.",
      "• Unemployment remained elevated at 13% in 2023, with disproportionately higher rates among youth (35.8%), women (18.3%), and recent graduates (19.7%).",
      "• The poverty rate increased from 3% in 2021 to 4.9% in 2022, signaling socio-economic challenges despite overall growth.",
      "• Morocco’s GDP per capita reached $3,672 in 2023, representing a 6.69% increase from 2022, while the IMF estimated GDP per capita based on purchasing power parity (PPP) at $10,615 in 2024.",
      "• Historical economic data from 1980 to 2022 show fluctuations in GDP (in billion US$ PPP), GDP per capita (in US$ PPP), nominal GDP (in US$), real GDP growth rates, inflation rates, unemployment rates, and government debt as a percentage of GDP, illustrating Morocco’s economic trajectory over four decades.",
      "• For example, in 1980, GDP was $31.4 billion (PPP), GDP per capita was $1,615, nominal GDP was $23.8 billion, real GDP growth was 3.8%, inflation was 9.4%, and government debt data were not available.",
      "• Notable economic downturns include a -2.8% real GDP growth in 1981 and -7.2% in 2020, the latter reflecting the impact of the COVID-19 pandemic.",
      "• Inflation rates varied widely, peaking at 12.5% in 1981 and falling below 5% in many years, with green shading indicating years with inflation below 5%.",
      "• Government debt as a percentage of GDP fluctuated, reaching 70.5% in 1990, decreasing to around 50.6% in 2006, and rising again to 72.2% in 2020 before stabilizing near 70% in recent years.",
      "• Unemployment rates ranged from approximately 9.0% to 16.0% between 1995 and 2022, with a peak of 16.0% in 1995 and a rate of 11.1% in 2022.",
      "• Real GDP growth rates showed periods of strong expansion, such as 12.4% in 1996 and 10.6% in 1994, as well as periods of contraction and stagnation, reflecting economic volatility and external shocks.",
      "• Overall, Morocco’s macroeconomic trends indicate steady long-term growth with episodes of volatility, ongoing structural reforms, and recent improvements in fiscal and monetary policy frameworks aimed at sustaining economic stability and growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:46:00.229647",
      "openai_model": "gpt-4.1-mini",
      "content_length": 5588,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "History",
    "text": "Part of a series on the\n---\nHistory of Morocco\nPrehistory\n\n* Acheulean\n* Mousterian\n* Aterian\n* Iberomaurusian\n* Capsian\n\n\nClassical to Late Antiquity\n(8th century BC – 7th century AD)\n\n* Carthaginian\n* Roman\n* Mauretania\n* Mauretania Tingitana\n* Exarchate of Africa\n\n\nEarly Islamic\n(8th–10th century AD)\n\n* Muslim conquest\n* Umayyad Caliphate\n* Berber Revolt\n* Emirate of Nekor\n* Emirate of Sijilmasa\n* Barghwata confederacy\n* Idrisid dynasty\n\n\nTerritorial fragmentation\n(10th–11th century AD)\n\n* Caliphate of Córdoba\n* Fatimid Caliphate\n* Ifranids\n* Miknasas\n* Maghrawas\n* Arab migrations to the Maghreb\n\n\nEmpire\n(beginning 11th century AD)\n\n* Almoravids\n* Almohads\n* Marinids\n* Wattasids\n* Saadis\n* Alawis\n\nother political entities\n\n* Zawiya Dila'iya\n* Principality of Debdou\n* Republic of Salé\n\n\nDecline\n(beginning 19th century AD)\n\n* Franco-Moroccan War\n* Anglo-Moroccan Treaty of 1856\n* Hispano-Moroccan War\n* Protégé system\n* Treaty of Wad Ras\n* Treaty of Madrid\n* Tangier Crisis\n* Treaty of Algeciras\n* Agadir Crisis\n* Hafidiya\n* Bombardment of Casablanca (1907)\n* French conquest of Morocco\n\n\nProtectorate\n(1912–1956)\n\n* Treaty of Fez\n* French protectorate\n* Spanish protectorate\n* French Conquest\n* Zaian War\n* Rif War\n* Tangier International Zone\n* Emigration of Moroccan Jews\n* Opposition to European control\n* Revolution of the King and the People\n\n\nModern\n(1956–present)\n\n* Ifni War\n* Sand War\n* Moroccanization\n* Coup d'état attempt in 1971 / in 1972\n* Moulay Bouazza plot\n* Years of lead\n* Madrid Accords\n* Green March\n* Western Sahara War\n* 2011–2012 protests\n* Hirak Rif Movement\n* Abraham Accords\n* Western Saharan clashes (2020–present)\n\n\nRelated topics\n\n* Morocco in the\n1970s\n\n* 1980s\n* 1990s\n* 2000s\n* 2010s\n\n_History by topic_\n\n* Jewish\n* Economic\n* Military\n* Postal\n* Imperial cities\n\n\n\n* _Morocco portal_\n*  _History portal_\n\n\n\n* v\n* t\n* e\n\n\n\nOver the years, Morocco implemented a series of development plans, enacted\neconomic reforms, and encountered various challenges that have influenced its\neconomic trajectory. From the 1960s to the present day, the country has sought\nto achieve sustained economic growth, reduce unemployment rates, and improve\nthe living standards of its population.",
    "openai_summarised_points": [
      "• Morocco's economic history is deeply intertwined with its extensive historical timeline, spanning from prehistory through classical antiquity, early Islamic periods, territorial fragmentation, empire eras, decline, protectorate status, and modern developments.",
      "• Prehistoric periods in Morocco include significant cultural phases such as the Acheulean, Mousterian, Aterian, Iberomaurusian, and Capsian, which laid the foundational human activity in the region.",
      "• During classical to late antiquity (8th century BC – 7th century AD), Morocco was influenced by Carthaginian and Roman civilizations, with the territory known as Mauretania, specifically Mauretania Tingitana, and later incorporated into the Exarchate of Africa.",
      "• The early Islamic period (8th–10th century AD) saw the Muslim conquest of Morocco under the Umayyad Caliphate, followed by significant events such as the Berber Revolt and the establishment of various political entities including the Emirate of Nekor, Emirate of Sijilmasa, Barghwata confederacy, and the Idrisid dynasty.",
      "• Between the 10th and 11th centuries AD, Morocco experienced territorial fragmentation influenced by the Caliphate of Córdoba and the Fatimid Caliphate, alongside the presence of the Ifranids, Miknasas, Maghrawas, and Arab migrations to the Maghreb region.",
      "• The beginning of the 11th century AD marked the rise of Moroccan empires, including the Almoravids, Almohads, Marinids, Wattasids, Saadis, and the Alawis, which shaped the political and economic landscape of the country.",
      "• Other notable political entities during the empire period included the Zawiya Dila'iya, Principality of Debdou, and the Republic of Salé, each contributing to Morocco's complex historical fabric.",
      "• From the beginning of the 19th century AD, Morocco entered a period of decline characterized by conflicts such as the Franco-Moroccan War, Hispano-Moroccan War, and diplomatic events like the Anglo-Moroccan Treaty of 1856, Treaty of Wad Ras, Treaty of Madrid, Tangier Crisis, Treaty of Algeciras, and the Agadir Crisis.",
      "• The decline era also involved the Protégé system, the Hafidiya movement, the Bombardment of Casablanca in 1907, and ultimately the French conquest of Morocco.",
      "• Morocco was subjected to protectorate status from 1912 to 1956, formalized by the Treaty of Fez, dividing control between the French protectorate and Spanish protectorate, with significant events including the French Conquest, Zaian War, Rif War, and the establishment of the Tangier International Zone.",
      "• During the protectorate period, there was notable emigration of Moroccan Jews and growing opposition to European control, culminating in the Revolution of the King and the People.",
      "• Since gaining independence in 1956, Morocco has faced various challenges and developments such as the Ifni War, Sand War, Moroccanization policies, coup d'état attempts in 1971 and 1972, the Moulay Bouazza plot, and the Years of Lead.",
      "• Key geopolitical events in the modern era include the Madrid Accords, the Green March, the Western Sahara War, and ongoing Western Saharan clashes from 2020 to the present.",
      "• Social and political movements such as the 2011–2012 protests and the Hirak Rif Movement have influenced Morocco's contemporary socio-economic environment.",
      "• Morocco's recent diplomatic milestones include participation in the Abraham Accords, reflecting its evolving international relations.",
      "• Over the decades, Morocco has implemented multiple development plans and economic reforms aimed at achieving sustained economic growth, reducing unemployment, and improving living standards from the 1960s to the present day.",
      "• The country’s economic trajectory has been shaped by its historical experiences, political changes, and social movements, reflecting a complex interplay between internal dynamics and external influences."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:46:19.670961",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2218,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "1960–1989",
    "text": "Morocco instituted a series of development plans to modernize the economy and\nincrease production during the 1960s. Net investment under the five-year plan\nfor 1960–64 was about $1.3 billion. The plan called for a growth rate of 6.2%,\nbut by 1964 the growth rate had only reached 3%. The main emphasis of the plan\nwas on the development and modernization of the agricultural sector. The five-\nyear development plan for 1968–72 called for increased agriculture and\nirrigation. The development of the tourist industry also figured prominently\nin the plan. The objective was to attain an annual 5% growth rate in GDP; the\nreal growth rate actually exceeded 6%.\n\nInvestment during the 1970s included industry and tourism development. The\nfive-year plan for 1973–77 envisaged a real economic growth of 7.5% annually.\nIndustries singled out for development included chemicals (especially\nphosphoric acid), phosphate production, paper products, and metal fabrication.\nIn 1975, King Hassan II announced a 50% increase in investment targets to\nallow for the effects of inflation. The 1978–80 plan was one of stabilization\nand retrenchment, designed to improve Morocco's balance-of-payments position.\n\nThe ambitious five-year plan for 1981–85, estimated to cost more than $18\nbillion, aimed at achieving a growth rate of 6.5% annually. The plan's\nprincipal priority was to create some 900,000 new jobs and to train managers\nand workers in modern agricultural and industrial techniques. Other major\ngoals were to increase production in agriculture and fisheries to make the\ncountry self-sufficient in food, and to develop energy, industry, and tourism\nto enable Morocco to lessen its dependence on foreign loans. The plan called\nfor significant expansion of irrigated land, for increased public works\nprojects such as hospitals and schools, and for economic decentralization and\nregional development through the construction of 25 new industrial parks\noutside the crowded Casablanca-Kénitra coastal area. Large industrial projects\nincluded phosphoric acid plants, sugar refineries, mines to exploit cobalt,\ncoal, silver, lead, and copper deposits, and oil-shale development.",
    "openai_summarised_points": [
      "• During the 1960s, Morocco implemented a series of development plans aimed at modernizing the economy and increasing production, with net investment under the 1960–64 five-year plan totaling approximately $1.3 billion.",
      "• The 1960–64 plan targeted a 6.2% growth rate in GDP, but by 1964, the actual growth rate had only reached 3%, with a primary focus on developing and modernizing the agricultural sector.",
      "• The 1968–72 five-year development plan emphasized increased agriculture and irrigation, alongside significant development of the tourist industry, aiming for an annual GDP growth rate of 5%, which was surpassed with an actual growth rate exceeding 6%.",
      "• Investment priorities during the 1970s expanded to include industry and tourism development, with the 1973–77 five-year plan projecting a real economic growth rate of 7.5% annually.",
      "• Key industries targeted for development in the 1970s included chemicals (notably phosphoric acid), phosphate production, paper products, and metal fabrication.",
      "• In 1975, King Hassan II announced a 50% increase in investment targets to accommodate inflationary effects, reflecting adjustments in economic planning.",
      "• The 1978–80 plan focused on economic stabilization and retrenchment, specifically designed to improve Morocco’s balance-of-payments position.",
      "• The ambitious 1981–85 five-year plan, with an estimated cost exceeding $18 billion, aimed for an annual growth rate of 6.5% and prioritized the creation of approximately 900,000 new jobs.",
      "• A key component of the 1981–85 plan was the training of managers and workers in modern agricultural and industrial techniques to support economic modernization.",
      "• Other major objectives of the 1981–85 plan included increasing agricultural and fisheries production to achieve food self-sufficiency and developing energy, industry, and tourism sectors to reduce reliance on foreign loans.",
      "• The plan called for significant expansion of irrigated land and increased public works projects, including the construction of hospitals and schools.",
      "• Economic decentralization and regional development were promoted through the establishment of 25 new industrial parks located outside the heavily populated Casablanca-Kénitra coastal area.",
      "• Large-scale industrial projects under the 1981–85 plan included phosphoric acid plants, sugar refineries, and mining operations to exploit cobalt, coal, silver, lead, and copper deposits, as well as oil-shale development initiatives."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:46:30.220008",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2163,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "1990–2000s",
    "text": "Moroccan GDP growth (1990–2005).\n\nMoroccan economic policies brought macroeconomic stability to the country in\nthe early 1990s but did not spur growth sufficient to reduce unemployment\ndespite Moroccan Government's ongoing efforts to diversify the economy.\nDrought conditions depressed activity in the key agricultural sector, and\ncontributed to an economic slowdown in 1999. Favourable rainfalls have led\nMorocco to a growth of 6% for 2000. Formidable long-term challenges included:\nservicing the external debt; preparing the economy for freer trade with the\nEU; and improving education and attracting foreign investment to improve\nliving standards and job prospects for Morocco's youthful population.\n\nMacroeconomic stability coupled with relatively slow economic growth\ncharacterized the Moroccan economy over the period 2000–2005. The government\nintroduced a number of important economic reforms in that period. The economy,\nhowever, remained overly dependent on the agricultural sector. Morocco's\nprimary economic challenge was to accelerate growth in order to reduce high\nlevels of unemployment. The government continued liberalizing the\ntelecommunications sector in 2002, as well as the rules for oil and gas\nexploration. This process started with the sale of a second GSM license in\n1999. The government in 2003 was using revenue from privatizations to finance\nincreased spending. Although Morocco's economy grew in the early 2000s, it was\nnot enough to significantly reduce poverty.\n\nThrough a foreign exchange rate anchor and well-managed monetary policy,\nMorocco held inflation rates to industrial country levels over the past\ndecade. Inflation in 2000 and 2001 were below 2%. Despite criticism among\nexporters that the dirham has become badly overvalued, the current account\ndeficit remains modest. Foreign exchange reserves were strong, with more than\n$7 billion in reserves at the end of 2001. The combination of strong foreign\nexchange reserves and active external debt management gave Morocco the\ncapacity to service its debt. Current external debt stands at about $16.6\nbillion. Africa:: Morocco — The World Factbook - Central Intelligence Agency\nArchived 2 December 2022 at the Wayback Machine\n\nEconomic growth, however, has been erratic and relatively slow, partially as a\nresult of an over-reliance on the agricultural sector. Agriculture production\nis extremely susceptible to rainfall levels and ranges from 13% to 20% of GDP.\nGiven that 36% of Morocco's population depends directly on agriculture\nproduction, droughts have a severe knock-on effect to the economy. Two\nsuccessive years of drought led to a 1% incline in real GDP in 1999 and\nstagnation in 2000. Better rains during the 2000 to 2001 growing season led to\na 6.5% growth rate in 2001. Growth in 2006 went above 9%, this was achieved by\na booming real estate market.\n\nThe government introduced a series of structural reforms in recent years. The\nmost promising reforms have been in the liberalization of the\ntelecommunications sector. In 2001, the process continued with the\nprivatization of 35% of the state operator Maroc Telecom. Morocco announced\nplans to sell two fixed licenses in 2002. Morocco also has liberalized rules\nfor oil and gas exploration and has granted concessions for many public\nservices in major cities. The tender process in Morocco is becoming\nincreasingly transparent. Many believe, however, that the process of economic\nreform must be accelerated in order to reduce urban unemployment below the\ncurrent rates above 20%.",
    "openai_summarised_points": [
      "• Moroccan economic policies in the early 1990s achieved macroeconomic stability but failed to generate sufficient growth to reduce unemployment, despite ongoing government efforts to diversify the economy.",
      "• Drought conditions in the late 1990s depressed activity in Morocco’s key agricultural sector, contributing to an economic slowdown in 1999.",
      "• Favorable rainfall in 2000 led to a significant economic growth rate of 6% for that year.",
      "• Long-term challenges for Morocco’s economy included servicing external debt, preparing for freer trade with the European Union, improving education, and attracting foreign investment to enhance living standards and job prospects for the youthful population.",
      "• Between 2000 and 2005, Morocco’s economy was characterized by macroeconomic stability but relatively slow growth, with continued heavy dependence on the agricultural sector.",
      "• The primary economic challenge during 2000–2005 was accelerating growth to reduce persistently high unemployment levels.",
      "• The government continued economic liberalization efforts, including the telecommunications sector reforms initiated by the sale of a second GSM license in 1999.",
      "• In 2002, Morocco liberalized rules for oil and gas exploration, furthering sectoral reforms.",
      "• By 2003, the government was using revenue generated from privatizations to finance increased public spending.",
      "• Despite economic growth in the early 2000s, the improvements were insufficient to significantly reduce poverty levels.",
      "• Morocco maintained inflation rates comparable to industrial countries over the decade through a foreign exchange rate anchor and well-managed monetary policy.",
      "• Inflation rates were below 2% in both 2000 and 2001.",
      "• Exporters criticized the Moroccan dirham for being overvalued, but the current account deficit remained modest.",
      "• Foreign exchange reserves were strong, exceeding $7 billion at the end of 2001.",
      "• Strong foreign exchange reserves combined with active external debt management enabled Morocco to service its external debt, which stood at approximately $16.6 billion.",
      "• Economic growth was erratic and relatively slow, largely due to over-reliance on the agricultural sector, which accounted for between 13% and 20% of GDP.",
      "• Approximately 36% of Morocco’s population depended directly on agricultural production, making the economy highly vulnerable to droughts.",
      "• Two consecutive years of drought resulted in only a 1% increase in real GDP in 1999 and economic stagnation in 2000.",
      "• Improved rainfall during the 2000–2001 growing season contributed to a 6.5% GDP growth rate in 2001.",
      "• In 2006, economic growth exceeded 9%, driven primarily by a booming real estate market.",
      "• Structural reforms introduced in recent years included significant liberalization of the telecommunications sector.",
      "• In 2001, Morocco privatized 35% of the state-owned operator Maroc Telecom as part of ongoing sector reforms.",
      "• The government announced plans in 2002 to sell two fixed-line telecommunications licenses.",
      "• Morocco liberalized regulations for oil and gas exploration and granted concessions for many public services in major cities.",
      "• The tender process for public contracts in Morocco became increasingly transparent during this period.",
      "• Despite reforms, many observers believed that economic reform needed to accelerate to reduce urban unemployment, which remained above 20%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:46:39.434321",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3529,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Recent developments",
    "text": "50 dirhams and Ksour in the background\n\nMorocco's sound economic management in recent years has yielded strong growth\nand investment grade status and it is weathering the negative impacts of the\nglobal crisis impressively well. Morocco is now addressing persistent social\nproblems by reducing absolute poverty rates, investing in human capital\nthrough quality education, expanding access to drinking water, and linking\nrural areas to markets through investment in roads.\n\nMorocco faces challenges on human development outcomes despite progress over\nthe past decade, in particular. Overall illiteracy rates and gender disparity\nin access to secondary education remain high and the country continues to\nsuffer poor outcomes on infant and maternal mortality. It also needs to\ndiversify its economy, become more competitive, and integrate further into the\nglobal economy if it is to reach higher growth levels.\n\nThe government has recognized this challenge and has put in place an ambitious\nprocess of legal, policy, and institutional modernization that has far-\nreaching political, economic, and social dimensions. It has designed and is\nnow implementing a comprehensive set of new sector strategies that respond to\nthe overall national vision and that target development challenges with clear,\nmeasurable goals and indicators.[_citation needed_]\n\nTough government reforms and steady yearly growth in the region of 4–5% from\n2000 to 2007, including 4.9% year-on-year growth in 2003–2007 the Moroccan\neconomy is much more robust than just a few years ago. Economic growth is far\nmore diversified, with new service and industrial poles, like Casablanca and\nTangier, developing. The agriculture sector is being rehabilitated, which in\ncombination with good rainfalls led to a growth of over 20% in 2009.",
    "openai_summarised_points": [
      "• Morocco has demonstrated sound economic management in recent years, achieving strong growth and attaining investment grade status, while effectively mitigating the adverse effects of the global economic crisis.",
      "• The country is actively addressing persistent social issues by reducing absolute poverty rates, investing in human capital through improvements in quality education, expanding access to potable drinking water, and enhancing rural connectivity to markets via infrastructure investments in roads.",
      "• Despite progress over the past decade, Morocco continues to face significant challenges in human development outcomes, including high overall illiteracy rates and pronounced gender disparities in access to secondary education.",
      "• Morocco experiences poor health outcomes, particularly in infant and maternal mortality rates, highlighting ongoing public health challenges.",
      "• Economic diversification, increased competitiveness, and deeper integration into the global economy are identified as critical needs for Morocco to achieve higher levels of economic growth.",
      "• The Moroccan government has acknowledged these challenges and initiated an ambitious process of legal, policy, and institutional modernization encompassing political, economic, and social reforms.",
      "• A comprehensive set of new sector strategies has been designed and is currently being implemented, aligned with the national vision and aimed at addressing development challenges through clear, measurable goals and indicators.",
      "• Between 2000 and 2007, Morocco experienced steady annual economic growth rates in the range of 4–5%, including a 4.9% year-on-year growth rate during the period 2003–2007, reflecting a more robust and resilient economy compared to previous years.",
      "• Economic growth has become more diversified, with the emergence of new service and industrial hubs, notably in Casablanca and Tangier.",
      "• The agriculture sector has undergone rehabilitation efforts, which, combined with favorable rainfall, contributed to an agricultural growth rate exceeding 20% in 2009."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:46:46.500582",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1797,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.3.1",
    "section_name": "2008",
    "text": "In a statement, released in July 2008, the IMF called Morocco \"a pillar of\ndevelopment in the region\" and congratulated King Mohammed VI and the Central\nBank on Morocco's continued strong economic progress and effective management\nof monetary policy.\n\nMorocco's economy is expected to grow by 6.5% in 2008, according to the\nMoroccan finance minister. While the forecast is slightly lower than the\nearlier 6.8% projected growth it still remains quite an achievement\nconsidering the circumstances. GDP growth in 2007 was only 2.2% due to a poor\nharvest caused by prolonged periods of drought; Morocco experienced\nnonagricultural GDP growth of 6.6 percent in 2007. Inflation is expected to\nreach 2.9% in 2008 due to the rising costs of energy. In an increasingly\nchallenging global economic climate, the IMF expects continued nonagricultural\nexpansion of the Moroccan economy.\n\nThe 2008 financial crisis affected the Moroccan economy in only a limited way\naccording to the Bank Al-Maghrib.\n\nIn a report issued in July 2008, the IMF noted that Morocco's financial sector\nis sound and resilient to shocks, and that the remarkable fiscal consolidation\nefforts of recent years have allowed the Moroccan economy to absorb the impact\nof difficult international economic conditions and increasing global prices\nfor essential commodities such as petroleum and energy. International economic\nexperts recognize that Morocco's exemplary economic performance is beneficial\nnot only to Moroccans, but also for the nearly 90 million people who live the\nMaghreb.\n\nMorocco is expected to close the year 2008 with a budgetary surplus ranging\nbetween MAD 3 billion and MAD3.5 billion ($348 million to $407 million),\ndespite a difficult international context marked by a severe economic crisis.\nAt the end of November 2008, the state's budget registered a surplus of MAD\n3.2 billion ($372 million), while at the end of November 2009, the budgetary\nsurplus is projected at MAD 6.9 billion ($803 million).\n\nThe diversification of the Economy includes a multi-disciplinary approach to\nthe development of non-agricultural sector, including the creation of special\nsectorial zones in industry, tourism and services outsourcing. In addition,\nreforms to the higher educational system and business law are also planified\nin the new program-contract signed in 2009 between the government, the banking\nsector and some zone-development companies. The approach also include a better\nsustaining of small-business development and prospection of external markets.\nThe objective is to become an emerging industrial country of the likes of\nVietnam by 2015.\n\nUS Ambassador to the EU noted that:\n\n\"Morocco stands out as a model of economic reform for the region and for other developing countries. The kind of economic progress that Morocco has made, and which the rest of the Maghreb has the potential to accomplish, is the best antidote to the new threat of terrorism in the region.\" [_citation needed_]\n| 2006  | 2007  | 2008  | 2009\n---|---|---|---|---\n**Maghreb GDP growth** | **4.3** | **4.3** | **5.5** | **4.9**\nMoroccan GDP growth | 7.8  | 2.7  | 6.5  | 5.5\nAlgerian GDP growth | 2.0  | 4.6  | 4.9  | 4.5\nTunisian GDP growth | 5.5  | 6.3  | 5.5  | 5.0",
    "openai_summarised_points": [
      "• In July 2008, the International Monetary Fund (IMF) described Morocco as \"a pillar of development in the region\" and commended King Mohammed VI and the Central Bank for Morocco's sustained strong economic progress and effective monetary policy management.",
      "• The Moroccan finance minister projected Morocco's economy to grow by 6.5% in 2008, a slight revision downward from an earlier forecast of 6.8%, yet still considered a significant achievement given prevailing circumstances.",
      "• Morocco's GDP growth in 2007 was only 2.2%, primarily due to a poor agricultural harvest caused by prolonged drought; however, nonagricultural GDP growth in 2007 reached 6.6%.",
      "• Inflation in Morocco was expected to rise to 2.9% in 2008, driven by increasing energy costs amid a challenging global economic environment.",
      "• The IMF anticipated continued expansion in Morocco’s nonagricultural sectors despite global economic difficulties.",
      "• According to Bank Al-Maghrib, the 2008 global financial crisis had only a limited impact on the Moroccan economy.",
      "• A July 2008 IMF report highlighted Morocco’s financial sector as sound and resilient to external shocks, crediting recent fiscal consolidation efforts for enabling the economy to withstand adverse international economic conditions and rising global prices for essential commodities such as petroleum and energy.",
      "• International economic experts acknowledged Morocco’s exemplary economic performance as beneficial not only to its population but also to the nearly 90 million inhabitants of the Maghreb region.",
      "• Morocco was expected to close 2008 with a budgetary surplus between MAD 3 billion and MAD 3.5 billion (equivalent to $348 million to $407 million), despite the severe international economic crisis.",
      "• By the end of November 2008, Morocco’s state budget recorded a surplus of MAD 3.2 billion ($372 million), with projections for a budgetary surplus of MAD 6.9 billion ($803 million) by the end of November 2009.",
      "• Economic diversification efforts in Morocco included a multidisciplinary approach focusing on the development of non-agricultural sectors such as industry, tourism, and services outsourcing through the creation of special sectorial zones.",
      "• Planned reforms under a new program-contract signed in 2009 between the government, the banking sector, and zone-development companies aimed to improve the higher education system and business law.",
      "• The diversification strategy also emphasized supporting small-business development and exploring external markets, with the objective of transforming Morocco into an emerging industrial country comparable to Vietnam by 2015.",
      "• The US Ambassador to the European Union remarked that Morocco stands out as a model of economic reform for the region and other developing countries, asserting that Morocco’s economic progress—and the potential for similar progress in the Maghreb—is the best antidote to the threat of terrorism in the region.",
      "• Maghreb GDP growth rates were as follows: 4.3% in 2006, 4.3% in 2007, 5.5% in 2008, and 4.9% projected for 2009.",
      "• Moroccan GDP growth rates were 7.8% in 2006, 2.7% in 2007, 6.5% in 2008, and projected 5.5% in 2009.",
      "• Algerian GDP growth rates were 2.0% in 2006, 4.6% in 2007, 4.9% in 2008, and projected 4.5% in 2009.",
      "• Tunisian GDP growth rates were 5.5% in 2006, 6.3% in 2007, 5.5% in 2008, and projected 5.0% in 2009."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:02.373150",
      "openai_model": "gpt-4.1-mini",
      "content_length": 3219,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.3.2",
    "section_name": "2009",
    "text": "The economy has remained insulated from the worst effects of the world crisis.\nDue in part to the rebounding of the agricultural sector, which had suffered\nfrom a 2007 drought, the economy expanded 5.6% in 2008, with 5.7% growth\nforecasted for 2009. Morocco's economy is the 61st largest in the world,\naccording to the IMF, though its per-capita GDP is low compared to similarly\nranked nations. King Mohammed VI has recently launched two national economic\nstrategies: Plan Maroc Vert and Plan Emergence. The first seeks to create 1.5m\njobs in the agriculture sector, and add around €7.65 billion to GDP through\n€10.8 billion of investments by 2020, while the latter will establish new\nindustrial zones and boost training to increase efficiency. Additionally,\nphosphates production, which accounted for more than a third of 2008 exports,\nis being restructured for greater value.\n\nMorocco's economy is expected to achieve a 6.6% growth in the first quarter of\n2009 up from 4.8% in the past quarter thanks to prospects for an agricultural\ncampaign above the average of the past five years.\n\nBy the end of December 2008, rainfalls exceeded that of an ordinary year by\n106%. This surplus has benefited to all agricultural regions and increased the\nwater stored in dams destined for agriculture to 40.7%. In these conditions\nand taking into consideration a cereal campaign nearing 70 million quintals,\nthe agricultural value added could increase by 22.2% in the first quarter of\n2009, thus contributing 2.9% to the national economic growth.\n\nDue to a decrease of activity among Morocco's main commercial partners,\nforeign demand of goods destined towards Morocco would moderately slow down in\n2009 compared to the 9% rise in 2008. This trend could continue in Q1 of 2009\nwith a growth rate not exceeding 2% due to a lackluster economic growth\noutlook and the slowdown of international trade.",
    "openai_summarised_points": [
      "• Morocco's economy remained insulated from the worst effects of the global financial crisis as of 2009, partly due to the recovery of the agricultural sector following a drought in 2007.",
      "• The Moroccan economy expanded by 5.6% in 2008, with a forecasted growth rate of 5.7% for 2009.",
      "• According to the International Monetary Fund (IMF), Morocco's economy ranked as the 61st largest in the world in 2009, although its per-capita GDP was low compared to other nations with similar rankings.",
      "• King Mohammed VI initiated two national economic strategies: Plan Maroc Vert and Plan Emergence.",
      "• Plan Maroc Vert aims to create 1.5 million jobs in the agricultural sector and contribute approximately €7.65 billion to Morocco’s GDP by 2020 through investments totaling €10.8 billion.",
      "• Plan Emergence focuses on establishing new industrial zones and enhancing workforce training to improve industrial efficiency.",
      "• The phosphate production sector, which accounted for more than one-third of Morocco’s exports in 2008, was undergoing restructuring to increase its value-added output.",
      "• Economic growth in the first quarter of 2009 was expected to reach 6.6%, up from 4.8% in the previous quarter, driven by prospects of an agricultural campaign surpassing the average of the previous five years.",
      "• By the end of December 2008, rainfall levels exceeded those of an average year by 106%, benefiting all agricultural regions and increasing water storage in dams for agricultural use to 40.7%.",
      "• Under these favorable conditions, and with a cereal production campaign approaching 70 million quintals, the agricultural value added was projected to increase by 22.2% in the first quarter of 2009, contributing 2.9% to national economic growth.",
      "• Despite positive agricultural performance, foreign demand for Moroccan goods was expected to moderately slow in 2009 due to decreased economic activity among Morocco’s main commercial partners.",
      "• The growth rate of foreign demand was not expected to exceed 2% in the first quarter of 2009, down from a 9% increase in 2008, reflecting a weak global economic outlook and a slowdown in international trade."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:10.155602",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1885,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.3.3",
    "section_name": "2019",
    "text": "In June 2019, Morocco signed two agreements to obtain a loan worth $237\nmillion from the Arab Fund for Economic and Social Development. The loan was\ntaken to fund two investment projects.",
    "openai_summarised_points": [
      "• In June 2019, Morocco entered into two agreements to secure a loan totaling $237 million from the Arab Fund for Economic and Social Development.",
      "• The purpose of the $237 million loan was to finance two distinct investment projects within Morocco."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:11.966993",
      "openai_model": "gpt-4.1-mini",
      "content_length": 187,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "2.3.4",
    "section_name": "2020",
    "text": "On the economic front, the shock of COVID-19 has pushed the Moroccan economy\ninto its first recession since 1995. Economic output contracted by 15.1% in\nthe second quarter of 2020, primarily as a result of the lockdown but also of\na sharp reduction in exports caused by the pandemic's disruption to global\nvalue chains and the collapse of receipts from tourism. The shock to supply\nand demand, triggered by the pandemic, has been compounded by the fall in\nagricultural production due to a severe drought. Although activity picked up\nin the third and fourth quarters of 2020, the government's preliminary\nestimates indicate that Morocco's real GDP contracted by 7% in 2020, leading\nto an increase in unemployment from 9.2% to 11.9%.",
    "openai_summarised_points": [
      "• In 2020, the Moroccan economy experienced its first recession since 1995 due to the economic shock caused by the COVID-19 pandemic.",
      "• Economic output in Morocco contracted by 15.1% in the second quarter of 2020, primarily as a result of the nationwide lockdown measures implemented to contain the virus.",
      "• The sharp reduction in exports significantly contributed to the economic contraction, driven by disruptions to global value chains caused by the pandemic.",
      "• The collapse of receipts from tourism, a key sector in Morocco’s economy, further exacerbated the economic downturn in 2020.",
      "• The pandemic-induced shock to both supply and demand was intensified by a severe drought, which led to a fall in agricultural production during the same period.",
      "• Despite some recovery in economic activity during the third and fourth quarters of 2020, the overall impact remained negative for the year.",
      "• Preliminary government estimates for 2020 indicated that Morocco’s real Gross Domestic Product (GDP) contracted by 7%.",
      "• The economic downturn contributed to a rise in the national unemployment rate, which increased from 9.2% before the pandemic to 11.9% by the end of 2020."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:17.424236",
      "openai_model": "gpt-4.1-mini",
      "content_length": 731,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Economic growth",
    "text": "Morocco is a fairly stable economy with continuous growth over the past half-\na-century. Current GDP per capita grew 47% in the Sixties reaching a peak\ngrowth of 274% in the Seventies. However, this proved unsustainable and growth\nscaled back sharply to just 8.2% in the Eighties and 8.9% in the Nineties.\n\nReal GDP growth is expected to average 5.5% in the 2009–13 period, seen the\nprospects in the tourism and the non-agricultural industry, as demand growth\nin the Eurozone — Morocco's key export market and source of tourists is\nprojected to be more subdued. Growth will be well below the 8–10% levels that\nare widely regarded as necessary to have a major impact on poverty and\nunemployment. Economic growth will also be intermittently hindered by the\nimpact of periodic droughts on the rain-fed agricultural sector, the country's\nlargest employer.\n\nMoroccan GDP growth (IMF)  | 2004  | 2005  | 2006  | 2007  | 2008  | 2009  | 2010  | 2004–2010\n---|---|---|---|---|---|---|---|---\nMoroccan GDP(PPP)  | 101.904  | 108.171  | 120.365  | 126.943  | 138.177  | 148.109  | 159.007  | NA\nMoroccan GDP(Nominal)  | 56.948  | 59.524  | 65.640  | 75.116  | 90.470  | 97.68  | 106.59  | NA\nMoroccan GDP(PPP) per capita  | 3,409  | 3,585  | 3,945  | 4,093  | 4,432  | 4,725  | 5,025  | NA\nPercentage of GDP growth  | 4.8  | 3.0  | 7.8  | 2.7  | 6.5  | 4.4 (est.)  | 4.4 (est.)  | **Av. of 5.2%**\nPublic Debt (percentage of GDP)  | 59.4  | 63.1  | 58.1  | 53.6  | 51.9  | 51.8 (est.)  | 50.1 (est.)  | NA",
    "openai_summarised_points": [
      "• Morocco has maintained a fairly stable economy characterized by continuous growth over the past fifty years, with notable fluctuations across decades.",
      "• During the 1960s, Morocco's GDP per capita experienced a significant increase of 47%, followed by an even more substantial peak growth of 274% in the 1970s.",
      "• The rapid growth observed in the 1970s proved unsustainable, leading to a sharp decline in growth rates to just 8.2% in the 1980s and 8.9% in the 1990s.",
      "• Real GDP growth for Morocco was projected to average 5.5% during the 2009–2013 period, influenced by positive prospects in the tourism sector and non-agricultural industries.",
      "• Despite these positive sectors, growth was expected to be constrained by subdued demand growth in the Eurozone, which is Morocco’s key export market and primary source of tourists.",
      "• The anticipated growth rate of 5.5% was considered insufficient to achieve the 8–10% growth levels widely regarded as necessary to significantly reduce poverty and unemployment in Morocco.",
      "• Economic growth was also expected to face intermittent challenges due to periodic droughts affecting the rain-fed agricultural sector, which remains the largest employer in the country.",
      "• According to IMF data, Moroccan GDP measured in purchasing power parity (PPP) increased from 101.904 billion USD in 2004 to 159.007 billion USD in 2010.",
      "• Moroccan nominal GDP rose from 56.948 billion USD in 2004 to 106.59 billion USD in 2010, reflecting substantial nominal economic expansion.",
      "• Moroccan GDP (PPP) per capita increased steadily from 3,409 USD in 2004 to 5,025 USD in 2010, indicating gradual improvement in average income levels.",
      "• Annual GDP growth rates fluctuated between 2.7% and 7.8% from 2004 to 2008, with estimated growth rates of 4.4% for both 2009 and 2010, resulting in an average growth rate of 5.2% over the 2004–2010 period.",
      "• Public debt as a percentage of GDP showed a declining trend, starting at 59.4% in 2004, peaking at 63.1% in 2005, and then decreasing steadily to an estimated 50.1% in 2010."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:26.844419",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1494,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Agriculture",
    "text": "Agriculture employs about 40% of Morocco's workforce. On the Atlantic coast,\nwhere there are extensive plains, olives, citrus fruits, and wine grapes are\ngrown, largely with water supplied by artesian wells. Livestock are raised and\nforests yield cork, cabinet wood, and building materials. Part of the maritime\npopulation fishes for its livelihood. Agadir, Essaouira, El Jadida, and\nLarache are among the important fishing harbours. In the rainy sections of the\nnortheast, barley, wheat, and other cereals can be raised without irrigation.\n\nMorocco produced in 2018:\n\n* 7.3 million tons of wheat (20th largest producer in the world);\n* 3.7 million tonnes of sugar beet, which is used to produce sugar and ethanol;\n* 2.8 million tons of barley (15th largest producer in the world);\n* 1.8 million tons of potatoes;\n* 1.5 million tons of olives (3rd largest producer in the world, behind Spain and Italy);\n* 1.4 million tons of tomatoes (15th largest producer in the world);\n* 1.2 million tons of tangerines (4th largest producer in the world, behind China, Spain and Turkey);\n* 1 million tons of oranges (15th largest producer in the world);\n* 954 thousand tons of onions;\n* 742 thousand tons of watermelons;\n* 696 thousand tons of apples;\n* 616 thousand tons of sugarcane;\n* 500 thousand tons of melons;\n* 480 thousand tons of carrots;\n* 451 thousand tons of grapes;\n* 319 thousand tons of bananas;\n* 256 thousand tons of chilli peppers;\n* 128 thousand tons of fig (3rd largest producer in the world, only behind Turkey and Egypt);\n\nIn addition to smaller yields of other agricultural products.",
    "openai_summarised_points": [
      "• Agriculture employs approximately 40% of Morocco's workforce, indicating its significant role in the national economy.",
      "• On the Atlantic coast of Morocco, extensive plains support the cultivation of olives, citrus fruits, and wine grapes, with irrigation primarily supplied by artesian wells.",
      "• Livestock farming is practiced alongside forestry activities, where forests provide cork, cabinet wood, and building materials.",
      "• A portion of Morocco's maritime population relies on fishing for their livelihood, with key fishing harbours located in Agadir, Essaouira, El Jadida, and Larache.",
      "• In the northeastern regions of Morocco, which receive higher rainfall, cereals such as barley and wheat are cultivated without the need for irrigation.",
      "• In 2018, Morocco produced 7.3 million tons of wheat, ranking as the 20th largest wheat producer globally.",
      "• The country produced 3.7 million tonnes of sugar beet in 2018, a crop used for producing sugar and ethanol.",
      "• Barley production in 2018 reached 2.8 million tons, making Morocco the 15th largest barley producer worldwide.",
      "• Potato production was 1.8 million tons in 2018, highlighting its importance among staple crops.",
      "• Olive production amounted to 1.5 million tons in 2018, positioning Morocco as the 3rd largest olive producer globally, behind Spain and Italy.",
      "• Tomato production was 1.4 million tons in 2018, with Morocco ranking as the 15th largest producer in the world.",
      "• Tangerine production reached 1.2 million tons in 2018, making Morocco the 4th largest producer globally, following China, Spain, and Turkey.",
      "• Orange production was recorded at 1 million tons in 2018, ranking Morocco as the 15th largest producer worldwide.",
      "• Onion production totaled 954 thousand tons in 2018, contributing significantly to vegetable agriculture.",
      "• Watermelon production was 742 thousand tons in 2018, reflecting the diversity of fruit cultivation.",
      "• Apple production reached 696 thousand tons in 2018, indicating the presence of temperate fruit farming.",
      "• Sugarcane production was 616 thousand tons in 2018, used for sugar and related products.",
      "• Melon production amounted to 500 thousand tons in 2018, further diversifying Morocco's fruit output.",
      "• Carrot production was 480 thousand tons in 2018, supporting vegetable crop variety.",
      "• Grape production totaled 451 thousand tons in 2018, important for both fresh consumption and wine production.",
      "• Banana production was 319 thousand tons in 2018, contributing to tropical fruit agriculture.",
      "• Chilli pepper production reached 256 thousand tons in 2018, used in culinary and commercial applications.",
      "• Fig production was 128 thousand tons in 2018, ranking Morocco as the 3rd largest producer globally, behind Turkey and Egypt.",
      "• Morocco also produces smaller yields of various other agricultural products, indicating a diverse agricultural sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:38.828323",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1594,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Land",
    "text": "Agricultural terraces in Anti-Atlas mountains\n\nMorocco is endowed with numerous exploitable resources. With approximately\n85,000 square kilometres (33,000 sq mi) of arable land (one-seventh of which\ncan be irrigated) and its generally temperate Mediterranean climate, Morocco's\nagricultural potential is matched by few other Arab or African countries. It\nis one of the few Arab countries that has the potential to achieve self-\nsufficiency in food production. In a normal year, Morocco produces two-thirds\nof the grains (chiefly wheat, barley, and corn [maize]) needed for domestic\nconsumption.\n\nMorocco exports citrus fruits and early vegetables to the European market. Its\nwine industry is developed, and the production of commercial crops (cotton,\nsugarcane, sugar beets, and sunflowers) is expanding. Newer crops such as tea,\ntobacco, and soybeans have passed the experimental stage, the fertile Gharb\nplain being favourable for their cultivation. Morocco is actively developing\nits irrigation potential that ultimately will irrigate more than 2.5 million\nacres (1 million hectares).\n\nMorocco's forestry policy seeks to restore over 600,000 hectares of forest\necosystems, battle soil erosion, control water flow, and boost forestry and\ntourist revenue. This is supported by the European Investment Bank's\ndevelopment branch, EIB Global. The EIB-financed component will reforest about\n55,000 hectares, resulting in 30 200 years of temporary work and over 6,800\npermanent jobs.",
    "openai_summarised_points": [
      "• Morocco possesses significant exploitable natural resources, including approximately 85,000 square kilometres (33,000 sq mi) of arable land, of which one-seventh is suitable for irrigation.",
      "• The country benefits from a generally temperate Mediterranean climate, enhancing its agricultural potential, which is considered superior to that of most other Arab or African nations.",
      "• Morocco is among the few Arab countries with the capacity to achieve self-sufficiency in food production.",
      "• In an average year, Morocco produces about two-thirds of the grains required for domestic consumption, primarily wheat, barley, and corn (maize).",
      "• The nation exports citrus fruits and early vegetables to the European market, indicating a strong presence in international agricultural trade.",
      "• Morocco has a developed wine industry and is expanding the production of commercial crops such as cotton, sugarcane, sugar beets, and sunflowers.",
      "• Newer agricultural crops including tea, tobacco, and soybeans have progressed beyond experimental cultivation, particularly thriving in the fertile Gharb plain region.",
      "• The country is actively enhancing its irrigation infrastructure, aiming to irrigate more than 2.5 million acres (1 million hectares) to support agricultural productivity.",
      "• Morocco’s forestry policy focuses on restoring over 600,000 hectares of forest ecosystems, combating soil erosion, regulating water flow, and increasing revenue from forestry and tourism sectors.",
      "• This forestry initiative is supported by the European Investment Bank’s development branch, EIB Global.",
      "• The EIB-financed component of the forestry program plans to reforest approximately 55,000 hectares, which is expected to generate 30,200 years of temporary employment and create over 6,800 permanent jobs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:46.408148",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1479,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Drought",
    "text": "Unreliable rainfall is a chronic problem that produces drought or sudden\nfloods. In 1995, Morocco's worst drought in thirty years forced Morocco to\nimport grain and adversely affected the economy. Another drought occurred in\n1997, and one in 1999–2000. Reduced incomes due to drought caused GDP to fall\nby 7.6% in 1995, by 2.3% in 1997, and by 1.5% in 1999. During the years\nbetween drought, good rains brought bumper crops to market. Good rainfall in\n2001 led to a 5% GDP growth rate.\n\nThe danger of drought is ever present and still dramatically affects the\nMoroccan economy, even though Moroccan decisionmakers have recently[_when?_]\nstated that the economy becomes more diversified and disconnected from rain\nfalls.[_citation needed_] Especially, cereal yields still depend on\nconsiderable variation in annual precipitation. Cereals constitute the\nessential of the agricultural value added and their production is very\nsensitive to rain falls. More important is that cereal yields determine not\nonly the aggregate value added in the agricultural sector but also economic\ngrowth in general.[_citation needed_] According to the Moroccan economist,\nBrahim MANSOURI (Fiscal Policy and Economic Growth: Egypt, Morocco and Tunisia\nCompared, UNECA, 2008), when drought, measured as a dummy variable computed on\nthe basis of the rate of growth of cereal yield, endangers extremely, the\ngrowth rate of real GDP would fall by 10%.",
    "openai_summarised_points": [
      "• Unreliable rainfall in Morocco is a chronic issue that results in either drought or sudden floods, significantly impacting the economy.",
      "• In 1995, Morocco experienced its worst drought in thirty years, which compelled the country to import grain and had a detrimental effect on the national economy.",
      "• Subsequent droughts occurred in 1997 and again during 1999–2000, each causing economic setbacks.",
      "• The drought-induced reductions in income led to declines in Morocco’s GDP by 7.6% in 1995, 2.3% in 1997, and 1.5% in 1999.",
      "• Conversely, periods between droughts with favorable rainfall resulted in bumper crops, positively influencing the economy.",
      "• For example, good rainfall in 2001 contributed to a 5% growth rate in Morocco’s GDP.",
      "• Despite assertions by Moroccan decisionmakers that the economy is becoming more diversified and less dependent on rainfall, drought remains a significant threat to economic stability.",
      "• Cereal yields in Morocco continue to be highly dependent on annual precipitation, exhibiting considerable variation with rainfall levels.",
      "• Cereals represent the essential component of agricultural value added in Morocco, and their production is highly sensitive to rainfall fluctuations.",
      "• The yield of cereals not only determines the aggregate value added within the agricultural sector but also has a broader impact on overall economic growth.",
      "• According to Moroccan economist Brahim Mansouri, in his 2008 UNECA study titled \"Fiscal Policy and Economic Growth: Egypt, Morocco and Tunisia Compared,\" severe drought conditions—measured as a dummy variable based on the growth rate of cereal yield—can cause the real GDP growth rate to decline by as much as 10%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:47:52.063433",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1424,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Cannabis",
    "text": "Morocco consistently ranks among the world's largest producers and exporters\nof cannabis, and its cultivation and sale provide the economic base for much\nof northern Morocco. The cannabis is typically processed into hashish. This\nactivity represents 0.57% of Morocco's GDP. A UN survey in 2003 estimated\ncannabis cultivation at about 1,340 km2 (520 sq mi) in Morocco's five northern\nprovinces. This represented 10% of the total area and 23% of the arable lands\nof the surveyed territory and 1% of Morocco's total arable land. On May 26,\n2021, the Moroccan Parliament voted to legalise the use of cannabis for\nmedical, as well as cosmetic and industrial purposes.\n\nMorocco is a party to the 1988 UN Drug Convention and in 1992 Morocco passed\nlegislation designed to implement it and its new national strategy against\ndrugs formulated by its National Committee on Narcotics was adopted in 2005.\nThat same year, the International Narcotics Control Board commended the\nGovernment of Morocco for its efforts to eradicate cannabis plant cultivation\non its territory, which has resulted in the total potential production of\ncannabis resin in the Rif region decreasing by 10% over the previous year. At\nthe same time, the board called upon the international community to support\nits efforts where possible.\n\nSince the early 2010s, a growing debate is taking place in Morocco about the\ndecriminalisation of cannabis. Powerful political parties are among advocates\nof decriminalisation, as the Istiqlal Party and the Authenticity and Modernity\nParty.",
    "openai_summarised_points": [
      "• Morocco consistently ranks among the world's largest producers and exporters of cannabis, with its cultivation and sale forming the economic base for much of northern Morocco.",
      "• The cannabis produced in Morocco is typically processed into hashish, a concentrated form of cannabis resin.",
      "• Cannabis-related activities contribute approximately 0.57% to Morocco's Gross Domestic Product (GDP).",
      "• A United Nations survey conducted in 2003 estimated that cannabis cultivation covered about 1,340 square kilometers (520 square miles) across Morocco's five northern provinces.",
      "• This cultivated area represented 10% of the total land area and 23% of the arable land within the surveyed northern territory, and accounted for 1% of Morocco's total arable land nationwide.",
      "• On May 26, 2021, the Moroccan Parliament voted to legalize the use of cannabis for medical, cosmetic, and industrial purposes, marking a significant policy shift.",
      "• Morocco is a signatory to the 1988 United Nations Drug Convention, committing to international drug control standards.",
      "• In 1992, Morocco enacted legislation to implement the provisions of the 1988 UN Drug Convention.",
      "• Morocco’s National Committee on Narcotics formulated a new national strategy against drugs, which was adopted in 2005 to strengthen drug control efforts.",
      "• In 2005, the International Narcotics Control Board (INCB) commended the Moroccan government for its efforts to eradicate cannabis cultivation, noting a 10% decrease in the total potential production of cannabis resin in the Rif region compared to the previous year.",
      "• The INCB also called upon the international community to support Morocco’s cannabis eradication efforts wherever possible.",
      "• Since the early 2010s, there has been a growing national debate in Morocco regarding the decriminalization of cannabis.",
      "• Influential political parties advocating for cannabis decriminalization include the Istiqlal Party and the Authenticity and Modernity Party, reflecting significant political support for reform."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:00.537123",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1540,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Fishing",
    "text": "The fishing industry in Morocco is a leading source of revenue, accounting for\n56% of agricultural and 16% of total exports. For a long time, the industry\nhas been an economic pillar for the country. Morocco is considered the largest\nfish market in Africa, with an estimated total catch of 1,084,638 MT in 2001.",
    "openai_summarised_points": [
      "• The fishing industry in Morocco constitutes a major source of national revenue, representing 56% of the country’s agricultural exports and 16% of its total exports.",
      "• Historically, the fishing sector has served as a fundamental economic pillar for Morocco, underpinning significant aspects of the national economy.",
      "• Morocco holds the distinction of being the largest fish market in Africa, reflecting its prominent role in the continent’s fisheries sector.",
      "• In the year 2001, Morocco’s total fish catch was estimated at 1,084,638 metric tons (MT), underscoring the scale and productivity of its fishing industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:04.017948",
      "openai_model": "gpt-4.1-mini",
      "content_length": 311,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Industry",
    "text": "Moroccan GDP by sector. (1980–2007).\n\nThe Moroccan industrial sector looks set to continue the strong growth it has\nenjoyed in recent years. Industrial activity recorded a 5.5% increase in 2007,\na slight rise over 2006, when the sector grew by 4.7%. Added value in the\nsector increased by 5.6% in 2007. Overall the contribution of industrial\nactivity to GDP fluctuates between about 25% and 35% every year, depending on\nthe performance of the agriculture sector. The industrial sector accounted for\nabout 21.1% of employment in 2007 and the sector is a key component of the\ngovernment's effort to curb unemployment. The sector also attracts high levels\nof FDI and authorities have announced initiatives to improve the investment\nclimate, with particular attention to off-shoring activities, automotive,\naeronautics, electronics, food processing activities, products from the sea\nand textiles. Other important industrial sectors include mining, chemicals,\nconstruction materials and pharmaceuticals. The future of Morocco's industrial\nsegment looks bright, particularly as new initiatives make it more globally\ncompetitive in a variety of sectors.",
    "openai_summarised_points": [
      "• The Moroccan industrial sector experienced robust growth, recording a 5.5% increase in industrial activity in 2007, which was a slight improvement over the 4.7% growth observed in 2006.",
      "• Added value within the Moroccan industrial sector increased by 5.6% in 2007, reflecting enhanced productivity and output.",
      "• The industrial sector's contribution to Morocco's GDP fluctuates annually between approximately 25% and 35%, with variations largely dependent on the performance of the agricultural sector.",
      "• In 2007, the industrial sector accounted for about 21.1% of total employment in Morocco, highlighting its significance as a major source of jobs.",
      "• The industrial sector is a central element of the Moroccan government’s strategy to reduce unemployment rates across the country.",
      "• Morocco’s industrial sector attracts substantial foreign direct investment (FDI), indicating strong international confidence and interest in the country’s industrial potential.",
      "• Moroccan authorities have launched initiatives aimed at improving the investment climate, with a particular focus on developing off-shoring activities, and key industries such as automotive, aeronautics, electronics, food processing, seafood products, and textiles.",
      "• Additional important industrial sectors in Morocco include mining, chemicals, construction materials, and pharmaceuticals, contributing to the diversity and resilience of the industrial base.",
      "• The outlook for Morocco’s industrial sector is positive, with new initiatives enhancing its global competitiveness across multiple sectors, positioning the country for sustained industrial growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:09.037732",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1146,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Manufacturing",
    "text": "Tanneries in Marrakech\n\nManufacturing accounts for about one-sixth of GDP and is steadily growing in\nimportance in the economy. Two particularly important components of Morocco's\nindustrial makeup are processing raw materials for export and manufacturing\nconsumer goods for the domestic market. Many operations date to the colonial\nperiod. Until the early 1980s, government involvement was dominant and the\nmajor focus was on import substitution. Since then the emphasis has shifted to\nprivatizing state operations and attracting new private investment, including\nforeign sources.\n\nProcessing phosphate ore into fertilizers and phosphoric acid for export is a\nmajor economic activity. Food processing for export (canning fish, fresh\nvegetables, and fruit) as well as for domestic needs (flour milling and sugar\nrefining) is also important, and the manufacture of textiles and clothes using\ndomestically produced cotton and wool is a major source of foreign exchange.\nMorocco's iron and steel manufacturing industry is small but provides a\nsignificant share of the country's domestic needs.\n\nThe manufacturing sector produces light consumer goods, especially foodstuffs,\nbeverages, textiles, matches, and metal and leather products. Heavy industry\nis largely limited to petroleum refining, chemical fertilizers, automobile and\ntractor assembly, foundry work, asphalt, and cement. Many of the processed\nagricultural products and consumer goods are primarily for local consumption,\nbut Morocco exports canned fish and fruit, wine, leather goods, and textiles,\nas well as such traditional Moroccan handicrafts as carpets and brass, copper,\nsilver, and wood implements.\n\nOwnership in the manufacturing sector is largely private. The government owns\nthe phosphate-chemical fertilizer industry and much of the sugar-milling\ncapacity, through either partnership or joint financing. It is also a major\nparticipant in the car and truck assembly industry and in tire manufacturing.",
    "openai_summarised_points": [
      "• Manufacturing constitutes approximately one-sixth of Morocco's GDP and is progressively increasing in economic significance.",
      "• The industrial sector in Morocco is notably characterized by two key components: the processing of raw materials for export and the production of consumer goods for the domestic market.",
      "• Many manufacturing operations in Morocco have origins dating back to the colonial period.",
      "• Prior to the early 1980s, the Moroccan government played a dominant role in manufacturing, focusing primarily on import substitution strategies.",
      "• Since the early 1980s, there has been a strategic shift towards privatizing state-owned enterprises and attracting new private investment, including significant foreign direct investment.",
      "• A major economic activity within manufacturing is the processing of phosphate ore into fertilizers and phosphoric acid, primarily for export purposes.",
      "• Food processing is a vital sector, encompassing both export-oriented products such as canned fish, fresh vegetables, and fruit, and domestic products including flour milling and sugar refining.",
      "• The textile and clothing manufacturing industry, utilizing domestically produced cotton and wool, is a significant source of foreign exchange earnings for Morocco.",
      "• Morocco's iron and steel manufacturing industry, while relatively small in scale, fulfills a substantial portion of the country's domestic demand.",
      "• The manufacturing sector produces a variety of light consumer goods, notably foodstuffs, beverages, textiles, matches, and metal and leather products.",
      "• Heavy industry in Morocco is predominantly concentrated in petroleum refining, chemical fertilizer production, automobile and tractor assembly, foundry work, asphalt production, and cement manufacturing.",
      "• Many processed agricultural products and consumer goods are primarily intended for local consumption; however, Morocco exports several items including canned fish and fruit, wine, leather goods, textiles, and traditional Moroccan handicrafts such as carpets and brass, copper, silver, and wood implements.",
      "• Ownership within the manufacturing sector is predominantly private.",
      "• The Moroccan government retains ownership of the phosphate-chemical fertilizer industry and a significant portion of sugar-milling capacity, often through partnerships or joint financing arrangements.",
      "• The government is also a major participant in the automobile and truck assembly industry as well as in tire manufacturing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:20.816099",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1970,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Automotives",
    "text": "The automotive sector is already Morocco's leading export sector and has made\nMorocco the leading car manufacturer in Africa. Morocco's fast integration\ninto the global economy was also facilitated by numerous free trade agreements\nwith the United States and the European Union. These agreements contributed\nundoubtedly in a positive way towards the emergence of export activities in\nthe country. Foreign direct investment has been expanding as companies are\nattracted towards the favorable economic situation of the country, government\nsupport through their numerous initiatives, such as tax exemptions for the\nfirst 5 years and VAT exemptions, modern infrastructure, and a skilled\nworkforce. Moreover, the automotive sector has the strongest job creation;\n85.000 new jobs were created in the sector between 2014 and 2018, bringing the\ntotal jobs in the sector to 158’000.",
    "openai_summarised_points": [
      "• The automotive sector is Morocco's leading export sector, establishing the country as the leading car manufacturer in Africa.",
      "• Morocco's rapid integration into the global economy has been facilitated by numerous free trade agreements with the United States and the European Union.",
      "• These free trade agreements have played a significant role in promoting the emergence and growth of export activities within Morocco.",
      "• Foreign direct investment (FDI) in Morocco's automotive sector has been expanding due to the country's favorable economic conditions.",
      "• Government support has been instrumental in attracting investment, including initiatives such as tax exemptions for the first five years and exemptions from value-added tax (VAT).",
      "• Morocco offers modern infrastructure and a skilled workforce, further enhancing its attractiveness to automotive companies.",
      "• The automotive sector is the strongest contributor to job creation in Morocco, with 85,000 new jobs generated between 2014 and 2018.",
      "• As of 2018, the total number of jobs in Morocco's automotive sector reached 158,000."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:25.117532",
      "openai_model": "gpt-4.1-mini",
      "content_length": 873,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Textiles",
    "text": "Textiles form a major industry in Morocco. The European Union is Morocco's top\nclient in regards to textiles and clothing, with France importing 46% of\nhosiery, 28.5% of basic textile and 27.6% of ready-to-wear clothing from\nMorocco, managing director of the Moroccan Export Development Center\nunderlined. Recalling that Morocco's textile and clothing exports totaled some\n$3.7 billion in 2007, Saad Benabdallah ascribed this performance to the many\nassets that Morocco enjoys, namely, geographical proximity, flexibility,\nsourcing skills and the multiple opportunities offered by Free Trade\nAgreements with the European Union, United States and Turkey.",
    "openai_summarised_points": [
      "• Textiles constitute a major industry within Morocco's economy, playing a significant role in the country's export sector.",
      "• The European Union serves as Morocco's primary client for textiles and clothing exports, highlighting the importance of this regional market.",
      "• France is a key importer within the EU, accounting for 46% of Morocco's hosiery exports, 28.5% of basic textile imports, and 27.6% of ready-to-wear clothing imports, as emphasized by the managing director of the Moroccan Export Development Center.",
      "• In 2007, Morocco's textile and clothing exports reached a total value of approximately $3.7 billion, demonstrating the sector's substantial contribution to national export revenues.",
      "• Saad Benabdallah attributed this export performance to several competitive advantages enjoyed by Morocco, including its geographical proximity to major markets, operational flexibility, strong sourcing capabilities, and the benefits derived from multiple Free Trade Agreements with the European Union, United States, and Turkey."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:30.439631",
      "openai_model": "gpt-4.1-mini",
      "content_length": 653,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Mining",
    "text": "The mining sector is one of the pillars of Morocco's economy. It represented a\nturnover of US$2.7 billion in 2005, including MAD 2.17 billion in exports and\n20% of energy consumption. It also employs about 39,000 people with an\nestimated MAD 571 million in salaries (2005). Morocco produces a number of\nminerals and metals, most importantly, phosphates, silver and\nlead.[1][_usurped_]\n\nMorocco possesses 75 percent of the world's phosphate reserves. It is the\nworld's first exporter (28% of the global market) and third producer (20% of\nglobal production). In 2005, Morocco produced 27.254 million tons of\nphosphates and 5.895 million tons of phosphate derivatives.[2][_usurped_]",
    "openai_summarised_points": [
      "• The mining sector is a fundamental component of Morocco's economy, generating a turnover of US$2.7 billion in 2005.",
      "• In 2005, the mining sector accounted for MAD 2.17 billion in exports and consumed 20% of the country's total energy.",
      "• The sector employed approximately 39,000 individuals in 2005, with total salaries estimated at MAD 571 million.",
      "• Morocco’s mineral production includes several key minerals and metals, with phosphates, silver, and lead being the most significant.",
      "• Morocco holds 75 percent of the world’s phosphate reserves, making it a dominant player in the global phosphate market.",
      "• The country is the world’s leading exporter of phosphates, supplying 28% of the global market.",
      "• Morocco ranks as the third-largest producer of phosphates worldwide, contributing 20% of global phosphate production.",
      "• In 2005, Morocco produced 27.254 million tons of phosphates and an additional 5.895 million tons of phosphate derivatives."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:36.684242",
      "openai_model": "gpt-4.1-mini",
      "content_length": 679,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Services",
    "text": "Services, including government and military expenditures, account for about\none-fourth of Morocco's GDP. Government spending accounts for fully half of\nthe service economy, despite an ongoing effort on the part of the government\nto sell much of its assets to private concerns. Since the mid-1980s tourism\nand associated services have been an increasingly significant sector of the\nMoroccan economy and by the late 1990s had become Morocco's largest source of\nforeign currency.\n\nDuring that time the Moroccan government committed significant resources – by\nway of loans and tax exemptions – to the development of the tourist industry\nand associated services. The government also made direct capital investments\nin the development of the service sector, but since the early 1990s it has\nbegun to divest itself of these properties. Several million visitors enter\nMorocco yearly, most of them from Europe. Tourists also arrive from Algeria,\nthe United States, and East Asia, mainly Japan.",
    "openai_summarised_points": [
      "• Services, including government and military expenditures, constitute approximately one-fourth of Morocco's Gross Domestic Product (GDP).",
      "• Government spending represents fully 50% of the service economy in Morocco, despite ongoing efforts by the government to privatize many of its assets.",
      "• Since the mid-1980s, tourism and related services have grown to become an increasingly significant sector within the Moroccan economy.",
      "• By the late 1990s, tourism had emerged as Morocco's largest source of foreign currency earnings.",
      "• The Moroccan government committed substantial resources to the development of the tourism industry and associated services, providing loans and tax exemptions to support growth in this sector.",
      "• In addition to financial incentives, the government made direct capital investments in the service sector's development.",
      "• Beginning in the early 1990s, the Moroccan government initiated a process of divesting itself of many service sector properties previously under its control.",
      "• Morocco receives several million visitors annually, with the majority originating from European countries.",
      "• Other notable sources of tourists include Algeria, the United States, and East Asia, particularly Japan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:41.819650",
      "openai_model": "gpt-4.1-mini",
      "content_length": 984,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Tourism",
    "text": "A view of Tangier Bay at sunset as seen from the Malabata suburb.\n\nMorocco is a major touristic destination. Tourism is thus a major contributor\nto both the economic output and the current account balance, as well as a main\njob provider. In 2008 8 million tourists have visited Morocco. Tourist\nreceipts in 2007 totalled US$7,55 billion. Morocco has developed an ambitious\nstrategy, dubbed \"Vision 2010\", aimed at attracting 10 million tourists by\n2010. This strategy provides for creating 160,000 beds, thus bringing the\nnational capacity to 230,000 beds. It also aims to create some 600,000 new\njobs.\n\nMarrakech continues to be the market leader, but the case of Fez, showing a\n20% increase of visitors in 2004, gives hope that better organisation can\nbring results in diversifying the sector as a whole. Like other regions, Fez\nhas its Centre Regional du Tourisme (CRT), a local tourism body which\ncoordinates the local industry and the authorities. Fez's plan involves a\nsubstantial restructuring of the old city and an upgrading of hotel capacity.\nImproved transport has brought the city into more direct contact with\npotential visitors. There are now direct flights from France, where previously\nit was necessary to change plane in Casablanca.\n\nThe \"Plan Azur\", is a large-scale project initiated by king Mohammed VI, is\nmeant to internationalise Morocco. The plan provides for creating six coastal\nresorts for holiday-home owners and tourists: five on the Atlantic coast and\none on the Mediterranean. The plan also includes other large-scale development\nprojects such as upgrading regional airports to attract budget airlines, and\nbuilding new train and road links.\n\nThus, Morocco achieved an 11% rise in tourism in the first five months of 2008\ncompared with the same period last year, it said, adding that French visitors\ntopped the list with 927,000 followed by Spaniards (587,000) and Britons\n(141,000). Morocco, which is close to Europe, has a mix of culture and the\nexotic that makes it popular with Europeans buying holiday homes.",
    "openai_summarised_points": [
      "• Morocco is a major touristic destination, with tourism being a significant contributor to the country’s economic output, current account balance, and employment.",
      "• In 2008, Morocco received 8 million tourists, demonstrating the sector’s substantial scale and importance.",
      "• Tourist receipts in 2007 amounted to US$7.55 billion, highlighting the financial impact of tourism on the Moroccan economy.",
      "• Morocco developed an ambitious tourism strategy called \"Vision 2010,\" aiming to attract 10 million tourists by the year 2010.",
      "• The \"Vision 2010\" strategy planned to create 160,000 new beds, increasing the national accommodation capacity to 230,000 beds.",
      "• The strategy also aimed to generate approximately 600,000 new jobs within the tourism sector.",
      "• Marrakech remains the leading market in Moroccan tourism, maintaining its dominant position in attracting visitors.",
      "• Fez experienced a 20% increase in visitors in 2004, indicating that improved organization and development can diversify Morocco’s tourism sector.",
      "• Fez’s tourism development is coordinated by the Centre Regional du Tourisme (CRT), a local tourism body that collaborates with industry stakeholders and authorities.",
      "• Fez’s tourism plan includes substantial restructuring of the old city and upgrading hotel capacity to enhance visitor experience.",
      "• Improved transport links, including the introduction of direct flights from France to Fez (previously requiring a transfer in Casablanca), have increased the city’s accessibility to tourists.",
      "• The \"Plan Azur,\" a large-scale project initiated by King Mohammed VI, aims to internationalize Morocco’s tourism appeal.",
      "• \"Plan Azur\" includes the creation of six coastal resorts designed for holiday-home owners and tourists, with five resorts located on the Atlantic coast and one on the Mediterranean coast.",
      "• The plan also encompasses upgrading regional airports to attract budget airlines and constructing new train and road infrastructure to improve connectivity.",
      "• Morocco recorded an 11% increase in tourism during the first five months of 2008 compared to the same period in the previous year.",
      "• French tourists were the largest group of visitors in early 2008, totaling 927,000, followed by 587,000 Spanish visitors and 141,000 British visitors.",
      "• Morocco’s proximity to Europe, combined with its unique cultural offerings and exotic appeal, makes it a popular destination for Europeans purchasing holiday homes."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:48.974133",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2044,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.2",
    "section_name": "Information technology",
    "text": "The IT sector generated a turnover of Dh7 billion ($910,000m) in 2007, which\nrepresented an 11% increase compared to 2006. The number of Moroccan internet\nsubscribers in 2007 amounted to 526,080, representing an increase of 31.6%\ncompared to the previous year and a 100% increase compared to 2005. The\nnational penetration for internet subscription remains low, even though it\nincreased from 0.38% in 2004 to 1.72% in 2007. Yet over 90% of subscribers\nhave a broadband ADSL connection, which is one of the highest ratios in the\nworld. The future of the Moroccan IT sector was laid out in Maroc 2006–12. The\nplan aims to increase the combined value of the telecoms and IT sector from\nDh24 billion ($3.1 billion) in 2004 to Dh60 billion ($7.8 billion) in 2012.\n\nWhile the telecoms sector remains the big earner, with Dh33 billion ($4.3\nbillion), the IT and off shore industries should generate Dh21 billion ($2.7\nbillion) each by 2012. In addition, the number of employees should increase\nfrom 40,000 to 125,000. The government hopes that adding more local content to\nthe internet will increase usage. There have also been efforts to add more\ncomputers to schools and universities. E-commerce is likely to take off in the\nnext few years, especially as the use of credit cards is gaining more ground\nin Morocco. Although computer and internet use have made a great leap forward\nin the past five years, the IT market still finds itself in infancy and offers\ngreat potential for further development.",
    "openai_summarised_points": [
      "• In 2007, Morocco's IT sector generated a turnover of Dh7 billion ($910 million), marking an 11% increase compared to 2006.",
      "• The number of Moroccan internet subscribers in 2007 reached 526,080, representing a 31.6% increase from the previous year and a 100% increase compared to 2005.",
      "• Despite growth, national internet subscription penetration remained low, rising from 0.38% in 2004 to 1.72% in 2007.",
      "• Over 90% of Moroccan internet subscribers had broadband ADSL connections in 2007, one of the highest ratios globally.",
      "• The strategic plan \"Maroc 2006–12\" was established to guide the future development of Morocco’s IT sector.",
      "• The Maroc 2006–12 plan aimed to increase the combined value of the telecoms and IT sectors from Dh24 billion ($3.1 billion) in 2004 to Dh60 billion ($7.8 billion) by 2012.",
      "• By 2012, the telecoms sector was projected to remain the largest revenue generator with Dh33 billion ($4.3 billion).",
      "• The IT and offshore industries were each expected to generate Dh21 billion ($2.7 billion) by 2012.",
      "• Employment in the IT and telecom sectors was anticipated to grow significantly, from 40,000 employees to 125,000 by 2012.",
      "• The Moroccan government aimed to increase internet usage by promoting more local content on the internet.",
      "• Initiatives were undertaken to increase the availability of computers in schools and universities to support IT development.",
      "• E-commerce was expected to expand in the coming years, supported by the growing use of credit cards in Morocco.",
      "• Despite significant advances in computer and internet use over the previous five years, Morocco’s IT market was still considered in its infancy with substantial potential for further growth."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:48:56.758583",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1494,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.3",
    "section_name": "Retail",
    "text": "The retail industry represents 12.8% of Morocco's GDP and 1.2m people – 13% of\nthe total workforce – are employed in the sector. Organised retail, however,\nrepresents only a fraction of domestic trade, as shoppers rely on the\ncountry's 1151 souks, markets and approximately 700,000 independent groceries\nand shops. The rapid emergence of a middle class – around 30% of the\npopulation – combined with a young and increasingly urban population and a\ncraving for international brands, is rapidly changing the ways Moroccans spend\ntheir money. Still average purchasing power remains low overall, forcing\nretailers to cater to a broad section of the population and to keep prices\nlow. Despite the challenges, the retail sector has strong growth potential.\nThe franchising segment will continue to grow, and while strong local brands\nare emerging, international brand names will continue to account for the\nbiggest percentage increase in the sector's turnover. Changing consumption\nhabits, increasing purchasing power and the growing number of tourists should\nboost the development of malls and luxury shopping. However, independent\nstores and markets should continue to account for most domestic trade in the\nforeseeable future.",
    "openai_summarised_points": [
      "• The retail industry in Morocco accounts for 12.8% of the country's Gross Domestic Product (GDP) and employs approximately 1.2 million people, representing 13% of the total workforce.",
      "• Organised retail constitutes only a small portion of Morocco's domestic trade, as consumers predominantly shop at 1,151 souks and markets, alongside roughly 700,000 independent groceries and shops.",
      "• The rapid growth of Morocco's middle class, which comprises about 30% of the population, coupled with a young, increasingly urban demographic and a strong demand for international brands, is significantly transforming consumer spending patterns.",
      "• Despite these demographic and social changes, the average purchasing power in Morocco remains relatively low, compelling retailers to serve a wide range of consumers and maintain low price points.",
      "• The retail sector in Morocco exhibits substantial growth potential, with the franchising segment expected to expand continuously.",
      "• While strong local brands are beginning to emerge within the retail market, international brand names are projected to contribute the largest percentage increase in the sector’s turnover.",
      "• Shifts in consumption habits, rising purchasing power, and an increasing number of tourists are anticipated to stimulate the growth of shopping malls and luxury retail outlets.",
      "• Nevertheless, independent stores and traditional markets are expected to continue dominating the majority of domestic trade in Morocco for the foreseeable future."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:49:03.515451",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1223,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.4",
    "section_name": "Offshoring",
    "text": "In 2009 Morocco was ranked among the top thirty countries in the offshoring\nsector. Morocco opened its doors to offshoring in July 2006, as one component\nof the development initiative Plan Emergence, and has so far attracted roughly\nhalf of the French-speaking call centres that have gone offshore so far and a\nnumber of the Spanish ones. According to experts, multinational companies are\nattracted by Morocco's geographical and cultural proximity to Europe, in\naddition to its time zone. In 2007 the country had about 200 call centres,\nincluding 30 of significant size, that employ a total of over 18,000 people.",
    "openai_summarised_points": [
      "• In 2009, Morocco was ranked among the top thirty countries globally in the offshoring sector, highlighting its emerging prominence in this industry.",
      "• Morocco officially opened its doors to offshoring in July 2006 as part of the broader economic development initiative known as Plan Emergence.",
      "• Since the inception of its offshoring strategy, Morocco has attracted approximately half of the French-speaking call centres that have relocated offshore, as well as a number of Spanish-speaking call centres.",
      "• Experts attribute the attractiveness of Morocco to multinational companies to its geographical and cultural proximity to Europe, which facilitates communication and business operations.",
      "• Additionally, Morocco’s time zone alignment with Europe is considered a significant advantage for companies seeking efficient coordination and service delivery.",
      "• By 2007, Morocco had established around 200 call centres, of which 30 were classified as being of significant size, collectively employing over 18,000 individuals."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:49:07.595339",
      "openai_model": "gpt-4.1-mini",
      "content_length": 613,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.5",
    "section_name": "Finance",
    "text": "The central bank of Morocco Bank Al-Maghrib\n\nIn 2007 the economic environment remained conducive to further growth of\nbanking activity in Morocco following a very good year for the sector in 2006.\nIn 2007 macroeconomic growth, excluding the agricultural sector, remained\nquite robust, providing the background for dynamic growth in banking credits.\nTotal assets of the banking sector increased by 21.6% to MAD 654.7 billion\n($85.1 billion), which is above the previous year's high annual growth rate of\n18.1%. The structure of the domestic sector has remained steady in the past\ntwo years, with the landscape dominated by three major local banks. The state\nhas started to remove itself from the domestic sector by surrendering part of\nits share capital in public banks. At end-2007 public capital still held\ncontrolling stakes in five banks and four financing companies. Meanwhile,\nforeign ownership in the local financial sector continues to grow, with\nforeign institutions controlling five banks and eight financing companies as\nwell as holding significant stakes in four banks and three financing\ncompanies.\n\nThe financial system, though robust, has to take on excessive quantities of\nlow risk-low return government debt at the expense of riskier, but more\nproductive private sector lending. This crowding–out of private sector\ninvestment reduces the profitability and growth incentives of the financial\nsector.\n\nFitch Ratings affirmed Morocco's long-term local and foreign issuer default\nratings of \"BBB−\" and \"BBB\", respectively, with a stable outlook. The credit\nrating agency attributed its classification in part to the \"relative\nresilience of Morocco's economy to the global economic downturn.\""
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.6",
    "section_name": "Insurance",
    "text": "The insurance sector in Morocco is witnessing dynamic growth, driven foremost\nby developments in life insurance, which has superseded motor insurance in the\npast two years as the leading segment of the market with around one-third of\ntotal premiums. Behind life and auto insurance, accident, work-related\naccident, fire and transport insurance were the largest contributors. Total\npremiums reached Dh17.7 billion ($2.3 billion) in 2007, ranking Morocco as one\nof the largest insurance markets in the Arab world behind Saudi Arabia and the\nUAE. The insurance penetration rate is 2.87% of GDP, while the insurance\ndensity is $69 per person.\n\nMore broadly, the Moroccan insurance sector is already consolidated, with five\nlarge players controlling the market. The sector is set to be opened up to\nforeign competition from 2010 onward, and the consolidation of insurance\ncompanies into larger entities should strengthen the local players to better\ncompete with eventual competition from foreign insurers. There is also the\npossibility that new insurance niches such as takaful (Islamic insurance) and\nmicroinsurance products will become part of the Moroccan market in the medium-\nterm, but they are unlikely to appear in the near future."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.7",
    "section_name": "Media and advertising",
    "text": "According to the Moroccan Advertisers Group, Dh3.9 billion ($507 million) was\nspent in 2007, a near-fourfold increase on the Dh1.1 billion ($143 million)\nspent in 2000. There is still room for growth, as the market remains\nunderdeveloped by international standards. Advertising expenditure represented\njust over 0.6% of GDP in 2007, compared with 1% in Egypt and 1.5% to 2% in EU\ncountries. Morocco's 10 biggest advertising spenders account for about 35% of\nthe total, with telecoms, consumer goods and services companies making up a\nlarge percentage of that amount.\n\nTelevision retained the lion's share of advertising expenditure, with 55% of\nabove-the-line advertising. In a 2006 poll, GAM found that 94% of its members\nused outdoor advertising, although 81% companied about problems, mainly caused\nby quality issues and delays. The potential for expansion is huge, and while\ntelecoms should remain the largest advertising segment, fast-growing sectors\nof the economy such as retail, automobile and real estate are providing\nadvertising companies with new opportunities."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.8",
    "section_name": "Communications",
    "text": "The telecoms sector increased in value from Dh25.6 billion ($3.3 billion) in\n2006 to Dh33.3 billion ($4.2 billion) in 2007. With a workforce of some 41,000\nemployees, the sector contributes 7% to annual GDP and is one of the country's\nleading recipients of foreign direct investment (FDI). Under the development\nplan, the sector should employ 125,000 people by 2012 and contribute 10% of\nGDP. With the penetration rates of 69.4% from mobile phones and 8.95% for\nfixed lines, the Moroccan telecoms industry is set to continue to grow. The\ncall centre industry – partially as a result of offshore initiatives, such as\nCasanearshore and Rabat Technoplis – will continue to expand. However, the\nworldwide call centre industry is highly competitive and education is the key\nto success if Morocco truly intends to become a leading international player\nin this industry."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.9",
    "section_name": "Telephone system",
    "text": "In the late 1980s and early 1990s, the government undertook a major expansion\nand modernization of the telecommunications system. This nearly quadrupled the\nnumber of internal telephone lines and greatly improved international\ncommunications. In 1996 the state-owned telecommunications industry was opened\nup to privatization by a new law that allowed private investment in the retail\nsector, while the state retained control of fixed assets. In 1998 the\ngovernment created Maroc Telecom (Ittiṣālāt al-Maghrib), which provides\ntelephone, cellular, and Internet service for the country. Satellite dishes\nare found on the roofs of houses in even the poorest neighbourhoods,\nsuggesting that Moroccans at every social and economic level have access to\nthe global telecommunications network. The Internet has made steady inroads in\nMorocco; major institutions have direct access to it, while private\nindividuals can connect via telecommunications \"boutiques\", a version of the\ncyber cafés found in many Western countries, and through home computers.\n\nMorocco has a good system composed of open-wire lines, cables, and microwave\nradio relay links. The internet is available. The principal switching centers\nare Casablanca and Rabat. The national network is nearly 100% digital using\nfiber-optic links. An improved rural service employs microwave radio relay.\nThe international system has seven submarine cables, three satellite earth\nstations, two Intelsat (over the Atlantic Ocean) and one Arabsat. There is a\nmicrowave radio relay to Gibraltar, Spain and the Western Sahara. Coaxial\ncables and microwave radio relays exist to Algeria. Morocco is a participant\nin Medarabtel and a fiber-optic cable links from Agadir to Algeria and\nTunisia.\n\n* Main lines in use: 3.28 million (2012) : estimation\n* Mobile cellular: 47.25 million [135% of the total population] (2015) : estimation\n* Internet users: 21.2 million [60.6% of the total population] (2014): estimation"
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.10",
    "section_name": "Radio",
    "text": "* AM stations: 25;\n* FM stations: 31;\n* Shortwave: 11 (2007);\n* Radio sets: 7.78 million (2007)."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.11",
    "section_name": "Broadband Internet access",
    "text": "Operated by Maroc Telecom. The service started as a test in November 2002\nbefore it was launched in October 2003. The service is offered by the\nsubsidiary Menara. As well as Inwi (also known as Wana Co.) and Meditel that\nturned into Orange."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.12",
    "section_name": "Equity markets",
    "text": "Privatization has stimulated activity on the Casablanca Stock Exchange (Bourse\nde Casablanca) notably through trade in shares of large former state-owned\noperation. Founded in 1929, it is one of the oldest stock exchanges in Africa,\nbut it came into reckoning after financial reforms in 1993, making it the\nthird largest in Africa. The stock market capitalisation of listed companies\nin Morocco was valued at $75,495 billion in 2007 by the World Bank. That is an\nincrease of 74% compared with the year 2005. Having weathered the global\nfinancial meltdown, the Casablanca Stock Exchange is stepping up to its\ncentral role of financing the Moroccan economy. Over the next few years, it\nseeks to double its number of listed companies and more than quadruple its\nnumber of investors."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.13",
    "section_name": "Fiscal policies",
    "text": "Morocco has made great progress toward fiscal consolidation in recent years,\nunder the combined effect of strong revenue performance and efforts to tackle\nexpenditure rigidities, notably the wage bill. The overall fiscal deficit\nshrank by more than 4 percentage points of GDP during the last four years,\nbringing the budget close to balance in 2007. However, the overall deficit is\nprojected to widen to 3.5 percent of GDP in 2008, driven by the upward surge\nin the fiscal cost of Morocco's universal subsidy scheme following the sharp\nincrease in world commodity and oil prices.\n\nFiscal policy decisions so far have been mostly discretionary, as there is no\nexplicit goal for fiscal policy. Looking forward, the question of a possible\nanchor for medium-term fiscal policy is worth exploring. Morocco's low social\nindicators and large infrastructure needs could justify an increase in social\nspending and public investment. Further, some nominal tax rates remain high by\ninternational standards, possibly warranting a lowering of some rates. At the\nsame time, the relatively high level of public debt remains a constraining\nfactor, particularly as heightened attractiveness to investors is a key\ncomponent of Morocco's strategy of deepening its integration in the global\neconomy.\n\nMorocco has made major progress in recent years to increase economic growth\nand strengthen the economy's resilience to shocks. The gains reflect sound\nmacroeconomic policies and sustained structural reforms, and are reflected in\nthe gradual improvement in living standards and per capita income."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.14",
    "section_name": "Debt management",
    "text": "The turnaround in the fiscal performance is particularly noteworthy. Around\nthe start of the 21st century, Morocco's overall deficit stood at 5.3 percent\nof GDP, and gross total government debt amounted to three-fourths of GDP. In\n2007, reflecting a strong improvement in revenue performance and moderate\ngrowth in expenditure, the budget was close to balanced. Under the combined\neffect of a prudent fiscal policy and sizeable privatization receipts, the\ntotal debt stock had shrunk by 20 percentage points, and now stands at a\nlittle over half of GDP. As a result, perceptions of Morocco's\ncreditworthiness have improved."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "6.15",
    "section_name": "Taxation",
    "text": "Tax revenues provide the largest part of the general budget. Taxes are levied\non individuals, corporations, goods and services, and tobacco and petroleum\nproducts."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "External trade",
    "text": "Morocco maintains strong trade relations with the European Union (EU), which\nremains its largest trading partner. In 2022, 56% of Morocco's exports were\ndirected to the EU, while 45% of its imports originated from the EU. The total\ntrade in goods between Morocco and the EU amounted to €53.3 billion that year.\nKey exports to the EU included transport equipment (23.5%), machinery and\nappliances (21.2%), and textiles (14.3%). In 2023, Morocco's primary export\ndestinations were Spain (22.5%), France (20.5%), Italy (5.2%), the United\nKingdom (4.5%), and Germany (4.3%). On the import side, the main suppliers\nwere Spain (15.7%), China (10.6%), France (10.6%), the United States (8.4%),\nand Türkiye (5.1%).\n\nThe country's trade deficit narrowed by 7.3% in 2023, reaching 286 billion\ndirhams ($28.6 billion). This improvement was attributed to a 2.5% decrease in\nimports, totaling 715 billion dirhams, and a slight increase in exports to 429\nbillion dirhams. Notably, energy imports declined by 20.4% to 122 billion\ndirhams, while automotive sector exports surged by over 27% to a record 141\nbillion dirhams. Tourism revenues also reached new heights, increasing by\n11.7% to 104 billion dirhams, supported by a record 14.5 million visitors.\nRemittances from Moroccans abroad contributed significantly, rising by 4% to\n115 billion dirhams. However, in 2024, the trade deficit increased by 7.3% to\n306.47 billion dirhams, driven by a 6.4% rise in imports to 761.45 billion\ndirhams and a 5.8% increase in exports to 454.97 billion dirhams. The growth\nin exports was mainly propelled by the aerospace sector (14.9%), phosphates\nand derivatives (13.1%), the automotive industry (6.3%), and the agriculture\nand agri-food sector (3.1%).\n\nThe EU-Morocco Association Agreement, signed in 1996 and effective from 2000,\naims to establish a free trade area and strengthen economic ties within the\nframework of the Barcelona Process. Morocco has also entered into free trade\nagreements with the United States (effective from 2006), the Agadir Agreement\nwith Egypt, Jordan, and Tunisia, and a free trade agreement with Türkiye.\nAdditionally, Morocco acceded to the Regional Convention on pan-Euro-\nMediterranean preferential rules of origin in 2012, facilitating regional\nintegration and trade."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Investment",
    "text": "A graph by the World Bank showing an increase in remittances sent by overseas\nMoroccans.\n\nMorocco has become an attractive destination for European investors thanks to\nits relocation sites \"Casashore\" and \"Rabatshore\", and to the very rapid cost\nescalation in Eastern Europe. The offshoring sector in Morocco is of great\nimportance as it creates high-level jobs that are generally accompanied by an\ninflux of Moroccan immigrants. Noting however that human resources remain the\nmajor concern for companies seeking to gain a foothold in Morocco. In this\nregard, it has been deemed an important decision of the Moroccan government to\naccelerate training in the required disciplines.\n\nIn a bid to promote foreign investments, Morocco in 2007 adopted a series of\nmeasures and legal provisions to simplify procedures and secure appropriate\nconditions for projects launching and completing. Foreign trade minister,\nAbdellatif Maazouz cited that these measures include financial incentives and\ntax exemptions provided for in the investment code and the regional investment\ncentres established to accompany projects. These measures combined with\nactions carried out by the Hassan II Fund for Development increased foreign\ninvestments in Morocco by $544.7 million in 2007. 20% of these investments\ncame from Islamic countries.\n\nMoroccan officials have heralded a significant increase in the amount of money\nMoroccan expatriates are sending home. Government efforts are underway to\nencourage Moroccans living abroad to increase their investments at home, and\nto allay concerns about bureaucracy and corruption. With money sent home by\nMoroccan migrants reaching $5.7 billion in 2007, Morocco came in second,\nbehind Egypt, on the recent World Bank list of the top 10 MENA remittance\nrecipient countries. Neighbouring Algeria ($2.9 billion) came in at number\nfive. According to the World Bank, remittances constituted 6.4% of GDP in\nMorocco in 2020 and amounted to more than $7.4 billion. Despite the COVID-19\npandemic, remittances from Moroccans residing abroad continued in an upward\ntrend.\n\nThe European Investment Bank started making investments in Morocco in 1979,\nand has since invested €9.6 billion since then, including €2.5 billion since\n2017."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "Foreign direct investment",
    "text": "Foreign Direct Investments in Morocco grew to $2.57 billion in 2007 from $2.4\nbillion a year earlier to position the country in the fourth rank in Africa\namong FDI recipients, according to the United Nations Conference on Trade and\nDevelopment. Although other studies have shown much higher figures.\nExpectations for 2008 were promising noting that 72 projects were approved for\na global amount of $9.28 billion. These were due to open 40,023 direct and\nstable job opportunities. However, keeping with the global trend, FDI dropped\n29% to €2.4 billion in 2008, the first decline since 2004.\n\nWhile the recovery of pre-crisis levels very much hinges on the health of the\nglobal economy, Morocco has made steps towards becoming a more attractive FDI\ndestination, according to the World Bank's Doing Business 2010 report, ranking\nsecond in North African neighbours. The majority of FDI continues to derive\nfrom the EU, specifically France. Morocco is also a source of foreign\ninvestments. In 2007, it has injected $652 million in projects abroad, which\nput Morocco in the third position in Africa."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Investment by country",
    "text": "Most of the FDIs injected in Morocco came from the European Union with France,\nthe major economic partner of the North African kingdom, topping the list with\ninvestments worth $1.86 billion, followed by Spain ($783 million), the report\nsaid. The influx of European countries in Morocco's FDI represents 73.5% of\nthe global amount received in 2007. 19.3% of the investments came from Arab\ncountries, whose share in Morocco's FDI showed a marked rise, as they only\nrepresented 9.9% of the entire FDIs in 2006. A number of Arab countries,\nmainly from the Persian Gulf region are involved in large-scale projects in\nMorocco, including the giant Tanger Med port on the Mediterranean. Morocco\nremains the preferred destination of foreign investors in the Maghreb region\n(Algeria, Libya, Mauritania, Morocco and Tunisia), with a total of $13.6\nbillion between 2001 and 2007, which puts it largely on the top of the list."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "Investment by sector",
    "text": "In terms of sectors, tourism has the biggest share of investment with $1.55\nbillion, that is 33% of the total FDIs, followed by the real estate sector and\nthe industrial sector, with respectively $930 million and $374 million.\nMoroccan expatriates' share of the FDI stood at $92 million in 2007, up from\n$57 million in 2006, and they touch mainly the sectors of real estate, tourism\nand catering, according to the report."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Science and technology",
    "text": "The national system of scientific and technical research is guided by\ndifferent elements, such as the pronouncements of the king, reports of special\ncommissions, five-year plans, and the creation of a special programme for the\nsupport of research. The Moroccan government's Five-Year Plan for 2000–2004\narticulated the priority lines for research. The declared objectives of this\nplan were to align S&T research with socio-economic development priorities.\nSectors declared as priority areas were: agriculture, health fisheries,\ndrinking water, geology, mining, energy, environment, information and\ntelecommunications technologies, and transport.\n\nThis approach highlighted the need for effective institutional coordination,\nwhich enabled different parties to work together around common priority\nsocioeconomic objectives. The private sector is the least active player in\nresearch activity in Morocco. The REMINEX Corporation (Research on Mines and\nExploitation) is the most prominent research performer in the private sector,\nand is a subsidiary of Omnium Nord Africain, the largest privately owned\nmining group in Morocco. The most recent figures available on the number of\nresearch staff in Morocco are those provided by the Ministry of National\nEducation, Higher Education, Professional Training and Scientific Research in\nits 2002–2003 annual report. According to this report, Morocco had 17 390\nresearch staff in 2002–2003. The majority (58%) were employed in the\nuniversity sector.\n\nResearch institutions include the Scientific Institute, founded in 1920 in\nRabat, which does fundamental research in the natural sciences, and the\nScientific Institute of Maritime Fishing, founded in 1947, in Casablanca,\nwhich studies oceanography, marine biology, and topics related to development\nof the fishing industry. Nine universities and colleges offer degrees in basic\nand applied sciences. In 1987–97, science and engineering students accounted\nfor 41% of college and university enrollments."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Economy of Western Sahara",
    "text": "Fishing and phosphate mining are the main activities in Moroccan-administered\nWestern Sahara. Fruits and vegetables are grown in the few oases, while\nnomadic herders keep camels, sheep and goats."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Development of the Northern Region",
    "text": "Historically, the Casablanca-Rabat axis has been more prosperous and has\nreceived more government attention than the predominantly mountainous northern\nprovinces and the Western Sahara region. Although the latter region has\nreceived government attention since the 1990s because of its phosphate\ndeposits, the northern provinces, which include the Rif Mountains, home to 6\nmillion Moroccans, had been largely neglected. The uneven development among\nMorocco's regions fueled a cycle of rural-urban migration that has shown no\nsigns of slowing down.\n\nIn 1998, the government launched a program to develop the northern region,\nlargely with international help. Spain had shown particular interest in the\ndevelopment of the region, because its underdevelopment has fueled illegal\nimmigration and drug trafficking across the Strait of Gibraltar.\n\nWhen king Hassan II passed on, his son, Mohammed VI, made it his duty to\ndevelop the Northern Region, and especially its biggest city, Tangier.\n\nThe state-owned railway company will engage some $755 million in investment in\nthe northern region, including building a railway line between Tangier and\nTangier-Med port (43 km), improving the Tangier-Casablanca railway line and\nmodernizing many train stations over the next few years."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "11.1",
    "section_name": "Tangier",
    "text": "Before 1956, Tangier was a city with international status. It had a great\nimage and attracted many artists. After Morocco regained control over Tangier,\nthis attention slacked off. Investment was low and the city lost its economic\nimportance. But when Mohammed VI became king in 1999, he developed a plan for\nthe economic revival of Tangier. New developments include a new airport\nterminal, a soccer stadium with seating for 45,000 spectators, a high-speed\ntrain line and a new highway to connect the city with Casablanca.\nAdditionally, a new train station was constructed, called Tanger-Ville.\n\nThe creation of a free economic zone increased the economic output of the city\nsignificantly. It allowed Tangier to become an industrial pillar of the\ncountry. But the biggest investment was the creation of the new port Tanger-\nMed. It is the largest port in Africa and on the Mediterranean. The city is\nundergoing an economic boom. This increased the need for a commercial\ndistrict, Tangier City Center, which was inaugurated in 2016. In 2012, the\nRenault Tanger Méditerranée automobile plant was opened, with an annual\nproduction over 250,000 units."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Infrastructure",
    "text": "Mohammed VI bridge, longest suspended bridge in Africa Newly built road part\nof the development program for the southern provinces Al Boraq RGV2N2 high-\nspeed trainset at Tanger Ville railway station in November 2018 Tanger-Med\nport\n\nAccording to the Global Competitiveness Report of 2019, Morocco Ranked 16th in\nthe world in terms of Roads, 16th in Sea, 45th in Air and 64th in Railways.\nThis gives Morocco the best infrastructure rankings in the African continent.\n\nModern infrastructure development, such as ports, airports, and rail links, is\na top government priority. To meet the growing domestic demand, the Moroccan\ngovernment invested more than $15 billion from 2010 to 2015 in upgrading its\nbasic infrastructure.\n\nMorocco has one of the best road systems on the continent. Over the past 20\nyears, the government has built approximately 1770 kilometers of modern roads,\nconnecting most major cities via toll expressways. The Moroccan Ministry of\nEquipment, Transport, Logistics, and Water aims to build an additional 3380\nkilometers of expressway and 2100 kilometers of highway by 2030, at an\nexpected cost of $9.6 billion. While focusing on linking the southern\nprovinces notably the cities of Laayoune and Dakhla to the rest of Morocco.\n\nIn 2014, Morocco began the construction of the second high-speed railway\nsystem in Africa linking the cities of Tangiers and Casablanca. It was\ninaugurated in 2018 by the King following over a decade of planning and\nconstruction by Moroccan national railway company ONCF. It is the first phase\nof what is planned to eventually be a 1,500 kilometres (930 mi) high-speed\nrail network in Morocco. an extension of the line to Marrakesh is already\nbeing planned.\n\nMorocco also has the largest port in Africa and the Mediterranean called\nTanger-Med, which is ranked the 18th in the world with a handling capacity of\nover 9 million containers. It is situated in the Tangiers free economic zone\nand serves as a logistics hub for Africa and the world."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "13",
    "section_name": "Economic inequality",
    "text": "The growth pace that the Moroccan economy witnessed since the beginning of the\n1998–2007 decade has generated significant progress in terms of national\nincome, employment and living standards. However, the results obtained show\nconsiderable disparities in terms of the distribution of the fruit of this\ngrowth, whether between the production factors, the socio-economic groups or\nthe urban and rural areas. In fact, the national income grew at an average\nannual rate of 5.5% during the 1998–2007 decade. This improvement in the\nnational income however seems to be insufficient to face up to the\ndiscrepancies in terms of living standards and the scale of deficits at the\nsocial level.\n\nThe real income of the population registered, during the last 10 years, an\nannual increase of 2.5%, taking into consideration the fluctuations relating\nthe climatic conditions, which mainly affect the most vulnerable populations\nand their living standards. The national survey on Moroccans' living standards\nshows that the part of the most well off (10% of the population) in the\noverall consumption expenses in 2001 reached 12 times that of the most\ndisadvantaged population (10%). Despite the fact that these disparities tend\nto decrease in urban areas, these data show the importance of the efforts\nneeded to overcome this situation."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "14",
    "section_name": "Labour",
    "text": "Roughly one-third of the population is employed in agriculture, another one-\nthird make their living in mining, manufacturing, and construction, and the\nremainder are occupied in the trade, finance, and service sectors. Not\nincluded in these estimates is a large informal economy of street vendors,\ndomestic workers, and other underemployed and poorly paid individuals. High\nunemployment is a problem; the official figure is roughly one-tenth of the\nworkforce, but unofficial estimates are much higher, and—in a pattern typical\nof most Middle Eastern and North African countries—unemployment among\nuniversity graduates holding nontechnical degrees is especially high. Several\ntrade unions exist in the country; the largest of these, with nearly 700,000\nmembers, is L'Union Marocaine du Travail, which is affiliated with the\nInternational Confederation of Free Trade Unions."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "14.1",
    "section_name": "Unemployment",
    "text": "Morocco's unemployment rate, long a cause for concern, has been dropping\nsteadily in 2008, on the back of job growth in services and construction.\nFurther institutional reforms to bolster competitiveness and financial\nopenness are expected to help the trend to continue.\n\nOn the whole, the growth rate of the economy will not reduce the unemployment\nrate significantly, also taking account of the constant rise in the number of\nfirst entrants on the labour market. The growth level of the last five years\ndid, however, reduce urban unemployment from 22% in 1999 to 18.3% in 2005, and\nthe national rate from 13.9% in 1999 to 10.8% in 2005. The State High Planning\nCommission that Morocco's official unemployment rate dropped to 9.1% in Q2\n2008, down from 9.6% in Q1. This leaves Morocco with some 1.03m unemployed,\ncompared to 1.06m at the end of March. Unemployment stood at 9.8% at the end\nof 2007, up 0.1% from the end of 2006.\n\nUrban areas saw particularly strong job growth, and the services and\nconstruction sectors were the two leading drivers of job creation. Services\ngenerated some 152,000 new jobs, with the business process outsourcing (BPO)\nand telecoms sector proving particularly dynamic. Meanwhile, government\ninfrastructure projects, as well as heavy private investment in real estate\nand tourism helped boost the construction sector, which created 80,000 new\njobs in the second quarter of 2008.\n\nEvidently, this trend of falling unemployment rates is a positive one.\nJoblessness has long been a cause for serious concern in North Africa. Morocco\nhas a lower rate than its Maghreb neighbours—Tunisia has a rate of around\n13.9%, and in Algeria it is around 12.3%—but the issue is still a pressing\none, both for economic and for social reasons. A 2006 government report\nsuggested that the country needed a net increase of 400,000 jobs annually for\nthe next two decades in order to provide enough employment for its people,\ngiven the underlying demographic dynamic.\n\nMoreover, with Spanish construction firms facing much harder times, Morocco\nmay soon face the additional challenge of workers returning from across the\nGibraltar Straits, potentially putting further pressure on the authorities to\ncreate jobs.\n\nWith 30.5% of Morocco's population of 34.3m aged 14 or younger, according to\nthe CIA, job creation for youths is one of the government's major priorities.\n2007 data indicate that 17.6% of those in the 15–24 age group are unemployed.\nThis rises to around one third in urban areas—rural communities often employ\nthe young in agriculture, including on the family farm, as soon as they leave\nschool, contributing to relatively high youth employment rates (lower levels\nof official unemployment registration are also a factor)."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "14.2",
    "section_name": "Child labour",
    "text": "A 2010 report estimates about 150,000 children aged between 5 and 14 were\nworking in Morocco. Agriculture and domestic services are the predominant\nemployers. Young girls, locally called as _petites bonnes_ (little maids), are\nsent to work as live in domestic servants, many aged 10 or less. These\n_petites bonnes_ come from very poor families, face conditions of involuntary\nservitude, including long hours without breaks, absence of holidays, physical,\nverbal and sexual abuse, withheld wages and even restrictions on their\nmovement. They are denied education.\n\nMore visible forms of child labour includes street children in Casablanca,\nMarrakech, Fès and Mèknes. These children survive by selling cigarettes,\nbegging, shining shoes, washing cars and working as porters and packers in\nports.\n\nThe Ministry of Planning in Morocco estimates that there are between 60,000\nand 100,000 _petites bonnes_ in the country. Studies commissioned by the\nMorocco government finds poverty and lack of school, often in combination, are\nprimary causes of the little maids phenomenon in Morocco. Additionally, rural\nparents do not believe that an education or a diploma of any sort can help\ntheir girls find a job."
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "15",
    "section_name": "Energy",
    "text": "Morocco has very few reserves of its own and has been affected by the high oil\nprices of 2007 and early 2008. The country has to import 96% of its energy\nrequirements and the national oil bill for the first quarter of 2008 was $1.1\nbillion—69% higher than for the same period in 2007. According to the\nInternational Energy Agency (IEA) report 2014, Morocco is highly dependent on\nimported energy with over 91% of energy supplied coming from abroad. Morocco\nis working to diversify its energy sources, especially to develop renewable\nenergy, with a particular focus on wind energy. Solar power and nuclear energy\nare also part of the strategy, but development of the former has been slow and\nthere has been minimal progress on the latter, aside from an announcement of\ncollaboration with France in 2007.\n\nIn November 2009 Morocco announced a solar energy project worth $9 billion\nwhich officials said will account for 38 percent of the North African\ncountry's installed power generation by 2020. Funding would be from a mix of\nprivate and state capital. The ceremony was attended by U.S. Secretary of\nState Hillary Clinton and the Moroccan king. The project will involve five\nsolar power generation sites across Morocco and will produce 2,000 megawatts\nof electricity by 2020. Germany has expressed its willingness to participate\nin the development of Morocco's solar energy project which the country has\ndecided to carry out, as did the World Bank. Germany will also take part in\nthe development of a water-desalination plant.\n\nThe government plans to reorganise its subsidy system, which is a heavy burden\non government finances. In the short term these subsidies are helping to ease\nthe burden but they cannot keep rising indefinitely, and sooner or later the\nload will have to be shared out. In the short term, national consumption per\ncapita is expected to rise from the current level of 0.4 tonnes of oil\nequivalent (toe) to as much as 0.90 toe in 2030, a good indication of\ndevelopment, but a massive challenge as well. The input of renewable energy is\na matter of particular importance.\n\nAccording to a 2006 estimate by the Oil and Gas Journal (OGJ), Morocco has\nproven oil reserves of 1,070,000 barrels (170,000 m3) and natural gas reserves\nof 60 billion cubic feet (1.7×109 m3). Morocco may have additional hydrocarbon\nreserves, as many of the country's sedimentary basins have not yet been\nexplored. The Moroccan Office of Hydrocarbons and Mining (ONHYM) has become\noptimistic about finding additional reserves—particularly offshore—following\ndiscoveries in neighboring Mauritania.\n\nRecent activity in Western Sahara, which is believed to contain viable\nhydrocarbon reserves, has been controversial. In 2001, Morocco granted\nexploration contracts to TotalEnergies and Kerr-McGee, angering Premier Oil\nand Sterling Energy, which previously had obtained licenses from the Polisario\ngovernment. In 2005, the government-in-exile of the Western Sahara invited\nforeign companies to bid on 12 contracts for offshore exploration, with hopes\nof awarding production sharing contracts by the end of 2005.[_citation\nneeded_]\n\nTotal energy consumption in Terrawatt-hours (TWh)  1970  | 1980  | 1990  | 2000  | 2010  | 2020  | 2023\n---|---|---|---|---|---|---\n30  | 61  | 83  | 117  | 195  | 243  | 271\n| Per capita consumption in Kilowatt-hours (KWh)\n1,989  | 3,088  | 3,368  | 4,114  | 6,005  | 6,611  | 7,169"
  },
  {
    "chapter_name": "Economy of Morocco",
    "chapter_id": "1",
    "section_number": "16",
    "section_name": "Environment",
    "text": "The shift to an environment-conscious approach in Morocco has brought about\nscores of investment opportunities, most being in the utility and renewable\nenergy industries. In addition to the rise in sales of photovoltaic panels,\nthe business of wind turbines is also surging despite soaring prices on\ninternational markets because of the growing demand. To work towards a\nprogramme of sustainable development, a number of technological updates need\nto be made, including improvements to automobiles, the quality of energy\nproducts and increasing the number of renewable energy-producing plants. The\ngovernment also needs to promote water conservation and efficiency in order to\nprevent further scarcity. Despite these challenges, Morocco is working to\nconserve and protect its environment and its efforts were recognised when its\nMohammed VI Foundation for Environment won the environmental prize National\nEnergy Globe Award in Brussels in 2007.\n\nWhile Morocco is already a model of water management in the MENA region,\nupgrades to its water system under the National Wastewater Management\nProgramme should further improve wastewater treatment and maximise efficient\nwater usage. Authorities are promoting better water rationalisation in\nagriculture, which uses 80% of water resources, by replacing existing\nirrigation systems with micro- irrigation and drip networks. A net energy\nimporter, Morocco launched the National Renewable Energy and Efficiency Plan\nin February 2008 to develop alternative energy to meet 15% of its domestic\nneeds and increase the use of energy-saving methods. It is expected to create\nmore than 40,000 jobs and stimulate over €4.5 billion in investment by 2020.\nThe National Plan for the Development of Solar Thermal Energy, formulated in\n2001, aims to install 440,000 solar-powered water heaters by 2012, of which\n235,000 are completed.\n\nIn May 2009, the World Bank approved a €121m loan to help finance the\nimplementation of Morocco's solid-waste management programme, which targets a\n90% waste disposal rate for urban areas by 2021. The government is taking\nmeasures to mitigate the harmful effects of tourism on Morocco's natural\nresources, while increasing incentives for a growing niche of ecotourism\nprojects. As of January 2008, hotels with good environmental practices will\nreceive a Green Key label as part of a programme by the Mohammed VI Foundation\nfor the Protection of the Environment. Under a ten-year plan for the\nprotection of natural resources, 40,000 to 50,000 ha of forests are replanted\nannually with indigenous palm trees."
  }
]