[
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Guinea-Bissau** comprises a mixture of state-owned and\nprivate companies. Guinea-Bissau is among the world's least developed nations\nand one of the 10 poorest countries in the world, and depends mainly on\nagriculture and fishing. Cashew crops have increased remarkably in recent\nyears, and the country ranked ninth in cashew production for the year 2019.\n\nGuinea-Bissau exports to Asia non-fillet frozen fish and seafood, peanuts,\npalm kernels, and timber. License fees for fishing in their sea-zone (Gulf of\nGuinea) provide the government with some small revenue. Rice is the major crop\nand staple food. Due to European regulations, fish and cashew-nuts exports to\nEurope are totally prohibited as well as agriculture products in general.",
    "openai_summarised_points": [
      "• The economy of Guinea-Bissau consists of a combination of state-owned enterprises and private companies.",
      "• Guinea-Bissau is classified as one of the world's least developed nations and ranks among the 10 poorest countries globally.",
      "• The country's economy primarily relies on agriculture and fishing activities.",
      "• Cashew crop production has experienced significant growth in recent years, contributing notably to the economy.",
      "• In 2019, Guinea-Bissau ranked ninth in global cashew nut production.",
      "• The country's exports to Asia include non-fillet frozen fish and seafood, peanuts, palm kernels, and timber.",
      "• The government derives some revenue from license fees paid for fishing rights within Guinea-Bissau's maritime zone, located in the Gulf of Guinea.",
      "• Rice is the main crop cultivated in Guinea-Bissau and serves as the staple food for its population.",
      "• European regulations have led to a complete ban on exports of fish and cashew nuts to Europe, along with a general prohibition on agricultural exports to European markets."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:18:46.537716",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 756,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Early colonialism",
    "text": "The flag of the Guinea Company, a Portuguese company that traded in several\ncommodities and slaves around the Guinea coast from the 15th century.\n\nFrom a European viewpoint, the economic history of the Guinea Coast is largely\nassociated with slavery. Indeed, one of the alternative names for the region\nwas the Slave Coast. When the Portuguese first sailed down the Atlantic coast\nof Africa in the 1430s, they were interested in gold. Ever since Mansa Musa,\nking of the Mali Empire, made his pilgrimage to Mecca in 1325, with 500 slaves\nand 100 camels (each carrying gold) the region had become synonymous with such\nwealth. The trade from sub-Saharan Africa was controlled by the Islamic Empire\nwhich stretched along Africa's northern coast. Muslim trade routes across the\nSahara, which had existed for centuries, involved salt, kola, textiles, fish,\ngrain and slaves.\n\nAs the Portuguese extended their influence around the coast, Mauritania,\nSenegambia (by 1445) and Guinea, they created trading posts. Rather than\nbecoming direct competitors to the Muslim merchants, the expanding market\nopportunities in Europe and the Mediterranean resulted in increased trade\nacross the Sahara. In addition, the Portuguese merchants gained access to the\ninterior via the Sénégal and Gambia rivers which bisected long-standing trans-\nSaharan routes.\n\nThe Portuguese brought in copper ware, cloth, tools, wine and horses. Trade\ngoods soon also included arms and ammunition. In exchange, the Portuguese\nreceived gold (transported from mines of the Akan deposits), pepper (a trade\nwhich lasted until Vasco da Gama reached India in 1498) and ivory.\n\nThere was a very small market for African slaves as domestic workers in\nEurope, and as workers on the sugar plantations of the Mediterranean. The\nPortuguese found they could make considerable amounts of gold transporting\nslaves from one trading post to another, along the Atlantic coast of Africa.\nMuslim merchants had a high demand for slaves, which were used as porters on\nthe trans-Saharan routes, and for sale in the Islamic Empire. The Portuguese\nfound Muslim merchants entrenched along the African coast as far as the Bight\nof Benin.\n\nBefore the arrival of the Europeans, the African slave trade, centuries old in\nAfrica, was not yet the major feature of the coastal economy of Guinea. The\nexpansion of trade occurs after the Portuguese reach this region in 1446,\nbringing great wealth to several local slave trading tribes. The Portuguese\nused slave labour to colonize and develop the previously uninhabited Cape\nVerde islands where they founded settlements and grew cotton and indigo. They\nthen traded these goods, in the estuary of the Geba River, for black slaves\ncaptured by other black peoples in local African wars and raids.\n\nThe slaves were sold in Europe and, from the 16th century, in the Americas.\nThe Company of Guinea was a Portuguese governative institution whose task was\nto deal with the spices and to fix the prices of the goods. It was called\n_Casa da Guiné_ , _Casa da Guiné e Mina_ from 1482 to 1483 and _Casa da Índia\ne da Guiné_ in 1499. The local African rulers in Guinea, who prosper greatly\nfrom the slave trade, have no interest in allowing the Europeans any further\ninland than the fortified coastal settlements where the trading takes place.\nThe Portuguese presence in Guinea was therefore largely limited to the port of\nBissau.",
    "openai_summarised_points": [
      "• The flag of the Guinea Company, a Portuguese enterprise, symbolized their trade activities in various commodities and slaves along the Guinea coast starting from the 15th century.",
      "• The economic history of the Guinea Coast from a European perspective is predominantly linked to the transatlantic and trans-Saharan slave trade, with the region historically known as the Slave Coast.",
      "• Portuguese exploration along the Atlantic coast of Africa began in the 1430s, initially driven by the pursuit of gold.",
      "• The region gained prominence for wealth following Mansa Musa’s 1325 pilgrimage to Mecca, during which he traveled with 500 slaves and 100 camels carrying gold, establishing the area’s association with immense wealth.",
      "• The sub-Saharan African trade was controlled by the Islamic Empire, which extended along Africa’s northern coast, facilitating trade routes across the Sahara that involved salt, kola nuts, textiles, fish, grain, and slaves.",
      "• As Portuguese influence expanded along the coast—reaching Mauritania, Senegambia (by 1445), and Guinea—they established trading posts without directly competing with Muslim merchants; instead, increased European and Mediterranean trade created additional opportunities across the Sahara.",
      "• Portuguese traders gained access to inland regions via the Sénégal and Gambia rivers, which intersected long-standing trans-Saharan trade routes.",
      "• Portuguese trade goods included copper ware, cloth, tools, wine, horses, arms, and ammunition.",
      "• In exchange, the Portuguese obtained gold (from mines in the Akan deposits), pepper (a trade that continued until Vasco da Gama’s voyage to India in 1498), and ivory.",
      "• There was limited demand for African slaves in Europe as domestic workers and on Mediterranean sugar plantations; however, transporting slaves along the Atlantic coast proved lucrative for the Portuguese.",
      "• Muslim merchants had a high demand for slaves, used as porters on trans-Saharan routes and for sale within the Islamic Empire, with Muslim traders established along the African coast as far south as the Bight of Benin.",
      "• Prior to European contact, the African slave trade was not a dominant feature of Guinea’s coastal economy; it expanded significantly after the Portuguese arrived in 1446, bringing wealth to local slave-trading tribes.",
      "• The Portuguese utilized slave labor to develop and colonize the uninhabited Cape Verde islands, establishing settlements and cultivating cotton and indigo, which they traded at the Geba River estuary for slaves captured through local African wars and raids.",
      "• Slaves were sold in Europe and, from the 16th century onward, in the Americas.",
      "• The Company of Guinea, a Portuguese government institution, was responsible for managing spice trade and regulating the prices of goods; it was known as _Casa da Guiné_, _Casa da Guiné e Mina_ (1482–1483), and _Casa da Índia e da Guiné_ (1499).",
      "• Local African rulers in Guinea, who profited greatly from the slave trade, limited European inland penetration, restricting Portuguese presence largely to the fortified port of Bissau."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:18:57.048306",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3396,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Colonial era",
    "text": "As with the other Portuguese territories in mainland Africa (Portuguese Angola\nand Portuguese Mozambique), Portugal exercised control over the coastal areas\nof Portuguese Guinea when first laying claim to the whole region as a colony.\nFor three decades there are costly and continuous campaigns to suppress the\nlocal African rulers. By 1915 this process was complete, enabling Portuguese\ncolonial rule to progress in a relatively unruffled state - until the\nemergence of nationalist movements all over Africa in the 1950s.\n\nFor a brief period in the 1790s the British attempted to establish a rival\nfoothold on an offshore island, at Bolama, but by the 19th century the\nPortuguese were sufficiently secure in Bissau to regard the neighbouring\ncoastline as their own special territory. It was therefore natural for\nPortugal to lay claim to this region, soon to be known as Portuguese Guinea,\nwhen the European scramble for Africa began in the 1880s. Britain's interest\nin the region declined since the end of the British slave trade in 1807. After\nthe abolition of slavery in the Portuguese overseas territories in the 1830s,\nthe slave trade went into serious decline.\n\nPortugal's main rivals were the French, their colonial neighbours along the\ncoast on both sides - in Senegal and in the region which became French Guinea.\nThe Portuguese presence in Guinea was not disputed by the French. The only\npoint at issue was the precise line of the borders. This was established by\nagreement between the two colonial powers in two series of negotiations, in\n1886 and 1902–5. Until the end of the 19th century, rubber was the main\nexport.",
    "openai_summarised_points": [
      "• During the colonial era, Portugal exercised control over the coastal areas of Portuguese Guinea, similar to other Portuguese territories in mainland Africa such as Angola and Mozambique, initially claiming the entire region as a colony.",
      "• Portuguese efforts to establish dominance involved costly and continuous campaigns spanning three decades aimed at suppressing local African rulers, a process completed by 1915.",
      "• By 1915, the suppression of local rulers allowed Portuguese colonial rule to proceed relatively smoothly until the rise of African nationalist movements in the 1950s.",
      "• In the 1790s, the British briefly attempted to establish a presence on an offshore island at Bolama, but by the 19th century, the Portuguese had secured control over Bissau and regarded the neighboring coastline as their exclusive territory.",
      "• Portugal formally claimed the region as Portuguese Guinea during the European scramble for Africa in the 1880s, asserting sovereignty over the territory.",
      "• Britain's interest in the region declined after the end of the British slave trade in 1807, and following the abolition of slavery in Portuguese overseas territories in the 1830s, the transatlantic slave trade significantly diminished.",
      "• Portugal's main colonial rivals in the region were France, with neighboring colonies along the coast in Senegal and what became French Guinea; however, the French did not dispute Portuguese presence in Guinea.",
      "• The primary point of contention between Portugal and France was the precise delineation of borders, which was resolved through negotiations in two series of agreements: one in 1886 and another between 1902 and 1905.",
      "• Until the late 19th century, the main export from Portuguese Guinea was rubber, which constituted the primary economic activity during that period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:19:02.817418",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1630,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "As an overseas province",
    "text": "In 1951, when the Portuguese government overhauled the entire colonial system,\nall Portugal's colonies, including Portuguese Guinea, were renamed Overseas\nProvinces (_Províncias Ultramarinas_). New infrastructures were built for\neducation, health, agriculture, transportation, commerce, services, and\nadministration.\n\nCashew, peanut, rice, timber, livestock and fish were the main economic\nproductions. The port of Bissau was one of the main employers and a very\nimportant source of taxes for the province's authorities.",
    "openai_summarised_points": [
      "• In 1951, the Portuguese government implemented a comprehensive overhaul of its colonial system, resulting in all of Portugal's colonies being renamed as Overseas Provinces (_Províncias Ultramarinas_).",
      "• This reorganization included the renaming of Portuguese Guinea, among other colonies, to reflect its new status as an Overseas Province.",
      "• The colonial administration invested in the development of infrastructure across various sectors, including education, health, agriculture, transportation, commerce, services, and administration, to support the colony’s integration and economic development.",
      "• The primary economic activities in Portuguese Guinea during this period included the production of cashew, peanut, rice, timber, livestock, and fish, which constituted the main sources of economic output.",
      "• The port of Bissau served as a critical economic hub, acting as one of the main employers within the colony and serving as a significant source of tax revenue for the colonial authorities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:19:06.710848",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 520,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.3.1",
    "section_name": "Independence war",
    "text": "The fight for independence began in 1956, when Amílcar Cabral founded the\n_Partido Africano da Independência da Guiné e Cabo Verde_ (Portuguese:\n_African Party for the Independence of Guinea and Cape Verde_), the PAIGC. In\n1961, when a purely political campaign for independence had made predictably\nlittle progress, the PAIGC adopted guerrilla tactics. Although heavily\noutnumbered by Portuguese troops (approximately 30,000 Portuguese to some\n10,000 guerrillas), the PAIGe had the great advantage of safe havens over the\nborder in Senegal and Guinea, both recently independent of French rule.\n\nSeveral communist countries supported the guerrillas with weapons and military\ntraining. The conflict in Portuguese Guinea involving the PAIGC guerrillas and\nthe Portuguese Army was the most intense and damaging of all Portuguese\nColonial War. Thus, during the 1960s and early 1970s, Portuguese development\nplans promoting strong economic growth and effective socioeconomic policies,\nlike those applied by the Portuguese in the other two theaters of war\n(Portuguese Angola and Portuguese Mozambique), were not possible. In 1972\nCabral set up a government in exile in Conakry, the capital of neighbouring\nGuinea. It was there, in 1973, that he was assassinated outside his house -\njust a year before a left-wing military coup in Portugal dramatically altered\nthe political situation.\n\nBy 1973 the PAIGC controlled most of the interior of the country, while the\ncoastal and estuary towns, including the main population and economic centres,\nremained under Portuguese control. The village of Madina do Boé in the\nsoutheasternmost area of the territory, close to the border with neighbouring\nGuinea, was the location where PAIGC guerrillas declared the independence of\nGuinea-Bissau on September 24, 1973. The war in the colonies was increasingly\nunpopular in Portugal itself, as the people got weary of war and balked at its\never-rising expense. Following the coup d'état in Portugal in 1974, the new\nleft-wing revolutionary government of Portugal began to negotiate with the\nPAIGC and decided to offer independence to all the overseas territories."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.4",
    "section_name": "After independence",
    "text": "As his brother Amílcar Cabral had been assassinated in 1973, Luís Cabral\nbecame the first president of independent Guinea-Bissau in the time after\nindependence was granted on September 10, 1974. Already as the President of\nGuinea-Bissau, Luís Cabral tried to impose a planned economy in the country,\nand supported a socialist model that left the economy of Guinea-Bissau itself\nruined. Similarly, the repression imposed on the population by his\nauthoritarian single-party regime, and severe food shortages, also left marks.\n\nLuís Cabral served from 1974 to 1980, when a military _coup d'état_ led by\nJoão Bernardo \"Nino\" Vieira deposed him. Despite having always denied it, Luís\nCabral was accused of being responsible for the death of a large number of\nblack Guinea-Bissauan soldiers who had fought along with the Portuguese Army\nagainst the PAIGC guerrillas during the Portuguese Colonial War. After the\nmilitary coup, in 1980 PAIGC admitted in its official newspaper \"Nó Pintcha\"\n(dated November 29, 1980) that many were executed and buried in unmarked\ncollective graves in the woods of Cumerá, Portogole and Mansabá. All these\nevents did not help the new country to reach the level of prosperity, economic\ngrowth and development the new rulers had promised to its population.\n\nIn 1985 the first Chinese oversees fishing fleet to go abroad was sent to\nGuinea-Bissau, 13 trawlers from the China National Fisheries Corporation.\n\nIn May 1997 Guinea-Bissau joined the francophone West African Monetary Union.\nConsequently, National Bank of Guinea-Bissau was converted as a national\nbranch of Central Bank of West African States, and the national currency\nGuinea Bissau peso was replaced by West African CFA franc."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.5",
    "section_name": "Macro-economic trend",
    "text": "Following the April 2012 coup d'État growth plunged to reach -1.5% of GDP. In\n2013, the country's GDP grew only by 0.9%. This low growth level during a\nperiod of democratic transition is explained by a combination of low\nadministrative efficiency, low investments on account of the political\ninstability and a bad cashew export season. Key macroeconomic indicators\nestimated by the African Development Bank are presented in the chart below:\n\nReal GDP growth  | 2013  | 2014 (estimate)  | 2015 (projection)  | 2016 (projection)\n---|---|---|---|---\nReal GDP per capita growth  | 0.9  | 2.6  | 3.9  | 3.7\nReal GDP per capita growth  | -1.5  | 0.2  | 1.6  | 1.3\nBudget balance % GDP  | -1.4  | -2.1  | -3.9  | -3.4\nCurrent account balance % GDP  | -4.1  | -0.5  | -0.8  | -1.2\n\nIntermittent fighting between Senegalese-backed government troops and a\nmilitary junta destroyed much of the country's infrastructure and caused\nwidespread damage to the economy in 1998; the civil war led to a 28% drop in\nGDP that year, with partial recovery in 1999. Agricultural production is\nestimated to have fallen by 17% during the conflict. Cashew nut output, the\nmain export crop, declined in 1998 by an estimated 30%. World cashew prices\ndropped by more than 50% in 2000, compounding the economic devastation caused\nby the conflict.\n\nBefore the war, trade reform and price liberalization were the most successful\npart of the country's structural adjustment program under IMF sponsorship. The\ntightening of monetary policy and the development of the private sector had\nalso begun to reinvigorate the economy. Under the government's post-conflict\neconomic and financial program, implemented with IMF and World Bank input,\nreal GDP recovered in 1999 by almost 8%. In December 2000 Guinea-Bissau\nqualified for almost $800 million in debt-service relief under the first phase\nof the enhanced HIPC initiative and is scheduled to submit its Poverty\nReduction Strategy Paper in March 2002. Guinea-Bissau will receive the bulk of\nits assistance under the enhanced HIPC initiative when it satisfies a number\nof conditions, including implementation of its Poverty Reduction Strategy\nPaper.\n\nBecause of high costs, the development of petroleum, phosphate, and other\nmineral resources is not a near-term prospect. The country produces 400,000\nbarrels/day of petrol.\n\nMean wages were $0.52 per man-hour in 2009. In 2019 the minimal monthly wage\nwas around 35000 CFA = US$60.\n\nThe following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth\n(real)  | Inflation\n(in Percent)  | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 0.44  | 562  | 0.29  | 4.9 %  | 65.8 %  | ...\n1985  | 0.62  | 719  | 0.49  | 4.3 %  | 112.7 %  | ...\n1990  | 0.84  | 872  | 0.55  | 4.6 %  | 33.0 %  | ...\n1995  | 1.14  | 1,066  | 0.78  | 4.0 %  | 45.1 %  | ...\n2000  | 1.37  | 1,150  | 0.39  | 9.0 %  | 8.6 %  | 234 %\n2005  | 1.65  | 1,242  | 0.64  | 7.1 %  | 3.4 %  | 222 %\n2006  | 1.73  | 1,279  | 0.64  | 2.0 %  | 2.0 %  | 204 %\n2007  | 1.84  | 1,327  | 0.75  | 3.3 %  | 4.6 %  | 177 %\n2008  | 1.94  | 1,366  | 0.95  | 3.2 %  | 10.4 %  | 163 %\n2009  | 2.02  | 1,391  | 0.89  | 3.4 %  | −1.6 %  | 159 %\n2010  | 2.14  | 1,461  | 0.94  | 4.6 %  | 1.0 %  | 68 %\n2011  | 2.36  | 1,578  | 1.16  | 8.0 %  | 5.0 %  | 50 %\n2012  | 2.36  | 1,546  | 1.05  | −1.7 %  | 2.1 %  | 53 %\n2013  | 2.47  | 1,586  | 1.11  | 3.3 %  | 0.8 %  | 54 %\n2014  | 2.54  | 1,596  | 1.14  | 1.0 %  | −1.0 %  | 55 %\n2015  | 2.73  | 1,675  | 1.15  | 6.1 %  | 1.5 %  | 50 %\n2016  | 2.92  | 1,755  | 1.25  | 5.8 %  | 1.5 %  | 49 %\n2017  | 3.14  | 1,845  | 1.47  | 5.5 %  | 1.1 %  | 42 %"
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.6",
    "section_name": "Financial sector",
    "text": "The financial sector of Guinea-Bissau is relatively underdeveloped: in 2013,\nfinancial intermediation accounted for 4% of GDP, banking penetration is below\n1% of the population (IMF 2013. Article IV Consultations – Guinea-Bissau, IMF\nCountry Report No 13/197) and access to finance is cited as the second most\nimportant constraint for businesses. As of 2015, only four banks were\noperating in the country. According to the IMF, regional private foreign banks\nheld about 65% of shares in the Bissau-Guinean banking system (IMF 2013).\nBanks are regulated by the WAEMU authorities. In the aftermath of the civil\nwar (1998/1999), private sector credit had fallen below 1% of GDP. In 2003 the\nbalance sheets of banks amounted to EUR 21.3 million. Since then credit to the\neconomy has risen to nearly 13.8% of GDP."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "0.7",
    "section_name": "\"Terra Ranka\" (A fresh start): a new economic plan",
    "text": "On March 25, 2015, the Government of Guinea-Bissau convened an international\ndonor conference in Brussels. Hosted by the European Union with support from\nthe UNDP and other partners including the African Development Bank and the\nWorld Bank, the country's major partners joined in welcoming the country's new\nvision up to 2025, and to put pledges forth for its strategic and operational\nplan dubbed \"Terra Ranka\" (A fresh start). Pledges totalled EUR 1.3 billion.\n\nThe strategic and operational plan is composed of six pillars: (i) peace and\ngovernance, (ii) infrastructure, (iii) industrialisation, (iv) urban\ndevelopment, (v) human development and (vi) biodiversity. Each of the pillars\nis composed of a series of structuring projects to be financed either through\ndirect donor support or through the mobilisation of private funding."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Income from waste dumping",
    "text": "In the 1980s Guinea-Bissau was part of a trend in the African continent toward\nthe dumping of waste as a source of income. Plans to import toxic waste from\nEurope were cancelled after an international campaign to halt the trade. The\ngovernment was offered a contract to dispose of 15 million tons of toxic waste\nover a 15-year period. The income from it was equivalent to twice the value of\nits external debt. After strong pressure from other African countries and\nenvironmental groups the Guinea-Bissau government renounced the deal."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Drug trafficking",
    "text": "Over the last decade European consumption of cocaine is believed to have\ntripled, and West Africa has become a primary transit point for trafficking\nthe drug from Colombia to Europe. Guinea-Bissau is the leading West African\ncountry in this regard, with smugglers taking advantage of government\ncorruption and disorder to operate unimpeded. The army and police are alleged\nto be complicit, and a lack of boats or planes to patrol or control the vast\nsea-zone further brings them to turn a blind eye to cocaine shipments from\nLatin America. The local population does not have access to the drug. Planes\nfly in, and use Guinea-Bissau's 88 remote islands, the majority of which are\nuninhabited."
  },
  {
    "chapter_name": "Economy of Guinea-Bissau",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Energy",
    "text": "As of 2019, only 28% of the total population had access to electricity, with\nonly 7% of rural population and 56% of urban population having access to\nelectricity.\n\nIn 2016, 99% of electricity generation capacity came from fossil sources and\n1% from renewable sources."
  }
]