[
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Haiti has a free market economy with low labor costs. A republic, it was a\nFrench colony before gaining independence in an uprising by its enslaved\npeople. It faced embargoes and isolation after its independence as well as\npolitical crises punctuated by foreign interventions and devastating natural\ndisasters. Haiti's estimated population in 2018 was 11,439,646. _The\nEconomist_ reported in 2010: \"Long known as the poorest country in the Western\nhemisphere, Haiti has stumbled from one crisis to another since the Duvalier\n(François Duvalier) years.\"\n\nHaiti has an agricultural economy. Over half of the world's vetiver oil (an\nessential oil used in high-end perfumes) comes from Haiti. Bananas, cocoa, and\nmangoes are important export crops. Haiti has also moved to expand to higher-\nend manufacturing, producing Android-based tablets and current sensors and\ntransformers. Its major trading partner is the United States (US), which\nprovides the country with preferential trade access to the US market through\nthe Haiti Hemispheric Opportunity through Partnership Encouragement (HOPE) and\nthe Haiti Economic Lift Program Encouragement Acts (HELP) legislation.\n\nVulnerability to natural disasters, as well as poverty and limited access to\neducation are among Haiti's most serious disadvantages. Two-fifths of all\nHaitians depend on the agriculture sector, mainly small-scale subsistence\nfarming, and remain vulnerable to damage from frequent natural disasters,\nexacerbated by the country's widespread deforestation. Haiti maintains a trade\ndeficit, which it is working to address by moving into higher-end\nmanufacturing and more value-added products in the agriculture sector.\nRemittances are the primary source of foreign exchange, equaling nearly 20% of\nGDP. Haiti's economy was severely impacted by the 2010 Haiti earthquake which\noccurred on 12 January 2010.",
    "openai_summarised_points": [
      "• Haiti has a free market economy characterized by low labor costs, supporting various sectors including agriculture and manufacturing.",
      "• The country is a republic that was formerly a French colony, gaining independence through an uprising led by its enslaved population.",
      "• Following independence, Haiti faced international embargoes and periods of political isolation, compounded by internal political crises, foreign interventions, and natural disasters.",
      "• The estimated population of Haiti in 2018 was approximately 11,439,646 people.",
      "• According to _The Economist_ in 2010, Haiti has long been recognized as the poorest country in the Western Hemisphere, experiencing continuous crises since the Duvalier era (François Duvalier's rule).",
      "• Haiti's economy is predominantly agricultural, with over 50% of the world's vetiver oil produced in the country, an essential oil used in high-end perfumes.",
      "• Major export crops include bananas, cocoa, and mangoes, which are significant for Haiti’s export economy.",
      "• The country has been making efforts to diversify into higher-end manufacturing, producing Android-based tablets, current sensors, and transformers.",
      "• The United States is Haiti’s primary trading partner, providing preferential trade access through legislation such as the Haiti Hemispheric Opportunity through Partnership Encouragement (HOPE) Act and the Haiti Economic Lift Program Encouragement Acts (HELP).",
      "• Haiti faces significant vulnerabilities due to natural disasters, widespread poverty, and limited access to education, which hinder economic development.",
      "• Approximately 40% (two-fifths) of Haitians depend on agriculture, mainly small-scale subsistence farming, making them highly vulnerable to damage from natural disasters.",
      "• Widespread deforestation exacerbates Haiti’s vulnerability to natural calamities and environmental degradation.",
      "• The country maintains a persistent trade deficit, which it aims to reduce by advancing into higher-end manufacturing and adding more value to its agricultural products.",
      "• Remittances from the Haitian diaspora are the primary source of foreign exchange, accounting for nearly 20% of the country’s GDP.",
      "• Haiti’s economy was severely impacted by the earthquake that occurred on 12 January 2010, causing extensive destruction and economic disruption."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:28.852382",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1863,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Economic history",
    "text": "Historical GDP per capita development\n\nBefore the people enslaved in Haiti to work its plantations revolted against\nFrench colonization in 1804, Haiti ranked as the world's richest and most\nproductive colony. In the formative years of independence, Haiti suffered from\nisolation on the international stage, as evidenced by the early lack of\ndiplomatic recognition accorded to it by Europe and the United States (which\ndid not recognize it until 1862); this had a negative impact on investment in\nHaiti. Another economic obstacle in Haiti's early independence was its payment\nof 150 million francs to France beginning in 1825; this did much to drain the\ncountry of its capital stock. France forced Haiti to pay for its independence\nand freedom from colonization. According to a 2014 study, the Haitian economy\nstagnated due to a combination of weak state power and adverse international\nrelations. The authors write:\n\n> For the newborn 'Negro republic', it was hard to become recognised as a\n> sovereign nation state, it was difficult to form strategic alliances, to get\n> access to foreign loans, and to safeguard trade interests, and it was\n> overloaded with debt under threat of external violence (the French\n> indemnity). Self-chosen isolation, for instance by prohibiting foreign\n> landownership, further reduced the choice set of successive Haitian\n> administrations. When opportunities for export-led growth opened up in the\n> late 19th century, the odds were stacked against Haiti.\n\nThe United States invaded and occupied Haiti from 1915 to 1934.\n\nIn the aftermath of the 1994 restoration of constitutional governance, Haitian\nofficials have indicated their commitment to economic reform through the\nimplementation of sound fiscal and monetary policies and the enactment of\nlegislation mandating the modernization of state-owned enterprises. A council\nto guide the modernization program (CMEP) was established and a timetable was\ndrawn up to modernize nine key parastatals. Although the state-owned flour-\nmill and cement plants have been transferred to private owners, progress on\nthe other seven parastatals has stalled. The modernization of Haiti's state-\nenterprises remains a controversial political issue in Haiti.\n\nUnder President René Préval (1996–2001, 2006 – 14 May 2011), the country's\neconomic agenda included trade and tariff liberalization, measures to control\ngovernment expenditure and increase tax revenues, civil-service downsizing,\nfinancial-sector reform, the privatization of state-owned enterprises, and the\nprovision of private sector management contracts, or joint public-private\ninvestment. Structural adjustment agreements with the International Monetary\nFund, World Bank, Inter-American Development Bank, and other international\nfinancial institutions aiming at creating necessary conditions for private\nsector growth, have proved only partly successful.\n\nComparative social and economic indicators show Haiti falling behind other\nlow-income developing countries (particularly in the Western hemisphere) since\nthe 1980s. Haiti's economic stagnation results from earlier[_when?_]\ninappropriate economic policies, political instability, a shortage of good\narable land, environmental deterioration, continued use of traditional\ntechnologies, under-capitalization and lack of public investment in human\nresources, migration of large portions of the skilled population, and a weak\nnational savings rate.\n\nHaiti continues to suffer the consequences of the 1991 coup. The irresponsible\neconomic and financial policies of _de facto_ authorities greatly[_citation\nneeded_] accelerated Haiti's economic decline. Following the coup, the United\nStates adopted mandatory sanctions, and the OAS instituted voluntary sanctions\naimed at restoring constitutional government. International sanctions\nculminated in the May 1994 United Nations embargo of all goods entering Haiti\nexcept humanitarian supplies, such as food and medicine. The assembly sector,\nheavily dependent on U.S. markets for its products, employed nearly 80,000\nworkers in the mid-1980s. During the embargo, employment fell from 33,000\nworkers in 1991 to 400 in October 1995. Private, domestic and foreign\ninvestment has been slow to return to Haiti. Since the return of\nconstitutional rule, assembly sector employment has gradually recovered with\nover 20,000 now employed, but further growth has been stalled by investor\nconcerns over safety and supply reliability.\n\nRemittances from abroad have consistently constituted a significant source of\nfinancial support for many Haitian households.\n\nThe Haitian Ministry of Economy and Finance designed the Haiti economic\nreforms of 1996 to rebuild the economy of Haiti after significant downturns\nsuffered in the previous years. The primary reforms centered around the\nEmergency Economic Recovery Plan (EERP) and were followed by budget reforms.\n\nHaiti's real GDP growth turned negative in FY 2001 after six years of growth.\nReal GDP fell by 1.1% in FY 2001 and 0.9% in FY 2002. Macroeconomic stability\nwas adversely affected by political uncertainty, the collapse of informal\nbanking cooperatives, high budget deficits, low investment, and reduced\ninternational capital flows, including suspension of IFI lending as Haiti fell\ninto arrears with the Inter-American Development Bank (IDB) and World Bank.\n\nHaiti's economy stabilized in 2003. Although FY 2003 began with the rapid\ndecline of the gourde due to rumors that U.S. dollar deposit accounts would be\nnationalized and due to the withdrawal of fuel subsidies, the government\nsuccessfully stabilized the gourde as it took the politically difficult\ndecisions to float fuel prices freely according to world market prices and to\nraise interest rates. Government agreement with the International Monetary\nFund (IMF) on a staff monitored program (SMP), followed by its payment of its\n$32 million arrears to the IDB in July, paved the way for renewed IDB lending.\nThe IDB disbursed $35 million of a $50 million policy-based loan in July and\nbegan disbursing four previously approved project loans totaling $146 million.\nThe IDB, IMF, and World Bank also discussed new lending with the government.\nMuch of this would be contingent on government adherence to fiscal and\nmonetary targets and policy reforms, such as those begun under the SMP, and\nHaiti's payment of its World Bank arrears ($30 million at 9/30/03).\n\nThe IMF estimated that real GDP was flat in FY 2003 and projected 1% real GDP\ngrowth for FY 2004. However, GDP per capita – amounting to $425 in FY 2002 –\nwill continue to decline[_citation needed_] as population growth is estimated\nat 1.3% p.a. While implementation of governance reforms and peaceful\nresolution of the political stalemate are key to long-term growth,[_citation\nneeded_] external support remains critical in avoiding economic collapse. The\nmajor element is foreign remittances, reported as $931 million in 2002,\nprimarily from the U.S. Foreign assistance, meanwhile, was $130 million in FY\n2002. Overall foreign assistance levels have declined since FY 1995, the year\nelected government was restored to power under a United Nations mandate, when\nthe international community provided over $600 million in aid.\n\nA legal minimum wage of 36 gourdes a day (about U.S. $1.80) was set in 1995,\nand applies to most workers in the formal sector. It was later raised to 70\ngourdes per day. This minimum is 200 gourdes a day (about U.S. $4.80). One\nU.S. dollar is equal to 39.175 gourdes.\n\nHaiti's economy suffered a severe setback in January 2010 when a 7.0 magnitude\nearthquake destroyed much of its capital city, Port-au-Prince, and neighboring\nareas. Already the poorest country in the Americas with 80% of the population\nliving under the poverty line and 54% in abject poverty, the earthquake\ninflicted $7.8 billion in damage and caused the country's GDP to contract 5.4%\nin 2010. Following the earthquake, Haiti received $4.59 billion in\ninternational pledges for reconstruction, which has proceeded slowly.\n\nChart showing the history of Haiti's GDP.\n\nUS economic engagement under the Haitian Hemispheric Opportunity through\nPartnership Encouragement (HOPE) Act, passed in December 2006, has boosted\napparel exports and investment by providing duty-free access to the US.\nCongress voted in 2010 to extend the legislation until 2020 under the HELP\nAct; the apparel sector accounts for about 90% of Haitian exports and nearly\none-tenth of GDP. Remittances are the primary source of foreign exchange,\nequaling nearly 20% of GDP and more than twice the earnings from exports.\nHaiti suffers from a lack of investment, partly because of limited\ninfrastructure and a lack of security. In 2005, Haiti paid its arrears to the\nWorld Bank, paving the way for reengagement with the Bank. Haiti received debt\nforgiveness for over $1 billion through the Highly-Indebted Poor Country\ninitiative in mid-2009. The remainder of its outstanding external debt was\ncancelled by donor countries following the 2010 earthquake but has since risen\nto over $600 million. The government relies on formal international economic\nassistance for fiscal sustainability, with over half of its annual budget\ncoming from outside sources. The Michel Martelly administration in 2011\nlaunched a campaign aimed at drawing foreign investment into Haiti as a means\nfor sustainable development.",
    "openai_summarised_points": [
      "• Before the Haitian revolution in 1804, Haiti was the world's richest and most productive colony, with a highly developed economy based on plantation agriculture.",
      "• During early independence, Haiti faced international isolation, with European countries and the United States (which did not recognize Haiti until 1862) withholding diplomatic recognition, negatively impacting investment.",
      "• Haiti was compelled to pay France 150 million francs starting in 1825 as indemnity for its independence, which drained the country's capital and hindered economic development.",
      "• A 2014 study attributes Haiti’s economic stagnation to weak state capacity and adverse international relations, noting the difficulty in gaining recognition, forming alliances, accessing foreign loans, and safeguarding trade interests due to external debt and restrictions like prohibiting foreign landownership.",
      "• Late 19th-century export-led growth opportunities were limited by these stacked disadvantages, making economic progress difficult.",
      "• The United States invaded and occupied Haiti from 1915 to 1934, impacting its political and economic stability.",
      "• Post-1994, after constitutional governance was restored, Haiti committed to economic reforms including sound fiscal and monetary policies, legislation for modernizing state-owned enterprises, and establishing the Council to Modernize Enterprises Program (CMEP).",
      "• Progress on privatizing some state enterprises, such as flour-mills and cement plants, has been achieved, but efforts on other parastatals have stalled, making modernization a controversial political issue.",
      "• Under President René Préval (1996–2001, 2006–2011), Haiti pursued trade and tariff liberalization, expenditure control, tax revenue increases, civil-service downsizing, financial sector reform, privatization, and public-private management contracts; structural adjustment agreements with IMF, World Bank, and IDB aimed at fostering private sector growth, with only partial success.",
      "• Since the 1980s, Haiti has lagged behind other low-income developing countries in social and economic indicators due to prior inappropriate policies, political instability, limited arable land, environmental degradation, reliance on traditional technologies, under-capitalization, low public investment in human resources, migration of skilled workers, and a weak savings rate.",
      "• The 1991 coup exacerbated economic decline; international sanctions, including a 1994 UN embargo restricting all goods except humanitarian supplies, led to significant employment losses, especially in the assembly sector which employed nearly 80,000 workers in the mid-1980s but fell to 33,000 in 1991 and only 400 in October 1995.",
      "• Post-coup, private, domestic, and foreign investment has been slow to recover; employment in the assembly sector has gradually increased to over 20,000 but growth remains hindered by safety and supply concerns.",
      "• Remittances from abroad have been a vital financial support, consistently constituting a significant portion of household income.",
      "• The Haitian Ministry of Economy and Finance implemented the 1996 economic reforms centered on the Emergency Economic Recovery Plan (EERP) and subsequent budget reforms to rebuild the economy.",
      "• Haiti’s real GDP growth turned negative in FY 2001, declining by 1.1%, and continued to fall by 0.9% in FY 2002, due to political uncertainty, collapse of informal banking cooperatives, high budget deficits, low investment, and reduced international capital flows, including suspension of IFI lending.",
      "• The economy stabilized in 2003; measures included floating fuel prices, raising interest rates, and reaching agreements with IMF and IDB, which disbursed loans totaling $35 million of a $50 million policy-based loan and $146 million in project loans.",
      "• Despite stabilization, GDP per capita (which was $425 in FY 2002) is projected to decline further due to a population growth rate of 1.3% annually; external support remains critical to prevent economic collapse.",
      "• In 2002, foreign remittances amounted to $931 million, and foreign assistance was $130 million; overall aid levels have declined since FY 1995, when aid exceeded $600 million following the restoration of elected government under a UN mandate.",
      "• A legal minimum wage of 36 gourdes per day (about US $1.80) was established in 1995, later increased to 70 gourdes per day; the current minimum is 200 gourdes per day (about US $4.80), with 1 US dollar equal to 39.175 gourdes.",
      "• The January 2010 earthquake, with a magnitude of 7.0, caused extensive destruction in Port-au-Prince and surrounding areas, inflicting $7.8 billion in damages and contracting GDP by 5.4% in 2010; Haiti was already the poorest country in the Americas, with 80% living under the poverty line and 54% in abject poverty.",
      "• Post-earthquake reconstruction pledges totaled $4.59 billion, but progress has been slow.",
      "• The US Haitian Hemispheric Opportunity through Partnership Encouragement (HOPE) Act, passed in December 2006, boosted apparel exports and investment by providing duty-free access to the US market; this legislation was extended until 2020 under the HELP Act.",
      "• The apparel sector accounts for approximately 90% of Haitian exports and nearly 10% of GDP; remittances constitute about 20% of GDP, more than twice the earnings from exports.",
      "• Haiti faces investment shortages due to limited infrastructure and security concerns; in 2005, Haiti paid its arrears to the World Bank, enabling reengagement, and received over $1 billion in debt forgiveness through the Highly-Indebted Poor Country initiative in mid-2009.",
      "• Following the 2010 earthquake, external debt was canceled by donors but has since risen to over $600 million.",
      "• The Haitian government relies heavily on international aid, with over half of its annual budget funded by external sources; in 2011, the Michel Martelly administration launched a campaign to attract foreign investment for sustainable development."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:36.120300",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 9356,
      "bullet_points_count": 26
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Debt cancellation",
    "text": "In 2005 Haiti's total external debt reached an estimated US$1.3 billion, which\ncorresponds to debt per capita of US$169, in contrast to the debt per capita\nof the United States which is US$102,000. Following the democratic election of\nAristide in December 1990, many international creditors responded by\ncancelling significant amounts of Haiti's debt, bringing the total down to\nUS$777 million in 1991. However, new borrowing during the 1990s swelled the\ndebt to more than US$1 billion.\n\nAt peak, Haiti's total external debt was estimated at 1.8 billion dollars,\nincluding half a billion dollars to the Inter-American Development Bank,\nHaiti's largest creditor. In September 2009, Haiti met the conditions set out\nby the IMF and World Bank's Heavily Indebted Poor Countries program,\nqualifying it for cancellation of some of its external debt. This amounted to\na cancellation of $1.2 billion. Despite this as of 2010 calls for cancellation\nof its remaining $1 billion debts came strongly from civil society groups such\nas the Jubilee Debt Campaign in reaction to the effects of the earthquake that\nhit the country.",
    "openai_summarised_points": [
      "• In 2005, Haiti's total external debt was estimated at approximately US$1.3 billion, with a debt per capita of US$169, significantly lower than the US debt per capita of US$102,000.",
      "• Following the democratic election of President Jean-Bertrand Aristide in December 1990, many international creditors responded by canceling substantial portions of Haiti's debt, reducing it to US$777 million in 1991.",
      "• During the 1990s, Haiti's debt increased again due to new borrowing, surpassing US$1 billion.",
      "• At its peak, Haiti's total external debt was estimated at US$1.8 billion, which included US$500 million owed to the Inter-American Development Bank, Haiti's largest creditor.",
      "• In September 2009, Haiti qualified for debt relief under the IMF and World Bank's Heavily Indebted Poor Countries (HIPC) program after meeting specific conditions, resulting in a cancellation of US$1.2 billion of its external debt.",
      "• Despite the debt cancellation in 2009, as of 2010, civil society groups such as the Jubilee Debt Campaign strongly called for the complete cancellation of Haiti's remaining approximately US$1 billion in debt, citing the adverse effects of the 2010 earthquake on the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:42.262404",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1114,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Primary industries",
    "text": "Primary industries are crucial to maintaining Haiti's economic diversity and\nrelevance internationally.",
    "openai_summarised_points": [
      "• Primary industries are essential for maintaining Haiti's economic diversity and its relevance in the international market."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:43.798355",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 103,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Agriculture, forestry, and fishing",
    "text": "Although many Haitians make their living through subsistence farming, Haiti\nalso has an agricultural export sector. Agriculture, together with forestry\nand fishing, accounts for about one-quarter (28% in 2004) of Haiti's annual\ngross domestic product and employs about two-thirds (66% in 2004) of the labor\nforce. However, expansion has been difficult because mountains cover much of\nthe countryside and limit the land available for cultivation. Of the total\narable land of 550,000 hectares, 125,000 hectares are suited for irrigation,\nand of those only 75,000 hectares actually have been improved with irrigation.\nHaiti's dominant cash crops include coffee, mangoes, and cocoa. Haiti has\ndecreased its production of sugarcane, traditionally an important cash crop,\nbecause of declining prices and fierce international competition. Because\nHaiti's forests have thinned dramatically, timber exports have declined.\nRoundwood removals annually total about 1,000 kilograms. Haiti also has a\nsmall fishing industry. Annual catches in recent years have totaled about\n5,000 tons.",
    "openai_summarised_points": [
      "• Many Haitians rely on subsistence farming as their primary means of livelihood, but Haiti also maintains an agricultural export sector.",
      "• Agriculture, combined with forestry and fishing, contributed approximately 28% to Haiti's gross domestic product (GDP) in 2004.",
      "• The agriculture sector employed about 66% of the Haitian labor force in 2004.",
      "• Expansion of agricultural activities has been challenging due to the mountainous terrain covering much of the countryside, which limits available land for cultivation.",
      "• Haiti has a total of 550,000 hectares of arable land; of this, 125,000 hectares are suitable for irrigation, but only 75,000 hectares have been developed with irrigation infrastructure.",
      "• The country's dominant cash crops include coffee, mangoes, and cocoa.",
      "• Haiti has reduced its sugarcane production, a historically significant cash crop, due to declining global prices and intense international competition.",
      "• Deforestation has led to a dramatic thinning of Haiti's forests, resulting in a decline in timber exports.",
      "• Haiti's annual roundwood removals are approximately 1,000 kilograms.",
      "• The country maintains a small fishing industry, with recent annual catches totaling about 5,000 tons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:46.665686",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1072,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Mining and minerals",
    "text": "Haiti has a mining industry which extracted minerals worth approximately US$13\nmillion in 2013. Bauxite, copper, calcium carbonate, gold, and marble were the\nmost extensively extracted minerals in Haiti. Lime and aggregates and to a\nlesser extent marble are extracted. Gold was mined by the Spanish in early\ncolonial times. Bauxite was mined for a number of years in recent times at a\nsite near Miragoâne on the Southern peninsula. Operating from 1960 to 1972\nInternational Halliwell Mines, Ltd. (\"Halliwell\"), a Canadian corporation,\nthrough its wholly owned Haitian subsidiary, La Societe d'Exploitation et de\nDeveloppement Economique et Natural d'Haiti (\"Sedren\") mined copper near\nGonaïves.\n\n0.5 million tons of ore were exported. The copper ore was valued at about\n$83.5 million. The government of Haiti received about $3 million. As of 2012\nthere was promise of gold and copper mining in northern Haiti.",
    "openai_summarised_points": [
      "• In 2013, Haiti's mining industry extracted minerals valued at approximately US$13 million.",
      "• The most extensively extracted minerals in Haiti include bauxite, copper, calcium carbonate, gold, and marble.",
      "• Lime and aggregates are also extracted in Haiti, with marble being mined to a lesser extent.",
      "• Gold was mined by the Spanish during early colonial times, indicating historical gold extraction activities.",
      "• Bauxite mining occurred near Miragoâne on the Southern peninsula of Haiti over recent years.",
      "• From 1960 to 1972, International Halliwell Mines, Ltd., a Canadian corporation, operated in Haiti through its wholly owned subsidiary, La Societe d'Exploitation et de Developpement Economique et Natural d'Haiti (Sedren).",
      "• Sedren mined copper near Gonaïves, Haiti, during this period.",
      "• The copper mining operation exported approximately 0.5 million tons of ore.",
      "• The copper ore was valued at about US$83.5 million, generating significant revenue.",
      "• The Haitian government received approximately US$3 million from the copper exports.",
      "• As of 2012, there was promising potential for gold and copper mining activities in northern Haiti."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:53.324663",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 909,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "3.2.1",
    "section_name": "Gold",
    "text": "In 2012, it was reported that confidential agreements and negotiations had\nbeen entered into by the Haitian government granting licenses for exploration\nor mining of gold and associated metals such as copper for over 1,000 square\nmiles (2,600 km2) in the mineralized zone stretching from east to west across\nnorthern Haiti. Estimates for the value of the gold which might be extracted\nthrough open-pit mining are as high as US$20 billion. Eurasian Minerals and\nNewmont Mining Corporation are two of the firms involved. According to Alex\nDupuy, Chair of African American Studies and John E. Andrus Professor of\nSociology at Wesleyan University the ability of Haiti to adequately manage the\nmining operations or to obtain and use funds obtained from the operations for\nthe benefit of its people is untested and seriously questioned. Lakwèv, where\nearth dug from hand-made tunnels is washed for specks of free gold by local\nresidents, is one of the locations. In the same mineralized zone in the\nDominican Republic Barrick Gold and Goldcorp are planning on reopening the\nPueblo Viejo mine.",
    "openai_summarised_points": [
      "• In 2012, it was reported that the Haitian government entered into confidential agreements and negotiations that granted licenses for exploration or mining of gold and associated metals such as copper.",
      "• These licenses covered over 1,000 square miles (2,600 km²) within a mineralized zone extending from east to west across northern Haiti.",
      "• The estimated value of the gold potentially extractable through open-pit mining in this zone is as high as US$20 billion.",
      "• Eurasian Minerals and Newmont Mining Corporation are two of the firms involved in the exploration and mining activities within this region.",
      "• According to Alex Dupuy, who is the Chair of African American Studies and John E. Andrus Professor of Sociology at Wesleyan University, Haiti’s capacity to effectively manage the mining operations or to utilize the funds generated for the benefit of its population remains untested and is a matter of serious concern.",
      "• Lakwèv is one of the locations where local residents manually dig earth from tunnels and wash it for specks of free gold, indicating small-scale, informal gold extraction practices.",
      "• In the same mineralized zone located in the Dominican Republic, companies Barrick Gold and Goldcorp are planning to reopen the Pueblo Viejo mine, highlighting regional interest in gold mining activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:22:58.750541",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1086,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Secondary industries",
    "text": "Secondary industries in Haiti are beset by a variety of problems, while having\nsome austerity measures to counteract them.[_further explanation needed_]",
    "openai_summarised_points": [
      "• Secondary industries in Haiti face a range of significant challenges that hinder their development and growth.",
      "• These industries are characterized by various problems that impact their productivity, efficiency, and overall contribution to the Haitian economy.",
      "• Despite these difficulties, Haiti has implemented certain austerity measures aimed at mitigating the adverse effects on its secondary industrial sector.",
      "• The specific nature of these problems and the details of the austerity measures are not elaborated upon in the provided content, indicating a need for further explanation or additional information to fully understand the scope and impact of these issues."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:00.900853",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 152,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Manufacturing",
    "text": "The leading industries in Haiti produce beverages, butter, cement, detergent,\nedible oils, flour, refined sugar, soap, and textiles. Growth in both\nmanufacturing and industry as a whole has been slowed by a lack of capital\ninvestment. Grants from the United States and other countries have targeted\nthis problem, but without much success. Private home building and construction\nappear to be one subsector with positive prospects for growth.[_citation\nneeded_]\n\nIn 2004 industry accounted for about 20 percent of the gross domestic product\n(GDP), and less than 10 percent of the labor force worked in industrial\nproduction. As a portion of the GDP, the manufacturing sector has contracted\nsince the 1980s. The United Nations embargo of 1994 put out of work most of\nthe 80,000 workers in the assembly sector. Additionally, the years of military\nrule following the presidential coup in 1991 resulted in the closure of most\nof Haiti's offshore assembly plants in the free zones surrounding Port-au-\nPrince. When President Aristide returned to Haiti, some improvements did occur\nin the manufacturing sector.[_citation needed_]\n\nHaiti's cheaper labor brought some textile and garment assembly work back to\nthe island in the late 1990s. Although these gains were undercut by\ninternational competition, the apparel sector in 2008 made up two-thirds of\nHaiti's annual 490 million US dollars exports. USA economic engagement under\nthe HOPE Act, from December 2006, increased apparel exports and investment by\nproviding tariff-free access to the USA. HOPE II, in October 2008, further\nimproved the situation by extending preferences to 2018.",
    "openai_summarised_points": [
      "• The leading manufacturing industries in Haiti include the production of beverages, butter, cement, detergent, edible oils, flour, refined sugar, soap, and textiles.",
      "• Growth in both the manufacturing sector and the broader industry has been hindered primarily by a lack of capital investment.",
      "• Although grants from the United States and other countries have aimed to address the capital deficit, these efforts have largely been unsuccessful.",
      "• Private home building and construction are identified as subsectors with positive growth prospects.",
      "• In 2004, the manufacturing sector contributed approximately 20 percent to Haiti's gross domestic product (GDP).",
      "• In the same year, less than 10 percent of the Haitian labor force was employed in industrial production.",
      "• Since the 1980s, the manufacturing sector's share of GDP has contracted.",
      "• The United Nations embargo of 1994 resulted in the displacement of most of the 80,000 workers employed in Haiti’s assembly sector.",
      "• The military rule following the 1991 presidential coup led to the closure of most offshore assembly plants located in free zones around Port-au-Prince.",
      "• The return of President Aristide to Haiti brought some improvements to the manufacturing sector.",
      "• In the late 1990s, Haiti's lower labor costs attracted some textile and garment assembly work back to the island.",
      "• Despite these gains, international competition limited the growth of the apparel sector.",
      "• By 2008, the apparel industry accounted for two-thirds of Haiti’s annual exports, which totaled approximately 490 million US dollars.",
      "• The HOPE Act, enacted in December 2006, enhanced Haiti’s apparel exports and investment by providing tariff-free access to the US market.",
      "• The HOPE II legislation, introduced in October 2008, extended preferential trade benefits to 2018, further supporting the apparel sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:10.525713",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1630,
      "bullet_points_count": 15
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Energy",
    "text": "Haiti uses very little energy, the equivalent of approximately 250 kilograms\nof oil per head per year. In 2003, Haiti produced 546 million kilowatt-hours\nof electricity while consuming 508 million kilowatt-hours. In 2013, it stood\n135th out of 135 countries in net total consumption of electricity.\n\nMost of the country's energy comes from the burning of wood. Haiti imports\noil, consuming about 11,800 barrels per day (1,880 m3/d), as of 2003. The\nPéligre Dam, the country's largest, provides the capital city of Port-au-\nPrince with energy. Thermal plants provide electricity to the rest of the\ncountry. Even with the country's low level of demand for energy, the supply of\nelectricity traditionally has been sporadic and prone to shortages.\nMismanagement by the state has offset more than US$100 million in foreign\ninvestment targeted at improving Haiti's energy infrastructure. Businesses\nhave resorted to securing back-up power sources to deal with the regular\noutages. The potential for greater hydropower exists, should Haiti have the\ndesire and means to develop it. The government controls oil and gas prices, to\nan extent insulating Haitians from international price fluctuations.[_citation\nneeded_]",
    "openai_summarised_points": [
      "• Haiti's energy consumption is very low, approximately 250 kilograms of oil per person per year.",
      "• In 2003, Haiti produced 546 million kilowatt-hours (kWh) of electricity while consuming 508 million kWh, indicating a slight net export or surplus.",
      "• As of 2013, Haiti ranked 135th out of 135 countries in net total electricity consumption, reflecting very low energy use relative to other nations.",
      "• The majority of Haiti's energy originates from the burning of wood, which is the primary energy source for the country.",
      "• Haiti imports oil, with a consumption rate of about 11,800 barrels per day (1,880 cubic meters per day) as of 2003.",
      "• The Péligre Dam, Haiti's largest hydroelectric facility, supplies electricity to Port-au-Prince, the capital city.",
      "• Thermal power plants provide electricity to the rest of the country outside the capital region.",
      "• Despite low overall energy demand, Haiti's electricity supply has historically been sporadic and prone to shortages.",
      "• Mismanagement by the Haitian government has resulted in the loss of over US$100 million in foreign investment aimed at improving the country's energy infrastructure.",
      "• Haitian businesses often secure backup power sources to cope with frequent electricity outages.",
      "• There is significant potential for hydropower development in Haiti, contingent upon the country's willingness and capacity to invest in such projects.",
      "• The Haitian government controls oil and gas prices to some extent, which helps shield consumers from fluctuations in international energy prices."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:15.648168",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1208,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Tertiary industries",
    "text": "Haiti relies significantly on tertiary industries for its economy.",
    "openai_summarised_points": [
      "• Haiti's economy is heavily dependent on tertiary industries, which encompass services such as tourism, banking, telecommunications, and transportation.",
      "• The tertiary sector plays a crucial role in providing employment and generating income for the country, contributing substantially to GDP.",
      "• Tourism is a vital component of Haiti’s tertiary industries, with attractions including historical sites, beaches, and cultural festivals, although the sector faces challenges due to political instability and natural disasters.",
      "• The banking sector in Haiti is relatively underdeveloped but remains essential for financial transactions, with several local banks operating within the country.",
      "• Telecommunications infrastructure is limited but growing, facilitating communication and business operations, though coverage and quality vary across regions.",
      "• Transportation services, including domestic and international shipping, air travel, and road networks, are integral to Haiti’s service economy, supporting trade and mobility.",
      "• The expansion of tertiary industries is seen as critical for economic development, especially in diversifying the economy beyond agriculture and manufacturing.",
      "• Despite their importance, these industries face obstacles such as inadequate infrastructure, political instability, and vulnerability to natural disasters, which hinder growth.",
      "• The government and international organizations recognize the need to strengthen and modernize the tertiary sector to improve economic resilience and reduce poverty."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:23.530529",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 66,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Services",
    "text": "Haiti's services sector made up 52 percent of the country's gross domestic\nproduct in 2004 and employed 25 percent of the labor force. According to World\nBank statistics, the services sector is one of the few sectors of Haiti's\neconomy that sustained steady, if modest, growth throughout the 1990s.\n\nA unique institution in Haiti is the Madan Saras who are the large number of\nwomen who buy and transport agriculture produce from farm to market. Women in\nHaiti have traditionally been the marketers of produce while men cultivate the\nland.",
    "openai_summarised_points": [
      "• In 2004, Haiti's services sector constituted 52 percent of the country's gross domestic product (GDP).",
      "• The services sector employed 25 percent of Haiti's labor force in 2004.",
      "• According to World Bank statistics, the services sector is one of the few sectors in Haiti's economy that experienced steady, albeit modest, growth throughout the 1990s.",
      "• A distinctive institution within Haiti's services sector is the Madan Saras, a large group of women who buy and transport agricultural produce from farms to markets.",
      "• Women in Haiti have traditionally played the role of marketers of produce, while men are primarily responsible for cultivating the land."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:26.602368",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 539,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Banking",
    "text": "Lack of a stable and trustworthy banking system has impeded Haiti's economic\ndevelopment. Banks in Haiti have collapsed on a regular basis. Most Haitians\ndo not have access to loans of any sort. When reelected in 2000, President\nAristide promised to remedy this situation but instead introduced a non-\nsustainable plan of \"cooperatives\" that guaranteed investors a 10 percent rate\nof return. By 2000, the cooperatives had crumbled and Haitians had\ncollectively lost more than US$200 million in savings.\n\nHaiti's central bank, the Bank of the Republic of Haiti, oversees 10\ncommercial banks and two foreign banks operating in the country. Most banking\ntakes place in the capital city of Port-au-Prince. The United Nations and the\nInternational Monetary Fund have led efforts to diversify and expand the\nfinance sector, making credit more available to rural populations.[_citation\nneeded_] In 2002, the Canadian International Development Agency led a training\nprogram for Haitian Credit Unions. Haiti has no stock exchange.",
    "openai_summarised_points": [
      "• The lack of a stable and trustworthy banking system has significantly impeded Haiti's overall economic development.",
      "• Haitian banks have experienced regular collapses, contributing to financial instability within the country.",
      "• The majority of Haitians lack access to any form of credit or loans, limiting economic participation and growth.",
      "• In the 2000 presidential election, President Jean-Bertrand Aristide was reelected and promised to address the banking sector issues; however, he implemented a plan centered on \"cooperatives\" that proved unsustainable.",
      "• The cooperative scheme introduced by Aristide guaranteed investors a 10 percent rate of return, but by 2000, these cooperatives had failed, resulting in Haitians collectively losing over US$200 million in savings.",
      "• Haiti's central banking authority is the Bank of the Republic of Haiti, which supervises 10 commercial banks and two foreign banks operating within the country.",
      "• Most banking activities are concentrated in Port-au-Prince, the capital city of Haiti.",
      "• International organizations such as the United Nations and the International Monetary Fund have led efforts to diversify and expand Haiti’s financial sector, aiming to increase credit availability, particularly to rural populations.",
      "• In 2002, the Canadian International Development Agency conducted a training program specifically for Haitian Credit Unions to strengthen local financial institutions.",
      "• Haiti does not have a stock exchange, limiting avenues for capital markets development within the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:23:31.833084",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1021,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "5.3",
    "section_name": "Tourism",
    "text": "Tourism in Haiti has suffered from the country's political upheaval.\nInadequate infrastructure also has limited visitors to the island. In the\n1970s and 1980s, however, tourism was an important industry, drawing an\naverage of 150,000 visitors annually. Since the 1991 coup, tourism has\nrecovered slowly. The Caribbean Tourism Organization (CTO) has joined the\nHaitian government in an effort to restore the island's image as a tourist\ndestination. In 2001, 141,000 foreigners visited Haiti. Most came from the\nUnited States. To make tourism a major industry for Haiti, further\nimprovements in hotels, restaurants and other infrastructure still are needed."
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "5.4",
    "section_name": "Television",
    "text": "International television companies have earned subscriber bases in the tens of\nthousands,[_citation needed_] and Canal+ sees significant room to develop the\npay TV industry in Haiti, having earned over 100,000 subscribers in the\ncountry as of 2021."
  },
  {
    "chapter_name": "Economy of Haiti",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Macro-Economic",
    "text": "The following table shows the main economic indicators in 1980–2024.\n\nYear  | GDP\n(in bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bil. US$ nominal) | GDP growth\n(real) | Inflation\n(consumer prices) | Government debt\n(Percentage of GDP)\n---|---|---|---|---|---|---\n1980  | 10.2  | 1,715  | 2.7  | 7.3%  | 19.1%  | ...\n1985  | 12.9  | 1,978  | 4.0  | 0.8%  | 10.6%  | ...\n1990  | 14.8  | 2,089  | 1.7  | −0.4%  | 21.3%  | ...\n1995  | 15.3  | 1,953  | 4.8  | 9.9%  | 30.2%  | ...\n2000  | 18.8  | 2,195  | 6.8  | 0.9%  | 6.4%  | 32%\n2005  | 22.4  | 2,409  | 7.2  | 3.1%  | 14.1%  | 30%\n2006  | 23.5  | 2,486  | 7.5  | 1.8%  | 13.0%  | 32%\n2007  | 25.3  | 2,630  | 9.5  | 4.7%  | 6.9%  | 24%\n2008  | 26.4  | 2,707  | 10.5  | 2.7%  | 12.5%  | 34%\n2009  | 28.2  | 2,837  | 11.6  | 5.9%  | 5.6%  | 19%\n2010  | 26.9  | 2,666  | 11.9  | −5.7%  | 2.9%  | 25%\n2011  | 28.8  | 2,814  | 13.0  | 5.1%  | 5.2%  | 22%\n2012  | 29.5  | 2,835  | 13.7  | 0.5%  | 5.7%  | 24%\n2013  | 31.3  | 2,961  | 14.9  | 4.3%  | 5.3%  | 25%\n2014  | 32.4  | 3,017  | 15.1  | 1.7%  | 3.2%  | 21%\n2015  | 33.6  | 3,075  | 14.8  | 2.6%  | 5.3%  | 24%\n2016  | 34.5  | 3,113  | 14.0  | 1.8%  | 11.4%  | 24%\n2017  | 36.0  | 3,200  | 15.0  | 2.5%  | 10.6%  | 23%\n2018  | 35.2  | 3,081  | 16.5  | 1.7%  | 11.4%  | 24%\n2019  | 35.4  | 3,057  | 14.8  | −1.7%  | 17.3%  | 27%\n2020  | 34.9  | 2,971  | 14.5  | −3.3%  | 22.9%  | 22%\n2021  | 35.8  | 3,005  | 21.0  | −1.8%  | 15.9%  | 29%\n2022  | 37.7  | 3,123  | 19.8  | −1.7%  | 27.6%  | 30%\n2023  | 38.3  | 3,133  | 19.6  | −1.9%  | 44.1%  | 28%\n2024  | 37.7  | 3,039  | 26.3  | −4.0%  | 26.0%  | 14%"
  }
]