[
  {
    "chapter_name": "Economy of Tonga",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of Tonga\" – news **·** newspapers **·** books **·**\nscholar **·** JSTOR _( February 2025)__(Learn how and when to remove this\nmessage)_  \n---|---  \n  \nTonga's economy is characterized by a large nonmonetary sector and a heavy\ndependence on remittances from the half of the country's population that lives\nabroad, chiefly in Australia, New Zealand, and the United States. Much of the\nmonetary sector of the economy is dominated, if not owned, by the royal family\nand nobles. This is particularly true of the telecommunications and satellite\nservices. Much of small business, particularly retailing on Tongatapu, is now\ndominated by recent Chinese immigrants who arrived under a cash-for-passports\nscheme that ended in 1998.\n\nThe manufacturing sector consists of handicrafts and a few other very\nsmallscale industries, all of which contribute only about 3% of GDP.\nCommercial business activities also are inconspicuous and, to a large extent,\nare dominated by the same large trading companies found throughout the South\nPacific. In September 1974, the country's first commercial trading bank, the\nBank of Tonga, opened.\n\nRural Tongans rely on plantation and subsistence agriculture. Coconuts,\nvanilla beans, and bananas are the major cash crops. The processing of\ncoconuts into copra and desiccated coconut is the only significant industry.\nPigs and poultry are the major types of livestock. Horses are kept for draft\npurposes, primarily by farmers working their api. More cattle are being\nraised, and beef imports are declining.\n\nTonga's development plans emphasize a growing private sector, upgrading\nagricultural productivity, revitalizing the squash and vanilla bean\nindustries, developing tourism, and improving the island's communications and\ntransportation systems. A small but growing construction sector is developing\nin response to the inflow of aid monies and remittances from Tongans abroad.\nThe copra industry is plagued by world prices that have been depressed for\nyears.\n\nEfforts are being made to discover ways to diversify. One hope is seen in\nfisheries; tests have shown that sufficient skipjack tuna pass through Tongan\nwaters to support a fishing industry. Another potential development activity\nis exploitation of forests, which cover 35% of the kingdom's land area but are\ndecreasing as land is cleared. Coconut trees past their prime bearing years\nalso provide a potential source of lumber.\n\nThe tourist industry is relatively undeveloped; however, the government\nrecognizes that tourism can play a major role in economic development, and\nefforts are being made to increase this source of revenue. Cruise ships often\nstop in Nukuʻalofa and Vava'u.\n\nAccording to the CIA World Factbook,\n\n> The Tongan economy's base is agriculture, which contributes 30% to GDP.\n> Squash, coconuts, bananas, and vanilla beans are the main crops, and\n> agricultural exports make up two-thirds of total exports. The country must\n> import a high proportion of its food, mainly from New Zealand. The\n> industrial sector accounts for only 10% of GDP. Tourism is the primary\n> source of hard currency earnings. The country remains dependent on sizable\n> external aid and remittances to offset its trade deficit. The government is\n> emphasizing the development of the private sector, especially the\n> encouragement of investment."
  },
  {
    "chapter_name": "Economy of Tonga",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Energy",
    "text": "**Electricity – production:** 53 GW·h (2008)\n\n**Electricity – production by source:**\n\n* _foclear:_\n* _fossil fuel:_ 92%\n* _nuclear:_ 0%\n* _hydro:_ 0%\n* _renewables:_ 8% (2009)\n\n**Electricity – consumption:** 38,13 GW·h (2003)\n\n**Electricity – exports:** 0 kW·h (2003)\n\n**Electricity – imports:** 0 kW·h (2003)\n\nIn 2021 the Tongan government committed to a target of 70% renewable energy by\n2030.\n\nIn July 2012 Tonga Power opened Tonga's first solar photovoltaic generator,\nthe 1.32 MW Maama Mai Solar Farm on Tongatapu. This was followed by a 6MW\nsolar farm spread across three sites on Tongatapu. A pair of 13 MW / 24 MWh\ngrid batteries began operating on the main island in 2022. An Outer Islands\nRenewable Energy Project is installing solar / battery systems on nine smaller\nislands, and upgrading the electrical grids on 'Eua and Vava'u."
  },
  {
    "chapter_name": "Economy of Tonga",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Other data",
    "text": "**Agriculture – products:** squash, coconuts, copra, bananas, vanilla beans,\ncocoa, coffee, ginger, black pepper; fish\n\nTonga produced in 2018:\n\n* 148 thousand tons of coconut;\n* 20 thousand tons of squash;\n* 6.7 thousand tons of cassava;\n* 6.4 thousand tons of sweet potato;\n* 6 thousand tons of vegetable;\n* 4.5 thousand tons of yam;\n\nIn addition to smaller productions of other agricultural products.\n\n**Currency:** 1 pa'anga (T$) = 100 seniti\n\n**Exchange rates:** pa'anga (T$) per US$1 – 1.9716 (2004), 2.142 (2003),\n2.1952 (2002), 2.1236 (2001), 1.6250 (November 1999), 1.4921 (1998), 1.2635\n(1997), 1.2323 (1996), 1.2709 (1995)"
  }
]