[
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Azerbaijan** is highly dependent on oil and gas exports, in\nparticular since the completion of the Baku-Tbilisi-Ceyhan Pipeline. The\ntransition to oil production in the late 1990s led to rapid economic growth\nover the period 1995–2014. Since 2014, GDP growth has slowed down\nsubstantially.\n\nLarge oil reserves are a major contributor to Azerbaijan's economy. Gas and\noil make up two-thirds of Azerbaijan's GDP, making it one of the top ten most\nfossil fuel-dependent economies in the world. Gas and oil make up 90% of\nAzerbaijan's export revenues and 60% of its finances.\n\nAzerbaijan's economy is characterized by corruption and inequality. The\ncountry's oil wealth has significantly strengthened the stability of Ilham\nAliyev's regime and enriched ruling elites in Azerbaijan. The country's oil\nwealth has enabled the state to host lavish international events, as well as\nengage in extensive lobbying efforts abroad.\n\nThe national currency is the Azerbaijani manat. The private sector is weak in\nAzerbaijan, as the economy is dominated by state-owned enterprises. More than\nhalf of the formal labor force works for the government in Azerbaijan.",
    "openai_summarised_points": [
      "• The economy of Azerbaijan is highly dependent on oil and gas exports, particularly following the completion of the Baku-Tbilisi-Ceyhan Pipeline, which significantly boosted oil export capacity.",
      "• The transition to oil production in the late 1990s spurred rapid economic growth in Azerbaijan during the period from 1995 to 2014.",
      "• Since 2014, Azerbaijan's GDP growth has slowed considerably, indicating a slowdown in economic expansion.",
      "• Large oil reserves are a major contributor to Azerbaijan's economy, underpinning its reliance on fossil fuels.",
      "• Oil and gas constitute approximately two-thirds of Azerbaijan's Gross Domestic Product (GDP), making it one of the top ten most fossil fuel-dependent economies globally.",
      "• Oil and gas account for about 90% of Azerbaijan's export revenues, highlighting the sector's dominance in foreign trade.",
      "• The fossil fuel sector also constitutes roughly 60% of the country's overall financial income, emphasizing its central role in national finances.",
      "• Azerbaijan's economy is characterized by issues of corruption and inequality, which impact economic stability and social equity.",
      "• The country's oil wealth has significantly strengthened the regime of President Ilham Aliyev and has enriched the ruling elites, consolidating political power.",
      "• Oil revenues have enabled Azerbaijan to host lavish international events, showcasing its wealth and global presence.",
      "• The state has engaged in extensive lobbying efforts abroad, leveraging its oil wealth to influence international relations and policies.",
      "• The national currency of Azerbaijan is the Azerbaijani manat.",
      "• The private sector in Azerbaijan remains weak, with the economy predominantly dominated by state-owned enterprises.",
      "• More than half of the formal labor force in Azerbaijan is employed by the government, indicating a large public sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:29:40.205981",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1162,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Republic era",
    "text": "Oil and gas are the most prominent products of Azerbaijan's economy. More than\n$60 billion was invested into Azerbaijan's oil sector by major international\noil companies in AIOC consortium operated by BP. Oil production under the\nfirst of these production sharing agreements (PSAs), with the Azerbaijan\nInternational Operating Company, began in November 1997 and was about 500,000\nbarrels per day in 2006. People visit petroleum spas (or \"oil spas\") to bathe\nin the local crude in Naftalan. A leading caviar producer and exporter in the\npast, Azerbaijan's fishing industry today is concentrated on the dwindling\nstocks of sturgeon and beluga in the Caspian Sea.\n\nAzerbaijan shares all the problems of the former Soviet republics in making\nthe transition from a command to a market economy, but its energy resources\nbrighten its long-term prospects. Azerbaijan has begun making progress on\neconomic reform, and old economic ties and structures are slowly being\nreplaced. An obstacle to economic progress, including foreign investment, is\nthe continuing conflict with Armenia over the Nagorno-Karabakh region.\n\nIn 1992 Azerbaijan became a member of the Economic Cooperation Organization.\nIn 2002, the Azerbaijani merchant marine had 54 ships.\n\nIn 2010 Azerbaijan entered into the top eight biggest oil suppliers to EU\ncountries with €9.46 billion. In 2011, the amount of foreign investments in\nAzerbaijan was $20 billion, a 61% increase from 2010. According to Minister of\nEconomic Development of Azerbaijan, Shahin Mustafayev, in 2011, \"$15.7 billion\nwas invested in the non-oil sector, while the rest – in the oil sector\".\n\nAzerbaijani exports in 2006\n\nIn 2012, because of its economic performance after the Soviet breakup,\nAzerbaijan was predicted to become \"Tiger of Caucasus\". In 2012, Globalization\nand World Cities Research Network study ranked Baku as a Gamma-level global\ncity.\n\nIn 2015, Turkey and Azerbaijan agreed to boost mutual trade to US$15 billion\nby 2023.",
    "openai_summarised_points": [
      "• Oil and gas are the most prominent sectors of Azerbaijan's economy, constituting a primary source of revenue and development.",
      "• Over $60 billion has been invested into Azerbaijan's oil sector by major international oil companies, primarily through the Azerbaijan International Operating Company (AIOC) consortium led by BP.",
      "• Oil production under the first production sharing agreement (PSA) with AIOC commenced in November 1997.",
      "• Oil production reached approximately 500,000 barrels per day in 2006 under these agreements.",
      "• Azerbaijan is known for its \"oil spas\" in Naftalan, where visitors bathe in local crude oil, highlighting a unique aspect of its petroleum industry.",
      "• Historically, Azerbaijan was a leading caviar producer and exporter; currently, its fishing industry focuses on the declining stocks of sturgeon and beluga in the Caspian Sea.",
      "• The country faces common transition challenges shared by former Soviet republics, shifting from a command economy to a market economy, but its energy resources provide a positive outlook for long-term economic prospects.",
      "• Progress has been made in economic reforms, with gradual replacement of old economic ties and structures.",
      "• A significant obstacle to economic development and foreign investment is the ongoing conflict with Armenia over the Nagorno-Karabakh region.",
      "• Azerbaijan became a member of the Economic Cooperation Organization in 1992.",
      "• By 2002, Azerbaijan's merchant marine comprised 54 ships.",
      "• In 2010, Azerbaijan ranked among the top eight largest oil suppliers to European Union countries, with exports valued at €9.46 billion.",
      "• Foreign investments in Azerbaijan totaled $20 billion in 2011, representing a 61% increase compared to 2010.",
      "• According to Azerbaijani Minister of Economic Development Shahin Mustafayev, in 2011, approximately $15.7 billion was invested in the non-oil sector, with the remaining funds directed toward the oil sector.",
      "• Azerbaijani exports in 2006 contributed significantly to its economic profile, though specific figures are not provided in the excerpt.",
      "• Post-Soviet economic recovery led to predictions in 2012 that Azerbaijan would become the \"Tiger of the Caucasus.\"",
      "• The Globalization and World Cities Research Network ranked Baku as a Gamma-level global city in 2012, indicating its growing international importance.",
      "• In 2015, Azerbaijan and Turkey agreed to increase mutual trade to US$15 billion by 2023, reflecting regional economic cooperation efforts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:29:49.642467",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1971,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macroeconomic trend",
    "text": "Change in per capita GDP of Azerbaijan since 1973. Figures are inflation-\nadjusted to 2011 International dollars.\n\nThe following is a chart of trend of gross domestic product of Azerbaijan at\nmarket prices with figures in USD.\n\nYear | Gross domestic product PPP | Per capita income\n(as % of USA)\n---|---|---\n1995 | 19,497,000,000 | 8.78\n2000 | 29,683,000,000 | 10.01\n2005 | 59,087,000,000 | 15.52\n2010 | 138,947,000,000 | 31.78\n2015 | 169,789,000,000 | 32.15\n\nFor purchasing power parity comparisons, the US dollar was exchanged at\n1,565.88 Manats only. Currently, the new Manat is in use, with an exchange\nrate of about 1 manat = $0.59. Mean graduate pay was $5.76 per man-hour in\n2010.\n\nThe following table shows the main economic indicators in 1980–2017.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1993  | 27.4  | 3,658  | 1.3  | −27.4%  | 1,129.7%  | ...\n1995  | 20.0  | 2,610  | 2.4  | −13.0%  | 411.8%  | 19%\n2000  | 30.4  | 3,781  | 5.3  | 6.2%  | 1.8%  | 23%\n2005  | 61.3  | 7,252  | 13.3  | 28.0%  | 9.6%  | 14%\n2006  | 84.9  | 9,927  | 21.0  | 34.5%  | 8.2%  | 11%\n2007  | 109.3  | 12,619  | 33.1  | 25.5%  | 16.7%  | 8%\n2008  | 123.3  | 14,046  | 49.0  | 10.6%  | 20.8%  | 7%\n2009  | 135.9  | 15,231  | 44.3  | 9.4%  | 1.5%  | 12%\n2010  | 143.9  | 15,995  | 52.9  | 4.6%  | 5.7%  | 13%\n2011  | 144.5  | 15,861  | 66.0  | −1.6%  | 7.8%  | 11%\n2012  | 150.2  | 16,271  | 69.7  | 2.1%  | 1.1%  | 14%\n2013  | 161.6  | 17,277  | 74.2  | 5.9%  | 2.5%  | 13%\n2014  | 168.9  | 17,824  | 75.2  | 2.7%  | 1.5%  | 14%\n2015  | 171.8  | 17,915  | 50.8  | 0.6%  | 4.1%  | 35%\n2016  | 168.6  | 17,378  | 37.8  | −3.1%  | 12.6%  | 51%\n2017  | 171.8  | 17,492  | 41.4  | 0.1%  | 13.0%  | 55%\n\nSource: IMF\n\nFor more than a century the backbone of the Azerbaijani economy has been\npetroleum, which represented 50 percent of Azerbaijan's GDP in 2005, and is\nprojected to double to almost 125 percent of GDP in 2007. Now that Western oil\ncompanies are able to tap deep-water oilfields untouched by the Soviets\nbecause of poor technology, Azerbaijan is considered one of the most important\nareas in the world for oil exploration and development. Proven oil reserves in\nthe Caspian Basin, which Azerbaijan shares with Russia, Kazakhstan, Iran, and\nTurkmenistan, are comparable in size to the North Sea, although exploration is\nstill in the early stages.",
    "openai_summarised_points": [
      "• The section provides an overview of Azerbaijan's macroeconomic trends, focusing on changes in per capita GDP since 1973, with figures inflation-adjusted to 2011 International dollars.",
      "• It includes a chart illustrating Azerbaijan’s gross domestic product (GDP) at market prices in USD for selected years: 1995, 2000, 2005, 2010, and 2015.",
      "• In 1995, Azerbaijan’s GDP PPP was approximately $19.5 billion, with per capita income at 8.78% of the US level.",
      "• By 2000, GDP PPP increased to about $29.68 billion, with per capita income rising to 10.01% of the US.",
      "• In 2005, GDP PPP reached approximately $59.09 billion, with per capita income at 15.52% of the US.",
      "• In 2010, GDP PPP significantly grew to around $138.95 billion, with per capita income at 31.78% of the US.",
      "• By 2015, Azerbaijan’s GDP PPP was approximately $169.79 billion, with per capita income at 32.15% of the US.",
      "• For PPP comparisons, the US dollar was exchanged at 1,565.88 Manats; currently, the new Manat is in use with an exchange rate of about 1 manat = $0.59.",
      "• The mean graduate pay in 2010 was $5.76 per man-hour.",
      "• A comprehensive table presents key economic indicators from 1980 to 2017, including GDP (PPP and nominal), GDP per capita, real GDP growth rates, inflation rates, and government debt as a percentage of GDP.",
      "• In 1993, Azerbaijan’s GDP (PPP) was $27.4 billion, with GDP per capita at $3,658; real GDP declined by 27.4%, and inflation was extremely high at 1129.7%.",
      "• In 1995, GDP (PPP) decreased to $20 billion, with per capita income at $2,610; real GDP fell by 13%, and inflation was 411.8%; government debt was 19% of GDP.",
      "• By 2000, GDP (PPP) increased to $30.4 billion, with per capita income at $3,781; real GDP grew by 6.2%, inflation was 1.8%, and government debt was 23%.",
      "• In 2005, GDP (PPP) surged to $61.3 billion, with per capita income at $7,252; real GDP grew by 28%, inflation was 9.6%, and government debt decreased to 14%.",
      "• From 2006 to 2017, Azerbaijan experienced consistent GDP growth, with GDP (PPP) reaching $171.8 billion in 2015 and slightly declining to $168.6 billion in 2016 before rising again to $171.8 billion in 2017.",
      "• Per capita GDP (PPP) increased from $9,927 in 2006 to $17,492 in 2017, reflecting economic growth.",
      "• Real GDP growth rates varied, with notable increases of 34.5% in 2006 and 25.5% in 2007, and a decline of −3.1% in 2016.",
      "• Inflation rates fluctuated, reaching a high of 20.8% in 2008 and a low of 1.1% in 2012, with a peak of 13% in 2017.",
      "• Government debt as a percentage of GDP decreased to a low of 7% in 2008 but increased to 55% by 2017, indicating rising public debt levels.",
      "• Historically, petroleum has been the backbone of Azerbaijan’s economy for over a century, accounting for 50% of GDP in 2005.",
      "• Oil's contribution to GDP was projected to double from 50% in 2005 to nearly 125% in 2007, reflecting the sector’s dominance.",
      "• Western oil companies have gained access to deep-water oilfields previously inaccessible during Soviet times due to technological advancements.",
      "• Azerbaijan is now considered one of the world’s most significant areas for oil exploration and development.",
      "• Proven oil reserves in the Caspian Basin, shared with Russia, Kazakhstan, Iran, and Turkmenistan, are comparable in size to those in the North Sea, although exploration remains in early stages."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:30:05.587899",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2497,
      "bullet_points_count": 24
    }
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Agriculture",
    "text": "Azerbaijan has the largest agricultural basin in the region. About 54.9\npercent of Azerbaijan is agricultural lands. At the beginning of 2007 there\nwere 4.76 million hectares (11.8 million acres) of utilized agricultural area.\nIn the same year, the total wood resources counted 136 million cubic metres\n(178 million cubic yards). Azerbaijan's agricultural scientific research\ninstitutes are focused on meadows and pastures, horticulture and subtropical\ncrops, leaf vegetables, viticulture and wine-making, cotton growing and\nmedicinal plants. In some lands, it is profitable to grow grain, potatoes,\nsugar beets, cotton and tobacco. Livestock, dairy products, and wine and\nspirits are also important farm products. The Caspian fishing industry is\nconcentrated on the dwindling stocks of sturgeon and beluga.\n\nSome portions of most products that were previously imported from abroad have\nbegun to be produced locally (among them are Coca-Cola by Coca-Cola Bottlers\nLTD, beer by Baki-Kastel, parquet by Nehir and oil pipes by EUPEC Pipe Coating\nAzerbaijan).\n\nA new program which is prepared by the European Union is aimed to supporting\nthe economic diversification of Azerbaijan.",
    "openai_summarised_points": [
      "• Azerbaijan possesses the largest agricultural basin in the region, with approximately 54.9% of its territory designated as agricultural lands.",
      "• As of the beginning of 2007, Azerbaijan had 4.76 million hectares (11.8 million acres) of utilized agricultural area.",
      "• In 2007, the total wood resources in Azerbaijan were estimated at 136 million cubic metres (178 million cubic yards).",
      "• The country's agricultural scientific research institutes focus on several key areas, including meadows and pastures, horticulture and subtropical crops, leaf vegetables, viticulture and wine-making, cotton cultivation, and medicinal plants.",
      "• Certain lands in Azerbaijan are profitable for growing crops such as grain, potatoes, sugar beets, cotton, and tobacco.",
      "• Major farm products also include livestock, dairy products, and alcoholic beverages like wine and spirits.",
      "• The Caspian Sea fishing industry primarily targets the dwindling stocks of sturgeon and beluga fish.",
      "• Some products that were previously imported into Azerbaijan are now being produced domestically, including Coca-Cola (produced by Coca-Cola Bottlers LTD), beer (by Baki-Kastel), parquet flooring (by Nehir), and oil pipes (by EUPEC Pipe Coating Azerbaijan).",
      "• A new program, developed with support from the European Union, aims to promote economic diversification within Azerbaijan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:30:11.440469",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1177,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "Manufacturing",
    "text": "Marauder (Mine Protected Vehicle) is manufactured in Azerbaijan.\n\nIn 2007, mining and hydrocarbon industries accounted for well over 95 percent\nof the Azerbaijani economy. Diversification of the economy into manufacturing\nindustries remains a long-term issue.\n\nAs of the late 2000s, the defense industry of Azerbaijan has emerged as an\nautonomous entity with a growing defense production capability. The ministry\nis cooperating with the defense sectors of Ukraine, Belarus and Pakistan.\nAlong with other contracts, Azerbaijani defense industries and Turkish\ncompanies, Azerbaijan will produce 40 mm revolver grenade launchers, 107 mm\nand 122 mm MLRS systems, Cobra 4×4 vehicles and joint modernization of BTR\nvehicles in Baku.",
    "openai_summarised_points": [
      "• The Marauder (Mine Protected Vehicle) is manufactured in Azerbaijan, indicating the country's involvement in defense vehicle production.",
      "• In 2007, the mining and hydrocarbon industries together accounted for well over 95 percent of Azerbaijan's economy, highlighting the sector's dominance.",
      "• The diversification of Azerbaijan's economy into manufacturing industries has been identified as a long-term challenge, emphasizing the need for economic diversification beyond resource extraction.",
      "• By the late 2000s, Azerbaijan's defense industry had developed into an autonomous sector with an increasing capacity for defense production, reflecting growth and specialization in military manufacturing.",
      "• The Azerbaijani defense ministry has established cooperative relationships with the defense sectors of Ukraine, Belarus, and Pakistan, indicating international collaboration in defense technology and manufacturing.",
      "• Azerbaijan's defense industry, in partnership with Turkish companies, is involved in the production of various military equipment, including 40 mm revolver grenade launchers, 107 mm and 122 mm Multiple Launch Rocket Systems (MLRS), and Cobra 4×4 vehicles.",
      "• Additionally, Azerbaijan is engaged in the joint modernization of BTR (armored personnel carrier) vehicles in Baku, demonstrating efforts to upgrade and enhance existing military hardware."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:30:16.597700",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 726,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1.2.1",
    "section_name": "Financial and business services",
    "text": "The banking sector remains small in relation to the size of the Azerbaijani\neconomy."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1.2.2",
    "section_name": "Telecommunications",
    "text": "The Azerbaijan telecommunications sector is embroiled in corruption.\nAzerbaijan President Ilham Aliyev and his family own two of Azerbaijan's\nlargest mobile providers (Azerfon and Azercell) through offshore companies and\npotentially control three-quarters of the mobile market in Azerbaijan. The\nthird large mobile provider is Bakcell, which is registered as a company in an\noffshore tax haven and whose owners are unknown. Ownership of the mobile\nproviders in Azerbaijan enables the ruling Aliyev family to monitor phone\ncalls and internet activity.\n\nInvestigative reporting revealed that Azerbaijani President Ilham Aliyev and\nhis family made more than $1 billion when state shares of mobile operators\nwere transferred to a purportedly \"local partner\" which was in reality owned\nby the Aliyev family's offshore companies.\n\nAzerbaijan has relatively expensive call rates relative to comparable\ncountries. The high prices are possibly due to consolidated control of the\nmobile market and a lack of competition.\n\nThe Azerbaijan government has stated that it wants to create a high-tech\nsector in Azerbaijan."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "1.2.3",
    "section_name": "Tourism",
    "text": "Petroglyphs in Gobustan dating back to 10,000 BC indicating a thriving\nculture. It is a UNESCO World Heritage Site considered to be of \"outstanding\nuniversal value\".\n\nTourism is an important part of the economy of Azerbaijan. The country was a\nwell-known tourist spot in the 1980s. However, the fall of the Soviet Union,\nand the First Nagorno-Karabakh War during the 1988–1994 period, damaged the\ntourist industry and the image of Azerbaijan as a tourist destination.\n\nIt was not until the 2000s that the tourism industry began to recover, and the\ncountry has since experienced a high rate of growth in the number of tourist\nvisits and overnight stays. In recent years, Azerbaijan has also become a\npopular destination for religious, spa, and health care tourism. During\nwinter, the Shahdag Winter Complex offers skiing.\n\nThe government of Azerbaijan has set the development of Azerbaijan as an elite\ntourist destination a top priority. It is a national strategy to make tourism\na major, if not the single largest, contributor to the Azerbaijani economy.\nThese activities are regulated by the State Tourism Agency and the Ministry of\nCulture. The Formula One Grand Prix is held in Baku, the capital city, and has\nbeen held here for years."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Currency system",
    "text": "The Azerbaijani manat is the currency of Azerbaijani, denominated as the\nmanat, subdivided into 100 qapik. The manat is issued by the Central Bank of\nAzerbaijan, the monetary authority of Azerbaijan. The ISO 4217 abbreviation is\nAZN. The Latinised symbol is ().\n\nThe manat is held in a floating exchange-rate system, managed primarily\nagainst the US dollar. The rate of exchange (Azerbaijani manat per US$1) for\n28 January 2016, was AZN 1.60.\n\nThere is a complex relationship between Azerbaijan's balance of trade,\ninflation, measured by the consumer price index and the value of its currency.\nDespite allowing the value of the manat to \"float\", Azerbaijan's central bank\nhas decisive ability to control its value in relationship to other currencies."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Energy",
    "text": "The Baku-Tbilisi-Ceyhan pipeline (green) is one of several pipelines running\nfrom Baku.\n\nTwo-thirds of Azerbaijan is rich in oil and natural gas. The region of the\nLesser Caucasus accounts for most of the country's gold, silver, iron, copper,\ntitanium, chromium, manganese, cobalt, molybdenum, complex ore and antimony.\nIn September 1994, a 30-year contract was signed between the State Oil Company\nof Azerbaijan Republic (SOCAR) and 13 oil companies, among them Amoco, BP,\nExxonMobil, Lukoil and Statoil. As Western oil companies are able to tap deep-\nwater oilfields untouched by the Soviet exploitation, Azerbaijan is considered\none of the most important spots in the world for oil exploration and\ndevelopment. Azeriqaz, a sub-company of SOCAR, intends to ensure full\ngasification of the country by 2021."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Transportation",
    "text": "The convenient location of Azerbaijan on the crossroad of major international\ntraffic arteries, such as the Silk Road and the south–north corridor,\nhighlights the strategic importance of the transportation sector for the\ncountry's economy. The transport sector in the country includes roads,\nrailways, aviation, and maritime transport.\n\nAzerbaijan is also an important economic hub in the transportation of raw\nmaterials. The Baku-Tbilisi-Ceyhan pipeline (BTC) became operational in May\n2006 and extends more than 1,774 kilometers through the territories of\nAzerbaijan, Georgia and Turkey. The BTC is designed to transport up to 50\nmillion tons of crude oil annually and carries oil from the Caspian Sea\noilfields to global markets. The South Caucasus Pipeline, also stretching\nthrough the territory of Azerbaijan, Georgia and Turkey, became operational at\nthe end of 2006 and offers additional gas supplies to the European market from\nthe Shah Deniz gas field. Shah Deniz is expected to produce up to 296 billion\ncubic meters of natural gas per year. Azerbaijan also plays a major role in\nthe EU-sponsored Silk Road Project.\n\nIn 2012, the construction of Kars–Tbilisi–Baku railway expected to provide\ntransportation between Asia and Europe through connecting the railways of\nChina and Kazakhstan in the east with Turkey's Marmaray to the European\nrailway system in the west. Broad gauge railways in 2010 stretched for 2,918\nkm (1,813 mi) and electrified railways numbered 1,278 km (794 mi). By 2010,\nthere were 35 airports and one heliport."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Regulation",
    "text": "Single window system shares needed information through a single gateway with\nall organizations serving in trade field, as well as abolishes useless\nprocesses and raises the effectiveness of cooperation among different parties.\n73 economies implement single window system in the world. Azerbaijan started\nto implement this system in 2009. It implemented an E-Government portal as\nwell.\n\nA single-window system was established by a decree of the Azerbaijani\nPresident issued in 2007, 30 April, in order to simplify export-import\nprocedures, innovate customs services, and improve the trade environment. The\npresident appointed the State Customs Committee as the leading body of\ncontrolling goods and transportation passing through the borders of the\ncountry in 2008.\n\nThe State Migration Service issues appropriate permits for foreigners and\nstateless persons coming to Azerbaijan to live and work. The \"single window\"\nprinciple has been applied on migration management processes starting from 1\nJuly 2009 according to the Decree."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Poverty",
    "text": "As per the Asian Development Bank's estimates of 2017, 5.5% of the population\nof Azerbaijan lives below the poverty line in 2022. In the same ADB report, it\nwas estimated that for every 1000 babies born in Azerbaijan, 18 die before\ntheir 15th birthday."
  },
  {
    "chapter_name": "Economy of Azerbaijan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Other economic indicators",
    "text": "_Data from CIA World Factbook unless noted otherwise_\n\nInvestment (gross fixed)\n\n\n\n17% of GDP (2011 est.)\n\nHousehold income or consumption by percentage share\n\n\n\n* _lowest 10%:_ 3.4%\n* _highest 10%:_ 27.4% (2008)\n\nInflation rate (consumer prices)\n\n\n\n1.1% (2012 est.)\n\nAgriculture\n\n\n\n* _utilized agricultural land:_ 47,584 square kilometres (18,372 sq mi) (2011)\n* _total wood resources:_ 144,2 million cubic meters\n* _crops:_ cotton, rice and other grains, grapes, fruit, vegetables, tea, tobacco\n* _livestock products:_ beef, mutton, poultry, milk, eggs\n\nIndustrial production growth rate\n\n\n\n-3% (2011 est.)\n\nElectricity\n\n\n\n* _production:_ 22,55 billion kWh (2008)\n* _consumption:_ 18,8 billion kWh (2008)\n* _exports:_ 812 million kWh (2008)\n* _imports:_ 596 million kWh (2008)\n\nCurrent account balance\n\n\n\n* $11,12 billion (2011 est.)\n\nExports – commodities\n\n\n\n* petroleum and natural gas, petroleum products, oilfield equipment; steel, iron ore, cement; chemicals, petrochemicals, textiles, machinery, cotton, foodstuffs.\n\nReserves of foreign exchange and gold\n\n\n\n* $7,146 billion (2011 est.)\n\nDebt – external\n\n\n\n* $3.89 billion (2011 est.)\n\nCurrency\n\n\n\n* 1 Manat = 100 gepik\n\nExchange rates\n\n\n\n* Azerbaijani manat per US dollar – 1.7 (for 22 November 2020)\n* Azerbaijani manat per Euro – 2.01 (for 22 November 2020)\n\nFiscal year\n\n\n\n* Calendar year"
  }
]