[
  {
    "chapter_name": "Economy of Cameroon",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| This article was **imported from the CIA's _World Factbook_**. Please help\nrewrite this article.  \n---|---  \nCocoa Farm\n\nThe **economy of Cameroon** was one of the most prosperous in Africa for a\nquarter of a century after independence. The drop in commodity prices for its\nprincipal exports – petroleum, cocoa, coffee, and cotton – in the mid-1980s,\ncombined with an overvalued currency and economic mismanagement, led to a\ndecade-long recession. Real per capita GDP fell by more than 60% from 1986 to\n1994. The current account and fiscal deficits widened, and foreign debt grew.\nYet because of its oil reserves and favorable agricultural conditions,\nCameroon still has one of the best-endowed primary commodity economies in sub-\nSaharan Africa.",
    "openai_summarised_points": [
      "• The economy of Cameroon was among the most prosperous in Africa for approximately twenty-five years following its independence.",
      "• The principal exports of Cameroon included petroleum, cocoa, coffee, and cotton.",
      "• In the mid-1980s, Cameroon experienced a significant decline in commodity prices for these key exports.",
      "• Contributing to economic decline was an overvalued currency and widespread economic mismanagement.",
      "• The economic downturn resulted in a recession that lasted for about ten years.",
      "• Between 1986 and 1994, Cameroon’s real per capita GDP decreased by more than 60%.",
      "• During this period, Cameroon’s current account and fiscal deficits widened substantially.",
      "• The country’s foreign debt increased as a consequence of economic deterioration.",
      "• Despite these challenges, Cameroon maintained a strong endowment of primary commodities due to its oil reserves and favorable agricultural conditions.",
      "• As a result, Cameroon remains one of the best-endowed primary commodity economies in sub-Saharan Africa."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T19:00:32.804200",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 748,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Cameroon",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Agriculture",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( August 2024)_\n---|---\n\nIn 2018, Cameroon produced:\n\n* 5 million tons of cassava (13th largest producer in the world);\n* 3.9 million tonnes of plantain (3rd largest producer in the world, only behind Congo and Ghana);\n* 2.6 million tons of palm oil (7th largest producer in the world);\n* 2.3 million tons of maize;\n* 1.9 million tons of taro (3rd largest producer in the world, second only to Nigeria and China);\n* 1.4 million tons of sorghum;\n* 1.2 million tons of banana;\n* 1.2 million tons of sugarcane;\n* 1 million tons of tomato (19th largest producer in the world);\n* 674,000 tonnes of yam (7th largest producer in the world);\n* 594,000 tons of peanut;\n* 410,000 tons of sweet potato;\n* 402,000 tons of beans;\n* 332,000 tons of rice;\n* 310,000 tons of pineapple;\n* 307,000 tons of cocoa (5th largest producer in the world, after Ivory Coast, Ghana, Indonesia and Nigeria);\n* 302,000 tons of potato;\n* 301,000 tons of onion;\n* 249,000 tons of cotton.\n\nIn addition to smaller productions of other agricultural products, such as\ncoffee (33,000 tons) and natural rubber (55,000 tons)."
  },
  {
    "chapter_name": "Economy of Cameroon",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Finance and banking",
    "text": "Cameroon's financial system is the largest in the CEMAC region. Access to\nfinancial services is limited, particularly for SMEs. Aside from a traditional\ntendency for banks to prefer dealing with large, established companies,\ndetermining factors are also found in interest rates for loans to SMEs being\ncapped at 15 percent and being heavily taxed. As of 2006, bank loans to SMEs\nhardly reached 15 percent of total outstanding loans (Molua, 2002).\n\nLess than 5 percent of Cameroonians have access to a bank account. While the\nmicrofinance sector is consequently becoming increasingly important, its\ndevelopment is hampered by a loose regulatory and supervisory framework for\nmicrofinance institutions (MFIs). The banking sector is highly concentrated\nand dominated by foreign commercial banks. 6 out of the 11 largest commercial\nbanks are foreign-owned, and the three largest banks hold more than 50 percent\nof total financial system assets. While foreign banks generally display good\nsolvency ratios, small domestic banks are in a much weaker position. Their\ncapitalization is well below the average of banks in the CEMAC region and\ntheir profits are close to 2 percent, compared to 20 percent for foreign banks\nin the country. This is partially explained by the high levels of non-\nperforming loans, which reached 12 percent in 2007, leading to most banks\nholding large amounts of excess reserves as a percentage of deposits and large\nlevels of unutilized liquidity.\n\nIn 2018, Cameroon's financial system is being requested by the International\nMonetary Fund (IMF) to increase its tax base to cover the losses from the\nNorth-West and South-West Cameroon's regions instabilities, the loss of oil\nrevenue, the failure to deliver on port facilities, and the decline in oil\nproduction from mature oil fields."
  },
  {
    "chapter_name": "Economy of Cameroon",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Macro-economic trend",
    "text": "Cameroon became an oil-producing country in 1977. Claiming to want to make\nreserves for difficult times, the authorities manage \"off-budget\" oil revenues\nin total opacity (the funds are placed in Paris, Switzerland and New York\naccounts). Several billion dollars are thus diverted to the benefit of oil\ncompanies and regime officials. The influence of France and its 9,000\nnationals in Cameroon remains considerable. African Affairs magazine noted in\nthe early 1980s that they \"continue to dominate almost all key sectors of the\neconomy, much as they did before independence. French nationals control 55% of\nthe modern sector of the Cameroonian economy and their control over the\nbanking system is total.\n\nRecent signs, however, are encouraging. As of March 1998, Cameroon's fifth IMF\nprogram – a 3-year enhanced structural adjustment program approved in August\n1997 – is on track. Cameroon has rescheduled its Paris Club debt at favorable\nterms. GDP has grown by about 5% a year beginning in 1995. There is cautious\noptimism that Cameroon is emerging from its long period of economic hardship.\n\nCameroonian exports in 2006\n\nThe Enhanced Structural Adjustment Facility (ESAF) signed recently by the IMF\nand Government of Cameroon calls for greater macroeconomic planning and\nfinancial accountability; privatization of most of Cameroon's nearly 100\nremaining non-financial parastatal enterprises; elimination of state marketing\nboard monopolies on the export of cocoa, certain coffees, and cotton;\nprivatization and price competition in the banking sector; implementation of\nthe 1992 labor code; a vastly improved judicial system; and political\nliberalization to boost investment.\n\nFrance is Cameroon's main trading partner and source of private investment and\nforeign aid. Cameroon has an investment guaranty agreement and a bilateral\naccord with the United States. USA investment in Cameroon is about $1 million,\nmost of it in the oil sector. Inflation has been brought back under control.\nCameroon aims at becoming emerging by 2035.\n\nThe government embarked upon a series of economic reform programs supported by\nthe World Bank and International Monetary Fund (IMF) beginning in the late\n1980s. Many of these measures have been painful; the government slashed civil\nservice salaries by 65% in 1993. The CFA franc – the common currency of\nCameroon and 13 other African states – was devalued by 50% in January 1994.\nThe government failed to meet the conditions of the first four IMF programs.\n\nThis is a chart of trend of gross domestic product of Cameroon at market\nprices estimated by the International Monetary Fund with figures in millions\nof Central African CFA Francs.\n\nPineapple 'Victoria', grown in Cameroon Year | Gross Domestic Product | US Dollar Exchange\n---|---|---\n1980 | 1,600,186 | 209.20 Francs\n1985 | 4,355,977 | 471.12 Francs\n1990 | 3,804,428 | 300.65 Francs\n1995 | 4,686,286 | 518.62 Francs\n2000 | 6,612,385 | 658.21 Francs\n2005 | 8,959,279 | 527.29 Francs\n\nThe following table shows the main economic indicators in 1980–2022. Inflation\nbelow 5% is in green.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP growth (real) | Inflation rate (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1980  | 11.1  | 1,263  | 8.85  | 9.9%  | 7.7%  | n/a\n1981  | 14.3  | 1,572  | 10.03  | 17.1%  | 7.5%  | n/a\n1982  | 16.3  | 1,747  | 9.62  | 7.6%  | 15.3%  | n/a\n1983  | 18.1  | 1,887  | 9.69  | 6.8%  | 20.5%  | n/a\n1984  | 20.1  | 2,047  | 10.24  | 7.5%  | 12.1%  | n/a\n1985  | 22.4  | 2,223  | 10.70  | 8.1%  | 4.2%  | n/a\n1986  | 24.4  | 2,357  | 13.95  | 6.8%  | 4.3%  | n/a\n1987  | 24.5  | 2,298  | 16.15  | -2.2%  | 2.8%  | n/a\n1988  | 23.4  | 2,129  | 16.40  | -7.9%  | 1.7%  | n/a\n1989  | 23.9  | 2,110  | 14.63  | -1.8%  | 1.6%  | n/a\n1990  | 23.2  | 1,992  | 14.64  | -6.2%  | 1.5%  | n/a\n1991  | 23.1  | 1,922  | 16.33  | -3.8%  | -0.6%  | n/a\n1992  | 22.9  | 1,850  | 14.96  | -3.1%  | 1.9%  | n/a\n1993  | 22.7  | 1,780  | 15.61  | -3.2%  | -3.7%  | n/a\n1994  | 22.6  | 1,722  | 10.62  | -2.5%  | 12.7%  | n/a\n1995  | 23.9  | 1,766  | 10.08  | 3.3%  | 25.8%  | n/a\n1996  | 25.5  | 1,836  | 11.23  | 4.9%  | 3.9%  | n/a\n1997  | 27.3  | 1,913  | 11.35  | 5.3%  | 4.8%  | n/a\n1998  | 29.0  | 1,974  | 11.34  | 4.9%  | 3.2%  | 68%\n1999  | 30.6  | 2,026  | 11.55  | 4.1%  | 1.8%  | 68%\n2000  | 32.3  | 2,084  | 10.25  | 3.4%  | 1.2%  | 76%\n2001  | 34.2  | 2,145  | 10.95  | 3.4%  | 4.5%  | 62%\n2002  | 36.4  | 2,224  | 12.37  | 4.8%  | 2.8%  | 57%\n2003  | 38.9  | 2,318  | 15.94  | 5.0%  | 0.6%  | 52%\n2004  | 42.6  | 2,469  | 18.80  | 6.6%  | 0.3%  | 52%\n2005  | 44.5  | 2,509  | 19.53  | 1.2%  | 2.0%  | 44%\n2006  | 47.5  | 2,605  | 20.91  | 3.5%  | 4.9%  | 18%\n2007  | 50.8  | 2,710  | 23.93  | 4.1%  | 1.1%  | 14%\n2008  | 53.2  | 2,764  | 27.71  | 2.9%  | 5.3%  | 11%\n2009  | 55.0  | 2,777  | 27.90  | 2.6%  | 3.0%  | 11%\n2010  | 57.2  | 2,814  | 27.53  | 2.9%  | 1.3%  | 14%\n2011  | 60.5  | 2,892  | 30.63  | 3.5%  | 3.0%  | 15%\n2012  | 63.6  | 2,959  | 30.17  | 4.5%  | 2.4%  | 15%\n2013  | 69.1  | 3,130  | 33.73  | 5.0%  | 2.1%  | 17%\n2014  | 75.1  | 3,313  | 36.40  | 5.8%  | 1.9%  | 21%\n2015  | 79.1  | 3,396  | 32.21  | 5.6%  | 2.7%  | 32%\n2016  | 84.4  | 3,527  | 33.81  | 4.5%  | 0.9%  | 32%\n2017  | 90.0  | 3,665  | 36.09  | 3.5%  | 0.6%  | 37%\n2018  | 95.9  | 3,803  | 39.99  | 4.0%  | 1.1%  | 38%\n2019  | 101.0  | 3,901  | 39.67  | 3.4%  | 2.5%  | 42%\n2020  | 102.7  | 3,870  | 40.86  | 0.5%  | 2.5%  | 45%\n2021  | 110.9  | 4,073  | 45.39  | 3.6%  | 2.3%  | 46%\n2022  | 123.3  | 4,419  | 44.32  | 3.8%  | 4.6%  | 47%"
  },
  {
    "chapter_name": "Economy of Cameroon",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Gallery",
    "text": "* Douala\n\n* A touristic area in Limbe\n\n* Yaoundé Sport palace\n\n* A Fulani herder drives his cattle in northern Cameroon.\n\n* Douala International Airport\n\n* Intercity buses in transit during the night (Touristique Express)\n\n* Interurban passenger train on the move in Cameroon (Douala-Yaounde-Ngaoundere)\n\n* Douala Seaport\n\n* A truck transporting beers to various localities in Cameroon"
  }
]