[
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The economy of Bangladesh is a major developing mixed economy. As the second-\nlargest economy in South Asia, Bangladesh's economy is the 35th largest in the\nworld in nominal terms, and 25th largest by purchasing power parity.\nBangladesh is seen by various financial institutions as one of the Next\nEleven. It has been transitioning from being a frontier market into an\nemerging market. Bangladesh is a member of the South Asian Free Trade Area and\nthe World Trade Organization. In fiscal year 2021–2022, Bangladesh registered\na GDP growth rate of 7.2% after the global pandemic. Bangladesh is one of the\nfastest growing economies in the world.\n\nIndustrialisation in Bangladesh received a strong impetus after the partition\nof India due to labour reforms and new industries. Between 1947 and 1971, East\nBengal generated between 70% and 50% of Pakistan's exports. Modern Bangladesh\nembarked on economic reforms in the late 1970s which promoted free markets and\nforeign direct investment. By the 1990s, the country had a booming ready-made\ngarments industry. As of 16 March 2024, Bangladesh has the highest number of\ngreen garment factories in the world with Leadership in Energy and\nEnvironmental Design (LEED) certification from the United States Green\nBuilding Council (USGBC), where 80 are platinum-rated, 119 are gold-rated, 10\nare silver, and four are without any rating. As of 6 March 2024, Bangladesh is\nhome to 54 of the top 100 LEED Green Garment Factories globally, including 9\nout of the top 10, and 18 out of the top 20. As of 27 April 2024, Bangladesh\nhas a growing pharmaceutical industry with 12 percent average annual growth\nrate. Bangladesh is the only nation among the 48 least-developed countries\nthat is almost self-sufficient when it comes to medicine production as local\ncompanies meet 98 percent of the domestic demand for pharmaceuticals.\nRemittances from the large Bangladeshi diaspora became a vital source of\nforeign exchange reserves. Agriculture in Bangladesh is supported by\ngovernment subsidies and ensures self-sufficiency in food production.\nBangladesh has pursued export-oriented industrialisation.\n\nBangladesh experienced robust growth after the pandemic with macroeconomic\nstability, improvements in infrastructure, a growing digital economy, and\ngrowing trade flows. Tax collection remains very low, with tax revenues\naccounting for only 7.7% of GDP. Bangladesh's banking sector has a large\namount of non-performing loans or loan defaults, which have caused a lot of\nconcern. The private sector makes up 80% of GDP. The Dhaka Stock Exchange and\nChittagong Stock Exchange are the two stock markets of the country. Most\nBangladeshi businesses are privately owned small and medium-sized enterprises\n(SME) which make up 90% of all businesses."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.1",
    "section_name": "Precolonial period",
    "text": "This African giraffe was imported into Bengal region and re-exported to China\ncirca 1415. The major maritime trade routes of the Bengal Sultanate\n\nPunch-marked coins are the earliest form of currency found in Bangladesh\n(Bengal region of Ancient India), dating back to the Iron Age and the first\nmillennium BCE. 1st century Roman coins with images of Hercules have been\nexcavated in Bangladesh and point to trade links with the Roman world. The\nWari-Bateshwar ruins are believed to be the emporium (trading center) of\nSounagoura mentioned by Roman geographer Claudius Ptolemy. The eastern segment\nof Bengal was a historically prosperous region. The Ganges Delta provided\nadvantages of a mild, almost tropical climate, fertile soil, ample water, and\nan abundance of fish, wildlife, and fruit. Living standards for the elite were\ncomparatively better than other parts of the Indian subcontinent. Trade routes\nlike the Grand Trunk Road, Tea Horse Road and Silk Road connected the region\nto the wider neighborhood. Between 400 and 1200, the region had a well-\ndeveloped economy in terms of land ownership, agriculture, livestock,\nshipping, trade, commerce, taxation, and banking. Muslim trade with Bengal\nincreased after the fall of the Sasanian Empire and the Arab takeover of\nPersian trade routes. Much of this trade occurred east of the Meghna River in\nsoutheastern Bengal. After 1204, Muslim conquerors inherited the gold and\nsilver reserves of pre-Islamic kingdoms.\n\nThe Bengal Sultanate presided over a mercantile empire of its own. Bengali\nships were the largest ships in the Bay of Bengal and other parts of the\nIndian Ocean trade network. Ship-owning merchants often acted as royal envoys\nof the Sultan. A large number of wealthy Bengali merchants and shipowners\nlived in Malacca. A vessel from Bengal transported embassies from Brunei and\nSumatra to China. Bengal and the Maldives operated the largest shell currency\nnetwork in history. A Masai giraffe from Malindi in Africa was shipped to\nBengal and later gifted to the Emperor of China as a gift from the Sultan of\nBengal. The rulers of Arakan looked to Bengal for economic, political and\ncultural capital. The Sultan of Bengal financed projects in the Hejaz region\nof Arabia.\n\nUnder Mughal rule, Bengal operated as a centre of the worldwide muslin, silk\nand pearl trades. Domestically, much of India depended on Bengali products\nsuch as rice, silks and cotton textiles. Overseas, Europeans depended on\nBengali products such as cotton textiles, silks and opium; Bengal accounted\nfor 40% of Dutch imports from Asia, for example. Bengal shipped saltpeter to\nEurope, sold opium in Indonesia, exported raw silk to Japan and the\nNetherlands, and produced cotton and silk textiles for export to Europe,\nIndonesia and Japan. Real wages and living standards in 18th-century Bengal\nwere comparable to Britain, which in turn had the highest living standards in\nEurope.\n\nDuring the Mughal era, the most important centre of cotton production was\nBengal, particularly around its capital city of Dhaka, leading to muslin being\ncalled \"daka\" in distant markets such as Central Asia. Bengali\nagriculturalists rapidly learned techniques of mulberry cultivation and\nsericulture, establishing Bengal as a major silk-producing region of the\nworld. Bengal accounted for more than 50% of textiles and around 80% of silks\nimported by the Dutch from Asia, for example.\n\nBengal also had a large shipbuilding industry. The shipbuilding output of\nBengal during the sixteenth and seventeenth centuries was 223,250 tons\nannually, compared with 23,061 tons produced in nineteen colonies in North\nAmerica from 1769 to 1771. The region was also a center of ship-repairing.\nBengali shipbuilding was advanced compared to European shipbuilding at the\ntime. An important innovation in shipbuilding was the introduction of a\nflushed deck design in Bengal rice ships, resulting in hulls that were\nstronger and less prone to leak than the structurally weak hulls of\ntraditional European ships built with a stepped deck design. The English East\nIndia Company later duplicated the flushed-deck and hull designs of Bengal\nrice ships in the 1760s, leading to significant improvements in seaworthiness\nand navigation for European ships during the Industrial Revolution. Among the\noldest businesses from the pre-colonial and Mughal periods, the biryani\nrestaurant Fakhruddin's traces its history to the era of the Nawabs of Bengal."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.2",
    "section_name": "Colonial period",
    "text": "The _Barkentine Linnet_ , a ship built in Chittagong, off the coast of Hong\nKong circa 1890\n\nThe British East India Company, that took complete control of Bengal in 1793\nby abolishing Nizamat (local rule), chose to develop Calcutta, now the capital\ncity of West Bengal, as their commercial and administrative center for the\nCompany-held territories in South Asia. The development of East Bengal was\nthereafter limited to agriculture. The administrative infrastructure of the\nlate eighteenth and nineteenth centuries focused on East Bengal's function as\na primarily agricultural producer—chiefly of rice, tea, teak, cotton, sugar\ncane and jute — for processors and traders in the British Empire. British rule\nsaw the introduction of railways. The Hardinge Bridge was built to carry\ntrains across the Padma River. In the early 20th century, Eastern Bengal and\nAssam was established in the British Raj to promote jobs, education and\ninvestment in East Bengal. In 1928, the Port of Chittagong was declared to be\na \"Major Port\" of British India. East Bengal extended its rice economy into\nArakan Division in British Burma. The river and sea ports of East Bengal,\nincluding Goalundo Ghat, the Port of Dhaka, the Port of Narayanganj, and the\nPort of Chittagong became entrepots for trade between Bengal, Assam and Burma.\nSome of Bangladesh's venerable and oldest companies were born in British\nBengal, including A K Khan & Company, M. M. Ispahani Limited, James Finlay\nBangladesh, and Anwar Group of Industries.[_citation needed_]"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3",
    "section_name": "Pakistan period",
    "text": "Tannery owners with members of the Directorate of Industries, Government of\nEast Bengal in 1949 In the 1950s and 1960s, Adamjee Jute Mills was the largest\njute processing plant in the world.\n\nThe partition of India changed the economic geography of the region. The\nPakistani government in East Bengal prioritized industries based on local raw\nmaterials like jute, cotton, and leather. The Korean War drove up demand for\njute products. Adamjee Jute Mills, the world's largest jute processing plant,\nwas built in the Port of Narayanganj. The plant was a symbol of East\nPakistan's industrialization. Living standards began to gradually improve.\nLabor reforms in 1958 eventually benefitted a future independent Bangladesh to\ndevelop industry. Free market principles were generally accepted. The\ngovernment promoted an industrial policy which aimed to produce consumer goods\nas quickly as possible in order to avoid dependence on imports. Certain\nsectors, like public utilities, fell under state ownership. Natural gas in\nSylhet was discovered by the Burmah Oil Company in 1955. By the late 1960s,\nEast Pakistan's share of Pakistan's exports went down from 70% to 50%.\n\nPakistan's rulers launched a so-called \"Decade of Development\" that \"resulted\nin numerous economic and social contradictions, which played themselves out,\nnot just in the 1960s, but beyond, where Ayub Khan's rule created the social\nand economic conditions leading to the separation of East Pakistan\". According\nto the World Bank, economic discrimination against East Pakistan included\ndiverting foreign aid and other funds to West Pakistan, the use of East\nPakistan's foreign-exchange surpluses to finance West Pakistani imports, and\nrefusal by the central government to release funds allocated to East Pakistan.\nRehman Sobhan paraphrased the Two-Nation Theory into the Two Economies Theory\nby arguing that East and West Pakistan diverged and became two different\neconomies within one country."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.1",
    "section_name": "Socialist era (1972–1975)",
    "text": "After its independence from Pakistan, Bangladesh initially followed a\nsocialist economy for five years, which proved to be a blunder by the Sheikh\nMujibur Rahman-led Awami League government. During Mujib era, the state\ndevelopment strategy envolved every possible way to the extension of\nprotectionism. Private companies had to operate under heavy regulation and\nrestrictions. For example, profit limits were imposed on companies. Any\ncompany with revenues or profits above the limit were susceptible to\nnationalization. The state nationalized all banks, insurance companies, and\n580 industrial plants. Many of the nationalized industries were abandoned by\nWest Pakistanis during the war; while many pro-Awami League and other Bengali\nbusinesses also suffered nationalization of properties and industries. The\nAwami League initiated work for the Ghorashal Fertilizer Factory and the\nAshuganj Power Station. In spite of restrictions, several of Bangladesh's\nleading companies in the future were founded during this period, including\nBEXIMCO and Advanced Chemical Industries. Land ownership was restricted to\nless than 25 _bighas_. Land owners with more than 25 _bighas_ were subjected\nto taxes. Farmers had to sell their products at prices set by the government\ninstead of the market.\n\nSince Bangladesh followed a socialist economy, it underwent a slow growth of\nproducing experienced entrepreneurs, managers, administrators, engineers, and\ntechnicians. There was hardly any foreign investment. There were critical\nshortages of essential food grains and other staples because of wartime\ndisruptions. External markets for jute had been lost because of the\ninstability of supply and the increasing popularity of synthetic substitutes.\nForeign exchange resources were minuscule, and the banking and monetary\nsystems were unreliable. Although Bangladesh had a large work force, the vast\nreserves of under trained and underpaid workers were largely illiterate,\nunskilled, and underemployed. Commercially exploitable industrial resources,\nexcept for natural gas, were lacking. Inflation, especially for essential\nconsumer goods, ran between 300 and 400 percent.\n\nThe war of independence had crippled the transportation system. Hundreds of\nroad and railroad bridges had been destroyed or damaged, and rolling stock was\ninadequate and in poor repair. The new country was still recovering from a\nsevere cyclone that hit the area in 1970 and caused 250,000 deaths. India came\nforward immediately with critically measured economic assistance in the first\nmonths after Bangladesh achieved independence from Pakistan. Between December\n1971 and January 1972, India committed US$232 million in aid to Bangladesh\nfrom the politico-economic aid India received from the US and USSR."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.2",
    "section_name": "Military rule and economic reforms (1975–1990)",
    "text": "After 1975 coups, new Bangladeshi military leaders began to promote private\nindustry and turned their attention to developing new industrial capacity and\nrehabilitating the economy. The socialist economic model adopted by early\nleaders had resulted in inefficiency and economic stagnation. Beginning in\nlate 1975, the government gradually gave greater scope to private sector\nparticipation in the economy, a pattern that has continued since then.\n\nAfter Lt. Gen. Ziaur Rahman's ascension to the power in 1975, new strategy was\ntaken to encourage private enterprise with a primary goal of maximization of\nGNP growth rate. Zia's government revised the First Five-Year Plan (1973–1978)\ntaken by the Mujib government and formulated a \"Three year hard core plan\" for\nremaining three years. This was followed by the Two-Year Plan (1978-80) and\nthe Second Five Year Plan (1980-85). The government also established special\neconomic zones called Export Processing Zones (EPZs) to attract investors and\npromote export industries. These zones have played a key role in Bangladesh's\nexport economy. The government also de-nationalized and privatized state-owned\nindustries by either returning them to their original owners or selling them\nto private buyers. Meanwhile, inefficiency in the public sector gradually\nincreased; and left-wing opposition grew against the export of natural gas.\n\nThe 1980s saw the emergence of dynamic local brands like PRAN. Muhammad Yunus\nbegan experimenting with microcredit in the late 1970s. In 1983, the Grameen\nBank was established. Bangladesh became the pioneer of the modern microcredit\nindustry, with leading players like Grameen Bank, BRAC and Proshika. In the\nindustrial sector, two policy innovations in the mid-1980s helped exporters.\nThe reforms introduced the back-to-back letter of credit and duty-drawback\nfacilities through bonded warehouses. These reforms removed major constraints\nfor the country's fledgling garment industry. The reforms allowed a garment\nmanufacturer to obtain letters of credit from domestic banks to finance its\nimport of inputs, by showing letters of credit from foreign buyers of\ngarments. The reforms also reimbursed manufacturers the duty paid on imported\ninputs on proof that the inputs, stored in bonded warehouses, had been used to\nmanufacture the exports. These reforms spurred the growth of industry into the\nworld's second largest textile exporting sector.\n\nIn the mid-1980s, there were encouraging signs of progress. Economic policies\naimed at encouraging private enterprise and investment, privatising public\nindustries, reinstating budgetary discipline, and liberalising the import\nregime were accelerated. The International Finance Investment and Commerce\nBank was set up as a multinational bank for Bangladesh, Nepal and the\nMaldives."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.3",
    "section_name": "Economic growth (1991–2022)",
    "text": "Jamuna Bridge opened in 1998. Between 1988 and 1998, Bangladesh expanded its\nrural road network from 3000 km to 15,500 km. Construction of Padma Bridge,\nwhich opened in 2022\n\nFrom 1991 to 1993, the government engaged in an enhanced structural adjustment\nfacility (ESAF) with the International Monetary Fund (IMF). A series of\neconomic liberalization measures was introduced by finance minister Saifur\nRahman, including opening up sectors like telecom to foreign investment. The\nChittagong Stock Exchange was also set up. The 1990s was a boon for the\nprivate sector. Banking, telecommunications, aviation and tertiary education\nsaw new private players and increased competition. The pharmaceutical industry\nin Bangladesh grew to meet 98% of domestic demand. The ceramics industry in\nBangladesh developed to meet local demand for 96% of tableware ceramics, 77%\nof tiles and 89% of sanitary ceramics. The Chittagong-based steel industry in\nBangladesh exploited scrap steel from ship-breaking yards and started\ncontributing to shipbuilding in Bangladesh.\n\nBut the government failed to sustain reforms in large part because of\npreoccupation with the government's domestic political troubles, including\ntensions between the Awami League, the Bangladesh Nationalist Party (BNP) and\nJatiya Party. Frequent hartals and strikes disrupted the economy. In the late\n1990s the government's economic policies became more entrenched, and some\ngains were lost, which was highlighted by a precipitous drop in foreign direct\ninvestment in 2000 and 2001. Many new private commercial banks were given\nlicenses to operate.\n\nBetween 2001 and 2006, annual GDP growth touched an average of 5-6%. In June\n2003 the IMF approved 3-year, $490-million plan as part of the Poverty\nReduction and Growth Facility (PRGF) for Bangladesh that aimed to support the\ngovernment's economic reform programme up to 2006. Seventy million dollars was\nmade available immediately. In the same vein the World Bank approved $536\nmillion in interest-free loans. The economy saw continuous real GDP growth of\nat least 6% since 2009. Bangladesh emerged as one of the fastest growing\neconomies.\n\nAccording to economist Syed Akhtar Mahmood, the Bangladeshi government is\noften seen as the villain in the country's economic story. But government has\nplayed an important role in stimulating the economy through building\ninfrastructure, liberalizing regulations, and promoting high yielding crops in\nagriculture. According to Mahmood, \"[m]ost roads linking the villages with one\nanother, and with the cities, were not paved and not accessible throughout the\nyear. This situation was remarkably transformed within a span of 10 years,\nfrom 1988 to 1997, with the construction of the so-called feeder roads. In\n1988, Bangladesh had about 3,000 kilometers of feeder roads. By 1997, this\nnetwork expanded to 15,500 kilometers. These \"last-mile\" all-weather roads\nhelped connect the villages of Bangladesh to the rest of the country\".\n\nAs a result of export-led growth, Bangladesh has enjoyed a trade surplus in\nrecent years. Bangladesh historically has run a large trade deficit, financed\nlargely through aid receipts and remittances from workers overseas. Foreign\nreserves dropped markedly in 2001 but stabilised in the US$3 to US$4 billion\nrange (or about 3 months' import cover). In January 2007, reserves stood at\n$3.74 billion, and then increased to $5.8 billion by January 2008, in November\n2009 it surpassed $10.0 billion, and as of April 2011 it surpassed the US$12\nbillion according to the Bank of Bangladesh, the central bank. The dependence\non foreign aid and imports has also decreased gradually since the early 1990s.\nForeign aid now accounts for only 2% of GDP.\n\nIn the last decade, poverty dropped by around one third with significant\nimprovements in the human development index, literacy, life expectancy and per\ncapita food consumption. With the economy growing annually at an average rate\nof 6% over a prolonged period, more than 15 million people have moved out of\npoverty since 1992. The poverty rate went down from 80% in 1971 to 44.2% in\n1991 to 12.9% in 2021. In recent years, Bangladesh has focused on promoting\nregional trade and transport links. The Bangladesh Bhutan India Nepal Motor\nVehicles Agreement seeks to create hassle free road transport across\ninternational borders. Bangladesh also signed a coastal shipping agreement\nwith India. While prioritizing food security in the domestic market,\nBangladesh exports more than US$1 billion worth of processed food products. As\nthe result of a robust agricultural supply chain, supermarkets have sprung up\nin cities and towns across the country.\n\nBangladesh became the second largest textile exporter in the world. An\nestimated 4.4 million workers are employed in the garments industry, with the\nmajority being women. The sector contributes 11% of Bangladesh's GDP. The 2013\nRana Plaza factory collapse caused global concern on industrial safety in\nBangladesh, leading to the formation of the Accord on Fire and Building Safety\nin Bangladesh and the Alliance for Bangladesh Worker Safety. The local\nclothing industry has seen fiercely competitive brands vying for the market,\nincluding Aarong, Westecs, Ecstasy, and Yellow among many others.\n\nThe World Bank notes the economic progress of the country by stating that\n\"[w]hen the newly independent country of Bangladesh was born on December 16,\n1971, it was the second poorest country in the world—making the country's\ntransformation over the next 50 years one of the great development stories.\nSince then, poverty has been cut in half at record speed. Enrolment in primary\nschool is now nearly universal. Hundreds of thousands of women have entered\nthe workforce. Steady progress has been made on maternal and child health. And\nthe country is better buttressed against the destructive forces posed by\nclimate change and natural disasters. Bangladesh's success comprises many\nmoving parts—from investing in human capital to establishing macroeconomic\nstability. Building on this success, the country is now setting the stage for\nfurther economic growth and job creation by ramping up investments in energy,\ninland connectivity, urban projects, and transport infrastructure, as well as\nprioritizing climate change adaptation and disaster preparedness on its path\ntoward sustainable growth\".\n\nAs of 2022, Bangladesh had the second largest foreign-exchange reserves in\nSouth Asia. In 2021, Bangladesh surpassed both India and Pakistan in terms of\nper capita income. The country achieved 100% electricity coverage for\nhouseholds in 2022. Megaprojects like the Padma Bridge, Dhaka Metro, Matarbari\nPort, and Karnaphuli Tunnel have been planned to stimulate economic activity.\nThe completion of Padma Bridge was expected to boost Bangladeshi GDP by 1.23%."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "0.3.4",
    "section_name": "Economic depression (2022–present)",
    "text": "Following the Russian invasion of Ukraine, Bangladesh experienced pressure on\nits foreign exchange reserves due to rising import costs; this affected the\ncountry's electricity sector which relies on imported fuel; rising import\nprices also contributed to inflation. International Monetary Fund (IMF) had\nforecasted Consumer Price Index (CPI) in Bangladesh to rise to 5.9% by the\nyear 2022. According to the Bangladesh Bureau of Statistics, general inflation\nclimbed to 6.17% by February 2022.\n\nDue to the mass uprising and subsequent violence of July–August 2024,\nBangladeshi economy witnessed a huge loss. Bangladesh's economy suffered\nlosses of over $1.2 billion as a result of the nationwide curfew and protests.\nAs per the South Asia Development Update, the World Bank revised its economic\ngrowth forecast from 5.7% in April 2024 to 4% in October for the financial\nyear 2025. Political instability exacerbated preexisting inflation. Food\ninflation under the incumbent interim government reached 14% and general\ninflation 11%. A sudden sharp rise in inflation in July 2024 was mostly\nattributed to the political turmoil facing Bangladesh; after momentary\nstabilization, inflation once again begun to increase. The general inflation\nrate in Bangladesh reached 10.87%, up from 9.92% in September 2024.[_improper\nsynthesis?_] In November 2024, the International Crisis Group (ICG) said\n\"early signs suggest that policymakers can avoid a Sri Lanka-style economic\ncrash\" and added exchange rate reforms helped improve foreign reserves while\ninflation had declined from its peak, although it warned that \"serious\neconomic risks remain\". The crisis group also said that long-term economic\nreform was \"far longer\" than the interim governments \"likely lifespan\",\nstating that the government was focused on \"short-term macro-economic\npriorities\" such as inflation, foreign reserves and economic stability.\n\nOn April 2025, the Trump administration imposed 37% \"reciprocal\" tariff on\nBangladesh, which is second highest in South Asia just after Sri Lanka (44%).\n_New York Times_ described it a major blow particularly for the garments\nindustry of Bangladesh. Many US buyers started to halt orders saying that it\nwas to costly to bear the import tariffs."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "GDP per capita development since 1950\n\nThis is a chart of trend of gross domestic product of Bangladesh at market\nprices estimated by the International Monetary Fund with figures in millions\nof Bangladeshi Taka. However, this reflects only the formal sector of the\neconomy.\n\nYear | Gross\nDomestic\nProduct\n(Million Taka) | US Dollar\nExchange | Inflation\nindex\n(2000=100) | Per capita\nincome\n(as % of USA)\n---|---|---|---|---\n1980 | 250,300 | 16.10 Taka | 20 | 1.79\n1985 | 597,318 | 31.00 Taka | 36 | 1.19\n1990 | 1,054,234 | 35.79 Taka | 58 | 1.16\n1995 | 1,594,210 | 40.27 Taka | 78 | 1.12\n2000 | 2,453,160 | 52.14 Taka | 100 | 0.97\n2005 | 3,913,334 | 63.92 Taka | 126 | 0.95\n2008 | 5,003,438 | 68.65 Taka | 147 |\n2015 | 17,295,665 | 78.15 Taka | 196 | 2.48\n2019 | 26,604,164 | 84.55 Taka |  | 2.91\n\nMean wages were $0.58 per man-hour in 2009."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "GDP per capita (nominal)",
    "text": "**Historical evolution of GDP per capita (Nominal) of Bangladesh during the\nperiod 1980-2030**\n\n**Source:International Monetary Fund (IMF)**"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "1.2",
    "section_name": "GDP per capita (PPP)",
    "text": "**Historical evolution of GDP per capita (PPP) of Bangladesh during the period\n1980-2030**\n\n**Source:International Monetary Fund (IMF)**\n\nThe following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation below 5% is in green. The annual\nunemployment rate is extracted from the World Bank, although the International\nMonetary Fund find them unreliable.\n\nYear  | GDP (in Bil. US$PPP) | GDP per capita (in US$ PPP) | GDP (in Bil. US$nominal) | GDP per capita (in US$ nominal) | GDP growth (real) | Inflation rate (in Percent) | Unemployment (in Percent) | Government debt (in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 40.7  | 511.2  | 22.6  | 283.3  | 3.1%  | 7.7%  | n/a  | n/a\n1981  | 47.1  | 575.4  | 22.4  | 273.4  | 4.3%  | 14.9%  | n/a  | n/a\n1982  | 51.6  | 614.3  | 20.9  | 249.4  | 2.4%  | 13.7%  | n/a  | n/a\n1983  | 56.1  | 650.7  | 20.3  | 235.4  | 4.0%  | 11.1%  | n/a  | n/a\n1984  | 60.5  | 684.3  | 22.7  | 257.2  | 5.2%  | 10.0%  | n/a  | n/a\n1985  | 64.8  | 713.4  | 24.4  | 269.3  | 3.2%  | 10.4%  | n/a  | n/a\n1986  | 68.7  | 737.1  | 25.1  | 269.8  | 4.2%  | 10.3%  | n/a  | n/a\n1987  | 72.4  | 757.3  | 27.5  | 287.7  | 3.7%  | 10.5%  | n/a  | n/a\n1988  | 76.8  | 782.1  | 29.6  | 301.6  | 2.2%  | 10.2%  | n/a  | n/a\n1989  | 83.2  | 826.6  | 32.3  | 320.7  | 2.6%  | 9.2%  | n/a  | n/a\n1990  | 90.3  | 875.5  | 34.8  | 337.6  | 5.9%  | 9.7%  | n/a  | n/a\n1991  | 97.3  | 921.5  | 36.0  | 341.3  | 3.3%  | 9.3%  | 2.2%  | n/a\n1992  | 104.3  | 965.9  | 36.7  | 340.0  | 5.0%  | 5.9%  | 2.3%  | n/a\n1993  | 111.4  | 1,009.4  | 37.1  | 335.8  | 4.6%  | 3.3%  | 2.4%  | n/a\n1994  | 118.9  | 1,054.7  | 39.4  | 349.4  | 4.1%  | 4.6%  | 2.4%  | n/a\n1995  | 127.2  | 1,104.3  | 44.0  | 381.8  | 4.9%  | 8.2%  | 2.5%  | n/a\n1996  | 136.0  | 1,156.0  | 47.0  | 399.7  | 4.6%  | 6.1%  | 2.5%  | n/a\n1997  | 145.7  | 1,212.5  | 48.9  | 407.2  | 5.4%  | 3.7%  | 2.7%  | n/a\n1998  | 154.8  | 1,261.5  | 51.2  | 417.0  | 5.2%  | 6.8%  | 2.9%  | n/a\n1999  | 165.5  | 1,321.6  | 53.1  | 424.2  | 4.9%  | 7.4%  | 3.1%  | n/a\n2000  | 178.7  | 1,399.6  | 54.3  | 425.7  | 5.9%  | 4.3%  | 3.3%  | n/a\n2001  | 191.5  | 1,472.3  | 54.5  | 419.0  | 5.3%  | 2.2%  | 3.6%  | n/a\n2002  | 203.9  | 1,539.4  | 55.8  | 420.9  | 4.4%  | 2.8%  | 3.9%  | n/a\n2003  | 220.0  | 1,632.0  | 60.1  | 445.9  | 5.3%  | 4.6%  | 4.3%  | 44.3%\n2004  | 239.7  | 1,749.7  | 65.7  | 479.4  | 6.3%  | 5.7%  | 4.3%  | 43.5%\n2005  | 262.8  | 1,890.0  | 69.5  | 499.6  | 6.0%  | 10.2%  | 4.3%  | 42.3%\n2006  | 289.4  | 2,053.9  | 71.8  | 509.6  | 6.6%  | 6.8%  | 3.6%  | 42.3%\n2007  | 316.6  | 2,219.5  | 79.6  | 558.1  | 7.1%  | 9.1%  | 4.1%  | 41.9%\n2008  | 340.5  | 2,359.7  | 91.6  | 635.0  | 6.0%  | 8.9%  | 4.6%  | 40.6%\n2009  | 360.9  | 2,473.2  | 102.5  | 702.3  | 5.0%  | 7.6%  | 5.0%  | 39.5%\n2010  | 387.3  | 2,624.2  | 115.3  | 781.2  | 5.6%  | 6.8%  | 3.4%  | 35.5%\n2011  | 421.0  | 2,820.2  | 128.6  | 861.8  | 6.5%  | 10.9%  | 3.8%  | 36.6%\n2012  | 473.8  | 3,137.6  | 133.4  | 883.1  | 6.5%  | 8.9%  | 4.1%  | 36.2%\n2013  | 509.2  | 3,333.3  | 150.0  | 981.8  | 6.0%  | 6.8%  | 4.4%  | 35.8%\n2014  | 553.8  | 3,583.7  | 172.9  | 1,118.9  | 6.1%  | 7.3%  | 4.4%  | 35.3%\n2015  | 595.3  | 3,810.1  | 195.1  | 1,248.5  | 6.6%  | 6.4%  | 4.4%  | 33.7%\n2016  | 650.7  | 4,118.9  | 265.4  | 1,466.6  | 7.1%  | 5.9%  | 4.3%  | 33.3%\n2017  | 710.6  | 4,450.3  | 293.7  | 1,610.9  | 7.3%  | 5.4%  | 4.4%  | 33.4%\n2018  | 835.9  | 5,370.4  | 321.0  | 1,858.4  | 7.9%  | 5.8%  | 4.4%  | 34.6%\n2019  | 989.0  | 6,429.6  | 353.6  | 1,955.7  | 8.2%  | 5.5%  | 4.4%  | 36.1%\n2020  | 1,050.8  | 6,950.5  | 373.1  | 2,227.5  | 3.5%  | 5.6%  | 5.4%  | 39.5%\n2021  | 1,170.1  | 7,509.6  | 416.1  | 2,500.7  | 5.0%  | 5.6%  | 5.2%  | 41.4%\n2022  | 1,348.6  | 7,923.1  | 460.7  | 2,782.0  | 6.4%  | 6.0%  | n/a  | 42.6%\n2023  | 1,496.2  | 8,636.9  | 510.4  | 2,987.7  | 6.7%  | 6.2%  | n/a  | 42.8%\n2024  | 1,647.1  | 9,450.4  | 565.0  | 3,213.9  | 7.2%  | 5.7%  | n/a  | 42.7%\n2025  | 1,872.9  | 10,143.7  | 625.8  | 3,455.9  | 7.2%  | 5.5%  | n/a  | 42.3%\n2026  | 1,947.0  | 10,845.5  | 685.1  | 3,714.7  | 7.1%  | 5.5%  | n/a  | 42.1%\n2027  | 2,102.0  | 11,851.0  | 750.4  | 4,287.2  | 6.9%  | 5.5%  | n/a  | 41.9%"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic sectors",
    "text": "The Bangladesh Bureau of Statistics divides the country's economy into 19\nbroad categories. Their contributions to gross domestic product (GDP) for\n2023-24 are:\n\nSectoral Shares of gross domestic product (GDP) of Bangladesh  Sector  | % of GDP\n---|---\nA) Agriculture  | 11.55\nAgriculture, forestry and fishing  | 11.55\nB) Industry  | 35.27\nMining and quarrying  | 1.53\nManufacturing  | 22.65\nElectricity, gas, steam and air conditioning  | 1.23\nWater supply, sewerage, waste management  | 0.10\nConstruction  | 9.77\nC) Services  | 53.18\nWholesale and retail trade; repair  | 15.10\nTransportation and storage  | 7.43\nAccommodation and food service activities  | 1.23\nInformation and communication  | 1.04\nFinancial and insurance activities  | 3.32\nReal estate activities  | 8.48\nProfessional, scientific, and technical activities  | 0.20\nAdministrative and support service activities  | 0.92\nPublic administration and defence  | 3.34\nEducation  | 3.04\nHuman health and social works activities  | 3.85\nArts, entertainment and recreation  | 0.16\nOther service activities  | 5.07"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Agriculture",
    "text": "The growing areas of major agricultural products.\n\nDevelopment of agricultural output of Bangladesh in 2019 US$ since 1961 As\nwatercourses such as canals, both natural and manmade, and rivers contribute\nas the vital source of irrigation, their spread across the country is\nattributed as a key factor for the economic and geographic extent of\nagriculture in Bangladesh. Photographed is a process of irrigation underway in\nComilla, enabled by a pump that is extracting water from the Gumti seen in the\nbackground.\n\nAgriculture is the largest employment sector in Bangladesh, making up 14.2\npercent of Bangladesh's GDP in 2017 and employing about 42.7 percent of the\nworkforce. As of the financial year 2022 to 2023, the agricultural sector\ncontributed to more than 12% of GDP. The performance of this sector has an\noverwhelming impact on major macroeconomic objectives like employment\ngeneration, poverty alleviation, human resources development, food security,\nand other economic and social forces. A plurality of Bangladeshis earn their\nliving from agriculture. Due to a number of factors, Bangladesh's labour-\nintensive agriculture has achieved steady increases in food grain production\ndespite the often unfavorable weather conditions. These include better flood\ncontrol and irrigation, a generally more efficient use of fertilisers, as well\nas the establishment of better distribution and rural credit networks.\n\nAlthough rice and jute are the primary crops, maize and vegetables are\nassuming greater importance. Due to the expansion of irrigation networks, some\nwheat producers have switched to cultivation of maize which is used mostly as\npoultry feed. Tea is grown in the northeast. There are 166 tea estates in\nBangladesh, covering almost 280,000 acres of land. Bangladesh is the 9th\nlargest Tea producer, producing around 2% of the world’s Tea production.\nBecause of Bangladesh's fertile soil and normally ample water supply, rice can\nbe grown and harvested three times a year in many areas. The country is among\nthe top producers of rice (third), potatoes (seventh), tropical fruits\n(sixth), jute (second), and farmed fish (fifth). With 35.8 million metric tons\nproduced in 2000, rice is Bangladesh's principal crop. As of 2024, it is\nexpected that rice production in Bangladesh will exceed 37.7 million metric\ntons, an increase of nearly 700000 tons from last year. Bangladesh produces\nalmost 5 metric tons of rice per hectare, making the country self sufficient\nin rice production. In comparison to rice, wheat output in 1999 was 1.9\nmillion tonnes (1,900,000 long tons; 2,100,000 short tons).\n\nPopulation pressure continues to place a severe burden on productive capacity,\nsometimes creating a food deficit, especially of wheat. Foreign assistance and\ncommercial imports fill the gap. Underemployment remains a serious problem,\nand a growing concern for Bangladesh's agricultural sector will be its ability\nto absorb additional manpower. Finding alternative sources of employment will\ncontinue to be a daunting problem for future governments, particularly with\nthe increasing numbers of landless peasants who already account for about half\nthe rural labour force. Other challenges facing the sector include\nenvironmental issues: insecticides, water management challenges, pollution,\nand land degradation all effect the agricultural system in Bangladesh.\nBangladesh is particularly vulnerable to climate change, with extreme weather\nand temperature changes significantly changing the conditions for growing\nfood. Adaptation of the agricultural sector is a major concern for policy\naddressing climate change in Bangladesh."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Manufacturing and industry",
    "text": "KAFCO plant in Chittagong\n\nMany new jobs – mostly for women – have been created by the country's dynamic\nprivate ready-made garment industry, which grew at double-digit rates through\nmost of the 1990s. By the late 1990s, about 1.5 million people, mostly women,\nwere employed in the garments sector as well as Leather products specially\nFootwear (Shoe manufacturing unit). During 2001–2002, export earnings from\nready-made garments reached $3,125 million, representing 52% of Bangladesh's\ntotal exports. Bangladesh has overtaken India in apparel exports in 2009, its\nexports stood at 2.66 billion US dollar, ahead of India's 2.27 billion US\ndollar and in 2014 the export rose to $3.12 billion every month. At the fiscal\nyear 2018, Bangladesh has been able to garner US$36.67 billion export earnings\nby exporting manufactured goods, of which, 83.49 percent has come from the\napparel manufacturing sector.\n\nEastern Bengal was known for its fine muslin and silk fabric before the\nBritish period. The dyes, yarn, and cloth were the envy of much of the\npremodern world. Bengali muslin, silk, and brocade were worn by the\naristocracy of Asia and Europe. The introduction of machine-made textiles from\nEngland in the late eighteenth century spelled doom for the costly and time-\nconsuming hand loom process. Cotton growing died out in East Bengal, and the\ntextile industry became dependent on imported yarn. Those who had earned their\nliving in the textile industry were forced to rely more completely on farming.\nOnly the smallest vestiges of a once-thriving cottage industry survived.\n\nOther industries which have shown very strong growth include the\npharmaceutical industry, shipbuilding industry, information technology,\nleather industry, steel industry, and light engineering industry.\n\nBangladesh has a robust pharmaceutical industry. As of 27 April 2024,\nBangladesh is the only nation among the 48 least-developed countries that is\nalmost self-sufficient when it comes to medicine production as local companies\nmeet 98 percent of the demand while 213 pharmaceutical companies are operating\nin Bangladesh and the industry clocks an average annual growth rate of 12\npercent. Nine drug manufacturers have received approvals from regulators in\nthe United States, the European Union, and Australia as well as from the World\nHealth Organisation. The sector ships products to around 150 countries.\n\nA Bangladeshi textile fabric plant\n\nBangladesh's textile industry, which includes knitwear and ready-made garments\n(RMG) along with specialised textile products, is the nation's number one\nexport earner, accounting for $21.5 billion in 2013 – 80% of Bangladesh's\ntotal exports of $27 billion. Bangladesh is 2nd in world textile exports,\nbehind China, which exported $120.1 billion worth of textiles in 2009. The\nindustry employs nearly 3.5 million workers. Current exports have doubled\nsince 2004. Wages in Bangladesh's textile industry were the lowest in the\nworld as of 2010. The country was considered the most formidable rival to\nChina where wages were rapidly rising and currency was appreciating. As of\n2012 wages remained low for the 3 million people employed in the industry, but\nlabour unrest was increasing despite vigorous government action to enforce\nlabour peace. Owners of textile firms and their political allies were a\npowerful political influence in Bangladesh. The urban garment industry has\ncreated more than one million formal sector jobs for women, contributing to\nthe high female labour participation in Bangladesh. While it can be argued\nthat women working in the garment industry are subjected to unsafe labour\nconditions and low wages, Dina M. Siddiqi argues that even though conditions\nin Bangladesh garment factories \"are by no means ideal,\" they still give women\nin Bangladesh the opportunity to earn their own wages. As evidence she points\nto the fear created by the passage of the 1993 Harkins Bill (Child Labor\nDeterrence Bill), which caused factory owners to dismiss \"an estimated 50,000\nchildren, many of whom helped support their families, forcing them into a\ncompletely unregulated informal sector, in lower-paying and much less secure\noccupations such as brick-breaking, domestic service and rickshaw pulling.\"\n\nEven though the working conditions in garment factories are not ideal, they\ntend to financially be more reliable than other occupations and, \"enhance\nwomen's economic capabilities to spend, save and invest their incomes.\" Both\nmarried and unmarried women send money back to their families as remittances,\nbut these earned wages have more than just economic benefits. Many women in\nthe garment industry are marrying later, have lower fertility rates, and\nattain higher levels of education, then women employed elsewhere.\n\nAfter massive labour unrest in 2006 the government formed a Minimum Wage Board\nincluding business and worker representatives which in 2006 set a minimum wage\nequivalent to 1,662.50 taka, $24 a month, up from Tk950. In 2010, following\nwidespread labour protests involving 60,000 workers in June 2010, a\ncontroversial proposal was being considered by the Board which would raise the\nmonthly minimum to the equivalent of $50 a month, still far below worker\ndemands of 5,000 taka, $72, for entry level wages, but unacceptably high\naccording to textile manufacturers who are asking for a wage below $30. On 28\nJuly 2010 it was announced that the minimum entry level wage would be\nincreased to 3,000 taka, about $43.\n\nThe government also seems to believe some change is necessary. On 21 September\n2006 then ex-Prime Minister Khaleda Zia called on textile firms to ensure the\nsafety of workers by complying with international labour law at a speech\ninaugurating the Bangladesh Apparel & Textile Exposition (BATEXPO).\n\nMany Western multinationals use labour in Bangladesh, which is one of the\ncheapest in the world: 30 euros per month compared to 150 or 200 in China.\nFour days is enough for the CEO of one of the top five global textile brands\nto earn what a Bangladeshi garment worker will earn in her lifetime. In April\n2013, at least 1,135 textile workers died in the collapse of their factory.\nOther fatal accidents due to unsanitary factories have affected Bangladesh: in\n2005 a factory collapsed and caused the death of 64 people. In 2006, a series\nof fires killed 85 people and injured 207 others. In 2010, some 30 people died\nof asphyxiation and burns in two serious fires.\n\nIn 2006, tens of thousands of workers mobilized in one of the country's\nlargest strike movements, affecting almost all of the 4,000 factories. The\nBangladesh Garment Manufacturers and Exporters Association (BGMEA) uses police\nforces to crack down. Three workers were killed, hundreds more were wounded by\nbullets, or imprisoned. In 2010, after a new strike movement, nearly 1,000\npeople were injured among workers as a result of the repression."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Shipbuilding and shipbreaking",
    "text": "The _BNS Durgam_ is a naval vessel built in Bangladesh.\n\nShipbuilding is a growing industry in Bangladesh with great potential. Due to\nthe potential of shipbuilding in Bangladesh, the country has been compared to\ncountries like China, Japan and South Korea. Referring to the growing amount\nof export deals secured by the shipbuilding companies as well as the low cost\nlabour available in the country, experts suggest that Bangladesh could emerge\nas a major competitor in the global market of small to medium ocean-going\nvessels.\n\nBangladesh also has the world's largest ship breaking industry which employs\nover 200,000 Bangladeshis and accounts for half of all the steel in\nBangladesh. Chittagong Ship Breaking Yard is the world's second-largest ship\nbreaking area.\n\nKhulna Shipyard Limited (KSY) with over five decades of reputation has been\nleading the Bangladesh Shipbuilding industry and had built a wide spectrum of\nships for domestic and international clients. KSY built ships for Bangladesh\nNavy, Bangladesh Army and Bangladesh Coast Guard under the contract of\nministry of defence."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Finance",
    "text": "Most banks in Bangladesh are privately owned. Until the 1980s, the financial\nsector of Bangladesh was dominated by state-owned banks. With the grand-scale\nreform made in finance, private commercial banks were established through\nprivatisation. The next finance sector reform programme was launched from 2000\nto 2006 with focus on the development of financial institutions and adoption\nof risk-based regulations and supervision by Bangladesh Bank. As of date, the\nbanking sector consisted of 4 SCBs, 4 government-owned specialized banks\ndealing in development financing, 39 private commercial banks, and 9 foreign\ncommercial banks."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.5",
    "section_name": "Tourism",
    "text": "The World Travel and Tourism Council (WTTC) reported in 2013 that the travel\nand tourism industry in Bangladesh directly generated 1,281,500 jobs in 2012\nor 1.8 percent of the country's total employment, which ranked Bangladesh 157\nout of 178 countries worldwide. Direct and indirect employment in the industry\ntotalled 2,714,500 jobs, or 3.7 percent of the country's total employment. The\nWTTC predicted that by 2023, travel and tourism will directly generate\n1,785,000 jobs and support an overall total of 3,891,000 jobs, or 4.2 percent\nof the country's total employment. This would represent an annual growth rate\nin direct jobs of 2.9 percent. Domestic spending generated 97.7 percent of\ndirect travel and tourism gross domestic product (GDP) in 2012. Bangladesh's\nworld ranking in 2012 for travel and tourism's direct contribution to GDP, as\na percentage of GDP, was 142 out of 176.\n\nin 2014 125,000 tourists visited Bangladesh. This number is extremely low\nrelative to total population. As of 22 May 2019 the total local population\nnumbering 166,594,000 inhabitants. This gives a ratio of 1 tourist for every\n1,333 locals."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "2.6",
    "section_name": "Information and communication technology",
    "text": "Bangladesh's information technology sector is a sector that has seen much\ngrowth in the past three years. Bangladesh has 80 million internet users, an\nestimated 9% growth in internet use by June 2017 powered by mobile internet.\nBangladesh currently has an active 23 million Facebook users. Bangladesh\ncurrently has 143.1 million mobile phone customers. Bangladesh exported $800\nmillion worth of software, games, outsourcing and services to European\ncountries, the United States, Canada, Russia and India by 30 June 2017."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Investment",
    "text": "The stock market capitalisation of the Dhaka Stock Exchange in Bangladesh\ncrossed $10 billion in November 2007 and the $30 billion mark in 2009, and\nUS$50 billion in August 2010. Bangladesh had the best performing stock market\nin Asia during the recent global recession between 2007 and 2010, due to\nrelatively low correlations with developed country stock markets.\n\nMajor investment in real estate by domestic and foreign-resident Bangladeshis\nhas led to a massive building boom in Dhaka and Chittagong.\n\nRecent (2011) trends for investing in Bangladesh as Saudi Arabia trying to\nsecure public and private investment in oil and gas, power and transportation\nprojects, United Arab Emirates (UAE) is keen to invest in growing shipbuilding\nindustry in Bangladesh encouraged by comparative cost advantage, Tata, an\nIndia-based leading industrial multinational to invest Taka 1500 crore to set\nup an automobile industry in Bangladesh, World Bank to invest in rural roads\nimproving quality of live, the Rwandan entrepreneurs are keen to invest in\nBangladesh's pharmaceuticals sector considering its potentiality in\ninternational market, Samsung sought to lease 500 industrial plots from the\nexport zones authority to set up an electronics hub in Bangladesh with an\ninvestment of US$1.25 billion, National Board of Revenue (NBR) is set to\nwithdraw tax rebate facilities on investment in the capital market by\nindividual taxpayers from the fiscal 2011–12. In 2011, Japan Bank for\nInternational Cooperation ranked Bangladesh as the 15th best investment\ndestination for foreign investors."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "2010–11 market crash",
    "text": "The bullish capital market turned bearish during 2010, with the exchange\nlosing 1,800 points between December 2010 and January 2011. Millions of\ninvestors have been rendered bankrupt as a result of the market crash. The\ncrash is believed to be caused artificially to benefit a handful of players at\nthe expense of the big players."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Companies",
    "text": "The list includes ten largest Bangladeshi companies by trading value (millions\nin BDT) in 2018.\n\nCompany | Trading name at Dhaka Stock Exchange | Headquarters | Industry | Trading Value\n---|---|---|---|---\nSquare Pharmaceuticals Limited  | SQURPHARMA  | Dhaka | Pharmaceuticals  | 449.8880\nDragon Sweater and Spinning Limited  | DSSL  | Dhaka | Apparel  | 129.4030\nIfad Autos Limited  | IFADAUTOS  | Dhaka | Automotive  | 117.5370\nGrameenphone Private Limited  | GP  | Dhaka | Telecommunications  | 106.8660\nBangladesh Thai Aluminium Ltd  | BDTHAI  | Dhaka | Manufacturing  | 99.7690\nCity Bank Limited  | CITYBANK  | Dhaka | Banking  | 78.6010\nGolden Harvest  | GHAIL  | Dhaka | Agriculture  | 76.6710\nIPDC Finance Limited  | IPDC  | Dhaka | Financial Services  | 67.0430\nOlympic industries limited  | OLYMPIC  | Dhaka | Manufacturing  | 60.5570\nShahjalal Islami Bank Limited  | SHAHJABANK  | Dhaka | Banking  | 53.1710"
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Composition of economic sectors",
    "text": "A Square Pharmaceuticals plant in Gazipur\n\nThe Bangladesh Garments Manufacturers and Exporters Association (BGMEA) has\npredicted textile exports will rise from US$7.90 billion earned in 2005–06 to\nUS$15 billion by 2011. In part this optimism stems from how well the sector\nhas fared since the end of textile and clothing quotas, under the Multifibre\nAgreement, in early 2005.\n\nAccording to a United Nations Development Programme report \"Sewing Thoughts:\nHow to Realize Human Development Gains in the Post-Quota World\" Bangladesh has\nbeen able to offset a decline in European sales by cultivating new markets in\nthe United States.\n\n\"[In 2005] we had tremendous growth. The quota-free textile regime has proved\nto be a big boost for our factories,\" said BGMEA president S.M. Fazlul Hoque\ntold reporters, after the sector's 24 per cent growth rate was revealed.\n\nThe Bangladesh Knitwear Manufacturers and Exporters Association (BKMEA)\npresident Md Fazlul Hoque has also struck an optimistic tone. In an interview\nwith United News Bangladesh he lauded the blistering growth rate, saying \"The\nquality of our products and its competitiveness in terms of prices helped the\nsector achieve such... tremendous success.\"\n\nKnitwear posted the strongest growth of all textile products in 2005–06,\nsurging 35.38 per cent to US$2.82 billion. On the downside however, the\nsector's strong growth came amid sharp falls in prices for textile products on\nthe world market, with growth subsequently dependent upon large increases in\nvolume.\n\nBangladesh's quest to boost the quantity of textile trade was also helped by\nUS and EU caps on Chinese textiles. The US cap restricts growth in imports of\nChinese textiles to 12.5 per cent next year and between 15 and 16 per cent in\n2008. The EU deal similarly manages import growth until 2008.\n\nBangladesh may continue to benefit from these restrictions over the next two\nyears, however a climate of falling global textile prices forces wage rates\nthe centre of the nation's efforts to increase market share.\n\nThey offer a range of incentives to potential investors including 10-year tax\nholidays, duty-free import of capital goods, raw materials and building\nmaterials, exemptions on income tax on salaries paid to foreign nationals for\nthree years and dividend tax exemptions for the period of the tax holiday.\n\nAll goods produced in the zones are able to be exported duty-free, in addition\nto which Bangladesh benefits from the Generalised System of Preferences in US,\nEuropean and Japanese markets and is also endowed with Most Favoured Nation\nstatus from the United States.\n\nFurthermore, Bangladesh imposes no ceiling on investment in the EPZs and\nallows full repatriation of profits.\n\nThe formation of labour unions within the EPZs is prohibited as are strikes.\n\nBangladesh has been a world leader in its efforts to end the use of child\nlabour in garment factories. On 4 July 1995, the Bangladesh Garment\nManufacturers and Exporters Association, International Labour Organization,\nand UNICEF signed a memorandum of understanding on the elimination of child\nlabour in the garment sector. Implementation of this pioneering agreement\nbegan in fall 1995, and by the end of 1999, child labour in the garment trade\nvirtually had been eliminated. The labour-intensive process of ship breaking\nfor scrap has developed to the point where it now meets most of Bangladesh's\ndomestic steel needs. Other industries include sugar, tea, leather goods,\nnewsprint, pharmaceutical, and fertilizer production.\n\nThe Bangladesh government continues to court foreign investment, something it\nhas done fairly successfully in private power generation and gas exploration\nand production, as well as in other sectors such as cellular telephony,\ntextiles, and pharmaceuticals. In 1989, the same year it signed a bilateral\ninvestment treaty with the United States, it established a Board of Investment\nto simplify approval and start-up procedures for foreign investors, although\nin practice the board has done little to increase investment. The government\ncreated the Bangladesh Export Processing Zone Authority to manage the various\nexport processing zones. The agency currently manages EPZs in Adamjee,\nChittagong, Comilla, Dhaka, Ishwardi, Karnaphuli, Mongla, and Uttara. An EPZ\nhas also been proposed for Sylhet. The government has given the private sector\npermission to build and operate competing EPZs-initial construction on a\nKorean EPZ started in 1999. In June 1999, the AFL–CIO petitioned the U.S.\nGovernment to deny Bangladesh access to U.S. markets under the Generalized\nSystem of Preferences (GSP), citing the country's failure to meet promises\nmade in 1992 to allow freedom of association in EPZs."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "International trade",
    "text": "Chittagong port is the busiest port on the Bay of Bengal.\n\nRecently, the COVID-19 pandemic has taken a heavy toll on almost all sectors\nof the economy, inter alia, most notably, it has caused a reduction of exports\nby 16.93 percent, and imports by 17 percent in the FY2019-20.\n\nIn 2015, the top exports of Bangladesh are Non-Knit Men's Suits ($5.6B), Knit\nT-shirts ($5.28B), Knit Sweaters ($4.12B), Non-Knit Women's Suits ($3.66B) and\nNon-Knit Men's Shirts ($2.52B). In 2015, the top imports of Bangladesh are\nHeavy Pure Woven Cotton ($1.33B), Refined Petroleum ($1.25B), Light Pure Woven\nCotton ($1.12B), Raw Cotton ($1.01B) and Wheat ($900M).\n\nIn 2015, the top export destinations of Bangladesh are the United States\n($6.19B), Germany ($5.17B), the United Kingdom ($3.53B), France ($2.37B) and\nSpain ($2.29B). In 2015, the top import origins are China ($13.9B), India\n($5.51B), Singapore ($2.22B), Hong Kong ($1.47B) and Japan ($1.36B)."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Bangladeshi women and the economy",
    "text": "Male and female labour participation rates\n\nAs of 2014, female participation in the labour force is 58 percent as per\nWorld Bank data, and male participation at 82 percent. Through the efforts of\ngovernment and non-governmental organizations like CARE International, the\nparticipation of women in the Bangladeshi politics and the economy has\nimproved drastically.\n\nA 2007 World Bank report stated that the areas in which women's work force\nparticipation have increased the most are in the fields of agriculture,\neducation and health and social work. Over three-quarters of women in the\nlabour force work in the agricultural sector. On the other hand, the\nInternational Labour Organization reports that women's workforce participation\nhas only increased in the professional and administrative areas between 2000\nand 2005, demonstrating women's increased participation in sectors that\nrequire higher education. Employment and labour force participation data from\nthe World Bank, the UN, and the ILO vary and often under report on women's\nwork due to unpaid labour and informal sector jobs. Though these fields are\nmostly paid, women experience very different work conditions than men,\nincluding wage differences and work benefits. Women's wages are significantly\nlower than men's wages for the same job with women being paid as much as 60–75\npercent less than what men make.\n\nOne example of action that is being taken to improve female conditions in the\nwork force is Non-Governmental Organisations. These NGOs encourage women to\nrely on their own self-savings, rather than external funds provide women with\nincreased decision-making and participation within the family and society.\nHowever, some NGOs that address microeconomic issues among individual families\nfail to deal with broader macroeconomic issues that prevent women's complete\nautonomy and advancement."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Historical statistics",
    "text": "Bangladesh has made significant strides in its economic sector performance\nsince independence in 1971. Although the economy has improved vastly in the\n1990s, Bangladesh still suffers in the area of foreign trade in South Asian.\nDespite major impediments to growth like the inefficiency of state-owned\nenterprises[_citation needed_], a rapidly growing labour force that cannot be\nabsorbed by agriculture, inadequate power supplies, and slow implementation of\neconomic reforms, Bangladesh has made some headway improving the climate for\nforeign investors and liberalising the capital markets; for example, it has\nnegotiated with foreign firms for oil and gas exploration, bettered the\ncountrywide distribution of cooking gas, and initiated the construction of\nnatural gas pipelines and power stations. Progress on other economic reforms\nhas been halting because of opposition from the bureaucracy, public sector\nunions, and other vested interest groups.\n\nThe especially severe floods of 1998 increased the flow of foreign aid. The\n2008 financial crisis did not have a major impact on the economy. Foreign aid\nhas seen a gradual decline over the last few decades but economists see this\nas a good sign for self-reliance. There has been a dramatic growth in exports\nand remittance inflow which has helped the economy to expand at a steady rate.\nBangladesh's GDP is expected to grow at 5.3 percent in 2023 and 6.5 percent in\n2024 according to the latest ADB report.\n\nBangladesh has been on the list of UN Least Developed Countries (LDC) since\n1975. Bangladesh met the requirements to be recognised as a developing country\nin March 2018 with Bangladesh's Gross National Income (GNI) US$1,724 per\ncapita, the Human Assets Index (HAI) 72 and the Economic Vulnerability (EVI)\nIndex 25.2 then. Bangladesh's GNI is now forecasted to reach at US$4,753.39 in\n2030."
  },
  {
    "chapter_name": "Economy of Bangladesh",
    "chapter_id": "1",
    "section_number": "6.1",
    "section_name": "Gross export and import",
    "text": "[_needs update_]\n\nFiscal Year | Total Exports\n(in bn. US$) | Total Imports\n(in bn. US$) | Foreign Remittance\nEarnings\n(in bn. US$)\n---|---|---|---\n2007–2008 | $14.11 | $25.21 | $8.9\n2008–2009 | $15.56 | $22.51 | $9.68\n2009–2010 | $16.7 | $23.83 | $10.87\n2010–2011 | $22.93 | $32 | $11.65\n2011–2012 | $24.30 | $35.92 | $12.85\n2012–2013 | $27.09  | $34.09  | $14.4\n2013–2014 | $30.10 | $34.08 | $14.2\n2014–2015 | $31.014 | $47.260 | $14.23\n2015-2016 | $33.661 | $49.436 | $13.60\n2016-2017 | $37.966 | $59.561 | $12.76\n2017-2018  | $37.612  | $67.133  | $15.31\n2018-2019  | $41.53  | $68.103  | $14.98"
  }
]