[
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Bosnia and Herzegovina** is a developing, upper-middle income\neconomy. Bosnia and Herzegovina declared independence from socialist\nYugoslavia on 1 March 1992. The main trading partners are Germany, Italy,\nAustria, Turkey and neighboring countries in Southeast Europe.",
    "openai_summarised_points": [
      "• The economy of Bosnia and Herzegovina is classified as a developing, upper-middle income economy, indicating a moderate level of income and economic development.",
      "• Bosnia and Herzegovina declared independence from socialist Yugoslavia on 1 March 1992, marking a significant political and economic transition.",
      "• The country's primary trading partners include Germany, Italy, Austria, Turkey, and neighboring countries in Southeast Europe, highlighting regional and international economic integration."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:02.622479",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 284,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "Bosnia and Herzegovina is an upper middle-income country which has\naccomplished a great deal since the mid-1990s. It is an EU candidate country\nand is embarking on a new growth model after a period of slow growth and the\n2008 financial crisis. Bosnia and Herzegovina is a small, open economy,\ndominated by services, which accounted for 55% of gross domestic product (GDP)\nin 2016, with a moderately developed industrial and manufacturing sector (23%\nand 12%, respectively), and a limited agricultural base (about 6% of GDP).\n\nThe konvertibilna marka (convertible mark or BAM) - the national currency\nintroduced in 1998 - is pegged to the euro, and confidence in the currency and\nthe banking sector has increased. Implementation of privatization, however,\nhas been slow, and local entities only reluctantly support national-level\ninstitutions. Banking reform accelerated in 2001 as all ; foreign banks,\nprimarily from Western Europe, now control most of the banking sector. A\nsizable current account deficit and a very high unemployment rate remain the\ntwo most serious economic problems. The country receives substantial amounts\nof reconstruction assistance and humanitarian aid from the international\ncommunity but will have to prepare for an era of declining assistance.\n\nThe United States Embassy in Sarajevo, Bosnia and Herzegovina produces the\nCountry Commercial Guide – an annual report that delivers a comprehensive look\nat Bosnia and Herzegovina's commercial and economic environment, using\neconomic, political, and market analysis.\n\nAccording to Serbian American economist, Branko Milanović, Bosnia and\nHerzegovina did the best job in the transition from socialism to capitalism\nwhen compared to the other republics of the former Yugoslavia. From 1985 until\n2021, Bosnia and Herzegovina performed the best on the annual average GDP\ngrowth per capita (1.6%), Slovenia (1.4%), Croatia (1%), Serbia without Kosovo\n(0.9%) and North Macedonia (0.5%).\n\nAt the time of the Socialist Federal Republic of Yugoslavia (SFRY), Bosnia and\nHerzegovina was an important mineral processing centre and provided the other\nrepublics with basic mineral commodities in exchange for current consumption\ngoods. While large amounts of public capital investments poured in during the\n1970s, productivity levels remained low, often due to the limited capacity of\npublic managers. Under former republican premier Džemal Bijedić, and Yugoslav\npresident Tito, metal-product industries were promoted in the republic,\nresulting in the development of a large share of Yugoslavia's metal products\nplants.\n\nMerging small firms into larger agglomerates was a common practice in the SFRY\nto preserve employment levels. As a result, four large conglomerates emerged\nin Bosnia and Herzegovina over time: Energoinvest (energy sector), Unis\n(automotive and defence industry, which partnered with Volkswagen in the early\n1970s), Šipad (wood processing) and RMK Zenica (steel industry, later acquired\nby ArcelorMittal). Construction and defence were important industries in the\nBosnian economy, despite their low efficiency and, ultimately, excess supply.\nThe defence industry was particularly developed in the southern districts and\naround Mostar, which was also a relevant metallurgical centre (Aluminij\nMostar). Machinery production was concentrated in the north, particularly\naround Banja Luka. The Tuzla district was renowned for its chemical industry.\nThe automotive industry, which developed in the 1950s with the production of\nvehicle components, extended later on to passenger and commercial vehicles,\nwith plants in Sarajevo, Mostar and Banja Luka. Agriculture was not highly\ndeveloped, despite its importance for employment and the presence of the large\nAgrokomerc conglomerate based at the north-west border with Croatia.\n\nTito had pushed the development of metal industries, and electro-energetic\nsector, in the republic with the result that Bosnia and Herzegovina were a\nhost of large numbers of industrial firms. Some of them were worked with World\nbrand names, companies like Coca-Cola, Pepsi, Marlboro, Volkswagen and SKF.\nBig Companies like Energoinvest, UNIS, Hidrogradnja, Vranica, RMK Zenica, TAS\nSarajevo, FAMOS Sarajevo and BNT Novi Travnik, have yearly income in billions\nof USD$ at that time. Building sector companies bringing large amounts of\nincome in USD$. Unemployment at that time is very low. Work force is highly\nskilled, with highly professional, educated managers, engineers, science\nexperts, which use western world's newest technologies in large scale areas.\nBefore the war, Yugoslav premier Ante Marković, made some preparations for\nprivatization, in economy, finance, and industry sectors, but the war ceased\ndevelopment in these actions.\n\nThe economy suffered heavily from the war in Bosnia and Herzegovina, with over\n€200 billion in material damages and GDP (excluding services) reduced by 90%\nbetween 1990 and 1995. Today, most of the above-mentioned companies have been\nprivatised. The economy remains fragile, primarily consumption driven and\nvulnerable to external fluctuations. This was seen with the global economic\ncrisis, which pushed Bosnia and Herzegovina into recession in 2009 and 2012\n(with GDP growth of -3% and -0.8%, respectively) and severe floods in 2014,\nwhich caused damage of approximately 15% of GDP. Since 2015, annual GDP growth\nhas increased to more than 3%. Still, the country registered a current account\ndeficit of 4.7% of GDP in 2017, decreasing from 5.3% in 2015, resulting from a\nreduction in its trade deficit, which nevertheless remains large (17.4% of GDP\nin 2017).\n\nA Central Bank of Bosnia and Herzegovina was established in late 1997, debt\nnegotiations were held with the London Club in December 1997 and with the\nParis Club in October 1998, and a new currency, the Bosnia and Herzegovina\nconvertible mark, was introduced in mid-1998. In 1999, the Convertible Mark\ngained wider acceptance, and the Central Bank dramatically increased its\nreserve holdings. Due to Bosnia's strict currency board regime attaching the\nBosnian mark to the Euro, inflation has remained low in the entire country.\n\nWith an uneasy peace in place, output recovered in 1996–99 at high percentage\nrates from a low base; but output growth slowed in 2000–02. The country\nreceives substantial amounts of reconstruction assistance and humanitarian aid\nfrom the international community. Support for East European Democracy (SEED)\nassistance accounts for 20%-25% of economic growth in Bosnia and Herzegovina.\nHowever, growth has been uneven throughout the post-war period, with the\nFederation outpacing the RS.[_clarification needed_] According to World Bank\nestimates, GDP growth was 62% in the Federation and 25% in the RS in 1996, 35%\nin the Federation and flat in the RS in 1997, and continued growth in the\nFederation in 1998.\n\nThe movement has been slow, but considerable progress has been made in\neconomic reform since peace was re-established. Banking reform lagged, as did\nthe implementation of privatization. Many companies (mainly factories) that\nwere privatized faced massive problems, causing the owners to reduce salaries\nand deny the workers their salaries, and some of the new owners and tycoons\ndestroyed those factories.",
    "openai_summarised_points": [
      "• Bosnia and Herzegovina is classified as an upper middle-income country that has achieved significant economic progress since the mid-1990s.",
      "• It is an EU candidate country actively pursuing a new growth model following a period of slow economic growth and the impact of the 2008 global financial crisis.",
      "• The country has a small, open economy predominantly driven by the services sector, which constituted 55% of GDP in 2016.",
      "• The industrial and manufacturing sectors are moderately developed, accounting for 23% and 12% of GDP respectively, while the agricultural sector is limited, making up about 6% of GDP.",
      "• The national currency, the konvertibilna marka (convertible mark or BAM), was introduced in 1998 and is pegged to the euro, leading to increased confidence in the currency and the banking sector.",
      "• Privatization efforts have been slow, with local entities showing reluctance to support national-level institutions; banking reform accelerated notably in 2001.",
      "• Since 2001, foreign banks, mainly from Western Europe, control most of the banking sector in Bosnia and Herzegovina.",
      "• The country faces two major economic challenges: a sizable current account deficit and a very high unemployment rate.",
      "• Bosnia and Herzegovina receives substantial reconstruction assistance and humanitarian aid from the international community but must prepare for a future with declining aid flows.",
      "• The United States Embassy in Sarajevo produces the annual Country Commercial Guide, providing comprehensive analysis of Bosnia and Herzegovina’s economic, political, and market environment.",
      "• Economist Branko Milanović notes that Bosnia and Herzegovina performed the best in transitioning from socialism to capitalism among the former Yugoslav republics, with an average annual GDP per capita growth of 1.6% from 1985 to 2021, compared to Slovenia (1.4%), Croatia (1%), Serbia without Kosovo (0.9%), and North Macedonia (0.5%).",
      "• During the era of the Socialist Federal Republic of Yugoslavia (SFRY), Bosnia and Herzegovina was a key mineral processing hub, supplying mineral commodities to other republics in exchange for consumer goods.",
      "• The 1970s saw large public capital investments, but productivity remained low due to limited managerial capacity.",
      "• Under leaders Džemal Bijedić and Tito, metal-product industries were promoted, leading to the development of significant metal processing plants.",
      "• Merging small firms into larger conglomerates was common, resulting in the emergence of four major conglomerates: Energoinvest (energy sector), Unis (automotive and defense, partnered with Volkswagen in the early 1970s), Šipad (wood processing), and RMK Zenica (steel industry, later acquired by ArcelorMittal).",
      "• Construction and defense industries were important but inefficient and oversupplied; the defense industry was particularly developed in southern districts and around Mostar, which was also a metallurgical center (Aluminij Mostar).",
      "• Machinery production was concentrated in the north, especially around Banja Luka, while Tuzla was renowned for its chemical industry.",
      "• The automotive industry developed from the 1950s, producing vehicle components, passenger, and commercial vehicles, with plants located in Sarajevo, Mostar, and Banja Luka.",
      "• Agriculture was underdeveloped despite its employment significance and the presence of large conglomerates like Agrokomerc near the north-west border with Croatia.",
      "• Tito promoted metal industries and the electro-energetic sector, resulting in numerous large industrial firms, some collaborating with global brands such as Coca-Cola, Pepsi, Marlboro, Volkswagen, and SKF.",
      "• Major companies like Energoinvest, UNIS, Hidrogradnja, Vranica, RMK Zenica, TAS Sarajevo, FAMOS Sarajevo, and BNT Novi Travnik had annual incomes in the billions of USD at that time.",
      "• The construction sector contributed significantly to income in USD, and unemployment was very low prior to the war.",
      "• The workforce was highly skilled, comprising educated managers, engineers, and science experts utilizing Western technologies in large-scale industries.",
      "• Yugoslav Premier Ante Marković had initiated preparations for privatization across the economy, finance, and industry sectors, but the outbreak of war halted these efforts.",
      "• The Bosnian war caused extensive material damages estimated at over €200 billion, with GDP (excluding services) decreasing by 90% between 1990 and 1995.",
      "• Most major companies have since been privatized; however, the economy remains fragile, heavily reliant on consumption and vulnerable to external shocks.",
      "• The global economic crisis led to recessions in 2009 (-3% GDP growth) and 2012 (-0.8%), and severe floods in 2014 caused damages approximating 15% of GDP.",
      "• Since 2015, annual GDP growth has exceeded 3%.",
      "• In 2017, Bosnia and Herzegovina recorded a current account deficit of 4.7% of GDP, down from 5.3% in 2015, driven by a reduction in the trade deficit, which still remained large at 17.4% of GDP.",
      "• The Central Bank of Bosnia and Herzegovina was established in late 1997, with debt negotiations conducted with the London Club in December 1997 and the Paris Club in October 1998.",
      "• The new currency, the Bosnia and Herzegovina convertible mark, was introduced in mid-1998, and by 1999, it gained wider acceptance, with the Central Bank increasing its reserve holdings significantly.",
      "• Due to the currency board regime pegging the BAM to the Euro, inflation has remained low across the country.",
      "• Post-war output recovered rapidly from 1996–99 at high rates from a low base, but growth slowed between 2000–02.",
      "• The country receives significant international reconstruction and humanitarian aid, with Support for East European Democracy (SEED) contributing 20–25% of economic growth.",
      "• Economic growth has been uneven, with the Federation outpacing the Republika Srpska (RS); in 1996, GDP growth was 62% in the Federation and 25% in RS, with continued growth in the Federation in subsequent years.",
      "• Progress in economic reform has been slow, especially in banking reform and privatization; many privatized companies faced difficulties, including salary reductions, non-payment to workers, and destruction of factories by new owners."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:22.397725",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 7250,
      "bullet_points_count": 36
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "1.1",
    "section_name": "Macro-Economic",
    "text": "The following table shows the main economic indicators in 1997–2025.\n\nYear  | GDP\n(in Bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in Bil. US$ nominal) | GDP per capita (in US$ nominal) | GDP growth\n(real)  | Unemployment rate\n(in Percent)  | Debt\n---|---|---|---|---|---|---|---\n1996  | 11.394  | 3,027  | 3.584  | 952  |  |  |\n1997  | 14.239  | 3,811  | 4.578  | 1,225  | 22.9%  | 44,6%  |\n1998  | 16.389  | 4,391  | 5.281  | 1,415  |  | 29.3%  | 54.3%\n1999  | 18.406  | 4,917  | 5.766  | 1,540  |  | 31.1%  | 56%\n2000  | 19.659  | 5,241  | 5.554  | 1,480  | 4.4%  | 31.1%  | 34.6%\n2001  | 20.577  | 5,479  | 5.784  | 1,540  |  | 31.1%  | 35.2%\n2002  | 21.954  | 5,840  | 6.711  | 1,785.  |  | 31.1%  | 31.2%\n2003  | 23.251  | 6,183  | 8.477  | 2,254  |  | 31.1%  | 27.6%\n2004  | 25.369  | 6,741  | 10.157  | 2,699  |  | 31.1%  | 25.5%\n2005  | 27.273  | 7,241  | 10.935  | 2,903  | 4,2%  | 31.1%  | 25.5%\n2006  | 29.714  | 7,885  | 12.460  | 3,306  | 5.7%  | 31.1%  | 21.2%\n2007  | 32.342  | 8,597  | 15.323  | 4,073  | 6.0%  | 32.4%  | 18.7%\n2008  | 34.806  | 9,271  | 18.712  | 4,984  | 5.6%  | 34%  | 30.9%\n2009  | 34.743  | 9,299  | 17.601  | 4,711  | −0.8%  | 35%  | 35%\n2010  | 35.431  | 9,565  | 17.164  | 4,633  | 0.8%  | 34%  | 40.8%\n2011  | 36.495  | 9,971  | 18.629  | 5,089  | 0.9%  | 31%  | 39.6%\n2012  | 37.104  | 10,292  | 17.207  | 4,773  | −0.7%  | 30%  | 42.2%\n2013  | 38.975  | 11,003  | 18.155  | 5,125  | 2.4%  | 31%  | 42.5%\n2014  | 39.732  | 11,410  | 18.522  | 5,319  | 1.2%  | 32%  | 45.9%\n2015  | 41.195  | 12,013  | 16.210  | 4,727  | 3.1%  | 35%  | 45.5%\n2016  | 44.253  | 13,069  | 16.910  | 4,994  | 3.2%  | 25.4%  | 44.1%\n2017  | 46.394  | 13,836  | 18.081  | 5,392  | 2.7%  | 20.5%  | 39.5%\n2018  | 50.333  | 14,829  | 20.184  | 6,073  | 3.5%  | 19.4%  | 34.3%\n2019  | 54.960  | 15,625  | 20.203  | 6,120  | 3.9%  | 15.7%  | 32.5%\n2020  | 54.012  | 15,231  | 19.789  | 6,034  | −6.5%  | 19%  | 36.5%\n2021  | 60.180  | 16,584  | 23.673  | 6,800  | 5%  | 17.5%  | 34.5%\n2022  | 67.190  | 18,517  | 24.520  | 7,059  | 3.2%  | 15.7%  | 29.7%\n2023  | 70.780  | 19,633  | 26.945  | 7,778  | 4%  | 13.1%  | 28.6%\n2024  | 74.280  | 20,622  | 28.404  | 8,220  | 3%  | 11.7%  | 28,1%\n2025  | 77.897  | 22,610  | 29.864  | 8,668  | 3%  | 11.7%  | 25,4%",
    "openai_summarised_points": [
      "• The section presents main economic indicators of Bosnia and Herzegovina from 1997 to 2025, illustrating trends in GDP, GDP per capita, unemployment, debt, and growth rates over this period.",
      "• In 1996, Bosnia and Herzegovina's GDP was approximately 11.394 billion US dollars (PPP), with a GDP per capita of 3,027 US dollars (PPP). The nominal GDP was 3.584 billion US dollars, and the nominal GDP per capita was 952 US dollars.",
      "• By 1997, GDP increased to approximately 14.239 billion US dollars (PPP), with GDP per capita rising to 3,811 US dollars (PPP). The nominal GDP was 4.578 billion US dollars, and nominal GDP per capita was 1,225 US dollars, with a GDP growth rate of 22.9%.",
      "• In 1998, GDP reached approximately 16.389 billion US dollars (PPP), with GDP per capita at 4,391 US dollars (PPP). Nominal GDP was 5.281 billion US dollars, and nominal GDP per capita was 1,415 US dollars; unemployment rate data is not specified for this year.",
      "• The year 1999 saw GDP at approximately 18.406 billion US dollars (PPP), with GDP per capita at 4,917 US dollars (PPP). Nominal GDP was 5.766 billion US dollars, and nominal GDP per capita was 1,540 US dollars; unemployment rate data is not provided.",
      "• In 2000, GDP increased to about 19.659 billion US dollars (PPP), with GDP per capita at 5,241 US dollars (PPP). Nominal GDP was 5.554 billion US dollars, nominal GDP per capita was 1,480 US dollars, with a real GDP growth of 4.4%, unemployment at 31.1%, and debt at 34.6%.",
      "• From 2001 to 2003, GDP continued to grow, reaching approximately 21.954 billion US dollars (PPP) in 2002 and 23.251 billion US dollars (PPP) in 2003, with corresponding increases in GDP per capita and nominal values; unemployment remained steady at 31.1% during this period.",
      "• Between 2004 and 2006, GDP rose from approximately 25.369 billion US dollars (PPP) to 29.714 billion US dollars (PPP), with GDP per capita increasing from 6,741 to 7,885 US dollars (PPP). Unemployment was stable at 31.1%, with debt decreasing from 25.5% to 21.2%.",
      "• In 2007, GDP reached approximately 32.342 billion US dollars (PPP), with GDP per capita at 8,597 US dollars (PPP), and unemployment slightly increased to 32.4%. Debt decreased further to 18.7%.",
      "• The 2008 economic data shows GDP at about 34.806 billion US dollars (PPP), GDP per capita at 9,271 US dollars (PPP), with unemployment at 34%, and debt at 30.9%.",
      "• The 2009 recession is marked by a slight decline in GDP to approximately 34.743 billion US dollars (PPP), with GDP per capita at 9,299 US dollars (PPP), and a negative GDP growth of −0.8%. Unemployment increased to 35%, and debt rose to 35%.",
      "• In 2010, GDP recovered slightly to 35.431 billion US dollars (PPP), with GDP per capita at 9,565 US dollars (PPP), and a modest GDP growth of 0.8%. Unemployment decreased to 34%, and debt increased to 40.8%.",
      "• From 2011 to 2013, GDP growth continued, reaching approximately 36.495 billion US dollars (PPP) in 2011, 37.104 billion in 2012, and 38.975 billion in 2013, with corresponding increases in GDP per capita and nominal GDP. Unemployment decreased from 31% in 2012 to 31% in 2013, and debt remained around 42.2%.",
      "• During 2014 and 2015, GDP increased to about 39.732 billion and 41.195 billion US dollars (PPP), respectively, with GDP per capita rising from 11,410 to 12,013 US dollars (PPP). Unemployment was around 32-35%, and debt slightly decreased from 45.9% to 45.5%.",
      "• From 2016 onward, GDP growth accelerated, reaching approximately 44.253 billion US dollars (PPP) in 2016, 46.394 billion in 2017, and 50.333 billion in 2018, with GDP per capita increasing correspondingly. Unemployment decreased from 25.4% in 2016 to 19.4% in 2018, and debt decreased from 44.1% to 34.3%.",
      "• In 2019, GDP was approximately 54.960 billion US dollars (PPP), with GDP per capita at 15,625 US dollars (PPP), unemployment at 15.7%, and debt at 32.5%.",
      "• The COVID-19 pandemic in 2020 caused a GDP decline to about 54.012 billion US dollars (PPP), with GDP per capita at 15,231 US dollars (PPP), a significant negative GDP growth of −6.5%, unemployment rising to 19%, and debt increasing to 36.5%.",
      "• Post-pandemic recovery is evident from 2021 onward, with GDP reaching approximately 60.180 billion US dollars (PPP), GDP per capita at 16,584 US dollars (PPP), and GDP growth at 5%. Unemployment decreased to 17.5%, and debt reduced to 34.5%.",
      "• By 2022, GDP further increased to approximately 67.190 billion US dollars (PPP), with GDP per capita at 18,517 US dollars (PPP), and a GDP growth of 3.2%. Unemployment fell to 15.7%, and debt decreased to 29.7%.",
      "• In 2023, GDP reached approximately 70.780 billion US dollars (PPP), with GDP per capita at 19,633 US dollars (PPP), and a 4% growth rate. Unemployment was 13.1%, and debt stood at 28.6%.",
      "• Projections for 2024 show GDP at approximately 74.280 billion US dollars (PPP), with GDP per capita at 20,622 US dollars (PPP), and a 3% growth rate. Unemployment is estimated at 11.7%, with debt at 28.1%.",
      "• The forecast for 2025 indicates GDP will be approximately 77.897 billion US dollars (PPP), with GDP per capita at 22,610 US dollars (PPP), and a 3% growth rate. Unemployment is expected to be 11.7%, and debt at 25.4%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:36.819473",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 2281,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Present",
    "text": "Exports of Bosnia and Herzegovina during 2006.\n\n**Overall value offoreign direct investment (1999–2011):**\n\n* 1999: €166 million\n* 2000: €159 million\n* 2001: €133 million\n* 2002: €282 million\n* 2003: €338 million\n* 2004: €534 million\n* 2005: €421 million\n* 2006: €556 million\n* 2007: €1.628 billion\n* 2008: €1.083 billion\n* 2009: €434 million\n* 2010: €359 million\n* 2011: €313 million\n* 2022: €730 million\n\nFrom 1994 to 2011, €6.4 billion were invested in the country.\n\n**The top investor countries (1994–2007)** :\n\n* Austria (€1,294 million)\n* Serbia (€773 million)\n* Croatia (€434 million)\n* Slovenia (€427 million)\n* Switzerland (€337 million)\n* Germany (€270 million)\n* Italy (€94.29 million)\n* Netherlands (€63.52 million)\n* United Arab Emirates (€56.70 million)\n* Turkey (€54.81 million)\n* All Other Countries (€892.54 million)\n\n**Foreign investments by sector for (1994–2007):**\n\n* 37.7% Manufacturing\n* 21% Banking\n* 4.9% Services\n* 9.6% Trade\n* 0.30% Transport\n* 1% Tourism\n\nBy some estimates, grey economy is 25.5% of GDP.",
    "openai_summarised_points": [
      "• During 2006, Bosnia and Herzegovina's exports contributed significantly to its economic profile, though specific export values for that year are not detailed in the provided content.",
      "• The overall foreign direct investment (FDI) in Bosnia and Herzegovina from 1999 to 2011 showed fluctuating trends, with the following annual figures:",
      "• In 2022, FDI reached €730 million, indicating a resurgence compared to previous years.",
      "• From 1994 to 2011, Bosnia and Herzegovina attracted a total of €6.4 billion in foreign investment.",
      "• The leading countries investing in Bosnia and Herzegovina between 1994 and 2007 were:",
      "• Foreign investments in Bosnia and Herzegovina from 1994 to 2007 were distributed across sectors as follows:",
      "• An estimated 25.5% of Bosnia and Herzegovina's GDP is attributed to the grey economy, indicating a substantial informal economic sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:46.112843",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1032,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.1",
    "section_name": "2017",
    "text": "In 2017, exports grew by 17% when compared to the previous year, totaling\n€5.65 billion. The total volume of foreign trade in 2017 amounted to €14.97\nbillion and increased by 14% compared to the previous year. Imports of goods\nincreased by 12% and amounted to €9.32 billion. The coverage of imports by\nexports has increased by 3% compared to the previous year and now it is 61\npercent. In 2017, Bosnia and Herzegovina mostly exported car seats,\nelectricity, processed wood, aluminium and furniture. In the same year, it\nmostly imported crude oil, automobiles, motor oil, coal and briquettes.\n\nThe unemployment rate in 2017 was 20.5%, but The Vienna Institute for\nInternational Economic Studies is predicting falling unemployment rate for the\nnext few years. In 2018, the unemployment should be 19.4% and it should\nfurther fall to 18.8% in 2019. In 2020, the unemployment rate should go down\nto 18.3%.\n\nOn 31 December 2017, the Council of Ministers of Bosnia and Herzegovina issued\nthe report on public debt of Bosnia and Herzegovina, stating that the public\ndebt was reduced by €389.97 million, or by more than 6% when compared to\nDecember 31, 2016. By the end of 2017, public debt was €5.92 billion, which\namounted to 35.6 percent of GDP.\n\nAs of 31 December 2017, there were 32,292 registered companies in the country,\nwhich together had revenues of €33.572 billion that same year.\n\nIn 2017, the country received €397.35 million in foreign direct investment,\nwhich equals to 2.5% of the GDP.\n\nIn 2017, Bosnia and Herzegovina ranked 3rd in the world in terms of the number\nof new jobs created by foreign investment, relative to the number of\ninhabitants.\n\nIn 2017, 1,307,319 tourists visited Bosnia-Herzegovina, an increase of 13.7%,\nand had 2,677,125 overnight hotel stays, a 12.3% increase from the previous\nyear. Also, 71.5% of the tourists came from foreign countries.",
    "openai_summarised_points": [
      "• In 2017, Bosnia and Herzegovina's exports increased by 17% compared to the previous year, totaling €5.65 billion.",
      "• The total volume of foreign trade in 2017 reached €14.97 billion, representing a 14% increase over the previous year.",
      "• Imports of goods in 2017 rose by 12%, amounting to €9.32 billion.",
      "• The coverage of imports by exports improved by 3% from the previous year, reaching 61%.",
      "• In 2017, Bosnia and Herzegovina primarily exported car seats, electricity, processed wood, aluminium, and furniture.",
      "• The main imports in 2017 included crude oil, automobiles, motor oil, coal, and briquettes.",
      "• The unemployment rate in 2017 was 20.5%.",
      "• The Vienna Institute for International Economic Studies projected a decline in unemployment rates for subsequent years: 19.4% in 2018, 18.8% in 2019, and 18.3% in 2020.",
      "• As of 31 December 2017, Bosnia and Herzegovina’s public debt was reduced by €389.97 million (over 6%) compared to 31 December 2016.",
      "• The total public debt at the end of 2017 was €5.92 billion, constituting 35.6% of the country's GDP.",
      "• By 31 December 2017, there were 32,292 registered companies in Bosnia and Herzegovina, with combined revenues of €33.572 billion in that year.",
      "• The country received €397.35 million in foreign direct investment in 2017, accounting for 2.5% of GDP.",
      "• In 2017, Bosnia and Herzegovina ranked 3rd worldwide in the number of new jobs created by foreign investment relative to its population.",
      "• Tourist arrivals in 2017 totaled 1,307,319, marking a 13.7% increase from the previous year.",
      "• Tourist overnight stays numbered 2,677,125, reflecting a 12.3% rise compared to the previous year.",
      "• Approximately 71.5% of tourists visiting Bosnia and Herzegovina in 2017 were from foreign countries."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:47:53.616296",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1872,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.2",
    "section_name": "2018",
    "text": "In 2018, Bosnia and Herzegovina exported goods worth 11.9 billion KM (€6.07\nbillion), which is 7.43% higher than in the same period in 2017, while imports\namounted to 19.27 billion KM (€9.83 billion), which is 5.47% higher.\n\nThe average price of new apartments sold in the country in the first six\nmonths of 2018 is 1,639 km (€886.31) per square meter. This represents a jump\nof 3.5% from the previous year.\n\nOn June 30, 2018, public debt of Bosnia and Herzegovina amounted to about\n€6.04 billion, of which external debt is 70.56 percent, while the internal\ndebt is 29.4 percent of total public indebtedness. The share of public debt in\ngross domestic product was 34.92 percent.\n\nIn 2018, 1,465,412 tourists visited Bosnia-Herzegovina, an increase of 12.1%,\nand had 3,040,190 overnight hotel stays, a 13.5% increase from the previous\nyear. Also, 71.2% of the tourists came from foreign countries.\n\nIn 2018, the total value of mergers and acquisitions in Bosnia and Herzegovina\namounted to €404.6 million.\n\nIn 2018, 99.5 percent of enterprises in Bosnia and Herzegovina used computers\nin their business, while 99.3 percent had internet connections, according to a\nsurvey conducted by the Bosnia and Herzegovina Statistics Agency.\n\nIn 2018, Bosnia and Herzegovina received 783.4 million KM (€400.64 million) in\ndirect foreign investment, which was equivalent to 2.3% of GDP.\n\nIn 2018, the Central Bank of Bosnia and Herzegovina made a profit of 8,430,875\nkm (€4,306,347).",
    "openai_summarised_points": [
      "• In 2018, Bosnia and Herzegovina exported goods valued at 11.9 billion KM (€6.07 billion), representing a 7.43% increase compared to the same period in 2017.",
      "• During the same year, imports totaled 19.27 billion KM (€9.83 billion), marking a 5.47% rise from the previous year.",
      "• The average price of new apartments sold in Bosnia and Herzegovina during the first six months of 2018 was 1,639 KM (€886.31) per square meter, reflecting a 3.5% increase from the previous year.",
      "• As of June 30, 2018, the public debt of Bosnia and Herzegovina was approximately €6.04 billion, with external debt constituting 70.56% and internal debt making up 29.4% of the total public debt.",
      "• The share of public debt in the country's gross domestic product (GDP) was 34.92% in 2018.",
      "• In 2018, the country received 1,465,412 tourists, representing a 12.1% increase from the previous year, and these tourists generated 3,040,190 overnight hotel stays, a 13.5% rise.",
      "• Of the tourists in 2018, 71.2% were from foreign countries.",
      "• The total value of mergers and acquisitions in Bosnia and Herzegovina in 2018 amounted to €404.6 million.",
      "• According to a survey by the Bosnia and Herzegovina Statistics Agency, 99.5% of enterprises used computers in their business operations, and 99.3% had internet connections in 2018.",
      "• Bosnia and Herzegovina attracted €400.64 million (783.4 million KM), equivalent to 2.3% of GDP, in direct foreign investment in 2018.",
      "• The Central Bank of Bosnia and Herzegovina reported a profit of 8,430,875 KM (€4,306,347) in 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:01.806218",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1469,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.3",
    "section_name": "2019",
    "text": "The World Bank estimates that the economy grew by 2.8% in 2019.\n\nBosnia and Herzegovina was placed 83rd on the Index of Economic Freedom for\n2019. The total rating for Bosnia and Herzegovina is 61.9. This position\nrepresents some progress relative to the 91st place in 2018. This result is\nbelow the regional level, but still above the global average, making Bosnia\nand Herzegovina a \"moderately free\" country.\n\nOn 31 January 2019, total deposits in Bosnian banks were KM 21.9 billion\n(€11.20 billion), which represents 61.15% of nominal GDP.\n\nIn the second quarter of 2019, the average price of new apartments sold in\nBosnia and Herzegovina was 1,606 km (€821.47) per square meter.\n\nIn the first six months of 2019, exports amounted to 5.829 billion KM (€2.98\nbillion), which is 0.1% less than in the same period of 2018, while imports\namounted to 9.779 billion KM (€5.00 billion), which is by 4.5% more than in\nthe same period of the previous year.\n\nIn the first seven months of 2019, 906,788 tourists visited the country, an\n11.7% jump from the previous year.\n\nIn the first six months of 2019, foreign direct investment amounted to 650.1\nmillion KM (€332.34 million).",
    "openai_summarised_points": [
      "• The World Bank estimated that Bosnia and Herzegovina's economy grew by 2.8% in 2019.",
      "• Bosnia and Herzegovina was ranked 83rd on the Index of Economic Freedom for 2019, with an overall score of 61.9.",
      "• This ranking represented an improvement from 91st place in 2018, indicating some progress in economic freedom.",
      "• The country's economic freedom score of 61.9 is below the regional average but remains above the global average, categorizing Bosnia and Herzegovina as a \"moderately free\" economy.",
      "• As of 31 January 2019, total deposits in Bosnian banks reached KM 21.9 billion (€11.20 billion), accounting for 61.15% of the country's nominal GDP.",
      "• In the second quarter of 2019, the average price of newly sold apartments was 1,606 KM (€821.47) per square meter.",
      "• During the first six months of 2019, Bosnia and Herzegovina's exports totaled 5.829 billion KM (€2.98 billion), representing a 0.1% decrease compared to the same period in 2018.",
      "• In the same period, imports amounted to 9.779 billion KM (€5.00 billion), which is a 4.5% increase over the first six months of 2018.",
      "• Tourist arrivals in Bosnia and Herzegovina for the first seven months of 2019 numbered 906,788, marking an 11.7% increase from the previous year.",
      "• Foreign direct investment (FDI) in Bosnia and Herzegovina during the first six months of 2019 was KM 650.1 million (€332.34 million)."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:09.491573",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1170,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.4",
    "section_name": "2020–2022",
    "text": "2020 saw a contraction in the economy of around 4.7%, caused by the COVID-19\npandemic, with increased costs by the government, before bouncing back in\n2021. Employment rates have been climbing, however youth unemployment in 2022\nwas still over 33%.",
    "openai_summarised_points": [
      "• In 2020, the economy of Bosnia and Herzegovina contracted by approximately 4.7%, primarily due to the impacts of the COVID-19 pandemic.",
      "• The contraction was associated with increased government expenditures aimed at mitigating the economic effects of the pandemic.",
      "• Following the downturn in 2020, the economy experienced a recovery and rebounded in 2021.",
      "• During the period from 2020 to 2022, employment rates in Bosnia and Herzegovina showed an upward trend, indicating improvements in the labor market.",
      "• Despite overall employment growth, youth unemployment remained high in 2022, exceeding 33%, highlighting persistent challenges in youth employment opportunities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:12.249386",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 248,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.0.5",
    "section_name": "2023",
    "text": "As of 30 November 2023, Bosnia and Herzegovina had 1.3 million registered\nmotor vehicles.",
    "openai_summarised_points": [
      "• As of 30 November 2023, Bosnia and Herzegovina had a total of 1.3 million registered motor vehicles."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T18:48:13.781413",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 89,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Sarajevo",
    "text": "ARIA shopping and business center, also the headquarters of Al Jazeera Balkans\n\nSarajevo industries now include tobacco products, furniture, hosiery,\nautomobiles, and communication equipment. Companies based in Sarajevo include\nBH Telecom, Bosnalijek, Energopetrol, FlyBosnia, Sarajevo Tobacco Factory, and\nSarajevska Pivara (Sarajevo Brewery).\n\nSarajevo has a strong tourist industry and was named by Lonely Planet one of\nthe top 50 \"Best Cities in the World\" in 2006. Sports-related tourism uses the\nlegacy facilities of the 1984 Winter Olympics, especially the skiing\nfacilities on the nearby mountains of Bjelašnica, Igman, Jahorina, Trebević,\nand Treskavica. Sarajevo's 600 years of history, influenced by both Western\nand Eastern empires, is also a strong tourist attraction. Sarajevo has hosted\ntravellers for centuries, because it was an important trading center during\nthe Ottoman and Austria-Hungarian empires.\n\nToday, Sarajevo is one of the fastest developing cities in the region. Various\nnew modern buildings have been built, most significantly the Bosmal City\nCenter, ARIA Centar and the Avaz Twist Tower, which is one of the tallest\nskyscraper in the Balkans. A new highway was recently (2006–2011) completed\nbetween Sarajevo and the city of Kakanj. Due to growth in population, tourism\nand airport traffic the service sector in the city is developing fast and\nwelcoming new investors from various businesses.\n\nSarajevo has one of the most representable commercial infrastructures in\nSouth-East Europe. The Sarajevo City Center is one of the biggest shopping\ncentres in South-East Europe, after its completion in 2014. Airport Center\nSarajevo which will be connected directly to the new airport terminal will\noffer a great variety of brands, products and services.\n\nIn 1981, Sarajevo's GDP per capita was 133% of the Yugoslav average.\n\nIn 2011, Sarajevo's GDP was estimated to be 16.76 billion US$ by the Central\nBank of Bosnia and Herzegovina, comprising 37% of the total GDP of the\ncountry."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Mostar",
    "text": "The construction of the largest trade center in Herzegovina – \"Brodomerkur\"\n\nMostar's economy relies heavily on tourism, aluminium and metal industry,\nbanking services and telecommunication sector. The city is the seat of some of\nthe country's largest corporations.\n\nAlong with Sarajevo, it is the largest financial center in Bosnia and\nHerzegovina, with two out of three largest banks in the country having their\nheadquarters in Mostar. Bosnia-Herzegovina has three national electric, postal\nand telecommunication service corporations; These three companies banks and\nthe aluminium factory make a vast portion of overall economic activity in the\ncity.\n\nAluminij is one of the most influential companies in the city, region, but\nalso country. In relation to the current manufacturing capacity it generates\nan annual export of more than €150 million. The partners with which the\nAluminij does business are renowned global companies, from which the most\nimportant are: Venture Coke Company L.L.C. (Venco-Conoco joint Venture) from\nthe US, Glencore International AG from Switzerland, Debis International\ntrading GmbH, Daimler-Chrysler and VAW Aluminium Technologie GmbH from\nGermany, Hydro ASA from Norway, Fiat from Italy, and TLM-Šibenik from\nCroatia[5]. Mostar area alone receives an income of €40 million annually from\nAluminij."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Prijedor",
    "text": "Prijedor regional location.\n\nPrijedor is the sixth largest city in Bosnia and Herzegovina. It is an\neconomically prosperous municipality hosting a wide range of industries,\nservices and educational institutions. The city's geographical location close\nto major European capitals has made it an important industrial and commercial\nhub nationally. It has a developed financial sector, 11 international banks\nare represented, 5 microcredit organizations and a foundation for development.\nThe city's huge economic potential is in the strategic geographical location\nbeing close to Zagreb, Belgrade, Budapest and Vienna. Giving it one of the\nbest climates for economic expansion in Bosnia and Herzegovina.\n\nThe agricultural land around the city, raw minerals in the municipality and\ngrowth of high educated population in the city proper gives it a unique\ncombination of both being able to produce sophisticated industrial products,\nfood and service branches.\n\nCompanies\n\nZenica host today the Bosnian part of ArcelorMittal Steel Company, former RMK\nZenica, which employ about 3000 workers, steel company from Luxembourg with\nover 320,000 employees in more than 60 countries. It also has companies\nspecialized in the chemical industry such as Ferrox a.d., producing iron\noxides-pigments. BosnaMontaza AD., one of Bosnias most specialized steel\nmanufacturers, manufacturing: steel construction, pipelines, reservoirs,\ntechnological equipment, cranes and energy plants. Other companies such as the\nCroatian food company Kraš has one of its biggest facilities in Bosnia and\nHerzegovina in Prijedor, producing confectionery products under the brand\nnames MIRA and Kraš. Brand names such as \"Prijedorčanka\" is one of the leading\nproducers of the alcoholic beverage Rakija in Bosnia and Herzegovina. Prijedor\nis also a big enterprise producing cellulose and paper for export.\n\nIn 2022, the sector with the highest number of companies registered in Bosnia\nand Herzegovina is Services with 39,707 companies followed by Retail Trade and\nWholesale Trade with 12,060 and 11,970 companies respectively.\n\nAgricultural sector\n\nLake Saničani fish farm\n\nAmong this Prijedor has a fruit growing production, gardening production, crop\nfarming production, mill and bakery industries, stock farming production,\nprocessing industries and a milk industry.\n\nLake Saničani, near Prijedor, is one of the biggest commercial fish-farming\nlakes in the southern Europe.\n\nPrijedor municipality takes up 8340.6 hectares (5845.0 private property and\n2495.6 state property). Plowed fields and gardens take up 340.26 hectares,\norchards 23.86 hectares and vineyards 5 hectares. All cultivated soil takes up\n402.06 hectares.\n\nService sector\n\nThe service sector in Prijedor is growing rapidly and this reflects in the\ngrowth of hotels, stores, roads, educational facilities and shoppings centers\nthat are being built in the city. Making it a growing commercial hub in Bosnia\nand Hercegovina."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Banja Luka",
    "text": "Banja Luka west transit\n\nAlthough the city itself was not directly affected by the Bosnian War in the\nearly 1990s, its economy was. For four years, Banja Luka fell behind the world\nin key areas such as technology, resulting in a rather stagnant economy.\nHowever, in recent years, the financial services sector has gained in\nimportance in the city. In 2002, the trading began on the newly established\nBanja Luka Stock Exchange. The number of companies listed, the trading volume\nand the number of investors have increased significantly. A number of big\ncompanies such as Telekom Srpske, Rafinerija ulja Modriča, Banjalučka Pivara\nand Vitaminka are all listed on the exchange and are traded regularly.\nInvestors, apart from those from Slovenia, Croatia and Serbia, now include a\nnumber of investment funds from the European Union, Norway, the United States,\nJapan and China.\n\nA number of financial services regulators, such as the Indirect Taxation\nAuthority of Bosnia and Herzegovina, Republika Srpska Securities Commission\nand the RS Banking Agency are headquartered in Banja Luka. This, along with\nthe fact that some of the major banks in Bosnia, the Deposit Insurance Agency\nand the Value-added tax (VAT) Authority are all based in the city, has helped\nBanja Luka establish itself as a major financial centre of the country.\n\nIn 1981 Banja Luka's GDP per capita was 97% of the Yugoslav average."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Energy",
    "text": "The country has been a heavy user of energy compared with the EU, with\nartificially low prices providing a disincentive to make savings. Heavily\nreliant on lignite coal for power generation, in 2021 Bosnia and Herzegovina\nis one of very few countries still making plans to expand coal energy\ngeneration.\n\nStatistics\n\n**2020 energy statistics** Production capacities for electricity\n(billion kWh)  | Type | Amount\n---|---\nFossil fuel | 26.27\nHydro | 14.81\nWind power | 0.62\nSolar | 0.12\nBiomass | 0.04\nTotal | 41.86\n|  Electricity\n(billion kWh)  | Category | Amount\n---|---\nConsumption | 11.66\nProduction | 16.96\nImport | 3.27\nExport | 7.32\n|  Natural Gas\n(billion m3)  | Consumption | 0.218\n---|---\nImport | 0.218\n\n**CO 2 emissions:**\n20.95 million tons"
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Renewable power",
    "text": "Wind and Solar\n\nThe first wind farm was built in 2018.\n\nThe 2030 plan envisages 1.5 GW of solar power and 0.5 GW of wind power\ncapacity being built.\n\nHydro power\n\nIn 2021 the country had around 2076 MW of installed hydropower capacity larger\nthan 10 MW, with 180 MW of small hydropower units."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Fossil fuels",
    "text": "Coal\n\nIn 2021, electricity production came from five main lignite coal power plants\ngenerating up to 2065 MW.\n\nTuzla Thermal Power Plant was supposed to close unit 4 in 2022 however the\ngovernment has extended this lignite coal generators life. Kakanj Power\nStation was also supposed to have closed unit 5 in 2022 under the 2006 Energy\nCommunity Treaty.\n\nUnder the 2030 plan a number of coal power stations will close or convert to\nbiomass.\n\n* Breza coal mine\n* Gacko coal mine\n* Kakanj coal mine\n\n|\n\n* Kamengrad coal mine\n* Kongora coal mine\n* Stanari coal mine\n\n|\n\n* Tušnica coal mine\n* Ugljevik coal mine\n* Zenica coal mine\n\n\n---|---|---"
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Tourism",
    "text": "Stari Most in Mostar, a UNESCO World Heritage Site\n\nThe tourism sector has been recovering and helping the economy altogether in\nthe process, with popular winter skiing destinations as well as summer\ncountryside tourism. Bosnia and Herzegovina has been a top performer in recent\nyears in terms of tourism development; tourist arrivals have grown by an\naverage of 24% annually from 1995 to 2000. The European region's solid growth\nin arrivals in 2007 was due in significant part to Southern and Mediterranean\nEurope's strong performance (+7%). In particular, Bosnia and Herzegovina were\namong the stronger players with a growth of 20%.\n\nIn 2012, Bosnia and Herzegovina had 747,827 tourists an increase of 9% and\n1,645,521 overnight stays which is a 9,4% increase from 2012. 58.6% of the\ntourists came from foreign countries.\n\nAccording to an estimate of the World Tourism Organization, Bosnia and\nHerzegovina will have the third highest tourism growth rate in the world\nbetween 1995 and 2020.\n\nOf particular note is the diaspora population which often returns home during\nthe summer months, bringing in an increase in retail sales and food service\nindustry.\n\nIn 2017, 1,307,319 tourists visited Bosnia and Herzegovina, an increase of\n13.7%, and had 2,677,125 overnight hotel stays, a 12.3% increase from the\nprevious year. Also, 71.5% of the tourists came from foreign countries."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Challenges of doing business",
    "text": "While business regulations are of comparable strictness as in most countries\nin Central Europe, many problems persist. Post-war high percentage of\nunemployment (16.85%) remains high, and the economical progress is very slow.\nComplicated bureaucracy system, complex procedures and often misconducted\naudition and regulation by public officers also make for volatile and insecure\nbusiness environment, which is considered major hindrance to foreign\ninvestment into the country's industrial and manufacturing potential.\n\nThe workforce is comparably cheap, with average net salary being €580, and\naverage gross salary being €891, (as of June 2022[update]) and good skilled,\nespecially in sectors present in pre-war economy. However, with slow but\npersistent know-how obsolescence, workforce exodus, high unemployment and long\naverage time outside labor market for the unemployed, need a foreign-owned\nbusiness investing in industry sectors where the country could be competitive.\n\nBosnia and Herzegovina is also lacking a good e-governance structure, as well\nas good methods to enforce administrative accountability, both of which are\nconsidered necessary for more conductive business climate. Today[_when?_] it\ntakes between 3–5 weeks to register a company in the country (and in some\nbusiness sectors it can still take months to acquire all required permits,\nmostly due to administrative inefficiency), and many other business related\nadministrative procedures are similarly convoluted and time-consuming.\n\nPolitical corruption is one of the more acute problems in Bosnia and\nHerzegovina, and along with size of administration and its inefficiency, the\nbiggest detriment to tax money being spent where it should be spent – on\nservices to the population and the economy.\n\nBosnia and Herzegovina has been preparing for an era of declining\ninternational assistance. Country's most immediate task remains economic\nrevitalization to create jobs and income. After the 2014 riots, both\nadministrations have shyly started the reform, dealing with some of the many\npressing issues to local economy, but the overall process is still considered\nslow and tenuous by the populace and local as well as foreign economic\nanalysts."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Infrastructure",
    "text": "Motorway on the Pan-European Corridor Vc between Sarajevo and Visoko\n\nThe Bosnian government has issued an international tender for the construction\nof the 350 km long Pan-European Corridor Vc in Bosnia and Herzegovina which\nwill passes along the route Budapest-Osijek-Sarajevo-Ploče. The highway along\nthis corridor is the most significant roadway in Bosnia and Herzegovina and\nthe shortest communication route between Central Europe and the Southern\nAdriatic. The routing of the road passes through the central part of the\ncountry in the north–south direction from Donji Svilaj to the border of B&H,\nnorth from the Croatian port of Ploče, following the rivers Bosna and Neretva.\nMore than 50% of the total population and the economic activity of Bosnia and\nHerzegovina lies within the zone of influence along this route.\n\nAs of August 2018, 200 km of the motorway has been completed.\n\nDue to annual growth of nearly 10% the Sarajevo International Airport\nextension of the passenger terminal, together with upgrading and expanding the\ntaxiway and apron is planned to start in Fall 2012. The existing terminal will\nbe expanded with 7.000 square metres. The upgraded airport will also be\ndirectly connected to the commercial retail center Sarajevo Airport Center\nmaking it easy for tourist and travellers to use the time before the flight\nfor some last minute shopping."
  },
  {
    "chapter_name": "Economy of Bosnia and Herzegovina",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "International rankings",
    "text": "World map representing Human Development Index categories (based on 2021 data, published in 2022)  Very high (≥ 0.800) High (0.700–0.799) Medium (0.550–0.699) |  Low (≤ 0.549) Data unavailable\n---|---\n\n* 74th in Human Development Index (2021)\n* 60th in inequality-adjusted Human Development Index (2021)\n* 97th in Democracy Index (2022)\n* 48th in Henley Passport Index (2023)\n* 81st in Human Capital Index (2020)\n* 88th in Quality of Nationality Index (2018)\n* 72nd in Legatum Prosperity Index (2023)\n* 63rd in Social Progress Index (2022)\n* 90th in Ease of Doing Business (2020)\n* 39th in Economic Complexity Index (2021)\n* 92nd in Global Competitiveness Report (2019)\n* 68th in Index of Economic Freedom (2023)\n* 61st in Global Peace Index (2023)\n* 110th in Corruption Perceptions Index (2022)"
  }
]