[
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Moldova** is an emerging upper-middle income economy, Moldova\nis a landlocked Eastern European country, bordered by Ukraine on the East and\nRomania to the West. It is a former Soviet republic and today a candidate\nmember to the European Union.",
    "openai_summarised_points": [
      "• The economy of Moldova is classified as an emerging upper-middle income economy.",
      "• Moldova is a landlocked country located in Eastern Europe.",
      "• The country shares its eastern border with Ukraine and its western border with Romania.",
      "• Moldova was formerly a republic within the Soviet Union.",
      "• Currently, Moldova holds the status of a candidate member for the European Union."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:40:06.209281",
      "openai_model": "gpt-4.1-mini",
      "content_length": 260,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Background",
    "text": "On January 2, 1992, Moldova introduced a market economy, liberalising prices,\nwhich resulted in huge inflation. In 1993, a national currency, the Moldovan\nleu, was introduced to replace the Soviet rouble. The economic fortunes of\nMoldova began to change in 2001; since then the country has seen a steady\nannual growth of between 5% and 10%. Remittances from Moldovans abroad account\nfor a quarter of Moldova's GDP, one of the highest percentages in the world.",
    "openai_summarised_points": [
      "• On January 2, 1992, Moldova introduced a market economy by liberalising prices, an action that led to significant inflation within the country.",
      "• In 1993, Moldova established its national currency, the Moldovan leu, which replaced the Soviet rouble as the official medium of exchange.",
      "• The economic situation in Moldova began to improve notably in 2001, marking the start of a period characterized by steady annual economic growth ranging between 5% and 10%.",
      "• Remittances sent by Moldovans living abroad constitute approximately 25% of Moldova's Gross Domestic Product (GDP), representing one of the highest proportions of remittance contributions to GDP globally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T10:40:09.590812",
      "openai_model": "gpt-4.1-mini",
      "content_length": 459,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Overview",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( January 2017)_\n---|---\n| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed. _( October 2012)__(Learn how\nand when to remove this message)_\n---|---\nHorse-drawn carts in the Moldovan countryside.\n\nMoldova's proximity to the Black Sea gives it a mild and sunny climate. The\nfertile Chernozem soil supports wheat, corn, barley, tobacco, sugar beet, and\nsoybeans. Beef and dairy cattle are raised, and beekeeping is widespread.\nMoldova's best-known product comes from its extensive and well-developed\nvineyards concentrated in the central and southern regions. Moldova produces\nliqueur and sparkling wine. It is also known for its sunflower seeds, walnuts,\napples, and other fruits. This makes the area ideal for agriculture and food\nprocessing, which accounts for about 40% of the country's GDP.\n\nIn 2018, Moldova produced:\n\n* 1.1 million tons of wheat;\n* 132 thousand tons of plum;\n* 174 thousand tons of potato;\n* 175 thousand tons of barley;\n* 2.0 million tons of maize;\n* 665 thousand tons of apple;\n* 707 thousand tons of sugar beet (the beet is used to manufacture sugar and ethanol);\n* 730 thousand tons of grape;\n* 788 thousand tons of sunflower seed.\n\nIn addition to smaller productions of other agricultural products, like\nrapeseed (85 thousand tons). Moldova has a production of grape and apple\nbetween the 20th and 25th largest in the world, and a production of plum and\nsunflower seed between the 10th and 15th largest of the world.\n\nGDP by sector, 1989, 1999 and 2015\n\nMoldova has experienced economic difficulties, like many other former Soviet\nrepublics. Since its economy was highly dependent on the rest of the former\nSoviet Union for energy and raw materials, the breakdown in trade following\nthe breakup of the Soviet Union had a serious effect, exacerbated at times by\ndrought and civil conflict. The Russian rouble devaluation of 1998 had a\ndeleterious effect on Moldova's economy, but economic growth has been steady\nsince 2000.\n\nMoldova has made progress in economic reform since independence. The\ngovernment has liberalized most prices and has phased out subsidies on most\nbasic consumer goods. A program begun in March 1993 has privatized 80% of all\nhousing units and nearly 2,000 small, medium, and large enterprises, which led\nto a rise in homelessness and unemployment. Other successes include the\nprivatization of nearly all of Moldova's agricultural land from state to\nprivate ownership, as a result of an American assistance program completed in\n2000. A stock market opened in June 1995.\n\nInflation was brought down from over 105% in 1994 to 11% in 1997. Though\ninflation spiked again after Russia’s 1998 currency devaluation, Moldova made\ngreat strides in bringing it under control: 18.4% in 2000, 6.3% in 2001, and\n4.4% in 2002. In 2003 inflation escalated again – due mainly to a drought-\ndriven rise in agricultural prices – reaching 15.7%, although it was reined in\nto 12.5% in 2004. The local currency appreciated considerably in 2003 and the\nfirst months of 2004. By May, the leu had reached its highest level since the\nend of 1999. After the National Bank of Moldova increased considerably its\npurchases on the foreign exchange market, the leu stabilized in\nNovember–December 2004 at 12.00-12.50 to the US dollar.\n\nMoldova continues transitioning towards a free-market economy. The country\nrecorded its fifth consecutive year of positive GDP growth in 2004, with year-\nend real GDP growth of 8%. This growth is impressive considering that, prior\nto 2000, Moldova had recorded only one year of positive GDP growth since\nindependence. Budget execution in 2004 was also impressive, as actual\nconsolidated budget revenues exceeded projections by 1.4% for most of the\nyear.\n\nPrivatization results in 2004 were not significant: several smaller companies\nand one winery were privatized in 2004, but the government postponed\nindefinitely the privatization of several larger state enterprises, including\ntwo electricity distribution companies. Sporadic and ineffective enforcement\nof the law, economic and political uncertainty, and government harassment and\ninterference continue to discourage inflows of foreign direct investment.\n\nImports continued to increase more rapidly than exports during the first nine\nmonths of 2004; Moldova’s terms of trade worsened, as higher-priced energy\nimports outpaced the value of Moldova’s main exports—agricultural and agro-\nprocessing goods.\n\nDuring 2002, Moldova rescheduled an outstanding Eurobond, in the amount of\n$39.6 million, to avoid a potential default. In May 2004, Moldova redeemed\npromissory notes with a total value of $114.5 million to Russian Gazprom for\njust $50 million. Moldova informed its bilateral creditors in mid-2003 that it\nwould no longer service its debts. The 2004 budget did provide funds for\nexternal debt service (interest) at some 6% of the government budget, the 2005\nbudget projects external debt service at some 4%. The International Monetary\nFund (IMF) and World Bank resumed lending to Moldova in July 2002, and then\nsuspended lending again in July 2003. Although Moldova passed a poverty\nreduction strategy in 2004, it has yet to reach an agreement with\ninternational financial institutions.\n\n70% of total electrical energy power consumed in Moldova is imported from\nUkraine and only 30% is produced in Moldova.\n\nIn 2021 Moldova's trade with Russia was $1.33b compared with the EU of $5.06.\nIn 2022 the EU trade increased to $6.9b"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Macroeconomic situation",
    "text": "| This section **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources in this section.\nUnsourced material may be challenged and removed. _( October 2012)__(Learn how\nand when to remove this message)_\n---|---\nReal GDP per capita development of Moldova, 1973 to 2018\n\nAs a whole, Moldova is doing well, despite a series of consecutive shocks,\nwhich included the doubling of the price of imported natural gas and 2006\nRussian ban of Moldovan and Georgian wines, and a severe drought in 2007.\nGrowth is estimated at 5 percent in 2007 and is projected to increase to 7\npercent in 2008. Investment is picking up, and is beginning to replace\nremittances as the main source of growth—an encouraging sign that the earlier\nmodel of consumption-driven growth is changing.\n\nMoldova increasingly faces the challenges experienced by other transition\neconomies. Improved growth prospects have come with strong appreciation\npressures from foreign exchange inflows, and a widening trade deficit. Foreign\ndirect investment (FDI) has picked up and is estimated to have reached 12\npercent of GDP in 2007, compared with 7 percent in 2006.\n\nThe main macroeconomic concern is inflation, which at 13 percent remains high\nfor the region.\n\nA deterioration in the merchandise trade balance due to strong import growth\nhas been offset by improvements in net income and transfers, with a small\nimprovement in the current account deficit to 12 percent of GDP. A resumption\nof wine exports to Russia in October was a major positive development,\nalthough volumes are likely to recover slowly.\n\nFiscal policy remained tight, ending 2007 with a modest deficit of 0.3 percent\nof GDP. Strong revenue performance was driven by robust VAT on imports, while\nexpenditure was kept in line with the budget. However, the tax cuts introduced\nin 2008 may undermine the favorable fiscal position.\n\nMonetary tightening in 2007 was complicated by the strong inflow of foreign\nexchange. The National Bank of Moldova increased reserve requirements from 10\nto 15 percent, and raised policy interest rates by 2.5 percentage points.\nNevertheless, the possibility of second-round effects from the drought,\nliquidity pressures from growing remittances and FDI, and the continued strong\ngrowth in credit and broad money suggest that upside risks to inflation are\nnot yet fully contained.\n\nIn spite of some favorable background, Moldova remains Europe's poorest\nnation, resisting pursuing the types of reforms that have vastly improved the\neconomies of some of its Eastern European neighbors. The Communist Party\nretained political control after winning the March 2005 parliamentary\nelections and re-elected its leader, Vladimir Voronin, as president in\ncollaboration with the opposition. Although the government maintains a pro-\nWestern stance, it has had trouble pursuing structural reforms and has made\nlittle progress on the International Monetary Fund's program to attract\nexternal financial resources. The parliament approved the government's\neconomic growth and strategy paper in December 2004, but international\nfinancial institutions and Western investors will not be satisfied until the\ngovernment begins to address fiscal adjustment, wage restraint, and payment of\ndebt arrears. Despite the fact that the pace of privatization and industrial\noutput has slowed, GDP growth was 7.3 percent in 2004, consumption continues\nto grow, and the currency continues to appreciate. The impasse in the pro-\nRussian Transnistria enclave, plagued by corruption and the smuggling of arms\nand contraband, continues despite international attempts at mediation."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Business and economic environment",
    "text": "According to the 2024 Index of Economic Freedom, Moldova ranks 99th globally\nwith the overall score of 57.1, a decrease relative to 2023.\n\nRule of Law  | Regulatory Efficiency  | Government Size  | Open Markets\n---|---|---|---\nParameter  | Score  | Change  in Yearly Score from 2022 | Parameter  | Score  | Change  in Yearly Score from 2022 | Parameter  | Score  | Change  in Yearly Score from 2022 | Parameter  | Score  | Change  in Yearly Score from 2022\nProperty Rights  | 37.9  |  | Business Freedom  | 60.2  |  | Government Spending  | 64.4  |  | Trade Freedom  | 75.6  |\nGovernment Integrity  | 35.6  |  | Labor Freedom  | 46.6  |  | Tax Burden  | 93.4  |  | Investment Freedom  | 55.0  |\nJudicial Effectiveness  | 29.8  |  | Monetary Freedom  | 71.2  |  | Fiscal Health  | 82.1  |  | Financial Freedom  | 50.0  |\n\n_*Everything above 60 is considered to be Moderately Free._\n\nAccording to the 2020 Ease of Doing Business Index, Moldova's Distance to\nFrontier is 74.4/100 (48th globally), an increase of 1.3 relative to 2019.\n\n| Ease of doing business, 2020\n---\n**Parameter** |  | **DTF**\nStarting a Business |  | 95.7% |\nDealing with Construction Permits |  | 56.2% |\nGetting Electricity |  | 75.3% |\nRegistering Property |  | 82.8% |\nGetting Credit |  | 70.00% |\nProtecting Minority Investors |  | 68.0% |\nPaying Taxes |  | 85.2% |\nTrading Across Borders |  | 92.3% |\nEnforcing Contracts |  | 63.6% |\nResolving Insolvency |  | 54.8% |\n\n_*DTF (Distance to Frontier): Higher is better_"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Trade policy",
    "text": "According to the World Bank, Moldova's weighted average tariff rate in 2001\n(the most recent year for which World Bank data are available) was 2.8\npercent. (The World Bank has revised the figure for 2001 downward from the 3.9\npercent reported in the 2005 Index.) A 2004 World Bank report notes a \"range\nof informal barriers to both imports and exports in Moldova, such as\ncumbersome and restrictive trade procedures, corruption, burdensome and\ninappropriate regulations and high transport costs.\" Based on the revised\ntrade factor methodology, Moldova's trade policy score is unchanged."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Free Trade Agreements",
    "text": "Currently Moldova has signed multilateral and bilateral Free Trade Agreements\nwith 43 countries.\n\nAgreement | Signed | Entry into Force | Comment\n---|---|---|---\nMoldova–Azerbaijan FTA | 1995 | 1996 |\nMoldova–Georgia FTA | 1997 | 2007 |\nCEFTA | 19 December 2006 | 28 July 2007 |\nCISFTA | 18 October 2011 | 9 December 2012 |\nDCFTA | 27 June 2014 | 1 July 2016 | Provisionally applied 1 September 2014 – 1 July 2016\nMoldova–Turkey FTA | 11 September 2014 | 1 November 2016 |\nEFTA-Moldova FTA | 27 June 2023 |  | Awaiting ratification\nMoldova–China FTA |  |  | Under Negotiation"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Regional developments",
    "text": "Countries tend to benefit from sharing borders with developed markets as this\nfacilitates trade and development. Below is a table of Moldova's neighboring\ncountries, their GDP per capita in 1995 and 2021, and trade values between the\npairs. Their evolution is distinct as Romania went from a GDP per capita which\nwas about 1.7 times larger than that of Moldova's in 1995 to one which in 2021\nis more than 2.5 times as large. Ukraine on the other hand has decreased when\ncompared to Moldova.\n\nCountry  | GDP per capita,\nPPP (current international $) 1995 | GDP per capita,\nPPP (current international $) 2021\n---|---|---\nRomania  | 5,429 | 36,277\nUkraine  | 4,136 | 14,281\nMoldova  | 3,145 | 15,009\n\nThe Russian Federation for comparison rose from 5,613 in 1995 to 34,043 in\n2021, slightly than Romania."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Regional GDP",
    "text": "This is a list of regions of Republic of Moldova by nominal GDP shown in\nMoldovan leu and Euro. Statistics shown are for 2021.\n\nRank  | Region  | GDP (billion leu)  | GDP (billion €)  | GDP per capita (€)\n---|---|---|---|---\n1  | Chișinău | 146.204  | 7.003  | 11,000\n2  | Northern Region | 37.080  | 1.776  | 1,800\n3  | Central Region | 36.390  | 1.743  | 1,600\n4  | Southern Region | 16.838  | 0.807  | 1,500\n5  | Gagauzia | 5.566  | 0.267  | 2,000\n| **Moldova** | 242.079  | 11.596  | 4,800"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Fiscal burden",
    "text": "Moldova's income tax rate has been a flat 12 percent since 2019.\n\nThe corporate tax rate for SRL companies has been 12 percent from 2012, since\n2018 the unique tax of 7% for IT companies part of Moldova IT Park was\nimplemented.\n\nThe Sales tax (VAT) standard rate has remained at 20% since 2014. There are\nreduced rates of 12% and 8% for certain goods.\n\nIn 2024, Moldova decided that companies in Transnistria and Moldova should be\ntreated in a similar way as regards customs duties on imported goods,\nresulting in Transnistria import companies needing to register with Moldova\nand pay import custom duties (but not V.A.T., nor excise duties) to Moldova.\nThis would also hopefully reduce smuggling of goods out of Transnistria that\nhad been imported duty free, such as cigarettes."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Monetary policy",
    "text": "Annual inflation rate hit 30.2% in December 2022, mainly as a result of the\nrise in world wide fuel and food costs, falling in 2023, interest rates are\nnow also falling but remain high until inflation is under control."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Foreign investment",
    "text": "The Moldovan government does not maintain many formal barriers to foreign\ninvestment, and the Moldovan embassy reports that foreign investors are free\nto \"place their investments throughout the Republic of Moldova, in any area of\nbusiness activity, as long as it does not go against the interests of the\nnational security, anti-monopoly legislation, environment protection norms,\npublic health and public order.\"\n\nSince gaining independence in 1992, Moldova privatised most state-owned\nenterprises, and most sectors of the economy are almost entirely in private\nhands. The government keeping control of electrical distribution, railways,\nthe state airline Air Moldova, fixed line communication company Moldtelecom\nand the country’s largest tobacco company.\n\nInvest Moldova was created to encourage inward investment, promoting the low\nlevels of tax on individuals and companies. Free Economic Zones have been\ncreated designed for export-oriented manufacturing companies, Industrial Parks\nhave been established to bring companies together and offer lower operating\ncosts.\n\nForeign direct investment is slowly rising, $587m in 2022, $410m in 2021 and\n$150m in 2020, with each year supplemented with $4.7-4.9 billion of loans,\nwith manufacturing, financial intermediation, and trade being the main\nsectors."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "11",
    "section_name": "Banking and finance",
    "text": "There are no official barriers to founding foreign banks or branches in\nMoldova. The central bank the National Bank of Moldova has a responsibility to\nthe management and control of all banks in Moldova.\n\nIn 2014 a major fraud took place, the 2014 Moldovan bank fraud scandal which\nnearly bankrupted the country. $1 billion disappeared from three Moldovan\nbanks: _Banca de Economii_ , _Unibank_ and _Banca Socială_. In the week\npreceding the 2014 Moldovan parliamentary election more than $750 million were\nextracted from the three banks in just three days, with a van loaded with\nstolen files from the banks being burned. A number of people were charged,\nIlan Shor was convicted but fled justice.\n\nMajor reforms to the legal framework of the Moldovan financial sector have\ntaken place as the country progresses to implementing the EU`s legislation. By\n2023 the Moldovan banking system is regarded as harmonized at a high level\nwith the relevant EU community. The IMF reported in 2023 that Banks remain\nadequately capitalised, maintain adequate liquidity coverage and healthy asset\nquality."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "12",
    "section_name": "Wages and prices",
    "text": "The government influences prices through the large state-owned sector.\nAccording to the Ministry of Economy, the state regulates the prices of goods\nand services provided by monopolies and the prices of electric or thermal\nenergy, land, medical services, and services offered by local tax regions.\nMoldova has two legal monthly minimum wages: one wage for state employees and\nanother, higher wage for the private sector.\n\nIn 2023, the average monthly salary in the economy was MDL 12,175 (approx. 630\nEUR / 686 USD)"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "13",
    "section_name": "Property rights",
    "text": "The U.S. Department of Commerce reports that the \"legal system has improved in\nrecent years. Moldova has a documented and consistently applied commercial\nlaw.\" Nevertheless, much more needs to be done. According to the U.S.\nDepartment of State, \"The Constitution provides for an independent judiciary;\nhowever, the executive branch has exerted undue influence on the judiciary.\nMany observers believe that arrears in salary payments also make it difficult\nfor judges to remain independent from outside influences and free from\ncorruption.\""
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "14",
    "section_name": "Regulation",
    "text": "\"Bureaucratic procedures are not always transparent and red tape often makes\nprocessing unnecessarily long,\" reports the U.S. Department of Commerce.\n\"[C]ommercial law is a confusing patchwork of narrow statutes and an outdated\ncivil code. With USAID experts, a draft civil code has been developed which\nfollows the current European practice of incorporating commercial law\nprovisions.\" The same source reports that anti-corruption laws \"are not\neffectively enforced and corruption exists at an advanced level.\" A report\nprovided by the World Bank indicates that labor laws are somewhat rigid."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "15",
    "section_name": "Informal market",
    "text": "Transparency International's 2004 score for Moldova is 2.3. Thereafter,\nMoldova's informal market score is 4 in 2005. In 2011 the corruption score for\nMoldova is 2.9, better than it was in 2004, concluding TI."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "16",
    "section_name": "Tourism",
    "text": "* Total:  503,700 in 2023\n* International Tourism:  406,000\n* Inbound:  43,600\n* Romania \\- 38.9%\n* Italy \\- 14.4%\n* Ukraine \\- 14.0%\n* Germany \\- 5.3%\n* USA \\- 5.2%\n* Outbound:  362,400\n* Turkey \\- 47.0%\n* Bulgaria \\- 18.9%\n* Egypt \\- 10.6%\n* Romania \\- 10.3%\n* Greece \\- 5.5%\n* Domestic Tourism:  97,700\n\nThere are around 15,000 sights and 300 natural zones within Moldova, which\nrepresent a potential for domestic and international tourists."
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "17",
    "section_name": "Statistics",
    "text": "Year  | GDP\n(in bil. US$ nominal)  | GDP per capita\n(in US$ nominal)  | GDP\n(in bil. US$ PPP)  | GDP per capita\n(in US$ PPP)  | GDP growth\n(real)  | Inflation\n(CPI)  | Inflation\n(End of Period)  | Public Debt\n(Government Gross Debt)  | Public Debt\n(Current Account Balance)  | External Debt\n(General government US$)  | Total External Debt (US$)\n---|---|---|---|---|---|---|---|---|---|---|---\n2013  | 9.496  | 3,307.3  | 23.961  | 8,345.0  | 9.0%  | 4.57%  | 5.1%  | 29.9%  | -5.2%  | 1.305  | 6.729\n2014  | 9.510  | 3,314.5  | 25.218  | 8,789.2  | 5.0%  | 5.06%  | 4.7%  | 34.9%  | -6.0%  | 1.320  | 6.320\n2015  | 7.726  | 2,715.7  | 26.233  | 9,221.8  | -0.3%  | 9.6%  | 13.5%  | 42.4%  | -6.0%  | 1.354  | 5.932\n2016  | 8.072  | 2,857.8  | 29.732  | 10,527.0  | 4.4%  | 6.4%  | 2.3%  | 39.2%  | -3.6%  | 1.481  | 6.056\n2017  | 9.515  | 3,422.6  | 31.586  | 11,361.9  | 4.2%  | 6.5%  | 7.3%  | 34.8%  | -5.8%  | 1.722  | 6.833\n2018  | 11.252  | 4,121.0  | 33.671  | 12,332.0  | 4.1%  | 3.6%  | 0.9%  | 31.8%  | -10.8%  | 1.706  | 7.321\n2019  | 11.737  | 4,376.6  | 35.509  | 13,241.0  | 3.6%  | 4.8%  | 7.5%  | 28.8%  | -9.4%  | 1.718  | 7.416\n2020  | 11.530  | 4,377.5  | 32.987  | 12,523.5  | -8.3  | 3.7%  | 0.4%  | 36.6%  | -7.7%  | 2.255  | 8.088\n2021  | 13.694  | 5,293.2  | 39.259  | 15,175.3  | 13.9  | 5.1%  | 13.9%  | 32.6%  | -12.4%  | 2.606  | 8.740\n2022  | 14.550  | 5,726.3  | 39.918  | 15,709.5  | -4.9  | 28.5%  | 30.2%  | 32.6%  | -14.3%  | 3.172  | 9.593\n2023  | 16.000  | 6,410.9  | 42.217  | 16,915.7  | 2.0  | 13.3%  | 5.0%  | 35.0%  | -12.1%  | 3.487  | 10.242"
  },
  {
    "chapter_name": "Economy of Moldova",
    "chapter_id": "1",
    "section_number": "17.1",
    "section_name": "Moldovan economy in graphics",
    "text": "* GDP (Nominal per capita) of Moldova and Neighboring Countries.\n\n* GDP (PPP per capita) of Moldova and Neighboring Countries.\n\n* Moldovan Foreign Workers Remittances to Moldova and GDP Nominal.\n\n**Industrial production growth rate:** 3.4% (2017)\n**Agricultural production growth rate:** 2.5% (2018)"
  }
]