[
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "Change in per capita GDP of Nigeria, 1950–2018. Figures are inflation-adjusted\nto 2011 International Geary-Khamis dollars.\n\nThe **economy of Nigeria** is a middle-income, mixed economy and emerging\nmarket with expanding manufacturing, financial, service, communications,\ntechnology, and entertainment sectors. It is ranked as the 53rd-largest\neconomy in the world in terms of nominal GDP, the second largest in Africa in\nterms of purchasing power parity, and the 27th-largest in terms of purchasing\npower parity.\n\nThe country's re-emergent manufacturing sector became the largest on the\ncontinent in 2013, and it produces a large proportion of goods and services\nfor the region of West Africa. Nigeria's debt-to-GDP ratio was 36.63% in 2021\naccording to the IMF.\n\nAlthough oil revenues contributed 2/3 of state revenues, oil only contributes\nabout 9% to the GDP. Nigeria produces about 2.7% of the world's oil supply.\nAlthough the petroleum sector is important, as Nigeria's government revenues\nstill heavily rely on this sector, it remains a small part of the country's\noverall economy. The largely subsistence agricultural sector has not kept up\nwith the country's rapid population growth. Nigeria was once a large net\nexporter of food, but currently imports some of its food products.\nMechanization has led to a resurgence in the manufacturing and exporting of\nfood products, and there was consequently a move towards food sufficiency. In\n2006, Nigeria came to an agreement with the Paris Club to buy back the bulk of\nits owed debts from them, in exchange for a cash payment of roughly US$12\nbillion.\n\nAccording to a report by Citigroup, published in February 2011, Nigeria had\nthe highest average GDP growth in the world between 2010 and 2050. Nigeria is\none of two countries from Africa among the 11 Global Growth Generators\ncountries.",
    "openai_summarised_points": [
      "• The economy of Nigeria is classified as a middle-income, mixed economy and emerging market, characterized by expanding sectors including manufacturing, financial services, communications, technology, and entertainment.",
      "• Nigeria ranks as the 53rd-largest economy globally by nominal GDP, the second largest economy in Africa by purchasing power parity (PPP), and the 27th-largest economy worldwide by PPP.",
      "• In 2013, Nigeria's manufacturing sector re-emerged as the largest on the African continent, producing a significant proportion of goods and services for the West African region.",
      "• According to the International Monetary Fund (IMF), Nigeria's debt-to-GDP ratio stood at 36.63% in 2021.",
      "• Oil revenues constitute approximately two-thirds (2/3) of Nigeria’s state revenues, yet the petroleum sector contributes only about 9% to the country's overall GDP.",
      "• Nigeria accounts for roughly 2.7% of the global oil supply, underscoring the country's role as a notable oil producer despite the petroleum sector’s relatively small share of the total economy.",
      "• The agricultural sector in Nigeria is largely subsistence-based and has not kept pace with the country's rapid population growth, leading to a shift from being a large net food exporter to importing some food products.",
      "• Mechanization in agriculture has spurred a resurgence in manufacturing and exporting food products, facilitating a movement towards achieving food sufficiency in the country.",
      "• In 2006, Nigeria reached an agreement with the Paris Club to repurchase the majority of its outstanding debts in exchange for a cash payment of approximately US$12 billion.",
      "• A Citigroup report published in February 2011 identified Nigeria as having the highest average GDP growth rate globally projected between 2010 and 2050.",
      "• Nigeria is one of only two African countries included among the 11 Global Growth Generators identified by Citigroup, highlighting its significant economic growth potential."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:13:48.648319",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1840,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Overview",
    "text": "In 2014, Nigeria rebased its GDP to account for fast-growing contributors such\nas telecommunications, banking, and its film industry to its economy. Human\ncapital is underdeveloped, as Nigeria ranked 161 out of 189 countries in the\nUnited Nations Development Index in 2019—and non-energy-related infrastructure\nis inadequate.\n\nNigeria has advanced efforts to provide universal primary education, and\nprotect the environment.\n\nA requirement for achieving many of its objectives is reducing endemic\ncorruption, which obstructs development and stains Nigeria's business\nenvironment. However, while broad-based progress has been slow, these efforts\nare becoming visible in international surveys of corruption. Nigeria's ranking\nhas mostly improved since 2001, ranking 154 out of 180 countries in\nTransparency International's 2021 Corruption Perceptions Index.\n\nThe Nigerian economy suffers from an ongoing supply crisis in the power\nsector. Despite a rapidly growing economy, some of the world's largest\ndeposits of coal, oil, and gas and the country's status as Africa's largest\noil producer, power supply difficulties are frequently experienced by\nresidents. Two-thirds of Nigerians expect living conditions to improve in the\ncoming decades. According to the National Bureau of Statistics (NBS) Nigeria's\nGDP grew by 3.19% in Q2 2024. The non-oil sector drove growth, expanding by\n4.13%, while the oil sector contracted by -3.83%.",
    "openai_summarised_points": [
      "• In 2014, Nigeria rebased its Gross Domestic Product (GDP) to better reflect the contributions of rapidly growing sectors such as telecommunications, banking, and the film industry to its economy.",
      "• Nigeria's human capital is underdeveloped, as evidenced by its ranking of 161 out of 189 countries on the United Nations Development Index in 2019.",
      "• The country faces inadequate non-energy-related infrastructure, which hampers overall economic development.",
      "• Nigeria has made advancements in efforts to provide universal primary education and to protect the environment, indicating progress in social and ecological policy areas.",
      "• A critical challenge to achieving Nigeria’s development objectives is the reduction of endemic corruption, which obstructs progress and negatively impacts the business environment.",
      "• Despite slow broad-based progress, Nigeria’s anti-corruption efforts have become more visible in international assessments, with the country’s ranking improving since 2001.",
      "• In Transparency International’s 2021 Corruption Perceptions Index, Nigeria ranked 154 out of 180 countries, reflecting some progress in combating corruption.",
      "• The Nigerian economy experiences a persistent supply crisis in the power sector, which affects residents despite the country’s abundant natural resources.",
      "• Nigeria holds some of the world’s largest deposits of coal, oil, and gas and is recognized as Africa’s largest oil producer, yet frequent power supply difficulties persist.",
      "• Two-thirds of Nigerians express optimism, expecting living conditions to improve over the coming decades.",
      "• According to the National Bureau of Statistics (NBS), Nigeria’s GDP grew by 3.19% in the second quarter (Q2) of 2024.",
      "• The non-oil sector was the primary driver of economic growth in Q2 2024, expanding by 4.13%, while the oil sector contracted by -3.83%."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:13:54.383832",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1428,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Economic history",
    "text": "The following table shows the main economic indicators in 1990–2023 (with IMF\nstaff estimates in 2024–2029). Inflation under 10% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---\n1990  | 165.5  | 1,739  | 62.2  | 653  | n/a  | n/a  | 71.7%\n1991  | 170.2  | 1,743  | 60.1  | 616  | -0.6%  | n/a  | 75.0%\n1992  | 177.9  | 1,776  | 52.3  | 522  | 2.2%  | n/a  | 70.2%\n1993  | 185.0  | 1,801  | 56.8  | 553  | 1.6%  | n/a  | 71.0%\n1994  | 189.4  | 1,799  | 80.1  | 761  | 0.3%  | n/a  | 55.9%\n1995  | 197.0  | 1,825  | 132.2  | 1,225  | 1.9%  | n/a  | 34.0%\n1996  | 208.7  | 1,886  | 172.7  | 1,560  | 4.1%  | 29.3%  | 25.2%\n1997  | 218.5  | 1,925  | 187.9  | 1,656  | 2.9%  | 10.7%  | 24.1%\n1998  | 226.4  | 1,947  | 209.7  | 1,803  | 2.5%  | 7.9%  | 22.3%\n1999  | 230.8  | 1,935  | 57.5  | 482  | 0.5%  | 6.6%  | 64.9%\n2000  | 249.1  | 2,037  | 67.8  | 555  | 5.5%  | 6.9%  | 57.6%\n2001  | 271.7  | 2,167  | 73.1  | 583  | 6.7%  | 18.9%  | 53.1%\n2002  | 316.2  | 2,459  | 94.0  | 731  | 14.6%  | 12.9%  | 43.3%\n2003  | 353.1  | 2,677  | 102.9  | 780  | 9.5%  | 14.0%  | 42.1%\n2004  | 400.4  | 2,959  | 130.3  | 963  | 10.4%  | 15.0%  | 35.5%\n2005  | 441.9  | 3,182  | 169.6  | 1,222  | 7.0%  | 17.9%  | 18.9%\n2006  | 486.2  | 3,411  | 222.8  | 1,563  | 6.7%  | 8.2%  | 9.4%\n2007  | 535.9  | 3,662  | 262.2  | 1,792  | 7.3%  | 5.4%  | 8.1%\n2008  | 585.5  | 3,897  | 330.3  | 2,198  | 7.2%  | 11.6%  | 7.3%\n2009  | 638.4  | 4,137  | 297.5  | 1,927  | 8.4%  | 12.5%  | 8.6%\n2010  | 718.9  | 4,535  | 369.1  | 2,328  | 11.3%  | 13.7%  | 9.4%\n2011  | 769.6  | 4,727  | 414.1  | 2,544  | 4.9%  | 10.8%  | 17.4%\n2012  | 817.4  | 4,888  | 461.0  | 2,756  | 4.3%  | 12.2%  | 17.6%\n2013  | 876.2  | 5,101  | 515.0  | 2,998  | 5.4%  | 8.5%  | 18.3%\n2014  | 947.7  | 5,372  | 568.5  | 3,223  | 6.3%  | 8.0%  | 17.5%\n2015  | 981.9  | 5,421  | 492.4  | 2,719  | 2.7%  | 9.0%  | 20.3%\n2016  | 975.2  | 5,244  | 404.6  | 2,176  | -1.6%  | 15.7%  | 23.4%\n2017  | 1,000.7  | 5,242  | 375.7  | 1,969  | 0.8%  | 16.5%  | 24.3%\n2018  | 1,041.7  | 5,318  | 421.7  | 2,153  | 1.9%  | 12.1%  | 27.7%\n2019  | 1,123.3  | 5,590  | 474.5  | 2,361  | 2.2%  | 11.4%  | 29.2%\n2020  | 1,145.7  | 5,558  | 432.7  | 2,099  | -1.8%  | 13.2%  | 34.5%\n2021  | 1,200.1  | 5,677  | 441.6  | 2,089  | 3.6%  | 17.0%  | 35.7%\n2022  | 1,327.5  | 6,124  | 476.5  | 2,198  | 3.3%  | 18.8%  | 39.7%\n2023  | 1,414.6  | 6,367  | 363.8  | 1,637  | 2.9%  | 24.7%  | 46.4%\n2024  | 1,489.8  | 6,543  | 199.7  | 877  | 2.9%  | 32.5%  | 51.3%\n2025  | 1,564.9  | 6,706  | 195.0  | 835  | 3.2%  | 25.0%  | 50.0%\n2026  | 1,641.5  | 6,866  | 224.8  | 940  | 3.0%  | 15.2%  | 48.9%\n2027  | 1,727.6  | 7,054  | 239.4  | 978  | 3.3%  | 15.4%  | 48.5%\n2028  | 1,818.0  | 7,248  | 261.0  | 1,040  | 3.3%  | 14.0%  | 49.0%\n2029  | 1,912.8  | 7,447  | 268.9  | 1,047  | 3.3%  | 14.0%  | 49.3%\nYear | Gross domestic product,\n(PPP, in billions) | US dollar exchange | Inflation index\n(2000=100) | Per capita income\n(as % of USA)\n---|---|---|---|---\n1980 | *58 | 1 Naira | 1.30 | 7%\n1985 | *82 | 3 Naira | 3.20 | 5%\n1990 | *118 | 9 Naira | 8.10 | 2.5%\n1995 | *155 | 50 Naira | 56 | 3%\n2000 | 170 | 100 Naira | 100 | 3.5%\n2005 | 291 | 130 Naira | 207 | 4%\n2010 | 392 | 150 Naira | 108 | 5%\n2012 | 451 | 158 Naira | 121 | 7%\n2014 | 972 | 180 Naira | 10 | 11%\n2015 | 1,089 | 220 Naira | 10 | 10%\n2016 | 1,093 | 280 Naira | 17 | 10%\n2017 | 1,125 | 360 Naira | 5 (est) | 10%\n\nNOTES:\n\nThe US dollar exchange rate is an estimated average of the official rate\nthroughout a year and does not reflect the parallel market rate at which the\ngeneral population accesses foreign exchange. This rate ranged from a high of\n520 in March 2017 to a low of 350 in August 2017, due to a scarcity of forex\n(oil earnings had dropped by half), and speculative activity as alleged by the\nCentral Bank. All the while the official rate was pegged at 360.\n\nPer capita income (as % of USA) is calculated using data from estimates in the\nPPP link above, and census estimates, based on growth rates between census\nperiods. For instance, 2017 GDPs were 1,125 billion (Nigeria) vs. 19,417\nbillion (USA) and populations were estimated at 320 million vs 190 million.\nThe ratio is, therefore (1125/19417) / (190/320), which roughly comes to\n0.0975. These are estimates and are intended to get a feel for the relative\nwealth and standard of living, as well as the market potential of its middle\nclass.\n\nThis is a chart of trends of the global ranking of the Nigerian economy, in\ncomparison with other countries of the world, derived from the historical List\nof countries by GDP (PPP).\n\nYear | 2005 | 2006 | 2007 | 2008 | 2009 | 2010 | 2011 | 2012 | 2013 | 2014 | 2015 | 2016 | 2017 (est.)\n---|---|---|---|---|---|---|---|---|---|---|---|---|---\nRanking | 52 | 47 | 38 | 37 | 34 | 31 | 31 | 30 | 23 | 20 | 21 | 22 | 23\n\nThis chart shows the variance in the parallel exchange rate at which the\nDollar can be obtained with Naira in Lagos, with \"Best\" being cheaper for a\nNigerian (i.e. stronger Naira).\n\nYear | 2015 | 2016 | 2017 | 2018 | 2019\n---|---|---|---|---|---\nBest | 195 | 345 | 350 | 370 | 380\nWorst | 237 | 490 | 520 | 430 | 490\n\nFor purchasing power parity comparisons, the US dollar is exchanged at US$1 to\n314.27 Nigerian naira (as of 2017).\n\nThe current GDP per capita of Nigeria expanded 132% in the sixties reaching a\npeak growth of 283% in the seventies. But this proved unsustainable, and it\nconsequently shrank by 66% in the 1980s. In the 1990s, diversification\ninitiatives finally took effect and decadal growth was restored to 10%.\nAlthough GDP on a PPP basis did not increase until the 2000s.\n\nIn 2012, the GDP was composed of the following sectors: agriculture: 40%;\nservices: 30%; manufacturing: 15%; oil: 14%. By 2015, the GDP was composed of\nthe following sectors: agriculture: 18%; services: 55%; manufacturing: 16%;\noil: 8%\n\nIn 2005 Nigeria's inflation rate was an estimated 15.6%. Nigeria's goal under\nthe National Economic Empowerment Development Strategy (NEEDS) program is to\nreduce inflation to the single digits. By 2015, Nigeria's inflation stood at\n9%. In 2005, the federal government had expenditures of US$13.54 billion but\nrevenues of only US$12.86 billion, resulting in a budget deficit of 5%. By\n2012, expenditures stood at $31.61 billion, while revenues were $54.48\nbillion. In 2024, the Central Bank of Nigeria (CBN) raised the Monetary Policy\nRate (MPR) again, this time to 18.5%, the 6th consecutive increase since\nSeptember 2022.",
    "openai_summarised_points": [
      "• Between 1990 and 2023, Nigeria's GDP (PPP) grew from $165.5 billion to $1,414.6 billion, with IMF staff estimates projecting continued growth to $1,912.8 billion by 2029.",
      "• Nigeria's GDP per capita (PPP) increased from $1,739 in 1990 to $6,367 in 2023, with projections reaching $7,447 by 2029.",
      "• Nominal GDP rose from $62.2 billion in 1990 to $363.8 billion in 2023, though IMF projections show fluctuations, with $199.7 billion estimated for 2024 and a gradual increase to $268.9 billion by 2029.",
      "• Nominal GDP per capita increased from $653 in 1990 to $1,637 in 2023, with future estimates ranging from $877 in 2024 to $1,047 in 2029.",
      "• Real GDP growth rates varied significantly, with negative growth in 1991 (-0.6%), 2016 (-1.6%), and 2020 (-1.8%), but generally positive growth averaging around 2.9% to 3.3% in recent IMF projections for 2024–2029.",
      "• Inflation rates fluctuated widely, with data missing for early 1990s; notable inflation included 14.6% in 2002, 15.0% in 2004, and a peak of 24.7% in 2023. Inflation under 10% was highlighted in green in the data, with Nigeria achieving single-digit inflation by 2015 (9%).",
      "• Government debt as a percentage of GDP decreased from 71.7% in 1990 to a low of 7.3% in 2008, then increased again to 46.4% in 2023, with IMF forecasts projecting debt levels around 49% to 51.3% through 2024–2029.",
      "• The US dollar exchange rate against the Nigerian Naira depreciated from 1 Naira per USD in 1980 to 360 Naira per USD in 2017 (official rate), with parallel market rates ranging from 350 to 520 Naira per USD in 2017 due to forex scarcity and speculative activities as noted by the Central Bank of Nigeria (CBN).",
      "• Inflation index (2000=100) rose from 1.30 in 1980 to a peak of 207 in 2005, then fluctuated, with a notable low of 5 (estimated) in 2017.",
      "• Per capita income as a percentage of the USA’s per capita income declined from 7% in 1980 to 3% in 1985 and 2.5% in 1990, then fluctuated around 3.5% to 10% in the 2000s and 2010s, reaching an estimated 10% in 2017.",
      "• The official US dollar exchange rate does not reflect the parallel market rate, which is often higher due to limited foreign exchange availability and speculative pressures.",
      "• Nigeria’s GDP per capita expanded by 132% in the 1960s, peaked with 283% growth in the 1970s, but shrank by 66% in the 1980s; diversification efforts in the 1990s restored decadal growth to 10%, though PPP GDP growth only resumed in the 2000s.",
      "• Sectoral composition of Nigeria’s GDP shifted significantly between 2012 and 2015: agriculture’s share declined from 40% to 18%, services increased from 30% to 55%, manufacturing rose slightly from 15% to 16%, and oil’s contribution dropped from 14% to 8%.",
      "• In 2005, Nigeria’s inflation rate was estimated at 15.6%, with the National Economic Empowerment Development Strategy (NEEDS) aiming to reduce inflation to single digits; by 2015, inflation was successfully reduced to 9%.",
      "• Federal government fiscal data shows a budget deficit of 5% in 2005, with expenditures at $13.54 billion and revenues at $12.86 billion; by 2012, expenditures rose to $31.61 billion while revenues increased substantially to $54.48 billion, indicating improved fiscal balance.",
      "• The Central Bank of Nigeria (CBN) raised the Monetary Policy Rate (MPR) to 18.5% in 2024, marking the sixth consecutive increase since September 2022, reflecting monetary tightening efforts.",
      "• Nigeria’s global GDP (PPP) ranking improved from 52nd in 2005 to a peak of 20th in 2014, before slightly declining to 23rd by 2017 (estimated).",
      "• Parallel market exchange rates for the US dollar in Lagos showed significant volatility between 2015 and 2019, with the \"best\" rates (stronger Naira) ranging from 195 Naira/USD in 2015 to 380 Naira/USD in 2019, and the \"worst\" rates fluctuating between 237 and 520 Naira/USD.",
      "• For purchasing power parity comparisons, the US dollar was exchanged at a rate of 1 USD to 314.27 Nigerian Naira as of 2017."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:24.516878",
      "openai_model": "gpt-4.1-mini",
      "content_length": 6661,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Agriculture",
    "text": "Nigerian farmers in the Middle Belt (2006). 30% of Nigerians are employed in\nagriculture.\n\nThe agricultural sector suffers from extremely low productivity, reflecting\nreliance on antiquated methods. Agriculture has failed to keep pace with\nNigeria's rapid population growth, so the country, which once exported food,\nnow imports a significant amount of food to sustain itself. However, efforts\nare being made towards making the country food sufficient again. Africa's most\npopulous country has failed to grow more food for its fast-rising population\nwho must be fed with staples ranging from rice, beans, maize etc.",
    "openai_summarised_points": [
      "• In 2006, Nigerian farmers in the Middle Belt region were part of an agricultural workforce that employs approximately 30% of the Nigerian population.",
      "• The agricultural sector in Nigeria is characterized by extremely low productivity, primarily due to the continued reliance on antiquated farming methods.",
      "• Despite Nigeria's historical status as a food-exporting country, the agricultural sector has failed to keep pace with the nation's rapid population growth.",
      "• As a result of insufficient domestic food production, Nigeria now imports a significant amount of food to meet the consumption needs of its population.",
      "• Nigeria, recognized as Africa's most populous country, has struggled to increase food production to adequately feed its fast-growing population.",
      "• The staple foods that Nigerians rely on include rice, beans, and maize, among others.",
      "• Efforts are currently underway to restore Nigeria's food self-sufficiency and reduce dependence on food imports."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:31.242625",
      "openai_model": "gpt-4.1-mini",
      "content_length": 615,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Crop production",
    "text": "Plant based food production in Nigeria, 2020, in million tonnes\n\nNigeria ranks sixth worldwide and first in Africa in farm output. The sector\naccounts for about 18% of GDP and almost one-third of employment. Though\nNigeria is no longer a major exporter, due to local consumer boom, it is still\na major producer of many agricultural products. Further agricultural products\ninclude palm oil and rubber.",
    "openai_summarised_points": [
      "• In 2020, Nigeria's plant-based food production was measured in million tonnes, reflecting its significant agricultural output.",
      "• Nigeria ranks sixth globally and holds the position of the largest farm output producer in Africa.",
      "• The agricultural sector contributes approximately 18% to Nigeria's Gross Domestic Product (GDP).",
      "• Nearly one-third of Nigeria's workforce is employed within the agricultural sector, highlighting its importance to national employment.",
      "• Despite no longer being a major exporter due to a surge in local consumer demand, Nigeria remains a leading producer of numerous agricultural products.",
      "• In addition to staple crops, Nigeria produces significant quantities of palm oil and rubber, which are important components of its agricultural economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:34.010501",
      "openai_model": "gpt-4.1-mini",
      "content_length": 400,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.1",
    "section_name": "Roots and tubers",
    "text": "Roots economy in the South and cereal economy in the North of Nigeria\n\nCounting by weight, this \"underground food\" is the largest group of food\nproduced in Nigeria, with 118 million tonnes in 2020. This group includes yam,\ncassava, potatoes and sweet potatoes. These food products are cultivated\nmostly in the south of Nigeria (\"Roots economy\").",
    "openai_summarised_points": [
      "• The Nigerian economy exhibits a regional agricultural specialization, with a roots-based economy predominant in the southern region and a cereal-based economy dominant in the northern region.",
      "• In terms of production by weight, roots and tubers constitute the largest category of food produced in Nigeria, totaling 118 million tonnes in the year 2020.",
      "• The category of roots and tubers, often referred to as \"underground food,\" encompasses key crops such as yam, cassava, potatoes, and sweet potatoes.",
      "• These root and tuber crops are primarily cultivated in the southern part of Nigeria, which is characterized as the \"Roots economy\" region due to its focus on these agricultural products."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:37.490711",
      "openai_model": "gpt-4.1-mini",
      "content_length": 345,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.2",
    "section_name": "Cereals",
    "text": "The group of sorghum, pear millet etc. is the second-largest group of food\nproduced in Nigeria, with 28.6 million tonnes in 2020. 50% or 14 million\ntonnes of this is sorghum. The sugar cane production adds another 1.5 million\ntonnes to this. Cereals are mostly cultivated in the savannah zone of the\ncountry, and on the 23rd of June Nigeria's grain market report, the\nInternational Grains Council (IGC) placed Nigeria's total 2022-23 grains\nproduction at 21.6 million tonnes, this specific figure was reviewed from the\nprevious month's forecast which was 21.1 million, It set the production in the\nyear 2021–22 at 21.5 million which demonstrates and proves that there is an\nincrease in the production of grains on the 23rd of June 2022 – 2023.",
    "openai_summarised_points": [
      "• The group of cereals including sorghum and pearl millet constitutes the second-largest category of food produced in Nigeria, with a total production of 28.6 million tonnes recorded in 2020.",
      "• Sorghum alone accounts for 50% of this cereal group production, amounting to 14 million tonnes in 2020.",
      "• Sugar cane production in Nigeria contributes an additional 1.5 million tonnes to the overall cereal production figures.",
      "• Cereals in Nigeria are predominantly cultivated in the savannah zone, which is the primary agricultural region for these crops.",
      "• On June 23, the International Grains Council (IGC) released Nigeria’s grain market report for the 2022-23 period, estimating total grain production at 21.6 million tonnes.",
      "• This 21.6 million tonnes figure for 2022-23 was a revision upward from the previous month’s forecast of 21.1 million tonnes, indicating a positive adjustment in expected grain output.",
      "• The IGC set Nigeria’s grain production for the year 2021-22 at 21.5 million tonnes, providing a basis for comparison that shows a slight increase in grain production from 2021-22 to 2022-23.",
      "• The data released on June 23, 2022, thus demonstrates a trend of increasing grain production in Nigeria between the 2021-22 and 2022-23 agricultural years."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:44.249137",
      "openai_model": "gpt-4.1-mini",
      "content_length": 743,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.3",
    "section_name": "Rice and paddy",
    "text": "Peanut, oil palm, cocoa and cotton production in Nigeria.\n\nThe third-largest group of food produced in Nigeria is rice and paddy. In\n2020, 8.2 million tonnes were produced.",
    "openai_summarised_points": [
      "• In Nigeria, peanut, oil palm, cocoa, and cotton are significant agricultural products contributing to the country's economy.",
      "• Rice and paddy constitute the third-largest group of food produced in Nigeria, highlighting their importance in the national food production hierarchy.",
      "• In the year 2020, Nigeria produced a total of 8.2 million tonnes of rice and paddy, reflecting substantial agricultural output in this sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:46.910412",
      "openai_model": "gpt-4.1-mini",
      "content_length": 172,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.4",
    "section_name": "Oil crops",
    "text": "Nigeria produced a good 4 million tonnes of oil crops in 2020. These are e.g.\nsoybeans, sunflower seed, canola and peanuts.",
    "openai_summarised_points": [
      "• In 2020, Nigeria produced approximately 4 million tonnes of oil crops, reflecting a significant contribution to the agricultural sector.",
      "• The primary types of oil crops produced in Nigeria include soybeans, sunflower seeds, canola, and peanuts."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:49.879417",
      "openai_model": "gpt-4.1-mini",
      "content_length": 123,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.5",
    "section_name": "Citrus fruit",
    "text": "Nigeria produced close to 4 million tonnes of citrus fruit in 2020. Main\nNigerian citrus fruits are tangerine, grape, lemon and lime.",
    "openai_summarised_points": [
      "• In 2020, Nigeria produced close to 4 million tonnes of citrus fruit, highlighting the country's significant output in this agricultural sector.",
      "• The primary types of citrus fruits cultivated in Nigeria include tangerine, grape, lemon, and lime, representing the main varieties contributing to the nation's citrus production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:51.929674",
      "openai_model": "gpt-4.1-mini",
      "content_length": 133,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.6",
    "section_name": "Cocoa",
    "text": "Cocoa production, mostly from obsolete varieties and overage trees has\nincreased from around 180,000 tons annually to 350,000 tons.",
    "openai_summarised_points": [
      "• Cocoa production in Nigeria, primarily derived from obsolete varieties and overage trees, has experienced an increase from approximately 180,000 tons annually to 350,000 tons."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:53.873447",
      "openai_model": "gpt-4.1-mini",
      "content_length": 131,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.7",
    "section_name": "More products",
    "text": "Beans, melons, pepper and vegetables are grown on chopping fields. Oil palms,\nrubber and bananas are grown for export. Palm oil plays a major role in\nNigeria's burgeoning personal care products industry.",
    "openai_summarised_points": [
      "• Beans, melons, pepper, and vegetables are cultivated on chopping fields in Nigeria, contributing to the country's agricultural output.",
      "• Oil palms, rubber, and bananas are grown primarily for export purposes, indicating their significance in Nigeria's international trade.",
      "• Palm oil holds a major role in Nigeria's rapidly growing personal care products industry, highlighting its economic importance beyond food production."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:56.435131",
      "openai_model": "gpt-4.1-mini",
      "content_length": 203,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.8",
    "section_name": "Cattle",
    "text": "Livestock in Kano fruit market, Nigeria\n\nIn total, about 15 million head are kept. In addition, about five million pigs\nare kept. Small livestock such as sheep, goats and chickens are kept mainly\nfor subsistence.",
    "openai_summarised_points": [
      "• Nigeria maintains a total livestock population of approximately 15 million head.",
      "• In addition to this, about five million pigs are kept across the country.",
      "• Small livestock, including sheep, goats, and chickens, are primarily raised for subsistence purposes rather than commercial production.",
      "• The livestock sector includes various animals, with a notable presence in markets such as the Kano fruit market, indicating the integration of livestock trade within broader agricultural markets."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:14:59.405582",
      "openai_model": "gpt-4.1-mini",
      "content_length": 212,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.1.9",
    "section_name": "Poultry and Eggs",
    "text": "An estimated 42% of Nigerians own chicken. As a result, poultry and eggs\nrepresent a popular commodity within the food industry. 46% of the poultry is\nkept in an extensive / free-range system. 300 thousand tonnes of poultry meat\nand 650 thousand tonnes of eggs are produced annually in Nigeria (estimation).",
    "openai_summarised_points": [
      "• An estimated 42% of Nigerians own chickens, indicating widespread poultry ownership across the country.",
      "• Poultry and eggs constitute a significant and popular commodity within Nigeria's food industry.",
      "• Approximately 46% of poultry in Nigeria is raised using an extensive or free-range system, reflecting traditional and less intensive farming practices.",
      "• Nigeria produces an estimated 300,000 tonnes of poultry meat annually, highlighting the sector's substantial contribution to national food supply.",
      "• The annual production of eggs in Nigeria is estimated at 650,000 tonnes, underscoring the importance of egg production in the country's agricultural economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:02.805396",
      "openai_model": "gpt-4.1-mini",
      "content_length": 307,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Fishing",
    "text": "A man catching fish\n\nIn 2003, Nigeria recorded a fish production of 505.8 metric tons. In 2015,\nproduction stood at 1 027 000 tonnes.",
    "openai_summarised_points": [
      "• In 2003, Nigeria's fish production was recorded at 505.8 metric tons, reflecting the country's fishing output during that year.",
      "• By 2015, Nigeria's fish production had increased significantly to 1,027,000 tonnes, indicating substantial growth in the fishing sector over the 12-year period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:04.827570",
      "openai_model": "gpt-4.1-mini",
      "content_length": 133,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Timber",
    "text": "Roundwood removals totaled slightly less than 70 million cubic meters, and\nsawn wood production was estimated at 2 million cubic meters.\n\nThe paper industry in Nigeria has a long history that dates back to the 1960s\nand 1970s, when the government established three integrated pulp and paper\nmills: the Nigerian Paper Mill in Jebba; the Nigeria Newsprint Manufacturing\nCompany, Oku Iboku; and the Iwopin Pulp and Paper Company. These mills were\nmeant to meet the domestic demand for paper products and reduce import\ndependence.\n\nHowever, these mills have faced various challenges over the years, such as\nlack of maintenance, obsolete equipment, inadequate power supply, and scarcity\nof raw materials. As a result, they have either become moribund or are\noperating at low capacity. According to a report by allAfrica.com, only the\nJebba mill still has a shoath of life.\n\nThe local production of paper products in Nigeria is estimated at 265,000\nmetric tons per year, while the domestic demand is estimated at 3 million\nmetric tons per annum. This means that Nigeria relies heavily on importation\nof paper products to meet its needs, which costs the country about N182\nbillion annually. Importing paper products also exposes the country to\nfluctuations in foreign exchange rates and international market prices.",
    "openai_summarised_points": [
      "• Roundwood removals in Nigeria totaled slightly less than 70 million cubic meters, while sawn wood production was estimated at 2 million cubic meters.",
      "• The paper industry in Nigeria has a historical foundation dating back to the 1960s and 1970s, during which the government established three integrated pulp and paper mills: the Nigerian Paper Mill in Jebba, the Nigeria Newsprint Manufacturing Company in Oku Iboku, and the Iwopin Pulp and Paper Company.",
      "• These pulp and paper mills were intended to satisfy domestic demand for paper products and reduce Nigeria’s dependence on imports.",
      "• Over the years, the mills have encountered numerous challenges including lack of maintenance, obsolete equipment, inadequate power supply, and scarcity of raw materials.",
      "• Due to these operational difficulties, most of the mills have become moribund or are functioning at low capacity.",
      "• According to a report by allAfrica.com, among the three mills, only the Nigerian Paper Mill in Jebba still retains a semblance of operational viability.",
      "• Nigeria’s local production of paper products is approximately 265,000 metric tons per year, which is significantly lower than the domestic demand estimated at 3 million metric tons per annum.",
      "• Consequently, Nigeria heavily depends on the importation of paper products to meet its domestic needs, incurring an annual cost of about N182 billion.",
      "• The reliance on imported paper products exposes Nigeria to vulnerabilities related to fluctuations in foreign exchange rates and international market prices."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:11.082225",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1308,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Peeling / Milling",
    "text": "Until now, Nigeria exported unhusked rice but imported husked rice, the\ncountry's staple food. The rice mill in Imota, near Lagos, is expected to do\nthe relevant processing domestically, improve the balance of trade and the\nlabour market, and save unnecessary costs for transport and middlemen. It\nbegan operations in 2023 at low levels, and is expected to employ 250,000\npeople and produce 2.4 million 50-kg bags of rice annually when fully\noperational.",
    "openai_summarised_points": [
      "• Until recently, Nigeria exported unhusked rice while simultaneously importing husked rice, despite rice being the country's staple food.",
      "• The rice mill located in Imota, near Lagos, is designed to process rice domestically, aiming to improve Nigeria's balance of trade and labor market conditions.",
      "• The Imota rice mill is also expected to reduce unnecessary costs associated with transportation and middlemen in the rice supply chain.",
      "• Operations at the Imota rice mill commenced in 2023, initially at low production levels.",
      "• When fully operational, the Imota rice mill is projected to employ approximately 250,000 people.",
      "• The mill is expected to produce 2.4 million 50-kilogram bags of rice annually at full capacity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:15.316505",
      "openai_model": "gpt-4.1-mini",
      "content_length": 454,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.3.2",
    "section_name": "Coconut oil milling and refining",
    "text": "A multi-billion Naira coconut oil refinery, first of its kind in Africa\nstarted business in Akwa Ibom State. The  _St.Gabriel Coconut Refinery_ in\nMkpat Enin was inaugurated in May 2022. The governor of Akwa Ibom promised to\ncommence immediate training of indigenous hands to man the refinery, said the\nfacility has a daily capacity to crack 1,000,000 coconuts and will employ no\nfewer than 3,000 direct and indirect staff. Coconut oil goes for $1,326 per\nbarrel, according to Governor Emmanuel.",
    "openai_summarised_points": [
      "• The St. Gabriel Coconut Refinery, a multi-billion Naira coconut oil refinery and the first of its kind in Africa, commenced operations in Akwa Ibom State.",
      "• The refinery is located in Mkpat Enin, Akwa Ibom State, and was officially inaugurated in May 2022.",
      "• The Governor of Akwa Ibom State, Emmanuel, pledged to initiate immediate training programs for indigenous personnel to operate and manage the refinery effectively.",
      "• The St. Gabriel Coconut Refinery has a daily processing capacity of cracking 1,000,000 coconuts.",
      "• The facility is projected to create employment for no fewer than 3,000 individuals, encompassing both direct and indirect job opportunities.",
      "• According to Governor Emmanuel, the market price of coconut oil stands at $1,326 per barrel."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:19.065589",
      "openai_model": "gpt-4.1-mini",
      "content_length": 495,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.3.3",
    "section_name": "Dairy and meat",
    "text": "Nigeria has 19 million head of cattle, the largest number in Africa. Yet the\ndairy sector in Nigeria is only able to supply less than 10% of the country's\ndemand for dairy products (as of June 2021), a gap expected to grow in line\nwith population growth.\n\nFan Milk, a Danone Group company, manufacturer of popular frozen dairy and ice\ncream brands, unveiled its newly completed model dairy in Odeda, Ogun state,\nin June 2022. This dairy farm is Danone's first investment in dairy farming in\nsub-Saharan Africa to boost local milk production in Nigeria. Fan Milk will\nlaunch a world-class dairy farm and training institute, leveraging the\nexpertise of parent company Danone.\n\nIn Lekki's Free Trade Zone, the Dano Milk Factory (Arla) opened in 2022. - In\n2021 farmer owned dairy co-operative Arla Foods started to build a dairy farm\nin Kaduna state with 200 hectares. It will keep 400 dairy cows and will have\nmodern milking parlors and technology, also grass lands and living facilities\nfor 25 employees.",
    "openai_summarised_points": [
      "• Nigeria possesses 19 million head of cattle, representing the largest cattle population in Africa.",
      "• Despite this large cattle population, as of June 2021, Nigeria's dairy sector supplies less than 10% of the country's demand for dairy products.",
      "• The shortfall in dairy product supply is projected to increase in accordance with Nigeria's population growth.",
      "• In June 2022, Fan Milk, a subsidiary of the Danone Group and manufacturer of popular frozen dairy and ice cream brands, inaugurated a newly completed model dairy farm in Odeda, Ogun State.",
      "• This dairy farm marks Danone's first investment in dairy farming within sub-Saharan Africa, aimed at enhancing local milk production in Nigeria.",
      "• Fan Milk plans to establish a world-class dairy farm and a training institute, utilizing the expertise and resources of its parent company, Danone.",
      "• The Dano Milk Factory, operated by Arla Foods, opened in 2022 within Lekki's Free Trade Zone.",
      "• In 2021, Arla Foods, a farmer-owned dairy cooperative, commenced construction of a dairy farm in Kaduna State covering 200 hectares.",
      "• The Kaduna farm is designed to accommodate 400 dairy cows and will feature modern milking parlors and advanced technology.",
      "• The facility will also include grasslands and living quarters for 25 employees, supporting both production and workforce needs."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:25.498969",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1003,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.3.4",
    "section_name": "Bakery, household cereals, etc.",
    "text": "Nigeria's bread sector is growing rapidly, with 72 percent dominated by small-\nand medium-scale bakers, according to a 2016 KPMG report. The bakery market of\nNigeria is a $621 million industry.\n\n_\"Fresh bread and miscellaneous bakery\"_ is the bakery product group with the\nhighest consumption (8.5M tonnes), which is 91% of total volume. _\"Fresh bread\nand miscellaneous bakery\"_ exceeded the figures recorded for the second-\nlargest product group \"gingerbread, sweet biscuits and waffles\" (689K tonnes),\nmore than tenfold. The Nigerian bakery product market size is expected to show\nsignificant growth in the forecast period 2020–2026.\n\nPrimera Food in cooperation with Michael Foods started production of noodles\non a big scale in Ogun state in 2022.\n\nKellogg's opened a production plant for her products in the Lekki Free Trade\nZone in Lagos in 2022. It is the second factory Kellogg's has built in Africa.\n\nIn Jos, NASCO Foods produces biscuits and corn flakes. In 2022 they expanded\ntheir Jos factory.",
    "openai_summarised_points": [
      "• According to a 2016 KPMG report, Nigeria's bread sector is rapidly growing, with 72 percent of the market dominated by small- and medium-scale bakers.",
      "• The Nigerian bakery market is valued at $621 million, reflecting its substantial economic significance.",
      "• The bakery product group \"Fresh bread and miscellaneous bakery\" has the highest consumption volume in Nigeria, totaling 8.5 million tonnes, which constitutes 91% of the total bakery product volume.",
      "• The consumption of \"Fresh bread and miscellaneous bakery\" products exceeds that of the second-largest product group, \"gingerbread, sweet biscuits and waffles,\" which amounts to 689,000 tonnes, by more than tenfold.",
      "• The Nigerian bakery product market size is projected to experience significant growth during the forecast period from 2020 to 2026.",
      "• In 2022, Primera Food, in cooperation with Michael Foods, commenced large-scale production of noodles in Ogun State, marking an expansion in Nigeria's processed food sector.",
      "• Kellogg's inaugurated a production plant in 2022 within the Lekki Free Trade Zone in Lagos, representing Kellogg's second factory established on the African continent.",
      "• NASCO Foods, based in Jos, produces biscuits and corn flakes and expanded its factory in Jos in 2022, indicating growth in local food manufacturing capacity."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:31.560107",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1005,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Mining",
    "text": "The mining of minerals in Nigeria accounts for 0.3% of its gross domestic\nproduct. The domestic mining industry is largely underdeveloped, and minerals\nthat it could produce domestically, such as salt or iron ore, are imported.\nRights to ownership of mineral resources is held by the Federal Government of\nNigeria, which grants titles for mineral exploration, mining, and sale of\nmineral resources.\n\nMining regulation is handled by the Ministry of Solid Minerals Development,\nwhich oversees the management of all mineral resources. Mining law is codified\nin the Federal Minerals and Mining Act of 1999.",
    "openai_summarised_points": [
      "• The mining sector in Nigeria contributes approximately 0.3% to the country's gross domestic product (GDP), indicating a relatively minor role in the overall economy.",
      "• Nigeria's domestic mining industry is significantly underdeveloped, resulting in the importation of minerals such as salt and iron ore that could otherwise be produced locally.",
      "• Ownership rights over mineral resources in Nigeria are vested in the Federal Government, which holds exclusive authority to grant titles for mineral exploration, mining activities, and the sale of mineral resources.",
      "• The regulatory framework for mining activities in Nigeria is managed by the Ministry of Solid Minerals Development, which is responsible for overseeing the management and development of all mineral resources within the country.",
      "• The legal basis for mining operations in Nigeria is established by the Federal Minerals and Mining Act of 1999, which codifies the laws governing mineral exploration, mining, and related activities."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:34.528769",
      "openai_model": "gpt-4.1-mini",
      "content_length": 602,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Oil",
    "text": "Dangote oil refinery\n\nThe types of crude oil exported by Nigeria are Bonny light oil, Forcados crude\noil, Qua Ibo crude oil and Brass River crude oil. The U.S. remains Nigeria's\nlargest buyer of crude oil, accounting for 40% of the country's total oil\nexports; Nigeria provides about 10% of overall U.S. oil imports and ranks as\nthe fifth-largest source of U.S. imported oil.\n\nThe United Kingdom is Nigeria's largest trading partner followed by the United\nStates. The stock of U.S. investment is nearly $7 billion, mostly in the\nenergy sector. ExxonMobil and Chevron are the two largest U.S. corporations in\noffshore oil and gas production.",
    "openai_summarised_points": [
      "• Nigeria exports several types of crude oil, including Bonny light oil, Forcados crude oil, Qua Ibo crude oil, and Brass River crude oil.",
      "• The United States is Nigeria's largest buyer of crude oil, accounting for 40% of Nigeria's total oil exports.",
      "• Nigeria supplies approximately 10% of the overall U.S. oil imports, making it the fifth-largest source of imported oil for the United States.",
      "• The United Kingdom is Nigeria's largest trading partner, followed by the United States.",
      "• The stock of U.S. investment in Nigeria is nearly $7 billion, with the majority concentrated in the energy sector.",
      "• ExxonMobil and Chevron are the two largest U.S. corporations involved in offshore oil and gas production in Nigeria."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:38.009122",
      "openai_model": "gpt-4.1-mini",
      "content_length": 640,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.6",
    "section_name": "Natural gas pipeline Nigeria–Morocco",
    "text": "The supply of natural gas to Europe, which is threatened by the Russian\ninvasion of Ukraine, is pushing projects to transport Nigerian natural gas via\npipelines to Morocco or Algeria. In December 2022, Morocco's National Office\nof Hydrocarbons and Mines signed Momoranda of Understanding with Nigeria,\nGambia, Guinea Bissau, Guinea, Sierra Leone, and Ghana to start building the\npipeline through the countries.",
    "openai_summarised_points": [
      "• The Russian invasion of Ukraine has threatened the supply of natural gas to Europe, prompting initiatives to transport Nigerian natural gas via pipelines to North African countries such as Morocco and Algeria.",
      "• In December 2022, Morocco's National Office of Hydrocarbons and Mines signed Memoranda of Understanding (MoUs) with Nigeria, Gambia, Guinea Bissau, Guinea, Sierra Leone, and Ghana.",
      "• These agreements aim to initiate the construction of a natural gas pipeline passing through the aforementioned West African countries to Morocco."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:40.465092",
      "openai_model": "gpt-4.1-mini",
      "content_length": 410,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.7",
    "section_name": "Process and Industrial Developments dispute",
    "text": "Process and Industrial Developments Ltd (P&ID) entered into a 20-year contract\nwith the Nigerian government for natural gas supply and processing. Nigeria\nwas to provide the gas, which PI&D was to refine so that it could be used to\npower the Nigerian electrical grid. PI&D could keep valuable byproducts for\nits own use. In 2012, PI&D demanded arbitration in London, alleging that\nNigeria had not supplied the agreed quantity of gas or to construct the\ninfrastructure it had agreed to build. The arbitral tribunal awarded damages\nof more than £4.8 billion. The compensation was valued £8.15 billion with\ninterest when the case was heard in London High Court in December 2022.",
    "openai_summarised_points": [
      "• Process and Industrial Developments Ltd (P&ID) entered into a 20-year contractual agreement with the Nigerian government concerning the supply and processing of natural gas.",
      "• Under the contract, Nigeria was obligated to supply natural gas, while P&ID was responsible for refining the gas to enable its use in powering the Nigerian electrical grid.",
      "• The contract permitted P&ID to retain valuable byproducts generated from the gas refining process for its own use.",
      "• In 2012, P&ID initiated arbitration proceedings in London, alleging that the Nigerian government failed to supply the agreed quantity of natural gas and did not construct the necessary infrastructure as stipulated in the contract.",
      "• The arbitral tribunal ruled in favor of P&ID, awarding damages exceeding £4.8 billion due to Nigeria’s breach of contract.",
      "• By the time the case was heard in the London High Court in December 2022, the total compensation amount, including accrued interest, had increased to £8.15 billion."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:46.017246",
      "openai_model": "gpt-4.1-mini",
      "content_length": 675,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.8",
    "section_name": "Cement",
    "text": "Dangote and BUA are the dominating companies in the cement market of Nigeria.\nIn May 2022, BUA opened a new, large-scale cement plant in Sokoto, including\nits own 50 MW power station.",
    "openai_summarised_points": [
      "• Dangote and BUA are the two dominant companies operating in the cement market of Nigeria, holding significant market shares and influence within the industry.",
      "• In May 2022, BUA Cement inaugurated a new large-scale cement manufacturing plant located in Sokoto, Nigeria, marking a strategic expansion of its production capacity.",
      "• The newly established BUA cement plant in Sokoto is equipped with an integrated 50 megawatt (MW) power station, enabling self-sufficient energy generation to support its operations."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:48.763925",
      "openai_model": "gpt-4.1-mini",
      "content_length": 183,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.9",
    "section_name": "Oil-based products",
    "text": "Historically, Nigeria has exported crude oil, but imported the majority of\npetroleum products consumed in the country. In September 2024, Dangote Oil\nRefinery began operations with capacity to produce 650,000 barrels (~103 m\nliters) of petrol per day and the potential to significantly reduce Nigeria's\nreliance on imported petroleum products. NNPC, Nigeria's state-owned oil firm,\nis the sole customer of the refinery.",
    "openai_summarised_points": [
      "• Historically, Nigeria has been an exporter of crude oil while importing the majority of petroleum products consumed domestically.",
      "• In September 2024, the Dangote Oil Refinery commenced operations with a production capacity of 650,000 barrels of petrol per day, equivalent to approximately 103 million liters.",
      "• The Dangote Oil Refinery has the potential to significantly reduce Nigeria's dependence on imported petroleum products.",
      "• The Nigerian National Petroleum Corporation (NNPC), the state-owned oil company, is the sole customer of the Dangote Oil Refinery."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:51.936786",
      "openai_model": "gpt-4.1-mini",
      "content_length": 419,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.10",
    "section_name": "Fertiliser and paint",
    "text": "On 3 May 2022, after years of construction, a fertiliser production plant was\ncommissioned near Lagos that will be able to produce 3 million tonnes of\nfertiliser a year. With no more Russian fertiliser coming onto the world\nmarket in 2022 due to the invasion of Ukraine, Nigeria is filling a gap in the\nmarket. \"The fertiliser market is a seller's market\", enthused company boss\nDangote at the plant's opening. \"People are begging for us to sell and we are\nchoosy about who we sell to\".\n\nNot far from the Dangote refinery, BASF opened a factory in Lekki. BASF is\nmostly known for fertilisers, paints, and lacquers.",
    "openai_summarised_points": [
      "• On 3 May 2022, a fertiliser production plant near Lagos, Nigeria, was officially commissioned after several years of construction, marking a significant development in the country's agricultural input sector.",
      "• The newly commissioned fertiliser plant has an annual production capacity of 3 million tonnes, positioning Nigeria as a major player in the global fertiliser market.",
      "• The commissioning of the plant coincided with a global shortage of fertiliser supplies in 2022, primarily due to the cessation of Russian fertiliser exports following the invasion of Ukraine.",
      "• Nigeria is strategically filling the gap in the global fertiliser market created by the absence of Russian fertilisers, thereby enhancing its economic and geopolitical significance in this sector.",
      "• Aliko Dangote, the company boss at the fertiliser plant's opening, described the fertiliser market as a \"seller's market,\" highlighting strong demand and limited supply.",
      "• Dangote emphasized the high demand by stating, \"People are begging for us to sell and we are choosy about who we sell to,\" indicating selective distribution amid robust market conditions.",
      "• In close proximity to the Dangote fertiliser refinery, BASF, a multinational chemical company, inaugurated a factory in Lekki, Nigeria.",
      "• BASF is internationally recognized for its production of fertilisers, paints, and lacquers, and its establishment in Lekki signifies increased industrial activity in Nigeria's chemical manufacturing sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:15:58.449805",
      "openai_model": "gpt-4.1-mini",
      "content_length": 614,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.11",
    "section_name": "Bodycare products, cleaning detergents",
    "text": "The Colgate factory in the Lekki Free Trade Zone close to Lagos started to\nproduce body care products in 2022.",
    "openai_summarised_points": [
      "• The Colgate factory located in the Lekki Free Trade Zone near Lagos commenced production of body care products in the year 2022."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:00.130100",
      "openai_model": "gpt-4.1-mini",
      "content_length": 110,
      "bullet_points_count": 1
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.12",
    "section_name": "Pharmaceutical industry",
    "text": "Nigeria hosts about 60 percent of the pharmaceutical production capacity in\nAfrica (status 2022) and is projected to grow between $60 billion to $70\nbillion after COVID-19, experts say. The pharmaceutical industry in Nigeria\nhas headroom for growth and can potentially reach $4 billion over the next 10\nyears. Goldstein Market Intelligence analyst forecast the Nigeria\npharmaceuticals market size is set to grow at a CAGR of 9.1% over the forecast\nyears of 2017–2030. Most large pharmaceutical companies in Nigeria are located\nin Lagos.\n\nThe pharmaceutical producer with the most employees in Nigeria appears to be\n_Emzor Pharmaceutical Industries Ltd_. They produce more than 140\npharmaceutical products, including painkillers, vitamins, haematinics,\nantimalarials, tussives, antibiotics, anthelmintics, antihistamines, antacids\nand cardioprotectants.\n\n_Fidson Healthcare Plc_ produces painkillers, anti-allergies, blood pressure\nmedicines, digestive aids, sleeping pills and cough syrup. _May & Baker Nig.\nPlc_ produces remedies against malaria, hypertension, diabetes, depressions\nand pain. _Swiss Pharma Nigeria_ produces pharmaceutical products of BAYER.\n\nInnoson Vehicle Manufacturing in Nweri",
    "openai_summarised_points": [
      "• As of 2022, Nigeria hosts approximately 60 percent of the pharmaceutical production capacity in Africa, positioning it as a major hub for pharmaceutical manufacturing on the continent.",
      "• Experts project that the Nigerian pharmaceutical industry is expected to grow significantly post-COVID-19, with market size estimates ranging between $60 billion to $70 billion.",
      "• The pharmaceutical sector in Nigeria has substantial growth potential and is forecasted to reach a market value of $4 billion within the next 10 years.",
      "• According to Goldstein Market Intelligence analysts, the Nigerian pharmaceuticals market is projected to grow at a compound annual growth rate (CAGR) of 9.1% during the forecast period from 2017 to 2030.",
      "• The majority of large pharmaceutical companies in Nigeria are concentrated in Lagos, which serves as the central hub for pharmaceutical manufacturing activities.",
      "• Emzor Pharmaceutical Industries Ltd is identified as the pharmaceutical producer with the largest workforce in Nigeria, manufacturing over 140 pharmaceutical products.",
      "• Emzor’s product range includes painkillers, vitamins, haematinics, antimalarials, tussives, antibiotics, anthelmintics, antihistamines, antacids, and cardioprotectants, demonstrating a broad spectrum of pharmaceutical offerings.",
      "• Fidson Healthcare Plc manufactures a variety of pharmaceutical products including painkillers, anti-allergy medications, blood pressure treatments, digestive aids, sleeping pills, and cough syrup.",
      "• May & Baker Nigeria Plc produces pharmaceutical remedies targeting malaria, hypertension, diabetes, depression, and pain management.",
      "• Swiss Pharma Nigeria is noted for producing pharmaceutical products under the BAYER brand, indicating a partnership or licensing arrangement with the multinational pharmaceutical company.",
      "• The mention of Innoson Vehicle Manufacturing in Nnewi appears in the context but is unrelated to the pharmaceutical industry, indicating the presence of other manufacturing sectors within Nigeria."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:08.626965",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1199,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.13",
    "section_name": "Vehicle industry",
    "text": "Nigerians buy 720,000 cars per year. Of those, less than 20% of these are\nproduced within Nigeria itself.\n\n__Indigenous manufacturers__\n\nInnoson Vehicle Manufacturing is located in Nnewi. It produces buses, SUVs and\nsince May 2022 tricycles which are locally known as \"kekes\".\n\n_Nord Automobiles Ltd_ has two assembly plants: one in Sangotedo, where all\neight models are currently assembled; a plant in Epe is still under\nconstruction. The company currently manufactures its own plastic parts and\nplans to add steel stamping in the future.\n\n30 km north-east of Lagos _Proforce Ltd._ produces armoured vehicles. Proforce\nsold an unknown number of armoured vehicles to Belarus in March 2022. This is\nthe first time that vehicles manufactured in Nigeria have been supplied to a\nEuropean country.\n\n_Jet Motor Company_ in Epe, Lagos State, is producing Nigeria's first\nelectric-powered delivery trucks in partnership with GIG Logistics.\n\nIn Idah, Kogi State, _Electric Motor Vehicle Company_ manufactures\nelectrically powered vehicles. The company is owned by Prince Mustapha Mona\nAudu, a Glasgow-educated computer specialist and son of a former governor. In\nMay 2022, Audu unveiled the four-seater _Adoja_ , which he claims is the most\nenvironmentally friendly vehicle in Nigeria.\n\n__Foreign manufacturers__\n\nThe _Stallion Group_ assembles 45,000 Volkswagen models in Lagos per annum.\n\n_Peugeot Automobiles Nigeria (PAN)_ operates in Kaduna. In April 2022, Peugeot\nleft the conglomerate and Aliko Dangote bought its shares. The company name\nwas changed to DPAN. DPAN will assemble mainly the Chinese brands Chery and\nHiger using pre-produced parts. A new production line, Greenfield, will\nincrease the output to 120 cars per day.",
    "openai_summarised_points": [
      "• Nigerians purchase approximately 720,000 cars annually, with less than 20% of these vehicles being produced domestically within Nigeria.",
      "• Innoson Vehicle Manufacturing, located in Nnewi, produces buses, SUVs, and since May 2022, has also been manufacturing tricycles locally known as \"kekes.\"",
      "• Nord Automobiles Ltd operates two assembly plants: one in Sangotedo where all eight of its vehicle models are currently assembled, and another plant under construction in Epe; the company manufactures its own plastic parts and plans to incorporate steel stamping in the future.",
      "• Proforce Ltd., situated 30 kilometers northeast of Lagos, produces armored vehicles and notably sold an undisclosed number of these vehicles to Belarus in March 2022, marking the first instance of Nigerian-manufactured vehicles being exported to a European country.",
      "• Jet Motor Company, based in Epe, Lagos State, is producing Nigeria’s first electric-powered delivery trucks in collaboration with GIG Logistics.",
      "• Electric Motor Vehicle Company, located in Idah, Kogi State, manufactures electrically powered vehicles; it is owned by Prince Mustapha Mona Audu, a Glasgow-educated computer specialist and son of a former governor, who unveiled the four-seater electric vehicle named Adoja in May 2022, claiming it to be the most environmentally friendly vehicle in Nigeria.",
      "• The Stallion Group assembles approximately 45,000 Volkswagen vehicles annually in Lagos.",
      "• Peugeot Automobiles Nigeria (PAN), operating in Kaduna, underwent ownership changes in April 2022 when Peugeot exited the conglomerate and Aliko Dangote acquired its shares; the company was renamed DPAN and will primarily assemble Chinese brands Chery and Higer using pre-produced parts, with a new Greenfield production line planned to increase output to 120 cars per day."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:13.747583",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1725,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.14",
    "section_name": "Toolmaking industry",
    "text": "In Oshogbo, there is a modest toolmaking industry. Products are e.g. CNC\nturning machines and industrial drilling machines, but also stud bolts and\nflanges. Target market is the oil industry in the Niger delta.",
    "openai_summarised_points": [
      "• The city of Oshogbo hosts a modest toolmaking industry contributing to Nigeria's economy.",
      "• The industry in Oshogbo manufactures products including CNC turning machines and industrial drilling machines.",
      "• Additional manufactured items in this sector include stud bolts and flanges.",
      "• The primary target market for these toolmaking products is the oil industry located in the Niger Delta region."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:16.615506",
      "openai_model": "gpt-4.1-mini",
      "content_length": 210,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.15",
    "section_name": "Electronics",
    "text": "The most successful manufacturer of laptops in Nigeria is, by their own\nadmission, the indigenous Zinox Technologies in Lagos.",
    "openai_summarised_points": [
      "• The most successful manufacturer of laptops in Nigeria is Zinox Technologies, an indigenous company based in Lagos.",
      "• Zinox Technologies acknowledges its position as the leading laptop manufacturer within the Nigerian electronics sector."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:18.561043",
      "openai_model": "gpt-4.1-mini",
      "content_length": 126,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "3.16",
    "section_name": "Steel production",
    "text": "According to its website, Ajaokuta Steel Company Limited produces 1.3 million\ntonnes of steel per year. Steel plants in Katsina, Jos and Osogbo no longer\nappear to be active.",
    "openai_summarised_points": [
      "• Ajaokuta Steel Company Limited, as stated on its official website, has an annual steel production capacity of 1.3 million tonnes.",
      "• Steel manufacturing facilities located in Katsina, Jos, and Osogbo are currently inactive and do not appear to be operational."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:21.326975",
      "openai_model": "gpt-4.1-mini",
      "content_length": 174,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Services",
    "text": "Nigeria ranks 27th worldwide and first in Africa in services output.\n\nFinancial district in Lagos",
    "openai_summarised_points": [
      "• Nigeria ranks 27th worldwide in services output, making it the leading country in Africa for this sector.",
      "• The financial district in Lagos serves as a central hub for Nigeria's services industry, highlighting the city's importance in the national and continental economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:23.272103",
      "openai_model": "gpt-4.1-mini",
      "content_length": 97,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.1",
    "section_name": "Finance sector",
    "text": "Nigeria is the largest financial market in Africa. As of November 2018, 21\ncommercial banks were licensed by the Central Bank of Nigeria (CBN). Nigeria\nhas a relatively well-developed banking sector by regional standards, with\nregionally high level of banking penetration (44.2% vs. regional average of\n17.8% for West Africa) and robust use of advanced financial instruments in the\nlocal economy. The country is also well connected to international financial\nmarkets and following the 2016–17 oil crisis, the country has seen an\nincreasing influx of foreign capital over the past 12–18 months – capital\nimportation in Nigeria jumped to US$6.3 billion in Q1–18 (594% yoy growth) vs.\n$12.3 billion for full year 2017 and $5.1 billion in 2016). However, the\ncountry is weighed down by high lending rates, which limits access to credit\nfor smaller firms, particularly in the non-oil economy. In 2024, the country's\nNational Assembly denied that it had proposed to strip the central bank of the\npower to set interest rates.\n\nNigeria leads the fintech sector, accounting for 28% of all fintech companies\non the continent. As of January 2024, Africa has over 1,263 active fintech\ncompanies.",
    "openai_summarised_points": [
      "• Nigeria is recognized as the largest financial market in Africa, reflecting its significant role in the continent's economic landscape.",
      "• As of November 2018, the Central Bank of Nigeria (CBN) had licensed 21 commercial banks operating within the country.",
      "• The Nigerian banking sector is relatively well-developed compared to regional standards, exhibiting a high level of banking penetration at 44.2%, which is substantially above the West African regional average of 17.8%.",
      "• The local economy demonstrates robust utilization of advanced financial instruments, indicating a sophisticated financial market infrastructure.",
      "• Nigeria maintains strong connections to international financial markets, facilitating cross-border capital flows and investment.",
      "• Following the 2016–17 oil crisis, Nigeria experienced a significant increase in foreign capital inflows over the subsequent 12 to 18 months.",
      "• Capital importation surged to US$6.3 billion in the first quarter of 2018, representing a 594% year-on-year growth compared to previous periods.",
      "• For context, total capital importation was US$12.3 billion for the full year of 2017 and US$5.1 billion in 2016, highlighting a rapid acceleration in foreign investment.",
      "• Despite these positive trends, Nigeria faces challenges due to high lending rates, which restrict access to credit for smaller firms, particularly those operating outside the oil sector.",
      "• In 2024, the Nigerian National Assembly publicly denied any proposal to remove the Central Bank of Nigeria’s authority to set interest rates, maintaining the central bank’s regulatory role.",
      "• Nigeria is the leading country in Africa’s fintech sector, accounting for 28% of all fintech companies on the continent, underscoring its dominance in financial technology innovation.",
      "• As of January 2024, the African continent hosts over 1,263 active fintech companies, with Nigeria playing a central role in this growing industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:29.220173",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1183,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.2",
    "section_name": "Telecommunication",
    "text": "The Nigerian Communications Commissions (NCC) said on January 14, 2022, the\ntelecommunications sector contributed 12.45per cent to Nigeria's Gross\nDomestic Product (GDP). The commission through its chief executive officer\n(CEO), Prof Umar Garba Danbatta, during his convocation lecture, titled,\n\"Empowering the Nigeria Youth Through Information and Communications\nTechnology (ICT)\" held at Fountain University, Osogbo, made this known. Prof\nGarba disclosed that the ICT sector has been consistently contributing above\n10% of Nigeria's GDP for over 10 years. He noted, \"Nigeria is Africa's largest\nICT market with 82per cent of the continent's telecoms subscribers and 29per\ncent of internet usage.\"\n\nNigeria ranks 11th in the world in the absolute number of internet users and\n7th in the absolute number of mobile phones.",
    "openai_summarised_points": [
      "• On January 14, 2022, the Nigerian Communications Commission (NCC) announced that the telecommunications sector contributed 12.45% to Nigeria's Gross Domestic Product (GDP).",
      "• The announcement was made by the NCC's Chief Executive Officer (CEO), Prof. Umar Garba Danbatta, during his convocation lecture titled \"Empowering the Nigeria Youth Through Information and Communications Technology (ICT)\" at Fountain University, Osogbo.",
      "• Prof. Danbatta revealed that the ICT sector in Nigeria has consistently contributed above 10% to the country's GDP for over a decade.",
      "• He emphasized that Nigeria is Africa's largest ICT market, accounting for 82% of the continent's telecommunications subscribers.",
      "• Additionally, Nigeria represents 29% of internet usage across Africa.",
      "• Globally, Nigeria ranks 11th in the absolute number of internet users.",
      "• Nigeria also ranks 7th worldwide in the absolute number of mobile phone users."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:38.017054",
      "openai_model": "gpt-4.1-mini",
      "content_length": 821,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.3",
    "section_name": "Transport sector, forwarding, shipment",
    "text": "Keke in Ikeja, Lagos\n\nDue to Nigeria's location in the centre of Africa, transport plays a major\nrole in the national service sector.\n\nThe Buhari administration made improvements to the infrastructure after 2015.\nExtensive road repairs and new construction have been carried out gradually as\nstates in particular spend their share of increased government allocations.\nRepresentative of these improvements is the Second Niger Bridge at Onitsha,\nwhich is nearly completed in May 2022.\n\nSince 2009, Nigeria has been laying new railway tracks. These are operated by\nthe state-owned Nigerian Railway Corporation. This has apparently generated a\nsurplus since 2019, despite the covid epidemic.\n\nPrincipal ports are at Lagos (Apapa and Tin Can Island), Port Harcourt (Onne),\nand Calabar. A deep seaport in Lekki, 50 km east of Lagos, is about to open in\n2022.\n\nFive of Nigeria's airports (Lagos, Kano, Port Harcourt, Enugu and Abuja)\ncurrently fly to international destinations. The new national airline,\n\"Nigeria Air\", was scheduled to start operations in mid-2022. It was suspended\nindefinitely in 2024.",
    "openai_summarised_points": [
      "• Nigeria's central location in Africa makes the transport sector a crucial component of the national service industry.",
      "• Following 2015, the Buhari administration initiated significant improvements in transport infrastructure, focusing on extensive road repairs and new construction projects.",
      "• State governments have actively invested their increased government allocations into transport infrastructure development.",
      "• A notable infrastructure project representing these improvements is the Second Niger Bridge at Onitsha, which was nearly completed by May 2022.",
      "• Since 2009, Nigeria has been expanding its railway network by laying new tracks operated by the state-owned Nigerian Railway Corporation.",
      "• Despite challenges posed by the COVID-19 pandemic, the Nigerian Railway Corporation reportedly generated a surplus starting in 2019.",
      "• Nigeria's principal seaports are located in Lagos (Apapa and Tin Can Island), Port Harcourt (Onne), and Calabar.",
      "• A new deep seaport in Lekki, situated 50 kilometers east of Lagos, was scheduled to open in 2022.",
      "• Five Nigerian airports—Lagos, Kano, Port Harcourt, Enugu, and Abuja—currently offer flights to international destinations.",
      "• The new national airline, \"Nigeria Air,\" was planned to commence operations in mid-2022 but was suspended indefinitely in 2024."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:43.752200",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1098,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.3.1",
    "section_name": "Movie industry, Television, Streaming",
    "text": "From Nollywood, films and soaps are broadcast to the whole of Africa. Nigeria\nis the second largest film nation in the world after India and ahead of the\nUS.",
    "openai_summarised_points": [
      "• Nollywood, Nigeria's film industry, produces films and soap operas that are broadcast throughout the entire African continent.",
      "• Nigeria ranks as the second largest film-producing nation globally, positioned after India and ahead of the United States in terms of film output."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:45.904834",
      "openai_model": "gpt-4.1-mini",
      "content_length": 157,
      "bullet_points_count": 2
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.3.2",
    "section_name": "Music industry",
    "text": "Perhaps Nigeria's most famous musician is the inventor of Afrobeat Fela\nAnikulapo Kuti, who gave legendary concerts with his band \"Africa 70\" at the\n\"Shrine\" in Lagos. Other characteristic musical styles include Jùjú, Apala,\nFuji and Sakara. In the field of pop music, Nigerian musicians living in\nEurope such as Sade Adu or Dr. Alban were very successful in the 1980s and\n1990s. In Europe, Nneka is one of the best-known Nigerian pop musicians. One\nof the very few Nigerian artists living in Nigeria who has had commercial\nsuccess in Europe is D'Banj. He even reached the European singles charts in\nsummer 2012 with Oliver Twist. Wizkid reached number 1 in 2016 alongside\nDrake.",
    "openai_summarised_points": [
      "• Nigeria's most renowned musician is Fela Anikulapo Kuti, the inventor of Afrobeat, who performed legendary concerts with his band \"Africa 70\" at the \"Shrine\" in Lagos.",
      "• Other distinctive Nigerian musical styles include Jùjú, Apala, Fuji, and Sakara, each representing unique cultural expressions within the country's music scene.",
      "• In the pop music genre, Nigerian musicians residing in Europe, such as Sade Adu and Dr. Alban, achieved significant success during the 1980s and 1990s.",
      "• Among Nigerian pop musicians based in Europe, Nneka is recognized as one of the best-known contemporary artists.",
      "• D'Banj is one of the few Nigerian artists living in Nigeria who has attained commercial success in Europe, notably reaching the European singles charts in the summer of 2012 with the song \"Oliver Twist.\"",
      "• In 2016, Wizkid achieved a number 1 hit on the charts in collaboration with Canadian artist Drake, marking a significant milestone for Nigerian music internationally."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:50.613392",
      "openai_model": "gpt-4.1-mini",
      "content_length": 679,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.3.3",
    "section_name": "Social media",
    "text": "Nigerians are passionate users of social media. In 2021 Nigerians spent 3\nhours and 41 minutes on social media in average every day. This is much higher\nthan the global average of 2 hours 22 minutes. The number of active social\nmedia users in Nigeria increased in 2021 by 22 percent, compared with a global\naverage increase of 13 per cent. WhatsApp and Facebook are the most used\nsocial media platforms in Nigeria.",
    "openai_summarised_points": [
      "• Nigerians are avid users of social media, demonstrating a strong engagement with digital platforms.",
      "• In 2021, the average daily time Nigerians spent on social media was 3 hours and 41 minutes.",
      "• This average daily usage in Nigeria significantly exceeds the global average, which was 2 hours and 22 minutes in 2021.",
      "• The number of active social media users in Nigeria grew by 22 percent in 2021.",
      "• This growth rate of 22 percent in Nigeria surpasses the global average increase in active social media users, which was 13 percent in 2021.",
      "• WhatsApp and Facebook are identified as the most popular and widely used social media platforms among Nigerians."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:54.157565",
      "openai_model": "gpt-4.1-mini",
      "content_length": 414,
      "bullet_points_count": 6
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.4",
    "section_name": "Fashion",
    "text": "The _Lagos Leather Fair_ is the largest leather fair in West Africa. Nigeria\nis the sixth largest leather exporter in the world, with brands such as Prada,\nGucci and Louis Vuitton sourcing their goods here. Fashion journalist Waridi\nSchrobsdorff even puts ‘Milan, Paris, Lagos’ on the same level on news channel\nN-tv.",
    "openai_summarised_points": [
      "• The Lagos Leather Fair is recognized as the largest leather fair in West Africa, highlighting Nigeria's prominence in the regional leather industry.",
      "• Nigeria ranks as the sixth largest leather exporter globally, underscoring its significant role in the international leather market.",
      "• Prestigious global fashion brands such as Prada, Gucci, and Louis Vuitton source leather goods from Nigeria, indicating the country's integration into high-end fashion supply chains.",
      "• Fashion journalist Waridi Schrobsdorff equates Lagos with major fashion capitals Milan and Paris, as stated on the news channel N-tv, reflecting Lagos's rising status in the global fashion industry."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:16:58.605007",
      "openai_model": "gpt-4.1-mini",
      "content_length": 317,
      "bullet_points_count": 4
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "4.5",
    "section_name": "Tourism",
    "text": "The temple of Yoruba goddess Oshun at Osun-Osogbo, an attraction for pilgrims\nand tourists alike African bush elephants in Yankari National Park, Bauchi\nState Multidisciplinary technologist Ade Olufeko inside Sungbo's Eredo in 2017\nTourism in Nigeria centers largely on events, due to the country's ample\namount of ethnic groups, but also includes rainforests, savannah, waterfalls,\nand other natural attractions. Tourists spent US$2.6 billion in Nigeria in\n2015. This dropped to US$1.5 billion in 2017.",
    "openai_summarised_points": [
      "• The temple of the Yoruba goddess Oshun located at Osun-Osogbo serves as a significant attraction for both pilgrims and tourists, highlighting the cultural and religious tourism in Nigeria.",
      "• African bush elephants can be found in Yankari National Park, situated in Bauchi State, representing one of Nigeria's notable wildlife tourism destinations.",
      "• Multidisciplinary technologist Ade Olufeko was documented inside Sungbo's Eredo in 2017, indicating the site's relevance and interest among scholars and tourists alike.",
      "• Tourism in Nigeria predominantly revolves around events, largely due to the country's diverse ethnic groups, which contribute to a rich cultural calendar attracting visitors.",
      "• In addition to cultural events, Nigeria's tourism sector includes natural attractions such as rainforests, savannahs, waterfalls, and other scenic landscapes.",
      "• In 2015, tourists spent approximately US$2.6 billion in Nigeria, reflecting the economic significance of the tourism industry during that period.",
      "• By 2017, tourist expenditure in Nigeria declined to US$1.5 billion, indicating a notable decrease in tourism-generated revenue within two years."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:17:03.100997",
      "openai_model": "gpt-4.1-mini",
      "content_length": 503,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Data",
    "text": "**Electricity – production:** 18.89 billion kWh (2009)\n\n**Electricity – production by source:**\n_fossil fuel:_ 61.69%\n_hydro:_ 38.31%\n_nuclear:_ 0%\n_other:_ <.1% (1998)\n\n**Electricity - consumption:** 17.66 billion kWh (2009)\n\n**Electricity - exports:** 40 million kWh (2003)\n\n**Electricity - imports:** 0 kWh (1998)\n\n**Oil - production:** 2.35 million barrels per day (374×10~~^~~ 3 m3/d) (July\n2006 est.)\n\n**Oil - consumption:** 310,000 bbl/d (49,000 m3/d) (2003 est.)",
    "openai_summarised_points": [
      "• In 2009, Nigeria's electricity production amounted to 18.89 billion kilowatt-hours (kWh).",
      "• The composition of electricity production by source in Nigeria as of 1998 was 61.69% from fossil fuels, 38.31% from hydroelectric power, 0% from nuclear energy, and less than 0.1% from other sources.",
      "• Electricity consumption in Nigeria was recorded at 17.66 billion kWh in 2009.",
      "• Nigeria exported 40 million kWh of electricity in 2003.",
      "• There were no recorded electricity imports into Nigeria in 1998, with imports at 0 kWh.",
      "• As of July 2006, Nigeria's oil production was estimated at 2.35 million barrels per day, equivalent to 374,000 cubic meters per day.",
      "• Nigeria's oil consumption was estimated at 310,000 barrels per day (49,000 cubic meters per day) in 2003."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:17:09.662659",
      "openai_model": "gpt-4.1-mini",
      "content_length": 470,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Overseas remittances",
    "text": "A major source of foreign exchange earnings for Nigeria are remittances sent\nhome by Nigerians living abroad.\n\nAccording to the International Organization for Migration, Nigeria witnessed a\ndramatic increase in remittances sent home from overseas Nigerians, going from\nUS$2.3 billion in 2004 to $17.9 billion in 2007, representing 6.7% of GDP. The\nUnited States accounts for the largest portion of official remittances,\nfollowed by the United Kingdom, Italy, Canada, Spain and France. On the\nAfrican continent, Egypt, Equatorial Guinea, Chad, Libya, and South Africa are\nimportant source countries of remittance flows to Nigeria, while China is the\nbiggest remittance-sending country in Asia.",
    "openai_summarised_points": [
      "• Remittances sent home by Nigerians living abroad constitute a major source of foreign exchange earnings for Nigeria.",
      "• The International Organization for Migration reported a significant increase in remittances to Nigeria, rising from US$2.3 billion in 2004 to US$17.9 billion in 2007.",
      "• In 2007, remittances accounted for 6.7% of Nigeria’s Gross Domestic Product (GDP).",
      "• The United States is the largest source of official remittances sent to Nigeria.",
      "• Following the United States, the United Kingdom, Italy, Canada, Spain, and France are key countries contributing to remittance inflows to Nigeria.",
      "• Within the African continent, Egypt, Equatorial Guinea, Chad, Libya, and South Africa are significant source countries for remittances to Nigeria.",
      "• China is identified as the largest remittance-sending country to Nigeria from Asia."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T11:17:13.549130",
      "openai_model": "gpt-4.1-mini",
      "content_length": 692,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Labour force",
    "text": "In 2015, Nigeria had a labour force of 74 million. In 2003, the unemployment\nrate was 10.8% overall; by 2015, unemployment stood at 6.4%.\n\nSince 1999, the Nigerian Labor Congress (NLC) a union umbrella organization,\nhas called six general strikes to protest domestic fuel price increases.\nHowever, in March 2005 the government introduced legislation ending the NLC's\nmonopoly over union organizing. In December 2005, the Nigerian Labour Congress\n(NLC) was lobbying for an increase in the minimum wage for federal workers.\nThe existing minimum wage, which was introduced six years earlier but has not\nbeen adjusted since, has been whittled away by inflation to only US$42.80 per\nmonth.\n\nAccording to the International Organization for Migration, the number of\nimmigrants residing in Nigeria has more than doubled in recent decades – from\n477,135 in 1991 to 971,450 in 2005. The majority of immigrants in Nigeria\n(74%) are from neighbouring Economic Community of West African States\n(ECOWAS), and that this number has increased considerably over the last\ndecade, from 63% in 2001 to 97% in 2005.\n\nThe government has to pay a high interest rate on bonds in part because of the\nhigh fertility rate; there are many children and less savings."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "7.1",
    "section_name": "Human capital",
    "text": "As of 2019, Nigeria's HDI (Human Development Index) is ranked 161st at 0.539.\nThe comparative value for Sub-Saharan Africa is 0.547, 0.926 for the US, and\n0.737 for the world average.\n\nThe value for the education index is 0.499, compared to the average in the US\nof 0.900. The expected years of schooling in Nigeria is 10.0 (16.3 in the US),\nwhile the mean years of schooling for adults over 25 years is 6.7 years (13.4\nyears in the US). Additionally, Nigeria is also facing a relatively high\ninequality, worsening the problem regarding the formation of human capital."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "7.2",
    "section_name": "Child labour",
    "text": "Child labour in Nigeria\n\nChild labour in Nigeria is the employment of children under the age of 18 in a\nmanner that restricts or prevents them from basic education and development.\nChild labour is pervasive in every state of the country. In 2006, the number\nof child workers was estimated at 15 million. Poverty is a major factor that\ndrives child labour in Nigeria. In poor families, child labour is a major\nsource of income for the family.Nigeria has over 62.9 million children aged\n5-17, making up 30.3% of the population, according to data from the NCFLS,\nwhich surveyed 16,418 households nationwide.\n\nAbout 6 million of Nigeria's children do not go to school at all. In the\ncurrent conditions, these children do not have the time, energy or resources\nto go to school. Domestic servants were the least visible form of child\nlabour, and often sexually harassed. Amongst informal economy and public\nplaces, street vending employed 64%. Midst informal enterprises in semipublic\nplaces, children were often observed as mechanics and bus conductors."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "7.3",
    "section_name": "Inflation",
    "text": "| This section **possibly containsoriginal research**. Please improve it by\nverifying the claims made and adding inline citations. Statements consisting\nonly of original research should be removed. _( April 2017)__(Learn how and\nwhen to remove this message)_\n---|---\nInflation and gdp growth in Nigeria, 2015 - 2021, Source: National Bureau of\nStatistics\n\nIn 2016, the black-market exchange rate of the Naira was about 60% above the\nofficial rate. The central bank releases about $200 million each week at the\nofficial exchange rate. However, some companies cite that budgets now include\na 30% \"premium\" to be paid to central bank officials to get dollars.\n\nNigeria's inflation rate rose to 15.63 per cent in December 2021 compared to\n15.40 per cent in November, the National Bureau of Statistics announced on\nJanuary 17, 2022. The statistics office said the prices of goods and services,\nmeasured by the Consumer Price Index, increased by 15.63 per cent in December\n2021 when compared to December 2020. According to the NBS, this rise in the\nfood index was caused by increases in prices of bread and cereals, food\nproducts, meat, fish, potatoes, yam and other tubers, soft drinks and fruits.\n\nIn 2024 President Bola Tinubu sought to increase the 2024 budget by $13.7\nbillion to $77.3 billion. The proposed additional funds were $7.1 billion for\ninfrastructure projects and $6.7 billion for recurrent expenditure."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Foreign economic relations",
    "text": "Nigeria's foreign economic relations revolve around its role in supplying the\nworld economy with oil and natural gas, even as the country seeks to diversify\nits exports, harmonize tariffs in line with a potential customs union sought\nby the Economic Community of West African States (ECOWAS), and encourage\ninflows of foreign portfolio and direct investment. In October 2005, Nigeria\nimplemented the ECOWAS common external tariff, which reduced the number of\ntariff bands.\n\nPrior to this revision, tariffs constituted Nigeria's second largest source of\nrevenue after oil exports. In 2005 Nigeria achieved a major breakthrough when\nit reached an agreement with the Paris Club to eliminate its bilateral debt\nthrough a combination of write-downs and buybacks. Nigeria joined the\nOrganization of the Petroleum Exporting Countries in July 1971 and the World\nTrade Organization in January 1995.\n\nIf the global transition to renewable energy is completed and international\ndemand for Nigeria's petroleum resources ceases, Nigeria will be significantly\nweakened. It is ranked 149 out of 156 countries in the index of Geopolitical\nGains and Losses after energy transition (GeGaLo)."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8.1",
    "section_name": "External trade",
    "text": "Nigeria's exports in 2006\n\nIn 2017, Nigeria imported about US$34.2 billion of goods. In 2017 the leading\nsources of imports were China (28%), the Belgium-Luxembourg (8.9%), the\nNetherlands (8.3%), South Korea (6.4%), the United States (6.0%) and the India\n(4.6%). Principal imports were manufactured goods, machinery and transport\nequipment, chemicals, and food and live animals.\n\nIn 2017, Nigeria exported about US$46.68 billion worth of goods. In 2017, the\nleading destinations for exports were India (18%), the United States (14%),\nSpain (9.7%), France (6.0%) and the Netherlands (4.9%). In 2017 oil accounted\nfor 83% of merchandise exports. Natural rubber and cocoa are the country's\nmajor agricultural exports.\n\nIn 2005, Nigeria posted a US$26 billion trade surplus, corresponding to almost\n20% of gross domestic product. In 2005, Nigeria achieved a positive current\naccount balance of US$9.6 billion. The Nigerian currency is the naira (NGN).\nAs of June 2006, the exchange rate was about US$1=NGN128.4. As of June 2019,\nit stands at US$1 =NGN357. In recent years, Nigeria has expanded its trade\nrelations with other developing countries such as India. Nigeria is the\nlargest African crude oil supplier to India – it annually exports 400,000\nbarrels per day (64,000 m3/d) to India valued at US$10 billion annually.\n\nIndia is the largest purchaser of Nigeria's oil which fulfills 20% to 25% of\nIndia's domestic oil demand. Indian oil companies are also involved in oil\ndrilling operations in Nigeria and have plans to set up refineries there.\n\nThe trade volume between Nigeria and the United Kingdom rose by 35% from\nUS$6.3 billion in 2010 to US$8.5 billion in 2011.\n\nIn Q1 2024, Nigeria's exports were dominated by petroleum products, including\ncrude oil and liquefied natural gas. Major export destinations included China,\nIndia, and the Netherlands.\n\nThis period saw a notable increase in energy exports, reinforcing Nigeria's\nrole as a key player in the global energy market. The Apapa Port in Lagos\nhandled the bulk of these exports, showcasing the port's significance in the\ncountry's trade infrastructure."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8.2",
    "section_name": "Foreign trade statistics",
    "text": "Year  | Goods Export\n(million US$) | Goods Imports\n(in million US$) | Net trade\n(in million US$)\n---|---|---|---\n2023  | $55,820  | $47,746  | $8,075\n2022  | $64,227  | $58,229  | $5,998\n2021  | $46,859  | $51,421  | $-4,561\n2020  | $35,944  | $52,346  | $-16,402\n2019  | $64,978  | $62,110  | $2,868\n2018  | $61,221  | $40,754  | $20,467\n2017  | $45,817  | $32,669  | $13,148\n2016  | $34,701  | $35,240  | $-536\n2015  | $45,888  | $52,335  | $-6,447\n2010  | $79,618  | $49,520  | $30,098\n2000  | $19,132  | $8,717  | $10,415\n1990  | $13,585  | $4,932  | $8,653\n1980  | $25,945  | 14,728  | $11,217"
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8.3",
    "section_name": "External debt",
    "text": "In 2012, Nigeria's external debt was an estimated $5.9 billion and N5.6\ntrillion domestic, putting total debt at $44 billion.\n\nIn April 2006, Nigeria became the first African country to fully pay off its\ndebt owed to the Paris Club. This was structured as a debt write off of\napproximately $18 billion and a cash payment of approximately $12 billion."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8.4",
    "section_name": "Foreign investment",
    "text": "In 2012, Nigeria received a net inflow of US$85.73 billion foreign direct\ninvestment (FDI), much of which came from Nigerians in the diaspora. Most FDI\nis directed toward the energy and banking sectors. Any public designed to\nencourage inflow of foreign capital is capable of generating employment\nopportunities within the domestic economy. The Nigerian Enterprises Promotion\n(NEP) Decree of 1972 (revised in 1977) was intended to reduce foreign\ninvestment in the Nigerian economy.\n\nThe stock market capitalisation of listed companies in Nigeria was valued at\n$97.75 billion on 15 February 2008 by the Nigerian Stock Exchange."
  },
  {
    "chapter_name": "Economy of Nigeria",
    "chapter_id": "1",
    "section_number": "8.5",
    "section_name": "Swiss Banks to return Abacha Stolen Funds",
    "text": "The Swiss foreign ministry says it has done all it can to ensure that funds\nstolen by the late Nigerian dictator Sani Abacha were used properly in his\nhomeland. The authorities were responding to allegations that $200 million\n(SFr240 million) of $700 million handed back by the Swiss Banks to Nigeria had\nbeen misappropriated."
  }
]