[
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Iceland** is small and subject to high volatility. In 2011,\nthe gross domestic product was US$12 billion, but by 2018 it had increased to\na nominal GDP of US$27 billion. With a population of 387,000, this is $55,000\nper capita, based on purchasing power parity (PPP) estimates. The 2008–2011\nIcelandic financial crisis produced a decline in GDP and employment, which has\nsince been reversed entirely by a recovery aided by a tourism boom starting in\n2010. Tourism accounted for more than 10% of Iceland's GDP in 2017. After a\nperiod of robust growth, Iceland's economy slowed down according to an\neconomic outlook for the years 2018–2020 published by Arion Research in April\nof 2018.\n\nIceland has a mixed economy with high levels of free trade and government\nintervention. However, government consumption is less than other Nordic\ncountries. Hydro-power is the primary source of home and industrial electrical\nsupply in Iceland.\n\nIn the 1990s Iceland undertook extensive free market reforms, which initially\nproduced strong economic growth. As a result, Iceland was rated as having one\nof the world's highest levels of economic freedom as well as civil freedoms.\nIn 2007, Iceland topped the list of nations ranked by Human Development Index\nand was one of the most egalitarian, according to the calculation provided by\nthe Gini coefficient.\n\nFrom 2006 onwards, the economy faced problems of growing inflation and current\naccount deficits. Partly in response, and partly as a result of earlier\nreforms, the financial system expanded rapidly before collapsing entirely in\nthe 2008–2011 Icelandic financial crisis. Iceland had to obtain emergency\nfunding from the International Monetary Fund and a range of European countries\nin November 2008. The economy has since rebounded since 2010, and continues to\ngrow to this day.\n\nIceland bonds had an Inverted yield curve in 2008\n\n10 year bonds\n\n5 year bonds\n\n2 year bonds",
    "openai_summarised_points": [
      "• The economy of Iceland is characterized as small and highly volatile, with significant fluctuations in economic indicators over time.",
      "• In 2011, Iceland's gross domestic product (GDP) was valued at US$12 billion, reflecting the country's modest economic size.",
      "• By 2018, Iceland's nominal GDP had increased to US$27 billion, indicating substantial economic growth over the seven-year period.",
      "• The population of Iceland is approximately 387,000 residents, resulting in a per capita GDP of about US$55,000 when calculated based on purchasing power parity (PPP) estimates.",
      "• The 2008–2011 Icelandic financial crisis led to a notable decline in GDP and employment levels; however, these economic indicators were fully recovered following a period of growth.",
      "• The recovery was significantly driven by a tourism boom that began in 2010, which became a key sector for economic revitalization.",
      "• In 2017, tourism contributed to more than 10% of Iceland's GDP, underscoring its importance to the national economy.",
      "• Following a phase of robust economic growth, Iceland's economy experienced a slowdown, as projected in an economic outlook published by Arion Research in April 2018 covering the years 2018–2020.",
      "• Iceland maintains a mixed economy characterized by high levels of free trade combined with government intervention in economic activities.",
      "• Government consumption in Iceland is relatively lower compared to other Nordic countries, indicating a smaller role of government spending in the economy.",
      "• Hydro-power is the primary source of electricity for both domestic use and industrial purposes in Iceland, highlighting the country's reliance on renewable energy sources.",
      "• During the 1990s, Iceland implemented extensive free market reforms that initially resulted in strong economic growth and increased economic freedom.",
      "• As a consequence of these reforms, Iceland was ranked among the countries with the highest levels of economic freedom globally and also enjoyed high civil liberties.",
      "• In 2007, Iceland ranked at the top of the Human Development Index (HDI), reflecting high standards of health, education, and income.",
      "• Iceland was recognized as one of the most egalitarian nations, with a low Gini coefficient indicating significant income equality.",
      "• Starting in 2006, Iceland's economy faced challenges such as rising inflation and current account deficits, signaling economic instability.",
      "• The financial system expanded rapidly in response to these issues and prior reforms but ultimately collapsed during the 2008–2011 Icelandic financial crisis.",
      "• In November 2008, Iceland required emergency financial assistance from the International Monetary Fund (IMF) and several European countries to stabilize its economy.",
      "• Since 2010, Iceland's economy has experienced a recovery and continued growth, demonstrating resilience post-crisis.",
      "• In 2008, Iceland's bonds exhibited an inverted yield curve across various maturities, including 10-year, 5-year, and 2-year bonds, indicating market expectations of economic downturn or interest rate declines."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:35:46.762797",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1930,
      "bullet_points_count": 20
    }
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "In medieval Iceland, trade was traditionally conducted through barter. The\ntraditional nationalistic historical narrative says that Iceland had\nexperienced a golden age from 874 until the 11th century, when the country\ncame under foreign rule and \"suffered humiliation\" as its economy declined.\nThere is very little evidence to support this narrative.\n\nIceland had among the lowest GDP per capita out of all the Western European\ncountries at the start of the 20th century. An assessment by economists at the\nCentral Bank of Iceland stated that the country's \"post-World War II economic\ngrowth has been both significantly higher and more volatile than in other OECD\ncountries\", and that \"the Icelandic business cycle has been largely\nindependent of the business cycle in other industrialised countries.\" Iceland\nhas had a total of twenty financial crashes since 1875, according to Reuters.\n\nFishing became a large part of the Icelandic economy after the 1880s, partly\ndue to expanded fishing with sailing smacks. During the Second World War, the\nUK imposed trade sanctions on Iceland to prevent them from trading with\nGermany. After the British and later American occupations of the island, the\neconomy was boosted by a substantial amount, and Iceland went from one of the\npoorest countries in Europe to one of the wealthiest. This was furthered by\nIceland being included as part of the post-WWII Marshall Plan, receiving the\nlargest amount per capita between 1948 and 1951, almost double the amount of\nthe next highest recipient.\n\nTowards the end of the 20th century, Iceland's economy continued to grow. A\ncoalition between the Independence and Progressive parties led to the\nprivatization of state-owned banks and telecommunications. Corporate income\ntax was reduced to 18%, inheritance tax was greatly reduced, and the net\nwealth tax was completely abolished. The term \"Nordic Tiger\" became heavily\nused refer to the period of economic prosperity in Iceland that began in the\n1990s.\n\nThe \"Nordic Tiger\" period came to a sudden end as a result of the 2008\nfinancial crisis. Iceland went from being the 10th richest country in the\nworld in 2007 to the 21st in 2010. Banks made risky loans and manipulated\nmarkets, with the country's regulators understaffed and not properly\nsupervising them. The Icelandic króna underwent sharp inflation, with the\nthree largest banks in the country being placed under government control.\nIceland's central bank raised its interest rate to 18% in an attempt to combat\nthe inflation.\n\nWith help from the International Monetary Fund (IMF), Iceland's economy\nstabilized and managed to pay off all of its loans by the end of 2015.\nEconomists Ásgeir Jónsson and Hersir Sigurjónsson said that \"Iceland was\ntreated differently from developing countries and former IMF clients. There\nwas no call for Iceland to adopt sharp austerity measures at the inception of\nthe joint economic plan. Instead, the government would be allowed to maintain\nlarge public deficits in the first year – 2009 – allowing fiscal multipliers\nto counteract the output contraction that was underway. Iceland also was not\nasked to downsize its Scandinavian-type welfare system.\"",
    "openai_summarised_points": [
      "• In medieval Iceland, trade was traditionally conducted through barter systems, reflecting early economic practices.",
      "• The traditional nationalistic historical narrative claims Iceland experienced a golden age from 874 until the 11th century, characterized by prosperity, followed by foreign rule and economic decline, which supposedly caused \"humiliation\"; however, there is very little evidence supporting this narrative.",
      "• At the start of the 20th century, Iceland had among the lowest GDP per capita compared to all Western European countries, indicating a relatively underdeveloped economy at that time.",
      "• An assessment by economists at the Central Bank of Iceland noted that post-World War II economic growth was significantly higher and more volatile than in other OECD countries, with Iceland's business cycle largely independent of those in other industrialized nations.",
      "• Since 1875, Iceland has experienced a total of twenty financial crashes, as reported by Reuters, highlighting ongoing financial instability.",
      "• The Icelandic economy saw a significant shift after the 1880s with the expansion of fishing activities, particularly through the use of sailing smacks, which became a major economic sector.",
      "• During World War II, the UK imposed trade sanctions on Iceland to prevent trade with Germany, which impacted Iceland’s economy.",
      "• Following the British occupation and later American occupation during WWII, Iceland's economy was substantially boosted, transforming it from one of Europe's poorest countries to one of the wealthiest.",
      "• Iceland was included in the post-WWII Marshall Plan, receiving the largest amount per capita between 1948 and 1951, nearly double the amount received by the next highest recipient, which significantly aided economic recovery.",
      "• In the late 20th century, Iceland's economy continued to grow, driven by political coalitions such as between the Independence and Progressive parties, which led to privatization of state-owned banks and telecommunications.",
      "• During this period, corporate income tax was reduced to 18%, inheritance tax was significantly lowered, and the net wealth tax was abolished entirely, fostering a more liberal economic environment.",
      "• The economic prosperity experienced in Iceland during the 1990s was popularly termed the \"Nordic Tiger,\" reflecting rapid growth and development.",
      "• The \"Nordic Tiger\" period abruptly ended with the 2008 financial crisis, which caused Iceland to fall from the 10th to the 21st position in the global wealth ranking by 2010.",
      "• The crisis involved risky loans and market manipulation by banks, with inadequate regulatory oversight, leading to sharp inflation of the Icelandic króna and the government placing the three largest banks under state control.",
      "• In response to the crisis, Iceland’s central bank raised interest rates to 18% to combat inflation.",
      "• With assistance from the International Monetary Fund (IMF), Iceland stabilized its economy and repaid all loans by the end of 2015.",
      "• Economists Ásgeir Jónsson and Hersir Sigurjónsson noted that Iceland was treated differently from developing countries and other IMF clients, as it was not required to implement sharp austerity measures initially.",
      "• Instead, Iceland was allowed to maintain large public deficits in 2009, enabling fiscal multipliers to counteract economic contraction, and was not asked to downsize its Scandinavian-style welfare system."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:35:54.972723",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 3176,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Geography and resources",
    "text": "Iceland occupies a land area of 103,000 square kilometers. It has a 4,790\nkilometer coastline and a 200 nautical mile (370.4 km) exclusive economic zone\nextending over 758,000 square kilometers of water. Approximately only 0.7% of\nIceland's surface area is arable, since the island's terrain is mostly\nmountainous and volcanic.\n\nIceland has few proven mineral resources. In the past, deposits of sulphur\nhave been mined, and diatomite (skeletal algae) was extracted from Lake Mývatn\nuntil recently. However, today most sulphur is obtained in the refining of\noil. The diatomite plant has closed for environmental reasons. The only\nnatural resource conversion in Iceland is the manufacture of cement. Concrete\nis widely used as building material, including for all types of residential\nhousing.\n\nBy harnessing the abundant hydroelectric and geothermal power sources,\nIceland's renewable energy industry provides close to 85% of all the nation's\nprimary energy – proportionally more than any other country – with 99.9% of\nIceland's electricity being generated from renewables.\n\nBy far the largest of the many Icelandic hydroelectric power stations is\nKárahnjúkar Hydropower Plant (690 MW) in the area north of Vatnajökull. Other\nstations include Búrfell (270 MW), Hrauneyjarfoss (210 MW), Sigalda (150 MW),\nBlanda (150 MW), and more. Iceland has explored the feasibility of exporting\nhydroelectric energy via submarine cable to mainland Europe and also actively\nseeks to expand its power-intensive industries, including aluminium and ferro-\nsilicon smelting plants.",
    "openai_summarised_points": [
      "• Iceland covers a land area of 103,000 square kilometers, making it a relatively large island nation in the North Atlantic.",
      "• The country has a 4,790-kilometer-long coastline, providing extensive maritime access and influence.",
      "• Iceland's exclusive economic zone (EEZ) extends 200 nautical miles (370.4 km) from its coast, covering an area of approximately 758,000 square kilometers of water.",
      "• Only about 0.7% of Iceland's surface area is arable land, primarily due to the country's predominantly mountainous and volcanic terrain.",
      "• The nation possesses few proven mineral resources; historically, deposits of sulphur have been mined, and diatomite (skeletal algae) was extracted from Lake Mývatn until recent times.",
      "• Currently, most sulphur is obtained through the refining of oil, rather than direct mining.",
      "• The diatomite extraction plant in Iceland has been closed for environmental reasons, indicating environmental considerations influence resource utilization.",
      "• The only significant natural resource processing in Iceland is the manufacture of cement, with concrete being a widely used building material, including for all types of residential housing.",
      "• Iceland harnesses abundant hydroelectric and geothermal energy sources, making its renewable energy industry account for approximately 85% of the country's total primary energy supply, which is higher proportionally than any other country.",
      "• An impressive 99.9% of Iceland's electricity is generated from renewable sources, predominantly hydroelectric and geothermal power.",
      "• The largest hydroelectric power station in Iceland is the Kárahnjúkar Hydropower Plant, with a capacity of 690 MW, located north of Vatnajökull.",
      "• Other notable hydroelectric stations include Búrfell (270 MW), Hrauneyjarfoss (210 MW), Sigalda (150 MW), and Blanda (150 MW).",
      "• Iceland has explored the feasibility of exporting hydroelectric energy via submarine cables to mainland Europe, aiming to leverage its renewable resources for international energy trade.",
      "• The country actively seeks to expand its energy-intensive industries, including aluminium and ferro-silicon smelting plants, to capitalize on its abundant renewable energy resources."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-07-31T22:36:12.876898",
      "openai_model": "gpt-4.1-nano-2025-04-14",
      "content_length": 1562,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Sectors",
    "text": "In 2017 the proportion of Iceland's exports was: tourism 42%, seafood 17%,\naluminium 16%, other 24%."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Tourism",
    "text": "Tourism is Iceland's largest export sector by far. Tourism accounted for more\nthan 33% of the country's GDP in 2019. Iceland is one of the most tourism-\ndependent countries on Earth. In October 2017 the tourism sector directly\nemployed around 26,800 people, with the total number of employees in the\ncountry being 186,900.\n\nAt the start of the growth period around 2010, tourism benefited from a weak\nISK, but a strong ISK then cooled down the sector. From 2010 to 2018, tourist\narrivals in Iceland increased by 378%."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Manufacturing",
    "text": "Iceland is the world's largest electricity producer per capita. The presence\nof abundant electrical power due to Iceland's geothermal and hydroelectric\nenergy sources has led to the growth of the manufacturing sector. Power-\nintensive industries, which are the largest components of the manufacturing\nsector, produce mainly for export. Manufactured products constituted 36% of\nall merchandise exports, an increase from the 1997 figure of 22%. Power-\nintensive products' share of merchandise exports is 21%, compared to 12% in\n1997."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.2.1",
    "section_name": "Aluminium",
    "text": "Aluminium smelting is the most important power-intensive industry in Iceland.\nThere are currently three plants in operation with a total capacity of over\n850,000 metric tons per year (t/yr) in 2019, putting Iceland at 12th place\namong aluminium-producing nations worldwide as of 2023.\n\nRio Tinto Alcan operates Iceland's first aluminium smelter (plant name: ISAL),\nin Straumsvík, near the town of Hafnarfjörður. The plant has been in operation\nsince 1969. Its initial capacity was 33,000 metric tons (t) per year, but it\nhas since been expanded several times and now has a capacity of about 189,000\nt/yr.\n\nThe second plant started production in 1998 and is operated by Norðurál, a\nwholly owned subsidiary of U.S.-based Century Aluminum Company. It is located\nin Grundartangi in Western Iceland near the town of Akranes. Its former\ncapacity was 220,000 t/yr but an expansion to 260,000 t/yr has already\nfinished. In 2012, the plant produced 280,000 metric tons which was valued at\n610 million dollars or 76 billion krónur. 4,300 gigawatts hours were used in\nthe production that year, amounting to nearly one-fourth of all electrical\nenergy produced in the country. In October 2013, Norðurál announced the start\nof a five-year project aimed at increasing its production by a further 50,000\nt/yr.\n\nUnited States–based aluminium manufacturer Alcoa runs a plant near the town of\nReyðarfjörður. The plant, known as _Fjardaál_ (or \"aluminium of the fjords\"),\nhas a capacity of 346,000 t/yr and was put into operation in April 2008. To\npower the plant, Landsvirkjun built Kárahnjúkar, a 690-MW hydropower station.\nThe project was enormous in the context of the Icelandic economy, increasing\ntotal installed electric power capacity from under 1,600 MW to around 2,300\nMW.\n\nAlcoa's aluminium plant in Reyðarfjörður, Iceland\n\nAccording to Alcoa, construction of Fjardaál entailed no human displacement,\nno impact on endangered species, and no danger to commercial fisheries; there\nwill also be no significant effect on reindeer, bird and seal populations.\nHowever, the project drew considerable opposition from environmentalist groups\nsuch as the World Wide Fund for Nature, which called on Alcoa to abandon the\nplan to build Fjardaál. In addition, Icelandic singer Björk was a notable\nearly opponent to the plan; protesting the proposed construction, the singer's\nmother, Hildur Rúna Hauksdóttir, went on a hunger strike in 2002.\n\nSeveral other aluminium smelter projects have been planned. Between 2005 and\n2011, Alcoa conducted a feasibility study for a second plant in Iceland near\nHúsavík. That plant was to have a 250,000 t/yr capacity, to be powered\nentirely by geothermal power, although later estimates showed a potential need\nfor other sources of power. In October 2011, Alcoa announced its decision to\ncancel the Bakki project. In 2006, Nordurál signed a memorandum of\nunderstanding with two Icelandic geothermal power producers, Hitaveita\nSuðurnesja and Orkuveita Reykjavíkur, to purchase electricity for its own\naluminium reduction project in Helguvík. The power supplied will initially\nsupport aluminium production of 150,000 t/yr, which will eventually grow to\nsupport 250,000 t/yr."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Fisheries",
    "text": "Fisheries and related sectors—in recent years labelled \"the ocean cluster\"—was\nthe single most important part of the Icelandic economy (it has now been\nreplaced by tourism) representing an overall contribution to GDP of 27.1% in\n2011. The fisheries sector directly employs around 9,000 people (4,900 in\nfishing and 4,100 in fish processing; approximately 5 per cent of Iceland's\nworkforce), although it is estimated that a total of between 25,000 and 35,000\npeople (up to 20 per cent of the workforce) depend on the ocean cluster for\ntheir livelihood. Many of these jobs are provided by technological companies\nthat manufacture equipment for fisheries firms and by companies engaged in the\nadvanced processing of marine products or in biotechnical production. By\ncontrast, aquaculture remains a very small industry in Iceland, employing only\naround 250 people for a production of 5,000 tonnes.\n\nIceland is the second biggest fisheries nation in the North East Atlantic\nbehind Norway, having overtaken the United Kingdom in the early 1990s. Since\n2006, Icelandic fishing waters have yielded a total catch of between 1.1m and\n1.4m tonnes of fish annually, although this is down from a peak of over 2m\ntonnes in 2003.\n\nCod remains the most important species harvested by Icelandic fisheries, with\na total catch of 178,516 tonnes in 2010. The catch of cod has stagnated in\nrecent years due to quotas, and was supplemented by the catch of blue whiting,\nwhich is used mainly for processing. The Icelandic catch of this previously\ninsignificant fish increased from a negligible 369 tonnes in 1995 to a peak of\n501,505 tonnes in 2003. Subsequently, the stock showed signs of instability\nand quotas were reduced, leading to a decline in the catch to 87,121 tonnes in\n2010. There have been increased numbers of Atlantic mackerel (the \"Miracle of\nthe Mackerel\") in the 21st century as the Atlantic Ocean has slightly warmed."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Banks",
    "text": "The Icelandic banking system has been completely overhauled after the 2008\nfinancial crisis. There are now three major commercial banks: Landsbankinn\n(National Bank since 2008), Arion Bank (formerly Kaupthing Bank) and\nIslandsbanki (formerly Glitnir), and Kvika banki (formerly MP Straumur). There\nare smaller banks and some savings banks, however they are not publicly\ntraded.\n\nThere has been extensive consolidation of smaller banks, with Sparisjodur\nKeflavikur being taken over by Landsbanki and Byr being taken over by\nIslandsbanki. Arion Bank, Islandsbanki, and Kvika Banki are the only banks\nlisted on Iceland Stock Exchange. Arion Bank is mostly owned by foreign\ncreditors while Landsbanki and Islandsbanki are now wholly owned by the State.\nThe ownership stake of the Icelandic State in the banks is managed by\nBankasysla rikisins (State Financial Investments), which aims to privatise its\nshares in the banks in coming years.[_when?_]"
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.3.2",
    "section_name": "Stock market",
    "text": "Because of historically persistent inflation, historical reliance on fish\nproduction and the long-standing public ownership of the commercial banks,\nequity markets were slow to develop. Nasdaq Iceland, formerly the Iceland\nStock Exchange (XICE) was created in 1985. Trading in Icelandic T-Bonds began\nin 1986 and trading in equities commenced in 1990. All domestic trading in\nIcelandic stocks, bonds and mutual funds takes place on Nasdaq Iceland.\n\nNasdaq Iceland has used electronic trading systems since its creation. Since\n2000, SAXESS, the joint trading system of the NOREX alliance, has been used.\nThere are currently two equities markets on Nasdaq Iceland. The Main Market is\nthe larger and better known of the two. The Alternative Market is a less\nregulated over-the-counter market. Because of the small size of the market,\ntrading is illiquid in comparison with larger markets. A variety of firms\nacross all sectors of the Icelandic economy are listed on Nasdaq Iceland.\n\nThe most important stock market index was the OMX Iceland 15; however, this\nindex was discontinued after the 2008 financial crisis following a decade in\nwhich it had been the worst-performing stock market index in the entire world,\nbeing \"more or less wiped out.\""
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "3.3.3",
    "section_name": "Other financial markets",
    "text": "Historically, investors tended to be reluctant to hold Icelandic bonds because\nof the persistence of high inflation and the volatility of the króna. What did\nexist was largely limited to bonds offered by the central government. The bond\nmarket on the ICEX has boomed since the 2010s, however, largely because of the\nresale of mortgages as housing bonds.[_citation needed_]\n\nA mutual fund market exists on the ICEX in theory, but no funds are currently\nlisted. A small derivatives market formerly existed, but was closed in 1999\nbecause of illiquidity.[_citation needed_]\n\nBy the end of 2018, Bitcoin mining was expected to consume more electricity in\nIceland than all the country's residents combined."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "| This section needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( September 2024)_\n---|---\nGDP per capita development in Norway, Iceland, Denmark, Sweden and Finland\nLabor union membership by country Hours Worked Compared to Earnings Per Week\n\nThe following table shows the main economic indicators in 1980–2017. Inflation\nunder 2% is in green.\n\nYear  | GDP\n(Bil. US$ PPP) | GDP per capita\n(in US$ PPP) | GDP\n(Bil. US$\nnominal) | GDP growth\n(real) | Inflation rate  | Unemployment  | Government debt\n(% of GDP)\n---|---|---|---|---|---|---|---\n1980  | 2.5  | 10,686  | 3.4  | 5.7 %  | 58.5 %  | 0.3 %  | n/a\n1981  | 2.8  | 12,032  | 3.5  | 4.3 %  | 50.9 %  | 0.4 %  | n/a\n1982  | 3.0  | 12,868  | 3.3  | 2.2 %  | 51.0 %  | 0.7 %  | 29.1 %\n1983  | 3.1  | 12,931  | 2.8  | −2.2 %  | 84.3 %  | 1.0 %  | 30.9 %\n1984  | 3.3  | 13,815  | 2.9  | 4.1 %  | 29.2 %  | 1.3 %  | 32.6 %\n1985  | 3.5  | 14,630  | 3.0  | 3.3 %  | 32.3 %  | 0.9 %  | 32.1 %\n1986  | 3.8  | 15,733  | 4.0  | 6.3 %  | 21.3 %  | 0.7 %  | 30.0 %\n1987  | 4.3  | 17,273  | 5.6  | 8.5 %  | 18.8 %  | 0.4 %  | 27.4 %\n1988  | 4.4  | 17,553  | 6.1  | −0.1 %  | 25.5 %  | 0.6 %  | 30.7 %\n1989  | 4.6  | 18,148  | 5.7  | 0.3 %  | 14.5 %  | 1.7 %  | 35.4 %\n1990  | 4.8  | 18,884  | 6.5  | 1.2 %  | 15.5 %  | 2.6 %  | 35.6 %\n1991  | 5.0  | 19,180  | 6.9  | −0.2 %  | 6.8 %  | 2.5 %  | 37.7 %\n1992  | 4.9  | 18,763  | 7.1  | −3.4 %  | 4.0 %  | 4.2 %  | 45.5 %\n1993  | 5.1  | 19,265  | 6.2  | 1.3 %  | 4.1 %  | 5.3 %  | 52.4 %\n1994  | 5.4  | 20,239  | 6.4  | 3.6 %  | 1.6 %  | 5.3 %  | 54.9 %\n1995  | 5.5  | 20,610  | 7.1  | 0.1 %  | 1.7 %  | 4.8 %  | 58.2 %\n1996  | 5.9  | 21,834  | 7.4  | 4.8 %  | 2.3 %  | 3.7 %  | 55.4 %\n1997  | 6.3  | 23,084  | 7.6  | 4.9 %  | 1.8 %  | 3.7 %  | 52.2 %\n1998  | 6.8  | 24,678  | 8.5  | 7.1 %  | 1.7 %  | 2.9 %  | 43.9 %\n1999  | 7.2  | 25,721  | 9.0  | 3.9 %  | 3.2 %  | 2.0 %  | 39.2 %\n2000  | 7.7  | 27,098  | 9.0  | 4.6 %  | 5.1 %  | 2.2 %  | 37.5 %\n2001  | 8.2  | 28,481  | 8.2  | 3.9 %  | 6.4 %  | 2.3 %  | 42.8 %\n2002  | 8.3  | 28,886  | 9.3  | 0.6 %  | 5.2 %  | 3.1 %  | 39.4 %\n2003  | 8.7  | 29,939  | 11.4  | 2.4 %  | 2.1 %  | 3.4 %  | 38.4 %\n2004  | 9.7  | 32,905  | 13.8  | 8.1 %  | 3.2 %  | 3.1 %  | 33.0 %\n2005  | 10.6  | 35,374  | 16.9  | 6.4 %  | 4.0 %  | 2.6 %  | 24.7 %\n2006  | 11.5  | 37,322  | 17.5  | 5.0 %  | 6.7 %  | 2.9 %  | 29.3 %\n2007  | 12.9  | 40,892  | 21.7  | 9.4 %  | 5.1 %  | 2.3 %  | 27.3 %\n2008  | 13.4  | 41,867  | 18.1  | 1.7 %  | 12.7 %  | 3.0 %  | 67.1 %\n2009  | 12.6  | 39,657  | 13.2  | −6.5 %  | 12.0 %  | 7.2 %  | 82.3 %\n2010  | 12.3  | 38,594  | 13.8  | −3.6 %  | 5.4 %  | 7.6 %  | 87.8 %\n2011  | 12.8  | 40,022  | 15.2  | 2.0 %  | 4.0 %  | 7.1 %  | 94.7 %\n2012  | 13.2  | 41,005  | 14.8  | 3.9 %  | 5.2 %  | 6.0 %  | 92.1 %\n2013  | 13.9  | 42,953  | 16.1  | 4.3 %  | 3.9 %  | 5.4 %  | 84.3 %\n2014  | 15.6  | 46,239  | 17.9  | 2.2 %  | 2.0 %  | 5.0 %  | 81.8 %\n2015  | 16.3  | 49,470  | 17.5  | 4.4%  | 1.6 %  | 4.0 %  | 67.6 %\n2016  | 17.9  | 53,986  | 20.8  | 7.5 %  | 1.7 %  | 3.0 %  | 52.4 %\n2017  | 19.2  | 56,904  | 24.7  | 4.1 %  | 1.8 %  | 2.8 %  | 40.9 %"
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "External trade",
    "text": "Iceland's economy is highly export-driven. Marine products account for the\nmajority of goods exports. Other important exports include aluminium, ferro-\nsilicon alloys, machinery and electronic equipment for the fishing industry,\nsoftware, woollen goods. Most of Iceland's exports go to the European Union\n(EU) and European Free Trade Association (EFTA) countries, the United States,\nand Japan. The 2020 value of Iceland's exports was $7.43 billion FOB.\n\nThe main imports are machinery and equipment, petroleum products, foodstuffs\nand textiles. Cement is Iceland's most imported product. The total 2020 value\nof imports was $7.55 billion. In 2019, Iceland's primary import partner was\nNorway (11%), followed by the Netherlands (10%), Germany (8%), Denmark (8%),\nUnited States (7%), United Kingdom (6%), PRC China (6%), and Sweden (5%). Most\nagricultural products are subject to high tariffs; the import of some\nproducts, such as uncooked meat, is greatly restricted for phyto-sanitary\nreasons.\n\nIceland's relatively liberal trading policy has been strengthened by accession\nto the European Economic Area in 1993 and by the Uruguay Round, which also\nbrought significantly improved market access for Iceland's exports,\nparticularly seafood products. However, the agricultural sector remains\nheavily subsidized and protected; some tariffs range as high as 700%.\n\nThe fishing industry is one of the most important industries. It provides 40%\nof export income and employs 7.0% of the workforce; therefore, the state of\nthe economy remains sensitive to world prices for fish products.\n\nWhen corrected for the dramatic depreciation of the Icelandic króna in 2008\n(approximately 50% against the euro and US dollar), imports since the 2007\npeak have been negative.[_citation needed_]\n\n| This article needs to be **updated**. Please help update this article to\nreflect recent events or newly available information. _( February 2025)_\n---|---"
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Imports",
    "text": "|  | Year  | Millions (ISK)  | Change\n---|---|---\n1988  | 68,723.2  |  0.00%\n1989  | 80,599.4  |  17.28%\n1990  | 96,620.7  |  19.88%\n1991  | 104,129.1  |  7.77%\n1992  | 96,895.3  |  6.95%\n1993  | 91,306.6  |  5.77%\n1994  | 102,541.3  |  12.30%\n1995  | 113,613.6  |  10.80%\n1996  | 135,994.5  |  19.70%\n1997  | 143,226.6  |  5.32%\n1998  | 176,072.1  |  22.93%\n1999  | 182,321.5  |  3.55%\n2000  | 203,222.1  |  11.46%\n\nSource: Statistics Iceland (statice.is)\n\n| Year  | Millions (ISK)  | Change\n---|---|---\n2001  | 220,874.0  |  8.69%\n2002  | 207,607.5  |  6.01%\n2003  | 216,525.1  |  4.30%\n2004  | 260,430.8  |  20.28%\n2005  | 313,854.6  |  20.51%\n2006  | 437,086.3  |  39.26%\n2007  | 429,468.9  |  1.74%\n2008  | 514,739.3  |  19.86%\n2009  | 446,128.2  |  13.33%\n2010  | 477,222.3  |  6.97%\n2011  | 561,626.1  |  17.69%\n2012  | 597,262.2  |  6.35%"
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "5.2",
    "section_name": "Exports",
    "text": "|  | Year  | Millions (ISK)  | Change\n---|---|---\n1988  | 61,600.0  |  0.00%\n1989  | 80,071.7  |  29.85%\n1990  | 92,625.1  |  15.68%\n1991  | 91,560.4  |  1.15%\n1992  | 87,832.8  |  4.07%\n1993  | 94,657.6  |  7.77%\n1994  | 112,653.8  |  19.01%\n1995  | 116,606.7  |  3.51%\n1996  | 126,303.8  |  8.32%\n1997  | 131,213.2  |  3.89%\n1998  | 136,592.0  |  4.10%\n1999  | 144,928.1  |  6.10%\n2000  | 149,272.8  |  3.00%\n| Year  | Millions (ISK)  | Change\n---|---|---\n2001  | 196,582.2  |  31.69%\n2002  | 204,303.0  |  3.93%\n2003  | 182,580.0  |  10.63%\n2004  | 202,373.0  |  10.84%\n2005  | 194,355.3  |  3.96%\n2006  | 242,740.0  |  24.90%\n2007  | 305,095.8  |  25.69%\n2008  | 466,859.5  |  53.02%\n2009  | 500,854.5  |  7.28%\n2010  | 561,032.2  |  12.02%\n2011  | 620,127.4  |  10.53%\n2012  | 633,029.1  |  2.08%"
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Economic agreements and policies",
    "text": "Iceland became a full European Free Trade Association member in 1970 and\nentered into a free trade agreement with the European Community in 1973. Under\nthe agreement on a European Economic Area, effective January 1, 1994, there is\nbasically free cross-border movement of capital, labor, goods, and services\nbetween Iceland, Norway, and the EU countries. However, many of Iceland's\npolitical parties remain opposed to EU membership, primarily because of\nIcelanders' concern about losing control over their fishing resources. Iceland\nalso has bilateral free trade agreements with several countries outside the\nEEA. The most extensive of these is the Hoyvík Agreement between Iceland and\nthe Faroe Islands, this agreement goes even further than the EEA agreement by\nestablishing free trade in agricultural products between the nations. Iceland\nhas a free trade agreement with Mexico on November 27, 2000."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Currency and monetary policy",
    "text": "The currency of Iceland is the _króna_ (plural: _krónur_), issued exclusively\nby the Central Bank of Iceland since the bank's founding in 1961. Iceland is\nthe least populous country to have its own currency and monetary policy.\n\nExchange rate for the krona to the euro from 2000 to mid-2010\n\nDuring the 1970s the oil shocks (1973 and 1979 energy crisis) hit Iceland\nhard. Inflation rose to 43% in 1974 and 59% in 1980, falling to 15% in 1987\nbut rising to 30% in 1988. Iceland experienced moderately strong GDP growth\n(3% on average) from 1995 to 2004. Growth slowed between 2000 and 2002, but\nthe economy expanded by 4.3% in 2003 and grew by 6.2% in 2004. Growth in 2005\nexceeded 6%. Inflation averaged merely 1.5% from 1993 to 1994, and only 1.7%\nfrom 1994 to 1995. Inflation over 2006 topped at 8.6%, with a rate of 6.9% as\nof January 2007. Standard & Poor's reduced their rating for Iceland to AA−\nfrom A+ (long term) in December 2006, following a loosening of fiscal policy\nby the Icelandic government ahead of the 2007 elections. Foreign debt rose to\nmore than five times the value of Iceland's GDP, and Iceland's Central Bank\nraised short-term interest rates to nearly 15% in 2007. Due to the plunging\ncurrency against the euro and dollar, in 2008 inflation was speculated to be\nat 20-25%.\n\nInflation increased during the 2008–2011 Icelandic financial crisis, and the\nCentral Bank of Iceland pegged the krona's value to the euro at increasingly\nhigher and higher rates in an attempt to keep the currency stable, eventually\npegging it at 340 kronur per euro before all trade in the currency was\nsuspended. The krona similarly fell in value against the US dollar, going from\naround 50–80 per dollar to about 110–115 per dollar. By November 2008, it had\ncontinued to lower to 135 to the dollar. By early April 2009, the value\nhovered around 119 per dollar, roughly maintaining that value over the next\ntwo years. The currency has stabalized since the crisis, with 1 US$ being\nworth 137.22 Icelandic kronur in September 2024.\n\nDespite being heavily integrated into European Union via the European Economic\nArea (EEA) and the Schengen Agreement, Iceland does not use the euro. Then-\nDeputy Governor of the Central Bank of Iceland, Arnór Sighvatsson, said that\nIceland would not adopt the euro \"as it entails extra cost of purchase of new\nbase money for the banking system and larger precautionary foreign exchange\nreserves."
  },
  {
    "chapter_name": "Economy of Iceland",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Growth",
    "text": "Iceland's economy had been diversifying into manufacturing and service\nindustries in the 1990s, and new developments in software production,\nbiotechnology, and financial services were taking place. The tourism sector\nwas also expanding, with the recent trends in ecotourism and whale watching.\nHowever, in 2008, the Icelandic economy entered a deep recession during the\nGreat Recession. Although Iceland's economy grew 3.3% during the last quarter\nof 2009, the overall contraction in GDP over 2009 was 6.5%, less than the 10%\noriginally forecasted by the IMF."
  }
]