[
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| The article's lead section **may need to be rewritten**. Please review the\nlead layout guide and help improve the lead of this article if you can. _(\nNovember 2023)__(Learn how and when to remove this message)_  \n---|---  \n  \nThe **economy of Turkmenistan** continues to recover from the 2014 downturn in\nhydrocarbon prices, but remains \"in the grip of its worst economic crisis\nsince the immediate post-independence period, driven in part by low gas\nprices, the suspension of gas exports to Russia between 2016 and 2019...and\npoor harvests.\" Former President Gurbanguly Berdimuhamedow at a session of the\nCabinet of Ministers on 11 March 2021, called the rate of GDP growth\nunsatisfactory. When discussing the 2021 government budget, he noted that 2021\nwould be \"as difficult\" a year as 2020 had been. According to the 2020\nInvestment Climate Statement of the US Department of State, Turkmenistan's\neconomy depends heavily on the production and export of natural gas, oil,\npetrochemicals and, to a lesser degree, cotton, wheat, and textiles. The\neconomy is still recovering from a deep recession that followed the late 2014\ncollapse in global energy prices. The current investment climate is considered\nhigh risk for US foreign direct investment.\n\nTurkmenistan is largely a desert country with intensive agriculture in\nirrigated areas, and huge gas and oil resources. In terms of natural gas\nreserves, as of 2020 it is ranked 4th in the world. Turkmenistan's two largest\nagricultural crops are cotton, most of which is produced for export, and\nwheat, most of which is domestically consumed. Turkmenistan is among the top\nten producers of cotton in the world.",
    "openai_summarised_points": [
      "• The economy of Turkmenistan is in a recovery phase following the 2014 downturn in hydrocarbon prices but remains severely affected by its worst economic crisis since the immediate post-independence period, influenced by factors including low gas prices, the suspension of gas exports to Russia from 2016 to 2019, and poor agricultural harvests.",
      "• On 11 March 2021, former President Gurbanguly Berdimuhamedow expressed dissatisfaction with the rate of GDP growth during a Cabinet of Ministers session, indicating that the year 2021 would be \"as difficult\" as 2020, particularly in the context of the government budget discussions.",
      "• According to the 2020 Investment Climate Statement by the US Department of State, Turkmenistan’s economy is heavily reliant on the production and export of natural gas, oil, petrochemicals, and, to a lesser extent, cotton, wheat, and textiles.",
      "• The economy is still recovering from a severe recession triggered by the collapse of global energy prices in late 2014, which significantly impacted Turkmenistan’s energy-dependent economy.",
      "• The current investment climate in Turkmenistan is considered high risk for US foreign direct investment, reflecting concerns about economic stability and regulatory environment.",
      "• Geographically, Turkmenistan is predominantly a desert country with intensive agricultural activities concentrated in irrigated areas, supporting the cultivation of major crops such as cotton and wheat.",
      "• As of 2020, Turkmenistan ranks 4th globally in terms of natural gas reserves, underscoring its significant position in the global energy sector.",
      "• The two largest agricultural crops in Turkmenistan are cotton, primarily produced for export purposes, and wheat, which is mainly consumed domestically.",
      "• Turkmenistan is recognized as one of the top ten cotton producers worldwide, highlighting the importance of cotton in its agricultural economy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:25.499279",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1661,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "From 1998 to 2005, Turkmenistan suffered from a lack of adequate export routes\nfor natural gas and from obligations on extensive short-term external debt. At\nthe same time, however, total exports rose by an average of roughly 15% per\nyear from 2003 to 2008, largely because of higher international oil and gas\nprices.[_citation needed_] As in the Soviet era, central planning and state\ncontrol is prominent in the system, and the Niyazov government (in power\n1991–2006) consistently rejected market reform programs. The state subsidized\na wide variety of commodities and services from the early 1990s to 2019.\nFollowing his election in 2007, President Gurbanguly Berdimuhamedow unified\nthe country's dual currency exchange rate, ordered the redenomination of the\nmanat, reduced state subsidies for gasoline, and initiated development of a\nspecial tourism zone (Awaza) on the Caspian Sea.\n\nSince 2009, Turkmenistan has maintained a fixed exchange rate. In that year,\nthe rate was set at US$1 to 2.85 manats. On 1 January 2015, the official\nexchange rate was changed to US$1 to 3.50 manats. However, the black-market\nexchange rate as of February 2021 was fluctuating around 29 to 30 manats to\nthe dollar. As of mid-April, the black-market manat-dollar exchange rate had\nslid to 40 manat to the dollar.",
    "openai_summarised_points": [
      "• From 1998 to 2005, Turkmenistan experienced significant challenges due to a lack of adequate export routes for its natural gas and faced obligations related to extensive short-term external debt.",
      "• Despite these difficulties, total exports in Turkmenistan increased by an average of approximately 15% per year between 2003 and 2008, primarily driven by higher international prices for oil and gas.",
      "• The economic system during this period retained characteristics of the Soviet era, with central planning and strong state control remaining prominent features.",
      "• The government led by President Saparmurat Niyazov, who was in power from 1991 to 2006, consistently rejected programs aimed at implementing market reforms.",
      "• From the early 1990s until 2019, the Turkmen state subsidized a wide range of commodities and services, maintaining extensive government support for the population.",
      "• After his election in 2007, President Gurbanguly Berdimuhamedow implemented several economic reforms, including unifying the country’s previously dual currency exchange rate system.",
      "• Under Berdimuhamedow’s administration, the manat was redenominated, state subsidies for gasoline were reduced, and development was initiated for a special tourism zone named Awaza, located on the Caspian Sea.",
      "• Since 2009, Turkmenistan has maintained a fixed official exchange rate for its currency, the manat; in 2009, this rate was established at US$1 to 2.85 manats.",
      "• On 1 January 2015, the official exchange rate was adjusted to US$1 equaling 3.50 manats.",
      "• Despite the official fixed exchange rates, the black-market exchange rate diverged significantly, with rates fluctuating around 29 to 30 manats per US dollar as of February 2021.",
      "• By mid-April 2021, the black-market exchange rate had further depreciated, sliding to approximately 40 manats per US dollar."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:26.524033",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1299,
      "bullet_points_count": 11
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Fiscal policy",
    "text": "The government budget is developed and implemented in accord with the Law “On\nBudget System”. The law fixes the legal foundations of organizing management\nand operating the budget system, and regulates interrelations between budgets\nat all levels. The government of Turkmenistan discusses the state budget draft\nand submits it to the President of Turkmenistan. One month prior to the\nbeginning of the fiscal year the President of Turkmenistan submits to the\nAssembly of Turkmenistan (Mejlis) the state budget draft for consideration and\nadoption. The Ministry of Economy and Finance is responsible for state\nfinances.\n\nBudget statistics are unreliable because the government spends large amounts\nof extra-budgetary funds. The 2021 budget of the Turkmenistan government\ntotaled 79.5 billion manats of revenue, down from 84.39 billion manats in\n2020, and 103.57 billion manats in 2017. The 2021 expenditure budget was set\nat 72.1 billion manats. In November 2023 state media reported the 2022 budget\nas 124.299 billion manats revenue and 117,601 billion manats expenditure.\n\nThe Central Bank of Turkmenistan controls the issue of money, but does not\npublish data on the money supply.\n\nThe Central Bank promotes cashless transactions. In the January–April period\nof 2020, the volume of cashless transactions using debit cards slightly more\nthan tripled compared to the same period in 2019, to just under 1.9 billion\nmanat. This shift from cash to electronic payments was not without problems;\nshortages of cash in automatic teller machines and inadequate availability of\ncard payment facilities at points of sale were reported.\n\nAt least one non-governmental organization has openly called the economy of\nTurkmenistan a kleptocracy.",
    "openai_summarised_points": [
      "• The government budget of Turkmenistan is developed and implemented in accordance with the Law “On Budget System,” which establishes the legal foundations for organizing, managing, and operating the budget system, as well as regulating interrelations between budgets at all administrative levels.",
      "• The Turkmenistan government discusses the draft state budget and submits it to the President of Turkmenistan for approval.",
      "• One month prior to the start of the fiscal year, the President submits the state budget draft to the Assembly of Turkmenistan (Mejlis) for consideration and adoption.",
      "• The Ministry of Economy and Finance holds responsibility for managing state finances in Turkmenistan.",
      "• Budget statistics in Turkmenistan are considered unreliable due to the government’s use of large amounts of extra-budgetary funds that are not transparently reported.",
      "• The government budget revenue for 2021 totaled 79.5 billion manats, which represents a decline from 84.39 billion manats in 2020 and 103.57 billion manats in 2017.",
      "• The expenditure budget for 2021 was set at 72.1 billion manats.",
      "• According to state media reports from November 2023, the 2022 budget comprised 124.299 billion manats in revenue and 117.601 billion manats in expenditure.",
      "• The Central Bank of Turkmenistan controls the issuance of money but does not publish data regarding the money supply.",
      "• The Central Bank actively promotes cashless transactions; during January to April 2020, the volume of cashless transactions using debit cards more than tripled compared to the same period in 2019, reaching just under 1.9 billion manats.",
      "• The transition from cash to electronic payments encountered challenges, including shortages of cash in automatic teller machines and insufficient availability of card payment facilities at points of sale.",
      "• At least one non-governmental organization has publicly characterized the economy of Turkmenistan as a kleptocracy."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:25.560105",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1729,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Industry",
    "text": "In the post-Soviet era, Turkmenistan's industrial sector has been dominated\nincreasingly by the fuel and cotton processing industries to the detriment of\nlight industry. Between 1991 and 2004, some 14 new cotton-processing plants\nwere opened, sharply increasing the capability of processing domestically\nproduced cotton. The construction industry depends mainly on government\nbuilding projects because construction of private housing is a low priority.",
    "openai_summarised_points": [
      "• In the post-Soviet era, Turkmenistan's industrial sector has been increasingly dominated by the fuel and cotton processing industries, which has negatively impacted the development of light industry.",
      "• Between 1991 and 2004, Turkmenistan opened approximately 14 new cotton-processing plants, significantly enhancing the country's capacity to process domestically produced cotton.",
      "• The construction industry in Turkmenistan primarily relies on government building projects, as the construction of private housing is considered a low priority."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:19.878342",
      "openai_model": "gpt-4.1-mini",
      "content_length": 452,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.1",
    "section_name": "Natural gas",
    "text": "_See alsoTurkmenistan / Natural gas and export routes_\n\nTurkmenistan's natural gas reserves are estimated at 50 trillion cubic meters.\n\nTurkmenistan's major gas deposits were discovered in its central and eastern\nareas in the 1940s and 1950s, and in the 1980s the republic became the second\nlargest producer of gas in the Soviet Union, behind the Russian SFSR. During\nthe Soviet era gas was exported mainly to other Soviet republics, as\nTurkmenistan steadily increased delivery from about 9.2 million m³ in 1940 to\nabout 234 million m³ in 1960 and about 51 billion m³ in 1975. This export was\nunder centralised control, and most of the export revenue was absorbed into\nthe Soviet central budget.\n\nThis changed in 1991, when Turkmenistan gained independence and established\nfull control over gas export and export revenues. However, Soviet-era\npipelines dictated that much of the gas go to the Caucasus, Russia and\nUkraine. In the 1990s many of Turkmenistan's gas customers in the CIS failed\nto pay on time or negotiated barter deals. In the mid-1990s Turkmenistan\nstopped delivering gas to some CIS members, citing failure to pay and\nunprofitable barter deals. At the same time, the government tried to attract\ninvestments in building gas pipelines via Iran to Turkey and Western Europe\nvia Afghanistan to Pakistan. Neither deal went through due to an unfavourable\nregional security environment and high costs; inflation and the budget deficit\nrose but privatisation was resisted.\n\nIn the late 1990s the government renegotiated its export and price\narrangements with Gazprom and renewed deliveries to Georgia, Ukraine, and some\nother countries. It also opened its first pipeline not to pass through Russia,\nthe Korpezhe-Kurt Kui Pipeline.\n\nOn 14 December 2009, the Central Asia–China gas pipeline was opened, and\nTurkmenistan began delivering large volumes of natural gas to the China\nNational Petroleum Corporation. Combined design capacity of Lines A, B, and C\nof this pipeline system is 55 billion cubic meters per annum (bcma), of which\nTurkmenistan's quota was initially 35 bcma. In 2023, the Turkmenistan Ministry\nof Foreign Affairs stated that Turkmenistan's quota on this pipeline system\nwas 40 bcma. By 2015 Turkmenistan was delivering approximately 35 bcma to\nChina, counterbalancing declining exports to Russia, which ended on 1 January\n2016. Russia had earlier restricted its imports to about 10 bcma, and then 5\nbcma. Russian purchases resumed, albeit in smaller quantities, in 2019.\n\nSmall-volume sales of an estimated 12 bcma to Iran halted on 1 January 2017,\nwhen Turkmenistan unilaterally cut off supplies over payment arrears. Ashgabat\nclaimed Tehran owed some $1.8 billion for supplies delivered nearly 10 years\nbefore. In March 2025 Turkmenistan began selling natural gas to Turkey via a\nTurkmenistan-Iran, Iran-Turkey swap with the goal of shipping 1.3 bcm by the\nend of the year.\n\nIn January–November 2020, Turkmenistan extracted 62.3 billion m3 of natural\ngas, of which, according to one source, it exported 31 billion. The state-\ncontrolled official media reported in February 2024 natural gas production in\ncalendar year 2023 as 80.6187 billion cubic meters.\n\nOne observes in the table below that production and exports peaked in 2008 and\ndramatically decreased in 2009. This was due an explosion in the Central\nAsia–Center gas pipeline system in April 2009 for which Turkmenistan blamed\nGazprom. Natural gas exports include pipeline gas directly to China and\nRussia, and to Azerbaijan via a swap with Iran, plus liquid petroleum gas\nshipped by rail and truck to Afghanistan.\n\nCeremony on completion of the Turkmen section of the Turkmenistan-Afghanistan-\nPakistan-India natural gas pipeline **Turkmenistan Production, Consumption,\nand Exports of Natural Gas**\nbillion cubic meters per annum (bcma)\nSource: BP Statistical Review  Year | Production | Consumption | Exports | Exports\nto Russia | Exports\nto China | Exports\nto Iran\n---|---|---|---|---|---|---\n2005 | 57.0 | 16.1 | 40.9 | 35.1 | 0 | 5.8\n2008 | 66.1 | 20.5 | 45.6 | 39.1 | 0 | 6.5\n2009 | 36.4 | 19.9 | 16.7 | 10.7 | 0 | 5.8\n2010 | 42.4 | 22.6 | 19.7 | 9.7 | 3.5 | 6.5\n2011 | 59.5 | 25.0 | 34.5 | 10.1 | 14.3 | 10.2\n2012 | 62.3 | 23.3 | 41.1 | 9.9 | 21.3 | 9.0\n2013 | 62.3 | 22.3 | 40.1 | 9.9 | 24.4 | 4.7\n2014 | 63.5 | 20.0 | n/a | n/a | n/a | n/a\n2015 | 65.9 | 25.4 | n/a | n/a | n/a | n/a\n2016 | 63.2 | 25.1 | n/a | n/a | n/a | n/a\n2017 | 58.7 | 24.8 | n/a | n/a | n/a | n/a\n2018 | 61.5 | 28.4 | n/a | n/a | n/a | n/a\n2019 | 63.2 | 31.5 | n/a | n/a | n/a | n/a\n\nIn February 2022, Turkmenistan was identified as an ultra-emitter of methane\nby the European Space Agency's satellite-based TROPOspheric Monitoring\nInstrument, with the value of lost methane equalling about US$6 billion per\nyear.",
    "openai_summarised_points": [
      "• Turkmenistan's natural gas reserves are estimated at 50 trillion cubic meters, making it a significant holder of global gas resources.",
      "• Major gas deposits in Turkmenistan were discovered in the central and eastern regions during the 1940s and 1950s, with the republic becoming the second largest gas producer in the Soviet Union by the 1980s, behind the Russian SFSR.",
      "• During the Soviet era, Turkmenistan's gas exports were primarily to other Soviet republics, increasing from approximately 9.2 million cubic meters in 1940 to about 234 million cubic meters in 1960, and reaching around 51 billion cubic meters by 1975.",
      "• Export revenues from gas during the Soviet period were centrally controlled, with most income absorbed into the Soviet central budget rather than retained by Turkmenistan.",
      "• Following independence in 1991, Turkmenistan gained full control over its gas exports and revenues, but existing Soviet-era pipelines required much gas to be delivered to the Caucasus, Russia, and Ukraine.",
      "• In the 1990s, Turkmenistan faced payment issues with many CIS gas customers, who either delayed payments or engaged in barter deals; this led Turkmenistan to halt deliveries to some CIS members in the mid-1990s citing unprofitable arrangements.",
      "• The Turkmen government sought to diversify export routes by proposing pipelines through Iran to Turkey and via Afghanistan to Pakistan and Western Europe, but these projects failed due to regional security concerns and high costs, contributing to rising inflation and budget deficits while privatization was resisted.",
      "• In the late 1990s, Turkmenistan renegotiated export contracts and prices with Gazprom, resuming deliveries to Georgia, Ukraine, and other countries, and inaugurated its first pipeline bypassing Russia, the Korpezhe-Kurt Kui Pipeline.",
      "• On 14 December 2009, the Central Asia–China gas pipeline was inaugurated, enabling Turkmenistan to supply large volumes of natural gas to the China National Petroleum Corporation; the combined design capacity of Lines A, B, and C is 55 billion cubic meters per annum (bcma), with Turkmenistan's initial quota set at 35 bcma.",
      "• By 2023, Turkmenistan's quota on the Central Asia–China pipeline system increased to 40 bcma according to the Turkmenistan Ministry of Foreign Affairs.",
      "• By 2015, Turkmenistan was delivering approximately 35 bcma to China, offsetting declining exports to Russia, which ceased entirely on 1 January 2016 after Russia had progressively reduced imports from about 10 bcma to 5 bcma; Russian purchases resumed in smaller quantities in 2019.",
      "• Turkmenistan's small-volume gas sales to Iran, estimated at 12 bcma, were halted on 1 January 2017 due to payment arrears, with Ashgabat claiming Tehran owed approximately $1.8 billion for supplies delivered nearly a decade earlier.",
      "• In March 2025, Turkmenistan began selling natural gas to Turkey through a swap arrangement involving Turkmenistan-Iran and Iran-Turkey pipelines, targeting shipments of 1.3 billion cubic meters by the end of the year.",
      "• In January–November 2020, Turkmenistan extracted 62.3 billion cubic meters of natural gas, exporting approximately 31 billion cubic meters according to one source.",
      "• Official state-controlled media reported in February 2024 that Turkmenistan's natural gas production for the calendar year 2023 was 80.6187 billion cubic meters.",
      "• Production and exports of natural gas peaked in 2008 but dramatically declined in 2009 due to an explosion in the Central Asia–Center gas pipeline system in April 2009, for which Turkmenistan blamed Gazprom.",
      "• Turkmenistan's natural gas exports include pipeline deliveries directly to China and Russia, exports to Azerbaijan via swaps with Iran, and shipments of liquefied petroleum gas by rail and truck to Afghanistan.",
      "• The Turkmenistan-Afghanistan-Pakistan-India (TAPI) natural gas pipeline project reached a milestone with the completion of the Turkmen section, symbolizing efforts to diversify export routes.",
      "• Data from the BP Statistical Review shows Turkmenistan's natural gas production rose from 57.0 bcma in 2005 to a peak of 66.1 bcma in 2008, then dropped sharply to 36.4 bcma in 2009, before gradually recovering to 63.2 bcma in 2019.",
      "• Consumption within Turkmenistan increased steadily from 16.1 bcma in 2005 to 31.5 bcma in 2019, reflecting growing domestic demand.",
      "• Exports to Russia declined from 35.1 bcma in 2005 to 10.7 bcma in 2009 and further to 9.9 bcma by 2013, while exports to China began in 2010 at 3.5 bcma and rose to 24.4 bcma by 2013; exports to Iran fluctuated between 4.7 and 10.2 bcma during 2010–2013.",
      "• In February 2022, the European Space Agency's TROPOspheric Monitoring Instrument identified Turkmenistan as an ultra-emitter of methane, with lost methane emissions valued at approximately US$6 billion annually."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:32.056739",
      "openai_model": "gpt-4.1-mini",
      "content_length": 4780,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.1.1",
    "section_name": "Natural gas to gasoline production",
    "text": "On 28 June 2019, a US$1.7 billion factory for producing gasoline out of\nnatural gas was commissioned in Ovadandepe. Built by Rönesans and Kawasaki\nusing technology from Haldor Topsoe, the factory has a design capacity of\n600,000 tonnes of gasoline, 12,000 tonnes of diesel fuel, and 115,000 tonnes\nof liquefied petroleum gas per year, produced from 1.7 billion cubic meters of\nnatural gas. According to opposition media, as of January 2023 the plant had\nhalted production of export-grade ECO-93 gasoline due to a lack of catalyzers,\nand was producing only lower-quality gasoline for domestic consumption.",
    "openai_summarised_points": [
      "• On 28 June 2019, a factory with an investment of US$1.7 billion was commissioned in Ovadandepe for producing gasoline from natural gas.",
      "• The factory was constructed by the companies Rönesans and Kawasaki, utilizing technology developed by Haldor Topsoe.",
      "• The facility has a design production capacity of 600,000 tonnes of gasoline annually.",
      "• In addition to gasoline, the factory is designed to produce 12,000 tonnes of diesel fuel per year.",
      "• The plant also produces 115,000 tonnes of liquefied petroleum gas (LPG) annually.",
      "• These products are generated from an input of 1.7 billion cubic meters of natural gas each year.",
      "• According to opposition media reports as of January 2023, the plant had ceased production of export-grade ECO-93 gasoline.",
      "• The halt in export-grade gasoline production was attributed to a shortage of catalyzers necessary for the process.",
      "• Following the stoppage, the factory was reportedly producing only lower-quality gasoline intended for domestic consumption."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:22.255296",
      "openai_model": "gpt-4.1-mini",
      "content_length": 604,
      "bullet_points_count": 9
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.2",
    "section_name": "Oil",
    "text": "_See alsoTurkmenistan / Oil_\n\nTurkmenistan's major oil-producing area is in the west, mainly in Balkan\nProvince, and is part of the South Caspian Basin, an intercontinental\ndepression noted for oil production. Commercial oil production on the Turkmen\nside of the Caspian Sea began in the early 1900s, in the environs of the\nCheleken Peninsula, and modern oil drilling began in the 1930s near\nBalkanabat. The Gumdag field was developed in 1949, then Goturdepe (1958),\nEkerem (1962), and others. Offshore drilling began in the 1970s.\n\nMajor onshore oil fields include Çeleken, Goñurdepe, Nebitdag, Gumdag,\nBarsagelmez, Guýujyk. Gyzylgum, Ördekli, Gögerendag, Gamyşlyja, Ekerem,\nÇekişler, Keýmir, Ekizek, and Bugdaýly. In 2019, capital investment in the oil\nindustry totalled 3.29 billion manats. In January–November 2020, Turkmenistan\nextracted 8.7 million tonnes of oil and condensate. Production of liquid\npetroleum gas totalled 231,000 tonnes. Oil production in calendar year 2023\nwas reported in official state media as 8.3167 million tonnes.\n\nThe oil production and consumption data in the table below are taken from BP\nStatistical Review.\n\nOil drilling rig on the Cheleken Peninsula, Balkan Province, Turkmenistan Oil\nwell donkeys in Balkan Province, Turkmenistan **Turkmenistan Production and\nConsumption of Oil**\nSource: BP Statistical Review  Year | Production\n(1000 bbl/day) | Production\n(million tonnes/year) | Consumption\n(million tonnes/year)\n---|---|---|---\n2002 | 183 | 9.0 | 3.9\n2005 | 193 | 9.5 | 4.3\n2008 | 208 | 10.3 | 5.1\n2009 | 211 | 10.4 | 4.6\n2010 | 217 | 10.7 | 4.5\n2011 | 217 | 10.7 | 4.7\n2012 | 222 | 11.0 | 4.8\n2013 | 231 | 11.4 | 4.8\n2014 | 263 | 12.9 | 6.5\n2015 | 271 | 13.2 | 6.5\n2016 | 270 | 13.2 | 6.5\n2017 | 271 | 13.1 | 6.5\n2018 | 261 | 12.6 | 6.7\n2019 | 264 | 12.5 | 7.1",
    "openai_summarised_points": [
      "• Turkmenistan's principal oil-producing region is located in the west of the country, primarily within Balkan Province, which forms part of the South Caspian Basin, an intercontinental depression renowned for oil production.",
      "• Commercial oil extraction on the Turkmen side of the Caspian Sea commenced in the early 1900s around the Cheleken Peninsula area, with modern oil drilling operations beginning in the 1930s near the city of Balkanabat.",
      "• Key oil fields developed over time include the Gumdag field in 1949, Goturdepe in 1958, and Ekerem in 1962, with offshore drilling activities initiated during the 1970s.",
      "• Major onshore oil fields in Turkmenistan encompass Çeleken, Goñurdepe, Nebitdag, Gumdag, Barsagelmez, Guýujyk, Gyzylgum, Ördekli, Gögerendag, Gamyşlyja, Ekerem, Çekişler, Keýmir, Ekizek, and Bugdaýly.",
      "• In 2019, capital investment in Turkmenistan's oil industry amounted to 3.29 billion manats, reflecting significant financial commitment to the sector.",
      "• During the period from January to November 2020, Turkmenistan produced 8.7 million tonnes of oil and condensate, alongside 231,000 tonnes of liquid petroleum gas.",
      "• Official state media reported that oil production in the calendar year 2023 reached 8.3167 million tonnes.",
      "• According to data from the BP Statistical Review, Turkmenistan's oil production and consumption figures from 2002 to 2019 are as follows:",
      "• In 2002, oil production was 183,000 barrels per day (9.0 million tonnes/year) with consumption at 3.9 million tonnes/year.",
      "• By 2005, production increased to 193,000 barrels per day (9.5 million tonnes/year), consumption rose to 4.3 million tonnes/year.",
      "• In 2008, production reached 208,000 barrels per day (10.3 million tonnes/year), consumption was 5.1 million tonnes/year.",
      "• In 2009, production was 211,000 barrels per day (10.4 million tonnes/year), consumption decreased slightly to 4.6 million tonnes/year.",
      "• For 2010, production increased to 217,000 barrels per day (10.7 million tonnes/year), consumption was 4.5 million tonnes/year.",
      "• In 2011, production remained at 217,000 barrels per day (10.7 million tonnes/year), consumption rose to 4.7 million tonnes/year.",
      "• In 2012, production increased to 222,000 barrels per day (11.0 million tonnes/year), consumption was 4.8 million tonnes/year.",
      "• In 2013, production reached 231,000 barrels per day (11.4 million tonnes/year), consumption remained at 4.8 million tonnes/year.",
      "• In 2014, production rose significantly to 263,000 barrels per day (12.9 million tonnes/year), consumption increased to 6.5 million tonnes/year.",
      "• In 2015, production was 271,000 barrels per day (13.2 million tonnes/year), consumption remained at 6.5 million tonnes/year.",
      "• In 2016, production slightly decreased to 270,000 barrels per day (13.2 million tonnes/year), consumption stayed at 6.5 million tonnes/year.",
      "• In 2017, production was 271,000 barrels per day (13.1 million tonnes/year), consumption remained at 6.5 million tonnes/year.",
      "• In 2018, production decreased to 261,000 barrels per day (12.6 million tonnes/year), consumption increased to 6.7 million tonnes/year.",
      "• In 2019, production rose slightly to 264,000 barrels per day (12.5 million tonnes/year), consumption increased to 7.1 million tonnes/year."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:40.452954",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1803,
      "bullet_points_count": 22
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.2.1",
    "section_name": "Petroleum refining",
    "text": "Oil is processed at two refineries, the Türkmenbaşy and Seydi oil refining\ncomplexes. The Turkmenbashy oil refinery had a refining capacity of more than\n10 million tons of oil per year as of May 2016. The refinery produces a range\nof products, including unleaded gasoline, petroleum coke, asphalt, laundry\ndetergent, hydro-treated Diesel, and lubricating oil. The Turkmenbashy oil\nrefinery is Turkmenistan's largest producer of liquid petroleum gas,\naccounting for two-thirds of total production with annual output of about 300\nthousand tonnes.\n\nThe Seydi refinery processed about 135,500 tonnes of oil in the first quarter\nof 2020, and 441,200 tonnes January–November, implying capacity of about half\na million tonnes of oil in 2020 despite design capacity of 6 million tonnes.\nIn the first eight months of 2021, the Seydi refinery produced 135,200 tonnes\nof gasoline, 77,600 tonnes of diesel fuel, 22,800 tonnes of heavy gas oil, and\n19,500 tonnes of asphalt. The Seydi refinery was built during the Soviet\nperiod to process oil from Siberia. Since the collapse of the Soviet Union,\nhowever, the Seydi refinery has been supplied with hydrocarbons from\nTurkmenistan, including the Gokdumalak, Yashyldepe, Yoloten, and Kerwen\nfields.\n\nIn October 2020, President Gurbanguly Berdimuhamedow criticized low output\nfrom refineries, stating, \"...growth is not observed in oil extraction, half\nof which is exported. Processing enterprises do not operate at the appropriate\nlevel, and for a long time are used at barely 40%.\"",
    "openai_summarised_points": [
      "• Oil refining in Turkmenistan is conducted at two main facilities: the Türkmenbaşy oil refinery and the Seydi oil refining complex.",
      "• As of May 2016, the Türkmenbaşy oil refinery had a refining capacity exceeding 10 million tons of oil per year.",
      "• The Türkmenbaşy refinery produces a diverse range of products, including unleaded gasoline, petroleum coke, asphalt, laundry detergent, hydro-treated diesel, and lubricating oil.",
      "• The Türkmenbaşy oil refinery is the largest producer of liquid petroleum gas (LPG) in Turkmenistan, responsible for approximately two-thirds of the country's total LPG production, with an annual output of about 300,000 tonnes.",
      "• The Seydi refinery processed approximately 135,500 tonnes of oil in the first quarter of 2020 and 441,200 tonnes from January to November 2020, indicating an estimated annual processing capacity of about half a million tonnes in 2020, despite having a design capacity of 6 million tonnes.",
      "• In the first eight months of 2021, the Seydi refinery produced 135,200 tonnes of gasoline, 77,600 tonnes of diesel fuel, 22,800 tonnes of heavy gas oil, and 19,500 tonnes of asphalt.",
      "• The Seydi refinery was originally constructed during the Soviet era to process oil sourced from Siberia.",
      "• Following the dissolution of the Soviet Union, the Seydi refinery has been supplied with hydrocarbons from Turkmenistan’s domestic oil fields, including Gokdumalak, Yashyldepe, Yoloten, and Kerwen.",
      "• In October 2020, President Gurbanguly Berdimuhamedow publicly criticized the low output levels from Turkmenistan’s refineries, noting that oil extraction growth was stagnant despite half of the oil being exported.",
      "• President Berdimuhamedow highlighted that processing enterprises were operating at suboptimal levels, with refinery utilization rates lingering at approximately 40% for an extended period."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:32.059752",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1517,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.3",
    "section_name": "Natural gas and oil exports",
    "text": "Based on Chinese and Turkmen official trade data, China is the major importer\nof Turkmenistan's natural gas, with historical volumes between 32 and 35\nbillion cubic meters per annum (bcma). Originally, thirty-five bcma was\nTurkmenistan's quota on the Central Asia–China gas pipeline, but in August\n2023, the Turkmenistan Ministry of Foreign Affairs stated that Turkmenistan's\nquota on this pipeline system was 40 bcma. Turkmen media reported that in 2022\nChina imported 43.2 bcm of natural gas via that pipeline, but did not specify\nhow much of that originated in Turkmenistan. Subsequently, press reports\nstated Turkmen natural gas exports to China in 2022 totalled 34.09 bcm.\n\nSmaller volumes of pipeline gas are also bought by Russia's Gazprom, with 4\nbcm in 2019, 4.7 bcm in 2020, and approximately 10 bcm in 2021. Some of this\ngas is sold onward to Uzbekistan. In June 2019 Russia and Turkmenistan signed\na five-year agreement for annual deliveries of 5.5 bcm.\n\nSales of pipeline gas to Iran ceased in 2017 due to a dispute over arrears,\nbut resumed in Summer 2023 with test shipments of 10 million cubic meters\n(mcm) per day. The deal, signed in June 2023, envisions export of up to 20 mcm\nper day of natural gas to Iran.\n\nIn November 2021, the governments of Turkmenistan, Iran, and Azerbaijan\nannounced agreement on a natural gas swap of up to 2 billion cubic meters per\nyear, with Turkmen gas to flow to Iran, and Iranian gas to flow to Azerbaijan.\nIran's oil minister, Javad Owji, declared readiness to increase the swap\nvolume to 15 bcma. In August 2023 media reported that the volume of gas\nswapped had risen from 4.5 million cubic meters per day to 8 mcm per day.\n\nAccording to BP's _Statistical Review of World Energy 2021_ , Turkmenistan's\nnatural gas exports in 2020, by destination, in billion cubic meters were:\n\nKazakhstan | 0.1\n---|---\nRussia | 3.8\nOther CIS | 0.5\nChina | 27.2\nTotal | 31.6",
    "openai_summarised_points": [
      "• China is the major importer of Turkmenistan's natural gas, with historical import volumes ranging between 32 and 35 billion cubic meters per annum (bcma) based on Chinese and Turkmen official trade data.",
      "• Initially, Turkmenistan's quota on the Central Asia–China gas pipeline was set at 35 bcma; however, in August 2023, the Turkmenistan Ministry of Foreign Affairs announced that this quota had increased to 40 bcma.",
      "• Turkmen media reported that China imported 43.2 billion cubic meters (bcm) of natural gas via the Central Asia–China pipeline in 2022, though the exact volume originating from Turkmenistan was not specified.",
      "• Subsequent press reports clarified that Turkmenistan's natural gas exports to China in 2022 totaled 34.09 bcm.",
      "• Russia's Gazprom purchased smaller volumes of Turkmen pipeline gas, with 4 bcm in 2019, 4.7 bcm in 2020, and approximately 10 bcm in 2021; some of this gas was resold to Uzbekistan.",
      "• In June 2019, Russia and Turkmenistan signed a five-year agreement for annual deliveries of 5.5 bcm of natural gas.",
      "• Pipeline gas sales from Turkmenistan to Iran ceased in 2017 due to a dispute over arrears but resumed in Summer 2023 with test shipments of 10 million cubic meters (mcm) per day.",
      "• A new deal signed in June 2023 envisions Turkmenistan exporting up to 20 mcm per day of natural gas to Iran.",
      "• In November 2021, Turkmenistan, Iran, and Azerbaijan announced an agreement on a natural gas swap of up to 2 billion cubic meters per year, involving Turkmen gas flowing to Iran and Iranian gas flowing to Azerbaijan.",
      "• Iran's oil minister, Javad Owji, expressed readiness to increase the gas swap volume to 15 bcma.",
      "• By August 2023, media reports indicated that the volume of gas swapped between Turkmenistan and Iran had increased from 4.5 mcm per day to 8 mcm per day.",
      "• According to BP’s _Statistical Review of World Energy 2021_, Turkmenistan's natural gas exports in 2020 by destination (in bcm) were: Kazakhstan – 0.1 bcm; Russia – 3.8 bcm; Other CIS countries – 0.5 bcm; China – 27.2 bcm; totaling 31.6 bcm."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:35.434362",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1910,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.3.1",
    "section_name": "Value of exports",
    "text": "Chinese sources reported that in 2021 Turkmenistan earned $6.79 billion for\ndelivering natural gas to China. Chinese Customs statistics show China\nimported natural gas from Turkmenistan from January through November 2022\nvalued at $9.28 billion. Azerbaijan imported 857 million cubic meters (mcm) of\nnatural gas from Turkmenistan in calendar year 2022, worth \"over $130.63\nmillion\".\n\nIn June 2021 Turkmenistan and China announced award of a tender to CNPC\nChuanging Drilling Engineering Company, Ltd. for drilling gas wells in the\nGalkynysh gas field in return for payment in kind of 17 bcm of natural gas\ndelivered over a period of three years. The first of these wells was\ncommissioned in January 2023.\n\n**Turkmenistan Hydrocarbon Exports**\n---\n| 2015  | 2016  | 2017  | 2018  | 2019\n| quantity  | value,\nmillion US$  | quantity  | value,\nmillion US$  | quantity  | value,\nmillion US$  | quantity  | value,\nmillion US$  | quantity  | value,\nmillion US$\nnatural gas, billion cubic meters  | 40.3  | 8406.7  | 37.9  | 4327.8  | 38.2  | 5031.7  | 37.8  | 6428.0  | 37.6  | 6942.1\npetroleum products, million tonnes  | 2.8  | 1038.3  | 2.6  | 796.2  | 2.6  | 1000.7  | 2.9  | 1430.1  | 3.1  | 1297.1\ncrude oil, million tonnes  | 4.1  | 1466.8  | 4.9  | 1210.8  | 1.9  | 612.8  | 6.4  | 2634.4  | 3.8  | 1671.5",
    "openai_summarised_points": [
      "• In 2021, Turkmenistan earned $6.79 billion from delivering natural gas to China, according to Chinese sources.",
      "• Chinese Customs statistics indicate that from January through November 2022, China imported natural gas from Turkmenistan valued at $9.28 billion.",
      "• Azerbaijan imported 857 million cubic meters (mcm) of natural gas from Turkmenistan in the calendar year 2022, with a value exceeding $130.63 million.",
      "• In June 2021, Turkmenistan and China announced the awarding of a tender to CNPC Chuanging Drilling Engineering Company, Ltd. for drilling gas wells in the Galkynysh gas field.",
      "• The payment for the drilling contract was arranged in kind, with CNPC to receive 17 billion cubic meters (bcm) of natural gas delivered over a three-year period.",
      "• The first gas well drilled under this contract was commissioned in January 2023.",
      "• Turkmenistan Hydrocarbon Exports (2015–2019):**",
      "• In 2015, Turkmenistan exported 40.3 billion cubic meters of natural gas valued at $8,406.7 million; 2.8 million tonnes of petroleum products valued at $1,038.3 million; and 4.1 million tonnes of crude oil valued at $1,466.8 million.",
      "• In 2016, natural gas exports were 37.9 billion cubic meters valued at $4,327.8 million; petroleum products exports were 2.6 million tonnes valued at $796.2 million; and crude oil exports were 4.9 million tonnes valued at $1,210.8 million.",
      "• In 2017, natural gas exports totaled 38.2 billion cubic meters valued at $5,031.7 million; petroleum products exports were 2.6 million tonnes valued at $1,000.7 million; and crude oil exports were 1.9 million tonnes valued at $612.8 million.",
      "• In 2018, natural gas exports amounted to 37.8 billion cubic meters valued at $6,428.0 million; petroleum products exports were 2.9 million tonnes valued at $1,430.1 million; and crude oil exports were 6.4 million tonnes valued at $2,634.4 million.",
      "• In 2019, natural gas exports reached 37.6 billion cubic meters valued at $6,942.1 million; petroleum products exports were 3.1 million tonnes valued at $1,297.1 million; and crude oil exports were 3.8 million tonnes valued at $1,671.5 million."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:33.281474",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1307,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.4",
    "section_name": "Power generation",
    "text": "_See alsoTurkmenistan / Energy_\n\nIn 2019, total electrical energy generation in Turkmenistan reportedly\ntotalled 22,521.6 million kilowatt-hours (22.52 terawatt-hours).\n\nElectrical Power Generation, million kilowatt-hours\n---\n| 2015  | 2016  | 2017  | 2018  | 2019\nproduction  | 23,284.5  | 24,525.9  | 24,903.9  | 23,817.7  | 22,521.6\nexport  | 3,215.3  | 3,751.4  | 3,457.8  | 2,719.8  | 1,803.5\n\nAs of 2013, Turkmenistan had 10 electrical power plants equipped with 32\nturbines, including 14 steam-driven, 15 gas powered, and 3 hydroelectric.\nPower output in 2011 was 18.27 billion kWh, of which 2.5 billion kWh was\nexported. The Asian Development Bank reported in October 2018,\n\n> Turkmenenergo, the State Energy Corporation is the vertically integrated\n> power utility in the country. In 2017, it produced more than 23 TWh of\n> electricity, exporting 15% of that to neighboring countries.\n\nNew power plants have been constructed in Mary, Ahal province, and in Çärjew\nDistrict of Lebap province. The Mary-3 combined cycle power plant, built by\nÇalık Holding with GE turbines, commissioned in 2018, produces 1.574 gigawatts\nof electrical power and is specifically intended to support expanded exports\nof electricity to Afghanistan and Pakistan. The Zerger power plant built by\nSumitomo, Mitsubishi, Hitachi, and Rönesans Holding in Çärjew District has a\ndesign capacity of 432 megawatts from three 144-megawatt gas turbines and was\ncommissioned in September 2021. It is also primarily intended for export of\nelectricity. The Zerger plant uses natural gas from the Üçajy Gas Field\n(Russian: Учаджинского газодобывающего месторождения), delivered via a 125-km\nhigh-pressure pipeline. The Ahal power plant, with capacity of 650 megawatts,\nwas constructed to power the city of Ashgabat and in particular the Olympic\nVillage. The Derweze State Electrical Power Station (Turkmen: _Derweze Döwlet\nElektrik Stansiýasy_), a 504.4 megawatt power plant built by Çalık Enerji in\n2015, is located near Ovadandepe. In March 2023, the government announced\nplans to build a 1,574-megawatt natural gas-fired combined cycle power plant\nin Balkan Province. In October 2023 the contract for construction of this\nplant was awarded to Çalık Energji, with construction projected to be complete\nby May 2027. National Leader Gurbanguly Berdimuhamedow announced in November\n2023 that the power plant is intended to export electricity to Azerbaijan.\n\nA \"national grid strengthening project\" with support from the Asian\nDevelopment Bank is underway, which will build four new power substations and\nadd direct high-voltage lines, a 500-kilovolt line between Balkan province and\nDashoguz, and a 200-kilovolt line between Buzmeyin and Balkanabat. The\nintention is to create an \"interconnected national transmission grid to\nimprove reliability and energy efficiency...\"",
    "openai_summarised_points": [
      "• In 2019, Turkmenistan's total electrical energy generation was reported to be 22,521.6 million kilowatt-hours (22.52 terawatt-hours).",
      "• Electrical power generation in Turkmenistan from 2015 to 2019 showed fluctuations: 23,284.5 million kWh in 2015, increasing to 24,903.9 million kWh in 2017, then declining to 22,521.6 million kWh in 2019.",
      "• Electricity exports also varied during 2015-2019, with 3,215.3 million kWh exported in 2015, peaking at 3,751.4 million kWh in 2016, and decreasing to 1,803.5 million kWh by 2019.",
      "• As of 2013, Turkmenistan operated 10 electrical power plants equipped with a total of 32 turbines: 14 steam-driven, 15 gas-powered, and 3 hydroelectric turbines.",
      "• In 2011, Turkmenistan's power output was 18.27 billion kWh, with 2.5 billion kWh exported.",
      "• According to the Asian Development Bank's October 2018 report, Turkmenenergo, the State Energy Corporation, is the country's vertically integrated power utility, producing over 23 terawatt-hours of electricity in 2017 and exporting approximately 15% of this production to neighboring countries.",
      "• New power plants have been constructed in Mary, Ahal province, and Çärjew District of Lebap province to support electricity generation and exports.",
      "• The Mary-3 combined cycle power plant, commissioned in 2018 and built by Çalık Holding with GE turbines, has a capacity of 1.574 gigawatts and is designed to support expanded electricity exports to Afghanistan and Pakistan.",
      "• The Zerger power plant in Çärjew District, constructed by Sumitomo, Mitsubishi, Hitachi, and Rönesans Holding, was commissioned in September 2021 with a design capacity of 432 megawatts from three 144-megawatt gas turbines, primarily for electricity export.",
      "• The Zerger plant sources natural gas from the Üçajy Gas Field (Russian: Учаджинского газодобывающего месторождения), delivered via a 125-kilometer high-pressure pipeline.",
      "• The Ahal power plant, with a capacity of 650 megawatts, was built to supply electricity to Ashgabat, particularly the Olympic Village.",
      "• The Derweze State Electrical Power Station (Turkmen: Derweze Döwlet Elektrik Stansiýasy), a 504.4-megawatt plant constructed by Çalık Enerji in 2015, is located near Ovadandepe.",
      "• In March 2023, the Turkmen government announced plans to build a 1,574-megawatt natural gas-fired combined cycle power plant in Balkan Province.",
      "• In October 2023, the contract for the Balkan Province power plant construction was awarded to Çalık Enerji, with completion projected by May 2027.",
      "• National Leader Gurbanguly Berdimuhamedow stated in November 2023 that the new Balkan Province power plant is intended to export electricity to Azerbaijan.",
      "• A national grid strengthening project, supported by the Asian Development Bank, is underway to enhance Turkmenistan's electricity transmission infrastructure.",
      "• The grid project includes construction of four new power substations and installation of direct high-voltage lines: a 500-kilovolt line between Balkan province and Dashoguz, and a 200-kilovolt line between Buzmeyin and Balkanabat.",
      "• The objective of the national grid strengthening project is to create an interconnected national transmission grid to improve reliability and energy efficiency across Turkmenistan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:36.877654",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2840,
      "bullet_points_count": 18
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.5",
    "section_name": "Minerals",
    "text": "The following table is from _Mineral Industry of Turkmenistan_ published by\nthe United States Geological Survey, an agency of the US government, and is\nthus in the public domain.\n\n**TURKMENISTAN: PRODUCTION OF MINERAL COMMODITIES** 1\n---\n**(Metric tons, gross weight, unless otherwise specified)**\nCommodity2 |  | 2014  | 2015  | 2016  | 2017  | 2018\nMETALS  |  |  |  |  |  |\nIron and steel, products, rolled _e_ |  | 135,000  | 140,000  | 140,000  | 144,000  | 144,000\nINDUSTRIAL MINERALS\nBromine _e_ |  | 500  | 500  | 500  | NA  | NA\nCement, hydraulic _e_ | thousand metric tons  | 2,900  | 3,300  | 3,500  | 3,600  | 3,800\nClay, bentonite:  |  |  |  |  |  |\nPowder _e_ |  | 400  | 400  | 400  | 420  | 450\nOther, unspecified  |  | 7,387 _r_ | 8,000 _e_ | 8,000 _e_ | 8,400 _e_ | 9,000 _e_\nGypsum, mine _e_ |  | 107,000  | 110,000  | 110,000  | 110,000  | 110,000\nIodine _e_ |  | 500  | 500  | 500  | 510  | 400\nLime _e_ |  | 19,400  | 20,000  | 21,000  | 22,000  | 23,000\nNitrogen, N content:  |  |  |  |  |  |\nAmmonia  |  | 293,000  | 309,000 _e_ | 309,000 _e_ | 320,000 _e_ | 340,000 _e_\nUrea  |  | 344,000  | 360,000 _e_ | 360,000 _e_ | 380,000 _e_ | 400,000 _e_\nPotash, K2O content  |  | \\--  | \\--  | \\--  | 25,000 _e_ | 24,000\nSalt _e_ |  | 91,700  | 100,000  | 100,000  | 100,000  | 100,000\nSodium, compounds, sodium sulfate _e_ |  | 68,000  | 70,000  | 52,000 _r_ | 26,000  | 26,000\nSulfur, S content _e_ |  | 506,000  | 600,000  | 400,000 _r_ | 200,000  | 200,000\nMINERAL FUELS AND RELATED MATERIALS\nNatural gas  | million cubic meters  | 67,000  | 69,600  | 66,800  | 62,000  | 62,000 _e_\nPetroleum:  |  |  |  |  |  |\nCrude, including condensate  | thousand 42-gallon barrels  | 87,200  | 91,400  | 96,960  | 90,000  | 85,000\nRefinery  | _do._ | 57,100  | 55,000  | 53,600  | 44,000  | 44,000 _e_\n_e_ Estimated. _r_ Revised. _do._ Ditto. _NA_ Not available. -- Zero.\n1Table includes data available through 20 May 2019. All data are reported\nunless otherwise noted. Estimated data are rounded to no more than three\nsignificant digits; may not add to totals shown.\n2In addition to the commodities listed, barite, bench gravel, coal, dolomite,\nepsomite, and kaolin may have been produced, but available information was\ninadequate to make reliable estimates of output.\nSource: US Geological Survey\n\nIn January 2023 the deputy prime minister for industry and construction\nreported discovery of iron oxide deposits near Çagyl, Türkmenbaşy District,\nBalkan Province.",
    "openai_summarised_points": [
      "• The United States Geological Survey (USGS), a US government agency, published the table titled \"Turkmenistan: Production of Mineral Commodities,\" which is in the public domain and provides detailed mineral production data from 2014 to 2018.",
      "• Iron and steel rolled products production in Turkmenistan increased from 135,000 metric tons in 2014 to 144,000 metric tons in both 2017 and 2018.",
      "• Bromine production was steady at 500 metric tons annually from 2014 to 2016 but data for 2017 and 2018 is not available.",
      "• Hydraulic cement production rose consistently from 2.9 million metric tons in 2014 to 3.8 million metric tons in 2018.",
      "• Bentonite clay powder production increased gradually from 400 metric tons in 2014 to 450 metric tons in 2018, while other unspecified bentonite clay production rose from 7,387 metric tons (revised) in 2014 to an estimated 9,000 metric tons in 2018.",
      "• Gypsum mine production remained stable at approximately 110,000 metric tons annually from 2014 through 2018.",
      "• Iodine production was steady at 500 metric tons from 2014 to 2016, increased slightly to 510 metric tons in 2017, then declined to 400 metric tons in 2018.",
      "• Lime production showed a steady increase from 19,400 metric tons in 2014 to 23,000 metric tons in 2018.",
      "• Nitrogen content production included ammonia rising from 293,000 metric tons in 2014 to an estimated 340,000 metric tons in 2018, and urea increasing from 344,000 metric tons in 2014 to an estimated 400,000 metric tons in 2018.",
      "• Potash (K2O content) production was zero from 2014 to 2016, then started at an estimated 25,000 metric tons in 2017 and slightly decreased to 24,000 metric tons in 2018.",
      "• Salt production increased from 91,700 metric tons in 2014 to 100,000 metric tons annually from 2015 through 2018.",
      "• Sodium sulfate production peaked at 70,000 metric tons in 2015, then declined sharply to 26,000 metric tons by 2017 and remained at that level in 2018.",
      "• Sulfur production (S content) was 506,000 metric tons in 2014, increased to 600,000 metric tons in 2015, then sharply declined to 200,000 metric tons by 2017 and remained stable in 2018.",
      "• Natural gas production fluctuated slightly, with 67 billion cubic meters in 2014, peaking at 69.6 billion cubic meters in 2015, and then declining to an estimated 62 billion cubic meters in 2018.",
      "• Crude petroleum production, including condensate, increased from 87.2 million 42-gallon barrels in 2014 to a peak of 96.96 million barrels in 2016, then declined to 85 million barrels in 2018.",
      "• Petroleum refinery output decreased steadily from 57.1 million 42-gallon barrels in 2014 to an estimated 44 million barrels in 2018.",
      "• The table notes that barite, bench gravel, coal, dolomite, epsomite, and kaolin may have been produced in Turkmenistan, but reliable production data for these minerals was unavailable.",
      "• All data in the table are reported through 20 May 2019, with estimated data rounded to no more than three significant digits; some figures are revised or estimated as indicated.",
      "• In January 2023, the Deputy Prime Minister for Industry and Construction of Turkmenistan announced the discovery of iron oxide deposits near Çagyl, located in Türkmenbaşy District of Balkan Province."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:46.187522",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2473,
      "bullet_points_count": 19
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.6",
    "section_name": "Construction materials",
    "text": "Four cement plants operate in Turkmenistan, and plans have been announced to\nconstruct three more. The four cement plants currently in operation, each\ndesigned to produce one million tons per year, are:\n\n\n\n* Baherden Cement Plant (Ahal Province)\n* Kelete Cement Plant (Ahal Province)\n* Lebap Cement Plant (in Türkmenabat)\n* Balkan Cement Plant (in Jebel)\n\nIn 2019, President Berdimuhamedov noted that the Kelete plant was operating at\n8.1%, the Lebap plant at 88%, the Baherden plant at 64%, and the Balkan plant\nat just over 40% of design capacity.\n\nCement Production in Turkmenistan\nin thousand tonnes\n---\n2014  | 2015  | 2016  | 2017  | 2018  | 2019\n3,401.5  | 3,549.9  | 3,550.0  | 2,881.4  | 2,651.4  | 1,993.2\n\nIn 2019, Turkmenistan produced 5.1 million standard square meters (4mm\nthickness) of sheet glass. A $375 million float glass and glass container\nplant built by Tepe Inşaat of Turkey was opened 14 February 2018, in\nOvadandepe north of Ashgabat. It replaced a Soviet-era glass factory located\nin central Ashgabat. In 2019, the value of Turkmenistan's glass exports as\nreported by trading partners was US$9.5 million.\n\nA steel smelter, Türkmen Demir Önümleri Döwlet Kärhanasy (English: Turkmen\nIron Products State Enterprise) operating on scrap metal is located at\nkilometer 22 on the Ashgabat-Dashoguz Automobile Highway near Ovadandepe. It\nproduces mainly rebar and channel iron.\n\nThe Ceramic Products Plant in Bäherden, opened on 2025, produces 3.3 million\nsquare meters of ceramic tiles and 120,000 sanitary ware units annually using\nlocal raw materials. Equipped with advanced technology from SACMI, it meets\nIndustry 4.0 standards, is environmentally friendly, provides 460 jobs.",
    "openai_summarised_points": [
      "• Turkmenistan currently operates four cement plants, each with a design capacity of one million tons per year, located as follows: Baherden Cement Plant and Kelete Cement Plant in Ahal Province, Lebap Cement Plant in Türkmenabat, and Balkan Cement Plant in Jebel.",
      "• Plans have been announced to construct three additional cement plants to expand the country's cement production capacity.",
      "• In 2019, President Gurbanguly Berdimuhamedov reported the operational capacity utilization rates of the existing cement plants as: Kelete plant at 8.1%, Lebap plant at 88%, Baherden plant at 64%, and Balkan plant at just over 40% of their respective design capacities.",
      "• Cement production in Turkmenistan showed a declining trend from 2014 to 2019, with output figures (in thousand tonnes) as follows: 3,401.5 (2014), 3,549.9 (2015), 3,550.0 (2016), 2,881.4 (2017), 2,651.4 (2018), and 1,993.2 (2019).",
      "• In 2019, Turkmenistan produced 5.1 million standard square meters (4mm thickness) of sheet glass, reflecting significant activity in the glass manufacturing sector.",
      "• A $375 million float glass and glass container plant, constructed by the Turkish company Tepe Inşaat, was inaugurated on 14 February 2018 in Ovadandepe, north of Ashgabat, replacing an older Soviet-era glass factory previously located in central Ashgabat.",
      "• The value of Turkmenistan’s glass exports in 2019, as reported by international trading partners, amounted to US$9.5 million.",
      "• The Türkmen Demir Önümleri Döwlet Kärhanasy (Turkmen Iron Products State Enterprise) operates a steel smelter near Ovadandepe, situated at kilometer 22 on the Ashgabat-Dashoguz Automobile Highway; this facility primarily processes scrap metal to produce rebar and channel iron.",
      "• The Ceramic Products Plant in Bäherden, opened in 2025, manufactures 3.3 million square meters of ceramic tiles and 120,000 sanitary ware units annually using local raw materials.",
      "• The Bäherden Ceramic Products Plant is equipped with advanced technology supplied by SACMI, adheres to Industry 4.0 standards, is environmentally friendly, and provides employment for 460 workers."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:44.172044",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1699,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.7",
    "section_name": "Chemicals",
    "text": "As of 2019, Turkmenistan had \"nine chemical plants that produce nitrogen and\nphosphorus fertilizers (700,000 tons per year), sulfuric and nitric acids,\niodine, bromine, and mineral salts.\"\n\nIn 2019, the country was the world's 3rd largest producer of iodine.",
    "openai_summarised_points": [
      "• As of 2019, Turkmenistan operated nine chemical plants specializing in the production of nitrogen and phosphorus fertilizers with a combined output capacity of 700,000 tons per year.",
      "• These chemical plants also manufactured sulfuric acid, nitric acid, iodine, bromine, and various mineral salts.",
      "• In 2019, Turkmenistan ranked as the world's third largest producer of iodine, highlighting its significant role in the global iodine market."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:35.453943",
      "openai_model": "gpt-4.1-mini",
      "content_length": 258,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.7.1",
    "section_name": "Petrochemicals",
    "text": "Three plants in Turkmenistan produce urea (carbamide), primarily intended for\nexport, one each in Tejen, Mary,and Garabogaz. The $1.3 billion Garabogaz\nplant, built by Mitsubishi Heavy Industries and GAP İnşaat (a subsidiary of\nÇalık Holding), was inaugurated on 18 September 2018, with a design capacity\nof 1.16 million tonnes of urea per year. The US$650 million Mary ammonia and\nurea plant, commissioned on 17 October 2014, was built by Rönesans Holding,\nKawasaki, and Sojitz with design capacity of 400 thousand tonnes of ammonia\nand 640 thousand tonnes of urea. The $240 million Tejen plant, inaugurated on\n18 March 2005, has a design capacity of 350,000 tonnes of urea per year.\nReportedly, none of these plants currently produces at full capacity, however.\nBetween January and October 2019, the Garabogaz plant produced approximately\n392,000 tonnes of urea, of which 261,000 tonnes was exported. Production of\nnitrogenous fertilizers in Turkmenistan totalled 550,500 tonnes (active\ningredient basis) in 2019.\n\nThe Kiyanly Polymer Factory (Turkmen: _Gyýanly Polimer Zawody_), inaugurated\n17 October 2018, features design capacity to produce 381 thousand tonnes of\npolyethylene and 81 thousand tonnes of polypropylene per year. Built at a cost\nof US$3.4 billion by LG International, Hyundai Engineering, Toyo Engineering,\nand Gap Inşaat, the plant cracks methane and ethane for production of\npolymers. In the first ten months of 2019, however, the factory produced only\n67,900 tonnes of polyethylene and 12,700 tonnes of polypropylene. As of\nJanuary 2023, the polymer plant had reportedly ceased operation, and it had\nnot resumed as of a year later. Opposition media reported in May 2024 that the\nplant remained closed, and that Hyundai Engineering was auditing the plant to\ndetermine what was needed to refurbish and restart it, with an expected cost\nof repairs of one billion U.S. dollars.",
    "openai_summarised_points": [
      "• Turkmenistan operates three urea (carbamide) production plants primarily for export, located in Tejen, Mary, and Garabogaz.",
      "• The Garabogaz urea plant, valued at $1.3 billion, was constructed by Mitsubishi Heavy Industries and GAP İnşaat (a subsidiary of Çalık Holding) and inaugurated on 18 September 2018, with a design capacity of 1.16 million tonnes of urea annually.",
      "• The Mary ammonia and urea plant, costing US$650 million, was commissioned on 17 October 2014 and built by Rönesans Holding, Kawasaki, and Sojitz; it has a design capacity of 400,000 tonnes of ammonia and 640,000 tonnes of urea per year.",
      "• The Tejen urea plant, inaugurated on 18 March 2005 at a cost of $240 million, has a design capacity of 350,000 tonnes of urea annually.",
      "• Despite their capacities, none of the three urea plants reportedly operate at full capacity.",
      "• From January to October 2019, the Garabogaz plant produced approximately 392,000 tonnes of urea, exporting 261,000 tonnes of this output.",
      "• Total nitrogenous fertilizer production in Turkmenistan for 2019 amounted to 550,500 tonnes on an active ingredient basis.",
      "• The Kiyanly Polymer Factory (_Gyýanly Polimer Zawody_) was inaugurated on 17 October 2018 with a design capacity to produce 381,000 tonnes of polyethylene and 81,000 tonnes of polypropylene annually.",
      "• The polymer plant was built at a cost of US$3.4 billion by LG International, Hyundai Engineering, Toyo Engineering, and Gap İnşaat, utilizing methane and ethane cracking for polymer production.",
      "• In the first ten months of 2019, the Kiyanly Polymer Factory produced only 67,900 tonnes of polyethylene and 12,700 tonnes of polypropylene, significantly below design capacity.",
      "• As of January 2023, the Kiyanly Polymer Factory had reportedly ceased operations and had not resumed production as of January 2024.",
      "• Opposition media reported in May 2024 that the polymer plant remained closed, with Hyundai Engineering conducting an audit to determine refurbishment needs.",
      "• The estimated cost to repair and restart the Kiyanly Polymer Factory was reported to be approximately one billion U.S. dollars."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:44.035624",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1896,
      "bullet_points_count": 13
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.7.2",
    "section_name": "Non-hydrocarbon chemicals",
    "text": "In March 2017 the Garlyk Mining and Enrichment Combinate for production of\npotash fertilizer was inaugurated. Built by Belarus's Belgorkhimprom at a cost\nof US$1.1 billion, the factory is designed to produce 1.4 million tonnes of\nfertilizer per year, primarily for export to China and India. It reportedly\noperates at from 2 to 7 percent of rated capacity, however.\n\nThree factories produce iodine in Turkmenistan, one each in Balkanabat, Hazar,\nand Bereket. The Bereket plant is designed to produce 150 tonnes per year of\niodine. Following planned renovations and upgrades, the Balkanabat and Hazar\nplants will have design capacities of 250 tonnes and 300 tonnes of iodine,\nrespectively, plus 2400 tonnes and 4500 tonnes of bromine, respectively, per\nyear. Total production of iodine in 2019 was 681.4 tonnes.\n\nIn May 2025 the president issued a decree authorizing Türkmenhimiýa to sign a\ncontract with Daewoo Engineering & Construction Co., Ltd  for construction of\na fertilizer plant in Türkmenabat for production of 350,000 tonnes of\nsuperphosphate and 100,000 tonnes of ammonium sulfate per year.",
    "openai_summarised_points": [
      "• In March 2017, the Garlyk Mining and Enrichment Combinate for the production of potash fertilizer was inaugurated in Turkmenistan.",
      "• The Garlyk facility was constructed by Belarus's Belgorkhimprom at a cost of US$1.1 billion.",
      "• The factory is designed to produce 1.4 million tonnes of potash fertilizer annually, primarily intended for export to China and India.",
      "• Despite its design capacity, the Garlyk plant reportedly operates at only 2 to 7 percent of its rated capacity.",
      "• Turkmenistan has three factories producing iodine, located in Balkanabat, Hazar, and Bereket.",
      "• The Bereket iodine plant is designed to produce 150 tonnes of iodine per year.",
      "• Following planned renovations and upgrades, the Balkanabat plant will have a design capacity of 250 tonnes of iodine and 2,400 tonnes of bromine annually.",
      "• Similarly, the Hazar plant will have a design capacity of 300 tonnes of iodine and 4,500 tonnes of bromine per year after upgrades.",
      "• Total iodine production in Turkmenistan in 2019 amounted to 681.4 tonnes.",
      "• In May 2025, the president of Turkmenistan issued a decree authorizing Türkmenhimiýa to sign a contract with Daewoo Engineering & Construction Co., Ltd.",
      "• The contract with Daewoo Engineering & Construction Co., Ltd involves the construction of a fertilizer plant in Türkmenabat.",
      "• The planned Türkmenabat fertilizer plant is designed to produce 350,000 tonnes of superphosphate and 100,000 tonnes of ammonium sulfate annually."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:43.729437",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1101,
      "bullet_points_count": 12
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.8",
    "section_name": "Textiles and Garments",
    "text": "As a cotton producer, from its conquest by the Russian Empire in the 1880s\nuntil independence in 1991 Turkmenistan mainly exported raw cotton to Russia\nfor spinning. Since independence, Turkmenistan has invested roughly $2 billion\nin 70 plants and factories for production of cotton yarn, textiles, and\ngarments made from other materials, including shoes. Of these, 13 are large\nginning, spinning, or textile mills. In 2019, Turkmenistan exported cotton\ntextiles worth $123.6 million. In 2019, Turkmenistan produced 118,600 tonnes\nof cotton yarn, and 209.4 million square meters of fabric, of which 192.9\nmillion was cotton, 14.9 million was terrycloth, and 1.4 million was silk. In\naddition, Turkmenistan produced in 2019 40.9 million pairs of stockings, 5.5\nmillion knit items, 1.5 million pairs of shoes, and 3,400 tonnes of knitted\nfabric.",
    "openai_summarised_points": [
      "• Turkmenistan has been a cotton producer since its conquest by the Russian Empire in the 1880s, primarily exporting raw cotton to Russia for spinning until its independence in 1991.",
      "• Since gaining independence in 1991, Turkmenistan has invested approximately $2 billion in the establishment of 70 plants and factories dedicated to the production of cotton yarn, textiles, and garments made from various materials, including shoes.",
      "• Among these 70 facilities, 13 are classified as large ginning, spinning, or textile mills, indicating significant industrial capacity in the textile sector.",
      "• In the year 2019, Turkmenistan exported cotton textiles valued at $123.6 million, reflecting the country's development in textile manufacturing and export capabilities.",
      "• Turkmenistan's cotton yarn production in 2019 amounted to 118,600 tonnes, demonstrating substantial output in raw textile materials.",
      "• The total fabric production in 2019 was 209.4 million square meters, comprising 192.9 million square meters of cotton fabric, 14.9 million square meters of terrycloth, and 1.4 million square meters of silk fabric.",
      "• In addition to fabric, Turkmenistan produced 40.9 million pairs of stockings in 2019, indicating a significant garment manufacturing sector.",
      "• The production of knit items in 2019 reached 5.5 million units, further showcasing the diversity of textile products manufactured domestically.",
      "• Footwear production in 2019 included 1.5 million pairs of shoes, highlighting the integration of other garment-related industries within the textile sector.",
      "• Turkmenistan also produced 3,400 tonnes of knitted fabric in 2019, contributing to the overall textile output and supporting garment manufacturing."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:47.516970",
      "openai_model": "gpt-4.1-mini",
      "content_length": 843,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.9",
    "section_name": "Construction",
    "text": "The Turkmenistan government centrally funds and controls major construction\nprojects. As of January 2021, the government acknowledged over 2,500 large-\nscale projects under construction at a cost of $37 billion. In 2020, about two\nmillion square meters of new residential housing was built at government\nexpense, as well as 45 \"important government\" structures. In 2021 construction\nwas completed of five major facilities in Ashgabat (a new State Tribune, the\nArkadag Hotel, two bank headquarters, and a new Congress Center, all by\nBouygues). Total cost of these five projects was $1.5 billion.\n\nA current major project is the $4.8 billion being spent on construction of the\ncity of Arkadag, the new capital of Ahal province. In addition, $2.3 billion\nhas been allocated for construction of the Ashgabat-Turkmenabat motorway by a\nconsortium of four Turkmen construction firms.",
    "openai_summarised_points": [
      "• The Turkmenistan government centrally funds and controls all major construction projects within the country.",
      "• As of January 2021, the government reported that over 2,500 large-scale construction projects were underway, with a total estimated cost of $37 billion.",
      "• In 2020, approximately two million square meters of new residential housing were constructed entirely at government expense.",
      "• Additionally, in 2020, 45 \"important government\" structures were built under government funding.",
      "• In 2021, construction was completed on five major facilities located in Ashgabat, including a new State Tribune, the Arkadag Hotel, two bank headquarters, and a new Congress Center.",
      "• All five major Ashgabat projects completed in 2021 were constructed by the French company Bouygues.",
      "• The total expenditure for these five Ashgabat projects amounted to $1.5 billion.",
      "• A significant ongoing project is the construction of the city of Arkadag, designated as the new capital of Ahal province, with a budget of $4.8 billion.",
      "• Furthermore, $2.3 billion has been allocated for the construction of the Ashgabat-Turkmenabat motorway.",
      "• The Ashgabat-Turkmenabat motorway project is being executed by a consortium composed of four Turkmen construction firms."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:46.412867",
      "openai_model": "gpt-4.1-mini",
      "content_length": 876,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.10",
    "section_name": "Transport",
    "text": "As a crossroads for centuries and part of the Silk Road, Turkmenistan serves\nas a transit point for cargoes shipped by air, sea, and land. Under normal\nconditions, Ashgabat International Airport is a stopover and transfer point\nfor air passengers between India (Amritsar and New Delhi) and England (London\nand Birmingham), as well as between Frankfurt-am-Main and Bangkok.",
    "openai_summarised_points": [
      "• Turkmenistan has historically functioned as a crossroads and integral part of the Silk Road, facilitating transit of cargo via air, sea, and land routes.",
      "• Ashgabat International Airport operates as a key stopover and transfer hub for air passengers traveling between India—specifically the cities of Amritsar and New Delhi—and England, including London and Birmingham.",
      "• The airport also serves as a transit point for flights connecting Frankfurt-am-Main in Germany with Bangkok in Thailand under normal operating conditions."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:46.471070",
      "openai_model": "gpt-4.1-mini",
      "content_length": 372,
      "bullet_points_count": 3
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.10.1",
    "section_name": "Seaports",
    "text": "Turkmenistan's major seaport is the Turkmenbashy International Seaport on the\nCaspian. Expanded at a cost of $2 billion between 2013 and 2018 by Gap Inşaat,\nthe seaport has capacity to handle annually 25 million tonnes of dry cargo (17\nmillion in the newly expanded port, 8 million in the old port), 300,000\npassengers, 75,000 freight trucks, and 400,000 containers. The port features\nregular ferry service to Baku. This seaport also manages three oil loading\nterminals, Kenar, Alaja, and Ekerem. Turkmenistan's only other seaports are\nthe loading terminals for factories at Kiyanly (Gyýanly) and Garabogaz and an\noil loading terminal at Hazar."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.10.2",
    "section_name": "Airports",
    "text": "Five major airports in Turkmenistan feature regular domestic passenger\nservice: Ashgabat, Dashoguz, Mary, Turkmenabat, and Turkmenbashy. A sixth\ninternational-class airport at Kerki was commissioned in June 2021 and was\nslated to begin regular domestic passenger service in January 2022. A seventh\nairport, Balkanabat, is in operation for special flights. Under normal\nconditions, only Ashgabat International Airport offers regular international\npassenger service. Turkmenbashy International Airport is used for\ninternational cargo, chiefly by Cargolux. The lone domestic air carrier is\nstate-owned Türkmen Howa Ýollary (Turkmenistan Airlines). In 2019,\nTurkmenistan Airlines hauled 12 thousand tonnes of cargo. It also flew 2.5\nmillion passengers and 2.98 billion passenger-kilometers.\n\nMinor airports are found in some smaller cities and towns, including\nBalkanabat, Etrek, Garabogaz, Hazar, and Jebel in Balkan Province. A former\nmilitary airfield at Galaýmor in Mary Province is slated for conversion to\ncivil aviation. There are also small landing strips at Aeroport village and\nGäwers in Ahal Province."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.10.3",
    "section_name": "Rail",
    "text": "The domestic rail system is operated by state-owned Türkmendemirýollary\n(Turkmen Railways). No scheduled international passenger service exists, but\ndomestic passenger service connects major Turkmen cities. Freight service is\navailable to both domestic and international destinations. In 2019, 23.8\nmillion tonnes of freight was transported by rail in Turkmenistan. In the same\nyear, Turkmen Railways handled 5.44 million passengers and counted 2.53\nbillion passenger-kilometers.",
    "openai_summarised_points": [
      "• The domestic rail system in Turkmenistan is operated by the state-owned company Türkmendemirýollary, also known as Turkmen Railways.",
      "• There is no scheduled international passenger rail service available in Turkmenistan.",
      "• Domestic passenger rail service connects major cities within Turkmenistan, facilitating internal travel.",
      "• Freight rail service operates for both domestic transport and international destinations, supporting cargo movement across borders.",
      "• In 2019, Turkmenistan’s rail system transported a total of 23.8 million tonnes of freight.",
      "• During the same year, Turkmen Railways handled 5.44 million passengers on its domestic rail network.",
      "• The total passenger traffic volume in 2019 amounted to 2.53 billion passenger-kilometers, reflecting the extent of passenger rail usage in Turkmenistan."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:23:48.030070",
      "openai_model": "gpt-4.1-mini",
      "content_length": 479,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.10.4",
    "section_name": "Roads",
    "text": "As of 2011, Turkmenistan featured 13.7 thousand kilometers of roads, of which\n12.3 thousand were paved. In 2019, road transport accounted for 27.1 billion\npassenger-kilometers, or 83% of passenger traffic in Turkmenistan. Motor\nvehicles transported 448.9 million tonnes of cargo in 2019, 85.5% of the\ntotal, and accounted for 14.2 billion tonne-kilometers. Major highways in\nTurkmenistan include the M37 connecting the seaport at Türkmenbaşy to the\nborder with Uzbekistan at Farap, the Ashgabat-Dashoguz Highway connecting\nAshgabat and Dashoguz, and the P-7 highway connecting the M37 at Tejen to the\nborder with Iran at Sarahs."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.11",
    "section_name": "Banking",
    "text": "The financial system is under full state control. The banking system, which\nwas reduced substantially after the 1998 financial crisis, includes 9 national\nbanks. These include a nominally private bank owned by the Union of\nIndustrialists and Entrepreneurs, Rysgal Bank, and Turkmen-Turkish Bank, a\njoint venture between Dayhan Bank and Turkish state-owned Ziraat Bankası.\nThese institutions have the same basic division of responsibility as in the\nSoviet era, overseen by the Central Bank of Turkmenistan. Lending operations\nand household savings have not been important functions of this system. In\n2005 an estimated 95 percent of loans went to state enterprises. Two branches\nof foreign banks, National Bank of Pakistan and Iran Saderat Bank, are located\nin Ashgabat, where they offer retail banking services. Two German banks,\nDeutsche Bank and Commerzbank, offer institutional services through offices in\nAshgabat.\n\nAs of 1 January 2021, total assets of all banks in Turkmenistan amounted to\n135.8 billion manats. Deposits by individuals totalled 3.3 billion manats,\nincluding 2.8 billion in demand deposits and 437 million manats in time\ndeposits. Business deposits totalled 39.1 billion manats, of which 14.6\nbillion in demand deposits and 53.7 billion in time deposits. Total business\ndeposits were broken out into state-owned firms (32.5 billion manats),\nprivately owned firms (21.1 billion manats), and individual unincorporated\nentrepreneurs (7.9 billion manats).\n\nIn 2019, 84.1 billion manats worth of credit was extended to individuals,\nfirms, and organizations, up from 76.3 billion in 2018 and 69.2 billion in\n2017. Of these figures, 60.9 billion, 52.1 billion, and 46.7 billion were in\nTurkmen manats, respectively."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "3.11.1",
    "section_name": "Credit and debit cards",
    "text": "Several types of national plastic cards are used in Turkmenistan: Milli Kart,\nAltyn Asyr, Turkmen Kart. The number of bank cards issued in Turkmenistan for\n2023 amounted to over 5 million 177 thousand units, according to the Central\nBank of Turkmenistan. Cashback services are provided by Halkbank, Daykhanbank,\nRysgal Bank, Senagat Bank, Turkmenbashi Bank, Turkmenistan Bank, Turkmen-\nTurkish Joint-Stock Commercial Bank. Cashback amounts range from 2% to 3%. In\nTurkmenistan, the card can be used to pay not only for purchases in a store,\nbut also for the services of healthcare institutions, utility bills and\nservices of all types of communications and the Internet, railway, bus and air\ntickets. In 2019, contactless payment technology was introduced in the country\nfor the first time.\n\nThe number of ATMs in 2023 in the country was 2,144 devices with 42,131 bank\npayment terminals. The number of users of the Internet Bank service reached\n932,730 people with the Mobile Bank service reaching 60,654.\n\nTurkmen banks have the ability to issue new Visa, MasterCard and Maestro\ncards. Using MasterCard and VISA plastic cards supported by international\npayment systems, citizens of Turkmenistan can make non-cash payments and\nwithdraw funds from ATMs in foreign countries."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Insurance",
    "text": "Turkmengosstrakh is the state insurance firm."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Agriculture",
    "text": "In 2019, Turkmenistan produced:\n\n* 1.5 million tons of wheat;\n* 582 thousand tons of cotton;\n* 356 thousand tons of tomato;\n* 315 thousand tons of potato;\n* 263 thousand tons of watermelon;\n* 246 thousand tons of grape;\n* 245 thousand tons of sugar beet, which is used to produce sugar and ethanol;\n* 130 thousand tons of rice;\n* 74 thousand tons of onion;\n* 71 thousand tons of carrot;\n* 66 thousand tons of apple;\n* 34 thousand tons of apricot;\n\nin addition to other agricultural products.\n\nIn the early 2000s, the contribution of Turkmenistan's state-run agriculture\nsector to gross domestic product increased under close state supervision. The\ntop crop in terms of area planted is wheat (761 thousand hectares in 2019),\nfollowed by cotton (551 thousand hectares in 2019). In recent years state\npolicy makers have increased the range of crops with the aim of making\nTurkmenistan self-sufficient in food. In the post-Soviet era, the area planted\nto grains (mainly wheat) has nearly tripled. However, most agricultural land\nis of poor quality and requires irrigation. Turkmenistan's irrigation\ninfrastructure and water-use policies have not responded efficiently to this\nneed. Irrigation in areas distant from natural rivers depends mainly on the\ndecrepit Karakum Canal, which carries water across Turkmenistan from the Amu\nDarya to near Bereket. The Dostluk Dam, opened at Sarahs on the border with\nIran in 2005, has increased available irrigation water and improved\nefficiency. Plans call for a similar dam on the Atrek River.\n\nDuring the 2020 season, Turkmenistan reportedly produced roughly 1.5 million\ntons of raw cotton. Prior to imposition of a ban on export of raw cotton in\nOctober 2018, Turkmenistan exported raw cotton to Russia, Iran, South Korea,\nUnited Kingdom, China, Indonesia, Turkey, Ukraine, Singapore and the Baltic\nstates. Beginning in 2019, the Turkmenistan government shifted focus to export\nof cotton yarn and finished textiles and garments.\n\nPrivate farmers grow most of Turkmenistan's fruits and vegetables (chiefly\ntomatoes, watermelons, grapes, and onions), but all production phases of the\nmain cash crops—grain and cotton—remain under state control. In 2006 grain\ncrop failures led to steadily increasing bread lines and reinstatement of a\nrationing system in most regions. At the root of those failures was a culture\nof falsifying output figures together with poor administration of the sector.\n\nSince 2018, independent media have reported food shortages in the country,\nwith hundreds of people queuing for hours to buy bread and flour. Despite\nofficial government figures indicating good harvests, independent media report\nlow output due to drought and mismanagement, and that shortages of flour and\nbread have reappeared."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "5.1",
    "section_name": "Mechanization of agriculture",
    "text": "Since independence, the Turkmenistan government has spent considerable sums on\nimported agricultural tractors, harvesters, and implements. In 2012, around\n7,000 tractors, 5,000 cotton cultivators, 2,200 seeders, and other machines,\nmainly procured from Belarus and the United States, were used.\n\nJohn Deere and Case IH each began selling farm machinery in Turkmenistan in\n1994. Claas combines were first used for grain harvesting in Turkmenistan in\n2011. Belarus tractors, in use since Soviet times, continue to be popular due\nto competitive pricing and deep familiarity with the product line.\nTurkmenistan also buys cotton harvesters from Uzbekistan.\n\nBetween 2017 and 2020 Claas delivered 1,000 Tucano 420 grain combines, 800\nAxion 850 plowing tractors, and 1,550 Axos 340 tractors. In the 2017 and 2018\ncrop years John Deere delivered 440 Model 9970 cotton harvesters, and between\n2019 and 2020 another 600."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Trade",
    "text": "The following table presents the value of Turkmenistan's exports and imports\nin millions of US dollars, by year, from 2015 through 2019.\n\n| 2015  | 2016  | 2017  | 2018  | 2019\n---|---|---|---|---|---\nexports  | 12,164.0  | 7,520.1  | 7,787.9  | 11,650.9  | 11,103.8\nimports  | 14,051.4  | 13,176.8  | 10,188.6  | 5,322.9  | 5,831.7\n\nTurkmenistan's most important export commodity is natural gas, delivered by\npipelines to China and in lesser quantities to Russia and via a swap through\nIran to Azerbaijan, and by road and rail to Afghanistan as liquid petroleum\ngas. According to Chinese Customs data, the value of Chinese imports of\nnatural gas from Turkmenistan fell from US$8,686,022,768 in 2019 to\nUS$6,071,165,273 in 2020 due to a combination of reduced Chinese import\nvolumes and falling hydrocarbon prices. Crude oil and refined petroleum\nproducts accounted for another US$3 billion of exports in 2019, followed by\nUS$123.6 million for cotton textiles. Among imports, major categories in 2019\nwere machinery (US$1.5 billion), base metals (US$968.3 million), chemicals\n(US$682.3 million), vehicles (US$453.5 million), and plastic and rubber and\nproducts thereof (US$342.9 million).\n\nIn March 2023 the Turkmenistan parliament passed a law adopting the Harmonized\nSystem of tariff nomenclature."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Labour",
    "text": "In 2019, Turkmenistan counted 666,500 employees of large- and medium\nenterprises, and 103,900 employees of non-state (private, mixed public-\nprivate, or foreign) enterprises. The structure of employment was 25.3% in the\nstate sector, 50.3% in the private sector, 22.0% mixed public-private\nenterprises, 0.2% in public associations, 0.4% in cooperatives, and 1.8% in\nforeign-owned enterprises, including joint ventures. According to official\nstatistics, in 2019 77,474 individuals were employed by individual\nentrepreneurs, including self employment.\n\nMajor sectors for employment were:\n\n43.5% in agriculture\n9.8% in manufacturing\n8.4% in education\n7.4% in trade and vehicle repair\n5.8% in construction\n4.3% in transport and storage\n3.6% in health and social work\n2.9% in arts, entertainment\n\nThe average monthly wage in 2019 was 1,685.10 manats per month, up from 943.40\nin 2012 and 507 in 2007.\n\nIn 2004 the labour force was estimated to include more than 2.3 million\nworkers, 48.2 percent of whom worked in agriculture, 37.8 percent in services,\nand 14 percent in industry and construction. Because the state dominates the\neconomy, an estimated 90 percent of workers are in reality effectively state\nemployees. It is believed that downsizing the government workforce, which\nbegan in 2003, increased unemployment in subsequent years. Unemployment in\n2014 was estimated at 11%. In recent years, due to the economic downturn\nlinked to falling hydrocarbon prices, unemployment is estimated to be as high\nas 60 percent, despite official figures of less than four percent."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Privatization",
    "text": "According to official statistics, between 1994 and the end of 2020, 2,628\nformer state-owned properties had been privatized.\n\nThe breakout by type of enterprise privatized was:\n\n845 wholesale and retail trade, vehicle repair\n143 manufacturing\n108 real estate operations\n95 agriculture, forestry, fisheries\n51 transportation and storage\n27 construction\n18 hospitality industry\n1,341 other services\n\nIn March 2021, President Berdimuhamedow ordered conversion of Derýaýollary\nProduction Association, a subordinate unit of the State Service of Maritime\nand River Transportation of Turkmenistan (Türkmendeňizderýaýollary) state\nagency responsible for river and canal transport, into an open joint-stock\ncompany.\n\nAll land remains property of the government, as during the Soviet era."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "9",
    "section_name": "Macro-economic trends",
    "text": "The following table shows the main official economic indicators in 1993–2020\nas provided by the Turkmenistan government to the International Monetary Fund.\n\nYear  | GDP (in bil. US$ PPP)  | GDP per capita (in US$ PPP)  | GDP (in bil. US$ nominal)  | GDP growth (real)  | Inflation (in Percent)  | Government debt (in % of GDP)\n---|---|---|---|---|---|---\n1993  | 10.9  | 2,975  | 15.9  | −10.0 %  | 3,102.4 %  | ...\n1995  | 8.9  | 2,070  | 12.7  | −7.2 %  | 1,005.2 %  | ...\n2000  | 11.6  | 2,554  | 16.8  | 18.6 %  | 23.6 %  | 44 %\n2005  | 27.5  | 5,755  | 39.9  | 13.0 %  | 10.7 %  | 5 %\n2006  | 31.4  | 6,509  | 45.6  | 11.0 %  | 8.2 %  | 3 %\n2007  | 35.8  | 7,335  | 52.1  | 11.1 %  | 6.3 %  | 2 %\n2008  | 41.9  | 8,478  | 60.9  | 14.7 %  | 14.5 %  | 3 %\n2009  | 44.8  | 8,954  | 65.0  | 6.1 %  | −2.7 %  | 2 %\n2010  | 49.6  | 9,740  | 76.5  | 9.2 %  | 4.4 %  | 4 %\n2011  | 58.0  | 11,212  | 88.1  | 14.7 %  | 5.3 %  | 10 %\n2012  | 65.6  | 12,455  | 90.1  | 11.0 %  | 5.3 %  | 18 %\n2013  | 73.5  | 13,687  | 89.5  | 10.2 %  | 6.8 %  | 20 %\n2014  | 82.5  | 15,093  | 94.1  | 10.3 %  | 6.0 %  | 17 %\n2015  | 88.8  | 15,952  | 93.8  | 6.4 %  | 7.4 %  | 22 %\n2016  | 95.5  | 16,922  | 90.5  | 6.2 %  | 3.6 %  | 24 %\n2017  | 81.8  | 14,324  | 100.0  | 6.5 %  | 8.0 %  | 31 %\n2018  | 88.9  | 15,048  | 103.3  | 6.2 %  | 13.3 %  | 31 %\n2019  | 96.2  | 15,766  | 101.6  | 6.3 %  | 5.1 %  | 33 %\n2020  | 99.3  | 15,810  | 99.9  | 1.8 %  | 8.0 %  | 31 %\n\nThe accuracy of GDP figures has been called into doubt by the Asian\nDevelopment Bank, which in 2006 noted, \"According to official statistics, the\neconomy continued to grow rapidly in 2005, but actual growth was likely much\nlower than the official estimate. Government has overstated growth in the\npast.\" The UK government's _Overseas Business Risk_ report for 2021 notes, \"No\nreliable economic data are published in Turkmenistan. Most sources cite\nfigures which the government releases to the international financial\ninstitutions. These do not always square with observation on the ground.\"\nOutside observers have also expressed skepticism about the official figures\nfor the rate of inflation. In the June 2021 _Global Economic Prospects_\nreport, the World Bank excluded Turkmenistan \"[d]ue to lack of reliable data\nof adequate quality\".\n\nAt a session of the Cabinet of Ministers on 11 March 2021, government\nofficials revealed that in \"recent years\" Turkmenistan had borrowed over US$14\nbillion in foreign exchange loans from foreign creditors, of which US$5\nbillion remained outstanding as of 8 March 2021. However, a chart shown on\ntelevision indicated debt in 2021 of US$1.3524 billion. Opposition media\nseized on this figure to estimate GDP of US$12.3 billion based on a statement\nby Central Bank Chairman Rahimberdi Jepbarov that external debt equals 11% of\nGDP.\n\nIn June 2021, official state media reported that debts to China for\nconstruction of natural gas pipelines had been paid in full."
  },
  {
    "chapter_name": "Economy of Turkmenistan",
    "chapter_id": "1",
    "section_number": "10",
    "section_name": "Miscellaneous statistics",
    "text": "**Exchange rates prior to 2009**\n\nDuring the early years of independence, the official exchange rate of the\nTurkmen manat to the US dollar grew dramatically. At the same time, the black-\nmarket exchange rate grew even faster, eventually hovering around 24,000 to\n25,000 manats to the dollar.\n\nManat to dollar exchange rate  Date | Rate\n---|---\nJanuary 1996 | 2,400\nJanuary 1997 | 4,070\nJanuary 1999 | 5,350\nJanuary 2000 | 5,200"
  }
]