[
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "| **This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. _(Learn how and when to remove these messages)_ | | This article **possibly containsoriginal research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. _( April 2013)__(Learn how and when to remove this message)_  \n---|---  \n| This article **needs additional citations forverification**. Please help\nimprove this article by adding citations to reliable sources. Unsourced\nmaterial may be challenged and removed.  \n_Find sources:_ \"Economy of the Netherlands\" – news **·** newspapers **·**\nbooks **·** scholar **·** JSTOR _( February 2014)__(Learn how and when to\nremove this message)_  \n---|---  \n  \n_(Learn how and when to remove this message)_  \n  \nDutch exports in 2006 The labour productivity level of the Netherlands is one\nof highest in Europe. OECD, 2012 Part-time employment rate (%) in OECD\ncountries. The Netherlands has the highest rate.\n\nThe **economy of the Netherlands** is a highly developed market economy\nfocused on trade and logistics, manufacturing, services, innovation and\ntechnology and sustainable and renewable energy. It is the world's 18th\nlargest economy by nominal GDP and the 28th largest by purchasing power parity\n(PPP) and is the fifth largest economy in European Union by nominal GDP. It\nhas the world's 11th highest per capita GDP (nominal) and the 13th highest per\ncapita GDP (PPP) as of 2023 making it one of the highest earning nations in\nthe world. Many of the world's largest tech companies are based in its capital\nAmsterdam or have established their European headquarters in the city, such as\nIBM, Microsoft, Google, Oracle, Cisco, Uber and Netflix. Its second largest\ncity Rotterdam is a major trade, logistics and economic center of the world\nand is Europe's largest seaport. Netherlands is ranked fifth on global\ninnovation index and fourth on the Global Competitiveness Report. Among OECD\nnations, Netherlands has a highly efficient and strong social security system;\nsocial expenditure stood at roughly 25.3% of GDP.\n\nThe Netherlands has a prosperous and open economy, which depends heavily on\nforeign trade. The economy is noted for stable industrial relations, fairly\nlow unemployment and inflation, a sizable current account surplus (which,\ncompared to the size of the country, is even more than Germany) and an\nimportant role as a European transportation hub; Rotterdam is the biggest port\nin Europe; and Amsterdam has one of the biggest airports in the world.\nIndustrial activity is predominantly in food processing, chemicals, petroleum\nrefining, high-tech, financial services, the creative sector and electrical\nmachinery. Its highly mechanized agricultural sector employs no more than 2%\nof the labor force but provides large surpluses for the food-processing\nindustry and for exports. The Netherlands, along with 11 of its EU partners,\nbegan circulating the euro currency on 1 January 2002.\n\nThe Netherlands has had steady natural gas resources since 1959, when a\nwellspring was discovered. Currently the Netherlands accounts for more than\n25% of all natural gas reserves in the European Union. Over the following\ndecades, the sale of natural gas generated a significant rise in revenue for\nthe Netherlands. However, the unforeseen consequences of the country's energy\nwealth originally impacted the competitiveness of other sectors of the\neconomy, leading to the theory of Dutch disease, after the discovery of the\nvast Groningen gas field.\n\nThe Netherlands is a \"conduit country\" that helps to funnel profits from high-\ntax countries to tax havens. It has been ranked as the 7th largest tax haven\nin the World.\n\nThe stern financial was abandoned in 2009, because of the then-current credit\ncrises. The relatively large banking sector was partly nationalized and bailed\nout through government interventions. The unemployment rate dropped to 5.0% in\nthe summer of 2011, but increased with a sharp rate to 7.3% in May 2013, and\n6.8% in 2015. It dropped again to 3.9% in March 2018. The state budget deficit\nwas about 2.2% in 2015, well below the norm of 3.0% in the EU. In 2016, the\nstate budget showed a surplus of 0.4%. It was expected to grow to a surplus of\nover 1.0% in 2017. Historically, the Dutch introduced and invented the stock\nmarket, which initially focused on merchandise trading through the Dutch East\nIndia Company. The Netherlands is a founding member of the European Union, the\nOECD and the World Trade Organization."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "History",
    "text": "After declaring its independence from the empire of Philip II of Spain in\n1581, the Netherlands experienced almost a century of explosive economic\ngrowth. A technological revolution in capital, due to Protestant traders of\nFlanders who fled to the Netherlands, helped the young Republic become the\ndominant trade power by the mid-17th century. In 1670 the Dutch merchant\nmarine totalled 568,000 tons of shipping—about half the European total. The\nmain reasons for this were the dominance of the Amsterdam Entrepôt in European\ntrade, and that of the Dutch East India Company (or Verenigde Oost-Indische\nCompanie – VOC) and West India Companies in intercontinental trade. These\ncompanies were based on the English model and the success of England's joint-\nstock enterprises and trading guilds.\n\nBeside trade, an early \"industrial revolution\" (powered by wind, water and\npeat), land reclamation from the sea, and agricultural revolution, helped the\nDutch economy achieve the highest standard of living in Europe (and presumably\nthe world) by the middle of the 17th century. Affluence facilitated what is\nknown as the Dutch Golden Age. This economic boom abruptly came to an end by a\ncombination of political-military upheavals and adverse economic developments\naround 1670. Still the Netherlands kept a high level of prosperity, due to\ntrade and agriculture.\n\nTowards the 1800s, the Netherlands did not industrialize as rapidly as some\nother countries in Europe. One explanation for this is that the Netherlands\nwere struggling to come to terms with having lost their dominant economical\n(based mainly on trade and agriculture) and political position in the world.\nGriffiths argues that government policies made possible a unified Dutch\nnational economy in the 19th century. They included the abolition of internal\ntariffs and guilds; a unified coinage system; modern methods of tax\ncollection; standardized weights and measures; and the building of many roads,\ncanals, and railroads.\n\nThe rest of Europe in the 19th century saw the gradual transformation of the\nNetherlands into a modern middle-class industrial society. The number of\npeople employed in agriculture decreased while the country made an effort to\nrevive its stake in the highly competitive industrial and trade business. The\nNetherlands lagged behind Belgium until the late 19th century in\nindustrialization, then caught up by about 1920. Major industries included\ntextiles and (later) the great Philips industrial conglomerate. Rotterdam\nbecame a major shipping and manufacturing center. Poverty slowly declined and\nbegging largely disappeared along with steadily improving working conditions\nfor the population.\n\nIn 1959, the Netherlands discovered large natural gas fields. The export of\nnatural gas led to large windfall profits. However, as an unforeseen\nconsequence, these were believed to have led to a decline in the manufacturing\nsector in the Netherlands.",
    "openai_summarised_points": [
      "• After declaring independence from the empire of Philip II of Spain in 1581, the Netherlands experienced nearly a century of explosive economic growth.",
      "• A technological revolution in capital, driven by Protestant traders from Flanders who fled to the Netherlands, contributed significantly to the young Dutch Republic becoming the dominant trade power by the mid-17th century.",
      "• By 1670, the Dutch merchant marine totaled 568,000 tons of shipping, which constituted about half of the total European shipping tonnage.",
      "• The dominance of the Amsterdam Entrepôt in European trade and the influential roles of the Dutch East India Company (Verenigde Oost-Indische Companie – VOC) and the Dutch West India Company in intercontinental trade were primary reasons for Dutch maritime supremacy.",
      "• These trading companies were modeled after English joint-stock enterprises and trading guilds, reflecting the success of England’s commercial institutions.",
      "• In addition to trade, the Netherlands experienced an early \"industrial revolution\" powered by wind, water, and peat energy sources, alongside significant land reclamation from the sea and an agricultural revolution.",
      "• By the mid-17th century, these combined factors enabled the Dutch economy to achieve the highest standard of living in Europe, and arguably the world, fostering what is known as the Dutch Golden Age.",
      "• This period of economic prosperity abruptly ended around 1670 due to a combination of political-military upheavals and adverse economic developments, though the Netherlands maintained a high level of prosperity through continued trade and agriculture.",
      "• Approaching the 1800s, the Netherlands industrialized more slowly than some other European countries, partly because it was adjusting to the loss of its dominant economic and political position, which had been primarily based on trade and agriculture.",
      "• According to Griffiths, 19th-century government policies facilitated the creation of a unified Dutch national economy by abolishing internal tariffs and guilds, introducing a unified coinage system, modernizing tax collection, standardizing weights and measures, and constructing extensive infrastructure including roads, canals, and railroads.",
      "• Throughout the 19th century, the Netherlands gradually transformed into a modern middle-class industrial society, with a decline in agricultural employment and efforts to regain competitiveness in industry and trade.",
      "• The Netherlands lagged behind Belgium in industrialization until the late 19th century but caught up by approximately 1920.",
      "• Major industries during this period included textiles and the Philips industrial conglomerate, with Rotterdam emerging as a significant shipping and manufacturing center.",
      "• Social conditions improved steadily during this time, with poverty declining, begging largely disappearing, and working conditions for the population improving.",
      "• In 1959, the Netherlands discovered large natural gas fields, leading to substantial windfall profits from natural gas exports.",
      "• However, these profits are believed to have inadvertently contributed to a decline in the Dutch manufacturing sector as an unforeseen economic consequence."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:47.146043",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2928,
      "bullet_points_count": 16
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Government",
    "text": "While the private sector is the cornerstone of the Dutch economy, governments\nat different levels have a large part to play. Public spending, excluding\nsocial security transfer payments, was at 28% of GDP in 2011. Total tax\nrevenue was 38.7% of GDP in 2010, which was below the EU average. In addition\nto its own spending, the government plays a significant role through the\npermit requirements and regulations pertaining to almost every aspect of\neconomic activity. The government combines a rigorous and stable microeconomic\npolicy with wide-ranging structural and regulatory reforms. The government has\ngradually reduced its role in the economy since the 1980s. Privatization and\nderegulation is still continuing. With regards to social and economic policy,\nthe government cooperates with its so called social partners (trade unions and\nemployers' organizations). The three parties come together in the Social-\nEconomic Council (‘Sociaal Economische Raad’), the main platform for social\ndialogue.",
    "openai_summarised_points": [
      "• The Dutch economy is primarily driven by the private sector, yet governments at various levels play a significant role in economic activities.",
      "• In 2011, public spending in the Netherlands, excluding social security transfer payments, accounted for 28% of the country's Gross Domestic Product (GDP).",
      "• Total tax revenue in the Netherlands was 38.7% of GDP in 2010, a figure that was below the average tax revenue across the European Union (EU).",
      "• Beyond direct public expenditure, the Dutch government exerts substantial influence on the economy through permit requirements and regulatory frameworks that affect nearly every aspect of economic activity.",
      "• The government maintains a rigorous and stable microeconomic policy while simultaneously implementing broad structural and regulatory reforms to enhance economic performance.",
      "• Since the 1980s, the Dutch government has progressively reduced its direct involvement in the economy, emphasizing privatization and deregulation as ongoing processes.",
      "• Social and economic policy in the Netherlands is characterized by cooperation between the government and its social partners, which include trade unions and employers' organizations.",
      "• These three parties—the government, trade unions, and employers' organizations—collaborate within the Social-Economic Council (Sociaal Economische Raad), which serves as the primary platform for social dialogue in the country."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:43.355940",
      "openai_model": "gpt-4.1-mini",
      "content_length": 999,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1",
    "section_name": "Social security system",
    "text": "The Dutch social security is very comprehensive and multi-\nfaceted,[_clarification needed_] and is divided into the national security\n(_Volksverzekering)_ and the employee insurance (_Werknemersverzekering)._\nWhereas the first covers all living in the Netherlands and the social benefits\nprovided, the latter provides employment-related benefits. All living in the\nNetherlands are required to pay into the social security system, including\nresidents from outside the Netherlands, with a few exceptions.\n\nThe Volksverzekering is compulsory for all and covers the residents under\ndifferent forms of national insurance:\n\n* Long-term care under the Long-Term Care Act (_Wet Langdurige Zorg (WLZ)) (_ formerly known as The Exceptional Medical Expenses Act (Algemen Wet Bijzondere Ziektekosten (AWBZ)))\n* Pension care under the General Old Age Pensions Act (_Algemene Ouderdomswet (AOW))_\n* Survivor benefits under the General Surviving Relatives Act (_Algemene nabestaandenwet( ANW)) (formerly known as _The General Widow's and Orphans’ Act (Algemene Weduwen-en Wezenwet (AWW)))\n* Child benefits under the General Family Allowances Act (_Algemene Kinderbijslagwet (AKW))_\n\nIt is overseen by the Social Insurance Bank (_Sociale Verzekeringsbank (SVB))_\nand financed through earning-related contributions of employers and employees\nup until a maximum income-ceiling. Whilst employed persons get their\ncontribution deducted automatically from their wage, the unemployed pay by\nthemselves. The AKW is financed by employers, whereas the AOW is financed by\nthe employees. The AOW, additionally, is financed by a small government\nsubsidy.\n\nThe _Werknemersverzekering_ is compulsory for all employed people within the\nNetherlands. It includes the coverage of employees in the following areas:\n\n* Unemployment benefits under the Unemployment Insurance Act (_Werkloosheidswet (WW))_\n* Sick leave under the Sickness Benefits Act (_Ziektewet (ZW))_\n* Disability benefits under the Disablement Insurance Act (_Wet werk en inkomen naar arbeidsvermogen_ _(WIA))_\n\nThe financing for the _Werknemersverzekering_ is automatically deducted from\nthe employee's income by the employer.",
    "openai_summarised_points": [
      "• The Dutch social security system is comprehensive and multi-faceted, divided into two main categories: the national security (_Volksverzekering_) and the employee insurance (_Werknemersverzekering_).",
      "• The _Volksverzekering_ covers all residents living in the Netherlands and provides various social benefits, while the _Werknemersverzekering_ offers employment-related benefits specifically for employed individuals.",
      "• All persons living in the Netherlands, including non-resident residents, are required to contribute to the social security system, with only a few exceptions.",
      "• The _Volksverzekering_ is compulsory for all residents and includes coverage under several national insurance schemes:",
      "• Long-term care under the Long-Term Care Act (_Wet Langdurige Zorg (WLZ)_) which was formerly known as The Exceptional Medical Expenses Act (_Algemene Wet Bijzondere Ziektekosten (AWBZ)_).",
      "• Pension care under the General Old Age Pensions Act (_Algemene Ouderdomswet (AOW)_).",
      "• Survivor benefits under the General Surviving Relatives Act (_Algemene nabestaandenwet (ANW)_), formerly known as The General Widow's and Orphans’ Act (_Algemene Weduwen-en Wezenwet (AWW)_).",
      "• Child benefits under the General Family Allowances Act (_Algemene Kinderbijslagwet (AKW)_).",
      "• The _Volksverzekering_ is overseen by the Social Insurance Bank (_Sociale Verzekeringsbank (SVB)_).",
      "• Financing of the _Volksverzekering_ is through earnings-related contributions from both employers and employees, subject to a maximum income ceiling.",
      "• Contributions for employed persons are automatically deducted from their wages, whereas unemployed individuals must pay their contributions independently.",
      "• The _AKW_ (child benefits) is financed by employers, while the _AOW_ (old age pension) is financed by employees and supplemented by a small government subsidy.",
      "• The _Werknemersverzekering_ is mandatory for all employed persons in the Netherlands and covers:",
      "• Unemployment benefits under the Unemployment Insurance Act (_Werkloosheidswet (WW)_).",
      "• Sick leave benefits under the Sickness Benefits Act (_Ziektewet (ZW)_).",
      "• Disability benefits under the Disablement Insurance Act (_Wet werk en inkomen naar arbeidsvermogen (WIA)_).",
      "• Financing for the _Werknemersverzekering_ is automatically deducted from employees’ income by their employers."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:49.106055",
      "openai_model": "gpt-4.1-mini",
      "content_length": 2159,
      "bullet_points_count": 17
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.0.1",
    "section_name": "Coverage",
    "text": "The unemployment benefits in the Netherlands, as set out under the WW, covers\nalmost all employees, that are employees based on a working-contract. Excluded\nfrom the WW are the following: self-employed, nationally employed, persons\nworking less than four days a week, heads of stockholders and voluntary\nworkers that earn up to €150 per year.",
    "openai_summarised_points": [
      "• The unemployment benefits in the Netherlands are governed by the WW (Werkloosheidswet) legislation.",
      "• The WW unemployment benefits cover almost all employees who are employed based on a formal working contract.",
      "• Certain groups are excluded from the WW unemployment benefits coverage, including self-employed individuals.",
      "• Nationally employed persons are also excluded from the WW unemployment benefits.",
      "• Persons working less than four days per week do not qualify for WW unemployment benefits.",
      "• Heads of stockholders are excluded from the WW unemployment benefits coverage.",
      "• Voluntary workers earning up to €150 per year are not covered under the WW unemployment benefits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:40.693465",
      "openai_model": "gpt-4.1-mini",
      "content_length": 342,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.0.2",
    "section_name": "Right to benefits",
    "text": "To profit from the benefit the unemployed has to submit an application to the\nEmployee Insurance Agency (_Uitvoeringsinstituut Werknemersverzekeringen\n(UWV))_ within one week of becoming unemployed and additionally has to\nregister as job-seeker. The WW only covers employees with a sufficient work\nhistory, meaning that an applicant has to have been working for at least 26\nweeks in the past 36 weeks before becoming unemployed. If so, the working-\nweeks requirement is met. Moreover, the employee is only eligible to\nunemployment benefits if the unemployment has not been due to his own fault\n(e.g. own termination of the job contract).",
    "openai_summarised_points": [
      "• To receive unemployment benefits in the Netherlands, the unemployed individual must submit an application to the Employee Insurance Agency (Uitvoeringsinstituut Werknemersverzekeringen, UWV) within one week of becoming unemployed.",
      "• In addition to applying to the UWV, the individual must also register as a job-seeker to qualify for benefits.",
      "• The unemployment benefit known as WW is only available to employees who have a sufficient work history, specifically requiring that the applicant has worked for at least 26 weeks within the 36 weeks prior to becoming unemployed.",
      "• Meeting the requirement of 26 working weeks out of the last 36 weeks is necessary to fulfill the working-weeks eligibility criterion for unemployment benefits.",
      "• Eligibility for unemployment benefits is contingent upon the unemployment not being caused by the employee’s own fault, such as voluntarily terminating the employment contract."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:41.721256",
      "openai_model": "gpt-4.1-mini",
      "content_length": 637,
      "bullet_points_count": 5
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.0.3",
    "section_name": "Benefits",
    "text": "The benefits received through the WW are earnings-related and amount to 75% of\nthe previous daily earnings (based on 5 working days per week) for the\nduration of two months. After those two months the benefits reduce to 70%.\nPart-time work is taken into account with a calculation of parts of the\nworking hours.[_clarification needed_] If this benefit is less than the\nminimum income, the benefit can be supplemented under the Additional\nAllowances Act (_Toeslagenwet_). If there has been a change of employment, all\njobs in the previous twelve months are included in the calculation of the\nbenefits. To continue to receive benefits, the individual needs to be actively\nlooking for work. Moreover, one needs to participate in e-coaching three and\ntwelve months after the start of unemployment. After one year of unemployment\none must register with an employment agency.",
    "openai_summarised_points": [
      "• The unemployment benefits under the WW (Werkloosheidswet) are earnings-related and initially amount to 75% of the previous daily earnings, calculated based on a five-day working week, for the first two months of unemployment.",
      "• After the initial two-month period, the unemployment benefits decrease to 70% of the previous daily earnings.",
      "• Part-time work is factored into the benefit calculation by proportionally adjusting for the number of working hours, although the exact method requires clarification.",
      "• If the calculated unemployment benefit falls below the minimum income threshold, the benefit may be supplemented under the Additional Allowances Act (Toeslagenwet).",
      "• In cases where there has been a change of employment, all jobs held within the previous twelve months are considered in the calculation of the unemployment benefits.",
      "• To maintain eligibility for receiving unemployment benefits, the individual must be actively seeking employment.",
      "• The unemployed individual is required to participate in e-coaching sessions at three months and again at twelve months after the start of unemployment.",
      "• After one year of unemployment, the individual must register with an employment agency to continue receiving benefits."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:45.715503",
      "openai_model": "gpt-4.1-mini",
      "content_length": 869,
      "bullet_points_count": 8
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.1",
    "section_name": "Labour market and social welfare",
    "text": "The Dutch labour market has relatively strict regulations for employers on\nfiring employees, although by June 2014 the House of Representatives has\nagreed to loosen these regulations.[_needs update_] Due to the costs of\nemployees and costs of firing them, a large part of the working force (about\n15% of the working force) is an independent one person company (ZZP). They are\nindependent and get paid by delivery without higher social\ncosts.[_clarification needed_] Another big part of the workforce is hired as\ntemporary workforce. State unemployment benefits in the form of a 70% benefit\nof the employee's last-earned salary for up to three years (with a maximum of\nroughly 2500 euros per month) are available for fired employees, provided that\nthey have worked for a certain minimum time period, usually 26 weeks.\nMoreover, the self-employed individuals (zelfstandigen zonder personeel (ZZP))\nare not automatically covered under the _Werknemersverzekeringen_ , and are\nnot obligated to enroll into unemployment, sickness or disabilities insurance.\nSelf-employed individuals are therefore required to enroll themselves with\nprivate insurance companies. The Dutch Government is however, working hard to\ncombat bogus self-employment by applying significant changes and tightening of\nrules under Wet Deregulering Beoordeling Arbeidsrelaties (DBA). .",
    "openai_summarised_points": [
      "• The Dutch labour market is characterized by relatively strict regulations for employers regarding the dismissal of employees, although the House of Representatives agreed in June 2014 to loosen these regulations.",
      "• Due to the high costs associated with employing and firing workers, approximately 15% of the Dutch workforce operates as independent one-person companies, known as zelfstandigen zonder personeel (ZZP), who are paid per delivery without incurring higher social costs.",
      "• A significant portion of the workforce is also employed as temporary workers, reflecting the flexible nature of employment contracts in the Netherlands.",
      "• State unemployment benefits provide fired employees with 70% of their last-earned salary for up to three years, with a maximum monthly benefit of roughly 2,500 euros, contingent on having worked a minimum qualifying period, usually 26 weeks.",
      "• Self-employed individuals (ZZP) are not automatically covered under the Dutch social insurance schemes known as Werknemersverzekeringen and are not required to enroll in unemployment, sickness, or disability insurance.",
      "• Consequently, self-employed persons must obtain private insurance coverage independently to protect against unemployment, sickness, and disability risks.",
      "• The Dutch Government is actively addressing the issue of bogus self-employment by implementing significant regulatory changes and tightening rules under the Wet Deregulering Beoordeling Arbeidsrelaties (DBA) legislation to better distinguish genuine self-employment from disguised employment relationships."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:46.221434",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1348,
      "bullet_points_count": 7
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.2",
    "section_name": "Age of retirement",
    "text": "Under the AOW (General Old Age Pensions Act) of 1956, every Dutch citizen was\nentitled to a state pension from the age of 65. However the act was amended in\n2012 to increase the pension age in several stages up to 67 in 2024. Married\ncouples and those who live together receive 50% of minimum wage per person,\nand a single person receives 70% of minimum wage. Most (about 70%) earn an\nextra pension from private pension funds. Employees are obliged to participate\nin the sector pension funds.[_clarification needed_] The total amount of\npension funds at the end of 2009 was some 664 billion euro and by the end of\n2019 this had increased to 1560 billion euro, for a population of just over 17\nmillion. Employees receive on average about 70% of their final salary. During\nthe economic crisis[_which?_] and because of low interest rates, pension funds\nhave had difficulty keeping up with inflation.",
    "openai_summarised_points": [
      "• The General Old Age Pensions Act (AOW) of 1956 established that every Dutch citizen was entitled to a state pension starting at age 65.",
      "• In 2012, the AOW was amended to gradually increase the pension age in several stages, reaching 67 years by 2024.",
      "• Under the AOW, married couples and cohabiting partners receive a pension amounting to 50% of the minimum wage per person.",
      "• Single individuals receive a pension equivalent to 70% of the minimum wage under the AOW.",
      "• Approximately 70% of Dutch citizens earn an additional pension from private pension funds beyond the state pension.",
      "• Employees in the Netherlands are required to participate in sector-specific pension funds, although the exact details of this obligation require clarification.",
      "• The total assets held by Dutch pension funds amounted to approximately 664 billion euros at the end of 2009.",
      "• By the end of 2019, the total pension fund assets had increased substantially to 1,560 billion euros, serving a population of just over 17 million people.",
      "• On average, employees receive about 70% of their final salary as pension income from combined sources.",
      "• Pension funds have faced challenges in maintaining returns that keep pace with inflation due to the economic crisis (unspecified) and persistently low interest rates."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:48.960045",
      "openai_model": "gpt-4.1-mini",
      "content_length": 896,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.3",
    "section_name": "Inequality and redistribution",
    "text": "With a Gini coefficient of 25.1 (2013) the income inequality is relatively low\nin the Netherlands. However, the inequality when measured in distributions of\nhousehold wealth is high, where the top 1% owns 24% of all net wealth, and the\ntop 10% own 60%. Moreover, rather large wealth disparities persist in the\nNetherlands in relation to age, where those under 35 years-of-age own 10% as\nmuch as older workers. This is a consequence from the low taxation of home\nownership and a generous mortgage interest deductibility, which benefit the\nwealthier households. Due to the generous pensions the pension-related savings\nare the most important part of wealth in the Netherlands, yet are not subject\nto capital income taxation, which increases the inequality. The taxation comes\nas income tax when the saved pension is paid out. People having earned minimum\nwages only, will not build up any pension. The idea behind a pension is to\nhave a net income after retirement that is comparable to before retirement.\nThe AOW, the Dutch retirement law, guarantees an income up to 70% of minimum\nwage per person. Therefore, only people earning more than minimum wage need to\nsave to ensure comparable income after retirement.",
    "openai_summarised_points": [
      "• In 2013, the Netherlands exhibited relatively low income inequality, with a Gini coefficient of 25.1.",
      "• Despite low income inequality, wealth inequality in the Netherlands is high, with the top 1% owning 24% of all net wealth and the top 10% owning 60%.",
      "• Significant wealth disparities exist across age groups, as individuals under 35 years of age possess only 10% of the wealth owned by older workers.",
      "• The wealth inequality is partly attributed to the low taxation on home ownership and the generous mortgage interest deductibility, which disproportionately benefits wealthier households.",
      "• Pension-related savings constitute the most important component of wealth in the Netherlands due to the country's generous pension system.",
      "• Pension savings are not subject to capital income taxation during the accumulation phase, which contributes to increased wealth inequality.",
      "• Taxation on pensions occurs as income tax when the saved pension funds are paid out during retirement.",
      "• Individuals earning only minimum wages typically do not accumulate pension savings.",
      "• The Dutch retirement law, known as AOW, guarantees a retirement income up to 70% of the minimum wage per person.",
      "• Consequently, only those earning above the minimum wage need to save additional funds to maintain a net income after retirement comparable to their pre-retirement income."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:51.035568",
      "openai_model": "gpt-4.1-mini",
      "content_length": 1210,
      "bullet_points_count": 10
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.1.4",
    "section_name": "Home mortgage interest deduction",
    "text": "The Netherlands was[_when?_] one of the few countries in the world where the\ninterest paid on mortgages is almost fully deductible from income tax. Since\n2013 big changes were made. The conditions allowing a borrowing of more than\n116% of the value of the home were reduced to 106% and are still continuously\nbeing reduced every year. The deduction is also capped to 50.5% and reducing\nevery year. Together with the after-effects of the Great Recession the result\nwas a housing crisis, with a decrease of prices almost 25% percent in some\nareas. Recent years have shown a recovery of 10% to even 20% per year in the\nmost popular cities.\n\nThe Service sector accounts for more than half of the national income,\nprimarily in transportation, distribution and logistics, financial areas,\nsoftware development and the creative industry. The breadth of service\nproviders in financial services has contributed to the Netherlands achieving a\nDAW Index score of 5 in 2012. Industrial activity is dominated by the\nmachinery, electronics/high tech industry, metalworking, oil refining,\nchemical, and food-processing industries. Construction amounts to about 6% of\nGDP. Agriculture and fishing, although visible and traditional Dutch\nactivities, account for just 2%.\n\nThe Netherlands continues to be one of the leading European nations for\nattracting foreign direct investment and is one of the five largest investors\nin the United States. The economy experienced a slowdown in 2005, but in 2006\nrecovered to the fastest pace in six years on the back of increased exports\nand strong investment. The pace of job growth reached 10-year highs in 2007.\nThe Netherlands is the fifth-most competitive economy in the world, according\nto the World Economic Forum's Global Competitiveness Report."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.2",
    "section_name": "Agriculture",
    "text": "In 2018, in addition to smaller productions of other agricultural products,\nthe Netherlands produced:\n\n* 1.2 million tons of onion;\n* 14 million tons of cow milk;\n* 247 thousand tons of barley;\n* 269 thousand tons of apple;\n* 295 thousand tons of lettuce;\n* 300 thousand tons of mushroom and truffle;\n* 355 thousand tons of bell pepper;\n* 402 thousand tons of pear;\n* 410 thousand tons of cucumber;\n* 538 thousand tons of carrot;\n* 6.0 million tonnes of potatoes (10th largest producer in the world);\n* 6.5 million tons of sugar beet, which is used to produce sugar and ethanol;\n* 910 thousand tons of tomato;\n* 961 thousand tons of wheat.",
    "openai_summarised_points": [
      "• In 2018, the Netherlands produced 1.2 million tons of onions as part of its agricultural output.",
      "• The country produced 14 million tons of cow milk in 2018, highlighting its significant dairy industry.",
      "• Barley production in the Netherlands reached 247 thousand tons in 2018.",
      "• Apple production amounted to 269 thousand tons in the same year.",
      "• Lettuce production was recorded at 295 thousand tons in 2018.",
      "• The Netherlands produced 300 thousand tons of mushrooms and truffles in 2018.",
      "• Bell pepper production totaled 355 thousand tons during 2018.",
      "• Pear production reached 402 thousand tons in the Netherlands in 2018.",
      "• Cucumber production was 410 thousand tons in 2018.",
      "• Carrot production amounted to 538 thousand tons in the Netherlands in 2018.",
      "• Potato production was 6.0 million tonnes in 2018, making the Netherlands the 10th largest potato producer globally.",
      "• Sugar beet production reached 6.5 million tons in 2018, with the crop being used for sugar and ethanol production.",
      "• Tomato production in the Netherlands was 910 thousand tons in 2018.",
      "• Wheat production totaled 961 thousand tons in the Netherlands in 2018."
    ],
    "processing_metadata": {
      "processed_timestamp": "2025-08-01T12:14:52.680410",
      "openai_model": "gpt-4.1-mini",
      "content_length": 639,
      "bullet_points_count": 14
    }
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.3",
    "section_name": "Natural gas",
    "text": "Natural gas concessions in the Netherlands. Today the Netherlands accounts for\nmore than 25% of all Natural Gas reserves in the EU. Station Wildervank of the\nGroningen natural gas field, which transformed the Netherlands economy after\nits discovery in 1959, leading to the theory of Dutch disease\n\nThe discovery of the large Groningen natural gas field in 1959 and the massive\nwindfalls accrued over subsequent decades, were believed to have led to a\ndecline in the manufacturing sector in the Netherlands, leading to the theory\nof Dutch disease.\n\nWhile its oil reserves in the North Sea are of little importance, the\nNetherlands have an estimated 25% of natural gas reserves in the EU. Natural\ngas reserves of the Netherlands are estimated (as of 2014) to be about 600\nbillion cubic feet, or about 0.3% of the world total. In 2014–2015 the\ngovernment decided to reduce the production of gas in the province Groningen\nsignificantly due to problems of sinking ground, differential settlement\nlevels and tremors (small earth quakes) causing damages to properties, end\n2018 the government decided to completely abandon the gas production in the\nprovince of Groningen by reducing the production slightly each year, the\nproduction was expected to come to a halt entirely by 2028. On June 23, 2023,\nthe government decided to close the remaining five production facilities as of\nOctober 1, 2023. The possibility of reopening one or more facilities is being\nkept open, citing the uncertain international situation and possibly very cold\nweather as possible reasons for this. All wells will be permanently closed and\ndismantled as of October 1, 2024.\n\nTo reduce its greenhouse emissions, the government of the Netherlands is\nsubsidizing a transition away from natural gas for all homes in the country by\n2050. In the Netherlands, 98% of enterprises are reducing greenhouse gas\nemissions, beating the EU average of 89%. However, only 48% of Dutch firms set\nand monitor their own emission targets. Dutch enterprises mostly cut emissions\nthrough waste reduction or recycling (86%), as well as energy efficiency\nprogrammes (76%).\n\nIn the Netherlands, 78% of enterprises have invested in reducing carbon\nemissions and mitigating the impact of weather disasters as of 2023. Six out\nof ten (60%) plan to invest in these areas during the next three years. The\nnumbers for 'already invested' and 'intend to invest' above the EU average\n(56% and 54%, respectively). The largest invested is in trash reduction or\nrecycling (86% of Dutch firms).\n\nDutch companies are more likely to see the transition to stronger climate laws\nas an opportunity (39% vs 23% from other European firms)."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "2.4",
    "section_name": "Nuclear energy",
    "text": "Researchers in the Netherlands began studying nuclear energy in the 1930s and\nbegan construction of research reactor Dodewaard in 1955. Researchers’ goal\nwas to introduce nuclear power technology by 1962 and replace fossil fuels. In\n1968, a test nuclear reactor was attached to the power grid. This unit was\nshut down in 1997. In the 1970s, the Dutch chose a policy that required\nreprocessing all spent nuclear fuel. In 1984, the government decided to create\na long-term (100 years) storage facility for all intermediate and low-level\nradioactive waste and research strategies for ultimate disposal. In September\n2003, the Central Organization for Radioactive Waste created an interim\nstorage facility for high-level waste. The Netherlands' only commercial\nnuclear reactor is Borssele, which became operational in 1973 and as of\n2011[update] produces about 4% of the country's electricity. The older\nDodewaard nuclear power plant was a test reactor that later got attached to\nthe national grid but was closed in 1997. A 2MW research reactor known as\nReactor Institute Delft (RID) is located in Delft, as part of the physics\ndepartment of Delft University of Technology. This reactor is not meant for\nenergy provision but used as a neutron and positron source for research.\n\nIn 1994, the States General of the Netherlands voted to phase out nuclear\npower after a discussion of nuclear waste management. In 1997, the power\nstation at Dodewaard was shut down and the government decided it was planning\nto end Borssele's operating license in 2003. This has since been postponed to\n2034, if it complied with the highest safety standards.[_citation needed_]\nAfter the 2010 election, the new government was open to expanding nuclear\npower. Both of the companies that share ownership of Borssele are proposing to\nbuild new reactors. In January 2012, Delta announced it postpones any decision\nto start building a second nuclear power plant."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Tourism",
    "text": "In 2011, the Netherlands was visited by 11.3 million foreign tourists. In\n2012, the Dutch tourism industry contributed 5.4% in total to the country's\nGDP and 9.6% in total to its employment. With its global ranking of 147th and\n83rd place for total contribution to respectively GDP and employment, tourism\nis a relatively small sector of the Dutch economy. North Holland was by far\nthe most popular province for foreign tourists in 2011. Out of all 11.3\nmillion tourists, 6 million visited North Holland. South Holland took the\nsecond place with 1.4 million. Germans, Britons and Belgians made up the\nmajority of foreign tourists, respectively 3, 1.5 and 1.4 million. As of 2020,\nthere are nine World Heritage Sites in the Netherlands. The Netherlands are\nwell known for their art and rich historical heritage.\n\nIn the fast food restaurant and snackbar sector McDonald's dominates and\nemploys the most staff, followed by Burger King, FEBO established as only\nnational player, and Kwalitaria. Other chains in the Dutch market are\nApplebee's, Pizza Hut, Domino's Pizza, and Kentucky Fried Chicken. The Belgium\nchain Quick retreated from the Dutch market in 2000."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "4",
    "section_name": "Data",
    "text": "The following table shows the main economic indicators in 1980–2021 (with IMF\nstaff estimates in 2022–2027). Inflation under 5% is in green.\n\nYear  | GDP\n(in bn. US$PPP) | GDP per capita\n(in US$ PPP) | GDP\n(in bn. US$nominal) | GDP per capita\n(in US$ nominal) | GDP growth\n(real) | Inflation rate\n(in Percent) | Unemployment\n(in Percent) | Government debt\n(in % of GDP)\n---|---|---|---|---|---|---|---|---\n1980  | 165.0  | 11,708.1  | 193.8  | 13,750.5  | n/a  | n/a  | 3.4%  | 43.6%\n1981  | 179.7  | 12,644.4  | 162.4  | 11,429.7  | -0.5%  | 6.8%  | 4.6%  | 46.9%\n1982  | 188.3  | 13,181.8  | 157.3  | 11,013.6  | -1.3%  | 5.9%  | 6.5%  | 52.5%\n1983  | 199.1  | 13,886.6  | 153.2  | 10,682.3  | 1.8%  | 2.9%  | 8.3%  | 58.5%\n1984  | 212.7  | 14,779.7  | 142.6  | 9,905.0  | 3.1%  | 3.4%  | 8.1%  | 62.0%\n1985  | 225.3  | 15,587.9  | 144.7  | 10,008.0  | 2.7%  | 2.3%  | 7.3%  | 67.2%\n1986  | 237.0  | 16,313.5  | 201.6  | 13,875.2  | 3.1%  | n/a  | 6.5%  | 69.0%\n1987  | 247.4  | 16,926.4  | 246.9  | 16,895.4  | 1.9%  | -1.0%  | 6.3%  | 71.4%\n1988  | 267.8  | 18,202.4  | 264.2  | 17,956.1  | 4.6%  | 0.5%  | 6.2%  | 73.8%\n1989  | 290.8  | 19,643.3  | 260.5  | 17,597.3  | 4.5%  | 1.1%  | 5.7%  | 73.8%\n1990  | 314.3  | 21,105.3  | 321.4  | 21,581.6  | 4.2%  | 2.5%  | 5.1%  | 75.1%\n1991  | 332.9  | 22,178.4  | 331.1  | 22,057.8  | 2.5%  | 3.2%  | 4.8%  | 74.9%\n1992  | 345.9  | 22,863.5  | 366.0  | 24,192.0  | 1.6%  | 2.8%  | 4.9%  | 75.7%\n1993  | 358.6  | 23,530.1  | 355.9  | 23,356.3  | 1.3%  | 1.6%  | 5.5%  | 76.8%\n1994  | 377.3  | 24,590.5  | 382.6  | 24,935.5  | 3.0%  | 2.1%  | 6.2%  | 73.6%\n1995  | 395.8  | 25,664.2  | 452.7  | 29,350.8  | 2.8%  | 1.3%  | 7.7%  | 72.2%\n1996  | 417.2  | 26,925.6  | 450.6  | 29,084.1  | 3.5%  | 1.4%  | 7.1%  | 70.5%\n1997  | 442.7  | 28,440.8  | 417.3  | 26,808.4  | 4.3%  | 1.9%  | 6.1%  | 64.9%\n1998  | 468.6  | 29,936.1  | 438.6  | 28,018.7  | 4.7%  | 1.8%  | 4.9%  | 61.7%\n1999  | 499.1  | 31,671.1  | 447.5  | 28,393.8  | 5.0%  | 2.0%  | 4.1%  | 57.5%\n2000  | 531.9  | 33,528.1  | 417.7  | 26,327.9  | 4.2%  | 2.3%  | 3.7%  | 50.9%\n2001  | 556.5  | 34,811.4  | 431.6  | 26,996.2  | 2.3%  | 5.1%  | 3.1%  | 48.2%\n2002  | 566.4  | 35,170.5  | 473.5  | 29,402.0  | 0.2%  | 3.9%  | 3.7%  | 47.5%\n2003  | 578.5  | 35,727.5  | 579.9  | 35,814.3  | 0.2%  | 2.2%  | 5.9%  | 48.7%\n2004  | 605.8  | 37,263.5  | 658.1  | 40,477.3  | 2.0%  | 1.4%  | 6.8%  | 49.1%\n2005  | 637.6  | 39,104.4  | 685.7  | 42,054.9  | 2.0%  | 1.5%  | 7.0%  | 48.5%\n2006  | 680.0  | 41,633.3  | 734.0  | 44,936.0  | 3.5%  | 1.7%  | 6.1%  | 44.1%\n2007  | 724.8  | 44,306.7  | 848.7  | 51,880.4  | 3.8%  | 1.6%  | 5.3%  | 42.0%\n2008  | 754.7  | 46,003.9  | 951.8  | 58,015.4  | 2.2%  | 2.2%  | 4.8%  | 53.8%\n2009  | 731.7  | 44,383.2  | 870.6  | 52,807.4  | -3.7%  | 1.0%  | 5.4%  | 55.8%\n2010  | 750.4  | 45,274.1  | 848.1  | 51,165.8  | 1.3%  | 0.9%  | 6.1%  | 59.4%\n2011  | 777.9  | 46,703.3  | 905.1  | 54,342.1  | 1.6%  | 2.5%  | 6.1%  | 61.8%\n2012  | 792.0  | 47,341.6  | 839.5  | 50,175.6  | -1.0%  | 2.8%  | 6.8%  | 66.4%\n2013  | 827.5  | 49,314.5  | 877.2  | 52,277.0  | -0.1%  | 2.6%  | 8.2%  | 67.8%\n2014  | 830.3  | 49,337.7  | 892.4  | 53,026.5  | 1.4%  | 0.3%  | 8.3%  | 68.0%\n2015  | 852.1  | 50,418.7  | 765.7  | 45,302.8  | 2.0%  | 0.2%  | 7.9%  | 64.6%\n2016  | 890.4  | 52,440.8  | 783.8  | 46,165.2  | 2.2%  | 0.1%  | 7.0%  | 61.9%\n2017  | 948.2  | 55,509.3  | 833.6  | 48,799.9  | 2.9%  | 1.3%  | 5.9%  | 56.9%\n2018  | 993.8  | 57,839.9  | 914.5  | 53,224.7  | 2.4%  | 1.6%  | 4.9%  | 52.4%\n2019  | 1,031.3  | 59,674.9  | 910.3  | 52,672.5  | 2.0%  | 2.7%  | 4.4%  | 48.5%\n2020  | 1,002.9  | 57,612.5  | 909.1  | 52,222.4  | -3.9%  | 1.1%  | 4.9%  | 54.6%\n2021  | 1,095.4  | 62,685.0  | 1,013.5  | 57,996.9  | 4.9%  | 2.8%  | 4.2%  | 52.3%\n2022  | 1,226.7  | 69,714.5  | 990.6  | 56,297.8  | 4.5%  | 12.0%  | 3.5%  | 48.3%\n2023  | 1,280.5  | 72,363.5  | 1,019.8  | 57,628.6  | 0.8%  | 8.0%  | 3.9%  | 46.4%\n2024  | 1,329.6  | 74,842.4  | 1,077.0  | 60,620.9  | 1.7%  | 2.7%  | 4.0%  | 45.6%\n2025  | 1,376.0  | 77,235.7  | 1,125.5  | 63,173.5  | 1.6%  | 2.3%  | 4.2%  | 46.2%\n2026  | 1,424.2  | 79,717.7  | 1,173.5  | 65,684.3  | 1.6%  | 2.0%  | 4.4%  | 47.2%\n2027  | 1,474.1  | 82,280.9  | 1,223.4  | 68,285.1  | 1.5%  | 2.0%  | 4.6%  | 48.1%"
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "5",
    "section_name": "Companies",
    "text": "In 2022, the sector with the highest number of companies registered in\nNetherlands is Services with 761,749 companies followed by Finance, Insurance,\nand Real Estate and Retail Trade with 693,255 and 101,025 companies\nrespectively.\n\nIn the Netherlands, 91% of enterprises say they have invested appropriately\nduring the past three years (2023 - 2020). This beats the EU average at 82%.\nCompared to other enterprises in the EU, Dutch firms prioritise new goods or\nservices (26% vs. 34% for replacement). In keeping with the EU average of 10%,\njust 7% of enterprises in the Netherlands do not plan to invest. Dutch\ncompanies were hurt by the energy crisis in 2022 - 2023, albeit to a lower\nextent than those elsewhere in the EU. While most companies are concerned\nabout energy prices, just 30% consider it a critical issue. This is half of\nthe EU average (59%).\n\nDutch firms face significant long-term hurdles to investment, including a lack\nof trained people (71%), and high energy prices (66%). Barriers are\ndiminishing, with numbers lower than the EU average and than 2021. For\nexample, the availability of funding is less of an impediment than across the\nEU (23% versus 44%).\n\nIn 2023, one in ten Dutch enterprises (13%) brought new goods, processes, or\nservices to the Dutch or global market. Majority of Dutch firms are also more\ntechnologically oriented than EU peers - almost eight out of ten Dutch firms\n(78%) employed at least one digital technology in 2023. The EU average is 70%.\nThe majority of Dutch firms utilise digital platform technologies (59%),\nrobots (56%), and the Internet of Things (55%), whereas just a small\npercentage use 3D printing (19%) or augmented/VR technology (15%)."
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "6",
    "section_name": "Largest companies",
    "text": "The Netherlands is home to several large multinationals including Heineken,\nAhold, Philips, TomTom, Randstad NV and ING, all of which have their\nheadquarters in Amsterdam. Thousands of companies of non-Dutch origin have\ntheir headquarters in the Netherlands, like EADS, LyondellBasell and IKEA,\nbecause of attractive corporate tax levels.[_citation needed_]\n\nThe Netherlands' biggest companies in the Fortune Global 500 as of 2022 are as\nfollowing:\n\nRank  | Fortune 500\nrank  | Name  | Industry  | Revenue\n(USD millions) | Profits\n(USD millions) | Assets\n(USD millions) | Employees  | Headquarters\n---|---|---|---|---|---|---|---|---\n1  | 29  | Stellantis | Automotive | 176,663.0  | 16,789.1  | 195,297.9  | 281,595  | Amsterdam\n2  | 115  | Ahold Delhaize | Retail | 89,385.6  | 2,655.5  | 51,974.5  | 259,000  | Zaandam\n3  | 200  | Aegon | Financial services | 63,662.7  | 2,341.0  | 532,402.5  | 22,271  | The Hague\n3  | 207  | Airbus | Aerospace and defense | 61,657.5  | 4,981.2  | 121,712.4  | 126,495  | Leiden\n4  | 276  | Louis Dreyfus Company | Food production | 49,569.0  | 697.0  | 23,626.0  | 15,737  | Rotterdam\n5  | 287  | INGKA Holding | Retail  | 47,545.8  | 1,887.1  | 65,010.9  | 174,225  | Leiden\n6  | 305  | LyondellBasell | Chemicals | 46,173.0  | 5,610.0  | 36,742.0  | 19,100  | Rotterdam\n7  | 425  | ING Group | Banking | 33,851.4  | 7,036.1  | 1,079,297.3  | 57,660  | Amsterdam\n8  | 477  | X5 Group | Retail  | 29,921.7  | 580.0  | 17,164.8  | 340,928  | The Hague\n9  | 491  | Randstad NV | Consulting | 29,126.8  | 908.0  | 12,552.5  | 39,530  | Diemen"
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "7",
    "section_name": "Mergers and acquisitions",
    "text": "In the Netherlands 22,484 deals were conducted between 1985 and 2018, with an\noverall value of 2,226.6 billion USD. The year with the most deals was 2000,\nwith 1,169 deals. The year with the highest overall value was 2007, with\nalmost 394.9 billion USD. However this was followed by a drastic slump during\nthe Great Recession.\n\nList of the most important acquisitions within, into and out of the Netherlands  Date announced  | Acquiror  | Target  | Value of\ntransaction\n(USD millions)\n---|---|---|---\nName  | Mid-industry\n[_clarification needed_] | Nation  | Name  | Mid-industry  | Nation\n25 April 2007  | RFS Holdings BV  | Other Financials  | Netherlands  | ABN-AMRO Holding NV  | Banks  | Netherlands  | 98,189.19\n19 March 2007  | Barclays PLC  | Banks  | United Kingdom  | ABN-AMRO Holding NV  | Banks  | Netherlands  | 92,606.80\n28 October 2004  | Royal Dutch Petroleum Co  | Oil & Gas  | Netherlands  | Shell Transport & Trading Co  | Oil & Gas  | United Kingdom  | 74,558.58\n4 August 2015  | Royal Dutch Shell PLC  | Petrochemicals  | Netherlands  | BG Group PLC  | Oil & Gas  | United Kingdom  | 69,445.02\n2 March 2016  | CNAC Saturn (NL) BV  | Chemicals  | Netherlands  | Syngenta AG  | Chemicals  | Switzerland  | 41,840.11\n27 January 2006  | Mittal Steel Co NV  | Metals & Mining  | Netherlands  | Arcelor SA  | Metals & Mining  | Luxembourg  | 32,240.47\n3 September 2017  | PPG Industries Inc  | Chemicals  | United States  | Akzo Nobel NV  | Chemicals  | Netherlands  | 26,560.76\n4 August 2015  | Royal Dutch Shell PLC  | Petrochemicals  | Netherlands  | Royal Dutch Shell PLC  | Petrochemicals  | Netherlands  | 25,000.00\n29 September 2008  | The Netherlands  | National Government  | Netherlands  | Fortis Bank Nederland(Holding)  | Banks  | Netherlands  | 23,137.31\n10 April 2010  | VimpelCom Ltd  | Wireless  | Netherlands  | Weather Investments Srl  | Telecommunications Services  | Italy  | 22,382.31"
  },
  {
    "chapter_name": "Economy of the Netherlands",
    "chapter_id": "1",
    "section_number": "8",
    "section_name": "Caribbean Netherlands",
    "text": "* Economy of Bonaire\n* Economy of Saba\n* Economy of Sint Eustatius\n\n_The wider Dutch Kingdom_\n\n* Economy of Aruba\n* Economy of Curacao\n* Economy of Sint Maarten"
  }
]