[
  {
    "chapter_name": "Economy of Bhutan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Introduction",
    "text": "The **economy of Bhutan** is based on agriculture and forestry, which provide\nthe main livelihood for more than 60% of the population. Agriculture consists\nlargely of subsistence farming and animal husbandry. Rugged mountains dominate\nthe terrain and make the building of roads and other infrastructure difficult.\nBhutan is among the richest by gross domestic product (nominal) per capita in\nSouth Asia, at $3,491 as of 2022, but it still places 153rd, and among the\npoorest in the world. The total gross domestic product is only $2.898 billion,\nand 178th according to IMF.\n\nBhutan's economy is closely aligned with India's through strong trade and\nmonetary links and dependence on India's financial assistance. Most production\nin the industrial sector is of the cottage industry type. Most development\nprojects, such as road construction, rely on Indian migrant labour. Model\neducation, social, and environment programs are underway with support from\nmultilateral development organisations.\n\nEach economic program takes into account the government's desire to protect\nthe country's environment and cultural traditions. For example, the\ngovernment, in its cautious expansion of the tourist sector, encourages visits\nby upscale, environmentally conscientious tourists. Detailed controls and\nuncertain policies in areas such as industrial licensing, trade, labour, and\nfinance continue to hamper foreign investment. Hydropower exports to India\nhave boosted Bhutan's overall growth, even though GDP fell in 2008 as a result\nof a slowdown in India, its predominant export market.\n\nSince 1961, the government of Bhutan has guided the economy through five-year\nplans in order to promote economic development.\n\nIn the 1970s the King placed Gross National Happiness over Gross Domestic\nProduct.\n\nOn 8 December 2023, Bhutan graduated from the UN's list of least developed\ncountries (LDCs), making it only the 7th country to do so and the first in 3\nyears."
  },
  {
    "chapter_name": "Economy of Bhutan",
    "chapter_id": "1",
    "section_number": "1",
    "section_name": "Macro-economic trend",
    "text": "Trend of Gross Domestic Product of Bhutan at market prices reported by the IMF\n[_needs update_] Year | (millions of BTN) | (millions of USD)\n---|---|---\n1985 | 2,166 | 175\n1990 | 4,877 | 279\n1995 | 9,531 | 294\n2000 | 20,060 | 460\n2005 | 36,915 | 828\n2008 | 45,000 | 1,280\n2011 | 84,950 | 1,695\n2014 | 119,546 | 1,784\n2017 | 159,572 | 2,294\n\nBhutan's hydropower potential and its attraction for tourists are key\nresources. The Bhutanese Government has made some progress in expanding the\nnation's productive base and improving social welfare.\n\nIn 2010, Bhutan became the first country in the world to ban smoking and the\nselling of tobacco. In order to stamp out cross-border smuggling during the\npandemic, a new Tobacco Control Rules and Regulations (TCRR) 2021 allowed the\nimport, sales and consumption of tobacco products."
  },
  {
    "chapter_name": "Economy of Bhutan",
    "chapter_id": "1",
    "section_number": "2",
    "section_name": "Membership of economic organizations and agreements",
    "text": "In terms of trade, Bhutan is a member of the South Asian Free Trade Area\n(SAFTA) and the Bay of Bengal Initiative for Multi-Sectoral Technical and\nEconomic Cooperation (BIMSTEC) and the South Asia Subregional Economic\nCooperation (SASEC). Bhutan is also a member of the pan-Asian Asia Cooperation\nDialogue (ACD), and the Asian Development Bank.\n\nBhutan first applied to join the WTO in 1999 and as an applicant, was quickly\ngranted observer status Beyond that, ascension proceedings at the WTO have\nbeen much delayed and periodically put on pause, largely stemming from\nconcerns and considerations of the Bhutanese government itself. The Bhutanese\ngovernment approved ascension to the WTO in April 2023, at least partly\nhastened by the country's upcoming graduation from the UN-defined 'least\ndeveloped country (LDC) category. Under WTO rules and processes, ascent of a\ncountry with LDC status comes with some leniency in certain requirements, more\nrelaxed timeframes for compliance, and additional support; so, whilst the loss\nof LDC status, as happened in December 2023, was a reflection of Bhutan's\nsuccess and development progress, it also meant much further delay in WTO\nascension (that is, ascent after the loss of LDC status) would make the\njourney through to full WTO member status even harder."
  },
  {
    "chapter_name": "Economy of Bhutan",
    "chapter_id": "1",
    "section_number": "3",
    "section_name": "Modern economic resources",
    "text": "Since the early 2020s, Bhutan has adopted cryptocurrency, particularly\nBitcoin, as a strategic economic resource. Facing declining tourism revenue,\nyouth unemployment (which reached 19% in 2024), and a growing brain drain, the\ngovernment began mining Bitcoin using surplus hydropower during high-flow\nsummer months. By 2023, Bhutan had sold $100 million in cryptocurrency to\ndouble civil servant salaries, leading to a drop in resignations. As of April\n2025, blockchain analysts estimate Bhutan's Bitcoin holdings at over $600\nmillion; around 30% of its GDP. Mining is powered by the kingdom's carbon-\nnegative hydropower and cool climate, aligning with its environmental values.\nBhutan also plans to develop Gelephu Mindfulness City, a sustainable economic\nhub."
  }
]