{
  "extraction_info": {
    "source_file": "economy_of_turkmenistan.json",
    "extraction_timestamp": "2025-08-02T17:13:29.326082",
    "total_sections_in_source": 33,
    "extracted_sections_count": 32,
    "skipped_sections_count": 1
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Turkmenistan is in a recovery phase following the 2014 downturn in hydrocarbon prices but remains severely affected by its worst economic crisis since the immediate post-independence period, influenced by factors including low gas prices, the suspension of gas exports to Russia from 2016 to 2019, and poor agricultural harvests.",
        "• On 11 March 2021, former President Gurbanguly Berdimuhamedow expressed dissatisfaction with the rate of GDP growth during a Cabinet of Ministers session, indicating that the year 2021 would be \"as difficult\" as 2020, particularly in the context of the government budget discussions.",
        "• According to the 2020 Investment Climate Statement by the US Department of State, Turkmenistan’s economy is heavily reliant on the production and export of natural gas, oil, petrochemicals, and, to a lesser extent, cotton, wheat, and textiles.",
        "• The economy is still recovering from a severe recession triggered by the collapse of global energy prices in late 2014, which significantly impacted Turkmenistan’s energy-dependent economy.",
        "• The current investment climate in Turkmenistan is considered high risk for US foreign direct investment, reflecting concerns about economic stability and regulatory environment.",
        "• Geographically, Turkmenistan is predominantly a desert country with intensive agricultural activities concentrated in irrigated areas, supporting the cultivation of major crops such as cotton and wheat.",
        "• As of 2020, Turkmenistan ranks 4th globally in terms of natural gas reserves, underscoring its significant position in the global energy sector.",
        "• The two largest agricultural crops in Turkmenistan are cotton, primarily produced for export purposes, and wheat, which is mainly consumed domestically.",
        "• Turkmenistan is recognized as one of the top ten cotton producers worldwide, highlighting the importance of cotton in its agricultural economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:25.499279",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "History",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• From 1998 to 2005, Turkmenistan experienced significant challenges due to a lack of adequate export routes for its natural gas and faced obligations related to extensive short-term external debt.",
        "• Despite these difficulties, total exports in Turkmenistan increased by an average of approximately 15% per year between 2003 and 2008, primarily driven by higher international prices for oil and gas.",
        "• The economic system during this period retained characteristics of the Soviet era, with central planning and strong state control remaining prominent features.",
        "• The government led by President Saparmurat Niyazov, who was in power from 1991 to 2006, consistently rejected programs aimed at implementing market reforms.",
        "• From the early 1990s until 2019, the Turkmen state subsidized a wide range of commodities and services, maintaining extensive government support for the population.",
        "• After his election in 2007, President Gurbanguly Berdimuhamedow implemented several economic reforms, including unifying the country’s previously dual currency exchange rate system.",
        "• Under Berdimuhamedow’s administration, the manat was redenominated, state subsidies for gasoline were reduced, and development was initiated for a special tourism zone named Awaza, located on the Caspian Sea.",
        "• Since 2009, Turkmenistan has maintained a fixed official exchange rate for its currency, the manat; in 2009, this rate was established at US$1 to 2.85 manats.",
        "• On 1 January 2015, the official exchange rate was adjusted to US$1 equaling 3.50 manats.",
        "• Despite the official fixed exchange rates, the black-market exchange rate diverged significantly, with rates fluctuating around 29 to 30 manats per US dollar as of February 2021.",
        "• By mid-April 2021, the black-market exchange rate had further depreciated, sliding to approximately 40 manats per US dollar."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:26.524033",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Fiscal policy",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The government budget of Turkmenistan is developed and implemented in accordance with the Law “On Budget System,” which establishes the legal foundations for organizing, managing, and operating the budget system, as well as regulating interrelations between budgets at all administrative levels.",
        "• The Turkmenistan government discusses the draft state budget and submits it to the President of Turkmenistan for approval.",
        "• One month prior to the start of the fiscal year, the President submits the state budget draft to the Assembly of Turkmenistan (Mejlis) for consideration and adoption.",
        "• The Ministry of Economy and Finance holds responsibility for managing state finances in Turkmenistan.",
        "• Budget statistics in Turkmenistan are considered unreliable due to the government’s use of large amounts of extra-budgetary funds that are not transparently reported.",
        "• The government budget revenue for 2021 totaled 79.5 billion manats, which represents a decline from 84.39 billion manats in 2020 and 103.57 billion manats in 2017.",
        "• The expenditure budget for 2021 was set at 72.1 billion manats.",
        "• According to state media reports from November 2023, the 2022 budget comprised 124.299 billion manats in revenue and 117.601 billion manats in expenditure.",
        "• The Central Bank of Turkmenistan controls the issuance of money but does not publish data regarding the money supply.",
        "• The Central Bank actively promotes cashless transactions; during January to April 2020, the volume of cashless transactions using debit cards more than tripled compared to the same period in 2019, reaching just under 1.9 billion manats.",
        "• The transition from cash to electronic payments encountered challenges, including shortages of cash in automatic teller machines and insufficient availability of card payment facilities at points of sale.",
        "• At least one non-governmental organization has publicly characterized the economy of Turkmenistan as a kleptocracy."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:25.560105",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Industry",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In the post-Soviet era, Turkmenistan's industrial sector has been increasingly dominated by the fuel and cotton processing industries, which has negatively impacted the development of light industry.",
        "• Between 1991 and 2004, Turkmenistan opened approximately 14 new cotton-processing plants, significantly enhancing the country's capacity to process domestically produced cotton.",
        "• The construction industry in Turkmenistan primarily relies on government building projects, as the construction of private housing is considered a low priority."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:19.878342",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 3
    },
    {
      "section_number": "3.1",
      "section_name": "Natural gas",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan's natural gas reserves are estimated at 50 trillion cubic meters, making it a significant holder of global gas resources.",
        "• Major gas deposits in Turkmenistan were discovered in the central and eastern regions during the 1940s and 1950s, with the republic becoming the second largest gas producer in the Soviet Union by the 1980s, behind the Russian SFSR.",
        "• During the Soviet era, Turkmenistan's gas exports were primarily to other Soviet republics, increasing from approximately 9.2 million cubic meters in 1940 to about 234 million cubic meters in 1960, and reaching around 51 billion cubic meters by 1975.",
        "• Export revenues from gas during the Soviet period were centrally controlled, with most income absorbed into the Soviet central budget rather than retained by Turkmenistan.",
        "• Following independence in 1991, Turkmenistan gained full control over its gas exports and revenues, but existing Soviet-era pipelines required much gas to be delivered to the Caucasus, Russia, and Ukraine.",
        "• In the 1990s, Turkmenistan faced payment issues with many CIS gas customers, who either delayed payments or engaged in barter deals; this led Turkmenistan to halt deliveries to some CIS members in the mid-1990s citing unprofitable arrangements.",
        "• The Turkmen government sought to diversify export routes by proposing pipelines through Iran to Turkey and via Afghanistan to Pakistan and Western Europe, but these projects failed due to regional security concerns and high costs, contributing to rising inflation and budget deficits while privatization was resisted.",
        "• In the late 1990s, Turkmenistan renegotiated export contracts and prices with Gazprom, resuming deliveries to Georgia, Ukraine, and other countries, and inaugurated its first pipeline bypassing Russia, the Korpezhe-Kurt Kui Pipeline.",
        "• On 14 December 2009, the Central Asia–China gas pipeline was inaugurated, enabling Turkmenistan to supply large volumes of natural gas to the China National Petroleum Corporation; the combined design capacity of Lines A, B, and C is 55 billion cubic meters per annum (bcma), with Turkmenistan's initial quota set at 35 bcma.",
        "• By 2023, Turkmenistan's quota on the Central Asia–China pipeline system increased to 40 bcma according to the Turkmenistan Ministry of Foreign Affairs.",
        "• By 2015, Turkmenistan was delivering approximately 35 bcma to China, offsetting declining exports to Russia, which ceased entirely on 1 January 2016 after Russia had progressively reduced imports from about 10 bcma to 5 bcma; Russian purchases resumed in smaller quantities in 2019.",
        "• Turkmenistan's small-volume gas sales to Iran, estimated at 12 bcma, were halted on 1 January 2017 due to payment arrears, with Ashgabat claiming Tehran owed approximately $1.8 billion for supplies delivered nearly a decade earlier.",
        "• In March 2025, Turkmenistan began selling natural gas to Turkey through a swap arrangement involving Turkmenistan-Iran and Iran-Turkey pipelines, targeting shipments of 1.3 billion cubic meters by the end of the year.",
        "• In January–November 2020, Turkmenistan extracted 62.3 billion cubic meters of natural gas, exporting approximately 31 billion cubic meters according to one source.",
        "• Official state-controlled media reported in February 2024 that Turkmenistan's natural gas production for the calendar year 2023 was 80.6187 billion cubic meters.",
        "• Production and exports of natural gas peaked in 2008 but dramatically declined in 2009 due to an explosion in the Central Asia–Center gas pipeline system in April 2009, for which Turkmenistan blamed Gazprom.",
        "• Turkmenistan's natural gas exports include pipeline deliveries directly to China and Russia, exports to Azerbaijan via swaps with Iran, and shipments of liquefied petroleum gas by rail and truck to Afghanistan.",
        "• The Turkmenistan-Afghanistan-Pakistan-India (TAPI) natural gas pipeline project reached a milestone with the completion of the Turkmen section, symbolizing efforts to diversify export routes.",
        "• Data from the BP Statistical Review shows Turkmenistan's natural gas production rose from 57.0 bcma in 2005 to a peak of 66.1 bcma in 2008, then dropped sharply to 36.4 bcma in 2009, before gradually recovering to 63.2 bcma in 2019.",
        "• Consumption within Turkmenistan increased steadily from 16.1 bcma in 2005 to 31.5 bcma in 2019, reflecting growing domestic demand.",
        "• Exports to Russia declined from 35.1 bcma in 2005 to 10.7 bcma in 2009 and further to 9.9 bcma by 2013, while exports to China began in 2010 at 3.5 bcma and rose to 24.4 bcma by 2013; exports to Iran fluctuated between 4.7 and 10.2 bcma during 2010–2013.",
        "• In February 2022, the European Space Agency's TROPOspheric Monitoring Instrument identified Turkmenistan as an ultra-emitter of methane, with lost methane emissions valued at approximately US$6 billion annually."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:32.056739",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 4
    },
    {
      "section_number": "3.1.1",
      "section_name": "Natural gas to gasoline production",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• On 28 June 2019, a factory with an investment of US$1.7 billion was commissioned in Ovadandepe for producing gasoline from natural gas.",
        "• The factory was constructed by the companies Rönesans and Kawasaki, utilizing technology developed by Haldor Topsoe.",
        "• The facility has a design production capacity of 600,000 tonnes of gasoline annually.",
        "• In addition to gasoline, the factory is designed to produce 12,000 tonnes of diesel fuel per year.",
        "• The plant also produces 115,000 tonnes of liquefied petroleum gas (LPG) annually.",
        "• These products are generated from an input of 1.7 billion cubic meters of natural gas each year.",
        "• According to opposition media reports as of January 2023, the plant had ceased production of export-grade ECO-93 gasoline.",
        "• The halt in export-grade gasoline production was attributed to a shortage of catalyzers necessary for the process.",
        "• Following the stoppage, the factory was reportedly producing only lower-quality gasoline intended for domestic consumption."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:22.255296",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 5
    },
    {
      "section_number": "3.2",
      "section_name": "Oil",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan's principal oil-producing region is located in the west of the country, primarily within Balkan Province, which forms part of the South Caspian Basin, an intercontinental depression renowned for oil production.",
        "• Commercial oil extraction on the Turkmen side of the Caspian Sea commenced in the early 1900s around the Cheleken Peninsula area, with modern oil drilling operations beginning in the 1930s near the city of Balkanabat.",
        "• Key oil fields developed over time include the Gumdag field in 1949, Goturdepe in 1958, and Ekerem in 1962, with offshore drilling activities initiated during the 1970s.",
        "• Major onshore oil fields in Turkmenistan encompass Çeleken, Goñurdepe, Nebitdag, Gumdag, Barsagelmez, Guýujyk, Gyzylgum, Ördekli, Gögerendag, Gamyşlyja, Ekerem, Çekişler, Keýmir, Ekizek, and Bugdaýly.",
        "• In 2019, capital investment in Turkmenistan's oil industry amounted to 3.29 billion manats, reflecting significant financial commitment to the sector.",
        "• During the period from January to November 2020, Turkmenistan produced 8.7 million tonnes of oil and condensate, alongside 231,000 tonnes of liquid petroleum gas.",
        "• Official state media reported that oil production in the calendar year 2023 reached 8.3167 million tonnes.",
        "• According to data from the BP Statistical Review, Turkmenistan's oil production and consumption figures from 2002 to 2019 are as follows:",
        "• In 2002, oil production was 183,000 barrels per day (9.0 million tonnes/year) with consumption at 3.9 million tonnes/year.",
        "• By 2005, production increased to 193,000 barrels per day (9.5 million tonnes/year), consumption rose to 4.3 million tonnes/year.",
        "• In 2008, production reached 208,000 barrels per day (10.3 million tonnes/year), consumption was 5.1 million tonnes/year.",
        "• In 2009, production was 211,000 barrels per day (10.4 million tonnes/year), consumption decreased slightly to 4.6 million tonnes/year.",
        "• For 2010, production increased to 217,000 barrels per day (10.7 million tonnes/year), consumption was 4.5 million tonnes/year.",
        "• In 2011, production remained at 217,000 barrels per day (10.7 million tonnes/year), consumption rose to 4.7 million tonnes/year.",
        "• In 2012, production increased to 222,000 barrels per day (11.0 million tonnes/year), consumption was 4.8 million tonnes/year.",
        "• In 2013, production reached 231,000 barrels per day (11.4 million tonnes/year), consumption remained at 4.8 million tonnes/year.",
        "• In 2014, production rose significantly to 263,000 barrels per day (12.9 million tonnes/year), consumption increased to 6.5 million tonnes/year.",
        "• In 2015, production was 271,000 barrels per day (13.2 million tonnes/year), consumption remained at 6.5 million tonnes/year.",
        "• In 2016, production slightly decreased to 270,000 barrels per day (13.2 million tonnes/year), consumption stayed at 6.5 million tonnes/year.",
        "• In 2017, production was 271,000 barrels per day (13.1 million tonnes/year), consumption remained at 6.5 million tonnes/year.",
        "• In 2018, production decreased to 261,000 barrels per day (12.6 million tonnes/year), consumption increased to 6.7 million tonnes/year.",
        "• In 2019, production rose slightly to 264,000 barrels per day (12.5 million tonnes/year), consumption increased to 7.1 million tonnes/year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:40.452954",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 6
    },
    {
      "section_number": "3.2.1",
      "section_name": "Petroleum refining",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Oil refining in Turkmenistan is conducted at two main facilities: the Türkmenbaşy oil refinery and the Seydi oil refining complex.",
        "• As of May 2016, the Türkmenbaşy oil refinery had a refining capacity exceeding 10 million tons of oil per year.",
        "• The Türkmenbaşy refinery produces a diverse range of products, including unleaded gasoline, petroleum coke, asphalt, laundry detergent, hydro-treated diesel, and lubricating oil.",
        "• The Türkmenbaşy oil refinery is the largest producer of liquid petroleum gas (LPG) in Turkmenistan, responsible for approximately two-thirds of the country's total LPG production, with an annual output of about 300,000 tonnes.",
        "• The Seydi refinery processed approximately 135,500 tonnes of oil in the first quarter of 2020 and 441,200 tonnes from January to November 2020, indicating an estimated annual processing capacity of about half a million tonnes in 2020, despite having a design capacity of 6 million tonnes.",
        "• In the first eight months of 2021, the Seydi refinery produced 135,200 tonnes of gasoline, 77,600 tonnes of diesel fuel, 22,800 tonnes of heavy gas oil, and 19,500 tonnes of asphalt.",
        "• The Seydi refinery was originally constructed during the Soviet era to process oil sourced from Siberia.",
        "• Following the dissolution of the Soviet Union, the Seydi refinery has been supplied with hydrocarbons from Turkmenistan’s domestic oil fields, including Gokdumalak, Yashyldepe, Yoloten, and Kerwen.",
        "• In October 2020, President Gurbanguly Berdimuhamedow publicly criticized the low output levels from Turkmenistan’s refineries, noting that oil extraction growth was stagnant despite half of the oil being exported.",
        "• President Berdimuhamedow highlighted that processing enterprises were operating at suboptimal levels, with refinery utilization rates lingering at approximately 40% for an extended period."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:32.059752",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 7
    },
    {
      "section_number": "3.3",
      "section_name": "Natural gas and oil exports",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• China is the major importer of Turkmenistan's natural gas, with historical import volumes ranging between 32 and 35 billion cubic meters per annum (bcma) based on Chinese and Turkmen official trade data.",
        "• Initially, Turkmenistan's quota on the Central Asia–China gas pipeline was set at 35 bcma; however, in August 2023, the Turkmenistan Ministry of Foreign Affairs announced that this quota had increased to 40 bcma.",
        "• Turkmen media reported that China imported 43.2 billion cubic meters (bcm) of natural gas via the Central Asia–China pipeline in 2022, though the exact volume originating from Turkmenistan was not specified.",
        "• Subsequent press reports clarified that Turkmenistan's natural gas exports to China in 2022 totaled 34.09 bcm.",
        "• Russia's Gazprom purchased smaller volumes of Turkmen pipeline gas, with 4 bcm in 2019, 4.7 bcm in 2020, and approximately 10 bcm in 2021; some of this gas was resold to Uzbekistan.",
        "• In June 2019, Russia and Turkmenistan signed a five-year agreement for annual deliveries of 5.5 bcm of natural gas.",
        "• Pipeline gas sales from Turkmenistan to Iran ceased in 2017 due to a dispute over arrears but resumed in Summer 2023 with test shipments of 10 million cubic meters (mcm) per day.",
        "• A new deal signed in June 2023 envisions Turkmenistan exporting up to 20 mcm per day of natural gas to Iran.",
        "• In November 2021, Turkmenistan, Iran, and Azerbaijan announced an agreement on a natural gas swap of up to 2 billion cubic meters per year, involving Turkmen gas flowing to Iran and Iranian gas flowing to Azerbaijan.",
        "• Iran's oil minister, Javad Owji, expressed readiness to increase the gas swap volume to 15 bcma.",
        "• By August 2023, media reports indicated that the volume of gas swapped between Turkmenistan and Iran had increased from 4.5 mcm per day to 8 mcm per day.",
        "• According to BP’s _Statistical Review of World Energy 2021_, Turkmenistan's natural gas exports in 2020 by destination (in bcm) were: Kazakhstan – 0.1 bcm; Russia – 3.8 bcm; Other CIS countries – 0.5 bcm; China – 27.2 bcm; totaling 31.6 bcm."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:35.434362",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 8
    },
    {
      "section_number": "3.3.1",
      "section_name": "Value of exports",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2021, Turkmenistan earned $6.79 billion from delivering natural gas to China, according to Chinese sources.",
        "• Chinese Customs statistics indicate that from January through November 2022, China imported natural gas from Turkmenistan valued at $9.28 billion.",
        "• Azerbaijan imported 857 million cubic meters (mcm) of natural gas from Turkmenistan in the calendar year 2022, with a value exceeding $130.63 million.",
        "• In June 2021, Turkmenistan and China announced the awarding of a tender to CNPC Chuanging Drilling Engineering Company, Ltd. for drilling gas wells in the Galkynysh gas field.",
        "• The payment for the drilling contract was arranged in kind, with CNPC to receive 17 billion cubic meters (bcm) of natural gas delivered over a three-year period.",
        "• The first gas well drilled under this contract was commissioned in January 2023.",
        "• Turkmenistan Hydrocarbon Exports (2015–2019):**",
        "• In 2015, Turkmenistan exported 40.3 billion cubic meters of natural gas valued at $8,406.7 million; 2.8 million tonnes of petroleum products valued at $1,038.3 million; and 4.1 million tonnes of crude oil valued at $1,466.8 million.",
        "• In 2016, natural gas exports were 37.9 billion cubic meters valued at $4,327.8 million; petroleum products exports were 2.6 million tonnes valued at $796.2 million; and crude oil exports were 4.9 million tonnes valued at $1,210.8 million.",
        "• In 2017, natural gas exports totaled 38.2 billion cubic meters valued at $5,031.7 million; petroleum products exports were 2.6 million tonnes valued at $1,000.7 million; and crude oil exports were 1.9 million tonnes valued at $612.8 million.",
        "• In 2018, natural gas exports amounted to 37.8 billion cubic meters valued at $6,428.0 million; petroleum products exports were 2.9 million tonnes valued at $1,430.1 million; and crude oil exports were 6.4 million tonnes valued at $2,634.4 million.",
        "• In 2019, natural gas exports reached 37.6 billion cubic meters valued at $6,942.1 million; petroleum products exports were 3.1 million tonnes valued at $1,297.1 million; and crude oil exports were 3.8 million tonnes valued at $1,671.5 million."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:33.281474",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 9
    },
    {
      "section_number": "3.4",
      "section_name": "Power generation",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Turkmenistan's total electrical energy generation was reported to be 22,521.6 million kilowatt-hours (22.52 terawatt-hours).",
        "• Electrical power generation in Turkmenistan from 2015 to 2019 showed fluctuations: 23,284.5 million kWh in 2015, increasing to 24,903.9 million kWh in 2017, then declining to 22,521.6 million kWh in 2019.",
        "• Electricity exports also varied during 2015-2019, with 3,215.3 million kWh exported in 2015, peaking at 3,751.4 million kWh in 2016, and decreasing to 1,803.5 million kWh by 2019.",
        "• As of 2013, Turkmenistan operated 10 electrical power plants equipped with a total of 32 turbines: 14 steam-driven, 15 gas-powered, and 3 hydroelectric turbines.",
        "• In 2011, Turkmenistan's power output was 18.27 billion kWh, with 2.5 billion kWh exported.",
        "• According to the Asian Development Bank's October 2018 report, Turkmenenergo, the State Energy Corporation, is the country's vertically integrated power utility, producing over 23 terawatt-hours of electricity in 2017 and exporting approximately 15% of this production to neighboring countries.",
        "• New power plants have been constructed in Mary, Ahal province, and Çärjew District of Lebap province to support electricity generation and exports.",
        "• The Mary-3 combined cycle power plant, commissioned in 2018 and built by Çalık Holding with GE turbines, has a capacity of 1.574 gigawatts and is designed to support expanded electricity exports to Afghanistan and Pakistan.",
        "• The Zerger power plant in Çärjew District, constructed by Sumitomo, Mitsubishi, Hitachi, and Rönesans Holding, was commissioned in September 2021 with a design capacity of 432 megawatts from three 144-megawatt gas turbines, primarily for electricity export.",
        "• The Zerger plant sources natural gas from the Üçajy Gas Field (Russian: Учаджинского газодобывающего месторождения), delivered via a 125-kilometer high-pressure pipeline.",
        "• The Ahal power plant, with a capacity of 650 megawatts, was built to supply electricity to Ashgabat, particularly the Olympic Village.",
        "• The Derweze State Electrical Power Station (Turkmen: Derweze Döwlet Elektrik Stansiýasy), a 504.4-megawatt plant constructed by Çalık Enerji in 2015, is located near Ovadandepe.",
        "• In March 2023, the Turkmen government announced plans to build a 1,574-megawatt natural gas-fired combined cycle power plant in Balkan Province.",
        "• In October 2023, the contract for the Balkan Province power plant construction was awarded to Çalık Enerji, with completion projected by May 2027.",
        "• National Leader Gurbanguly Berdimuhamedow stated in November 2023 that the new Balkan Province power plant is intended to export electricity to Azerbaijan.",
        "• A national grid strengthening project, supported by the Asian Development Bank, is underway to enhance Turkmenistan's electricity transmission infrastructure.",
        "• The grid project includes construction of four new power substations and installation of direct high-voltage lines: a 500-kilovolt line between Balkan province and Dashoguz, and a 200-kilovolt line between Buzmeyin and Balkanabat.",
        "• The objective of the national grid strengthening project is to create an interconnected national transmission grid to improve reliability and energy efficiency across Turkmenistan."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:36.877654",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 10
    },
    {
      "section_number": "3.5",
      "section_name": "Minerals",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The United States Geological Survey (USGS), a US government agency, published the table titled \"Turkmenistan: Production of Mineral Commodities,\" which is in the public domain and provides detailed mineral production data from 2014 to 2018.",
        "• Iron and steel rolled products production in Turkmenistan increased from 135,000 metric tons in 2014 to 144,000 metric tons in both 2017 and 2018.",
        "• Bromine production was steady at 500 metric tons annually from 2014 to 2016 but data for 2017 and 2018 is not available.",
        "• Hydraulic cement production rose consistently from 2.9 million metric tons in 2014 to 3.8 million metric tons in 2018.",
        "• Bentonite clay powder production increased gradually from 400 metric tons in 2014 to 450 metric tons in 2018, while other unspecified bentonite clay production rose from 7,387 metric tons (revised) in 2014 to an estimated 9,000 metric tons in 2018.",
        "• Gypsum mine production remained stable at approximately 110,000 metric tons annually from 2014 through 2018.",
        "• Iodine production was steady at 500 metric tons from 2014 to 2016, increased slightly to 510 metric tons in 2017, then declined to 400 metric tons in 2018.",
        "• Lime production showed a steady increase from 19,400 metric tons in 2014 to 23,000 metric tons in 2018.",
        "• Nitrogen content production included ammonia rising from 293,000 metric tons in 2014 to an estimated 340,000 metric tons in 2018, and urea increasing from 344,000 metric tons in 2014 to an estimated 400,000 metric tons in 2018.",
        "• Potash (K2O content) production was zero from 2014 to 2016, then started at an estimated 25,000 metric tons in 2017 and slightly decreased to 24,000 metric tons in 2018.",
        "• Salt production increased from 91,700 metric tons in 2014 to 100,000 metric tons annually from 2015 through 2018.",
        "• Sodium sulfate production peaked at 70,000 metric tons in 2015, then declined sharply to 26,000 metric tons by 2017 and remained at that level in 2018.",
        "• Sulfur production (S content) was 506,000 metric tons in 2014, increased to 600,000 metric tons in 2015, then sharply declined to 200,000 metric tons by 2017 and remained stable in 2018.",
        "• Natural gas production fluctuated slightly, with 67 billion cubic meters in 2014, peaking at 69.6 billion cubic meters in 2015, and then declining to an estimated 62 billion cubic meters in 2018.",
        "• Crude petroleum production, including condensate, increased from 87.2 million 42-gallon barrels in 2014 to a peak of 96.96 million barrels in 2016, then declined to 85 million barrels in 2018.",
        "• Petroleum refinery output decreased steadily from 57.1 million 42-gallon barrels in 2014 to an estimated 44 million barrels in 2018.",
        "• The table notes that barite, bench gravel, coal, dolomite, epsomite, and kaolin may have been produced in Turkmenistan, but reliable production data for these minerals was unavailable.",
        "• All data in the table are reported through 20 May 2019, with estimated data rounded to no more than three significant digits; some figures are revised or estimated as indicated.",
        "• In January 2023, the Deputy Prime Minister for Industry and Construction of Turkmenistan announced the discovery of iron oxide deposits near Çagyl, located in Türkmenbaşy District of Balkan Province."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:46.187522",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 19
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 11
    },
    {
      "section_number": "3.6",
      "section_name": "Construction materials",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan currently operates four cement plants, each with a design capacity of one million tons per year, located as follows: Baherden Cement Plant and Kelete Cement Plant in Ahal Province, Lebap Cement Plant in Türkmenabat, and Balkan Cement Plant in Jebel.",
        "• Plans have been announced to construct three additional cement plants to expand the country's cement production capacity.",
        "• In 2019, President Gurbanguly Berdimuhamedov reported the operational capacity utilization rates of the existing cement plants as: Kelete plant at 8.1%, Lebap plant at 88%, Baherden plant at 64%, and Balkan plant at just over 40% of their respective design capacities.",
        "• Cement production in Turkmenistan showed a declining trend from 2014 to 2019, with output figures (in thousand tonnes) as follows: 3,401.5 (2014), 3,549.9 (2015), 3,550.0 (2016), 2,881.4 (2017), 2,651.4 (2018), and 1,993.2 (2019).",
        "• In 2019, Turkmenistan produced 5.1 million standard square meters (4mm thickness) of sheet glass, reflecting significant activity in the glass manufacturing sector.",
        "• A $375 million float glass and glass container plant, constructed by the Turkish company Tepe Inşaat, was inaugurated on 14 February 2018 in Ovadandepe, north of Ashgabat, replacing an older Soviet-era glass factory previously located in central Ashgabat.",
        "• The value of Turkmenistan’s glass exports in 2019, as reported by international trading partners, amounted to US$9.5 million.",
        "• The Türkmen Demir Önümleri Döwlet Kärhanasy (Turkmen Iron Products State Enterprise) operates a steel smelter near Ovadandepe, situated at kilometer 22 on the Ashgabat-Dashoguz Automobile Highway; this facility primarily processes scrap metal to produce rebar and channel iron.",
        "• The Ceramic Products Plant in Bäherden, opened in 2025, manufactures 3.3 million square meters of ceramic tiles and 120,000 sanitary ware units annually using local raw materials.",
        "• The Bäherden Ceramic Products Plant is equipped with advanced technology supplied by SACMI, adheres to Industry 4.0 standards, is environmentally friendly, and provides employment for 460 workers."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:44.172044",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 12
    },
    {
      "section_number": "3.7",
      "section_name": "Chemicals",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2019, Turkmenistan operated nine chemical plants specializing in the production of nitrogen and phosphorus fertilizers with a combined output capacity of 700,000 tons per year.",
        "• These chemical plants also manufactured sulfuric acid, nitric acid, iodine, bromine, and various mineral salts.",
        "• In 2019, Turkmenistan ranked as the world's third largest producer of iodine, highlighting its significant role in the global iodine market."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:35.453943",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 13
    },
    {
      "section_number": "3.7.1",
      "section_name": "Petrochemicals",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan operates three urea (carbamide) production plants primarily for export, located in Tejen, Mary, and Garabogaz.",
        "• The Garabogaz urea plant, valued at $1.3 billion, was constructed by Mitsubishi Heavy Industries and GAP İnşaat (a subsidiary of Çalık Holding) and inaugurated on 18 September 2018, with a design capacity of 1.16 million tonnes of urea annually.",
        "• The Mary ammonia and urea plant, costing US$650 million, was commissioned on 17 October 2014 and built by Rönesans Holding, Kawasaki, and Sojitz; it has a design capacity of 400,000 tonnes of ammonia and 640,000 tonnes of urea per year.",
        "• The Tejen urea plant, inaugurated on 18 March 2005 at a cost of $240 million, has a design capacity of 350,000 tonnes of urea annually.",
        "• Despite their capacities, none of the three urea plants reportedly operate at full capacity.",
        "• From January to October 2019, the Garabogaz plant produced approximately 392,000 tonnes of urea, exporting 261,000 tonnes of this output.",
        "• Total nitrogenous fertilizer production in Turkmenistan for 2019 amounted to 550,500 tonnes on an active ingredient basis.",
        "• The Kiyanly Polymer Factory (_Gyýanly Polimer Zawody_) was inaugurated on 17 October 2018 with a design capacity to produce 381,000 tonnes of polyethylene and 81,000 tonnes of polypropylene annually.",
        "• The polymer plant was built at a cost of US$3.4 billion by LG International, Hyundai Engineering, Toyo Engineering, and Gap İnşaat, utilizing methane and ethane cracking for polymer production.",
        "• In the first ten months of 2019, the Kiyanly Polymer Factory produced only 67,900 tonnes of polyethylene and 12,700 tonnes of polypropylene, significantly below design capacity.",
        "• As of January 2023, the Kiyanly Polymer Factory had reportedly ceased operations and had not resumed production as of January 2024.",
        "• Opposition media reported in May 2024 that the polymer plant remained closed, with Hyundai Engineering conducting an audit to determine refurbishment needs.",
        "• The estimated cost to repair and restart the Kiyanly Polymer Factory was reported to be approximately one billion U.S. dollars."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:44.035624",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 14
    },
    {
      "section_number": "3.7.2",
      "section_name": "Non-hydrocarbon chemicals",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In March 2017, the Garlyk Mining and Enrichment Combinate for the production of potash fertilizer was inaugurated in Turkmenistan.",
        "• The Garlyk facility was constructed by Belarus's Belgorkhimprom at a cost of US$1.1 billion.",
        "• The factory is designed to produce 1.4 million tonnes of potash fertilizer annually, primarily intended for export to China and India.",
        "• Despite its design capacity, the Garlyk plant reportedly operates at only 2 to 7 percent of its rated capacity.",
        "• Turkmenistan has three factories producing iodine, located in Balkanabat, Hazar, and Bereket.",
        "• The Bereket iodine plant is designed to produce 150 tonnes of iodine per year.",
        "• Following planned renovations and upgrades, the Balkanabat plant will have a design capacity of 250 tonnes of iodine and 2,400 tonnes of bromine annually.",
        "• Similarly, the Hazar plant will have a design capacity of 300 tonnes of iodine and 4,500 tonnes of bromine per year after upgrades.",
        "• Total iodine production in Turkmenistan in 2019 amounted to 681.4 tonnes.",
        "• In May 2025, the president of Turkmenistan issued a decree authorizing Türkmenhimiýa to sign a contract with Daewoo Engineering & Construction Co., Ltd.",
        "• The contract with Daewoo Engineering & Construction Co., Ltd involves the construction of a fertilizer plant in Türkmenabat.",
        "• The planned Türkmenabat fertilizer plant is designed to produce 350,000 tonnes of superphosphate and 100,000 tonnes of ammonium sulfate annually."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:43.729437",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 15
    },
    {
      "section_number": "3.8",
      "section_name": "Textiles and Garments",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan has been a cotton producer since its conquest by the Russian Empire in the 1880s, primarily exporting raw cotton to Russia for spinning until its independence in 1991.",
        "• Since gaining independence in 1991, Turkmenistan has invested approximately $2 billion in the establishment of 70 plants and factories dedicated to the production of cotton yarn, textiles, and garments made from various materials, including shoes.",
        "• Among these 70 facilities, 13 are classified as large ginning, spinning, or textile mills, indicating significant industrial capacity in the textile sector.",
        "• In the year 2019, Turkmenistan exported cotton textiles valued at $123.6 million, reflecting the country's development in textile manufacturing and export capabilities.",
        "• Turkmenistan's cotton yarn production in 2019 amounted to 118,600 tonnes, demonstrating substantial output in raw textile materials.",
        "• The total fabric production in 2019 was 209.4 million square meters, comprising 192.9 million square meters of cotton fabric, 14.9 million square meters of terrycloth, and 1.4 million square meters of silk fabric.",
        "• In addition to fabric, Turkmenistan produced 40.9 million pairs of stockings in 2019, indicating a significant garment manufacturing sector.",
        "• The production of knit items in 2019 reached 5.5 million units, further showcasing the diversity of textile products manufactured domestically.",
        "• Footwear production in 2019 included 1.5 million pairs of shoes, highlighting the integration of other garment-related industries within the textile sector.",
        "• Turkmenistan also produced 3,400 tonnes of knitted fabric in 2019, contributing to the overall textile output and supporting garment manufacturing."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:47.516970",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 16
    },
    {
      "section_number": "3.9",
      "section_name": "Construction",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Turkmenistan government centrally funds and controls all major construction projects within the country.",
        "• As of January 2021, the government reported that over 2,500 large-scale construction projects were underway, with a total estimated cost of $37 billion.",
        "• In 2020, approximately two million square meters of new residential housing were constructed entirely at government expense.",
        "• Additionally, in 2020, 45 \"important government\" structures were built under government funding.",
        "• In 2021, construction was completed on five major facilities located in Ashgabat, including a new State Tribune, the Arkadag Hotel, two bank headquarters, and a new Congress Center.",
        "• All five major Ashgabat projects completed in 2021 were constructed by the French company Bouygues.",
        "• The total expenditure for these five Ashgabat projects amounted to $1.5 billion.",
        "• A significant ongoing project is the construction of the city of Arkadag, designated as the new capital of Ahal province, with a budget of $4.8 billion.",
        "• Furthermore, $2.3 billion has been allocated for the construction of the Ashgabat-Turkmenabat motorway.",
        "• The Ashgabat-Turkmenabat motorway project is being executed by a consortium composed of four Turkmen construction firms."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:46.412867",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 17
    },
    {
      "section_number": "3.10",
      "section_name": "Transport",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan has historically functioned as a crossroads and integral part of the Silk Road, facilitating transit of cargo via air, sea, and land routes.",
        "• Ashgabat International Airport operates as a key stopover and transfer hub for air passengers traveling between India—specifically the cities of Amritsar and New Delhi—and England, including London and Birmingham.",
        "• The airport also serves as a transit point for flights connecting Frankfurt-am-Main in Germany with Bangkok in Thailand under normal operating conditions."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:46.471070",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 18
    },
    {
      "section_number": "3.10.1",
      "section_name": "Seaports",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan's principal seaport is the Turkmenbashy International Seaport, located on the Caspian Sea.",
        "• The Turkmenbashy International Seaport underwent an expansion from 2013 to 2018, costing $2 billion, carried out by the construction company Gap Inşaat.",
        "• Post-expansion, the seaport has an annual handling capacity of 25 million tonnes of dry cargo, divided into 17 million tonnes capacity in the newly expanded section and 8 million tonnes in the original port area.",
        "• The port can accommodate 300,000 passengers annually, in addition to managing 75,000 freight trucks and 400,000 containers each year.",
        "• The Turkmenbashy International Seaport operates regular ferry services to Baku, Azerbaijan.",
        "• The seaport also oversees three oil loading terminals named Kenar, Alaja, and Ekerem.",
        "• Apart from Turkmenbashy, Turkmenistan’s other seaports consist solely of loading terminals associated with factories at Kiyanly (also spelled Gyýanly) and Garabogaz.",
        "• Additionally, there is an oil loading terminal located at Hazar, which is Turkmenistan’s only other oil loading facility apart from those managed at Turkmenbashy."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:49.770487",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 19
    },
    {
      "section_number": "3.10.2",
      "section_name": "Airports",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan has five major airports providing regular domestic passenger service: Ashgabat, Dashoguz, Mary, Turkmenabat, and Turkmenbashy.",
        "• A sixth international-class airport located at Kerki was commissioned in June 2021 and was scheduled to commence regular domestic passenger service in January 2022.",
        "• A seventh airport, Balkanabat, operates exclusively for special flights rather than regular passenger service.",
        "• Under normal circumstances, Ashgabat International Airport is the only airport in Turkmenistan offering regular international passenger flights.",
        "• Turkmenbashy International Airport primarily serves international cargo flights, with Cargolux being the chief operator using this facility.",
        "• The sole domestic airline in Turkmenistan is the state-owned Türkmen Howa Ýollary, also known as Turkmenistan Airlines.",
        "• In the year 2019, Turkmenistan Airlines transported 12 thousand tonnes of cargo, carried 2.5 million passengers, and achieved 2.98 billion passenger-kilometers flown.",
        "• Minor airports exist in smaller cities and towns within Balkan Province, including Balkanabat, Etrek, Garabogaz, Hazar, and Jebel.",
        "• A former military airfield located at Galaýmor in Mary Province is planned to be converted for civil aviation use.",
        "• Additional small landing strips are located at Aeroport village and Gäwers in Ahal Province."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:48.521405",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 20
    },
    {
      "section_number": "3.10.3",
      "section_name": "Rail",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The domestic rail system in Turkmenistan is operated by the state-owned company Türkmendemirýollary, also known as Turkmen Railways.",
        "• There is no scheduled international passenger rail service available in Turkmenistan.",
        "• Domestic passenger rail service connects major cities within Turkmenistan, facilitating internal travel.",
        "• Freight rail service operates for both domestic transport and international destinations, supporting cargo movement across borders.",
        "• In 2019, Turkmenistan’s rail system transported a total of 23.8 million tonnes of freight.",
        "• During the same year, Turkmen Railways handled 5.44 million passengers on its domestic rail network.",
        "• The total passenger traffic volume in 2019 amounted to 2.53 billion passenger-kilometers, reflecting the extent of passenger rail usage in Turkmenistan."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:48.030070",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 21
    },
    {
      "section_number": "3.10.4",
      "section_name": "Roads",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2011, Turkmenistan had a total road network measuring 13.7 thousand kilometers, with 12.3 thousand kilometers of these roads being paved.",
        "• In 2019, road transport in Turkmenistan accounted for 27.1 billion passenger-kilometers, representing 83% of the country's total passenger traffic.",
        "• Motor vehicles transported 448.9 million tonnes of cargo in 2019, which constituted 85.5% of the total cargo transported in Turkmenistan.",
        "• In terms of freight movement, motor vehicles accounted for 14.2 billion tonne-kilometers in 2019.",
        "• The M37 highway is a major road in Turkmenistan, connecting the seaport at Türkmenbaşy to the border with Uzbekistan at Farap.",
        "• The Ashgabat-Dashoguz Highway is another principal route, linking the capital city Ashgabat with Dashoguz in the north.",
        "• The P-7 highway connects the M37 highway at Tejen to the border with Iran at Sarahs, serving as a significant international road corridor."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:49.901656",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 22
    },
    {
      "section_number": "3.11",
      "section_name": "Banking",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The financial system of Turkmenistan is under full state control, reflecting centralized management of economic resources.",
        "• The banking system was significantly reduced following the 1998 financial crisis and currently comprises 9 national banks.",
        "• Among these banks is Rysgal Bank, a nominally private bank owned by the Union of Industrialists and Entrepreneurs.",
        "• Turkmen-Turkish Bank operates as a joint venture between Dayhan Bank and the Turkish state-owned Ziraat Bankası.",
        "• The structure and division of responsibilities within these banks mirror the Soviet-era system and are overseen by the Central Bank of Turkmenistan.",
        "• Lending operations and household savings have historically been minor functions within the banking system, with an estimated 95 percent of loans in 2005 directed to state enterprises.",
        "• Two foreign bank branches, the National Bank of Pakistan and Iran Saderat Bank, operate in Ashgabat, providing retail banking services.",
        "• Additionally, two German banks, Deutsche Bank and Commerzbank, offer institutional banking services through offices located in Ashgabat.",
        "• As of 1 January 2021, the total assets of all banks in Turkmenistan amounted to 135.8 billion manats.",
        "• Individual deposits totaled 3.3 billion manats, comprising 2.8 billion manats in demand deposits and 437 million manats in time deposits.",
        "• Business deposits reached 39.1 billion manats, with 14.6 billion manats in demand deposits and 53.7 billion manats in time deposits.",
        "• Business deposits were further categorized into state-owned firms holding 32.5 billion manats, privately owned firms with 21.1 billion manats, and individual unincorporated entrepreneurs accounting for 7.9 billion manats.",
        "• In 2019, credit extended to individuals, firms, and organizations amounted to 84.1 billion manats, showing growth from 76.3 billion manats in 2018 and 69.2 billion manats in 2017.",
        "• Of the credit extended, 60.9 billion manats in 2019, 52.1 billion in 2018, and 46.7 billion in 2017 were denominated in Turkmen manats."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:24:00.008444",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 23
    },
    {
      "section_number": "3.11.1",
      "section_name": "Credit and debit cards",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkmenistan utilizes several types of national plastic cards, including Milli Kart, Altyn Asyr, and Turkmen Kart, as primary payment instruments within the country.",
        "• According to the Central Bank of Turkmenistan, the total number of bank cards issued in Turkmenistan in 2023 exceeded 5,177,000 units.",
        "• Cashback services are offered by multiple banks in Turkmenistan, specifically Halkbank, Daykhanbank, Rysgal Bank, Senagat Bank, Turkmenbashi Bank, Turkmenistan Bank, and the Turkmen-Turkish Joint-Stock Commercial Bank.",
        "• The cashback percentages provided by these banks range from 2% to 3%, incentivizing card usage among consumers.",
        "• In Turkmenistan, bank cards are versatile payment tools that can be used not only for retail purchases but also for paying healthcare institution fees, utility bills, communication services including Internet, and transportation tickets such as railway, bus, and air travel.",
        "• The country introduced contactless payment technology for the first time in 2019, marking a significant advancement in payment methods.",
        "• As of 2023, Turkmenistan had a total of 2,144 Automated Teller Machines (ATMs) and 42,131 bank payment terminals deployed nationwide.",
        "• The Internet Bank service in Turkmenistan had 932,730 registered users in 2023, while the Mobile Bank service had 60,654 users, indicating growing digital banking adoption.",
        "• Turkmen banks possess the capability to issue internationally recognized payment cards, including Visa, MasterCard, and Maestro.",
        "• Citizens of Turkmenistan holding MasterCard and Visa cards supported by international payment systems can perform non-cash payments and withdraw cash from ATMs abroad, facilitating international financial transactions."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:55.693830",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 24
    },
    {
      "section_number": "5",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Turkmenistan produced 1.5 million tons of wheat, making it the largest crop by volume that year.",
        "• The country also produced 582 thousand tons of cotton in 2019, ranking second in crop production by volume.",
        "• Other significant agricultural outputs in 2019 included 356 thousand tons of tomato, 315 thousand tons of potato, and 263 thousand tons of watermelon.",
        "• Turkmenistan produced 246 thousand tons of grape and 245 thousand tons of sugar beet in 2019; sugar beet is used for producing sugar and ethanol.",
        "• Additional 2019 crop yields included 130 thousand tons of rice, 74 thousand tons of onion, 71 thousand tons of carrot, 66 thousand tons of apple, and 34 thousand tons of apricot, alongside various other agricultural products.",
        "• In the early 2000s, the state-run agriculture sector's contribution to Turkmenistan’s gross domestic product increased under close government supervision.",
        "• Wheat was the top crop by area planted with 761 thousand hectares in 2019, followed by cotton with 551 thousand hectares planted the same year.",
        "• Recent state policies have aimed to diversify crop production to achieve food self-sufficiency in Turkmenistan.",
        "• Since the post-Soviet era, the area planted to grains, mainly wheat, has nearly tripled in Turkmenistan.",
        "• Most agricultural land in Turkmenistan is of poor quality and requires irrigation for productive use.",
        "• Irrigation infrastructure and water-use policies have not adequately addressed the needs of agricultural land, particularly in areas distant from natural rivers.",
        "• The Karakum Canal, which transports water from the Amu Darya River across Turkmenistan to near Bereket, is the primary irrigation source for distant agricultural areas but is described as decrepit.",
        "• The Dostluk Dam, opened in 2005 at Sarahs on the border with Iran, has increased irrigation water availability and improved irrigation efficiency.",
        "• There are plans to construct a similar dam on the Atrek River to further enhance irrigation capacity.",
        "• In the 2020 agricultural season, Turkmenistan reportedly produced approximately 1.5 million tons of raw cotton.",
        "• Prior to October 2018, when a ban on raw cotton exports was imposed, Turkmenistan exported raw cotton to multiple countries including Russia, Iran, South Korea, the United Kingdom, China, Indonesia, Turkey, Ukraine, Singapore, and the Baltic states.",
        "• From 2019 onward, the Turkmenistan government shifted its export focus from raw cotton to cotton yarn, finished textiles, and garments.",
        "• Private farmers are primarily responsible for growing most of Turkmenistan’s fruits and vegetables, especially tomatoes, watermelons, grapes, and onions.",
        "• All stages of production for the main cash crops, grain and cotton, remain under state control.",
        "• In 2006, grain crop failures led to increasing bread lines and the reinstatement of a rationing system across most regions of Turkmenistan.",
        "• The root causes of the 2006 grain failures were identified as a culture of falsifying output figures and poor agricultural sector administration.",
        "• Since 2018, independent media have reported food shortages in Turkmenistan, with hundreds of people queuing for hours to purchase bread and flour.",
        "• Despite official government reports indicating good harvests, independent media sources report low agricultural output attributed to drought and mismanagement.",
        "• These independent reports also confirm the reappearance of flour and bread shortages in the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:57.652898",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 26
    },
    {
      "section_number": "5.1",
      "section_name": "Mechanization of agriculture",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since gaining independence, the Turkmenistan government has invested substantial funds in importing agricultural machinery, including tractors, harvesters, and various implements, to modernize its agricultural sector.",
        "• By 2012, Turkmenistan utilized approximately 7,000 tractors, 5,000 cotton cultivators, 2,200 seeders, and additional agricultural machines, primarily sourced from Belarus and the United States.",
        "• The American companies John Deere and Case IH commenced sales of farm machinery in Turkmenistan in 1994, marking the introduction of Western agricultural equipment into the country.",
        "• Claas combines were introduced for grain harvesting in Turkmenistan in 2011, representing a significant development in mechanized grain production.",
        "• Belarus tractors, which have been in use since the Soviet era, remain popular in Turkmenistan due to their competitive pricing and the local agricultural community’s extensive familiarity with this product line.",
        "• Turkmenistan also imports cotton harvesters from neighboring Uzbekistan, diversifying its sources of agricultural machinery.",
        "• Between 2017 and 2020, Claas delivered a total of 1,000 Tucano 420 grain combines, 800 Axion 850 plowing tractors, and 1,550 Axos 340 tractors to Turkmenistan, significantly enhancing the country’s mechanized farming capacity.",
        "• During the 2017 and 2018 crop years, John Deere supplied 440 Model 9970 cotton harvesters to Turkmenistan, followed by an additional 600 units delivered between 2019 and 2020, reflecting ongoing investment in advanced cotton harvesting technology."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:56.018756",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 27
    },
    {
      "section_number": "6",
      "section_name": "Trade",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• From 2015 to 2019, Turkmenistan's export values in millions of US dollars were as follows: 12,164.0 (2015), 7,520.1 (2016), 7,787.9 (2017), 11,650.9 (2018), and 11,103.8 (2019).",
        "• During the same period, Turkmenistan's import values in millions of US dollars were: 14,051.4 (2015), 13,176.8 (2016), 10,188.6 (2017), 5,322.9 (2018), and 5,831.7 (2019).",
        "• The principal export commodity of Turkmenistan is natural gas, primarily delivered via pipelines to China, with smaller quantities sent to Russia and through a swap arrangement via Iran to Azerbaijan.",
        "• Additionally, Turkmenistan exports liquid petroleum gas by road and rail to Afghanistan.",
        "• According to Chinese Customs data, the value of Chinese imports of natural gas from Turkmenistan decreased from US$8,686,022,768 in 2019 to US$6,071,165,273 in 2020, attributed to reduced import volumes and declining hydrocarbon prices.",
        "• In 2019, crude oil and refined petroleum products constituted approximately US$3 billion of Turkmenistan's exports.",
        "• Cotton textiles exports were valued at US$123.6 million in 2019.",
        "• Major import categories in 2019 included machinery valued at US$1.5 billion, base metals at US$968.3 million, chemicals at US$682.3 million, vehicles at US$453.5 million, and plastic and rubber products at US$342.9 million.",
        "• In March 2023, the Turkmenistan parliament enacted legislation adopting the Harmonized System of tariff nomenclature."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:54.069942",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 28
    },
    {
      "section_number": "7",
      "section_name": "Labour",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Turkmenistan had 666,500 employees working in large- and medium-sized enterprises, alongside 103,900 employees in non-state enterprises, which include private, mixed public-private, or foreign-owned businesses.",
        "• The employment structure in 2019 was distributed as follows: 25.3% in the state sector, 50.3% in the private sector, 22.0% in mixed public-private enterprises, 0.2% in public associations, 0.4% in cooperatives, and 1.8% in foreign-owned enterprises, including joint ventures.",
        "• Official statistics from 2019 indicate that 77,474 individuals were employed by individual entrepreneurs, including those engaged in self-employment.",
        "• The major employment sectors in 2019 were: 43.5% in agriculture, 9.8% in manufacturing, 8.4% in education, 7.4% in trade and vehicle repair, 5.8% in construction, 4.3% in transport and storage, 3.6% in health and social work, and 2.9% in arts and entertainment.",
        "• The average monthly wage in Turkmenistan increased from 507 manats in 2007 to 943.40 manats in 2012, reaching 1,685.10 manats in 2019.",
        "• In 2004, the labor force was estimated to include more than 2.3 million workers, with 48.2% employed in agriculture, 37.8% in services, and 14% in industry and construction.",
        "• Due to the dominance of the state in the economy, approximately 90% of workers were effectively state employees as of 2004.",
        "• Government workforce downsizing began in 2003, which is believed to have contributed to increased unemployment in the following years.",
        "• Unemployment was estimated at 11% in 2014.",
        "• In recent years, the economic downturn caused by falling hydrocarbon prices has led to unemployment estimates as high as 60%, despite official government figures reporting unemployment rates below 4%."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:24:04.106279",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 29
    },
    {
      "section_number": "8",
      "section_name": "Privatization",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between 1994 and the end of 2020, a total of 2,628 former state-owned properties in Turkmenistan were privatized, according to official statistics.",
        "• The privatized enterprises were categorized as follows: 845 in wholesale and retail trade and vehicle repair, 143 in manufacturing, 108 in real estate operations, 95 in agriculture, forestry, and fisheries, 51 in transportation and storage, 27 in construction, 18 in the hospitality industry, and 1,341 in other services.",
        "• In March 2021, President Gurbanguly Berdimuhamedow ordered the conversion of the Derýaýollary Production Association into an open joint-stock company; this association is a subordinate unit of the State Service of Maritime and River Transportation of Turkmenistan (Türkmendeňizderýaýollary), which is the state agency responsible for river and canal transport.",
        "• Despite privatization efforts, all land in Turkmenistan remains government property, maintaining the status quo from the Soviet era."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:57.347656",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 30
    },
    {
      "section_number": "9",
      "section_name": "Macro-economic trends",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Turkmenistan government provided official economic indicators for the period 1993–2020 to the International Monetary Fund, including GDP in billion US$ PPP, GDP per capita in US$ PPP, nominal GDP in billion US$, real GDP growth rate, inflation rate in percent, and government debt as a percentage of GDP.",
        "• In 1993, Turkmenistan's GDP was 10.9 billion US$ PPP with a GDP per capita of 2,975 US$ PPP, nominal GDP of 15.9 billion US$, a real GDP growth rate of −10.0%, extremely high inflation at 3,102.4%, and government debt data was not provided.",
        "• By 1995, GDP decreased to 8.9 billion US$ PPP, GDP per capita dropped to 2,070 US$ PPP, nominal GDP was 12.7 billion US$, real GDP growth was −7.2%, inflation remained very high at 1,005.2%, with no government debt data available.",
        "• In 2000, GDP rose to 11.6 billion US$ PPP, GDP per capita increased to 2,554 US$ PPP, nominal GDP was 16.8 billion US$, real GDP growth surged to 18.6%, inflation dropped significantly to 23.6%, and government debt was 44% of GDP.",
        "• By 2005, GDP more than doubled to 27.5 billion US$ PPP, GDP per capita reached 5,755 US$ PPP, nominal GDP was 39.9 billion US$, real GDP growth was 13.0%, inflation decreased to 10.7%, and government debt fell sharply to 5% of GDP.",
        "• From 2006 to 2008, GDP continued to grow from 31.4 billion US$ PPP to 41.9 billion US$ PPP, GDP per capita increased from 6,509 to 8,478 US$ PPP, nominal GDP rose from 45.6 to 60.9 billion US$, real GDP growth ranged between 11.0% and 14.7%, inflation fluctuated between 6.3% and 14.5%, and government debt remained low between 2% and 3% of GDP.",
        "• In 2009, GDP was 44.8 billion US$ PPP, GDP per capita was 8,954 US$ PPP, nominal GDP was 65.0 billion US$, real GDP growth slowed to 6.1%, inflation turned negative at −2.7%, and government debt was 2% of GDP.",
        "• From 2010 to 2014, GDP increased steadily from 49.6 billion US$ PPP to 82.5 billion US$ PPP, GDP per capita rose from 9,740 to 15,093 US$ PPP, nominal GDP grew from 76.5 to 94.1 billion US$, real GDP growth ranged from 9.2% to 14.7%, inflation remained moderate between 4.4% and 6.8%, and government debt fluctuated between 4% and 20% of GDP.",
        "• Between 2015 and 2016, GDP grew from 88.8 billion US$ PPP to 95.5 billion US$ PPP, GDP per capita increased from 15,952 to 16,922 US$ PPP, nominal GDP slightly decreased from 93.8 to 90.5 billion US$, real GDP growth slowed to around 6.2%, inflation dropped from 7.4% to 3.6%, and government debt rose from 22% to 24% of GDP.",
        "• In 2017 and 2018, GDP decreased to 81.8 billion US$ PPP then rebounded to 88.9 billion US$ PPP, GDP per capita fell to 14,324 US$ PPP then rose to 15,048 US$ PPP, nominal GDP increased from 100.0 to 103.3 billion US$, real GDP growth remained steady around 6.2% to 6.5%, inflation rose sharply from 8.0% to 13.3%, and government debt increased to 31% of GDP.",
        "• In 2019 and 2020, GDP rose to 96.2 billion US$ PPP and 99.3 billion US$ PPP respectively, GDP per capita increased to 15,766 and 15,810 US$ PPP, nominal GDP was approximately 101.6 billion US$ in 2019 and 99.9 billion US$ in 2020, real GDP growth slowed significantly to 1.8% in 2020 from 6.3% in 2019, inflation fluctuated between 5.1% and 8.0%, and government debt remained around 31% to 33% of GDP.",
        "• The Asian Development Bank in 2006 questioned the accuracy of Turkmenistan’s official GDP figures, stating that actual economic growth was likely much lower than the official estimates and that the government had historically overstated growth.",
        "• The UK government's 2021 Overseas Business Risk report highlighted the unreliability of Turkmenistan’s economic data, noting that official figures released to international financial institutions often do not align with observable economic conditions on the ground.",
        "• External observers have also expressed skepticism regarding the official inflation rates reported by Turkmenistan.",
        "• The World Bank’s June 2021 Global Economic Prospects report excluded Turkmenistan from its analysis due to a lack of reliable and adequate quality economic data.",
        "• On 11 March 2021, Turkmenistan’s Cabinet of Ministers disclosed that the country had borrowed over US$14 billion in foreign exchange loans in recent years, with US$5 billion outstanding as of 8 March 2021.",
        "• A televised chart in March 2021 indicated Turkmenistan’s external debt at US$1.3524 billion, which opposition media used alongside Central Bank Chairman Rahimberdi Jepbarov’s statement that external debt equals 11% of GDP to estimate the country’s GDP at approximately US$12.3 billion.",
        "• In June 2021, official Turkmen state media reported that debts to China related to the construction of natural gas pipelines had been fully repaid."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:24:26.023299",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 31
    },
    {
      "section_number": "10",
      "section_name": "Miscellaneous statistics",
      "chapter_name": "Economy of Turkmenistan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the early years of Turkmenistan's independence, the official exchange rate of the Turkmen manat to the US dollar increased dramatically, reflecting significant currency depreciation.",
        "• Concurrently, the black-market exchange rate for the Turkmen manat depreciated even more rapidly, eventually stabilizing around 24,000 to 25,000 manats per US dollar, indicating a substantial divergence from the official rate.",
        "• Specific official manat to dollar exchange rates recorded were: 2,400 manats per dollar in January 1996, 4,070 manats per dollar in January 1997, 5,350 manats per dollar in January 1999, and 5,200 manats per dollar in January 2000."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:23:59.497246",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_turkmenistan.json",
      "original_index": 32
    }
  ]
}