{
  "extraction_info": {
    "source_file": "economy_of_iraq.json",
    "extraction_timestamp": "2025-08-02T17:13:28.107087",
    "total_sections_in_source": 18,
    "extracted_sections_count": 18,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Iraq is predominantly driven by the oil sector, which accounted for 89% of foreign exchange earnings in 2024.",
        "• Historically, the oil sector has contributed approximately 99.7% of Iraq's foreign exchange earnings throughout its modern history.",
        "• Iraq's economy experienced significant agrarian development following the 14 July Revolution in 1958, which led to the overthrow of the Hashemite monarchy.",
        "• By 1980, Iraq had become the third-largest economy in the Middle East, partly due to industrialization and infrastructure projects initiated by Saddam Hussein in the 1970s.",
        "• Saddam Hussein's initiatives in the 1970s included irrigation projects, railway and highway construction, and rural electrification, contributing to economic growth.",
        "• During the 1980s, Iraq faced severe financial difficulties caused by extensive expenditures in the Iran-Iraq War and damage to oil export facilities inflicted by Iran's military.",
        "• The Ba'athist government responded to these financial problems with austerity measures, heavy borrowing, and rescheduling foreign debt payments.",
        "• Iraq suffered economic losses estimated at a minimum of $80 billion due to the Iran-Iraq War.",
        "• The Iran-Iraq War ended in 1988, after which oil exports gradually increased through new pipeline construction and restoration of damaged facilities.",
        "• Following the Persian Gulf War, Iraq's oil exports sharply declined again, with GDP falling to approximately 25% of its 1980 level.",
        "• The country’s economy continued to decline under international sanctions imposed after the Gulf War, until Iraq received aid through the U.N. Oil-for-Food Programme in 1997.",
        "• By 2000, Iraq experienced modest economic growth as the government attempted reforms and improvements in the economic system.",
        "• After the 2003 U.S.-led invasion, the Coalition Provisional Authority sought to modernize Iraq’s economy via privatization and reduction of foreign debt.",
        "• Iraq’s economy expanded rapidly post-2003, but growth was hindered by insurgency, civil war, economic mismanagement, and outdated oil technology causing shortages.",
        "• From mid-2009 onward, oil export earnings returned to pre-Operation New Dawn levels, supported by rising global oil prices and increased government revenues.",
        "• In 2011, Iraq increased oil exports above 1.9 million barrels per day (approximately 300,000 m³/day) due to new contracts with international oil companies, though forecasts suggested exports might fall short of the 2.4 million barrels per day (approximately 380,000 m³/day) target in the budget.",
        "• Iraq’s oil contracts with major international companies held the potential to significantly boost revenues, contingent upon upgrading oil processing, pipelines, and export infrastructure.",
        "• Improved security and initial foreign investment inflows spurred economic activity in energy, construction, and retail sectors.",
        "• Long-term economic stability and growth depended on government policy reforms and the continued development of Iraq’s extensive oil reserves.",
        "• Despite increased foreign investor interest in 2010, challenges such as land acquisition difficulties and regulatory barriers persisted, hampering project development."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:35.124077",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Economic growth",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the 1960s, nominal GDP of Iraq increased by 213%, reflecting significant economic growth during this period.",
        "• In the 1970s, nominal GDP experienced an extraordinary growth of 1325%, driven largely by increased oil production and rising oil prices.",
        "• The 1980s saw a modest nominal GDP growth of 2%, indicating a slowdown in economic expansion, likely impacted by regional conflicts and economic challenges.",
        "• The 1990s experienced a sharp decline in nominal GDP by 47%, primarily due to the economic repercussions of wars and sanctions.",
        "• In the 2000s, nominal GDP grew substantially by 317%, signaling a period of economic recovery and growth.",
        "• Real GDP per capita in Iraq, measured in 1990 dollars, increased markedly during the 1950s, 1960s, and 1970s, driven by higher oil production levels and increased oil prices.",
        "• Oil prices peaked in the 1970s due to the Organization of Petroleum Exporting Countries (OPEC)’s oil embargo, which caused the 1973 oil crisis, significantly impacting Iraq’s economy.",
        "• Despite growth in earlier decades, Iraq’s GDP per capita declined substantially over the subsequent two decades due to multiple wars, including the Iran-Iraq War (1980-1988) and the Gulf War (1990-1991)."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:37.910632",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "Iran-Iraq War",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Prior to the outbreak of the Iran-Iraq War in September 1980, Iraq's economic outlook was positive, characterized by high oil production and revenues.",
        "• In 1979, Iraq's oil production reached 560,000 cubic meters per day, equivalent to approximately 3.5 million barrels per day.",
        "• Oil revenues in 1979 totaled 21 billion dollars, increasing to 27 billion dollars in 1980 due to record-high oil prices.",
        "• Iraq had accumulated an estimated 35 billion dollars in foreign exchange reserves by that time.",
        "• The country was believed to possess one of the best education and healthcare systems in the Middle East.",
        "• Thousands of migrant workers from Egypt, Somalia, and the Indian subcontinent were employed in Iraq’s construction projects.",
        "• The Iran–Iraq War and the 1980s oil glut severely depleted Iraq’s foreign exchange reserves, devastated its economy, and resulted in a foreign debt exceeding 40 billion dollars.",
        "• Despite these setbacks, oil exports gradually increased as Iraq constructed new pipelines and repaired damaged facilities."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:40.961263",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 2
    },
    {
      "section_number": "1.2",
      "section_name": "Sanctions",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Iraq's seizure of Kuwait in August 1990 led to the imposition of international economic sanctions on Iraq, which, along with damage from military action by an international coalition beginning in January 1991, significantly reduced the country's economic activity.",
        "• The Iraqi regime worsened shortages by supporting large military and internal security forces and allocating resources to key supporters of the Ba'ath Party.",
        "• The implementation of the UN's Oil for Food program in December 1996 aimed to improve economic conditions by allowing Iraq to export oil in exchange for humanitarian goods such as food and medicine.",
        "• During the first six six-month phases of the Oil for Food program, Iraq was permitted to increase its oil exports progressively in exchange for essential supplies.",
        "• In December 1999, the UN Security Council authorized Iraq to export unlimited amounts of oil necessary to meet humanitarian needs, removing previous export limits.",
        "• As a result of the program, per capita food imports increased substantially, and medical supplies and healthcare services steadily improved; however, per capita economic production and living standards remained significantly below prewar levels.",
        "• Iraq changed its oil reserve currency from the U.S. dollar to the euro in 2000.",
        "• Approximately 28% of Iraq's export revenues under the Oil for Food program were deducted to cover UN Compensation Fund and UN administrative expenses.",
        "• The decline in Iraq's GDP in 2001 was primarily due to the global economic slowdown and falling oil prices."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:43.724728",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 3
    },
    {
      "section_number": "1.3",
      "section_name": "After the invasion of Iraq in 2003",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the removal of sanctions on 24 May 2003 and the increase in oil prices during the mid-to-late 2000s, Iraq experienced a doubling of its oil production, rising from a low of 1.3 million barrels per day (mbpd) in 2003 to a peak of 2.6 mbpd in 2011.",
        "• Since 2007, reductions in inflation and violence have contributed to tangible improvements in the living standards of Iraqi citizens.",
        "• A major economic challenge for Iraq was its substantial foreign debt, estimated at approximately $130 billion.",
        "• Part of this debt stemmed from unpaid obligations related to normal export contracts, while another portion originated from military and financial support received during Iraq’s war with Iran.",
        "• The Jubilee Iraq campaign claimed that much of Iraq’s debt was odious (illegitimate), but since the concept of odious debt is not widely accepted legally, pursuing debt relief on that basis risked prolonged legal disputes.",
        "• Iraq opted for a pragmatic approach by engaging with the Paris Club of official creditors to address its debt issues.",
        "• A December 2006 _Newsweek International_ article cited a study by Global Insight in London, which indicated that Iraq’s economy was performing well regardless of civil war conditions, with sectors such as real estate, construction, retail, and wholesale trade experiencing growth.",
        "• The report noted that the U.S. Chamber of Commerce registered 34,000 companies in Iraq, an increase from 8,000 companies three years prior.",
        "• There was a sharp rise in sales of secondhand cars, televisions, and mobile phones.",
        "• Estimates of Iraq’s GDP growth varied: Global Insight projected a 17% increase in the previous year and 13% for 2006, while the World Bank reported a lower figure of 4% for that year.",
        "• Despite ongoing security concerns, Iraq’s economy was growing at a notable rate, which was considered surprising given the circumstances."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:47.645676",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 4
    },
    {
      "section_number": "2",
      "section_name": "Industry",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since 1974, the Iraqi government has taken direct control of Iraq’s largest private oil production operations, specifically Mosul Oil and Basra Oil, leading to a significant shift in the country's industrial landscape.",
        "• The majority of Iraq's manufacturing activity has become closely linked to the oil industry following government intervention in oil production.",
        "• The primary industries within this sector include petroleum refining and the manufacture of chemicals and fertilizers, which have been the mainstays of Iraq’s industrial output.",
        "• Prior to the 2003 invasion, efforts to diversify Iraq’s industrial base were limited by restrictions on privatization and the impact of international sanctions imposed during the 1990s.",
        "• Since 2003, ongoing security issues have impeded the establishment of new industrial enterprises, hampering economic diversification efforts.",
        "• The construction industry in Iraq is an exception to the general stagnation; in 2000, cement was the only major industrial product not based on hydrocarbons, indicating some level of industrial diversity.",
        "• The construction sector has benefited from the need to rebuild infrastructure and housing following Iraq’s multiple wars, including the Gulf War and the Iraq War.",
        "• During the 1990s, Iraq’s construction industry experienced growth due to government funding for extensive infrastructure projects, housing developments, and elaborate palace complexes, reflecting state-led development efforts."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:54:53.044182",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 5
    },
    {
      "section_number": "2.1",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Agriculture in Iraq contributes approximately 3.3% to the gross national product but employs about 20% (a fifth) of the labor force.",
        "• Historically, between 50% and 60% of Iraq's arable land was under cultivation.",
        "• During the UN Oil for Food program, Iraq imported large quantities of grains, meat, poultry, and dairy products to meet domestic needs.",
        "• In 1981, the Iraqi government abolished its collective farming program.",
        "• The Gulf War caused significant disruptions to Iraqi agriculture, including physical damage and economic sanctions that curtailed imports, cut off petroleum exports, and halted agricultural production with potential military applications.",
        "• In response to these disruptions, the Iraqi government monopolized grain and oilseed marketing, imposed production quotas, and established a Public Distribution System for basic foodstuffs.",
        "• By mid-1991, the government supplied a \"basket\" of foodstuffs providing about one-third of the daily caloric requirement, costing consumers roughly 5% of its market value.",
        "• Subsidies for agricultural inputs diminished in the 1990s, leading to prices that failed to cover costs; tax on agricultural production reached between 20% and 35% by the mid-1990s.",
        "• In October 1991, the Baghdad regime withdrew personnel from northern regions controlled by Kurdish parties; Kurdistan Region was described as a \"market economy essentially left alone by a fragile governing structure, but heavily influenced by substantial international humanitarian aid flows.\"",
        "• In December 1996, under the Oil for Food Program negotiated with the United Nations, Iraq began exporting petroleum and used the proceeds to import foodstuffs.",
        "• Grain imports from 1997 to 2001 averaged $828 million annually, representing an increase of over 180% compared to the previous five-year period.",
        "• Due to foreign competition, Iraqi production declined significantly: wheat by 29%, barley by 31%, and maize by 52%.",
        "• The government neglected production of forage crops, fruits, vegetables, and livestock other than poultry, which made these sectors less affected by international issues but still impacted by severe drought, screwworm outbreaks, and foot-and-mouth disease epizootics.",
        "• The expansion of the Oil for Food Program to include more agricultural inputs and machinery stabilized Iraqi agricultural productivity around 2002.",
        "• After the U.S. invasion in March 2003, many Iraqis became dependent on government-subsidized food; US-funded agricultural reconstruction focused on increasing productivity through programs like Agricultural Reconstruction and Development Iraq (ARDI).",
        "• The ARDI program, run by Development Alternatives, Inc. (DAI) of Bethesda, Maryland, conducted trials to improve farming practices and crop varieties for winter cereals (wheat and barley), summer cereals (rice, maize, sorghum), potatoes, and tomatoes.",
        "• ARDI introduced feed supplements and veterinary treatments to enhance livestock reproductive outcomes and conducted surveys of poultry growers and apple farmers.",
        "• Nurseries for date palms and grapes were established under ARDI, which also promoted trade associations and producers' cooperatives, supporting extension services as a government function.",
        "• The ARDI project cost over $100 million and lasted until December 2006.",
        "• USAID's Community Action Program funded market analyses for sheep and wool, and contracts were awarded to the University of Hawaii to revitalize higher education in agriculture, and to the Louis Berger Group for $120 million to promote Iraq's private sector including agriculture.",
        "• Starting in 2006, Provincial Reconstruction Teams (PRTs) were deployed to promote goodwill and counter insurgency, allowing military commanders to allocate up to $500,000 for local needs with minimal bureaucratic hurdles; civilian agencies like the U.S. Department of Agriculture and USAID participated.",
        "• Critics of the PRTs highlighted the lack of a cohesive national agricultural strategy and criticized the emphasis on \"American-style\" agricultural technologies that were deemed inappropriate for Iraq.",
        "• Post-2002, agricultural production showed limited recovery: FAO data indicates wheat production increased by 11%, milled rice by 8%, while barley decreased by 13%, and maize by 40% between 2002 and 2013.",
        "• Iraq’s per capita food production, scaled in \"international dollars\" (base 2004-2006 = 100), was 135 in 2002, dropped to 96 in 2007, and further declined to 94 in 2012; agricultural sector employment also declined, with production per worker being 117 in 2002, 106 in 2007, and 130 in 2012.",
        "• The Oil-for-Food program (1997–2003) further suppressed farm production by flooding the market with artificially priced foreign foodstuffs.",
        "• Favorable weather in 2004 led to a 22% increase in grain production over 2002 levels; however, experts predicted Iraq would remain a net importer of agricultural products in the foreseeable future.",
        "• Long-term development plans included investing in agricultural machinery, materials, and more productive crop varieties, but these improvements had not been realized under Saddam Hussein’s regime.",
        "• In 2004, Iraq’s main crops included wheat, barley, corn, rice, vegetables, dates, and cotton; main livestock outputs were cattle and sheep.",
        "• The Agricultural Cooperative Bank, capitalized at nearly 1 billion dollars by 1984, provided low-interest, low-collateral loans to private farmers for mechanization, poultry projects, and orchard development.",
        "• Large modern cattle, dairy, and poultry farms were under construction to modernize agriculture.",
        "• Major obstacles to agricultural development in Iraq include labor shortages, inadequate management and maintenance, salinization of soils, urban migration, and dislocations caused by previous land reform and collectivization policies.",
        "• In 2011, agricultural adviser Layth Mahdi summarized the impact of U.S. reconstruction efforts, noting that before 2003 Iraq imported about 30% of its food annually; after the invasion, this reliance increased to 90%, costing over $12 billion annually, and leading to a decline in domestic production, land degradation, environmental exploitation, and widespread impoverishment and unemployment among farmers.",
        "• The importation of foreign workers and increased participation of women in traditionally male-dominated agricultural roles helped mitigate labor shortages caused by war.",
        "• An unsuccessful attempt to drain the southern marshes and introduce irrigated farming destroyed a natural food-producing area, with salt and mineral accumulation rendering the land unsuitable for agriculture.",
        "• In the Mada'in Qada region east of Baghdad, farmers formed the Green Mada'in Association for Agricultural Development, an cooperative providing drip irrigation, greenhouses, and access to credit to its members.",
        "• Recent years have seen farmers facing reduced rainfall and high temperatures, especially impacting small-scale farmers unable to withstand lower water levels, forcing many to abandon their lands in search of alternative livelihoods."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:02.060922",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 36
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 6
    },
    {
      "section_number": "2.2",
      "section_name": "Forestry, fishing, and mining",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Throughout the twentieth century, human activities such as exploration, shifting agriculture, forest fires, and uncontrolled grazing significantly degraded large areas of Iraq's natural forests.",
        "• By 2005, Iraq's remaining natural forests were almost exclusively confined to the northeastern highlands.",
        "• Most trees in the northeastern highlands are not suitable for lumbering purposes.",
        "• In 2002, Iraq harvested a total of 112,000 cubic meters of wood, with nearly 50% of this amount used as fuel.",
        "• Despite Iraq's notable large rivers, its fishing industry has remained relatively small and primarily focused on marine species in the Persian Gulf.",
        "• In 2001, Iraq's fishing yield was approximately 8,000 tons, a decline from about 18,000 tons during the period between 1981 and 1997, according to official government estimates.",
        "• Iraq's mining industry, aside from hydrocarbons, has been limited to the extraction of small quantities of phosphates at Akashat, salt, and sulfur near Mosul.",
        "• The mining sector experienced a productive period in the 1970s but has since been hampered by several conflicts and economic issues, including the Iran–Iraq War (1980–88), sanctions imposed in the 1990s, and the economic collapse of 2003."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:05.336814",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 7
    },
    {
      "section_number": "2.3",
      "section_name": "Energy",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Iraq is one of the most oil-rich countries globally, holding the fifth largest proven crude oil reserves, totaling 147.22 billion barrels as of the end of 2017.",
        "• The country exports most of its oil—approximately 4 million barrels per day out of a total production of 4.3 million barrels daily—making Iraq the third-largest exporter of oil in the world.",
        "• Despite ongoing civil war, Iraq increased its oil production during 2015 and 2016; however, production declined by 3.5 percent in 2017 due to conflicts with the Kurdistan Regional Government and OPEC production limits.",
        "• Iraq's oil production costs are relatively low by global standards.",
        "• The industry’s infrastructure has been severely damaged by four wars—the Iraq-Iran War (1980–1988), the Gulf War (1991), the Iraq War (2003–2011), and the civil war—as well as the 1991–2003 UN sanctions, leaving it in poor condition.",
        "• In the 1970s, Iraq produced over 3.5 million barrels of oil per day.",
        "• Oil production declined during the Iran-Iraq War and plummeted by 85 percent after the 1991 invasion of Kuwait.",
        "• UN sanctions from 1991 to 1996 prevented oil exports, which were only permitted in exchange for humanitarian aid under the Oil-for-Food Programme.",
        "• The lifting of sanctions in 2003 allowed Iraq to restart oil production and exports, which have since recovered to pre-Gulf War levels.",
        "• Most of Iraq's oil infrastructure has been repaired despite persistent sabotage by ISIL and other groups.",
        "• In 2004, Iraq had eight oil refineries, with the largest located at Baiji, Basra, and Daura.",
        "• Despite its oil wealth, Iraq faces frequent sabotage and technical problems at refineries, leading to imports of petroleum, refined oil products, and electricity, especially from Iran.",
        "• In 2004, Iraq spent approximately $60 million per month on imported gasoline.",
        "• Sabotage in late 2004 and early 2005 reduced oil exports and domestic distribution, causing fuel shortages and power outages, particularly in Baghdad.",
        "• Ongoing sabotage by ISIL of pipelines, power plants, and power lines, along with theft of oil and electricity, contributed to protests in southern Iraq in July 2018.",
        "• In 2004, plans aimed to increase domestic natural gas utilization to replace oil and support the petrochemical industry; however, growth in gas output depends on oil industry developments since most gas is associated with oil production.",
        "• Half of Iraq’s power plants were destroyed during the Persian Gulf War of 1991, and full recovery has not been achieved.",
        "• In mid-2004, Iraq’s power-generating capacity was estimated at 5,000 megawatts, against a demand of 7,500 megawatts, with a transmission system of 17,700 kilometers of line.",
        "• Plans in 2004 to build two new power plants and restore existing infrastructure were hindered by sabotage and looting, keeping capacity below 6,000 megawatts.",
        "• The civil war, sabotage, and government corruption worsened electricity shortages, with demand surpassing supply by 6,000 megawatts by 2010.",
        "• As of 2018, oil accounts for over 65 percent of Iraq’s GDP and 90 percent of total government revenue.",
        "• Petroleum exports constituted 94 percent of Iraq’s total exports, valued at $59.73 billion in 2017.",
        "• The government aims to diversify the economy away from oil; non-oil GDP growth, which lagged behind regional averages from 2014 to 2016, surpassed regional averages in 2017.",
        "• Despite some diversification, government spending on non-oil investment has declined since 2013 and was only 34 percent at the time of the latest data."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:11.684569",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 8
    },
    {
      "section_number": "2.3.1",
      "section_name": "2009 oil services contracts",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between June 2009 and February 2010, the Iraqi Ministry of Oil conducted a tender process to award Service Contracts for the development of Iraq's existing oil fields, with the results broadcast live on Iraqi television.",
        "• These contracts pertain to all major fields awarded except those in the Kurdistan Region, where Production Sharing Contracts have been awarded and are currently disputed by the Baghdad government.",
        "• All awarded contracts are pending final ratification by the Iraqi government, and company shares are subject to change through commercial negotiations.",
        "• The following table summarizes the awarded fields, companies involved, their home countries, company types, ownership shares, production increase shares, service fees per barrel, and projected gross revenues at plateau, based on data available from various sources:",
        "• **Majnoon Field:**",
        "• Shell (Netherlands, Public) holds 45% share, with a 0.7875 million barrels per day (mb/d) production increase share, a service fee of $1.39 per barrel, and an estimated gross revenue of $0.4 billion per annum at plateau.",
        "• Petronas (Malaysia, State) holds 30%, with a 0.525 mb/d increase, same service fee, and gross revenue of $0.266 billion.",
        "• **Halfaya Field:**",
        "• CNPC (China, State) owns 37.5%, with a 0.525 mb/d increase, $1.39 service fee, and $0.102 billion gross revenue.",
        "• Petronas (Malaysia, State) owns 18.75%, with a 0.099 mb/d increase, a slightly higher service fee of $1.4, and gross revenue of $0.051 billion.",
        "• TotalEnergies (France, Public) also holds 18.75%, with similar parameters.",
        "• **Rumaila Field:**",
        "• BP (UK, Public) has 37.5%, with a 0.7125 mb/d increase, a $2 service fee, and gross revenue of $0.520 billion.",
        "• CNPC (China, State) also holds 37.5%, with identical production increase and revenue figures.",
        "• **Zubair Field:**",
        "• ENI (Italy, Public) owns 32.81%, with a 0.328 mb/d increase, a $2 service fee, and gross revenue of $0.240 billion.",
        "• Occidental (US, Public) holds 23.44%, with a 0.2344 mb/d increase, same service fee, and gross revenue of $0.171 billion.",
        "• KOGAS (Korea, State) owns 18.75%, with a 0.1875 mb/d increase, and gross revenue of $0.137 billion.",
        "• **West Qurna Field Phase 2:**",
        "• Lukoil (Russia, Public) holds 75%, with a 1.35 mb/d increase, a $1.15 service fee, and gross revenue of $0.567 billion.",
        "• Equinor (Norway, State) is listed but with no specific share or figures available.",
        "• **Badra Field:**",
        "• Gazprom (Russia, State) owns 30%, with a 0.051 mb/d increase, a notably high service fee of $5.5 per barrel, and gross revenue of $0.102 billion.",
        "• Petronas (Malaysia, State) owns 15%, with a 0.0255 mb/d increase, same service fee, and gross revenue of $0.051 billion.",
        "• KOGAS (Korea, State) holds 23%, with a 0.03825 mb/d increase, gross revenue of $0.077 billion.",
        "• TPAO (Turkey, State) owns 8%, with a 0.01275 mb/d increase, and gross revenue of $0.026 billion.",
        "• **West Qurna Field Phase 1:**",
        "• Exxon (US, Public) owns 60%, with a 1.2276 mb/d increase, a $1.9 service fee, and gross revenue of $0.851 billion.",
        "• Shell (UK/Netherlands, Public) holds 15%, with a 0.3069 mb/d increase, same service fee, and gross revenue of $0.213 billion.",
        "• Notes clarify that all field shares are percentages of total ownership, with the Iraqi state retaining a 25% stake in all fields awarded via service contracts.",
        "• The \"production increase share\" indicates the additional millions of barrels per day that will generate the service fee for each company.",
        "• \"Gross revenue at plateau\" represents the total annual payment each company will receive once reaching their target plateau production rate, which is expected between 5 and 8 years, before operating costs and recovery of development costs are deducted.",
        "• The total gross revenue at plateau for all companies combined is approximately $4.34 billion per year, based on a $70 per barrel oil price and an additional 9.4 million barrels per day in production.",
        "• The 2010 Iraqi government budget was $60 billion, and the total capital expenditure for these projects is estimated at $300 billion, roughly equating to about $10,000 annually per Iraqi citizen.",
        "• The total increased production shares by region are as follows:",
        "• Iraq: 1.462 mb/d (25%)",
        "• Asia: 1.9 mb/d (20%)",
        "• UK: 1.81 mb/d (19%)",
        "• US: 1.462 mb/d (16%)",
        "• Russia: 1.402 mb/d (14%)",
        "• Europe excluding UK: 0.528 mb/d (6%)"
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:19.069911",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 41
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 9
    },
    {
      "section_number": "2.4",
      "section_name": "Finance",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Iraq's financial services sector has undergone reforms following the fall of Saddam Hussein's regime.",
        "• During the 1990s, 17 private banks were established in Iraq; however, these banks were primarily limited to domestic transactions and attracted few private depositors.",
        "• The private banks and two main state banks suffered significant damage due to the international embargo imposed in the 1990s.",
        "• In 2003, the Coalition Provisional Authority (CPA) implemented reforms to further privatize and expand Iraq's banking system by removing restrictions on international bank transactions.",
        "• The CPA also liberated the Central Bank of Iraq (CBI) from government control, allowing it greater independence in monetary policy.",
        "• In its first year of independent operation, the CBI was credited with successfully limiting Iraq's inflation, although specific data or citations are not provided.",
        "• In 2004, Iraq issued licenses to three foreign banks—HSBC, Standard Chartered, and the National Bank of Kuwait—marking the first foreign banks authorized to operate in Iraq."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:21.131913",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 10
    },
    {
      "section_number": "2.4.1",
      "section_name": "Banking",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Modern-style banking in Iraq has origins dating back to the early 20th century, marking the beginning of contemporary financial institutions in the country.",
        "• Iraq's banking sector is dominated by two state-owned banks, which are the largest financial institutions in the country and share a common historical background.",
        "• Rafidain Bank, established in 1941, is one of Iraq's primary state-owned banks and has played a central role in the country's banking system.",
        "• In 1988, Rafidain Bank was separated from another entity, resulting in the creation of Rafidain Bank as a distinct institution; the text appears to contain a typographical error, but it indicates a significant restructuring of the banking sector at that time.",
        "• Rasheed Bank, established in 1988, is another major state-owned bank in Iraq, with a total of 162 branches across the country.",
        "• As of the latest available data, Rasheed Bank's total assets amount to an unspecified figure in Iraqi Dinar billion, with the bank holding a significant share of the total banking system's assets, credit, and deposits.",
        "• Rafidain Bank's total assets are reported to be 147 Iraqi Dinar billion, making it a key player in Iraq's banking sector, though specific percentages of its share in total assets, credit, and deposits are not provided.",
        "• The two banks collectively constitute the core of Iraq's banking infrastructure, with their size and assets reflecting their dominant roles in the country's financial landscape."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:25.638808",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 11
    },
    {
      "section_number": "2.5",
      "section_name": "Private security",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Due to the ongoing insurgency in Iraq, the security industry has experienced significant prosperity, becoming a notably successful segment within the services sector.",
        "• The security sector in Iraq is often operated by former US military personnel, highlighting the involvement of individuals with military backgrounds.",
        "• In the year 2005, at least 26 private security companies were active in Iraq, providing services such as personal protection, institutional security, surveillance, and other security-related functions."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:27.762021",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 12
    },
    {
      "section_number": "2.6",
      "section_name": "Retail",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In the early post-Hussein period, Iraq experienced a vibrant and unregulated retail trade characterized by a mix of legitimate and illegitimate commerce, largely due to the absence of income tax and import controls.",
        "• This period saw a proliferation of various retail outlets and shopping centers, reflecting a freewheeling market environment.",
        "• Notable shopping malls established during this time include Baghdad Mall, Dream City Mall, Zayoona Mall, and Babylon Mall.",
        "• Additional retail centers mentioned are a mall in Basra and Basra Times Square, indicating regional retail development beyond Baghdad."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:29.399173",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 13
    },
    {
      "section_number": "2.7",
      "section_name": "Tourism",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Iraq tourism industry historically benefited from the country's numerous cultural sites, earning approximately US$14 million in 2001 during peaceful periods.",
        "• Since the onset of the Iraq War in 2003, the tourism sector has remained largely dormant, experiencing significant decline and inactivity.",
        "• Despite the challenging conditions post-2003, in 2005 the Iraqi Tourism Board maintained a staff of 2,500 employees and operated 14 regional offices across the country.",
        "• Between 2009 and 2010, a total of 165 tourists from 16 different countries visited Iraq to explore its historic sites, indicating limited but ongoing international interest.",
        "• As of January 2011, the U.S. State Department provided a grant of US$2 million aimed at preserving the ancient city of Babylon, facilitating efforts to reopen one of its two museums."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:31.344981",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 14
    },
    {
      "section_number": "2.8",
      "section_name": "Telecommunications",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between 2003 and 2008, Iraq experienced a more than hundred-fold increase in mobile phone subscriptions.",
        "• By 2008, the total number of mobile phone subscriptions in Iraq reached approximately ten million.",
        "• This significant growth in mobile telecommunications was documented by the Brookings Institution."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:32.735674",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 15
    },
    {
      "section_number": "3",
      "section_name": "Labor force",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2002, Iraq's labor force was estimated at 6.8 million people.",
        "• In 1996, the distribution of employment within Iraq's labor force was approximately 66.4% in services, 17.5% in industry, and 16.1% in agriculture.",
        "• Estimates of Iraq's unemployment rate in 2004 ranged from 30% to 60%.",
        "• The nationwide unemployment rate since May 2003 has varied significantly over the years, with specific data points including:",
        "• The Coalition Provisional Authority (CPA) reported a 25% unemployment rate, while the Iraqi Ministry of Planning cited 30%, and the Ministry of Social Affairs claimed it was 48%.",
        "• Other sources suggest unemployment could be around 20%, with possibly up to 60% under-employment, complicated by high black-market participation and poor security conditions.",
        "• Security concerns in central Iraq have discouraged new hiring and the resumption of regular work schedules, impacting employment levels.",
        "• The return of Iraqis from abroad has increased the number of job seekers.",
        "• By late 2004, most legitimate jobs were concentrated in the government sector, the army, the oil industry, and security-related enterprises.",
        "• Under Saddam Hussein, many of the highest-paid workers were employed by the overstaffed government, and the overthrow of his regime disrupted their economic contribution.",
        "• In 2004, the U.S. Agency for International Development committed US$1 billion to a worker-training program.",
        "• In early 2004, the minimum wage in Iraq was US$72 per month."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:42.533782",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 16
    },
    {
      "section_number": "4",
      "section_name": "External trade",
      "chapter_name": "Economy of Iraq",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Iraq is a founding member of the Organization of Petroleum Exporting Countries (OPEC).",
        "• Petroleum constitutes approximately 99.7% of Iraq's exports, with a value of $43.8 billion in 2016.",
        "• From the 1990s until 2003, Iraq's international trade embargo restricted its export activity almost exclusively to oil.",
        "• In 2003, Iraq's oil exports amounted to about US$7.4 billion out of a total export value of US$7.6 billion, with similar proportions observed in earlier years.",
        "• After the end of the trade embargo in 2003, Iraq expanded its range of exports, but oil remained dominant: in 2004, export income doubled to US$16.5 billion, with oil accounting for all but US$340 million (2%) of the total exports.",
        "• In late 2004, sabotage significantly reduced Iraq's oil output, leading experts to forecast that both output and exports would remain below capacity in 2005.",
        "• The chief export markets in 2004 were the United States (which accounted for nearly half of exports), Italy, France, Jordan, Canada, and the Netherlands.",
        "• In 2004, Iraq's total imports were valued at US$21.7 billion, resulting in a trade deficit of approximately US$5.2 billion.",
        "• In 2003, Iraq's main sources of imports included Turkey, Jordan, Vietnam, the United States, Germany, and Britain.",
        "• Due to Iraq's inactive manufacturing sector, the range of imports was broad, including food, fuels, medicines, and manufactured goods.",
        "• By 2010, Iraq's exports increased to US$50.8 billion, and imports rose to US$45.2 billion.",
        "• The chief export partners in 2009 were the United States, India, Italy, South Korea, Taiwan, China, the Netherlands, and Japan.",
        "• The main import partners in 2009 were Turkey, Syria, the United States, China, Jordan, Italy, and Germany.",
        "• In March 2022, Iraq and Iran engaged in trade reaching a volume of US$10 billion, with joint ventures increasing significantly but still limited due to sanctions against Iran.",
        "• Goods originating from Iran faced a trade embargo imposed by the United States and the European Union.",
        "• Iraq and Iran signed a memorandum of understanding (MOU) on economic cooperation in January 2021."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:55:48.546878",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_iraq.json",
      "original_index": 17
    }
  ]
}