{
  "extraction_info": {
    "source_file": "economy_of_qatar.json",
    "extraction_timestamp": "2025-08-02T17:13:28.730078",
    "total_sections_in_source": 10,
    "extracted_sections_count": 10,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Qatar ranks among the highest globally in terms of GDP per capita, consistently placing within the top ten richest countries according to 2015 and 2016 data compiled by the World Bank, the United Nations, and the International Monetary Fund (IMF).",
        "• Despite facing sanctions from neighboring countries Saudi Arabia and the United Arab Emirates, Qatar's economy has continued to grow, primarily because its exports are directed mainly to Japan, South Korea, India, and China, countries unaffected by these sanctions.",
        "• Neither Saudi Arabia nor the United Arab Emirates have imposed trading penalties such as tariffs or embargoes on Japan, South Korea, India, or China for trading with Qatar, nor have they offered incentives like discounts on their own energy exports to reduce Qatari exports, rendering the sanctions largely ineffective.",
        "• Petroleum and natural gas form the foundation of Qatar’s economy, contributing over 70% of total government revenue, more than 60% of the gross domestic product (GDP), and approximately 85% of the country’s export earnings.",
        "• Qatar possesses the world's third-largest proven natural gas reserves and ranks as the third-largest exporter of natural gas globally.",
        "• Qatar’s economic development model uniquely leverages revenues from its oil and natural gas sectors to drive national modernization and economic diversification efforts.",
        "• The Qatar National Vision 2030 is a strategic initiative aimed at reducing the country’s dependence on hydrocarbons while promoting sustainability, human development, and private sector growth.",
        "• This development strategy involves substantial investment in state-led projects, including infrastructure development and sovereign wealth funds, which have been instrumental in supporting economic diversification and enhancing global competitiveness.",
        "• Qatar’s approach to economic growth is distinguished from traditional resource-dependent states by its focus on strategic investments and fostering a diversified, knowledge-based economy.",
        "• The model emphasizes sustainability, innovation, and global competitiveness, reflecting Qatar’s long-term commitment to development and economic resilience beyond reliance on natural resource wealth."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:30.483993",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Energy sector",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Prior to the development of the petroleum industry, Qatar's economy was primarily based on pearl diving and was considered poor.",
        "• Exploration of oil and gas fields in Qatar commenced in 1939, marking the beginning of the country's transition to an energy-based economy.",
        "• In 1973, Qatar experienced a dramatic increase in oil production and revenues, which elevated its status from one of the world's poorest countries to having one of the highest per capita incomes globally.",
        "• Between 1982 and 1989, Qatar's economy faced a downturn due to OPEC-imposed crude oil production quotas, declining oil prices, and an unfavorable international market outlook, which collectively reduced oil earnings.",
        "• The economic recession during the 1980s forced the Qatari government to reduce spending plans, leading to a challenging local business environment and layoffs of expatriate workers.",
        "• Economic recovery in the 1990s resulted in a resurgence of expatriate populations, particularly from Egypt and South Asia.",
        "• Qatar's oil production peaked at approximately 500,000 barrels per day (80,000 m³/day), but oil fields were projected to be mostly depleted by 2023.",
        "• Significant natural gas reserves were discovered off Qatar’s northeast coast, including offshore gas fields that may also contain substantial oil and condensate reserves.",
        "• The state-owned QatarEnergy corporation identified two offshore oil fields in the 1960s; however, production was initially too costly and only commenced over 30 years later due to technological advancements.",
        "• Gas condensate from offshore fields can be refined into conventional oil products in specialized refineries, albeit at slightly higher costs, and is commonly utilized in the industry today.",
        "• In 2008, offshore oil production for PS-2 and PS-3 blocks amounted to about 31.1 million barrels (approximately 84,995 barrels per day).",
        "• Combined oil production from joint venture facilities PS-1, ALK, and K & A in 2008 was 57.4 million barrels (approximately 156,873 barrels per day).",
        "• Additional offshore blocks remain unexplored, potentially increasing oil output and delaying the anticipated depletion of oil fields beyond 2023.",
        "• Elevated oil prices have encouraged continued offshore exploration of oil and natural gas fields.",
        "• Oil production in June 2016 was approximately 670,000 barrels per day, slightly lower than the 692,000 barrels per day recorded in February 2016.",
        "• When considering all liquid hydrocarbons, Qatar’s total production already exceeds one million barrels per day.",
        "• Qatar possesses the third-largest proved natural gas reserves globally, exceeding 7,000 km³ (250 trillion cubic feet).",
        "• The completion of Phase I of the North Field gas development in 1991, costing $1.5 billion, significantly boosted Qatar’s economy.",
        "• The Qatargas project began exporting liquefied natural gas (LNG) to Japan in 1996, marking Qatar’s entry into the global LNG market.",
        "• Further phases of the North Field gas development, involving multi-billion dollar investments, are in various stages of planning and execution.",
        "• Qatar’s heavy industrial sector, concentrated in Umm Said, includes a refinery with a capacity of 50,000 barrels per day (8,000 m³/day), a fertilizer plant producing urea and ammonia, a steel plant, and a petrochemical plant.",
        "• These heavy industries primarily use natural gas as fuel and are mostly joint ventures between European and Japanese firms and the state-owned QatarEnergy corporation (formerly Qatar General Petroleum Corporation, QGPC).",
        "• The United States is the major supplier of equipment for Qatar’s oil and gas industry, with U.S. companies playing a significant role in the development of the North Field gas project.",
        "• Qatar implements a \"Qatarization\" policy aimed at increasing the representation of Qatari nationals in positions of authority within joint venture industries and government departments.",
        "• An increasing number of Qataris educated abroad, particularly in the United States, are returning to assume key roles previously held by expatriates.",
        "• To manage the influx of expatriate workers, Qatar has tightened the administration of its foreign manpower programs in recent years.",
        "• Qatar’s strict entry and immigration regulations are primarily motivated by security concerns."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:37.655401",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 27
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Industry",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Qatari government regards industry as a crucial component of its economic diversification strategy, aiming to maximize the utilization of its vast natural gas reserves, which serve as the primary feedstock for the industrial sector.",
        "• Industrial development in Qatar has been strategically planned, focusing on export potential and clustering around key energy-centered ports, specifically Ras Laffan Industrial City and Mesaieed Industrial Area.",
        "• This focused development approach has resulted in significant industrial growth over the years.",
        "• Industries Qatar (IQ) is a major regional industrial entity producing petrochemicals, fertilizers, and steel, ranking as the second-largest chemical producer in the Middle East after Saudi Basic Industries Corporation (SABIC).",
        "• In 2007, the manufacturing sector was the third-largest contributor to Qatar’s GDP among non-oil and gas sectors, accounting for approximately 7.5% of the total GDP.",
        "• The industrial sector in Qatar is regulated by the Ministry of Business and Trade, ensuring oversight and governance of industrial activities.",
        "• The industrial base in Qatar prominently includes petrochemicals and fertilizers, steel production, and other construction materials, with key companies such as Qatar Steel and Qatar Primary Material Company (QPMC) playing significant roles.",
        "• The demand for construction materials surged notably in recent years due to a regional development boom across the Persian Gulf.",
        "• The 2008 global financial crisis adversely affected demand in the Persian Gulf region as project financing became scarce and investor confidence weakened, impacting the entire industrial sector.",
        "• Industries Qatar experienced a dramatic decline in net profit in the fourth quarter of 2008, with profits dropping by more than 90% compared to the same period in the previous year.",
        "• Despite this downturn, the industrial sector in Qatar performed relatively better than many others, with IQ still achieving an annual profit of $2 billion in 2008.",
        "• Profits accumulated from previous years have been reinvested into capital projects, providing financial resilience to the sector during economic challenges.",
        "• Industries Qatar is advancing several major expansion projects valued at nearly $6 billion to sustain and grow the industrial sector amid economic uncertainties."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:29.871941",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 2
    },
    {
      "section_number": "2.1",
      "section_name": "North Field LNG project",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• On 8 February 2021, Qatar Petroleum, now known as QatarEnergy and recognized as the world's largest LNG supplier, signed an Engineering, Procurement, and Construction (EPC) contract with Chiyoda and Technip for the North Field East (NFE) expansion project.",
        "• The NFE expansion project aims to increase QatarEnergy’s annual LNG output by 40% by the year 2026.",
        "• The total investment for the NFE expansion project is valued at $28.7 billion.",
        "• QatarEnergy partnered with five global energy companies for the NFE project, which collectively acquired a 25% stake in the project.",
        "• The five partner companies and their respective stakes in the NFE project are: Shell (6.25%), TotalEnergies (6.25%), ExxonMobil (6.25%), Eni (3.125%), and ConocoPhillips (3.125%).",
        "• The first phase of the NFE project is expected to increase LNG export capacity from 77 million tons per year to 110 million tons per year by 2026.",
        "• On 20 June 2022, Saad Sherida Al-Kaabi, Minister of State for Energy, announced at a QatarEnergy press conference that the expected production increase from the NFE project would be 32.6 million tonnes annually.",
        "• Additional production outputs from the NFE project include 1.5 million tonnes of ethane per year, 4 million tonnes of liquefied petroleum gas (LPG) per year, 250,000 barrels of condensate per day, and 5,000 tonnes of helium per day.",
        "• The second phase of the North Field development, known as the North Field South (NFS) project, involves Shell and TotalEnergies each acquiring 9.375% stakes, and ConocoPhillips acquiring a 6.25% stake.",
        "• QatarEnergy plans to increase LNG production capacity to 126 million tons per year starting in 2028 through the NFS project.",
        "• In April 2023, Sinopec acquired a 5% stake in an LNG train with a capacity of 8 million tonnes per year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:32.315572",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 3
    },
    {
      "section_number": "3",
      "section_name": "Financial sector",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Qatari banking sector avoided direct impact from the global subprime mortgage crisis but experienced indirect aftershocks, maintaining resilience during the financial turmoil of 2008.",
        "• In the last quarter of 2008, Qatar's banking sector was the best performing among the Gulf Cooperation Council (GCC) markets, with most banks reporting substantial profits for the year 2008.",
        "• Despite profitability, the sector faced challenges including liquidity issues, declining customer confidence, and a reluctance among banks to extend new loans.",
        "• To strengthen the banking sector, the Qatar Investment Authority (QIA) announced in early 2009 its willingness to acquire 10-20% stakes in any interested local listed banks through capital injections; this offer was later reduced to 5% stakes initially, with an additional 5% stake offered by the end of 2009.",
        "• In March 2009, the Qatari government declared plans to purchase banks' investment portfolios to encourage continued lending and support banking activity.",
        "• The Qatar Central Bank (QCB) imposed lending restrictions, including a loan-to-deposit ratio cap of 90%, which further contributed to cautious sentiment within the banking sector.",
        "• Qatar's economy, highly integrated with the Persian Gulf region and global markets, faced an inevitable slowdown in business and banking activities during the global financial crisis.",
        "• Despite regional and global financial difficulties, Qatar's banking sector performed relatively well, with industry insiders expressing confidence that banking activity would regain momentum in the second half of 2009 as global confidence gradually recovered.",
        "• The International Monetary Fund (IMF), in its spring 2019 assessment, stated that Qatar had \"successfully absorbed the shocks\" from the 2017 blockade and the decline in oil prices between 2014 and 2016.",
        "• S&P Global downgraded Qatar’s credit outlook to negative in 2017 but revised it back to stable in 2019, reflecting improved economic conditions.",
        "• In August 2019, the Qatar Central Bank projected economic growth over the following two years, supported by stable oil prices and strong export performance.",
        "• Qatar’s GDP was expected to grow at an average annual rate of 2.8% between 2018 and 2020, with the budget surplus decreasing from 15.1 billion Qatari riyals in 2018 to 4.35 billion riyals in 2019.",
        "• According to a FocusEconomics report, Qatar’s GDP is forecasted to increase from $162 billion in 2022 to $208 billion in 2024.",
        "• The World Bank projected Qatar’s economy to be the fastest growing among GCC countries in 2023 and 2024."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:35.505565",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 4
    },
    {
      "section_number": "3.1",
      "section_name": "Islamic finance",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Islamic finance sector in Qatar experienced increased activity in 2008 and was anticipated to continue growing into 2009, driven by investor interest in more sophisticated financial instruments.",
        "• Key Islamic banks operating in Qatar include Qatar Islamic Bank (QIB), Qatar International Islamic Bank (QIIB), and the newcomer Masraf Al Rayyan.",
        "• Conventional banks in Qatar have been entering the sharia-compliant sector, increasingly viewing the establishment of Islamic subsidiaries as essential to maintaining their market position.",
        "• Islamic banks currently dominate the sharia-compliant business sector, although conventional banks are actively striving to capture a larger share of market activity.",
        "• During the first three quarters of 2008, both Islamic banks and Islamic subsidiaries performed exceptionally well, with overall financing activity increasing by 70.6% compared to the same period in 2007.",
        "• The global financial crisis of 2008 caused a slowdown in the growth of Islamic finance in Qatar.",
        "• Poor market conditions in 2008 led to a significant reduction in Islamic bond (sukuk) activity across the Persian Gulf region, including Qatar.",
        "• Despite the downturn in sukuk issuance, other segments of Islamic finance, such as Islamic insurance (takaful), did not experience a similar decline.",
        "• Challenges to the continued growth of Qatar’s Islamic finance sector include a shortage of qualified personnel capable of meeting the increasing demand for sharia-compliant banking services."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:29.956757",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 5
    },
    {
      "section_number": "3.2",
      "section_name": "Capital market",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The stock market capitalisation of listed companies in Qatar was valued at $95,487 million in 2007, according to the World Bank.",
        "• By the end of 2008, Qatar’s capital markets, including the Doha Securities Market (DSM), were affected by the global sub-prime mortgage fallout, reflecting widespread international financial turbulence.",
        "• Despite global challenges, there was considerable optimism that the DSM would remain relatively resilient amid ongoing international market instability.",
        "• The DSM followed a peak-trough pattern similar to many global markets, reaching record highs in mid-2008 before experiencing significant declines in late 2008 and early 2009.",
        "• Between December 2006 and July 2008, the DSM Index increased by approximately 117%, prior to the onset of the 2008 financial crisis which subsequently erased most of these gains.",
        "• In the first few months of 2009, the DSM lost about 40% of its value, reflecting the severity of the financial downturn.",
        "• To prevent further market decline, the Qatari government announced in February 2009 that it would intervene by purchasing shares of troubled banks, amounting to about 10% of the market’s total capitalisation.",
        "• This government intervention improved investor confidence and was intended to stabilize the market and prevent additional losses.",
        "• A proposal was made to establish a single unified regulator by 2010 to oversee all banking and financial services in Qatar, which was regarded as a promising reform expected to enhance and transform the financial sector."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:35.506384",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 6
    },
    {
      "section_number": "4",
      "section_name": "Travel and tourism",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Qatar Tourism and Exhibitions Authority (QTEA) implemented an ambitious five-year development plan aiming to increase the number of visitors from 964,000 in 2007 to 1.5 million by 2010.",
        "• To support this tourism growth target, the Qatari government allocated approximately $17 billion in 2008 for tourism development through 2014, with the majority of funds directed towards hotels, exhibition spaces, and infrastructure projects.",
        "• The government set a specific objective to increase hotel capacity by 400% by the year 2012 to accommodate the rising number of tourists.",
        "• Beyond financial investment, the government sought to stimulate private sector involvement by easing business regulations related to tourism and hospitality.",
        "• A key infrastructure project under the expansion plan is Hamad International Airport, designed with the capacity to handle up to 24 million passengers annually.",
        "• Qatar Airways, a government-owned airline established in 1993, operates flights to over 100 international destinations, playing a significant role in facilitating travel to and from Qatar.",
        "• Qatar has targeted niche tourism sectors such as cultural tourism, highlighted by the high-profile opening of Doha’s Museum of Islamic Art, which has attracted international attention.",
        "• Sports tourism has also been emphasized, initially catalyzed by Qatar hosting the Asian Games in 2006, further bolstered by Qatar hosting the 2022 FIFA World Cup."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:38.372259",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 7
    },
    {
      "section_number": "5",
      "section_name": "Transport",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Qatar has experienced a fast-expanding population and substantial economic growth over the past decade, necessitating a reliable and extensive transportation network within the country.",
        "• The Qatari government serves as the primary developer of transportation infrastructure and has effectively kept pace with the increasing demand for new transportation options.",
        "• In 2008, the Public Works Authority (Ashghal), responsible for overseeing infrastructure development, underwent a major reorganisation aimed at streamlining and modernising the authority to prepare for significant project expansions across all infrastructure segments.",
        "• Ashghal collaborates closely with the Urban Planning and Development Authority (UPDA), which designed Qatar’s transportation master plan instituted in March 2006 and scheduled to run until 2025.",
        "• Driving is the primary mode of transport in Qatar, making the road network a central focus of the national transportation plan.",
        "• Key road infrastructure projects include the multibillion-dollar Doha Expressway and the Qatar Bahrain Causeway, the latter intended to connect Qatar with Bahrain and Saudi Arabia and regarded as a milestone in regional interconnectivity.",
        "• Mass-transit initiatives under development include the Doha metro, a light-rail system, and expanded bus networks, all aimed at reducing road congestion.",
        "• The railway system in Qatar is undergoing significant expansion and is envisioned to eventually integrate into a Gulf Cooperation Council (GCC)-wide network linking all six member states.",
        "• The New Doha International Airport is one of Qatar’s largest infrastructure projects and is expected to have a passenger capacity of 50 million upon its completion in 2015, addressing the rising number of visitors.",
        "• Port infrastructure is a critical component of Qatar’s economic development strategy, particularly to support liquefied natural gas (LNG) and industrial exports; the port at Mesaieed is currently undergoing expansion.",
        "• Despite potential challenges posed by the 2008 global financial crisis, the completion of these projects will position Qatar as having one of the most advanced and modern transport infrastructures in the region.",
        "• Fisheries remain a minor sector in Qatar, with production primarily for domestic consumption, as illustrated by the scene in the harbour of Al Khor."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:41.183038",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 8
    },
    {
      "section_number": "6",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Qatar",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Qatar ranks among the richest countries globally on a per capita basis, with its GDP per capita experiencing a record-breaking peak growth of 1,156% during the 1970s.",
        "• The rapid growth in the 1970s became unsustainable due to the 1980s oil glut, leading to a 53% contraction in Qatar's GDP per capita during the 1980s.",
        "• In the 1990s, rising global oil demand contributed to a 94% expansion in Qatar's GDP per capita.",
        "• Despite initiatives to diversify the economy towards non-hydrocarbon and knowledge-based sectors, the oil and gas sector has consistently accounted for at least 80% of the government of Qatar’s total revenues since 2014.",
        "• The oil and gas sector also represents 90% of Qatar’s total exports, underscoring the economy's heavy reliance on hydrocarbons.",
        "• In 2020, Qatar's GDP based on purchasing power parity (PPP) was approximately 260 billion US dollars.",
        "• According to International Monetary Fund (IMF) estimates, Qatar's gross domestic product at market prices in millions of Qatari Rials and other economic indicators for selected years are as follows:",
        "• 1980: GDP 28,631 million Qatari Rials; US Dollar exchange rate 3.65 Qatari Riyals; inflation index (2000=100) at 53; per capita income at 266.18% of the USA.",
        "• 1985: GDP 22,829 million Qatari Rials; exchange rate 3.63; inflation index 64; per capita income 104.82% of the USA.",
        "• 1990: GDP 26,792 million Qatari Rials; exchange rate 3.64; inflation index 77; per capita income 67.85% of the USA.",
        "• 1995: GDP 29,622 million Qatari Rials; exchange rate 3.63; inflation index 85; per capita income 55.75% of the USA.",
        "• 2000: GDP 64,646 million Qatari Rials; exchange rate 3.63; inflation index 100; per capita income 86.03% of the USA.",
        "• 2005: GDP 137,784 million Qatari Rials; exchange rate 3.64; inflation index 115; per capita income 127.05% of the USA.",
        "• For purchasing power parity comparisons, the US Dollar is exchanged at a fixed rate of 3.67 Qatari Riyals.",
        "• In 2009, mean wages in Qatar were recorded at $59.99 per man-hour.",
        "• The International Bank of Qatar reported in February 2012 that Qatar’s GDP grew by 19.9% in 2011, but projected a slowdown in growth to 9.8% for 2012.",
        "• The IMF noted that Qatar’s economic performance improved in 2018 despite an ongoing economic embargo; GDP growth was expected to increase from 2.2% in 2018 to 2.6% in 2019.",
        "• Key macroeconomic indicators for Qatar from 1980 to 2024, including GDP in billion US dollars (PPP and nominal), GDP per capita in US dollars (PPP), real GDP growth rates, inflation rates, and government debt as a percentage of GDP, reveal the following trends:",
        "• In the 1980s, Qatar experienced fluctuating GDP growth with negative real growth rates in several years (e.g., −1.0% in 1980, −8.2% in 1982, −13.0% in 1985), inflation rates varied between 1.1% and 8.5%, and government debt data was not available.",
        "• The 1990s showed recovery and growth with real GDP growth rates ranging from −14.6% in 1990 to 27.7% in 1997, inflation rates mostly below 3%, and government debt rising from 12.6% in 1990 to a peak of 81.8% in 1999.",
        "• The early 2000s saw steady GDP growth with real growth rates between 1.9% and 19.2%, inflation rates generally low (below 7%), and government debt decreasing from 51.6% in 2000 to 19.1% in 2005.",
        "• Between 2006 and 2010, Qatar experienced rapid GDP growth with real growth rates up to 28.1% in 2006, inflation rates fluctuating between −4.9% and 15.1%, and government debt declining to 30.4% by 2010.",
        "• From 2011 to 2015, GDP growth remained positive but moderated, ranging from 4.7% to 11.3%, inflation rates stayed low (0.9% to 4.2%), and government debt fluctuated between 24.9% and 35.5%.",
        "• The period 2016 to 2020 saw mixed economic performance with real GDP growth declining to −3.6% in 2020, inflation rates mostly below 3%, and government debt rising to 72.6% of GDP in 2020.",
        "• Recent years from 2021 to 2024 indicate economic recovery and growth with GDP growth rates between 1.2% and 4.2%, inflation rates ranging from 1.0% to 5.0%, and government debt decreasing to 41.2% of GDP by 2024.",
        "• Inflation rates below 2% during the period 1980–2024 are highlighted as significant, indicating periods of price stability in Qatar’s economy.",
        "• Government debt as a percentage of GDP showed considerable variation over the decades, peaking in the late 1990s and early 2000s, then generally declining in recent years to around 41.2% projected for 2024.",
        "• Qatar’s GDP per capita in PPP terms increased substantially from $56,086 in 1980 to an estimated $115,075 in 2024, reflecting sustained economic growth and rising living standards.",
        "• The nominal GDP in billion US dollars rose from $6.7 billion in 1980 to a projected $221.4 billion in 2024, demonstrating significant expansion of the Qatari economy over four decades."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:50:56.494340",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 29
      },
      "source_file": "economy_of_qatar.json",
      "original_index": 9
    }
  ]
}