{
  "extraction_info": {
    "source_file": "economy_of_bhutan.json",
    "extraction_timestamp": "2025-08-02T17:13:27.525548",
    "total_sections_in_source": 4,
    "extracted_sections_count": 4,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Bhutan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Bhutan is primarily based on agriculture and forestry, which provide the main livelihood for over 60% of the population.",
        "• Agriculture in Bhutan mainly consists of subsistence farming and animal husbandry.",
        "• The country's rugged mountainous terrain complicates the construction of roads and infrastructure.",
        "• As of 2022, Bhutan is among the richest in South Asia in terms of gross domestic product (GDP) per capita, with a nominal value of $3,491.",
        "• Despite this relatively high per capita GDP, Bhutan ranks 153rd globally and is considered one of the poorest countries in the world.",
        "• The total GDP of Bhutan is approximately $2.898 billion, ranking 178th according to the International Monetary Fund (IMF).",
        "• Bhutan's economy is closely linked with India through strong trade and monetary connections and relies heavily on Indian financial assistance.",
        "• The industrial sector in Bhutan is predominantly composed of cottage industries.",
        "• Most development projects, including road construction, depend on Indian migrant labor.",
        "• Bhutan is implementing model education, social, and environmental programs with support from multilateral development organizations.",
        "• Economic programs in Bhutan are designed to prioritize environmental protection and the preservation of cultural traditions.",
        "• The government promotes eco-friendly tourism by encouraging visits from upscale, environmentally conscious tourists, while maintaining cautious expansion policies.",
        "• Foreign investment is hindered by detailed controls and uncertain policies in areas such as industrial licensing, trade, labor, and finance.",
        "• Hydropower exports to India have significantly contributed to Bhutan’s economic growth, although GDP declined in 2008 due to a slowdown in India, its main export market.",
        "• Since 1961, the Bhutanese government has directed the economy through five-year development plans aimed at promoting economic growth.",
        "• In the 1970s, Bhutan’s King prioritized Gross National Happiness (GNH) over Gross Domestic Product (GDP) as a measure of national progress.",
        "• On 8 December 2023, Bhutan graduated from the United Nations' list of least developed countries (LDCs), becoming only the 7th country to do so and the first in three years."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:44:07.718176",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_bhutan.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Bhutan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The macroeconomic trend of Bhutan’s Gross Domestic Product (GDP) at market prices has been documented by the International Monetary Fund (IMF), with data spanning from 1985 to 2017.",
        "• In 1985, Bhutan’s GDP was approximately 2,166 million Bhutanese Ngultrum (BTN), equivalent to about 175 million US Dollars (USD).",
        "• By 1990, GDP increased to approximately 4,877 million BTN, or roughly 279 million USD.",
        "• In 1995, GDP further grew to approximately 9,531 million BTN, with an approximate value of 294 million USD.",
        "• The year 2000 saw GDP reach approximately 20,060 million BTN, equivalent to about 460 million USD.",
        "• In 2005, GDP was approximately 36,915 million BTN, or roughly 828 million USD.",
        "• By 2008, GDP had increased to approximately 45,000 million BTN, valued at around 1,280 million USD.",
        "• In 2011, Bhutan’s GDP was approximately 84,950 million BTN, or about 1,695 million USD.",
        "• In 2014, GDP reached approximately 119,546 million BTN, equivalent to roughly 1,784 million USD.",
        "• The 2017 data indicates a GDP of approximately 159,572 million BTN, or about 2,294 million USD.",
        "• Bhutan’s economy is significantly driven by its hydropower potential and tourism industry, which are considered key resources for the nation.",
        "• The Bhutanese Government has made notable progress in expanding the country’s productive base and enhancing social welfare programs.",
        "• In 2010, Bhutan became the first country in the world to ban smoking and the sale of tobacco entirely.",
        "• During the COVID-19 pandemic, Bhutan introduced the Tobacco Control Rules and Regulations (TCRR) in 2021, which permitted the import, sale, and consumption of tobacco products to combat cross-border smuggling."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:44:12.939611",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_bhutan.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Membership of economic organizations and agreements",
      "chapter_name": "Economy of Bhutan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Bhutan is a member of several regional and international trade organizations, including the South Asian Free Trade Area (SAFTA), the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation (BIMSTEC), and the South Asia Subregional Economic Cooperation (SASEC).",
        "• Additionally, Bhutan is a member of the pan-Asian Asia Cooperation Dialogue (ACD) and the Asian Development Bank (ADB).",
        "• Bhutan first applied to join the World Trade Organization (WTO) in 1999 and was granted observer status shortly thereafter.",
        "• The country's accession proceedings at the WTO have been significantly delayed and periodically paused, primarily due to concerns and considerations raised by the Bhutanese government itself.",
        "• The Bhutanese government officially approved its accession to the WTO in April 2023.",
        "• The approval in April 2023 was partly motivated by Bhutan’s upcoming graduation from the United Nations-defined 'least developed country' (LDC) category.",
        "• Under WTO rules, the accession of a country with LDC status benefits from certain leniencies, including more relaxed compliance timeframes and additional support.",
        "• Bhutan’s graduation from the LDC category was finalized in December 2023, marking a milestone in its development progress.",
        "• The loss of LDC status in December 2023 reflected Bhutan’s development achievements but also resulted in further delays in completing WTO accession, as the process after losing LDC status becomes more challenging.",
        "• The delays and considerations in Bhutan’s WTO accession process highlight the complex interplay between development status, international trade commitments, and national government concerns."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:44:17.956935",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_bhutan.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Modern economic resources",
      "chapter_name": "Economy of Bhutan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since the early 2020s, Bhutan has adopted cryptocurrency, particularly Bitcoin, as a strategic economic resource to address various economic challenges.",
        "• The country has faced declining tourism revenue, which has impacted its overall economic stability.",
        "• Youth unemployment in Bhutan reached 19% in 2024, prompting government intervention.",
        "• Bhutan is experiencing a growing brain drain, with skilled professionals emigrating for better opportunities elsewhere.",
        "• To mitigate economic issues, the Bhutanese government began mining Bitcoin using surplus hydropower generated during high-flow summer months.",
        "• By 2023, Bhutan had sold approximately $100 million worth of cryptocurrency to double the salaries of civil servants, which contributed to a reduction in resignations among government employees.",
        "• As of April 2025, blockchain analysts estimate Bhutan's Bitcoin holdings to be over $600 million, representing about 30% of the country's Gross Domestic Product (GDP).",
        "• The Bitcoin mining operations in Bhutan are powered by the country's abundant, carbon-negative hydropower resources and its cool climate, aligning with Bhutan’s environmental conservation values.",
        "• Bhutan plans to develop Gelephu Mindfulness City, envisioned as a sustainable economic hub to promote eco-friendly development and economic diversification."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:44:22.664583",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_bhutan.json",
      "original_index": 3
    }
  ]
}