{
  "extraction_info": {
    "source_file": "economy_of_guinea-bissau.json",
    "extraction_timestamp": "2025-08-02T17:13:27.980698",
    "total_sections_in_source": 12,
    "extracted_sections_count": 12,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Guinea-Bissau consists of a combination of state-owned enterprises and private companies.",
        "• Guinea-Bissau is classified as one of the world's least developed nations and ranks among the 10 poorest countries globally.",
        "• The country's economy primarily relies on agriculture and fishing activities.",
        "• Cashew crop production has experienced significant growth in recent years, contributing notably to the economy.",
        "• In 2019, Guinea-Bissau ranked ninth in global cashew nut production.",
        "• The country's exports to Asia include non-fillet frozen fish and seafood, peanuts, palm kernels, and timber.",
        "• The government derives some revenue from license fees paid for fishing rights within Guinea-Bissau's maritime zone, located in the Gulf of Guinea.",
        "• Rice is the main crop cultivated in Guinea-Bissau and serves as the staple food for its population.",
        "• European regulations have led to a complete ban on exports of fish and cashew nuts to Europe, along with a general prohibition on agricultural exports to European markets."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:18:46.537716",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 0
    },
    {
      "section_number": "0.1",
      "section_name": "Early colonialism",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The flag of the Guinea Company, a Portuguese enterprise, symbolized their trade activities in various commodities and slaves along the Guinea coast starting from the 15th century.",
        "• The economic history of the Guinea Coast from a European perspective is predominantly linked to the transatlantic and trans-Saharan slave trade, with the region historically known as the Slave Coast.",
        "• Portuguese exploration along the Atlantic coast of Africa began in the 1430s, initially driven by the pursuit of gold.",
        "• The region gained prominence for wealth following Mansa Musa’s 1325 pilgrimage to Mecca, during which he traveled with 500 slaves and 100 camels carrying gold, establishing the area’s association with immense wealth.",
        "• The sub-Saharan African trade was controlled by the Islamic Empire, which extended along Africa’s northern coast, facilitating trade routes across the Sahara that involved salt, kola nuts, textiles, fish, grain, and slaves.",
        "• As Portuguese influence expanded along the coast—reaching Mauritania, Senegambia (by 1445), and Guinea—they established trading posts without directly competing with Muslim merchants; instead, increased European and Mediterranean trade created additional opportunities across the Sahara.",
        "• Portuguese traders gained access to inland regions via the Sénégal and Gambia rivers, which intersected long-standing trans-Saharan trade routes.",
        "• Portuguese trade goods included copper ware, cloth, tools, wine, horses, arms, and ammunition.",
        "• In exchange, the Portuguese obtained gold (from mines in the Akan deposits), pepper (a trade that continued until Vasco da Gama’s voyage to India in 1498), and ivory.",
        "• There was limited demand for African slaves in Europe as domestic workers and on Mediterranean sugar plantations; however, transporting slaves along the Atlantic coast proved lucrative for the Portuguese.",
        "• Muslim merchants had a high demand for slaves, used as porters on trans-Saharan routes and for sale within the Islamic Empire, with Muslim traders established along the African coast as far south as the Bight of Benin.",
        "• Prior to European contact, the African slave trade was not a dominant feature of Guinea’s coastal economy; it expanded significantly after the Portuguese arrived in 1446, bringing wealth to local slave-trading tribes.",
        "• The Portuguese utilized slave labor to develop and colonize the uninhabited Cape Verde islands, establishing settlements and cultivating cotton and indigo, which they traded at the Geba River estuary for slaves captured through local African wars and raids.",
        "• Slaves were sold in Europe and, from the 16th century onward, in the Americas.",
        "• The Company of Guinea, a Portuguese government institution, was responsible for managing spice trade and regulating the prices of goods; it was known as _Casa da Guiné_, _Casa da Guiné e Mina_ (1482–1483), and _Casa da Índia e da Guiné_ (1499).",
        "• Local African rulers in Guinea, who profited greatly from the slave trade, limited European inland penetration, restricting Portuguese presence largely to the fortified port of Bissau."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:18:57.048306",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 1
    },
    {
      "section_number": "0.2",
      "section_name": "Colonial era",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the colonial era, Portugal exercised control over the coastal areas of Portuguese Guinea, similar to other Portuguese territories in mainland Africa such as Angola and Mozambique, initially claiming the entire region as a colony.",
        "• Portuguese efforts to establish dominance involved costly and continuous campaigns spanning three decades aimed at suppressing local African rulers, a process completed by 1915.",
        "• By 1915, the suppression of local rulers allowed Portuguese colonial rule to proceed relatively smoothly until the rise of African nationalist movements in the 1950s.",
        "• In the 1790s, the British briefly attempted to establish a presence on an offshore island at Bolama, but by the 19th century, the Portuguese had secured control over Bissau and regarded the neighboring coastline as their exclusive territory.",
        "• Portugal formally claimed the region as Portuguese Guinea during the European scramble for Africa in the 1880s, asserting sovereignty over the territory.",
        "• Britain's interest in the region declined after the end of the British slave trade in 1807, and following the abolition of slavery in Portuguese overseas territories in the 1830s, the transatlantic slave trade significantly diminished.",
        "• Portugal's main colonial rivals in the region were France, with neighboring colonies along the coast in Senegal and what became French Guinea; however, the French did not dispute Portuguese presence in Guinea.",
        "• The primary point of contention between Portugal and France was the precise delineation of borders, which was resolved through negotiations in two series of agreements: one in 1886 and another between 1902 and 1905.",
        "• Until the late 19th century, the main export from Portuguese Guinea was rubber, which constituted the primary economic activity during that period."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:02.817418",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 2
    },
    {
      "section_number": "0.3",
      "section_name": "As an overseas province",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1951, the Portuguese government implemented a comprehensive overhaul of its colonial system, resulting in all of Portugal's colonies being renamed as Overseas Provinces (_Províncias Ultramarinas_).",
        "• This reorganization included the renaming of Portuguese Guinea, among other colonies, to reflect its new status as an Overseas Province.",
        "• The colonial administration invested in the development of infrastructure across various sectors, including education, health, agriculture, transportation, commerce, services, and administration, to support the colony’s integration and economic development.",
        "• The primary economic activities in Portuguese Guinea during this period included the production of cashew, peanut, rice, timber, livestock, and fish, which constituted the main sources of economic output.",
        "• The port of Bissau served as a critical economic hub, acting as one of the main employers within the colony and serving as a significant source of tax revenue for the colonial authorities."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:06.710848",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 3
    },
    {
      "section_number": "0.3.1",
      "section_name": "Independence war",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The fight for independence in Guinea-Bissau began in 1956 with the founding of the Partido Africano da Independência da Guiné e Cabo Verde (PAIGC) by Amílcar Cabral.",
        "• In 1961, after limited progress through purely political means, the PAIGC adopted guerrilla warfare tactics to pursue independence.",
        "• The guerrilla forces were heavily outnumbered by Portuguese troops, with approximately 30,000 Portuguese soldiers facing around 10,000 PAIGC guerrillas.",
        "• The PAIGC had a strategic advantage due to safe havens in neighboring Senegal and Guinea, both of which had recently gained independence from French colonial rule.",
        "• Several communist countries supported the PAIGC guerrillas by providing weapons and military training, indicating international communist support for the independence movement.",
        "• The conflict between the PAIGC guerrillas and the Portuguese Army in Portuguese Guinea was the most intense and damaging of all the Portuguese Colonial Wars.",
        "• During the 1960s and early 1970s, Portuguese development plans aimed at promoting strong economic growth and socioeconomic policies were hindered by the ongoing conflict, similar to the situations in Portuguese Angola and Mozambique.",
        "• In 1972, Amílcar Cabral established a government in exile in Conakry, the capital of neighboring Guinea.",
        "• Cabral was assassinated in 1973 outside his residence in Conakry, just one year before a left-wing military coup in Portugal significantly changed the political landscape.",
        "• By 1973, the PAIGC controlled most of the interior regions of Guinea-Bissau, while the coastal and estuary towns, including major population and economic centers, remained under Portuguese control.",
        "• The village of Madina do Boé, located in the southeasternmost part of Guinea-Bissau near the border with Guinea, was where the PAIGC guerrillas declared the independence of Guinea-Bissau on September 24, 1973.",
        "• The colonial war became increasingly unpopular within Portugal itself, as public fatigue and rising costs led to widespread discontent.",
        "• Following the Portuguese coup d'état in 1974, the new left-wing revolutionary government of Portugal began negotiations with the PAIGC and decided to grant independence to all Portuguese overseas territories, including Guinea-Bissau."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:15.618651",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 4
    },
    {
      "section_number": "0.4",
      "section_name": "After independence",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Luís Cabral became the first president of independent Guinea-Bissau following the country's independence on September 10, 1974, succeeding his brother Amílcar Cabral, who was assassinated in 1973.",
        "• As president, Luís Cabral attempted to implement a planned economy and supported a socialist model, which ultimately left Guinea-Bissau’s economy in ruins.",
        "• His regime was characterized by authoritarian single-party rule, which imposed repression on the population and contributed to severe food shortages.",
        "• Luís Cabral served as president from 1974 until 1980, when he was deposed in a military coup led by João Bernardo \"Nino\" Vieira.",
        "• Despite denying involvement, Luís Cabral was accused of being responsible for the deaths of many black Guinea-Bissauan soldiers who fought alongside the Portuguese Army against PAIGC guerrillas during the Portuguese Colonial War.",
        "• In 1980, the PAIGC officially acknowledged in its newspaper \"Nó Pintcha\" (dated November 29, 1980) that many executed soldiers were buried in unmarked collective graves in the woods of Cumerá, Portogole, and Mansabá.",
        "• The post-independence period did not see Guinea-Bissau achieving the promised levels of prosperity, economic growth, or development.",
        "• In 1985, Guinea-Bissau received its first Chinese overseas fishing fleet, consisting of 13 trawlers from the China National Fisheries Corporation.",
        "• In May 1997, Guinea-Bissau joined the francophone West African Monetary Union.",
        "• Following this accession, the National Bank of Guinea-Bissau was converted into a branch of the Central Bank of West African States.",
        "• The national currency, the Guinea Bissau peso, was replaced by the West African CFA franc."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:24.388075",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 5
    },
    {
      "section_number": "0.5",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the April 2012 coup d'État in Guinea-Bissau, the country's economic growth sharply declined to a rate of -1.5% of GDP, indicating a significant contraction in economic activity.",
        "• In 2013, Guinea-Bissau experienced a modest GDP growth of only 0.9%, reflecting continued economic stagnation during a period of ongoing political transition.",
        "• The low growth rate during this democratic transition period is attributed to a combination of factors including low administrative efficiency, insufficient investments driven by political instability, and a poor cashew export season.",
        "• Key macroeconomic indicators estimated by the African Development Bank for Guinea-Bissau are as follows:",
        "• The civil war in 1998, characterized by intermittent fighting between Senegalese-backed government troops and a military junta, caused extensive infrastructure destruction and widespread economic damage, including a 28% GDP decline that year.",
        "• During the 1998 conflict, agricultural production fell by an estimated 17%, with cashew nut output—the country’s main export crop—declining by approximately 30%.",
        "• The global cashew prices dropped by more than 50% in 2000, exacerbating the economic devastation caused by the civil war.",
        "• Prior to the civil war, trade reform and price liberalization were the most successful components of Guinea-Bissau’s structural adjustment program under IMF sponsorship, alongside monetary tightening and private sector development efforts.",
        "• Post-conflict economic recovery was supported by a government program with IMF and World Bank assistance, leading to an almost 8% increase in real GDP in 1999.",
        "• In December 2000, Guinea-Bissau qualified for nearly $800 million in debt-service relief under the first phase of the enhanced Highly Indebted Poor Countries (HIPC) initiative.",
        "• The country was scheduled to submit its Poverty Reduction Strategy Paper in March 2002, which was a condition for receiving the bulk of assistance under the enhanced HIPC initiative.",
        "• The development of petroleum, phosphate, and other mineral resources remains unviable in the near term due to high extraction costs; currently, Guinea-Bissau produces approximately 400,000 barrels of petrol per day.",
        "• Mean wages in 2009 were approximately $0.52 per man-hour.",
        "• In 2019, the minimum monthly wage was around 35,000 CFA, equivalent to approximately US$60.",
        "• The main economic indicators from 1980 to 2017 show gradual growth:"
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:35.688314",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 6
    },
    {
      "section_number": "0.6",
      "section_name": "Financial sector",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The financial sector of Guinea-Bissau is considered relatively underdeveloped.",
        "• In 2013, financial intermediation represented only 4% of the country's Gross Domestic Product (GDP).",
        "• Banking penetration in Guinea-Bissau was below 1% of the population as of 2013, indicating limited access to banking services (IMF 2013, Article IV Consultations – Guinea-Bissau, IMF Country Report No 13/197).",
        "• Access to finance is identified as the second most significant constraint faced by businesses in Guinea-Bissau.",
        "• As of 2015, only four banks were operating within the country.",
        "• According to the IMF, regional private foreign banks held approximately 65% of shares in the Bissau-Guinean banking system (IMF 2013).",
        "• The banking sector is regulated by authorities of the West African Economic and Monetary Union (WAEMU).",
        "• Following the civil war of 1998/1999, private sector credit in Guinea-Bissau declined to below 1% of GDP.",
        "• In 2003, the total balance sheets of banks in Guinea-Bissau amounted to EUR 21.3 million.",
        "• Since 2003, credit extended to the economy has increased significantly, reaching nearly 13.8% of GDP."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:41.338315",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 7
    },
    {
      "section_number": "0.7",
      "section_name": "\"Terra Ranka\" (A fresh start): a new economic plan",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• On March 25, 2015, the Government of Guinea-Bissau organized an international donor conference in Brussels to promote its new economic vision.",
        "• The conference was hosted by the European Union with support from the United Nations Development Programme (UNDP), the African Development Bank, and the World Bank, indicating broad international backing.",
        "• Major international partners expressed support and welcomed Guinea-Bissau’s new strategic plan aimed at development up to the year 2025.",
        "• During the conference, pledges from donors and partners amounted to a total of EUR 1.3 billion to support the country’s development initiatives.",
        "• The country's new strategic and operational plan is titled \"Terra Ranka,\" which translates to \"A fresh start,\" signifying a new beginning for Guinea-Bissau’s economy.",
        "• The \"Terra Ranka\" plan is structured around six key pillars: (i) peace and governance, (ii) infrastructure, (iii) industrialization, (iv) urban development, (v) human development, and (vi) biodiversity.",
        "• Each of these six pillars comprises a series of structuring projects designed to be financed through direct donor support or by mobilizing private sector funding."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:44.290772",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 8
    },
    {
      "section_number": "1",
      "section_name": "Income from waste dumping",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the 1980s, Guinea-Bissau participated in a broader African trend of utilizing waste dumping as a source of income.",
        "• Plans to import toxic waste from Europe into Guinea-Bissau were ultimately canceled following an international campaign aimed at stopping the trade.",
        "• The Guinean government was offered a contract to dispose of 15 million tons of toxic waste over a 15-year period.",
        "• The income generated from this contract was equivalent to twice the total value of Guinea-Bissau's external debt at the time.",
        "• Due to strong diplomatic and environmental pressure from other African nations and environmental groups, the Guinea-Bissau government decided to renounce the toxic waste disposal deal."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:49.001033",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 9
    },
    {
      "section_number": "2",
      "section_name": "Drug trafficking",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Over the last decade, European consumption of cocaine is believed to have tripled, indicating a significant increase in demand within Europe.",
        "• West Africa has emerged as a primary transit hub for cocaine trafficking originating from Colombia en route to Europe.",
        "• Guinea-Bissau is identified as the leading country in West Africa for cocaine transit activities, serving as a key logistical point in the trafficking network.",
        "• Drug smugglers exploit Guinea-Bissau’s government corruption and political disorder to operate with minimal interference.",
        "• Allegations suggest that both the army and police forces in Guinea-Bissau are complicit in drug trafficking activities, facilitating the movement of cocaine.",
        "• The country’s lack of sufficient maritime patrol resources, such as boats and planes, hampers effective surveillance of its extensive sea zones, allowing traffickers to operate with impunity.",
        "• Cocaine shipments from Latin America often pass through Guinea-Bissau’s territorial waters and islands without interference due to these operational gaps.",
        "• The local population in Guinea-Bissau generally does not have access to or use of the drug, indicating that trafficking is primarily a transnational activity rather than local consumption.",
        "• Cocaine planes typically fly into Guinea-Bissau, utilizing its 88 remote islands, most of which are uninhabited, to facilitate clandestine landings and transportation."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:53.710574",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 10
    },
    {
      "section_number": "3",
      "section_name": "Energy",
      "chapter_name": "Economy of Guinea-Bissau",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2019, only 28% of the total population of Guinea-Bissau had access to electricity.",
        "• Access to electricity was significantly lower in rural areas, with only 7% of the rural population having access.",
        "• In urban areas, 56% of the population had access to electricity, indicating a substantial urban-rural disparity.",
        "• In 2016, nearly all of Guinea-Bissau’s electricity generation capacity (99%) was derived from fossil fuel sources.",
        "• Only a small fraction (1%) of the country's electricity generation capacity in 2016 was sourced from renewable energy sources."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:19:56.886970",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_guinea-bissau.json",
      "original_index": 11
    }
  ]
}