{
  "extraction_info": {
    "source_file": "economy_of_paraguay.json",
    "extraction_timestamp": "2025-08-02T17:13:28.683833",
    "total_sections_in_source": 19,
    "extracted_sections_count": 19,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Paraguay is characterized as a market economy with a strong dependence on agricultural products.",
        "• In recent years, Paraguay's economic growth has been driven primarily by increased agricultural exports, with soybeans being a particularly significant export commodity.",
        "• Paraguay benefits economically from having a young population, which can contribute to labor force growth and economic dynamism.",
        "• The country possesses vast hydroelectric power resources, which constitute a notable economic advantage.",
        "• Paraguay faces economic disadvantages including limited mineral resources and ongoing political instability, which can hinder sustained economic development.",
        "• The Paraguayan government maintains a policy that is welcoming to foreign investment, aiming to attract external capital inflows.",
        "• Agriculture accounts for approximately 30% of Paraguay’s Gross Domestic Product (GDP), underscoring its central role in the national economy.",
        "• Land ownership in Paraguay is highly concentrated, with official statistics indicating that 5% of landowners control 90% of the land, reflecting significant land distribution inequality."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:46:51.141137",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Overview",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay is classified as a middle-income country that underwent rapid transformation during the 1970s and 1980s, driven primarily by hydroelectric development, agricultural colonization, construction projects, and the expansion of cash crop exports.",
        "• In 1986, Paraguay's gross domestic product (GDP) was approximately US$3.4 billion, equating to roughly US$1,000 per capita, positioning Paraguay just above Bolivia in economic rankings among South American countries.",
        "• Paraguay had the most agriculture-dependent economy in South America during this period, with the agricultural sector significantly influencing the performance of nearly every other economic sector.",
        "• The country's heavy reliance on agriculture combined with low tax collection rates exacerbated wealth inequality, contributing to a widening gap in wealth distribution.",
        "• Between 2001 and 2012, extreme poverty in Paraguay increased from 16% to 20%, despite overall economic growth during that timeframe.",
        "• By 2013, Paraguay’s Human Development Index (HDI) was 0.669, a figure lower than that of Bolivia, indicating relatively poor human development outcomes.",
        "• The economic boom known as the \"Paraguayan economic miracle\" of the 1970s ended in 1982 due to the completion of the Itaipú hydroelectric dam construction, declining global commodity prices for cotton and soybeans, and a worldwide recession.",
        "• The Paraguayan economy experienced recovery in 1984 and 1985, stagnation in 1986, and resumed expansion in 1987 and 1988.",
        "• Despite rapid growth, Paraguay’s economy became increasingly dependent on soybean and cotton exports, both vulnerable to external price volatility and variable local weather conditions.",
        "• Post-World War II economic growth occurred under political stability characterized by authoritarian governance and patronage politics, with consistent government policies from 1954 to the late 1980s favoring a strong private enterprise sector and significant foreign investment.",
        "• Unlike many Latin American countries, Paraguay maintained generally low import tariffs, manageable fiscal deficits, and exchange rates that were not overvalued during much of the postwar period.",
        "• In the 1980s, these trends weakened as the government increased its involvement in industry, fiscal deficits rose, and the national currency experienced multiple episodes of overvaluation and devaluation.",
        "• Paraguay had no personal income tax throughout the post-World War II era, and government revenues as a percentage of GDP were among the lowest globally.",
        "• Despite sustained economic growth in the postwar period, economic benefits were distributed very inequitably, with income inequality worsening during the 1970s according to most economists.",
        "• Government expenditure on social services was notably insufficient, contributing to persistent poverty, which was predominantly a rural issue.",
        "• Rural poverty increasingly involved land competition in the eastern region near the Brazilian border, particularly in the departments of Alto Paraná, Canendiyú, and Caaguazú.",
        "• Unlike many developing countries, Paraguay did not face acute social problems related to land tenure.",
        "• Paraguay faced significant challenges to future economic development due to limited natural resources, including little oil, no precious metals, and no sea coastlines.",
        "• The country was self-sufficient in many respects and endowed with fertile land, dense forests, and fast-flowing rivers, providing a strong natural resource base.",
        "• Economic expansion in the eastern border region and ongoing agricultural development were expected to drive rapid changes in Paraguay’s previously isolated economy.",
        "• The development of hydroelectric plants along the Río Paraná connected Paraguay to neighboring countries, granting access to valuable energy resources and generating crucial export revenues.",
        "• Road construction projects improved internal connectivity among Paraguay’s departments and provided the country with its first access to the Atlantic Ocean via Brazil.",
        "• By the late 1980s, infrastructure development, hydroelectric expansion, agricultural colonization, and a surge in cash crop production enabled Paraguay to begin realizing its economic potential."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:00.188008",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 23
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "History of economic advancement",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Prior to the establishment of Asunción by the Spanish in 1537, Paraguay's economic activity was limited to subsistence agriculture practiced by the Guaraní Indians, with no significant economic interest found by the Spanish due to the absence of precious metals and sea coasts.",
        "• The colonial economy did not follow the typical feudal Spanish model, although the encomienda system was implemented; economic relations were shaped by Jesuit missionaries who established reducciones (reductions or townships) from the early 1600s until the 1760s, creating agricultural communes that formed the basis of Paraguay’s agriculture-based economy lasting into the late twentieth century.",
        "• After Paraguay gained independence by overthrowing Spanish rule, José Gaspar Rodríguez de Francia (1814–40) imposed autarkic policies, closing borders to nearly all international trade and structuring the economy around centrally administered agriculture, extensive cattle grazing, and inefficient shipbuilding and textile industries.",
        "• Following de Francia’s death, government policies shifted to expanding international trade and economic development, including the construction of roads and authorization of British railroad construction.",
        "• The War of the Triple Alliance (1865–70) devastated Paraguay’s economy: resources were consumed and destroyed, the country was occupied in 1870, the countryside was ruined, the labor force decimated, peasants displaced toward Asunción, and prior modernization efforts reversed, leaving Paraguay the most backward nation in the Southern Cone.",
        "• To pay war debts, Paraguay sold large land tracts mostly to Argentines, establishing a skewed land tenure system dominated by foreign companies rather than a traditional landed elite; many Paraguayans worked as wage laborers on latifundios owned by foreigners.",
        "• From the late 1800s to early 1900s, Paraguay slowly rebuilt infrastructure including ports, roads, railroads, farms, cattle stock, and labor force; repopulation was aided by former Brazilian soldiers and encouraged European immigration from Britain, Germany, Italy, and Spain, whose investors and farmers helped modernize the country.",
        "• Argentine, Brazilian, and British companies purchased prime land and initiated large-scale agricultural exports, including tannin extraction from quebracho hardwood in the Chaco region (with one Argentine owner holding 15% of the Chaco), yerba maté production, and tobacco farming.",
        "• Beginning in 1904, foreign investment increased under successive Liberal Party (Partido Liberal) administrations that maintained laissez-faire economic policies.",
        "• Paraguay’s economic recovery was interrupted by the Chaco War (1932–35) against Bolivia over the Chaco region and rumored oil deposits, resulting in heavy human losses and subsequent social reform efforts led by war veterans.",
        "• During the 1930s and 1940s, Paraguay enacted labor laws, agrarian reform, and modernization influenced by Argentine leader Juan Perón and Brazilian leader Getúlio Vargas; the 1940 constitution rejected previous laissez-faire policies.",
        "• Political consensus on reforms failed, leading to a 1947 civil war and economic chaos lasting until the mid-1950s, during which Paraguay experienced Latin America’s worst inflation, averaging over 100% annually in the 1950s.",
        "• In 1954, under Alfredo Stroessner’s authoritarian rule, Paraguay entered a prolonged period of political and economic stability; Stroessner’s economic policies balanced social reform, desarrollismo, and laissez-faire within a patronage system, with the government playing an active but limited economic role.",
        "• Stroessner prioritized stabilizing rampant inflation, firing the finance minister in 1955 for resisting reforms and accepting an IMF stabilization plan in 1956 that abolished export duties, lowered import tariffs, restricted credit, devalued the currency, and imposed austerity measures, which restored economic stability despite social unrest.",
        "• Labor unions staged a major strike in 1958 in response to austerity, which was suppressed by the government, forcing many labor leaders into exile, where most remained into the late 1980s.",
        "• During the 1960s, Paraguay’s economy grew modestly but steadily, with real GDP growth averaging 4.2% annually, below the Latin American average of 5.7%, but significantly better than the previous two decades of instability.",
        "• As part of the U.S.-sponsored Alliance for Progress, Paraguay expanded economic planning with assistance from the Organization of American States (OAS), Inter-American Development Bank (IDB), and United Nations Economic Commission for Latin America (ECLA), establishing the Technical Planning Secretariat (Secretaría Técnica de Planificación—STP) in 1962.",
        "• Paraguay implemented its first National Economic Plan in 1965–66, followed by a 1967–68 plan and subsequent five-year plans, which were general policy statements rarely adhered to or achieved and played a minimal role in economic growth.",
        "• Paraguay’s economy in the 1960s was characterized by a small public sector, dominance of free enterprise, preference for export promotion over import substitution, continued agricultural dominance over industry, and openness to international trade and market mechanisms.",
        "• The 1970s marked Paraguay’s “miracle decade” with real GDP growth exceeding 8% annually and surpassing 10% from 1976 to 1981, the fastest growth rate in Latin America during that period.",
        "• Four key developments drove 1970s growth: completion of the road from Asunción to Puerto Presidente Stroessner and Brazilian Atlantic ports, ending dependence on Argentina and opening eastern Paraguay; the 1973 Treaty of Itaipú with Brazil, which brought economic benefits and optimism; land colonization fueled by land availability, economic opportunity, rising crop prices, and improved eastern border access; and a quadrupling of hectares planted with soybeans and cotton due to skyrocketing prices, making these crops dominant in employment, production, and exports.",
        "• Paraguay developed strong economic ties with Brazil, the world’s sixth largest economy; contraband trade became dominant along the border, centered in Puerto Presidente Stroessner, with government officials reportedly complicit and benefiting, and urban markets stocked with contraband luxury goods.",
        "• Industrial activity increased in the 1970s, notably through Law 550 (Investment Promotion Law for Social and Economic Development, Law 550/75), which provided income tax breaks, duty-free capital imports, and incentives for investments in priority areas like the Chaco, attracting roughly 25% of new investment from companies in the United States, Europe, and Japan.",
        "• Industrial policies also promoted state-owned enterprises in sectors such as ethanol, cement, and steel production.",
        "• Despite rapid economic growth, much of Paraguay’s rural population was excluded from development benefits due to inadequate infrastructure like back roads, lack of social services including schools and clinics, and limited access to potable water, electricity, bank credit, and public transportation.",
        "• Income distribution worsened in the 1970s both in relative and absolute terms, with rural populations facing intense competition for land from multinational agribusinesses, Brazilian settlers, and Paraguayan colonists, leading to displacement of peasants without land titles to marginal areas and increasing rural conflicts, some involving government forces."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:22.357800",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 26
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2018, Paraguay ranked as the 6th largest producer of soy globally, producing 11 million tons, following the United States, Brazil, Argentina, China, and India.",
        "• The country produced 5.3 million tons of maize in 2018, placing it 21st worldwide in maize production.",
        "• Paraguay also produced 6.1 million tons of sugarcane in 2018, ranking 21st in the world for sugarcane production.",
        "• In the same year, Paraguay produced 3.3 million tons of cassava, contributing significantly to its agricultural output.",
        "• Rice production in Paraguay reached 892 thousand tons in 2018.",
        "• Wheat production was recorded at 722 thousand tons in 2018.",
        "• Paraguay produced 223 thousand tons of oranges in 2018.",
        "• Yerba mate production amounted to 116 thousand tons in 2018, reflecting its importance as a traditional crop.",
        "• Sorghum production totaled 107 thousand tons in 2018.",
        "• In addition to these major crops, Paraguay produced smaller quantities of various other agricultural products in 2018."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:46:51.451043",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Industry",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Historically, Paraguay's industry, particularly the manufacturing sector, was closely linked to agricultural processing until the 1970s.",
        "• The construction of hydroelectric plants and the introduction of new industrial incentives in the 1970s began to diversify and broaden Paraguay's industrial base.",
        "• Paraguay's industry primarily consisted of manufacturing and construction activities during this period.",
        "• The country lacked a significant mining sector; however, the manufacture of construction materials involved limited mining operations.",
        "• In the late 1980s, manufacturing and construction sectors remained dependent on developments in other sectors, notably agriculture and energy, for their growth and expansion.",
        "• Despite the increasing visibility of industry in Paraguay during the 1980s, the industrial sector’s share of the Gross Domestic Product (GDP) declined throughout the 1970s and 1980s.",
        "• The decline in industry’s GDP share was due to the more rapid growth of the agricultural sector compared to industrial growth during these decades."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:46:50.322601",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1986, manufacturing accounted for 16.3 percent of Paraguay's GDP and employed approximately 13 percent of the labor force, positioning Paraguay as one of the least industrialized countries in Latin America.",
        "• Manufactured exports constituted less than 5 percent of total exports by most definitions; however, when semiprocessed agricultural products were included, this figure rose dramatically to 77 percent.",
        "• The growth of Paraguay's manufacturing sector was constrained by several structural challenges, including a small domestic market, limited physical infrastructure, expensive access to seaports, historically insufficient energy production, and economic openness to the more industrialized neighbors Brazil and Argentina.",
        "• The prevalence and profitability of smuggling operations in Paraguay encouraged importing and reexporting activities rather than domestic manufacturing production.",
        "• Paraguay’s earliest manufacturing industries focused on processing hides and leather from its abundant cattle population and extracting tannin from quebracho trees.",
        "• During the Francia dictatorship, small-scale manufacturing, particularly textiles, prospered due to closed national borders.",
        "• The War of the Triple Alliance severely damaged Paraguay’s limited industry and infrastructure, leaving the country predominantly agricultural at the dawn of the twentieth century.",
        "• Early twentieth-century land sales to foreigners stimulated growth in agricultural processing industries, including meat packing, flour milling, oilseed processing, sugar, beer production, and pectin extraction.",
        "• After the early 1900s, small-scale manufacturing across various subsectors experienced slow but steady growth, with notable acceleration during World War II due to shortages.",
        "• Post-World War II, the Paraguayan government increased its role in industrial promotion, conducting the first industrial census in 1955 under the Stroessner government.",
        "• Between 1955 and the mid-1970s, the government implemented several industrial incentive measures, most notably Law 550, which encouraged export-oriented industries and those conserving foreign exchange.",
        "• Law 550 provided liberal fiscal incentives, including import-duty exemptions and various tax breaks, without restrictions on foreign ownership, and targeted development in departments such as Alto Paraguay, Nueva Asunción, Chaco, and Boquerón.",
        "• From 1975 to 1985, about 25 percent of new manufacturing investments were registered under Law 550, with most foreign investments originating from Brazil, West Germany, the United States, Portugal, and Argentina, in that order.",
        "• The combined effects of agricultural colonization, hydroelectric development, and industrial incentives led to unprecedented manufacturing growth in the late 1970s and early 1980s.",
        "• Unlike many Latin American countries that pursued import-substitution industrialization, Paraguay maintained a minimalist government role in the economy during most of the postwar period, characterized by low import tariffs and a realistic exchange rate.",
        "• In the 1980s, Paraguay’s exchange rate became overvalued, and several state-owned heavy industry plants commenced operations.",
        "• By the late 1980s, Paraguay’s major manufacturing subsectors included food, beverages, and tobacco; textiles, clothing, leather, and shoes; wood and related products; and chemicals, petroleum, and plastics.",
        "• Despite some growth in heavy industry during the 1970s and 1980s, Paraguayan manufacturing remained predominantly small-scale, focused on consumer goods, with capital goods constituting less than 5 percent of industrial output.",
        "• Paraguay did not have any of Latin America’s 1,000 largest companies in the 1980s, unlike most other countries in the region.",
        "• Most manufacturing subsectors consisted of numerous small- to medium-sized firms alongside a few large firms, often foreign-owned, with many companies operating below capacity.",
        "• The food, beverages, and tobacco subsector was the dominant manufacturing activity historically and in the late 1980s, accounting for approximately 45 percent of industrial activity, fluctuating with agricultural output.",
        "• Agro-processing involved many small, inefficient, often family-run firms as well as a small number of large, efficient, usually foreign-owned companies producing lucrative items such as oilseeds, meats, and various beverages, often for export.",
        "• Common small-scale food producers manufactured milled items, baked goods, sugar and molasses, dairy products, candy, manioc flour, vinegar, coffee, and tobacco.",
        "• Processed and semiprocessed food products, alongside raw agricultural produce, generated nearly all Paraguayan exports in the late 1980s.",
        "• The profitability of the food subsector was frequently undermined by contraband goods from Brazil and Argentina, including flour, meat, and dairy products, while Paraguayan goods also crossed borders unofficially, reducing official export figures.",
        "• The wood subsector, Paraguay’s second most important manufacturing activity, accounted for about 15 percent of industrial activity and contributed over 8 percent of exports in the 1980s.",
        "• Lumber was the most voluminous wood export, produced by hundreds of small sawmills located mainly in central and eastern border regions.",
        "• Wood mills also produced milled wood, plywood, chipboard, and parquet flooring; although only a fraction of Paraguay’s hundreds of tree species were processed, Paraguayan wood was recognized for its quality.",
        "• Paraguay housed several small paper companies and one large paper and cardboard factory situated in Villeta.",
        "• The textiles, clothing, leather, and shoes subsector was the third largest manufacturing sector, accounting for about 10 percent of total manufacturing output, and was grounded in Paraguay’s abundant cotton fibers, cattle hides, and tannin extract.",
        "• The textile industry engaged in spinning, weaving, and dyeing, producing over 100 million tons of finished fabrics in 1986, primarily from cotton fibers, with increasing production of synthetic and wool fibers.",
        "• Textile production supplied approximately sixty clothing firms, which generally operated inefficiently and below capacity.",
        "• Clothing manufacturers faced strong competition from widespread unregistered imports, often originating from Asia and entering Paraguay via the Brazilian border.",
        "• The leather industry comprised around 200 small tanneries dispersed throughout rural Paraguay, alongside several medium and two large tanneries producing leather goods, operating at about 40 percent capacity.",
        "• The shoe industry included a few hundred small workshops and about a dozen medium-sized firms, collectively producing approximately 5 million pairs of leather and synthetic shoes annually.",
        "• The petroleum, chemicals, and plastics subsector represented less than 5 percent of industrial activity in the late 1980s but was expanding due to growth in heavy industry, particularly related to the energy sector.",
        "• Paraguay produced fertilizers, industrial gases, tanning chemicals, varnishes, and detergents during this period.",
        "• In 1987, Japanese investors were considering constructing a new fertilizer plant with an annual capacity of 70,000 tons.",
        "• Since the early 1980s, Paraguay had been producing ethanol in large quantities, and the government was exploring methanol production.",
        "• Additional manufactured products included paints, soaps, candles, perfumes, and pharmaceuticals.",
        "• The plastics subsector was among Paraguay’s fastest-growing industries in the late 1980s, supplying a wide variety of goods to the domestic market."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:09.676820",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 41
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 5
    },
    {
      "section_number": "6",
      "section_name": "Structure of the economy",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The farming sector is the most important component of the Paraguayan economy, contributing 27% to GDP in 2006.",
        "• Commerce accounted for 20.2% of Paraguay’s GDP in 2006, while other services, including government, contributed 38.4%.",
        "• Industry, encompassing mining and construction, made up about 20% of the GDP in 2006.",
        "• After experiencing economic crises between 1999 and 2002, Paraguay’s economy grew annually between 2.9% and 4.1% from 2003 to 2006.",
        "• The estimated economic growth rate for Paraguay in 2007 was approximately 6.4%, with inflation reaching 6.0% that year.",
        "• The majority of Paraguayan enterprises are small, micro, or individual operations, including subsistence activities such as street vending.",
        "• Only 4% of the Paraguayan labor force is employed in companies with more than 50 employees.",
        "• In June 2007, Paraguay’s external foreign exchange reserves totaled US$2,153 million, nearly equal to its foreign official debt of US$2,154 million.",
        "• Paraguay reported a provisional fiscal surplus of 0.5% of GDP for both 2006 and 2007.",
        "• Paraguay’s GDP grew by 5.8% in 2008, with agriculture being the fastest-growing sector at 10.5% growth.",
        "• Agriculture accounted for about 20% of Paraguay’s annual GDP (down from 25% in 2004) and represented virtually all of the country’s export earnings.",
        "• The agricultural sector is Paraguay’s largest and most consistent employer, engaging approximately 45% of the working population.",
        "• Thousands of Paraguayan families rely on subsistence farming beyond the formal agricultural sector.",
        "• Paraguay produces sufficient basic food crops to be largely self-sufficient, with corn, cassava, and wheat as the main crops for local consumption.",
        "• The global surge in grain prices during 2007-2008 significantly boosted Paraguay’s agricultural sector, leading to expanded wheat and rice cultivation and a notable increase in soybean production.",
        "• In 2004, Paraguay had about 1.6 million hectares dedicated to genetically modified (GM) crops.",
        "• The export value of soy and its derivatives rose from US$1.25 billion in 2007 to US$2.54 billion in 2008.",
        "• Paraguay’s eastern plains and the Chaco region support a robust dairy and ranching industry.",
        "• Beef exports are the second most significant component of Paraguay’s agricultural sector after soybeans.",
        "• Paraguay produces sufficient beef, pork, and dairy products to meet domestic demand.",
        "• Foot-and-mouth disease outbreaks in 2002 and 2003 resulted in bans on Paraguayan beef exports to many countries.",
        "• Meat production and exports rebounded in 2004, aided by rising international prices and market recoveries in countries such as Chile and Russia.",
        "• Paraguay’s meat exports increased from US$143 million in 2004 to US$353 million in 2007, reaching US$597 million in 2008.",
        "• Paraguay’s national cattle herd numbers between 9 and 10 million head.",
        "• Paraguay’s forests adequately supply domestic lumber and fuelwood needs.",
        "• Logging for export, both legal and illegal, has significantly reduced Paraguay’s native forests, leading to an export ban on logs since the 1970s.",
        "• More than 90% of the native rainforest in Paraguay’s eastern half was lost between 1975 and 2008.",
        "• In the western half of Paraguay, the Chaco region, virgin forest is being lost to cattle ranching at an annual rate exceeding 200,000 hectares as of 2008.",
        "• Sustainable wood cultivation practices are increasing in Paraguay.",
        "• Paraguay’s fishing industry exists almost exclusively to satisfy domestic demand."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:05.783834",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 30
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 6
    },
    {
      "section_number": "6.1",
      "section_name": "Mining and minerals",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay, unlike many South American countries, possesses few mineral resources and has a very limited history of successful mining activities.",
        "• In recent years, foreign companies have conducted exploration efforts in Paraguay, aiming to identify previously overlooked mineral deposits.",
        "• Existing mining operations in Paraguay are small-scale and focus primarily on extracting lime, clay, and raw materials essential for cement production.",
        "• Paraguay’s iron and steel manufacturing industries rely on importing raw materials from neighboring countries due to insufficient domestic mineral resources.",
        "• In 2010, CIC Resources Inc., the company credited with discovering copper deposits in Chile, announced the discovery of 21 billion metric tons of titanium in Alto Paraná, near the border with Brazil.",
        "• This titanium deposit discovered by CIC Resources Inc. in Alto Paraná is potentially the largest titanium deposit in the world."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:46:54.111147",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 7
    },
    {
      "section_number": "6.2",
      "section_name": "Industry and manufacturing",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The industrial sector in Paraguay accounts for approximately 25 percent of the country's gross domestic product (GDP) and employs about 31 percent of the labor force.",
        "• In 2004, industrial output in Paraguay grew by 2.9 percent, marking a recovery after five consecutive years of declining production.",
        "• Historically an agricultural economy, Paraguay is demonstrating signs of sustained long-term industrial growth.",
        "• The pharmaceutical industry in Paraguay is rapidly replacing foreign suppliers by meeting 70 percent of the domestic drug consumption and has also begun exporting pharmaceutical products.",
        "• Other sectors showing strong industrial growth include the production of edible oils, garments, organic sugar, meat processing, and steel manufacturing.",
        "• Despite growth, capital investment for further industrial expansion remains limited due to financial constraints.",
        "• The Paraguayan government is actively working to improve credit options for businesses following the exposure of widespread financial corruption during the 1990s.",
        "• In 2003, manufacturing contributed 13.6 percent to Paraguay’s GDP and employed about 11 percent of the workforce as of 2000.",
        "• Paraguay’s manufacturing sector primarily focuses on food and beverage production.",
        "• Additional manufacturing outputs include wood products, paper products, hides and furs, and non-metallic mineral products.",
        "• During the 1990s, the manufacturing sector experienced steady GDP growth at an average annual rate of 1.2 percent.",
        "• This steady growth laid the foundation for increased manufacturing growth rates of 2.5 percent annually in 2002 and 2003."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:46:58.002340",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 8
    },
    {
      "section_number": "6.3",
      "section_name": "Energy",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay relies almost exclusively on hydroelectric power to satisfy its national energy requirements, indicating a strong dependence on renewable energy sources.",
        "• The Itaipú Dam, completed in 1984, is a hydroelectric facility with the world's second largest power-generating capacity, producing 13.3 gigawatts of electricity.",
        "• The Itaipú Dam is situated on the Paraná River, not the Paraguay River, and its ownership, operation, and electricity output are equally shared between Paraguay and Brazil.",
        "• Paraguay is also a co-owner of the Yacyretá hydropower plant, which it jointly operates with Argentina, further contributing to its hydroelectric energy production.",
        "• Despite generating large amounts of electricity from Itaipú and Yacyretá, Paraguay consumes only a small fraction of this energy domestically.",
        "• In 2002, Paraguay generated over 48 billion kilowatt-hours (kWh) of electricity, of which it consumed only 2.5 billion kWh and exported approximately 45.9 billion kWh.",
        "• Planned upgrades, including the installation of new turbines at Itaipú and the full completion of the Yacyretá dam, are expected to increase Paraguay’s hydroelectric energy production and export capacity.",
        "• By 2007, Paraguay’s electricity production rose to 70 terawatt-hours (TWh), with exports reaching 64 TWh, positioning Paraguay as the second largest global exporter of electrical power.",
        "• Paraguay holds the distinction of being the largest net exporter of electricity worldwide, as it does not import any electricity, unlike France, which is the top exporter with 67 TWh but also imports 10 TWh.",
        "• Paraguay lacks domestic oil reserves and depends entirely on imported oil to fulfill its limited demand for oil-based energy.",
        "• The Paraguayan government owns Petróleos Paraguayos, the state enterprise responsible for the distribution of all oil products within the country.",
        "• The government of Paraguay annually solicits bids from international oil companies and selects a few to supply the nation’s oil product needs.",
        "• Paraguay currently neither produces nor consumes natural gas domestically but relies on imported liquefied petroleum gas (LPG), primarily sourced from Argentina."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:00.383094",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 9
    },
    {
      "section_number": "6.4",
      "section_name": "Services",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2004, the services sector constituted nearly 50 percent of Paraguay's gross domestic product (GDP), highlighting its significant role in the national economy.",
        "• Approximately 19 percent of Paraguay's working population was employed within the services sector, indicating its importance as a source of employment.",
        "• The importation of goods, particularly from neighboring countries Argentina and Brazil, for both sale and illegal reexportation, contributes to the creation of jobs within Paraguay's service industry.",
        "• Between 1990 and 2003, the services sector experienced a moderate average annual growth rate of 0.9 percent, reflecting steady but limited expansion over this period.",
        "• In 2002, the services sector contracted sharply, decreasing by 7.8 percent, which indicates a significant economic downturn affecting this sector.",
        "• The sector rebounded in 2003 with a growth rate of 1.6 percent, showing signs of recovery following the previous year's decline.",
        "• The development of Paraguay's formal services sector has been hindered by economic instability and the prevalence of a large black market, which undermines formal economic activities and growth."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:01.251500",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 10
    },
    {
      "section_number": "6.5",
      "section_name": "Tourism",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay's tourism industry is relatively small in scale compared to other sectors of its economy.",
        "• Total tourism receipts in Paraguay experienced a continuous decline each year from 2000 through 2002.",
        "• In 2003, the hotel occupancy rate in Paraguay was recorded at 38 percent, indicating moderate utilization of available accommodation facilities.",
        "• The hotel occupancy rate increased by 15 percent in 2004, reflecting a notable improvement in tourism activity compared to the previous year.",
        "• The modest growth in Paraguay's tourism sector has primarily been driven by business travelers rather than leisure tourists.",
        "• Historically, Paraguay functioned as a central market for trafficable, duty-free goods, attracting shoppers from neighboring countries.",
        "• Government crackdowns in Brazil and Argentina have significantly reduced the flow of shoppers traveling to Paraguay in search of trafficable items, impacting this aspect of Paraguay's tourism."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:03.632651",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 11
    },
    {
      "section_number": "7",
      "section_name": "Banking and finance",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay's banking and financial services industry has been in a recovery phase since the liquidity crisis of 1995, which was triggered by revelations of widespread corruption leading to the closure of several significant banks.",
        "• Reform initiatives driven by the International Monetary Fund (IMF) and the World Bank played a crucial role in restoring some credibility to Paraguay's banking sector following the 1995 crisis.",
        "• Despite these reforms, the Paraguayan economy continues to suffer from a limited availability of credit options, which constrains overall economic growth.",
        "• Paraguay has a longstanding reputation as a center for money laundering; although the government has implemented measures to address this issue, enforcement of anti-money laundering laws remains inconsistent.",
        "• The majority of banks and financial institutions operating in Paraguay are either partially or wholly owned by foreign companies, with Paraguayan banks holding less than 10 percent of total deposits.",
        "• In 2003, out of 16 banks operating in Paraguay, 50 percent were wholly foreign-owned, and an additional 25 percent were partially owned by foreign entities.",
        "• Paraguay’s Central Bank functions primarily to stabilize the financial sector and to prevent a recurrence of banking crises similar to the 1995 run on banks.",
        "• The Superintendencia de Bancos is the regulatory authority overseeing the banking system, with responsibilities including monitoring the proportion of non-performing loans within the sector.",
        "• In 2004, bank deposits in Paraguay increased significantly, accompanied by a notable rise in the share of deposits held in local currency.",
        "• Local currency deposits grew by 26 percent in 2004, indicating increasing public confidence in the stability of the Paraguayan guaraní.",
        "• Interest rates experienced a dramatic decline in 2004, falling from 50 percent in 2003 to 27 percent in 2004, signaling improved financial conditions.",
        "• Paraguay’s stock market, known as the Bolsa de Valores y Productos de Asunción, commenced trading operations in October 1993.",
        "• Investment levels in the 1990s remained low due to the prevalence of family-owned companies and ongoing economic instability.",
        "• The value of shares traded on the Asunción stock exchange surged by 390 percent in 2004, reaching a total market capitalization of US$17.5 million."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:10.801077",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 12
    },
    {
      "section_number": "8",
      "section_name": "Labor",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay's formal labor force was estimated to total approximately 2.7 million workers in 2004.",
        "• Of the total labor force in 2004, about 45 percent were employed in the agricultural sector, 31 percent in the industrial sector, and 19 percent in the services sector.",
        "• The unemployment rate in Paraguay was estimated at 15 percent in 2004.",
        "• Paraguay's constitution guarantees workers the right to unionize and engage in collective bargaining.",
        "• Approximately 15 percent of Paraguayan workers were members of one of the country's 1,600 labor unions.",
        "• Strikes are legally permitted in Paraguay and occur with some frequency.",
        "• The 2001 census revealed that 5 percent of Paraguay's workforce was under the age of 14.",
        "• Paraguay ratified the International Labour Organization's Minimum Age Convention in 2004.",
        "• Despite ratification, child labor remains prevalent, with nearly 14 percent of children aged 5 to 17 employed, often under poor conditions and for negligible pay.",
        "• The Paraguayan government has established a minimum wage of approximately US$158 per month for private-sector employees.",
        "• Government employees in Paraguay are not covered by a minimum wage mandate.",
        "• The standard workweek in Paraguay is set at 48 hours.",
        "• The unemployment rate reported in 2004 was consistently 15 percent, reflecting ongoing labor market challenges."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:09.825096",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 13
    },
    {
      "section_number": "9",
      "section_name": "Currency, exchange rate, and inflation",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay's official currency is the guarani, abbreviated as PYG.",
        "• In mid-October 2005, the exchange rate was approximately US$1 to PYG6155.",
        "• Between 2003 and 2004, Paraguay experienced a significant reduction in price inflation, dropping from 14.2 percent to a 30-year low of 4.3 percent.",
        "• The economic reforms and austerity programs implemented under President Duarte were instrumental in achieving this rapid decline in inflation.",
        "• By 2005, economic experts projected that Paraguay's inflation rate would likely increase in the coming years, but it was expected to remain below 10 percent."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:10.005477",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 14
    },
    {
      "section_number": "10",
      "section_name": "Foreign economic relations",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay is a member of the Common Market of the South (Mercado Común del Sur or Mercosur), with the majority of its trade conducted with Uruguay, Brazil, and Argentina.",
        "• In 2002, Paraguay's trade volume was more than US$400 million with Argentina and nearly US$800 million with Brazil.",
        "• Paraguay is also a member of the Inter-American Development Bank, Latin American Integration Association, Latin American Economic System, and is a signatory to the agreement establishing the South American Community of Nations.",
        "• In 2004, Paraguay signed an energy cooperation agreement with Venezuela to purchase oil and petroleum, with Venezuela providing concessional financing allowing Paraguay to pay over 15 years at a nominal interest rate.",
        "• Paraguay's imports totaled US$3.3 billion in 2004, with principal import commodities including automobiles, chemical products, consumer goods, tobacco, petroleum, and machinery.",
        "• Brazil was the leading source of Paraguayan imports in 2004, accounting for 24.3 percent, followed by the United States at 22.3 percent, Argentina at 16.2 percent, China at 9.9 percent, and Hong Kong at 5 percent.",
        "• Import statistics for Paraguay are difficult to verify because up to half of all imports are illegally re-exported to Argentina or Brazil.",
        "• Imports from Mercosur countries increased to 57 percent in 2003, indicating growing regional trade integration.",
        "• Paraguay's export revenues reached approximately US$2.9 billion in 2004, with agricultural commodities as the primary export drivers.",
        "• Soybeans were particularly significant, accounting for 35 percent of total export revenues in 2003.",
        "• Other important agricultural export products included cotton, sugarcane, cassava, sunflowers, wheat, and corn.",
        "• Additional significant exports comprised feed, meat, edible oils, electricity, wood, and leather.",
        "• Brazil was Paraguay's principal export destination in 2004, receiving 27.8 percent of exports, followed by Uruguay (15.9 percent), Italy (7.1 percent), Switzerland (5.6 percent), Argentina (4.3 percent), and the Netherlands (4.2 percent).",
        "• In 2003, nearly 60 percent of Paraguayan exports were destined for Mercosur countries, highlighting regional trade dependence.",
        "• Paraguay experienced a negative trade balance of about US$400 million in 2004, as increased earnings from soybeans and cotton were insufficient to offset the rise in imported consumer goods and petroleum products.",
        "• After years of negative trade balances, Paraguay achieved a positive balance of payments totaling US$234 million in 2003.",
        "• However, in 2004, Paraguay's current account recorded an estimated deficit of US$35.1 million.",
        "• According to the International Monetary Fund (IMF), Paraguay maintains a sustainable debt level, with external debt totaling about US$3.4 billion in 2004, which is low compared to most Latin American countries.",
        "• Paraguay's debt-to-gross domestic product (GDP) ratio was expected to continue decreasing in subsequent years.",
        "• Paraguay paid US$412 million in debt service to the IMF in 2004.",
        "• Foreign direct investment (FDI) in Paraguay nearly disappeared in 2002, dropping from US$84 million in 2001 to only US$9 million in 2002, largely due to the financial crisis in Argentina and the banking collapse in Paraguay.",
        "• FDI rebounded in 2003, reaching US$90.8 million for the year.",
        "• Paraguay has relied on economic development assistance from the IMF and the World Bank.",
        "• The World Bank committed to providing Paraguay with assistance totaling US$325 million between 2003 and 2007.",
        "• Current World Bank projects in Paraguay focus on improving education, transportation infrastructure, and rural development."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:20.611290",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 15
    },
    {
      "section_number": "11",
      "section_name": "Transport",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Paraguayan road network comprises nearly 4,500 kilometers of paved roads and approximately 60,000 kilometers of secondary roads, indicating a substantial infrastructure for vehicular transport across the country.",
        "• The density of Paraguay’s road network is significantly higher in the oriental region compared to the Chaco area, reflecting regional disparities in transportation infrastructure development.",
        "• In 2007, a paved road connection was completed across the Chaco region, linking Paraguay to the Bolivian border, enhancing cross-border transport and regional connectivity.",
        "• The Paraguay-Paraná waterway serves as a crucial transportation route for the movement of both exported and imported goods, underscoring its importance in Paraguay’s trade logistics.",
        "• The railway line connecting Asunción to Encarnación is currently non-operational; however, a functioning rail connection remains between Encarnación and Posadas, Argentina, primarily used for transporting agricultural products.",
        "• Paraguay is served by two international airports: Silvio Pettirossi International Airport located in Asunción, and Guarani International Airport situated in Ciudad del Este, facilitating international air travel and cargo transport.",
        "• In addition to the international airports, Paraguay has several secondary airports distributed throughout other regions of the country, supporting domestic air travel and regional connectivity."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:13.876017",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 16
    },
    {
      "section_number": "12",
      "section_name": "Media and communications",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay has five national newspapers alongside a greater number of local publications, indicating a diverse print media landscape.",
        "• The country hosts five Paraguayan television stations, providing national broadcast services.",
        "• In addition to domestic TV stations, key international television channels are accessible via cable networks in Paraguay’s main urban areas.",
        "• The fixed line telephone network in Paraguay is operated and controlled by the state-owned company COPACO.",
        "• The mobile phone network in Paraguay is open to private operators, fostering competition in the telecommunications sector.",
        "• There are four competing mobile phone operators currently operating within Paraguay.",
        "• In recent years, mobile phone coverage has significantly surpassed fixed line telephone coverage in terms of population reach across Paraguay."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:13.362104",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 17
    },
    {
      "section_number": "13",
      "section_name": "Statistics",
      "chapter_name": "Economy of Paraguay",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paraguay's main economic indicators from 1980 to 2019 are documented with IMF estimates for 2020 to 2026, covering GDP in billion US$ PPP and nominal terms, GDP per capita, real GDP growth, inflation rate, unemployment rate, and government debt as a percentage of GDP.",
        "• In 1980, Paraguay's GDP was $11.1 billion (PPP) with a GDP per capita of $3,536.7 (PPP), nominal GDP of $4.1 billion, nominal GDP per capita of $1,299.7, real GDP growth of 11.7%, inflation at 22.5%, with unemployment and government debt data unavailable.",
        "• The economy experienced fluctuations in growth and inflation throughout the 1980s, with real GDP growth ranging from -3.0% in 1983 to 11.7% in 1980, and inflation rates varying between 5.4% (1982) and 31.7% (1986).",
        "• Government debt as a percentage of GDP was not reported until 1990, when it was 67.0%, decreasing steadily to 10.3% by 2011, then rising again to 36.4% by 2023.",
        "• GDP growth rates varied significantly, with negative growth in early 1980s and early 2000s, including -1.4% in 1982 and -2.3% in 2000, while peaking at 11.1% in 2010.",
        "• Inflation rates showed high volatility, peaking at 38.2% in 1990, then generally declining to 1.8% in 2020, with minor fluctuations thereafter.",
        "• Unemployment rates ranged from 3.3% in 1995 to 10.8% in 2002, stabilizing around 6% in recent years.",
        "• Paraguay's GDP composition by sector in 2022 was 11.4% agriculture, 33.5% industry, 47.5% services, and 7.6% taxes.",
        "• The labor force was estimated at 3.428 million in 2017, with occupational distribution in 2008 as 26.5% in agriculture, 18.5% in industry, and 55% in services.",
        "• The unemployment rate was 6.5% in 2017, while 22.2% of the population lived below the poverty line as of 2015.",
        "• Household income distribution in 2015 showed the lowest 10% earning 1.5% of income, and the highest 10% earning 37.6%, with a Gini index of 51.7 indicating significant income inequality.",
        "• Inflation rate for consumer prices was 3.6% in 2017, and gross fixed investment accounted for 21.2% of GDP in 2005.",
        "• Paraguay’s government budget in 2017 included revenues of $5.366 billion and expenditures of $5.876 billion, including $700 million in capital expenditures.",
        "• Public debt stood at 25.6% of GDP in 2017.",
        "• Key agricultural products include cotton, sugarcane, soybeans, corn, wheat, tobacco, cassava (tapioca), fruits, vegetables, beef, pork, eggs, milk, and timber.",
        "• Major industries encompass sugar, cement, textiles, beverages, wood products, steel, metallurgic, and electric power sectors.",
        "• Industrial production growth rate was estimated at 6% in 2017.",
        "• Paraguay’s electricity production in 2003 was 51.29 billion kWh, with consumption at 3.528 billion kWh, exports at 44.17 billion kWh, and no imports.",
        "• Electricity production sources in 2001 were predominantly hydroelectric (99.9%), with negligible fossil fuel (0%) and other sources (0.1%), and no nuclear power.",
        "• Paraguay had no oil production in 2003, consumed 25,000 barrels per day, with no data on exports or imports.",
        "• The current account balance was positive at $543 million in 2017.",
        "• Exports totaled $11.53 billion f.o.b. in 2017, with main partners being Brazil (31.9%), Argentina (15.9%), Chile (6.9%), and Russia (5.9%).",
        "• Imports amounted to $10.37 billion f.o.b. in 2017, with China (31.3%), Brazil (23.4%), Argentina (12.9%), and the US (7.4%) as principal partners.",
        "• Foreign exchange and gold reserves were $7.504 billion in 2017.",
        "• External debt was $17.35 billion in 2017.",
        "• Paraguay is not listed as a recipient of economic aid.",
        "• The national currency is the guarani (G), subdivided into 100 centimos.",
        "• Exchange rates of guarani per US dollar fluctuated from 1,963.0 in 1995 to 5,628.1 in 2017, with the exchange rate operating as a managed float since early 1998; prior to that, it was freely determined by the market.",
        "• Paraguay’s fiscal year corresponds to the calendar year.",
        "• The data reflect a comprehensive overview of Paraguay’s economic performance, sectoral composition, labor market, inflation, fiscal status, external trade, and monetary indicators over four decades, including recent IMF projections through 2026."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:47:28.008064",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 30
      },
      "source_file": "economy_of_paraguay.json",
      "original_index": 18
    }
  ]
}