{
  "extraction_info": {
    "source_file": "economy_of_costa_rica.json",
    "extraction_timestamp": "2025-08-02T17:13:27.692811",
    "total_sections_in_source": 13,
    "extracted_sections_count": 13,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Costa Rica has maintained stability over recent years, characterized by continuous growth in Gross Domestic Product (GDP) and moderate inflation rates.",
        "• Despite economic stability, Costa Rica experienced a high unemployment rate of 11.49% in 2019.",
        "• The country’s economy emerged from a recession in 1997 and has demonstrated strong aggregate growth since that year.",
        "• The estimated GDP for 2023 is approximately US$90 billion, representing a significant increase from US$52.6 billion in 2015.",
        "• The projected 2024 per capita income, measured by purchasing power parity (PPP), is estimated at US$28,558.",
        "• Inflation rates remained around 4% to 5% annually up to 2015 but declined sharply to 0.7% in 2016.",
        "• Inflation was forecasted to rise modestly to 2.8% by the end of 2017.",
        "• In 2017, Costa Rica had the highest standards of living in Central America, despite persistent high poverty levels.",
        "• The poverty rate decreased by 1.2 percentage points in 2017, reaching 20.5%, attributed to reduced inflation and government benefits.",
        "• The estimated unemployment rate in 2017 was 8.1%, roughly unchanged from 2016.",
        "• The Costa Rican economy transitioned from reliance solely on agriculture to a more diversified structure, emphasizing tourism, electronics and medical component exports, medical manufacturing, and IT services.",
        "• Corporate services for foreign companies account for approximately 3% of the national workforce.",
        "• The composition of GDP in 2016 was approximately 5.5% from agriculture, 18.6% from industry, and 75.9% from services.",
        "• Labor force employment distribution in 2016 was about 12.9% in agriculture, 18.57% in industry, and 69.02% in services.",
        "• Many foreign companies operate within Costa Rica’s free-trade zones, facilitating international trade and investment.",
        "• In 2015, Costa Rica’s exports totaled US$12.6 billion, while imports reached US$15 billion, resulting in a trade deficit of US$2.39 billion.",
        "• The country’s primary economic challenges include growing public debt and a widening budget deficit; by August 2017, Costa Rica faced difficulties in meeting its financial obligations.",
        "• The President of Costa Rica in 2017 pledged to implement significant reforms to address the liquidity crisis.",
        "• Additional economic challenges involve poor infrastructure and the necessity to improve efficiency within the public sector to attract more foreign investment."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:16.181486",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 19
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Public debt and deficit",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• One of Costa Rica’s major economic concerns is the level of public debt, particularly as a percentage of GDP, which increased from 29.8% in 2011 to 40.8% in 2015 and further to 45% in 2016.",
        "• The total public debt in 2015 was valued at $22.648 billion, representing an increase of nearly $3 billion compared to 2014.",
        "• On a per capita basis, Costa Rica’s public debt was $4,711 per person in 2015.",
        "• Costa Rica maintained a formal line of credit with the World Bank valued at US$947 million as of April 2014, of which US$645 million had been accessed, leaving US$600 million outstanding.",
        "• The International Monetary Fund (IMF) reported in June 2017 that Costa Rica’s annual growth rate was just over 4%, with moderate inflation.",
        "• The IMF noted that the financial system appeared sound, with credit growth consistent with healthy financial deepening and macroeconomic trends.",
        "• Despite efforts, the IMF highlighted that the fiscal deficit remained high and public debt continued to rise rapidly, even after deepened fiscal consolidation efforts in 2016.",
        "• The IMF observed that recent fiscal consolidation advances had been partly reversed and that political consensus on a comprehensive fiscal package remained elusive.",
        "• The IMF expressed concern over increasing deficits, rising public debt, and the heavy dollarization of bank assets and liabilities, warning that tighter global financial conditions could seriously undermine investor confidence.",
        "• The IMF recommended measures including reducing pension benefits, increasing contributions from the public, and improving the cost-effectiveness of the education system.",
        "• Moody’s Investors Service downgraded Costa Rica’s credit rating in early 2017 from Ba1 to Ba2, with a negative outlook, citing rising government debt and a persistently high fiscal deficit of 5.2% of GDP in 2016.",
        "• Moody’s expressed concern about the lack of political consensus to implement measures to reduce the fiscal deficit, which could further pressure government debt ratios.",
        "• In late July 2017, the Central Bank estimated Costa Rica’s budget deficit at 6.1% of GDP.",
        "• The 2017 OECD study emphasized that reducing foreign debt should be a top priority for the government and recommended additional fiscal reforms to moderate the budget deficit.",
        "• In 2014, President Solís proposed a budget increase of 19% for 2015, 0.5% for 2016, and 12% for 2017.",
        "• The final proposed 2017 budget totaled US$15.9 billion, with debt payments accounting for one-third of the total.",
        "• A significant 46% of the 2017 budget required financing, which would increase foreign debt obligations.",
        "• The Central Bank’s July 2017 estimate placed the budget deficit at 6.1% of GDP."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:24.776029",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "Liquidity crisis",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In early August 2017, Costa Rican President Luis Guillermo Solís publicly acknowledged that the country was experiencing a \"liquidity crisis,\" characterized by an inability to meet all financial obligations and to ensure the provision of essential public services.",
        "• To address the liquidity crisis, President Solís announced that his government was considering implementing higher Value Added Tax (VAT) rates and increased income tax rates as part of fiscal reforms.",
        "• President Solís emphasized the necessity of these measures, stating that \"despite all the public calls and efforts we have made since the start of my administration to contain spending and increase revenues, there is still a gap that we must close with fresh resources.\"",
        "• The liquidity crisis persisted despite the country experiencing economic growth, low inflation, and moderate interest rates at the time.",
        "• The government's fiscal prioritization plan involved first ensuring payments on the public debt, followed by salaries, then pensions.",
        "• Subsequent fiscal priorities included transfers to institutions based on their social urgency, with all other payments contingent upon available funds."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:28.081281",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 2
    },
    {
      "section_number": "2",
      "section_name": "Other challenges",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• A 2016 U.S. government report identifies several challenges facing Costa Rica as it seeks to expand its economy through collaboration with potential foreign investors.",
        "• The country's ports, roads, and water systems require significant upgrades to support economic growth; efforts by China to invest in such infrastructure improvements have been hindered by bureaucratic and legal concerns.",
        "• The bureaucratic system in Costa Rica is characterized as \"often slow and cumbersome,\" which impedes efficient economic development and investment processes.",
        "• There is a need for a larger workforce proficient in English as well as other languages such as Portuguese, Mandarin, and French to meet the demands of a diverse, globalized economy.",
        "• The country would benefit from an increase in graduates specializing in Science, Technology, Engineering, and Math (STEM) fields to foster innovation and technological advancement.",
        "• Certain sectors in Costa Rica are monopolized by the state, which excludes competition; however, overall, Costa Rican laws, regulations, and practices are generally transparent and conducive to competition.",
        "• Environmental impact assessments in Costa Rica have been completed slowly, leading to delays in the initiation and completion of various projects.",
        "• The process for product registration is also slow, although improvements are anticipated through digitization initiatives.",
        "• Despite government efforts to strengthen the enforcement of intellectual property laws, enforcement remains a concern, indicating ongoing challenges in protecting intellectual property rights."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:32.453569",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 3
    },
    {
      "section_number": "3",
      "section_name": "Natural resources",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Costa Rica's climate is characterized by significant rainfall and its strategic location in the Central American isthmus, providing easy access to North and South American markets and direct ocean access to European and Asian continents.",
        "• The country experiences two primary seasons: the tropical wet season and the dry season, each supporting distinct agricultural resources.",
        "• Approximately 25% of Costa Rica's land area is designated as national forests, often located adjacent to beaches, contributing to the country's popularity among affluent retirees and ecotourists.",
        "• A total of 10.27% of Costa Rica's territory is protected as national parks, with an additional 17% allocated for reserves, wildlife refuges, and protected zones.",
        "• Costa Rica hosts over 50 wildlife refuges, 32 major national parks, more than 12 forest reserves, and several biological reserves, reflecting its commitment to conservation.",
        "• Due to its ocean access, 23.7% of the population engages in fishing and trades their catches to fish companies; this activity is primarily small-scale artisanal coastal fishing, especially prevalent in the Gulf of Nicoya.",
        "• The country imposes licensing fees on commercial fishing fleets targeting species such as tuna, sardines, banga mary, mahi-mahi, red tilapia, shrimp, red snapper, other snappers, shark, marlin, and sailfish.",
        "• In mid-2017, Costa Rica planned to ban large-scale commercial fishing off the southern Pacific Coast over nearly a million acres to protect marine and coastal resources from \"indiscriminate and unsustainable commercial fishing,\" with a bill under consideration in Congress.",
        "• Sport fishing is a significant component of Costa Rica's tourism industry, with popular species including marlin, sailfish, dorado, tarpon, snook, roosterfish, wahoo, tuna, mackerel, snapper, and rainbow bass.",
        "• In the 2012 Environmental Performance Index, Costa Rica ranked 5th globally and was the top-ranked country in the Americas, indicating high environmental standards.",
        "• The World Economic Forum's 2017 Travel & Tourism Competitiveness Report ranked Costa Rica third out of 136 countries based on natural resources, the number of World Heritage natural sites, protected areas, species, and eco-tourism infrastructure."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:36.757107",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 4
    },
    {
      "section_number": "4",
      "section_name": "Tourism",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Ecotourism is a central component of Costa Rica's tourism industry, highlighting the country's extensive national parks and protected areas, exemplified by sites such as the Savegre River in Talamanca.",
        "• In 2013, Costa Rica's tourism industry generated approximately $1.92 billion annually, making it the most visited nation in the Central American region with 2.42 million foreign visitors.",
        "• By 2016, the number of tourists visiting Costa Rica increased to 2.6 million, reflecting continued growth in the sector.",
        "• The Tourism Board estimates that tourism-related spending in 2016 exceeded US$3.4 billion, accounting for about 5.8% of Costa Rica's Gross Domestic Product (GDP).",
        "• The World Travel & Tourism Council (WTTC) reports that in 2016, tourism contributed directly to 5.1% of the GDP and supported approximately 110,000 direct jobs, with a total of 271,000 jobs indirectly linked to the sector.",
        "• Ecotourism is highly popular among tourists, driven by the country's numerous national parks and protected areas, and Costa Rica is recognized as a pioneer and one of the few countries with authentic ecotourism practices.",
        "• Other significant market segments include adventure tourism, sun, and beaches, with most tourists originating from the United States and Canada (46%) and the European Union (16%), which are considered prime markets.",
        "• The high expenditure per tourist is approximately $1,000 per trip, reflecting the attractiveness of Costa Rica as a travel destination.",
        "• In the 2008 Travel and Tourism Competitiveness Index (TTCI), Costa Rica ranked 44th globally, the highest among Latin American countries and second among Caribbean nations.",
        "• When considering the subindex for human, cultural, and natural resources, Costa Rica ranked 24th worldwide, and 7th specifically for natural resources.",
        "• The TTCI report identified weaknesses in Costa Rica's ground transport infrastructure, ranked 113th, and safety and security, ranked 128th.",
        "• Travelzoo named Costa Rica one of five “Wow Deal Destinations for 2012,” highlighting its appeal as a travel bargain.",
        "• In 2011, Travel Weekly designated Costa Rica as the best destination in Central and South America.",
        "• In 2017, Costa Rica received nominations in the World Travel Awards for Mexico & Central America's Leading Beach Destination, Leading Destination, and Leading Tourist Board."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:44.699286",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 5
    },
    {
      "section_number": "5",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Historically, Costa Rica's economy was primarily based on agriculture, which has significantly influenced its cultural development over the years.",
        "• The country's main cash crop historically and up to modern times has been bananas.",
        "• Coffee was once a major export commodity; however, its relative contribution has decreased to the point where it accounted for only 2.5% of Costa Rica's total exports in 2013.",
        "• Agriculture contributes approximately 6.5% to Costa Rica’s gross domestic product (GDP).",
        "• In 2016, agriculture employed about 12.9% of the country's labor force.",
        "• The industrial sector employs approximately 18.57% of the labor force, while the service sector accounts for about 69.02%.",
        "• Agricultural practices and crop choices vary significantly depending on geographic location and altitude within Costa Rica.",
        "• The main agricultural exports include bananas, pineapples (which constitute the second highest export with over 50% share of the global pineapple market), other tropical fruits, coffee (primarily grown in the Valle Central or Meseta Central), sugar, rice, palm oil, vegetables, ornamental plants, maize, and potatoes.",
        "• Livestock activities encompass cattle, pigs, horses, and poultry.",
        "• Meat and dairy products are considered leading exports according to some sources; however, they did not rank within the top 10 export categories in 2013.",
        "• In 2013, the combined export value of forest products and textiles was lower than that of chemical products or plastics, indicating these sectors' relatively smaller contribution to exports."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:50.578554",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 6
    },
    {
      "section_number": "6",
      "section_name": "Mining",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mining in Costa Rica contributes a relatively minor portion to the national economy, indicating its limited economic significance within the country.",
        "• In the year 2018, Costa Rica produced a total of 5.2 tons of gold through mining activities."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:18:53.241384",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 2
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 7
    },
    {
      "section_number": "7",
      "section_name": "Exports, jobs, and energy",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Historically, Costa Rica was primarily known as a producer of bananas and coffee, with these commodities remaining important exports alongside pineapple, sugar, lumber, wood products, and beef.",
        "• In recent decades, the country's main exports have shifted towards medical instruments, electronics, pharmaceuticals, financial outsourcing, software development, and ecotourism, driven by high levels of education and English fluency among residents.",
        "• In 2015, Costa Rica's major export products by value included medical instruments ($2 billion), bananas ($1.24 billion), tropical fruits ($1.22 billion), integrated circuits ($841 million), and orthopedic appliances ($555 million).",
        "• Total exports in 2015 amounted to US$12.6 billion, representing a decline from US$18.9 billion in 2010; bananas and medical instruments remained the largest sectors.",
        "• Total imports in 2015 were US$15 billion, up from US$13.8 billion in 2010, resulting in a trade deficit.",
        "• Costa Rica has attracted significant foreign investment from companies such as Intel Corporation, Procter & Gamble, Abbott Laboratories, and Baxter Healthcare.",
        "• Manufacturing and industry contributions to GDP surpassed agriculture during the 1990s, largely due to foreign investment in Free Trade Zones (FTZs), where companies benefit from investment and tax incentives.",
        "• Companies in FTZs are required to export at least 50% of their services; over half of such investments originate from the United States.",
        "• In 2015, FTZs supported over 82,000 direct jobs and 43,000 indirect jobs; direct employment in these zones grew by 5% compared to 2014.",
        "• Wages in FTZs increased by 7%, and were 1.8 times higher than the average wages in private sector employment outside the zones.",
        "• Notable companies operating in the America Free Zone in Heredia include Dell, HP, Bayer, Bosch, DHL, IBM, and Okay Industries.",
        "• In 2006, Intel’s microprocessor facility accounted for 20% of Costa Rican exports and 4.9% of the country’s GDP.",
        "• In 2014, Intel announced plans to cease manufacturing in Costa Rica, laying off 1,500 staff but maintaining at least 1,200 employees; the facility continued as a test and design center with approximately 1,600 staff.",
        "• By 2017, Intel employed around 2,000 people in Costa Rica, operating a facility that assembles, tests, and distributes processors, along with a Global Innovation Center located in Heredia.",
        "• The fastest-growing sector of the economy is corporate services for foreign companies, which employed approximately 54,000 people in 2016, up from 52,400 in 2015, within a total workforce of under 342,000.",
        "• Major corporations such as Amazon.com employ about 5,000 Costa Rican workers in this sector, many earning roughly double the national average for service jobs.",
        "• The corporate services sector generated US$4.6 billion in revenue in 2016, nearly matching the revenue from tourism.",
        "• In 2013, foreign direct investment (FDI) stock in Costa Rica was approximately 40% of GDP, with U.S. investments constituting 64% of total FDI, followed by the United Kingdom and Spain, each with 6%.",
        "• Outward FDI from Costa Rica was modest, about 3% of GDP as of 2011, mainly concentrated in Central America, which accounted for approximately 57% of outward investments.",
        "• Tourism is a vital component of the economy, with visitor numbers increasing from 780,000 in 1996 to 1 million in 1999, and reaching 2.089 million in 2008, earning US$2.144 billion that year.",
        "• By 2016, tourist arrivals had grown to 2.6 million, with total tourism expenditure around US$3.4 billion, supporting 110,000 direct jobs and 271,000 indirect jobs.",
        "• Costa Rica lacks significant fossil fuel sources, aside from minor coal deposits, but its mountainous terrain and abundant rainfall facilitate the construction of hydroelectric power plants, making the country self-sufficient in energy except for refined petroleum.",
        "• In 2017, Costa Rica was exploring the export of electricity to neighboring countries.",
        "• The country’s mild climate and trade winds eliminate the need for heating or cooling in most areas, especially in highland cities where about 90% of the population resides.",
        "• Renewable energy sources dominate Costa Rica’s electricity generation, accounting for 98.1% of the total in 2016, including hydroelectric stations, geothermal plants, wind turbines, solar panels, and biomass plants."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:19:09.318751",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 8
    },
    {
      "section_number": "8",
      "section_name": "Infrastructure",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Costa Rica's infrastructure has suffered from a lack of maintenance and new investment, leading to widespread deterioration across multiple sectors.",
        "• The country has an extensive road system exceeding 30,000 kilometers; however, much of this infrastructure is in disrepair.",
        "• Infrastructure issues also affect ports, railways, and water delivery systems, all of which are in poor condition.",
        "• A 2016 U.S. government report indicated that Chinese investment aimed at improving infrastructure faced delays due to bureaucratic and legal concerns, resulting in stalled projects.",
        "• Most regions of Costa Rica are accessible by road, with the main highland cities in the Central Valley connected via paved all-weather roads to both the Atlantic and Pacific coasts.",
        "• The Pan American Highway links Costa Rica with Nicaragua and Panama, its neighboring countries to the North and South.",
        "• Costa Rica’s ports are struggling to keep pace with increasing trade volumes, suffering from insufficient capacity and outdated equipment.",
        "• The railway system was non-operational for several years until recent government efforts to reactivate it for urban transportation purposes.",
        "• An August 2016 OECD report summarized the infrastructure situation as follows: the road network is extensive but of poor quality; railways are in disrepair and only gradually being reactivated after shutdowns in the 1990s; seaports lack sufficient capacity and have poor quality infrastructure; internal transportation heavily depends on private road vehicles due to inadequate public transport, especially rail services.",
        "• In a June 2017 interview, President Luis Guillermo Solís emphasized the need for private sector investment to address infrastructure deficiencies.",
        "• President Solís noted that infrastructure challenges are long-term and require ongoing efforts across administrations; he enacted legislation to facilitate Public-Private Partnerships (PPPs) for large projects.",
        "• Examples of large infrastructure projects include a new $2 billion airport serving the capital city and a potential ‘dry canal’ linking Atlantic and Caribbean sea ports, which could require up to $16 billion in investment.",
        "• The Costa Rican government aims to attract foreign investment, technology, and management to the telecommunications and electrical power sectors, which are currently monopolized by the state.",
        "• The Instituto Costarricense de Electricidad (ICE) holds a monopoly over telecommunications, internet, and electricity services, though limited competition exists; in 2011, two private companies began offering cellular services, and VOIP providers offer overseas voice communication.",
        "• According to transparency.org, Costa Rica was regarded in 2007 as one of Latin America’s most stable, prosperous, and least corrupt countries.",
        "• In fall 2004, three former presidents—José María Figueres, Miguel Angel Rodríguez, and Rafael Angel Calderon—were investigated for corruption related to government contracts; Calderon and Rodríguez were sentenced after legal proceedings, while the inquiry into Figueres was dismissed.",
        "• By 2015, Costa Rica ranked 40th globally on the Perception of Corruption scale with a score of 55, indicating a perception of lower corruption than the global average; countries with the lowest perceived corruption scored 90 on the scale.",
        "• In late May 2017, Costa Rica applied to join the OECD Anti-Bribery Convention, with accession expected to take effect in July 2017."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:19:19.968051",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 9
    },
    {
      "section_number": "9",
      "section_name": "Foreign trade",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Costa Rica has actively sought to expand its economic and trade relations both regionally and globally, engaging in multiple free trade agreements (FTAs) and negotiations.",
        "• In 1994, Costa Rica signed a bilateral trade agreement with Mexico, which was subsequently amended to include a broader range of products, enhancing bilateral trade relations.",
        "• In March 1998, Costa Rica, along with other Central American countries and the Dominican Republic, established a Trade and Investment Council with the United States, which later evolved into the Dominican Republic–Central America Free Trade Agreement (CAFTA-DR).",
        "• Costa Rica has entered into bilateral free trade agreements with numerous countries and blocs, with effective dates as follows:",
        "• Canada: November 1, 2002",
        "• Caribbean Community (CARICOM): November 15, 2002",
        "• Chile: February 15, 2002",
        "• China: August 1, 2011",
        "• Colombia: September 2016",
        "• Dominican Republic: March 7, 2002",
        "• El Salvador Customs Union: originally established in 1963, re-launched on October 29, 1993",
        "• European Free Trade Association (EFTA): 2013",
        "• European Union (EU): October 1, 2013",
        "• Guatemala Customs Union: originally 1963, re-launched on October 29, 1993",
        "• Honduras Customs Union: originally 1963, re-launched on October 29, 1993",
        "• Mexico: January 1, 1995",
        "• Nicaragua Customs Union: originally 1963, re-launched on October 29, 1993",
        "• Panama: July 31, 1973, renegotiated and expanded effective January 1, 2009",
        "• Peru: June 1, 2013",
        "• United States: January 1, 2009, under CAFTA-DR",
        "• Singapore: April 6, 2010",
        "• South Korea: March 18, 2019",
        "• Costa Rica has minimal trade barriers, with ongoing efforts to reduce tariffs in line with other Central American nations, facilitating smoother import and export processes.",
        "• The country is a member of the Cairns Group, an organization of agricultural exporting countries advocating for greater access to international markets to boost agricultural exports.",
        "• Domestic opponents of free agricultural trade have occasionally attempted to block imports of locally produced goods such as rice, potatoes, and onions.",
        "• By 2015, Costa Rica’s agricultural exports totaled approximately US$2.7 billion.",
        "• In 2015, the leading export destinations were:",
        "• United States: US$4.29 billion",
        "• Guatemala: US$587 million",
        "• Netherlands: US$537 million",
        "• Panama: US$535 million",
        "• Nicaragua: US$496 million",
        "• The primary sources of imports in 2015 were:",
        "• United States: US$6.06 billion",
        "• China: US$1.92 billion",
        "• Mexico: US$1.14 billion",
        "• Japan: US$410 million",
        "• Guatemala: US$409 million",
        "• The most significant imported products in 2015 were Refined Petroleum, accounting for 8.41% of total imports, and Automobiles, comprising 4.68%.",
        "• Total imports in 2015 amounted to approximately US$15 billion, exceeding exports of US$12.6 billion, resulting in a negative trade balance of US$2.39 billion."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:19:31.846113",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 40
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 10
    },
    {
      "section_number": "10",
      "section_name": "Foreign Direct Investment",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Costa Rican government has been actively courting Foreign Direct Investment (FDI) to support economic development across key sectors such as manufacturing, medicine, and tourism.",
        "• FDI is recognized as a lucrative opportunity for foreign investors, which has resulted in consistent large-scale investments annually.",
        "• From 1970 to 1979, the average net FDI inflow into Costa Rica was approximately forty-four million dollars per year.",
        "• By 1989, just ten years later, the average annual net FDI inflow had increased significantly to approximately four hundred and sixteen million dollars.",
        "• In 2022, Costa Rica received a total of 3 billion dollars in FDI, representing 4.45% of the country's total Gross Domestic Product (GDP).",
        "• Growth in FDI is correlated with an increase in tourist arrivals, which rose from 2.1 million visitors in 2011 to 3.1 million visitors in 2019.",
        "• The Costa Rican government considers the facilitation of FDI growth an essential role in its economic strategy.",
        "• During the years 2019 and 2022, the government successfully attracted investment for a total of 16 new FDI projects.",
        "• One of the notable FDI projects during this period was the development of the luxury hotel named One and Only Papagayo."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:19:36.557462",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 11
    },
    {
      "section_number": "11",
      "section_name": "Statistics",
      "chapter_name": "Economy of Costa Rica",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section provides a comprehensive overview of Costa Rica's main economic indicators from 1980 to 2019, with IMF staff estimates extending from 2020 to 2025, highlighting trends in GDP, inflation, unemployment, and debt.",
        "• A color-coding scheme indicates inflation rates below 5%, marked in green within the data table.",
        "• In 1980, Costa Rica's GDP measured US$8.2 billion (PPP), with a GDP per capita of US$3,560.1 (PPP), and a nominal GDP of US$4.9 billion, with a GDP per capita of US$2,108.8.",
        "• The GDP growth rate in 1980 was 0.8%, with an inflation rate of 18.1%, unemployment at 5.9%, and government debt unspecified.",
        "• Throughout the 1980s, the economy experienced fluctuations: for example, in 1982, GDP was US$8.6 billion (PPP), with a significant inflation spike of 90.3%, and unemployment at 9.4%.",
        "• The 1990s saw steady growth: in 1996, GDP was US$23.8 billion (PPP), with a GDP per capita of US$6,668.1 (PPP), and a GDP growth rate of 1.4%.",
        "• The late 1990s and early 2000s marked economic stabilization, with GDP reaching US$29.2 billion (2000), and GDP per capita US$8,142.2 (PPP).",
        "• The 2000s experienced consistent growth: by 2007, GDP was US$51.9 billion, with a GDP per capita of US$11,948.7, and a real GDP growth rate of 8.2%.",
        "• The global financial crisis of 2008-2009 saw GDP slightly decline in 2009 to US$55.2 billion, with a negative growth rate of -0.9%, but recovered thereafter.",
        "• From 2010 onwards, GDP steadily increased, reaching US$97.9 billion in 2018, with a GDP per capita of US$20,480.0 and a growth rate of 2.6%.",
        "• In 2019, GDP was US$107.1 billion, with a GDP per capita of US$21,093.9, and a growth rate of 2.3%.",
        "• The COVID-19 pandemic caused a contraction in 2020, with GDP dropping to US$103.9 billion (-4.1%), and unemployment rising to 20.0%.",
        "• Post-2020, the economy showed recovery: in 2021, GDP increased to US$111.9 billion, with a growth rate of 3.9%, and unemployment decreased to 16.3%.",
        "• The projected data for 2022-2026 indicates continued growth: GDP reaching US$147.3 billion in 2026, with GDP per capita approximately US$26,977.3, and inflation rates remaining below 3%.",
        "• The main tourist attraction is Poás Volcano Crater.",
        "• In 2017, GDP was estimated at US$61.5 billion, with a real growth rate of 4.3% and GDP per capita (PPP) of US$12,382.",
        "• The sectoral composition in 2016 was: agriculture 5.5%, industry 18.6%, and services 75.9%, with agriculture including bananas, pineapples, coffee, beef, sugarcane, rice, corn, dairy, timber, fruits, and ornamental plants.",
        "• The country’s government bond ratings as of January 2017 were BB− (Standard & Poor's) and Ba2 (Moody's).",
        "• The budget deficit stood at 6.1% of GDP, with 20.5% of the population below the poverty line in 2017.",
        "• Household income distribution in 2009 showed the lowest 10% holding 1.2% of income, while the highest 10% held 39.5%.",
        "• The inflation rate for consumer prices was estimated at 2.6% in 2017.",
        "• The labor force comprised approximately 2.295 million people in 2016, excluding Nicaraguans and those under 15.",
        "• Employment by occupation in 2016 was: agriculture 12.9%, industry 18.57%, services 69.02%.",
        "• The unemployment rate in 2017 was estimated at 8.1%.",
        "• The proposed 2017 government budget was US$15.9 billion, with 46% expected to require financing.",
        "• Key industries include microprocessors, food processing, textiles, construction materials, fertilizer, and plastic products.",
        "• Industrial production growth rate was 4.3% in 2013.",
        "• Electricity production in 2010 was 9.473 billion kWh, with 98.1% generated from renewable (\"green\") sources in 2016.",
        "• Major agricultural exports include bananas, pineapples, tropical fruits, coffee, palm oil, sugar, corn, rice, beans, potatoes, beef, and timber.",
        "• Export value in 2015 was US$12.6 billion, with top commodities being Medical Instruments (US$2B), Bananas (US$1.24B), Tropical Fruits (US$1.22B), Integrated Circuits (US$841M), and Orthopedic Appliances (US$555M).",
        "• Main export partners in 2016 were the United States (US$4.29B), Guatemala (US$587M), the Netherlands (US$537M), Panama (US$535M), and Nicaragua (US$496M).",
        "• Imports in 2015 totaled US$15.1 billion, with major commodities including Refined Petroleum (US$1.26B), Cars (US$702M), Packaged Medicaments (US$455M), Broadcasting Equipment (US$374M), and Computers (US$281M).",
        "• Primary sources of imports in 2016 were the United States (US$6.06B), China (US$1.92B), Mexico (US$1.14B), Japan (US$410M), and Guatemala (US$409M).",
        "• External debt as of January 2016 was US$26.2 billion.",
        "• In 1995, Costa Rica received US$107.1 million in foreign aid.",
        "• The national currency is the Costa Rican colon (₡), with 1 colon equal to 100 centimos.",
        "• Exchange rates have fluctuated: in March 2015, US$1 = 526.46 colones; late May 2017, US$1 = 600; end of July 2017, US$1 = 563; May 2022, US$1 = 677.",
        "• The fiscal year runs from January 1 to December 31."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:19:54.175558",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 38
      },
      "source_file": "economy_of_costa_rica.json",
      "original_index": 12
    }
  ]
}