{
  "extraction_info": {
    "source_file": "economy_of_andorra.json",
    "extraction_timestamp": "2025-08-02T17:13:27.278729",
    "total_sections_in_source": 4,
    "extracted_sections_count": 4,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Andorra",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Andorra is characterized as a developed, free market economy primarily driven by the sectors of finance, retail, and tourism.",
        "• In 2024, Andorra's gross domestic product (GDP) was approximately US$6.00 billion.",
        "• The country is an attractive destination for shoppers from France and Spain, functioning as a free port that facilitates duty-free shopping.",
        "• Andorra has developed extensive summer and winter tourist resorts, supporting its tourism industry.",
        "• The country hosts around 270 hotels and 400 restaurants, along with numerous shops, indicating a robust tourist infrastructure.",
        "• Tourism employs a growing segment of the domestic labor force, with an estimated 10 million tourists visiting annually.",
        "• There is an active trade in consumer goods, including imported manufactured items, which are less expensive due to duty-free status, making them more affordable than in neighboring countries.",
        "• Andorra's duty-free status has significantly influenced its relationship with the European Union (EU), sparking controversy and negotiations.",
        "• Negotiations regarding duty-free status and the broader relationship with the EU began in 1987, shortly after Spain joined the EU.",
        "• An agreement effective from July 1991 established duty-free quotas and imposed limits on certain items, notably milk products, tobacco, and alcoholic beverages.",
        "• Under this agreement, Andorra is allowed to maintain price differences from other EU countries, and visitors are granted limited duty-free allowances.",
        "• Electoral results in Andorra suggest that many citizens support government reform initiatives and believe that some degree of EU integration is necessary to sustain economic prosperity.",
        "• Arable land accounts for less than 2% of Andorra's territory; historically, agriculture was the mainstay of the economy until tourism surged.",
        "• Sheep raising has been the principal agricultural activity, while tobacco cultivation is considered lucrative.",
        "• Most of Andorra's food supplies are imported, reflecting limited domestic agricultural production.",
        "• The country’s manufacturing sector includes the production of cigars, cigarettes, and furniture, serving both domestic consumption and export markets.",
        "• A hydroelectric plant located at Les Escaldes, with a capacity of 26.5 megawatts, supplies approximately 40% of Andorra's electricity needs; the remaining electricity is supplied by Spain."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:13:23.134575",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_andorra.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Overview",
      "chapter_name": "Economy of Andorra",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Tourism is the primary sector of Andorra's economy, accounting for approximately 80% of the country's Gross Domestic Product (GDP).",
        "• Annually, an estimated 9 million tourists visit Andorra, attracted by its duty-free status and its summer and winter resort facilities.",
        "• The country's comparative economic advantage has diminished recently due to the opening of neighboring France and Spain's economies, which has increased the availability of goods and reduced tariffs.",
        "• The banking sector in Andorra is significant to the economy, benefiting from the country's \"tax haven\" status, which attracts financial activities and services.",
        "• Agricultural production in Andorra is limited primarily due to a scarcity of arable land, necessitating the importation of most food supplies.",
        "• The main livestock activity in Andorra is sheep raising.",
        "• Manufacturing industries in Andorra mainly produce cigarettes, cigars, and furniture.",
        "• Andorra is a member of the European Union (EU) Customs Union and is treated as an EU member for trade purposes concerning manufactured goods, allowing it to trade without tariffs."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:13:27.427039",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_andorra.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Statistics",
      "chapter_name": "Economy of Andorra",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Gross Domestic Product (GDP) of Andorra based on purchasing power parity was US$3.327 billion in 2015, ranking 190th in the world.",
        "• The estimated real GDP growth rate for 2015 was 8.95%, placing Andorra at 132nd globally.",
        "• The GDP per capita, adjusted for purchasing power parity, was US$49,900 in 2015, making it the 29th highest in the world.",
        "• The sectoral composition of GDP in 2015 was: agriculture at 11.9%, industry at 33.6%, and services at 54.5%.",
        "• Data on the population below the poverty line is not available (N/A).",
        "• Household income or consumption data by percentage share for the lowest and highest 10% is not available (N/A).",
        "• The inflation rate for consumer prices in 2015 was -0.9%, ranking 225th worldwide.",
        "• The labor force numbered 42,230 in 2007, ranking 185th globally.",
        "• Employment by occupation in 2007 was approximately 0.3% in agriculture, 20.8% in industry, and 79% in services.",
        "• The unemployment rate was 3.7%, placing Andorra at 183rd in the world.",
        "• The government’s budget revenues were US$1.872 billion, while expenditures were US$2.06 billion in 2016.",
        "• Major industries include tourism (notably skiing), banking, timber, and furniture manufacturing.",
        "• The industrial production growth rate was -3.9% in 2020, ranking 184th worldwide.",
        "• Electricity production data is not available; however, electricity is generated primarily through hydro sources (40%) and other sources (60%) imported from Spain, with no fossil fuel or nuclear contribution.",
        "• Andorra imports all its electricity, mainly from Spain and France, and generates a small amount of hydropower domestically.",
        "• Agricultural products include small quantities of rye, wheat, barley, oats, vegetables, tobacco, sheep, and cattle.",
        "• The value of exports was US$1.842 billion in 2020, ranking 163rd globally.",
        "• Export commodities include integrated circuits, dental fitting supplies, cars, gold, and essential oils (2021).",
        "• Major export partners are Spain (40%), France (19%), the United States (11%), and Mauritania (5%) as of 2019.",
        "• Imports totaled US$1.727 billion in 2020, ranking 178th worldwide.",
        "• Import commodities include cars, refined petroleum, perfumes, shaving products, and liquors (2019).",
        "• Main import partners are Spain (71%) and France (17%) as of 2019.",
        "• External debt was zero dollars in 2016.",
        "• Andorra does not receive any economic aid.",
        "• The official currency is the Euro, which has replaced the French franc and Spanish peseta.",
        "• Exchange rates fluctuated over the years, with the Euro per US dollar being 0.845 in 2021, 0.6827 in 2008, 0.7306 in 2007, and other values from 2002 to 2006.",
        "• The fiscal year follows the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:13:35.709058",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 27
      },
      "source_file": "economy_of_andorra.json",
      "original_index": 2
    },
    {
      "section_number": "2.1",
      "section_name": "Companies",
      "chapter_name": "Economy of Andorra",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2022, the sector with the highest number of registered companies in Andorra was Services, accounting for 2,515 companies.",
        "• The Retail Trade sector had the second-highest number of registered companies, totaling 1,157.",
        "• The Wholesale Trade sector ranked third in terms of registered companies, with a total of 1,144."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:13:37.562483",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_andorra.json",
      "original_index": 3
    }
  ]
}