{
  "extraction_info": {
    "source_file": "economy_of_france.json",
    "extraction_timestamp": "2025-08-02T17:13:27.871117",
    "total_sections_in_source": 23,
    "extracted_sections_count": 23,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of France is characterized as a highly developed social market economy with significant state participation in strategic sectors.",
        "• France ranks as the world's seventh-largest economy by nominal GDP and the ninth-largest by purchasing power parity (PPP), accounting for approximately 4% of global GDP.",
        "• Due to a volatile currency exchange rate, France's GDP measured in dollars fluctuates sharply; notably, in 2024, France's GDP is smaller than in 2008.",
        "• The French economy is diversified, with the service sector dominating, representing 78.8% of GDP in 2017, followed by the industrial sector at 19.5%, and the primary sector at 1.7%.",
        "• In 2020, France was the largest recipient of Foreign Direct Investment (FDI) in Europe and the second-largest spender on research and development (R&D) in Europe.",
        "• France was ranked among the top 10 most innovative countries globally according to the 2020 Bloomberg Innovation Index.",
        "• It was also ranked as the 15th most competitive nation worldwide in the 2019 Global Competitiveness Report, improving by two positions compared to 2018.",
        "• France is the fifth-largest trading nation globally and the second-largest in Europe after Germany.",
        "• France is the most visited country in the world and the European Union's leading agricultural power.",
        "• According to the International Monetary Fund (IMF), in 2023, France was the 23rd country in the world by GDP per capita, with a value of $44,408 per inhabitant.",
        "• In 2021, France was listed on the United Nations Human Development Index with a score of 0.903, indicating very high human development, and ranked 22nd on the Corruption Perceptions Index.",
        "• Among OECD countries, France maintains a highly efficient and robust social security system, which constitutes approximately 31.7% of GDP.",
        "• Paris is a leading global city with one of the largest city GDPs worldwide; it ranks first in Europe and third globally by the number of companies listed in Fortune's Fortune Global 500.",
        "• In 2018, Paris produced approximately US$738 billion (or US$882 billion at market exchange rates), accounting for about one-third of the French economy.",
        "• The Paris metropolitan area, the largest in Europe alongside London, generates around US$1.0 trillion, roughly one-third of France's GDP.",
        "• Paris was ranked as the second most attractive global city in 2019 by KPMG.",
        "• La Défense, Paris's Central Business District, was ranked by Ernst & Young in 2017 as the leading business district in continental Europe and fourth worldwide.",
        "• The Organisation for Economic Co-operation and Development (OECD) is headquartered in Paris, which is also France's financial capital.",
        "• Major economic centers in France include Lyon, Toulouse (noted as the center of the European aerospace industry), Marseille, and Lille.",
        "• France's economy entered the late 2000s recession later than many affected economies, experiencing only four quarters of contraction before beginning recovery.",
        "• Between 2012 and 2014, France experienced stagnant growth: 0% in 2012, 0.8% in 2013, and 0.2% in 2014.",
        "• Economic growth resumed with 0.8% in 2015, 1.1% in 2016, 2.2% in 2017, and 2.1% in 2018.",
        "• According to INSEE (2021), medium-sized non-financial and non-agricultural firms employed 3 million full-time equivalent employees, representing 24.3% of the workforce.",
        "• These firms accounted for 27% of investment, 30% of turnover, and 26% of value added, despite constituting only 1.6% of total firms in France."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:05:57.898613",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_france.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Corporations",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2020, France had 31 companies listed among the world's biggest 500 companies, making it the most represented European country in the 2020 Fortune Global 500, surpassing Germany with 27 companies and the UK with 22 companies.",
        "• As of August 2020, France was the leading country in the Eurozone's EURO STOXX 50 index, accounting for 36.4% of all total assets, ahead of Germany which held 35.2%.",
        "• French corporations that rank among the largest in their respective industries include AXA in insurance and Air France in air transportation.",
        "• The luxury and consumer goods sectors are notably significant in France, with L'Oreal recognized as the world's largest cosmetic company.",
        "• LVMH and Kering are identified as the world's two largest luxury product companies.",
        "• In energy and utilities, GDF-Suez and EDF are among the largest energy companies globally, while Areva is a major nuclear-energy enterprise.",
        "• Veolia Environnement is distinguished as the world's largest environmental services and water management company.",
        "• Major construction companies include Vinci SA, Bouygues, and Eiffage.",
        "• Michelin ranks among the top three tire manufacturers worldwide.",
        "• JCDecaux is identified as the world's largest outdoor advertising corporation.",
        "• French banking giants—BNP Paribas, Credit Agricole, and Société Générale—are among the largest banks in the world by assets.",
        "• Capgemini and Atos are recognized as leading technology consulting firms globally.",
        "• Carrefour is the world's second-largest retail group based on revenue.",
        "• Total ranks as the world's fourth-largest private oil company.",
        "• Lactalis is the largest dairy products group in the world.",
        "• Sanofi is the fifth-largest pharmaceutical company globally.",
        "• Publicis is the third-largest advertising company worldwide.",
        "• Groupe PSA is the sixth-largest automaker in the world and the second-largest in Europe.",
        "• Accor is identified as the leading hotel group in Europe.",
        "• Alstom is considered one of the world's leading conglomerates in rail transport.",
        "• In 2022, the sector with the highest number of registered companies in France was Finance, Insurance, and Real Estate, totaling 2,656,178 companies.",
        "• The Services and Retail Trade sectors followed, with 2,090,320 and 549,395 companies respectively."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:02.422899",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_france.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Rise and decline of dirigisme",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• France initiated an extensive and highly successful modernization program under state coordination, characterized by the policy of _dirigisme_, primarily implemented by governments from 1944 to 1983.",
        "• The _dirigisme_ approach involved government control over key industries such as transportation, energy, and telecommunications, alongside providing incentives for private corporations to merge or undertake specific projects.",
        "• During this period, the French government actively directed economic development through regulation and strategic planning, fostering significant growth and transformation of the economy.",
        "• The election of President François Mitterrand in 1981 marked a brief resurgence of increased governmental control, including the nationalization of numerous industries and private banks, reflecting a temporary shift toward more interventionist policies.",
        "• This heightened _dirigisme_ faced criticism as early as 1982, indicating political and economic debates over the extent of state intervention.",
        "• By 1983, the French government decided to abandon the _dirigisme_ model in favor of a policy termed \"rigueur\" (\"rigor\") or \"la rigueur,\" signaling a move towards reduced economic intervention and a focus on austerity and fiscal discipline.",
        "• Following this shift, the government largely retreated from direct economic intervention, and _dirigisme_ has since receded, although some of its traits persist in the current economic framework.",
        "• Throughout the post-_dirigisme_ era, the French economy continued to grow and evolve under government planning and direction more extensively than in other European nations.",
        "• Despite being a largely liberalized economy, the French government maintains a significant role, with government spending constituting 56% of GDP in 2014, making it the second-highest in the European Union.",
        "• Labor conditions and wages in France remain highly regulated by the government, reflecting ongoing interventionist policies.",
        "• The French government continues to hold shares in various corporations across multiple sectors, including energy production and distribution, automobiles, aerospace, shipbuilding, arms manufacturing, electronics, machinery, metallurgy, fuels, chemicals, transportation, and telecommunications."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:06.211421",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_france.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Government finance",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• French government borrowing, measured as budget deficits as a percentage of Gross National Product (GNP), was tracked from 1960 to 2009, with data including French bonds of various maturities spanning 50-year, 20-year, 10-year, 2-year, 1-year, and 3-month durations.",
        "• France's public debt levels from 1978 to 2009 were documented, highlighting trends and changes over this period.",
        "• The composition of the French economy in 2016 was analyzed by expenditure type as a percentage of Gross Domestic Product (GDP).",
        "• In April and May 2012, France held a presidential election resulting in François Hollande's victory, who opposed austerity measures and pledged to eliminate France’s budget deficit by 2017.",
        "• Hollande's government aimed to reverse recent tax cuts and exemptions for the wealthy, including raising the top income tax bracket rate to 75% on incomes exceeding one million euros.",
        "• The government also committed to restoring the retirement age to 60 with full pension rights for those who have worked 42 years, rehire 60,000 jobs cut from public education, regulate rent increases, and build additional public housing for low-income populations.",
        "• In June 2012, Hollande’s Socialist Party secured an overall majority in the French legislative elections, enabling constitutional amendments and immediate implementation of the proposed reforms.",
        "• Following these reforms, French government bond interest rates decreased by 30%, reaching record lows, with yields less than 50 basis points above German government bond rates.",
        "• Emmanuel Macron, a centrist politician, succeeded Hollande as President of France in May 2017, with the goal of revitalizing the euro zone’s second-largest economy.",
        "• In July 2020, amid the COVID-19 pandemic, France issued 10-year bonds with negative interest rates for the first time in its history, meaning investors paid to hold French sovereign debt rather than earning interest.",
        "• France held the fourth-largest gold reserves globally in 2020.",
        "• In May 2023, Macron pledged to build factories, create jobs, and increase France’s economic independence, amidst protests related to pension reforms."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:12.225196",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_france.json",
      "original_index": 3
    },
    {
      "section_number": "3.1",
      "section_name": "National debt",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Government of France has maintained a budget deficit annually since the early 1970s.",
        "• As of 2021, French government debt equaled 118.6% of France's Gross Domestic Product (GDP).",
        "• European Union rules stipulate that member states should limit their national debt to 60% of GDP or work towards reducing it to this level through structural measures.",
        "• EU rules also mandate that member states should keep their public deficits at no more than 3.0% of GDP.",
        "• In late 2012, credit-rating agencies issued warnings that increasing French government debt levels threatened France’s AAA credit rating, raising concerns about potential future credit downgrades and higher borrowing costs.",
        "• In 2012, France was downgraded by Moody’s, Standard & Poor’s (S&P), and Fitch to an AA+ credit rating.",
        "• In December 2014, Fitch and S&P further downgraded France’s credit rating to AA.",
        "• French President Emmanuel Macron, following pension protests, promised in May 2023 to promote factory construction, increase job creation, and enhance France’s independence.",
        "• On September 26, 2024, France experienced a significant shift in its bond market position when its 10-year bond yield surpassed Spain’s for the first time since 2007, reaching 2.97%.",
        "• The French 10-year bond yield slightly exceeded that of Spain’s, despite France’s higher traditional credit rating, raising concerns about France’s fiscal management.",
        "• France’s bond yields were reported to be higher than Portugal’s and approaching levels seen in Italy and Greece, countries with higher perceived economic risks within the Eurozone.",
        "• France faces a looming budget crisis in 2024, with the deficit potentially exceeding 6% of GDP, notably higher than the previous government’s estimate of 5.1%.",
        "• Newly appointed Finance Minister Antoine Armand and Budget Minister Laurent Saint-Martin committed to prioritizing spending cuts over tax increases to address the fiscal shortfall.",
        "• Prime Minister Michel Barnier was tasked with finalizing the 2025 budget within days, amid pressure to develop realistic deficit reduction strategies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:19.127553",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_france.json",
      "original_index": 4
    },
    {
      "section_number": "4",
      "section_name": "Data",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The data illustrates the change in per capita GDP of France from 1820 to 2018, with figures adjusted for inflation to 2011 International dollars, providing a long-term perspective on economic growth and living standards.",
        "• A comprehensive table presents key economic indicators for France from 1980 to 2021, with IMF staff estimates extending to 2027, covering metrics such as GDP in both PPP and nominal terms, GDP per capita, GDP growth rates, inflation rates, unemployment rates, and government debt as a percentage of GDP.",
        "• In 1980, France's GDP was approximately 578.2 billion US dollars (PPP), with a per capita GDP of 10,761.0 US dollars (PPP), and a nominal GDP of 702.2 billion US dollars, with a per capita nominal GDP of 13,069.5 US dollars.",
        "• The annual GDP growth rate in 1980 was 1.8%, with an inflation rate of 13.1%, unemployment at 6.3%, and government debt at 20.8% of GDP.",
        "• Throughout the 1980s, France experienced steady increases in GDP, with nominal GDP rising from 702.2 billion US dollars in 1980 to 1,020.9 billion in 1988, and GDP per capita (PPP) increasing from 10,761 to 17,157 US dollars.",
        "• The 1980s saw inflation rates generally declining from 13.1% in 1980 to below 10% by 1983, with unemployment rates fluctuating around 6-9%, and government debt rising from 20.8% to approximately 33.6% of GDP by 1988.",
        "• The early 1990s marked modest economic growth, with GDP in PPP terms reaching 1,163.6 billion US dollars in 1991 and GDP per capita (PPP) at 20,471.7 US dollars, while nominal GDP was about 1,273.6 billion US dollars.",
        "• During the 1990s, France's GDP growth was relatively stable, with real growth rates mostly between 1.1% and 2.3%, and inflation rates decreasing to below 2% by the late 1990s.",
        "• The late 1990s and early 2000s saw significant increases in GDP, with nominal GDP reaching approximately 1,683.0 billion US dollars in 2000 and GDP per capita (PPP) at 28,594.2 US dollars.",
        "• The 2000s experienced continued growth, with GDP in PPP terms surpassing 2,000 billion US dollars by 2004, and GDP per capita (PPP) rising to over 32,260 US dollars in 2004.",
        "• The financial crisis of 2008-2009 caused a contraction, with GDP decreasing from 2,325.8 billion US dollars in 2008 to 2,275.5 billion in 2009, and a notable GDP decline of -2.8% in 2009.",
        "• Post-2009 recovery saw GDP in PPP terms increase to 2,446.5 billion US dollars in 2011, with GDP per capita (PPP) reaching 38,789.6 US dollars, and a return to positive growth rates.",
        "• From 2012 onward, France's GDP in PPP terms generally increased, reaching 3,124.8 billion US dollars in 2018, with GDP per capita (PPP) at 48,190 US dollars.",
        "• The COVID-19 pandemic in 2020 caused a significant GDP contraction of -7.9%, with GDP in PPP terms falling to 3,020.5 billion US dollars and GDP per capita (PPP) decreasing to 46,267.4 US dollars.",
        "• In 2021, economic recovery was evident with GDP in PPP terms rising by 6.8% to 3,358.9 billion US dollars, and GDP per capita (PPP) increasing to 51,322.3 US dollars.",
        "• IMF estimates project continued growth through 2027, with GDP in PPP terms reaching approximately 4,428.6 billion US dollars and GDP per capita (PPP) rising to about 66,540.8 US dollars by that year.",
        "• The data indicates that inflation rates below 5% are highlighted in green in the table, with notable periods of low inflation occurring from 2014 onward, generally below 2%.",
        "• Unemployment rates fluctuated over the decades, peaking at 10.9% in 1997 and remaining around 8-10% during the 2000s, with a decrease to approximately 7.9% in 2021.",
        "• Government debt as a percentage of GDP increased from 20.8% in 1980 to over 60% during the 1990s and early 2000s, reaching 112.6% in 2021, reflecting rising public debt levels.",
        "• The data collectively illustrates France’s economic resilience, periods of growth, the impact of global financial crises, and ongoing recovery trends up to 2027 projections."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:25.047511",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_france.json",
      "original_index": 5
    },
    {
      "section_number": "4.1",
      "section_name": "Industry",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, France ranked as the 8th largest manufacturer in the world by value added, according to the World Bank.",
        "• The leading industrial sectors in France include telecommunications (including communication satellites), aerospace and defence, shipbuilding, pharmaceuticals, construction and civil engineering, chemicals, textiles, and automobile production.",
        "• The chemical industry is a key sector for France, playing a crucial role in developing other manufacturing activities and contributing significantly to economic growth.",
        "• France's research and development (R&D) expenditure is notably high, accounting for 2.26% of GDP, making it the fourth-highest among OECD countries.",
        "• As of 2018, France's industrial contributions to exports are substantial, with the Observatory of Economic Complexity estimating that the largest export categories are:",
        "• Planes, helicopters, and spacecraft valued at $43.8 billion",
        "• Cars valued at $26 billion",
        "• Packaged medicaments valued at $25.7 billion",
        "• Vehicle parts valued at $16.5 billion",
        "• Gas turbines valued at $14.4 billion",
        "• In December 2023, France's industrial production experienced a significant increase of 1.1%, marking its most notable change since May 2023."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:27.813102",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_france.json",
      "original_index": 6
    },
    {
      "section_number": "4.2",
      "section_name": "Energy",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• France is the world-leading country in nuclear energy, hosting major global energy companies such as Areva, EDF (Electricité de France), and GDF Suez.",
        "• Nuclear power accounts for approximately 78% of France's electricity production, representing a significant increase from about 8% in 1973, 24% in 1980, and 75% in 1990.",
        "• Nuclear waste in France is stored on-site at reprocessing facilities, reflecting the country's approach to managing nuclear by-products.",
        "• Due to its substantial investment in nuclear energy, France is the smallest emitter of carbon dioxide among the seven most industrialized nations globally.",
        "• The country's heavy reliance on nuclear power has resulted in relatively limited growth of renewable energy sources compared to other Western countries.",
        "• In 2006, France generated a total of 548.8 TWh of electricity, with the following distribution:",
        "• 428.7 TWh (78.1%) produced by nuclear power generation",
        "• 60.9 TWh (11.1%) produced by hydroelectric power generation",
        "• 52.4 TWh (9.5%) produced by fossil-fuel power generation",
        "• 21.6 TWh (3.9%) from coal power",
        "• 20.9 TWh (3.8%) from natural-gas power",
        "• 9.9 TWh (1.8%) from other fossil fuels, including fuel oil and gases by-products of industry such as blast furnace gases",
        "• 6.9 TWh (1.3%) from other types of power generation, primarily waste-to-energy and wind turbines",
        "• Wind energy production increased from 0.596 TWh in 2004 to 0.963 TWh in 2005, and further to 2.15 TWh in 2006, but still constituted only about 0.4% of total electricity production as of 2006.",
        "• In November 2004, EDF, one of the world's largest utility companies and France's leading electricity provider, was successfully floated on the French stock market, although the French state retained a 70% ownership stake.",
        "• Other electricity providers in France include Compagnie nationale du Rhône (CNR) and Endesa (operating through SNET)."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:31.600424",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_france.json",
      "original_index": 7
    },
    {
      "section_number": "4.3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• France is the world's sixth largest agricultural producer and the European Union's leading agricultural power, accounting for approximately one-third of all agricultural land within the EU.",
        "• In the early 1980s, France was the leading producer of the three principal grains: wheat, barley, and maize.",
        "• In 1983, France produced around 24.8 million tonnes of wheat, surpassing the United Kingdom and West Germany, which were the next largest wheat producers at that time.",
        "• Northern France is characterized by large wheat farms, indicating a specialization in wheat cultivation in this region.",
        "• The western region of France concentrates on dairy products, pork, poultry, and apple production.",
        "• Beef production is primarily located in central France.",
        "• The production of fruits, vegetables, and wine spans from central to southern France.",
        "• France is a significant producer of many agricultural products and is actively expanding its forestry and fishery industries.",
        "• Reforms in the agricultural sector have been driven by the implementation of the Common Agricultural Policy (CAP) and the Uruguay Round of the General Agreement on Tariffs and Trade (GATT).",
        "• France ranks as the world's second-largest agricultural exporter, just behind the United States.",
        "• Approximately 49% of France's agricultural exports are destined for other EU member states.",
        "• France also exports agricultural products to many poor African countries, including its former colonies, which face serious food shortages.",
        "• Principal exports from France include wheat, beef, pork, poultry, and dairy products.",
        "• US agricultural exports to France amount to about $600 million annually, primarily consisting of soybeans and soybean products, feeds and fodders, seafood, and consumer products such as snack foods and nuts.",
        "• French exports to the United States are predominantly high-value products, including cheese, processed products, and wine.",
        "• US exports face stiff competition in France from domestic production, other EU member states, and third-world countries.",
        "• The French agricultural sector receives nearly €11 billion in EU subsidies.",
        "• In 2018, France produced 39.5 million tons of sugar beet, making it the second-largest producer in the world after Russia; sugar beet is used for sugar and ethanol production.",
        "• France produced 35.8 million tons of wheat in 2018, ranking as the 5th largest global producer.",
        "• France produced 12.6 million tons of maize in 2018, ranking 11th worldwide.",
        "• France produced 11.2 million tons of barley in 2018, the second-largest global producer after Russia.",
        "• France produced 7.8 million tons of potatoes in 2018, ranking 8th in the world.",
        "• France produced 6.2 million tons of grapes in 2018, making it the 5th largest producer globally.",
        "• France produced 4.9 million tons of rapeseed in 2018, ranking 4th worldwide behind Canada, China, and India.",
        "• France produced 2.2 million tons of sugarcane in 2018.",
        "• France produced 1.7 million tons of apples in 2018, ranking 9th globally.",
        "• France produced 1.3 million tons of triticale in 2018, the 4th largest producer after Poland, Germany, and Belarus.",
        "• France produced 1.2 million tons of sunflower seeds in 2018, ranking 9th in the world.",
        "• France produced 712 thousand tons of tomatoes in 2018.",
        "• France produced 660 thousand tons of linen in 2018.",
        "• France produced 615 thousand tons of dry peas in 2018.",
        "• France produced 535 thousand tons of carrots in 2018.",
        "• France produced 427 thousand tons of oats in 2018.",
        "• France produced 400 thousand tons of soybeans in 2018.",
        "• Additional smaller-scale productions include various other agricultural products."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:44.337380",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 35
      },
      "source_file": "economy_of_france.json",
      "original_index": 8
    },
    {
      "section_number": "4.4",
      "section_name": "Tourism",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Palace of Versailles is recognized as one of the most popular tourist destinations in France.",
        "• France was the world's most popular tourist destination in 2014, attracting more than 83.7 million foreign tourists.",
        "• In comparison, Spain received 58.5 million foreign tourists in 2006, and the United States received 51.1 million in 2006.",
        "• The 83.7 million figure excludes individuals staying less than 24 hours in France, such as northern Europeans traveling through France en route to Spain or Italy during the summer months.",
        "• According to 2003 data, some of the most visited tourist sites in France and their annual visitor numbers include:",
        "• Eiffel Tower with 6.2 million visitors",
        "• Louvre Museum with 5.7 million visitors",
        "• Palace of Versailles with 2.8 million visitors",
        "• Cité des Sciences et de l'Industrie with 2.6 million visitors",
        "• Musée d'Orsay with 2.1 million visitors",
        "• Arc de Triomphe with 1.2 million visitors",
        "• Centre Pompidou with 1.2 million visitors",
        "• Mont-Saint-Michel with 1 million visitors",
        "• Château de Chambord with 711,000 visitors",
        "• Sainte-Chapelle with 683,000 visitors",
        "• Château du Haut-Kœnigsbourg with 549,000 visitors",
        "• Puy de Dôme with 500,000 visitors",
        "• Musée Picasso with 441,000 visitors",
        "• Carcassonne with 362,000 visitors",
        "• The most popular tourist site in France is Disneyland Paris, which attracted 9.7 million visitors in 2017."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:49.830208",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_france.json",
      "original_index": 9
    },
    {
      "section_number": "4.5",
      "section_name": "Arms industry",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The French government is the primary customer of the French arms industry, predominantly purchasing warships, guns, nuclear weapons, and related equipment.",
        "• Between 2000 and 2015, France ranked as the fourth largest weapons exporter globally.",
        "• French arms manufacturers export significant quantities of weaponry to countries including Saudi Arabia, the United Arab Emirates, Brazil, Greece, India, Pakistan, Taiwan, Singapore, and numerous others.",
        "• In 2015, France's international arms sales totaled approximately 17.4 billion U.S. dollars.",
        "• The 2015 arms export figure represented more than double the value of France’s arms exports in 2014."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:51.772428",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_france.json",
      "original_index": 10
    },
    {
      "section_number": "4.6",
      "section_name": "Fashion and luxury goods",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to 2017 data compiled by Deloitte, Louis Vuitton Moet Hennessey (LVMH), a French luxury brand, is the largest luxury company in the world by sales, selling more than twice the amount of its nearest competitor.",
        "• France is home to three of the top ten luxury goods companies by sales—LVMH, Kering SA, and L'Oréal—more than any other country in the world.",
        "• Paris is widely regarded as one of the world's foremost fashion capitals, and is sometimes referred to as \"the world's fashion capital.\"",
        "• The French tradition for haute couture is believed to have begun as early as the era of Louis XIV, also known as the Sun King."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:06:54.846392",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_france.json",
      "original_index": 11
    },
    {
      "section_number": "4.7",
      "section_name": "Education",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Education in France is organized in a highly centralized manner with multiple subdivisions, encompassing primary, secondary, and higher education levels.",
        "• The three main stages of education are primary (_enseignement primaire_), secondary (_enseignement secondaire_), and higher education (_enseignement supérieur_).",
        "• French higher education degrees recognized by the Bologna Process include _Licence_ and _Licence Professionnelle_ (equivalent to bachelor's degrees), and the _Master_ and _Doctorat_ degrees.",
        "• The Programme for International Student Assessment (PISA), coordinated by the OECD, ranks the overall knowledge and skills of 15-year-olds in France as 26th globally in reading literacy, mathematics, and science, with an average score of 493, which is near the OECD average.",
        "• In the 1995 Trends in International Math and Science Study (TIMSS), France was ranked 23rd in mathematics and science at the middle school level.",
        "• Grenoble Alpes University, the third largest university in France, has approximately 60,000 students and over 3,000 researchers.",
        "• The OECD reports that French students exhibit greater concern about discipline and behavior in school and classrooms compared to the rest of Europe, with concerns higher than all other OECD countries.",
        "• School principals in France report higher shortages of staff and materials than OECD averages.",
        "• Only about 7% of French teachers believe that the teaching profession is highly valued in France and society.",
        "• School principals in France have observed regular acts of violence and bullying among students, with rates higher than OECD averages.",
        "• French teachers spend a significant portion of their teaching time maintaining order in classrooms, one of the largest proportions among OECD countries studied.",
        "• France experiences a high dropout rate in its education system.",
        "• Pupils in France can pursue apprenticeships leading to the Baccalauréat Technologique, which enables them to undertake short and technical studies in fields such as laboratory work, design, applied arts, hospitality, restaurant management, and general management.",
        "• Higher education in France was significantly reformed following the student revolts of May 1968.",
        "• During the 1960s, the rapid increase in university student numbers (from 280,000 in 1962–63 to 500,000 in 1967–68) led to the creation of campus annexes—hastily developed satellite campuses lacking proper amenities, resident professors, academic traditions, or university status, contributing to the poor performance of the French higher education sector relative to countries like England and Australia.",
        "• France hosts various Catholic universities recognized by the state, with Lille Catholic University being the largest.",
        "• The country also hosts branch colleges of foreign universities, including Baruch College, the University of London Institute in Paris, Parsons Paris School of Art and Design, and the American University of Paris.",
        "• The total number of pupils and students in the French education system exceeds 18 million, with over 2.4 million enrolled in higher education."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:00.115764",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_france.json",
      "original_index": 12
    },
    {
      "section_number": "4.8",
      "section_name": "Transport",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Transportation in France features one of the densest networks globally, with 146 km of road and 6.2 km of rail lines per 100 km², forming a web centered around Paris.",
        "• The rail transport network in France is highly subsidized, constituting a relatively small portion of overall travel, with most travel conducted by car.",
        "• High-speed TGV trains account for a significant share of long-distance travel in France, partly due to the prohibition of intercity buses until 2015.",
        "• France has 3,220 kilometers of high-speed train lines, making it the second most extensive high-speed rail network in the world, after China.",
        "• Charles de Gaulle Airport is among the busiest airports worldwide in passenger traffic, ranking third globally in the number of destinations served and first in the number of countries served with non-stop flights.",
        "• France possesses numerous seaports and harbors, including Bayonne, Bordeaux, Boulogne-sur-Mer, Brest, Calais, Cherbourg-Octeville, Dunkerque, Fos-sur-Mer, La Pallice, Le Havre, Lorient, Marseille, Nantes, Nice, Paris, Port-la-Nouvelle, Port-Vendres, Roscoff, Rouen, Saint-Nazaire, Saint-Malo, Sète, Strasbourg, and Toulon.",
        "• The country has approximately 470 airports; as of a 2005 estimate, there are three heliports in France.",
        "• Of these airports, 288 have paved runways, while 199 have unpaved runways.",
        "• The national airline of France is Air France, a full-service global carrier operating flights to 20 domestic destinations and 150 international destinations across 83 countries, including Overseas France, spanning all six major continents."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:05.310697",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_france.json",
      "original_index": 13
    },
    {
      "section_number": "5",
      "section_name": "Foreign investment",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to a study conducted by Ernst & Young, France was the largest Foreign Direct Investment (FDI) recipient in Europe in 2020, surpassing the United Kingdom and Germany.",
        "• EY attributed France's leading position in FDI in 2020 to President Macron’s reforms of labor laws and corporate taxation, which were well received by both domestic and international investors.",
        "• In the 2019 AT Kearney FDI Confidence Index, France ranked 5th globally, representing an improvement of two positions from its 2017 ranking."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:07.645960",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_france.json",
      "original_index": 14
    },
    {
      "section_number": "6",
      "section_name": "Labour market",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to a 2011 report by the American Bureau of Labor Statistics (BLS), France's GDP per capita at purchasing power parity (PPP) is approximately US$35,000 per person, comparable to the United Kingdom.",
        "• Economist Paul Krugman explained that French workers are roughly as productive as US workers but have a lower workforce participation rate and work fewer hours, attributing the lower per capita GDP to different choices regarding retirement and leisure.",
        "• France has historically experienced a relatively high unemployment rate, even during periods of favorable macroeconomic performance compared to other advanced economies.",
        "• In 2020, the employment rate of the French working-age population was 64.4%, which is lower than Japan (77%), Germany (76.1%), and the UK (75.4%), but higher than the US (62.5%).",
        "• The low employment rate among 15–24-year-olds was 38% in 2012, compared to 47% across OECD countries.",
        "• Since Emmanuel Macron's election in 2017, France implemented several labor market reforms that successfully reduced unemployment rates prior to the COVID-19 recession.",
        "• By late 2019, the French unemployment rate was the lowest in a decade, despite remaining high relative to other developed economies.",
        "• During the 2000s and 2010s, debates between classical liberal and Keynesian economists influenced labor policies; Keynesian policies led to the 1999 law establishing a 35-hour workweek.",
        "• Between 2004 and 2008, the French government attempted supply-side reforms to combat unemployment, including the _contrat nouvelle embauche_ and _contrat première embauche_, which aimed to provide more flexible contracts but were eventually repealed due to resistance.",
        "• The Sarkozy government introduced the _revenu de solidarité active_ (RSA) to counteract the negative employment incentives of the _revenu minimum d'insertion_ (RMI), which provided unemployment benefits independent of previous contributions.",
        "• Neoliberal economists argue that high minimum wages in France hinder low-productivity workers, especially youth, from entering the labor market, contributing to low employment rates.",
        "• A December 2012 _New York Times_ article described a \"floating generation\" of approximately 14 million unemployed young Europeans, including French youth, due to systemic issues such as elitist education, a rigid labor market, and a costly tax system that discourages hiring and firing.",
        "• In July 2013, France's unemployment rate was reported at 11%.",
        "• In April 2014, a legally binding labor agreement was negotiated between employers' federations, unions, and technology/consultancy firms to prevent employees from handling work-related matters outside official hours via smartphones, protecting around 250,000 employees' leisure time.",
        "• Approximately 80,000 French citizens commute daily to work in Luxembourg, forming the largest cross-border workforce in the EU, attracted by higher wages and the demand for skilled labor in Luxembourg's booming economy.",
        "• The 2023 pension reform aimed to reduce France's pension spending, which was about 14% of GDP—significantly higher than the OECD average of just over 9%—by increasing the minimum legal retirement age from 62 to 64 years by 2030.",
        "• President Emmanuel Macron signed the pension reform law into effect in April 2023."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:17.680963",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_france.json",
      "original_index": 15
    },
    {
      "section_number": "7",
      "section_name": "External trade",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2018, France ranked as the 5th largest trading nation globally and the second-largest in Europe after Germany.",
        "• France's foreign trade balance for goods was in surplus from 1992 until 2001, reaching a peak surplus of $25.4 billion (25.4 G$) in 1998.",
        "• The trade balance turned negative in 2000 due to the economic downturn, with a deficit reaching US$15 billion in 2003.",
        "• Total trade in 1998 amounted to $730 billion, representing approximately 50% of France's GDP, encompassing both imports and exports of goods and services.",
        "• Trade with European Union countries accounts for 60% of France's total trade.",
        "• In 1998, US–France trade was approximately $47 billion, limited to goods only.",
        "• French trade data indicates US exports to France accounted for 8.7% of France's total imports, roughly $25 billion.",
        "• US exports to France include industrial chemicals, aircraft and engines, electronic components, telecommunications equipment, computer software, computers and peripherals, analytical and scientific instrumentation, medical instruments and supplies, broadcasting equipment, and programming and franchising.",
        "• The principal French exports to the US are aircraft and engines, beverages, electrical equipment, chemicals, cosmetics, luxury products, and perfume.",
        "• France is the ninth-largest trading partner of the United States.",
        "• As of 2016, the top French export partner was Germany with $70.1 billion, followed by the United States with $40.4 billion, and Belgium-Luxembourg with $36.7 billion.",
        "• Other notable French export partners in 2016 included Italy ($35.3 billion), the United Kingdom ($35.3 billion), Spain ($34.6 billion), China ($18.6 billion), the Netherlands ($16.8 billion), Switzerland ($16.2 billion), Japan ($8.9 billion), Poland ($7.9 billion), Singapore ($7.8 billion), Turkey ($7.5 billion), Hong Kong ($6.4 billion), Ireland ($6.3 billion), Russia ($6.1 billion), Sweden ($5.7 billion), South Korea ($5.7 billion), Algeria ($5.3 billion), and Portugal ($5.3 billion).",
        "• In 2016, France's top import sources were Germany ($99.8 billion), China ($47.9 billion), Italy ($43.7 billion), Belgium-Luxembourg ($41.6 billion), the United States ($37.9 billion), Spain ($37.1 billion), the Netherlands ($26.4 billion), the United Kingdom ($22.4 billion), Switzerland ($15.8 billion), Poland ($10.4 billion), Japan ($10.1 billion), Ireland ($7.6 billion), the Czech Republic ($7.6 billion), Turkey ($7.5 billion), Norway ($6.4 billion), Portugal ($6.3 billion), Sweden ($6.0 billion), Austria ($5.6 billion), India ($5.1 billion), and Vietnam ($5.0 billion).",
        "• Total trade amounts in 2016 show Germany as the leading partner with $169.9 billion, followed by Italy ($79.0 billion), the United States ($78.3 billion), Belgium-Luxembourg ($78.3 billion), Spain ($71.7 billion), China ($66.5 billion), the United Kingdom ($57.7 billion), the Netherlands ($43.2 billion), Switzerland ($32.0 billion), and Japan ($19.0 billion).",
        "• In August 2023, France's current account deficit decreased by €29.7 billion over six months, from −€39.3 billion to −€9.6 billion, primarily driven by a decline in energy prices."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:27.511613",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_france.json",
      "original_index": 16
    },
    {
      "section_number": "8",
      "section_name": "Regional economy",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The nominal GDP per capita of France in 2015, as reported by Eurostat, provides a basis for analyzing regional economic disparities within the country.",
        "• France's regional economic disparity is relatively moderate compared to other European nations; it is less pronounced than in the United Kingdom or Italy but more significant than in Sweden, Denmark, or Spain.",
        "• The Île-de-France region, encompassing Paris, is the most economically dominant region, benefiting from the capital city's economic hegemony, and is Europe's 4th largest regional economy.",
        "• Europe's second largest regional economy is Rhône-Alpes, which ranks 5th in Europe, driven by sectors such as services, high technologies, chemical industries, wines, and tourism.",
        "• Provence-Alpes-Côte d'Azur's economy is characterized by services, industry, tourism, and wines, making it a key regional contributor.",
        "• Nord-Pas-de-Calais functions as a major European transport hub with significant services and industrial sectors.",
        "• Pays de la Loire is notable for its focus on green technologies and tourism.",
        "• Alsace, historically rich in machine tool industry, now stands as a high-income, service-oriented region, despite not ranking very high in absolute GDP terms.",
        "• Rural areas are primarily located in Auvergne, Limousin, and Centre-Val de Loire, with agriculture and related activities predominant.",
        "• Wine production is a significant economic activity in regions such as Aquitaine (notably Bordeaux or claret), Burgundy, and Champagne-Ardennes, where champagne is produced.",
        "• Rhône-Alpes, once heavily reliant on coal mining, particularly around Saint-Étienne, has experienced decline in mining activities since the 1970s.",
        "• The 2015 GDP figures for French regions are as follows:",
        "• Overseas regions have smaller economies, with Réunion at €18,373 million and a GDP per capita of €21,559, Guadeloupe at €9,724 million and €22,509 per capita, Martinique at €9,289 million and €24,516 per capita, Corsica at €8,761 million and €26,629 per capita, French Guiana at €4,441 million and €16,777 per capita, and Mayotte at €2,309 million and €9,755 per capita."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:36.523211",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_france.json",
      "original_index": 17
    },
    {
      "section_number": "8.1",
      "section_name": "Departmental income inequalities",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Paris is France's largest urban economy and ranks as the third-largest in the world.",
        "• Significant income inequalities are observed among the various French départements.",
        "• According to 2008 INSEE statistics, Yvelines is the highest income département in France, with an average income of €4,750 per month.",
        "• Hauts-de-Seine ranks second, Essonne third, Paris fourth, and Seine-et-Marne fifth in terms of average income among départements.",
        "• The Île-de-France region is the wealthiest in France, with an average income of €4,228 per month, making it the wealthiest region in Europe; this is significantly higher than the national average of €3,081.",
        "• Other notable wealthy regions include Alsace (second), Rhône-Alpes (third), Picardy (fourth), and Upper Normandy (fifth).",
        "• The poorest parts of France are the French overseas departments, with French Guiana identified as the poorest department, having an average household income of €1,826.",
        "• In Metropolitan France, Creuse in the Limousin region is the poorest département, with an average household income of €1,849 per month."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:40.686862",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_france.json",
      "original_index": 18
    },
    {
      "section_number": "8.2",
      "section_name": "Urban income inequalities",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Significant urban income inequalities exist within France, notably between different areas of the Paris metropolitan region.",
        "• The Paris metropolitan area exhibits substantial disparities, with higher living standards in _Paris Ouest_ contrasted by lower standards in northern _banlieues_ such as Seine-Saint-Denis.",
        "• Among French cities with populations exceeding 50,000 inhabitants, Neuilly-sur-Seine, a western suburb of Paris, is identified as the wealthiest city in France, with an average household income of €5,939.",
        "• In Neuilly-sur-Seine, approximately 35% of households earn more than €8,000 per month.",
        "• Within the city of Paris itself, four arrondissements have household incomes surpassing those of Neuilly-sur-Seine: the 6th, 7th, 8th, and 16th arrondissements.",
        "• The 8th arrondissement is recognized as the wealthiest district in France.",
        "• The 6th, 7th, and 16th arrondissements follow closely as the second, third, and fourth wealthiest districts in France, respectively."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:43.178087",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_france.json",
      "original_index": 19
    },
    {
      "section_number": "9",
      "section_name": "Poverty",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to OECD data from 2021, approximately 8.4% of the French population lived in poverty.",
        "• This poverty rate in France is significantly lower than in the United States, where it stands at 18%.",
        "• France's poverty rate is also lower than in Canada, with 11.6%, and Germany, with 9.8%.",
        "• In 2016, the poverty rate in France was 14%, representing a decrease from 12.8% in 2004.",
        "• The northern districts of Marseille are among the poorest and most unequal areas in France, characterized by a mix of impoverished neighborhoods and wealthier areas.",
        "• In 2008, the share of people living below the poverty line (defined as 949 euros per month) was 28.8% in sensitive urban zones (ZUS), compared to 12% in other parts of France.",
        "• Foreign workers in France tend to be employed in the most difficult and lowest-paid jobs relative to native French workers.",
        "• Foreign workers also tend to live in poorer conditions compared to their French counterparts.",
        "• A 1972 study revealed that foreign workers earned approximately 17% less than French workers, although this figure masked broader inequalities.",
        "• Foreign workers were more likely to be men in their prime working years and employed in industrial areas, which generally offered higher wages than other regions."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:46.557738",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_france.json",
      "original_index": 20
    },
    {
      "section_number": "9.1",
      "section_name": "Overview",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2010, the estimated total wealth of France was US$14.0 trillion, with a population of 63 million residents.",
        "• French households are the wealthiest in Europe in terms of aggregate wealth, accounting for more than 25% of the wealthiest European households.",
        "• Globally, France ranks as the fourth-wealthiest nation.",
        "• In 2010, the average wealth per French adult was slightly over US$290,000, representing a decline from a pre-financial crisis high of US$300,000 in 2007.",
        "• Based on this per capita wealth ratio, France is the wealthiest country in Europe.",
        "• The wealth tax in France is paid by approximately 1.1 million individuals.",
        "• Liability for the wealth tax begins at €1.3 million in assets, with a discount applied to the value of the principal residence.",
        "• Nearly every French household possesses at least US$1,000 in assets.",
        "• The proportion of French households with assets exceeding US$10,000 is twice the global average, and those with assets over US$100,000 are four times the global average."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:50.962231",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_france.json",
      "original_index": 21
    },
    {
      "section_number": "9.2",
      "section_name": "Millionaires",
      "chapter_name": "Economy of France",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2017, France ranked third in Europe for the highest number of millionaires, with a total of 1.617 million millionaire households measured in US dollars.",
        "• The only European countries with more millionaire households in 2017 were the United Kingdom, with 2.225 million, and Germany, with 1.637 million.",
        "• The term \"millionaire households\" refers to households with net wealth measured in US dollars exceeding one million.",
        "• France's macroeconomic indicators highlight the country's economic standing, including its wealth distribution among high-net-worth individuals.",
        "• The wealthiest individual in France is Bernard Arnault, who is the CEO and owner of the luxury conglomerate LVMH (Moët Hennessy Louis Vuitton).",
        "• By the year 2022, the combined wealth of France's 500 wealthiest individuals was estimated at 1,170 billion euros.",
        "• This total wealth represented approximately 45% of France's gross domestic product (GDP) in 2022.",
        "• In comparison, in 2009, the combined wealth of France’s top 500 was only 194 billion euros, which accounted for roughly 10% of the country's GDP at that time."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:07:55.366910",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_france.json",
      "original_index": 22
    }
  ]
}