{
  "extraction_info": {
    "source_file": "economy_of_india.json",
    "extraction_timestamp": "2025-08-02T17:13:28.057755",
    "total_sections_in_source": 59,
    "extracted_sections_count": 58,
    "skipped_sections_count": 1
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of India is classified as a developing mixed economy characterized by a significant public sector involvement in strategic industries.",
        "• India is the world's fourth-largest economy by nominal GDP and the third-largest by purchasing power parity (PPP).",
        "• On a per capita income basis, India ranked 136th by nominal GDP and 119th by GDP (PPP).",
        "• From independence in 1947 until 1991, successive Indian governments adhered to the Soviet model, promoting protectionist economic policies, extensive Sovietization, state intervention, demand-side economics, natural resource exploitation, bureaucrat-driven enterprises, and economic regulation.",
        "• This protectionist approach is typified by the Licence Raj, a system of extensive licensing and regulation.",
        "• The end of the Cold War and a severe balance of payments crisis in 1991 prompted India to adopt broad economic liberalization policies and indicative planning measures.",
        "• India has approximately 1,900 public sector companies, with the Indian state maintaining complete control and ownership of railways and highways.",
        "• The Indian government exerts major control over sectors including banking, insurance, farming, fertilizers, chemicals, airports, and essential utilities.",
        "• The state also maintains substantial control over digitalization, telecommunication, supercomputing, space, ports, and shipping industries, which were effectively nationalized in the mid-1950s but have seen the emergence of key corporate players.",
        "• Nearly 70% of India's GDP is driven by domestic consumption, making India the world's fourth-largest consumer market.",
        "• Aside from private consumption, India's GDP is fueled by government spending, investments, and exports.",
        "• In 2022, India was the world's 10th-largest importer and the 8th-largest exporter.",
        "• India has been a member of the World Trade Organization since 1 January 1995.",
        "• India ranks 63rd on the ease of doing business index and 40th on the Global Competitiveness Index.",
        "• India has one of the world's highest numbers of billionaires and exhibits extreme income inequality.",
        "• Economists and social scientists often consider India a welfare state, with social welfare spending amounting to 8.6% of GDP in 2021-22, which is significantly lower than the OECD average.",
        "• The Indian labor force comprises 586 million workers, making it the second-largest globally.",
        "• Despite long working hours, India has one of the lowest workforce productivity levels worldwide.",
        "• Structural economic problems have led economists to describe India’s growth as jobless economic growth.",
        "• During the Great Recession, India experienced a mild economic slowdown and endorsed Keynesian policies, implementing fiscal and monetary stimulus measures to stimulate demand and growth.",
        "• Economic growth revived in subsequent years following the recession.",
        "• In 2021–22, foreign direct investment (FDI) in India reached $82 billion, with the leading sectors being finance, banking, insurance, and research & development.",
        "• India maintains free trade agreements with several nations and blocs, including ASEAN, SAFTA, Mercosur, South Korea, Japan, Australia, the United Arab Emirates, and others either in effect or under negotiation.",
        "• The service sector accounts for over 50% of India’s GDP and remains the fastest-growing sector.",
        "• The industrial and agricultural sectors employ the majority of India's labor force.",
        "• The Bombay Stock Exchange and National Stock Exchange are among the world's largest stock exchanges by market capitalization.",
        "• India is the sixth-largest manufacturer globally, contributing approximately 2.6% to global manufacturing output.",
        "• About 65% of India's population resides in rural areas, contributing roughly 50% to the national GDP.",
        "• India faces challenges including high unemployment, rising income inequality, and declining aggregate demand.",
        "• The gross domestic savings rate in India was 29.3% of GDP in 2022."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:23.214224",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 30
      },
      "source_file": "economy_of_india.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "History",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• From approximately 1 CE for nearly 1700 years, India was the world's largest economy, accounting for 35 to 40% of the global GDP during that period.",
        "• After the end of British rule, India adopted a series of economic policies influenced by protectionism, import substitution, Fabian socialism, and social democratic principles.",
        "• The post-independence Indian economy was characterized by Dirigism, featuring extensive regulation, protectionist measures, and public ownership of large monopolies.",
        "• The economy during this period was also marked by pervasive corruption and slow economic growth.",
        "• Since 1991, India has undergone continuous economic liberalization, shifting towards a market-based economy.",
        "• By the year 2008, India had established itself as one of the world's faster-growing economies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:29.664370",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_india.json",
      "original_index": 1
    },
    {
      "section_number": "1.0.1",
      "section_name": "Indus Valley Civilisation",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Indus Valley Civilisation was a permanent settlement that flourished approximately between 2800 BCE and 1800 BCE.",
        "• The citizens engaged in various economic activities including agriculture, domestication of animals, and trade with other cities.",
        "• They utilized uniform weights and measures, indicating a standardized system for trade and commerce.",
        "• The inhabitants manufactured tools and weapons, demonstrating technological skills and craftsmanship.",
        "• Archaeological evidence shows that they traded with other cities, suggesting a well-developed trade network.",
        "• The urban infrastructure included well-planned streets and a sophisticated drainage system, reflecting advanced urban planning.",
        "• The water supply systems in their cities indicate knowledge of water management and sanitation.",
        "• Their urban planning included the first-known urban sanitation systems, showcasing early innovations in public health infrastructure.",
        "• The civilization exhibited the existence of a form of municipal government, implying organized civic administration."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:32.210151",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_india.json",
      "original_index": 2
    },
    {
      "section_number": "1.0.2",
      "section_name": "West Coast",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Maritime trade between southern India, Southeast Asia, and West Asia was extensive from early times until approximately the fourteenth century CE.",
        "• The Malabar and Coromandel Coasts served as significant trading centers from as early as the first century BCE.",
        "• These coasts functioned as key import and export hubs, as well as transit points connecting the Mediterranean region with Southeast Asia.",
        "• Over time, traders organized themselves into associations that received patronage from the state, facilitating and regulating overseas trade activities.",
        "• The system of state patronage for overseas trade declined by the thirteenth century CE.",
        "• After the decline of direct state involvement, local communities—specifically Parsi, Jewish, Syrian Christian, and Muslim groups—began to largely take over the management of overseas trade.",
        "• This shift in control initially occurred on the Malabar Coast and later extended to the Coromandel Coast."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:38.487548",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_india.json",
      "original_index": 3
    },
    {
      "section_number": "1.0.3",
      "section_name": "Silk Route",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Scholars suggest that active trade between India and West Asia and Eastern Europe occurred from the 14th to the 18th centuries.",
        "• During this period, Indian traders established settlements in Surakhani, a suburb of greater Baku, Azerbaijan.",
        "• The construction of a Hindu temple by Indian traders in Surakhani indicates that commerce was both active and prosperous for Indians by the 17th century.",
        "• The coasts of Saurashtra and Bengal played significant roles in maritime trade routes during this era.",
        "• The Gangetic plains and the Indus valley contained several centers of river-borne commerce, facilitating regional trade.",
        "• Most overland trade was conducted via the Khyber Pass, which connected the Punjab region with Afghanistan and extended onward to the Middle East and Central Asia.",
        "• While many kingdoms and rulers issued coins, barter remained a prevalent form of trade exchange.",
        "• Villages paid a portion of their agricultural produce as revenue to their rulers.",
        "• Craftsmen received a share of the crops at harvest time in exchange for their services, indicating a system of reciprocal economic relations."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:46.885699",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_india.json",
      "original_index": 4
    },
    {
      "section_number": "1.1",
      "section_name": "Mughal, Rajput, and Maratha eras (1526–1820)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Indian economy was historically the largest and most prosperous in the world, maintaining this status until the 18th century under the Mughal Empire.",
        "• Sean Harkin estimates that in the 17th century, China and India together may have accounted for 60 to 70 percent of the world's GDP.",
        "• The Mughal economy operated on an elaborate system involving coined currency, land revenue, and trade, with gold, silver, and copper coins issued by royal mints based on free coinage.",
        "• Political stability and a uniform revenue policy under centralized Mughal administration, along with a well-developed internal trade network, contributed to India's economic unity prior to British colonization, despite its predominantly agrarian economy characterized by subsistence agriculture.",
        "• Agricultural production increased during Mughal reforms, with Indian agriculture being more advanced than European agriculture at the time, exemplified by the widespread use of the seed drill among Indian peasants before its adoption in Europe.",
        "• India possibly had higher per-capita agricultural output and standards of consumption compared to 17th-century Europe.",
        "• The Mughal Empire had a thriving industrial manufacturing sector, producing approximately 25% of the world's industrial output until 1750, making India the leading manufacturing hub in international trade.",
        "• Mughal India exported manufactured goods and cash crops globally, including textiles, shipbuilding, and steel industries.",
        "• Key manufactured exports included cotton textiles, yarns, thread, silk, jute products, metalware, and foodstuffs such as sugar, oils, and butter.",
        "• Urbanization was relatively high for its time, with 15% of Mughal India's population living in cities and towns, surpassing the urbanization levels of contemporary Europe and 19th-century British India.",
        "• European demand in early modern Europe was significant for Mughal products, especially cotton textiles, spices, peppers, indigo, silks, and saltpeter (used in munitions).",
        "• Mughal India, particularly from the late 17th to early 18th century, supplied 95% of British imports from Asia, with Bengal Subah alone accounting for 40% of Dutch imports from Asia.",
        "• Mughal India was largely self-sufficient, with minimal demand for European goods, but exported large quantities of Indian goods, especially textiles from Bengal, to other Asian markets like Indonesia and Japan.",
        "• Bengal was the most important center of cotton textile production during this period.",
        "• In the early 18th century, the Mughal Empire declined as it lost western, central, and parts of southern and northern India to the Maratha Empire, which integrated and administered those regions.",
        "• The decline led to reduced agricultural productivity, adversely affecting the textile industry and overall economic vitality.",
        "• Post-Mughal India saw Bengal Subah as the dominant economic power in the east, maintaining thriving textile industries and relatively high wages until it was devastated by Maratha invasions and British colonization in the mid-18th century.",
        "• The Maratha Empire disintegrated after the Third Battle of Panipat, leading to political instability and armed conflicts that severely impacted economic life, though some local prosperity persisted in provincial kingdoms.",
        "• By the late 18th century, the British East India Company had established dominance over other European powers in India, marking a pivotal shift in Indian trade and exerting a less direct influence on the broader economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:38:53.440340",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 19
      },
      "source_file": "economy_of_india.json",
      "original_index": 5
    },
    {
      "section_number": "1.2",
      "section_name": "British era (1793–1947)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The grievances against the British Empire's economic policies in India are well-founded, supported by statistical evidence showing a drastic decline in India's share of world income from 22.6% in 1700 to 3.8% in 1952, as demonstrated by Cambridge historian Angus Maddison.",
        "• In 1700, India's share of global income was nearly equal to Europe's (India at 22.6%, Europe at 23.3%), but by 1952, India's share had diminished significantly, reflecting severe economic decline.",
        "• At the start of the 20th century, India was considered \"the brightest jewel in the British Crown\" yet was also the poorest country in the world in terms of per capita income.",
        "• Angus Maddison's estimates of global GDP contributions from 1 CE to 2003 CE show China and India as the two largest economies until the 18th century, after which shifts occurred due to colonial and industrial developments.",
        "• The expansion and consolidation of the British East India Company from the early 19th century led to major changes in Indian taxation and agricultural policies, promoting commercialization focused on trade, which resulted in decreased food crop production, widespread impoverishment, and famines.",
        "• British policies caused a severe decline in India's handicrafts and handloom sectors due to reduced demand and employment, exacerbating economic hardship.",
        "• Following the Charter of 1813, international restrictions were removed, leading to substantial expansion of Indian trade and a significant transfer of capital from India to Britain, which primarily resulted in revenue drain rather than systematic economic modernization.",
        "• Historically, the Indian subcontinent had the largest economy in the world until early 19th-century colonialism, with a GDP per capita during the Mughal Empire that was stagnant and declining before British rule.",
        "• According to Maddison, India's share of the world economy decreased from 24.4% in 1700 to 4.2% in 1950, with GDP (PPP) per capita stagnating during the Mughal period and declining before British dominance.",
        "• India's share of global industrial output fell from 25% in 1750 to 2% in 1900, while Britain's share increased from 2.9% in 1700 to 9% in 1870, illustrating Britain's rising economic dominance.",
        "• The British East India Company, after conquering Bengal in 1757, monopolized India's large market and cotton resources, facilitating the sale of British manufactured textiles in India and restricting Indian producers through tariffs and taxes.",
        "• Britain imposed protectionist policies such as bans and high tariffs to restrict Indian textiles in Britain, while importing raw cotton from India tariff-free, enabling British textile industries to flourish using Indian raw materials.",
        "• Colonial economic policies created a monopoly over India's market and resources, turning India into both a raw material supplier and a captive market for British goods.",
        "• British territorial expansion in India established an institutional environment that guaranteed property rights among colonizers, promoted free trade, created a single currency with fixed exchange rates, standardized weights and measures, and developed infrastructure such as railways and telegraphs.",
        "• The colonial administration established a civil service aimed to be free from political interference, a common-law legal system, and an adversarial legal framework, aligning with global industrialization trends.",
        "• Despite these infrastructural and institutional developments, at the end of colonial rule, India inherited an economy characterized by extreme poverty, stalled industrial development, agriculture unable to sustain a rapidly growing population, a largely illiterate and unskilled labor force, and inadequate infrastructure.",
        "• The 1872 census indicated that 91.3% of the population in present-day India resided in villages, a slight decline from 85% rural population during Mughal rule under Akbar in 1600, with urbanization remaining sluggish until the 1920s.",
        "• Post-1920s, policies of protectionism and the impact of World War II spurred industrial growth and rural-urban migration, leading to rapid development of port cities like Bombay, Calcutta, and Madras, but only one-sixth of India's population was urban by 1951.",
        "• The colonial period's economic impact remains controversial; Indian independence leaders and historians blame colonial rule for poor post-independence economic performance and argue that colonial revenues fueled Britain's Industrial Revolution.",
        "• Conversely, some historians contend that India's economic decline was due to internal sectoral shifts and global industrialization trends, not solely colonial policies.",
        "• Several economic historians suggest that Indian real wages declined in the early 19th century, possibly starting in the late 18th century, largely attributable to British colonial policies.",
        "• Prasannan Parthasarathi and Sashi Sivramkrishna estimate that Indian weavers' grain wages were comparable to British wages and about five times the subsistence level, similar to wages in advanced Europe, but acknowledge data limitations hinder definitive conclusions.",
        "• It is argued that India experienced deindustrialization in the late 18th century, partly as an indirect consequence of the collapse of the Mughal Empire, which affected traditional industries and economic structures."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:39:28.032846",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 23
      },
      "source_file": "economy_of_india.json",
      "original_index": 6
    },
    {
      "section_number": "1.3",
      "section_name": "Pre-liberalisation period (1947–1991)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Indian economic policy after independence was heavily influenced by the colonial experience, which was perceived as exploitative by Indian leaders who had been exposed to the planned economy of the Soviet Union.",
        "• The domestic policy framework favored protectionism, emphasizing import substitution industrialization, economic interventionism, a large government-run public sector, business regulation, and central planning.",
        "• Conversely, trade and foreign investment policies during this period were relatively liberal, allowing for some openness to external markets.",
        "• India’s Five-Year Plans closely resembled the central planning model of the Soviet Union, focusing on state-directed economic development.",
        "• In the mid-1950s, key industries such as steel, mining, machine tools, telecommunications, insurance, and power plants were effectively nationalized, consolidating state control over critical sectors.",
        "• The overall economic approach of this period is characterized as Dirigism, indicating a dirigiste or state-directed economy.",
        "• A visual representation (not included here) shows the change in India’s per capita GDP from 1820 to 2015, inflation-adjusted to 1990 International Geary-Khamis dollars.",
        "• Jawaharlal Nehru, India’s first prime minister, along with statistician Prasanta Chandra Mahalanobis, formulated and oversaw the initial economic policies post-independence, aiming for rapid development of heavy industry through both public and private sectors.",
        "• Their strategy relied on direct and indirect state intervention rather than the extreme Soviet-style central command economy, with a focus on capital- and technology-intensive heavy industries and subsidized manual, low-skill cottage industries.",
        "• This approach faced criticism from economist Milton Friedman, who argued that it would waste capital and labor and hinder the growth of small manufacturers.",
        "• Nehru is famously quoted as saying, “Never talk to me about profit, Jeh, it is a dirty word,” reflecting the socialist-inspired ethos of his government.",
        "• J. R. D. Tata, in 1969, expressed frustration with India’s regulatory system, stating, “I cannot decide how much to borrow, what shares to issue, at what price, what wages and bonus to pay, and what dividend to give,” highlighting the bureaucratic constraints faced by industry leaders.",
        "• Since 1965, India experienced the Green Revolution, characterized by the adoption of high-yielding seed varieties, increased use of fertilizers, and improved irrigation, which collectively enhanced agricultural productivity, crop patterns, and the linkage between agriculture and industry.",
        "• The Green Revolution was criticized for being unsustainable, promoting capitalistic farming, neglecting institutional reforms, and widening income disparities among farmers.",
        "• In 1984, Prime Minister Rajiv Gandhi pledged to pursue economic liberalization, appointing V. P. Singh as finance minister, who attempted to reduce tax evasion; this effort led to increased tax revenues despite lowering tax rates.",
        "• However, the momentum of economic liberalization waned during Gandhi’s later tenure due to government scandals and political instability."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:39:37.996416",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_india.json",
      "original_index": 7
    },
    {
      "section_number": "1.4",
      "section_name": "Post-liberalisation period (since 1991)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The collapse of the Soviet Union, India's major trading partner, and the Gulf War, which caused a spike in oil prices, led to a significant balance-of-payments crisis for India, raising fears of default on its loans.",
        "• In response to this crisis, India requested a $1.8 billion bailout loan from the International Monetary Fund (IMF), which in turn demanded economic deregulation as a condition for the bailout.",
        "• The Narasimha Rao government, including Finance Minister Manmohan Singh, initiated comprehensive economic reforms in 1991 to address the crisis.",
        "• These reforms abolished the Licence Raj system, reduced tariffs and interest rates, and ended many public monopolies, facilitating the automatic approval of foreign direct investment (FDI) in numerous sectors.",
        "• Since the 1991 reforms, the overall trajectory of liberalization has remained consistent, although successive governments have avoided confronting powerful lobbies such as trade unions and farmers on contentious issues like labor law reforms and agricultural subsidies.",
        "• The post-liberalization period has seen improvements in life expectancy, literacy rates, and food security, with urban residents benefiting more significantly than rural populations.",
        "• India's GDP has experienced exponential growth, nearly doubling every five years, with a comparative growth trend from 1985 to 2016 shown against China's in the relevant data.",
        "• From 2010 onwards, India advanced from the ninth-largest to the fifth-largest economy in the world by nominal GDP in 2019, surpassing the United Kingdom, France, Italy, and Brazil.",
        "• India began a recovery phase in 2013–14, with GDP growth accelerating to 6.4% from 5.5% in the previous year, and continued to grow at 7.5% in 2014–15 and 8.0% in 2015–16.",
        "• In 2015, India grew faster than China for the first time since 1990, with China’s growth rate at 6.9%.",
        "• Subsequently, India’s growth rate decelerated to 7.1% in 2016–17 and 6.6% in 2017–18, partly due to the disruptive effects of the 2016 demonetisation of banknotes and the implementation of the Goods and Services Tax (GST).",
        "• According to the World Bank's 2020 ease of doing business index, India ranked 63rd out of 190 countries, improving by 14 points from 100 in the previous year and by 37 points over two years.",
        "• India’s ranking is among the top 10 worst globally in dealing with construction permits and enforcing contracts but is relatively better in protecting minority investors and facilitating credit.",
        "• The Department of Industrial Policy and Promotion (DIPP) has undertaken strong efforts to improve India’s ease of doing business rankings at the state level, positively influencing the overall national ranking."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:39:57.850439",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_india.json",
      "original_index": 8
    },
    {
      "section_number": "1.5",
      "section_name": "COVID-19 pandemic and aftermath (2020–present)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the COVID-19 pandemic, numerous rating agencies downgraded India's GDP predictions for FY21 to negative figures, indicating a recession in India, the most severe since 1979.",
        "• The Indian economy contracted by 6.6 percent in FY21, which was lower than the initially estimated 7.3 percent decline.",
        "• In 2022, Fitch Ratings upgraded India's economic outlook to stable, aligning with the outlooks of S&P Global Ratings and Moody's Investors Service.",
        "• In the first quarter of the financial year 2022–2023, India’s economy experienced a growth of 13.5 percent."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:39:59.895956",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_india.json",
      "original_index": 9
    },
    {
      "section_number": "2",
      "section_name": "Data",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The table presents key economic indicators of India from 1980 to 2024, with IMF staff estimates extending from 2025 to 2029.",
        "• Inflation rates below 5% are highlighted in green within the table.",
        "• The annual unemployment rate data is sourced from the World Bank; however, the IMF considers these figures unreliable.",
        "• In 1980, India's GDP was approximately 366.4 billion US dollars (PPP), with a per capita GDP of 526.9 US dollars (PPP).",
        "• Nominal GDP in 1980 was about 189.4 billion US dollars, with a per capita nominal GDP of 271.0 US dollars.",
        "• India's GDP growth rate in 1980 was 6.74%, with an unemployment rate of 11.3%.",
        "• Data for government debt as a percentage of GDP is not available for 1980–1984.",
        "• Over the years, India’s GDP (PPP) increased from 366.4 billion US dollars in 1980 to an estimated 24,015.1 billion US dollars in 2029.",
        "• The GDP per capita (PPP) rose from 526.9 US dollars in 1980 to an estimated 15,973.1 US dollars in 2029.",
        "• Nominal GDP grew from 189.4 billion US dollars in 1980 to approximately 6,307.2 billion US dollars in 2029.",
        "• Nominal GDP per capita increased from 271.0 US dollars in 1980 to an estimated 4,195.1 US dollars in 2029.",
        "• India’s real GDP growth fluctuated over the decades, with notable peaks such as 10.3% in 2007 and a significant contraction of -5.8% in 2020.",
        "• Inflation rates varied, with a high of 13.1% in 1998 and a low of 3.4% in 2018; inflation below 5% is marked in green.",
        "• The unemployment rate has generally ranged between approximately 3.4% (2018) and 13.5% (1991), with some years showing rates above 10%.",
        "• Government debt as a percentage of GDP was 75.3% in 1991, peaking at 84.4% in 2003, and decreasing to around 78.4% in 2029.",
        "• From 2001 onwards, India experienced consistent GDP growth, with annual increases often exceeding 6%, reaching 9.7% in 2021.",
        "• The period from 2010 to 2024 shows a steady upward trend in GDP (PPP), from 4,729.2 billion US dollars in 2010 to an estimated 16,020.0 billion US dollars in 2024.",
        "• The same period indicates growth in GDP per capita (PPP) from 3,812.0 US dollars in 2010 to approximately 11,111.7 US dollars in 2024.",
        "• Nominal GDP during 2010–2024 increased from 1,708.5 billion US dollars to an estimated 3,889.1 billion US dollars in 2024.",
        "• Nominal GDP per capita rose from 1,384.2 US dollars in 2010 to approximately 2,697.6 US dollars in 2024.",
        "• The projected GDP growth rate for 2025–2029 remains stable at around 6.5%, with inflation rates decreasing from 4.6% in 2024 to 4.1% in 2026.",
        "• Government debt as a percentage of GDP is estimated to decline gradually from 83.0% in 2024 to 78.4% in 2029."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:40:14.746237",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_india.json",
      "original_index": 10
    },
    {
      "section_number": "2.1",
      "section_name": "GDP (nominal) past and forecasts",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The provided data illustrates the top 15 largest economies in the world based on nominal Gross Domestic Product (GDP) from the years 1990, 2000, 2010, 2020, and projected for 2030, measured in billions of USD.",
        "• In 1990, the United States had the largest nominal GDP at $5,963 billion, followed by Japan at $3,185 billion, and Germany at $1,604 billion.",
        "• By 2000, the United States' GDP increased to $10,250 billion, maintaining its position as the world's largest economy, with Japan at $4,968 billion and Germany at $1,967 billion.",
        "• In 2010, the United States' GDP further grew to $15,048 billion, with China emerging as the third-largest economy at $6,138 billion, overtaking Japan, which was at $5,759 billion.",
        "• The 2020 data shows the United States' GDP reaching $21,354 billion, with China significantly expanding to $15,103 billion, becoming the second-largest economy, and Japan declining to $5,054 billion.",
        "• Projections for 2030 indicate the United States maintaining its leading position with an estimated GDP of $37,153 billion, while China is expected to grow to $25,827 billion, and India is forecasted to reach $6,769 billion, surpassing Germany, which is projected at $5,575 billion.",
        "• The 2010 ranking saw Japan as the third-largest economy, but by 2020, it had fallen to the fifth position, with a GDP of $4,994 billion, while India rose to the third position with $2,674 billion.",
        "• Germany's GDP increased from $1,604 billion in 1990 to an estimated $5,575 billion in 2030, maintaining its position among the top economies.",
        "• The data reveals significant growth in China's economy from $397 billion in 1990 to a projected $25,827 billion in 2030, marking a substantial rise in global economic rankings.",
        "• Other notable changes include the United Kingdom's GDP rising from $1,197 billion in 1990 to an estimated $4,955 billion in 2030, and France's from $1,260 billion to $3,754 billion over the same period.",
        "• The economic landscape shows emerging economies like India and China gaining prominence, with India moving from 15th place in 1990 to the 3rd in 2030, reflecting rapid growth and development.",
        "• The data underscores the shifting dynamics of global economic power, with the United States maintaining dominance but China and India experiencing substantial growth, reshaping the hierarchy of the world's largest economies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:40:19.459020",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_india.json",
      "original_index": 11
    },
    {
      "section_number": "3",
      "section_name": "Regional economies",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India's regional economies display significant variation in terms of economic output, industrial composition, and development levels, reflecting diverse regional characteristics.",
        "• Maharashtra holds the position of the largest state economy in India, contributing over 13% to the national GDP, making it a major economic hub.",
        "• The second-largest economy is Tamil Nadu, followed by Karnataka, Gujarat, and Uttar Pradesh, with these five states collectively accounting for nearly 50% of India's total economic output.",
        "• Southern states such as Tamil Nadu, Karnataka, and Telangana are recognized for their strong performance in the services and manufacturing sectors, indicating a focus on industrial and service-driven growth.",
        "• Western states like Gujarat and Maharashtra are considered industrial powerhouses, contributing significantly to India's manufacturing and industrial output.",
        "• Eastern and central states, including Bihar, Jharkhand, and Chhattisgarh, exhibit comparatively lower GDP figures, reflecting ongoing challenges related to industrialization and infrastructure development.",
        "• Union Territories such as Delhi and Chandigarh, despite their smaller geographical size, have high per capita incomes due to their urban-centric, service-driven economies.",
        "• The economic landscape underscores regional disparities, highlighting both growth opportunities and areas requiring targeted development strategies.",
        "• The Gross State Domestic Product (GSDP) for 2024–25 (nominal) is detailed for Indian states and Union Territories, with Maharashtra leading at ₹42.67 lakh crore (approximately 497.86 billion USD), representing 13.17% of the total GSDP.",
        "• Tamil Nadu's GSDP is ₹30.97 lakh crore (361.45 billion USD), accounting for 9.56% of the national total, followed by Karnataka at ₹28.13 lakh crore (328.17 billion USD) with an 8.68% share.",
        "• Gujarat's GSDP is ₹27.99 lakh crore (326.54 billion USD), representing 8.64% of India's GDP, and Uttar Pradesh's GSDP is ₹26.63 lakh crore (310.88 billion USD), with an 8.22% share.",
        "• West Bengal's GSDP stands at ₹18.76 lakh crore (219.01 billion USD), comprising 5.79% of the total, while Rajasthan's is ₹17.13 lakh crore (199.79 billion USD), with a 5.29% share.",
        "• Other notable states include Andhra Pradesh (₹15.81 lakh crore, 4.88%), Telangana (₹15.26 lakh crore, 4.71%), and Madhya Pradesh (₹15.12 lakh crore, 4.67%).",
        "• States with lower GSDPs include Kerala (₹12.31 lakh crore, 3.80%), Haryana (₹12.19 lakh crore, 3.76%), and Delhi (₹11.33 lakh crore, 3.50%).",
        "• The list also includes Bihar (₹9.76 lakh crore, 3.01%), Odisha (₹9.42 lakh crore, 2.91%), Punjab (₹8.91 lakh crore, 2.75%), and other smaller states and Union Territories.",
        "• Union Territories such as Delhi and Chandigarh, despite their small size, have high per capita incomes driven by urban service economies.",
        "• The total GSDP of India for 2024–25 is ₹324.11 lakh crore (approximately 3,780 billion USD), constituting 100% of the national economy.",
        "• The data illustrates the economic contribution of each state and Union Territory relative to the entire country, emphasizing regional disparities and growth patterns."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:40:43.317427",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_india.json",
      "original_index": 12
    },
    {
      "section_number": "4",
      "section_name": "Sectors",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The sectoral shares of GDP at constant basic prices in India are categorized into primary, secondary, and tertiary sectors, with data spanning from FY 2011-12 to FY 2023-24.",
        "• In FY 2011-12, the primary sector contributed 21.7% to GDP, which slightly decreased to 19.7% by FY 2023-24, indicating a gradual decline in its relative share over the period.",
        "• The secondary sector accounted for 29.3% of GDP in FY 2011-12, decreasing to 25.9% by FY 2023-24, reflecting a declining trend in its contribution to the overall economy.",
        "• The tertiary sector showed the most significant increase, comprising 49.0% of GDP in FY 2011-12 and rising to 54.4% in FY 2023-24, highlighting the growing importance of services in India's economy.",
        "• Between FY 2011-12 and FY 2014-15, the primary sector's share fluctuated around 21%, peaking at 22.1% in FY 2020-21, then declining again to 19.7% by FY 2023-24.",
        "• The secondary sector experienced a steady decline from 29.3% in FY 2011-12 to approximately 25.9% in FY 2023-24, with minor fluctuations, indicating a gradual shift away from manufacturing and industry.",
        "• The tertiary sector's share increased consistently from 49.0% in FY 2011-12 to over 54% in FY 2013-14 and remained above 52% in subsequent years, reaching 54.4% in FY 2023-24.",
        "• The data reflects structural transformation in the Indian economy, with a decreasing reliance on primary and secondary sectors and an expanding tertiary sector, especially in services.",
        "• The fluctuations in sectoral shares over the years demonstrate economic adjustments and shifts in growth patterns, with the tertiary sector becoming the dominant contributor to GDP.",
        "• The primary sector's contribution peaked at 22.1% in FY 2020-21, likely influenced by specific economic factors during that period, before declining again.",
        "• The secondary sector's lowest recorded share was 25.0% in FY 2019-20, with slight increases thereafter, maintaining its position as the second-largest sector.",
        "• The tertiary sector consistently maintained the highest share among the three sectors throughout the period, emphasizing the importance of services such as information technology, finance, and communication in India's economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:40:57.651856",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_india.json",
      "original_index": 13
    },
    {
      "section_number": "4.1",
      "section_name": "Agriculture, forest, and fishing",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Agriculture and allied sectors such as forestry, logging, and fishing contributed 18.4% to India's GDP and employed 51.2 crore persons, accounting for 45.5% of the total workforce in India.",
        "• India is a major agricultural producing country with the largest arable land in the world, followed by the United States, although its agricultural output remains below its potential.",
        "• The contribution of agriculture to India's GDP has declined steadily from 52% in 1951 to 15% in 2023, yet it remains the largest employment sector in the country.",
        "• Since 1950, crop-yield-per-unit-area across all crops has increased due to emphasis in five-year plans, improvements in irrigation, technological advancements, modern agricultural practices, and the provision of agricultural credit and subsidies post-Green Revolution.",
        "• International comparisons show that India's average crop yield is generally 30% to 50% of the highest global yields.",
        "• Key states contributing significantly to Indian agriculture include Uttar Pradesh, Punjab, Haryana, Madhya Pradesh, Andhra Pradesh, Telangana, Bihar, West Bengal, Gujarat, and Maharashtra.",
        "• India receives an average annual rainfall of 1,208 millimetres (47.6 inches) and a total annual precipitation of approximately 4,000 billion cubic metres.",
        "• The total utilisable water resources, including surface and groundwater, amount to 1,123 billion cubic metres.",
        "• About 39% of India's total cultivated area, equating to 546,820 square kilometres (211,130 sq mi), is irrigated.",
        "• The fisheries sector employs nearly 6 million people, supported by inland water and marine resources.",
        "• In 2023, India ranked as the 3rd largest fish producer and 2nd largest aquaculture producer globally, according to the Ministry of Fisheries.",
        "• India exports over 100,000 tonnes (98,000 long tons; 110,000 short tons) of processed cashew kernels annually, with over 600 cashew processing units located in Kollam alone.",
        "• India is the largest producer of milk, jute, and pulses, and has the world's largest cattle population with 303 million animals as of 2023.",
        "• It is the second-largest producer of rice, wheat, sugarcane, cotton, and groundnuts, and the second-largest fruit and vegetable producer, contributing 10.9% and 8.6% respectively to global fruit and vegetable production, but accounts for only 1% of global fruit and vegetable trade.",
        "• India is the second-largest producer and the largest consumer of silk, producing 77,000 tonnes (76,000 long tons; 85,000 short tons) in 2005.",
        "• The country is the second-largest exporter of cashew kernels and cashew nut shell liquid (CNSL), with foreign exchange earnings from cashew kernel exports reaching $356 million in FY 2023.",
        "• During 2023, India exported 76,624 tonnes (75,414 long tons; 84,464 short tons) of cashew kernels.",
        "• India's foodgrain production was stagnant at approximately 316 megatonnes (311 million long tons; 348 million short tons) during 2020–21.",
        "• Major exports include Basmati rice, wheat, cereals, spices, fresh and dry fruits, cotton, tea, coffee, milk products, and other cash crops to Asian, African, and other countries.",
        "• Low productivity in Indian agriculture results from factors such as over-regulation, increased costs, price risks, and governmental intervention in labor, land, and credit markets.",
        "• Infrastructure deficits include inadequate rural roads, electricity, ports, food storage, retail markets, and services.",
        "• The average landholding size is very small, with 70% of holdings being less than one hectare (2.5 acres).",
        "• As of 2016, only 46% of cultivable land was irrigated, making farmers dependent on rainfall, especially the monsoon, which is often inconsistent and unevenly distributed.",
        "• Various schemes, including the Accelerated Irrigation Benefit Programme (AIBP), have aimed to irrigate an additional 20 million hectares (49 million acres), with ₹800 billion (approximately ₹1.2 trillion or US$14 billion in 2023) allocated in the Union Budget.",
        "• Food storage and distribution infrastructure deficiencies cause about one-third of India's agricultural produce to be lost due to spoilage."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:10.909222",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_india.json",
      "original_index": 14
    },
    {
      "section_number": "4.2",
      "section_name": "Automobile industry",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The automotive industry in India is among the largest and fastest-growing globally, making significant contributions to the country's economy, employment, and export performance.",
        "• As of 2023, India ranked as the fourth-largest automobile producer in the world, following China, the United States, and Japan.",
        "• The sector accounts for approximately 7.1% of India's Gross Domestic Product (GDP).",
        "• The industry employs over 37 million people both directly and indirectly.",
        "• As of April 2022, India's auto industry was valued at more than US$100 billion.",
        "• The industry contributes to 8% of India's total exports and 7.1% of the country's GDP.",
        "• India's automotive market includes both domestic and international manufacturers.",
        "• Key passenger vehicle manufacturers in India are Maruti Suzuki, Hyundai Motor India, Tata Motors, Mahindra & Mahindra, Kia India, and Toyota Kirloskar Motor.",
        "• Leading companies in the two-wheeler segment include Hero MotoCorp, Honda Motorcycle and Scooter India, TVS Motor, and Bajaj Auto.",
        "• The commercial vehicle segment is dominated by Tata Motors, Ashok Leyland, and Mahindra & Mahindra.",
        "• Vehicle production and sales data from 2019-20 to 2024-25 show the following trends:",
        "• Passenger vehicle production increased from 3,424,564 units in 2019-20 to an estimated 5,061,164 units in 2024-25.",
        "• Domestic passenger vehicle sales grew from 2,773,519 units in 2019-20 to an estimated 4,301,848 units in 2024-25.",
        "• Passenger vehicle export sales rose from 662,118 units in 2019-20 to an estimated 770,364 units in 2024-25.",
        "• Commercial vehicle production increased from 756,725 units in 2019-20 to an estimated 1,032,645 units in 2024-25.",
        "• Domestic commercial vehicle sales grew from 717,593 units in 2019-20 to an estimated 956,671 units in 2024-25.",
        "• Commercial vehicle export sales varied, from 60,379 units in 2019-20 to an estimated 80,986 units in 2024-25.",
        "• Three-wheeler production rose from 1,132,982 units in 2019-20 to an estimated 1,050,020 units in 2024-25.",
        "• Domestic three-wheeler sales increased from 637,065 units in 2019-20 to an estimated 741,420 units in 2024-25.",
        "• Three-wheeler export sales declined from 501,651 units in 2019-20 to an estimated 306,914 units in 2024-25.",
        "• Two-wheeler production decreased from 21,032,927 units in 2019-20 to 17,821,111 units in 2021-22, then increased to an estimated 23,883,857 units in 2024-25.",
        "• Domestic two-wheeler sales fell from 17,416,432 units in 2019-20 to 13,570,008 units in 2021-22, then rose to an estimated 19,607,332 units in 2024-25.",
        "• Two-wheeler export sales were 3,519,405 units in 2019-20, dipped to 3,282,786 units in 2020-21, then increased to an estimated 4,198,403 units in 2024-25."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:23.047044",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 23
      },
      "source_file": "economy_of_india.json",
      "original_index": 15
    },
    {
      "section_number": "4.3",
      "section_name": "Micro, Small, and Medium Enterprises (MSME)",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India’s initial efforts to develop Micro, Small, and Medium Enterprises (MSMEs) began between 1978 and 1980, during which the environment for SMEs and entrepreneurship was initially hostile.",
        "• As of the latest data, India has approximately 63 million MSMEs, which contribute about 35% to the country's Gross Domestic Product (GDP).",
        "• MSMEs in India provide employment to approximately 111.4 million persons, making them a significant source of livelihood.",
        "• These enterprises account for over 40% of India’s exports, highlighting their critical role in the national economy and being regarded as the ‘growth engines’ of India’s economic development.",
        "• In comparison, China has been creating between 16,000 and 18,000 new enterprises daily over the past five years, whereas India has been generating approximately 1,000 to 1,100 new enterprises per day.",
        "• Micro and small enterprises possess substantial potential to address India’s unemployment crisis, contingent upon resolving existing constraints that hinder sector growth.",
        "• According to the Annual MSME Report 2021-22, over 90% of India’s 6.3 crore (63 million) MSMEs are classified within the micro-segment.",
        "• Within the micro sector, 62% of firms are self-employed with no additional workers, 32% employ two or three workers, and only 6-7% have four or more workers, with some firms employing up to 19 workers.",
        "• The year 2023 marked a record-breaking year for SME Initial Public Offerings (IPOs), with a total of 179 listings.",
        "• The Indian government, in its Budget 2023, introduced several reforms aimed at fostering MSME growth and enhancing their international competitiveness."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:28.986735",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_india.json",
      "original_index": 16
    },
    {
      "section_number": "4.4",
      "section_name": "Machinery, Tools and equipment",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The machinery and equipment market in India is projected to grow at an annual rate of 8% from 2024 to 2029.",
        "• The size of India's Industrial Machinery, Equipment, and Tools market was estimated to be $210 billion in 2023.",
        "• The increase in research and development activities, along with a large number of startups, has contributed to heightened investment in various sectors including tools, industrial equipment, robotics, industrial automation, pharmaceutical machinery, and mining & construction equipment.",
        "• The Indian government has launched initiatives aimed at promoting the electrification of fossil-fuel-based equipment, with the goal of reducing the country's carbon footprint.",
        "• These government initiatives are also fostering new technological innovations within the machinery and equipment sector."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:31.239664",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_india.json",
      "original_index": 17
    },
    {
      "section_number": "4.4.1",
      "section_name": "Mining",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2022, India reported a total of 1,319 mines, with 545 mines designated for metallic minerals and 775 for non-metallic minerals.",
        "• The mining sector contributed approximately 1.75% to India's Gross Domestic Product (GDP) in 2021.",
        "• It employed directly or indirectly around 11 million people as of 2021.",
        "• India was the fourth-largest producer of minerals in the world by volume in 2009 and the eighth-largest by value in the same year.",
        "• In 2013, India mined and processed a total of 89 minerals, comprising four fuel minerals, three atomic energy minerals, and 80 non-fuel minerals.",
        "• The public sector accounted for 68% of mineral production by volume during the fiscal year 2011–12.",
        "• India possesses the world's fourth-largest natural resources reserve, with the mining sector contributing 11% to the country's industrial GDP and 2.5% to the total GDP.",
        "• Nearly 50% of India's mining output value is concentrated in eight states: Odisha, Rajasthan, Chhattisgarh, Andhra Pradesh, Telangana, Jharkhand, Madhya Pradesh, and Karnataka.",
        "• An additional 25% of mineral output value is derived from offshore oil and gas resources.",
        "• In 2010, India operated approximately 3,000 mines, with about half of these mines focused on coal, limestone, and iron ore extraction.",
        "• On the basis of output value, India was among the top five global producers of mica, chromite, coal, lignite, iron ore, bauxite, barite, zinc, and manganese.",
        "• India was also among the top ten largest producers worldwide for many other minerals.",
        "• In 2013, India ranked as the fourth-largest producer of steel and the seventh-largest producer of aluminium globally.",
        "• Despite its vast mineral resources, India’s mining industry has experienced decline, with its contribution to GDP decreasing from 3% in 2000 to 2.3% in 2010.",
        "• The sector employed approximately 2.9 million people, representing a decreasing share of the total Indian labor force.",
        "• India is a net importer of several minerals, including coal.",
        "• The decline of India's mining sector is attributed to complex permit, regulatory, and administrative procedures, inadequate infrastructure, shortage of capital resources, and slow adoption of environmentally sustainable technologies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:35.868065",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_india.json",
      "original_index": 18
    },
    {
      "section_number": "4.4.2",
      "section_name": "Cement",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Indian cement industry is the second-largest cement producer in the world, surpassed only by China.",
        "• The current installed capacity of cement in India is 500 million tonnes per annum (MTPA).",
        "• The actual cement production in India is approximately 298 million tonnes per annum.",
        "• About 35% of the total installed capacity is concentrated in the states of South India.",
        "• Under the PAT (Perform, Achieve, and Trade) scheme, the total installed capacity of cement in India is 325 MTPA.",
        "• The capacity covered by the PAT scheme accounts for approximately 65% of the total installed capacity in India."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:37.981349",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_india.json",
      "original_index": 19
    },
    {
      "section_number": "4.4.3",
      "section_name": "Iron and steel",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Bokaro Steel Plant (BSL) alone contributes approximately 45% of Steel Authority of India Limited's (SAIL) profit and produces a highly diversified steel portfolio.",
        "• India surpassed Japan to become the world's second-largest steel producer in January 2019.",
        "• According to worldsteel data, India's crude steel production in 2018 was 106.5 million tonnes (104.8 long tons; 117.4 short tons), representing a 4.9% increase from 101.5 million tonnes (99.9 long tons; 111.9 short tons) in 2017.",
        "• This increase in production in 2018 led India to overtake Japan as the second-largest steel-producing country globally.",
        "• As per data presented by the Press Information Bureau (PIB) for the fiscal year 2021–22, India has more than 900 steel plants producing crude steel.",
        "• These steel plants are owned by Public Sector Undertakings (PSUs), large-scale companies, as well as small and medium enterprises (SMEs).",
        "• The total installed capacity of these steel plants in 2021–22 was approximately 154.06 million tonnes.",
        "• The total market value of the Indian steel sector was valued at US$57.8 billion in 2011 and was projected to reach US$95.3 billion by 2016.",
        "• Despite growth in capacity, the growth of crude steel production in India has not kept pace with capacity expansion, according to industry reports.",
        "• The steel sector contributes about 2% to India’s Gross Domestic Product (GDP).",
        "• The sector employs approximately 500,000 people directly and around 2 million people indirectly.",
        "• The Indian steel industry has been vibrant, growing at a compounded annual rate of 6% year-on-year."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:42.402361",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_india.json",
      "original_index": 20
    },
    {
      "section_number": "4.4.4",
      "section_name": "Petroleum",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Petroleum products and chemicals are a significant component of India's industrial GDP, contributing over 34% of the country's export earnings.",
        "• India hosts numerous oil refinery and petrochemical operations, many developed with Soviet technology, including the Barauni Refinery and Gujarat Refinery.",
        "• The Jamnagar refinery complex is the world's largest refinery, processing 1.24 million barrels of crude oil per day.",
        "• The Indian chemical industry is the third-largest producer in Asia by volume and contributes approximately 5% to India's GDP.",
        "• India ranks among the five largest producers globally of agrochemicals, polymers and plastics, dyes, and various organic and inorganic chemicals.",
        "• Despite being a major producer and exporter, India is a net importer of chemicals due to high domestic demand.",
        "• The chemical industry in India is highly diversified and has an estimated total value of $178 billion."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:44.755105",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_india.json",
      "original_index": 21
    },
    {
      "section_number": "4.4.5",
      "section_name": "Chemicals and fertilizer",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The chemical industry in India contributed $163 billion to the economy in FY18 and is projected to reach between $300 billion and $400 billion by 2025.",
        "• In 2016, the industry employed approximately 17.33 million people, accounting for 4% of the total workforce.",
        "• Currently, India has 57 large fertilizer units manufacturing a wide range of nitrogen fertilizers, including 29 units producing urea and 9 units producing ammonia sulfate as a by-product.",
        "• Additionally, there are 64 small-scale units producing single super phosphate fertilizer.",
        "• According to the latest data from the World Trade Organization (WTO), India has become the second-largest exporter of agrochemicals globally, a significant rise from the sixth position held ten years prior.",
        "• The Indian agrochemical industry generates a substantial trade surplus annually, which increased sharply from Rs. 8,030 crores in 2017–18 to Rs. 28,908 crores in the most recent fiscal year.",
        "• India's agrochemical exports doubled over the past six years, rising from $2.6 billion in 2017–18 to $5.4 billion in the last financial year, as per data from the Ministry of Commerce.",
        "• The industry has achieved an impressive compound annual growth rate (CAGR) of 13%, making it one of the fastest-growing sectors within Indian manufacturing.",
        "• Millions of farmers across over 130 countries rely on Indian agrochemicals for their high quality and affordability, according to industry observers.",
        "• The global agrochemicals market is estimated at $78 billion, predominantly consisting of post-patent products, with India rapidly emerging as a preferred global sourcing hub for such agrochemicals.",
        "• To promote domestic production and reduce reliance on imports, the Crop Care Federation of India (CCFI) has recommended specific measures to the Government of India."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:41:48.237404",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_india.json",
      "original_index": 22
    },
    {
      "section_number": "4.4.6",
      "section_name": "Railways and Logistics",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Indian Railways contributes approximately 3% to India's gross domestic product (GDP).",
        "• It has social obligations valued at $5.3 billion annually.",
        "• Over the past five years, Indian Railways' revenue has grown at a compound annual growth rate (CAGR) of 5%.",
        "• Despite revenue growth, profitability has significantly declined over the last four years due to increasing infrastructure and modernization expenses.",
        "• Indian Railways employs about 1.31 million people, making it one of the largest employers in India.",
        "• The railway sector is a major contributor to employment, GDP, and mobility within the country.",
        "• Indian Railways has revised its 2022–23 rolling stock production plan upward, setting a new target of 8,429 units for the financial year.",
        "• The production target for 2022–23 has been increased by 878 units from the previous plan of 7,551 units.",
        "• As part of its modernization efforts, Indian Railways aims to manufacture 475 new Vande Bharat trainsets over the next four years.",
        "• The Vande Bharat trainset project represents a business opportunity valued at approximately Rs 40,000 crore ($5 billion), expected to generate around 15,000 jobs and various spin-off benefits.",
        "• Indian Railways' CORE (Central Organisation for Railway Electrification) plans to electrify the entire broad gauge network by 31 March 2024.",
        "• Currently, 90% of India's total train tracks are fully electrified as of July 2023.",
        "• The entire electrified mainline network in India uses 25 kV AC; DC electrification is limited to metro systems.",
        "• During the eleventh Five Year Plan (2007–2012), the Ministry of Railways initiated the construction of the Dedicated Freight Corridor (DFC) across two major routes: the Eastern and Western freight corridors.",
        "• The combined length of these corridors is 3,260 kilometers (2,030 miles).",
        "• The Eastern Dedicated Freight Corridor runs from Ludhiana in Punjab to Dankuni in West Bengal.",
        "• The Western Dedicated Freight Corridor extends from Jawaharlal Nehru Port in Mumbai, Maharashtra, to Dadri in Uttar Pradesh.",
        "• The DFC is projected to generate around 42,000 jobs and provide long-term employment opportunities in both the public and private sectors."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:00.937355",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_india.json",
      "original_index": 23
    },
    {
      "section_number": "4.4.7",
      "section_name": "Rapid Transit",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2024, India possesses the third largest metro system in the world, reflecting significant urban transit development.",
        "• The country is actively developing modern mass rapid transit systems to address current and future urban transportation needs.",
        "• Existing modern metro rail systems are operational in the cities of Navi Mumbai, Delhi, Mumbai, Bangalore, Kolkata, Hyderabad, Kochi, Gurgaon, Jaipur, Noida, Pune, Nagpur, Kanpur, Ahmedabad, and Lucknow.",
        "• Plans are underway to establish similar mass transit systems in additional cities including Agra, Bhopal, Indore, Surat, Patna, Bhubaneswar, Tri-city areas (Gwalior, Mysore, Nashik), Prayagraj, Varanasi, Ranchi, Thane, and Trivandrum.",
        "• Former Prime Minister Atal Bihari Vajpayee is credited with the success of India’s metro systems, which have largely followed the Delhi Metro model.",
        "• The Delhi Metro model has generated substantial real estate wealth, especially in smaller cities such as Gurgaon and Noida.",
        "• Elevated metro corridors do not require land acquisition because their pillars are constructed above the median strip of roads.",
        "• Land prices in tier-II cities like Lucknow, Patna, Jaipur, Ahmedabad, Pune, Kochi, and Coimbatore have increased by approximately 8-10 percent following the introduction of metro corridors, according to an assessment by JLL.",
        "• India is also developing modern Regional Rapid Transit Systems (RRTS) to replace older MRTS systems, aimed at improving connectivity in the Delhi Metropolitan Area and Mumbai Metropolitan Region.",
        "• The RRTS will serve suburban areas located 80–100 km from the city centers of Delhi and Mumbai, enhancing regional connectivity."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:11.481270",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_india.json",
      "original_index": 24
    },
    {
      "section_number": "4.4.8",
      "section_name": "Aviation",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India is the fourth-largest civil aviation market globally, with an air traffic volume of 158 million passengers recorded in 2017.",
        "• The Indian civil aviation market is projected to have approximately 800 aircraft by the year 2020, which would constitute about 4.3% of the global aircraft fleet.",
        "• By 2037, India is expected to record an annual passenger traffic of around 520 million passengers.",
        "• The International Air Transport Association (IATA) estimated that in 2017, aviation contributed approximately $30 billion to India's Gross Domestic Product (GDP).",
        "• In 2017, the aviation sector supported around 7.5 million jobs in India, including 390,000 direct jobs, 570,000 jobs within the value chain, and 6.2 million jobs generated through tourism.",
        "• As of 2024, India has constructed 75 new airports over the past ten years, bringing the total number of airports—including helipads and aerodromes—to 149.",
        "• The Government of India aims to increase the total number of airports from 149 to 220 within the next 5 to 7 years.",
        "• The Indian government has allocated a capital expenditure (capex) plan of Rs 1 lakh crore specifically for airport infrastructure development."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:18.528663",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 25
    },
    {
      "section_number": "4.4.9",
      "section_name": "Shipbuilding",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Shipbuilding Financial Assistance Policy (SBFAP) was introduced in 2016 to provide financial support to Indian shipyards for shipbuilding contracts.",
        "• Since its inception, under SBFAP, a total of 313 domestic and export vessel orders have been procured by 39 Indian shipyards.",
        "• The total value of these shipbuilding orders amounts to approximately ₹10,500 crore, which is equivalent to about $1.26 billion.",
        "• The Ministry of Ports, Shipping and Waterways reports these figures, indicating active government support for the Indian shipbuilding industry.",
        "• India hosts multiple shipbuilding companies, including Cochin Shipyard, Hindustan Shipyard, and Swan Defence and Heavy Industries.",
        "• These companies primarily produce ships for European, South American, and African shipping companies.",
        "• Cochin Shipyard is notable for being a pioneer in the development of autonomous electric propulsion ships.",
        "• The INS Vikrant, an Indian aircraft carrier, is under construction at Cochin Shipyard, highlighting the shipyard’s significant role in national defense and advanced shipbuilding."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:24.898360",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 26
    },
    {
      "section_number": "4.4.10",
      "section_name": "Datacentre and cloud",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India has become the leading data centre hub in the Asia-Pacific region, excluding China, surpassing established markets such as Singapore, Australia, South Korea, Japan, and Hong Kong in terms of installed capacity.",
        "• This growth reflects the increasing demand for data services driven by India’s status as one of the world's fastest-growing major economies.",
        "• India’s current installed data centre capacity is 950 MW, with projections indicating an additional 850 MW of capacity expected to be added by 2026, positioning India as a significant player in the Asia-Pacific data centre sector.",
        "• In Hyderabad, the largest data centre spans over 1.31 lakh square feet (131,000 square feet).",
        "• The proposed data centre in Hyderabad is rated as a Tier-4 (rated-4) facility, which will be equipped with 1,600 racks and powered by an 18 MW electricity supply.",
        "• India’s overall public cloud services market is projected to reach US $13 billion by 2026, demonstrating a compound annual growth rate (CAGR) of 23.1% during the period from 2021 to 2026.",
        "• The revenue generated from public cloud services in India totaled US $2.8 billion in the first half of 2022."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:30.223077",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_india.json",
      "original_index": 27
    },
    {
      "section_number": "4.4.11",
      "section_name": "Telecommunications",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The broadcasting sector in India is highly dependent on the INSAT-1B satellite system, which plays a crucial role in satellite-based broadcasting services.",
        "• The telecommunication sector in India generated ₹2.20 trillion (US$26 billion) in revenue during the fiscal year 2014–15, representing approximately 1.94% of the country's total Gross Domestic Product (GDP).",
        "• The manufacturing and export of telecom equipment in India are emerging as a new success story, particularly following the notable success of smartphone exports.",
        "• In the financial year 2024, India's telecom equipment production surpassed Rs 45,000 crore, with exports reaching approximately Rs 10,500 crore, marking significant growth in the sector.",
        "• India is the second-largest global market in terms of the number of telephone users, both fixed-line and mobile, with a total of 1.053 billion subscribers as of 31 August 2016.",
        "• The country has some of the lowest call-tariffs worldwide, driven by intense competition among telecom operators.",
        "• India ranks as the third-largest Internet user-base in the world, with 342.65 million Internet subscribers as of 31 March 2016.",
        "• The Indian telecommunication industry is the second-largest globally in terms of the number of mobile phone users, smartphone users, and Internet users.",
        "• India is the 24th-largest oil producer in the world and the third-largest oil consumer.",
        "• Industry estimates from 2012 indicate there are over 554 million television consumers in India.",
        "• India holds the distinction of being the largest direct-to-home (DTH) television market globally by the number of subscribers.",
        "• As of May 2016, the country had 84.80 million DTH subscribers, reflecting the significant growth and penetration of DTH services in India."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:40.361527",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_india.json",
      "original_index": 28
    },
    {
      "section_number": "4.4.12",
      "section_name": "Defence",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The PAFC AIP fuel-cell module, developed by the Defence Research and Development Organisation (DRDO) of India, is designed to power marine transport, indicating advancements in India's defense technology for maritime applications.",
        "• The Indian Army maintains over 1.3 million active personnel, making it the third-largest military force globally and the largest volunteer army in the world.",
        "• India's defense expenditure for the fiscal year 2022–23 was approximately US$70.12 billion, representing a 9.8% increase compared to the previous fiscal year.",
        "• India is the world's second-largest arms importer, accounting for 9.5% of the total global arms imports between 2016 and 2020.",
        "• During the financial year 2022–23, India exported military hardware worth ₹159.2 billion (US$1.9 billion), marking the highest export value ever recorded and a tenfold increase since the fiscal year 2016–17."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:46.298730",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_india.json",
      "original_index": 29
    },
    {
      "section_number": "4.4.13",
      "section_name": "Diversified Energy sector",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Kakrapar Nuclear Plant's IPHWR-700 reactor, which began construction in 1984, is a notable development in India's nuclear energy sector.",
        "• India’s primary energy consumption ranks third globally, following China and the United States, with a 5.3% share of the world's total energy consumption in 2015.",
        "• Coal and crude oil together constitute approximately 85% of India’s primary energy consumption, highlighting their dominance in the energy mix.",
        "• As of April 2015, India’s proven crude oil reserves totaled 763.476 megatonnes (equivalent to 751.418 million long tons or 841.588 million short tons).",
        "• India’s natural gas reserves stood at 1,490 billion cubic meters, or 53 trillion cubic feet, as of the same period.",
        "• Oil and natural gas fields in India are predominantly located offshore at sites such as Ashoknagar Oil Field, Bombay High, Krishna Godavari Basin, Mangala Area, and the Cauvery Delta, with onshore fields mainly in West Bengal, Assam, Gujarat, and Rajasthan.",
        "• India is the fourth-largest consumer of oil globally; in the fiscal year 2014–15, net oil imports amounted to nearly ₹8.2 trillion (approximately US$97 billion), adversely impacting the country’s current account deficit.",
        "• The petroleum industry in India is primarily composed of public sector companies including Oil and Natural Gas Corporation (ONGC), Hindustan Petroleum Corporation Limited (HPCL), Bharat Petroleum Corporation Limited (BPCL), and Indian Oil Corporation Limited (IOCL).",
        "• Major private Indian companies in the oil sector include Reliance Industries Limited (RIL), which operates the world's largest oil refining complex.",
        "• India became the world’s third-largest producer of electricity in 2013, capturing a 4.8% share of global electricity generation, surpassing Japan and Russia.",
        "• By the end of 2015, India experienced an electricity surplus, with many power stations idling due to lack of demand.",
        "• As of May 2016, the installed capacity of India’s utility electricity sector was 303 GW, comprising: 69.8% thermal power, 15.2% hydroelectricity, 13.0% from other renewable sources, and 2.1% nuclear power.",
        "• India primarily meets its domestic electricity demand through its proven coal reserves of approximately 106 gigatonnes (104 billion long tons or 117 billion short tons).",
        "• The country possesses significant potential in alternative energy sources, including solar, wind, and biofuels such as jatropha and sugarcane.",
        "• Uranium reserves in India have been declining, which hindered nuclear energy growth; however, recent discoveries in the Tummalapalle belt may rank among the top 20 natural uranium reserves worldwide.",
        "• India’s estimated thorium reserves are approximately 846,477 tonnes (833,108 long tons or 933,081 short tons), constituting about 25% of the world's total thorium reserves, supporting long-term nuclear energy ambitions.",
        "• The Indo-US nuclear deal has facilitated India's ability to import uranium from other countries, bolstering its nuclear energy program."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:51.829348",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_india.json",
      "original_index": 30
    },
    {
      "section_number": "4.5",
      "section_name": "Infrastructure sector",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Vizhinjam International Seaport in Thiruvananthapuram is recognized as the first _Mother Port_ in the world, featuring a harbor depth of 24 metres, highlighting its significance in global maritime infrastructure.",
        "• India's infrastructure and transport sector contribute approximately 5% to the country's Gross Domestic Product (GDP), underscoring its vital role in economic development.",
        "• As of 31 March 2015, India possesses a road network exceeding 5,472,144 kilometres (3,400,233 miles), making it the second-largest road network globally, after the United States.",
        "• The density of India's road network is 1.66 km of roads per square kilometre of land (2.68 miles per square mile), which is higher than Japan (0.91) and the United States (0.67), and significantly exceeds China (0.46), Brazil (0.18), and Russia (0.08).",
        "• Approximately 87.05% of Indian roads were paved as of 31 March 2015, indicating ongoing efforts to improve road quality.",
        "• By May 2014, India had completed over 22,600 kilometres (14,000 miles) of 4- or 6-lane highways, connecting major manufacturing, commercial, and cultural centers across the country.",
        "• India's road infrastructure handles about 60% of freight transportation and 87% of passenger traffic, emphasizing its importance in logistics and mobility.",
        "• The Delhi-Meerut Expressway is the second widest expressway in India, with 14 lanes, after the Dwarka Expressway, reflecting advancements in expressway infrastructure.",
        "• India has a 7,500-kilometre (4,700 miles) coastline featuring 13 major ports, 15 large private ports, and 60 operational non-major ports, which collectively manage 95% of the country's external trade by volume and 70% by value, with the remainder primarily handled via air transport.",
        "• Kandla Port (also known as New Kandla) is the largest public port, established in the early 1960s, while Mundra Port is the largest private seaport in India.",
        "• The airport infrastructure includes 125 airports nationwide, with 66 airports licensed to handle both passengers and cargo, supporting domestic and international connectivity.",
        "• Prominent global infrastructure companies operating in India include Afcons Infrastructure, Adani Group, JSW Infrastructure, and Larsen & Toubro.",
        "• The construction industry contributed approximately $288 billion, accounting for 13% of India's GDP, and employed around 60.42 million people, representing 14% of the workforce in 2016.",
        "• The construction and real estate sector ranks third among 14 major sectors in India in terms of direct, indirect, and induced economic effects, indicating its significant multiplier impact.",
        "• The real estate sector is expected to generate substantial business opportunities, employment, and support the startup ecosystem, reflecting its growth potential.",
        "• The 2023 Union Budget of India allocated nearly ₹10 trillion in direct investments from the central government toward infrastructure development, emphasizing government focus on this sector.",
        "• The MGNREGA scheme provides employment to approximately 80 million people and facilitates large-scale infrastructure development across rural India.",
        "• India is actively privatizing various infrastructure assets, including airports, ports, bus stands, railway stations, dams, wind parks, solar parks, floating solar plants, power transmission networks, highways, and thermal power facilities, aiming to boost efficiency and investment."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:42:57.941685",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_india.json",
      "original_index": 31
    },
    {
      "section_number": "4.5.1",
      "section_name": "Banking and financial services",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The financial services industry in India contributed $809 billion, accounting for 37% of the country's GDP, and employed approximately 14.17 million people, representing 3% of the workforce, in the year 2016.",
        "• The banking sector specifically contributed $407 billion, or 19% of GDP, and employed about 5.5 million people, or 1% of the workforce, in 2016.",
        "• The Indian money market is divided into two sectors: the organised sector, which includes private, public, and foreign-owned commercial banks along with cooperative banks, collectively known as 'scheduled banks'; and the unorganised sector, comprising individual or family-owned indigenous bankers, money lenders, and non-banking financial companies.",
        "• The unorganised sector and microcredit are preferred over traditional banks in rural and suburban areas, especially for non-productive purposes such as short-term loans for ceremonies.",
        "• Prime Minister Indira Gandhi nationalised 14 banks in 1969, followed by six additional banks in 1980, with a policy mandate requiring banks to allocate at least 40% of their net credit to priority sectors including agriculture, small-scale industry, retail trade, and small business to promote social and developmental objectives.",
        "• The number of bank branches increased from 8,260 in 1969 to 72,170 in 2007, while the population covered by a single branch decreased from 63,800 to 15,000 during the same period.",
        "• Total bank deposits grew from ₹59.1 billion in 1970–71 (equivalent to ₹2.8 trillion or US$33 billion in 2023) to ₹38.31 trillion in 2008–09 (equivalent to ₹96 trillion or US$1.1 trillion in 2023).",
        "• Rural bank branches expanded from 1,860 in 1969, representing 22% of total branches, to 30,590 in 2007, representing 42%, yet only 32,270 of 500,000 villages are served by a scheduled bank.",
        "• India's gross domestic savings as a percentage of GDP was 32.8% in 2006–07, with more than half of personal savings invested in physical assets such as land, houses, cattle, and gold.",
        "• Public-sector banks, owned by the government, hold over 75% of the total assets of the banking industry, while private banks hold 18.2%, and foreign banks hold 6.5%.",
        "• Since liberalisation, India has implemented significant banking reforms, including encouraging mergers, reducing government interference, and increasing profitability and competitiveness of banks.",
        "• Reforms have also opened the banking and insurance sectors to private and foreign companies, alongside reforms aimed at strengthening nationalised banks.",
        "• The Reserve Bank of India (RBI) is the central banking authority overseeing monetary policy, banking regulation, and financial stability.",
        "• The Indian government has issued bonds with various maturities, including 30-year, 10-year, 2-year, 1-year, and 3-month tenors, to finance government borrowing and manage liquidity."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:05.244022",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_india.json",
      "original_index": 32
    },
    {
      "section_number": "4.5.2",
      "section_name": "Retail",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2020, the retail industry in India, excluding wholesale, contributed approximately $793 billion, accounting for 10% of the country's GDP.",
        "• The retail sector employed around 35 million people in 2020, representing about 8% of India's workforce.",
        "• The Indian retail industry is the second largest employer in the country, following agriculture.",
        "• The Indian retail market is estimated to be worth US$600 billion, making it one of the top-five retail markets globally by economic value.",
        "• India has one of the fastest-growing retail markets worldwide, with projections indicating it would reach US$1.3 trillion by 2020.",
        "• The current retail market value in India is approximately US$1.17 trillion, contributing over 10% to India's GDP.",
        "• India also possesses one of the world's fastest-growing e-commerce markets; in 2018, the e-commerce retail market was valued at US$32.7 billion.",
        "• The Indian e-commerce retail market is projected to grow to US$71.9 billion by 2022.",
        "• The majority of India's retail industry comprises local mom-and-pop stores, owner-staffed shops, and street vendors.",
        "• Retail supermarkets are expanding within India, holding a market share of 4% as of 2008.",
        "• In 2012, the Indian government permitted 51% foreign direct investment (FDI) in multi-brand retail and 100% FDI in single-brand retail.",
        "• Growth of organized retail in India is hindered by factors such as inadequate back-end warehouse infrastructure and complex state-level permits and red tape.",
        "• Retail stores must comply with over thirty regulations, including \"signboard licences\" and \"anti-hoarding measures,\" before commencing operations.",
        "• There are taxes imposed on moving goods across state borders and even within individual states, complicating logistics and supply chain operations."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:09.646398",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_india.json",
      "original_index": 33
    },
    {
      "section_number": "4.5.3",
      "section_name": "Tourism",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2024, Ayodhya became the top tourist destination in India, notably with the attraction of the Ram Temple, drawing increased domestic and international visitors.",
        "• The World Travel & Tourism Council (WTTC) estimated that in 2017, tourism contributed ₹15.24 trillion (US$180 billion) to India's economy, accounting for 9.4% of the nation's Gross Domestic Product (GDP).",
        "• In 2017, the tourism sector supported approximately 41.622 million jobs in India, representing about 8% of total employment.",
        "• The sector is projected to grow at an annual rate of 6.9%, reaching ₹32.05 trillion (US$380 billion) by 2028, which would constitute approximately 9.9% of India's GDP.",
        "• Over 10 million foreign tourists visited India in 2017, marking a 15.6% increase from 8.89 million in 2016.",
        "• The tourism industry contributed about 9.2% to India’s GDP and employed over 42 million people, highlighting its significant economic impact.",
        "• India earned approximately US$21.07 billion in foreign exchange from tourism receipts in 2015.",
        "• International tourist arrivals in India increased steadily from 2.37 million in 1997 to 8.03 million in 2015.",
        "• Bangladesh is the largest source of international tourists to India, followed by European Union countries and Japan.",
        "• In 2024, Ayodhya, especially due to the Ram Temple, became Uttar Pradesh’s leading tourist destination, attracting both domestic and international visitors.",
        "• Less than 10% of international tourists visit the Taj Mahal; most tourists explore other cultural, thematic, and holiday circuits across India.",
        "• Approximately 12 million Indian citizens undertake international trips annually for tourism purposes.",
        "• Domestic tourism within India involves about 740 million Indian travelers each year.",
        "• The medical tourism sector in India is rapidly growing, leveraging the country's low-cost healthcare services and long-term care options.",
        "• In October 2015, the medical tourism industry was valued at approximately US$3 billion.",
        "• The sector is projected to expand to between US$7 billion and US$8 billion by 2020.",
        "• In 2014, India hosted 184,298 foreign patients seeking medical treatment, indicating the sector’s significance."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:13.947791",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_india.json",
      "original_index": 34
    },
    {
      "section_number": "4.5.4",
      "section_name": "Wedding Industry",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India's wedding industry is valued at approximately $75 billion, making it the second largest globally after China.",
        "• It ranks as the fourth largest industry within India.",
        "• The industry experienced significant growth in 2023, characterized by larger and more extravagant weddings following the pandemic period.",
        "• The average number of guests per wedding increased by nearly 15%, from 270 guests in 2022 to 310 guests in 2023.",
        "• Wedding celebrations expanded, with couples hosting an average of 4.2 functions in 2023, up from 3.2 functions in previous years.",
        "• Approximately 27 lakh (2.7 million) weddings fall within the ₹10-25 lakh (1 to 2.5 million rupees) budget range, indicating the popularity of mid-range wedding budgets.",
        "• Smaller budget weddings, costing around ₹3 lakh and ₹6 lakh, each account for about 10 lakh (1 million) weddings.",
        "• High-end weddings costing ₹1 crore (10 million rupees) or more constitute approximately 50,000 weddings annually.",
        "• India hosts the highest number of weddings globally each year, according to investment banking and capital market firm Jefferies.",
        "• In terms of market size, the Indian wedding industry is still smaller than China's but is nearly twice as large as the United States' wedding industry."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:17.429081",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_india.json",
      "original_index": 35
    },
    {
      "section_number": "4.5.5",
      "section_name": "Films, entertainment and music industry",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Indian cinema industry is projected to generate approximately Rs 16,198 crore in revenue by the year 2026.",
        "• Of this total, Rs 15,849 crore is expected to come from box office revenue, indicating the primary source of income within the industry.",
        "• The remaining Rs 349 crore of the projected revenue will be derived from advertising activities associated with the cinema industry.",
        "• The report highlights that India’s recorded music industry, which is a significant sub-segment of the broader entertainment sector, is experiencing consistent growth.",
        "• The recorded music industry is expanding at a compound annual growth rate (CAGR) of 13.6 percent.",
        "• This steady progress in the music industry is largely attributed to the increasing popularity and adoption of streaming models, which have contributed to the sector’s growth."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:19.324697",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_india.json",
      "original_index": 36
    },
    {
      "section_number": "5",
      "section_name": "Security markets",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The National Stock Exchange of India (NSE) is the largest stock exchange in India by trading volume, accounting for 96% of all trading activity in the country.",
        "• The development of Indian security markets began with the launch of the Bombay Stock Exchange (BSE) in July 1875.",
        "• The Ahmedabad Stock Exchange was established in 1894, marking the early growth of India's securities trading infrastructure.",
        "• Since the establishment of BSE and Ahmedabad Stock Exchange, an additional 22 exchanges have been traded in various Indian cities.",
        "• In 2014, India’s stock exchange market ranked as the 10th largest in the world by market capitalization, surpassing markets in South Korea and Australia.",
        "• As of February 2015, the combined market capitalization of India’s two major stock exchanges, BSE and NSE, was approximately US$1.71 trillion and US$1.68 trillion respectively.",
        "• By September 2021, the market capitalizations of BSE and NSE had increased to US$3.36 trillion and US$3.31 trillion respectively, according to the World Federation of Exchanges.",
        "• The Indian IPO market has been relatively small compared to major markets like NYSE and NASDAQ, raising US$300 million in 2013 and US$1.4 billion in 2012.",
        "• Ernst & Young attributed the low IPO activity to market conditions, slow government approval processes, and complex regulatory frameworks.",
        "• Prior to 2013, Indian companies were restricted from listing their securities internationally without first conducting an IPO within India.",
        "• In 2013, India reformed its security laws, allowing companies to choose their initial listing location—overseas, domestic, or both concurrently.",
        "• The legal reforms also facilitated easier overseas listings of already-listed Indian companies and aimed to increase liquidity for private equity and international investors in Indian firms."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:25.553478",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_india.json",
      "original_index": 37
    },
    {
      "section_number": "6",
      "section_name": "Foreign trade and investment",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2006, India’s exports were distributed globally, with the United States being the largest market, accounting for a significant share of Indian exports, valued at $20.9 billion.",
        "• The map illustrating the global distribution of Indian exports in 2006 highlights the relative importance of various countries as export destinations for India.",
        "• The United States held the top position as the primary market for Indian exports, reflecting strong economic and trade ties between the two countries during that period.",
        "• The data underscores the reliance of India’s export sector on the US market in 2006, with other countries also contributing to India’s export profile, though specific percentages or figures for these are not provided in the section.",
        "• The visual representation emphasizes the geographical spread of Indian exports, illustrating the country’s integration into global trade networks as of 2006."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:27.567708",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_india.json",
      "original_index": 38
    },
    {
      "section_number": "6.1",
      "section_name": "Major Trade Partners",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The table presents the largest trading partners of India for the fiscal year 2024-25, based on total trade value measured in billions of USD.",
        "• The United States is India's top trading partner, with an export value of 88.02 billion USD, an import value of 43.01 billion USD, and a total trade volume of 130.3 billion USD, resulting in a trade surplus of 45.01 billion USD in favor of India.",
        "• China ranks as the second-largest trading partner, with an export value of 16.66 billion USD, an import value of 101.75 billion USD, and a total trade value of 118.41 billion USD, leading to a trade deficit of 85.09 billion USD for India.",
        "• The United Arab Emirates (UAE) is India's third-largest trading partner, with exports worth 35.63 billion USD, imports totaling 48.02 billion USD, and a combined trade volume of 83.65 billion USD, resulting in a trade deficit of 12.39 billion USD.",
        "• Russia's trade with India amounts to a total of 65.69 billion USD, with exports at 4.26 billion USD, imports at 61.43 billion USD, and a significant trade deficit of 57.17 billion USD for India.",
        "• Saudi Arabia's trade figures include exports of 11.56 billion USD, imports of 31.81 billion USD, and a total trade volume of 43.37 billion USD, with a trade deficit of 20.25 billion USD.",
        "• Singapore's trade with India totals 35.61 billion USD, comprising exports of 14.41 billion USD, imports of 21.20 billion USD, and a trade deficit of 6.79 billion USD.",
        "• Iraq's trade volume is 33.35 billion USD, with exports at 3.35 billion USD, imports at 30.00 billion USD, resulting in a trade deficit of 26.65 billion USD for India.",
        "• Indonesia's trade totals 29.40 billion USD, with exports of 5.99 billion USD, imports of 23.41 billion USD, and a trade deficit of 17.42 billion USD.",
        "• Hong Kong's trade figures include exports of 8.24 billion USD, imports of 20.45 billion USD, and a total trade volume of 28.69 billion USD, leading to a trade deficit of 12.21 billion USD.",
        "• South Korea's trade with India amounts to 27.56 billion USD, with exports of 6.42 billion USD, imports of 21.14 billion USD, and a trade deficit of 14.72 billion USD."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:34.413572",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_india.json",
      "original_index": 39
    },
    {
      "section_number": "6.2.1",
      "section_name": "India's foreign trade by year",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between 1999 and 2024, India's total foreign trade has shown significant fluctuations, with total trade values ranging from a low of USD 86.5 billion in 1999 to a peak of USD 1,662.36 billion in 2023.",
        "• In 2024, India's total trade was valued at USD 1,631.48 billion, with exports amounting to USD 776.68 billion and imports totaling USD 854.80 billion, resulting in a trade deficit of USD 78.12 billion.",
        "• In 2023, the total trade was USD 1,662.36 billion, with exports at USD 770.18 billion and imports at USD 892.18 billion, leading to a trade deficit of USD 122.00 billion.",
        "• The trade figures for 2022 show a total of USD 1,436.59 billion, with exports of USD 676.53 billion and imports of USD 760.06 billion, resulting in a trade deficit of USD 83.53 billion.",
        "• In 2021, India’s total trade was USD 1,032 billion, with exports at USD 420 billion and imports at USD 612 billion, producing a trade deficit of USD 192 billion.",
        "• The 2020 trade data indicates a total of USD 781.5 billion, with exports of USD 314.31 billion and imports of USD 467.19 billion, resulting in a trade deficit of USD 158.88 billion.",
        "• In 2019, total trade was USD 844.14 billion, with exports at USD 330.07 billion and imports at USD 514.07 billion, leading to a trade deficit of USD 184 billion.",
        "• The 2018 trade figures show USD 769.1 billion in total trade, with exports of USD 303.52 billion and imports of USD 465.58 billion, resulting in a trade deficit of USD 162.05 billion.",
        "• In 2017, India’s total trade was USD 660.1 billion, with exports at USD 275.8 billion and imports at USD 384.3 billion, resulting in a trade deficit of USD 108.5 billion.",
        "• The 2016 trade data reports USD 643.3 billion in total trade, with exports of USD 262.3 billion and imports of USD 381 billion, leading to a trade deficit of USD 118.7 billion.",
        "• In 2015, total trade was USD 758.2 billion, with exports at USD 310.3 billion and imports at USD 447.9 billion, resulting in a trade deficit of USD 137.6 billion.",
        "• The 2014 trade figures show USD 781.1 billion in total trade, with exports of USD 318.2 billion and imports of USD 462.9 billion, leading to a trade deficit of USD 144.7 billion.",
        "• In 2013, total trade was USD 780.7 billion, with exports at USD 313.2 billion and imports at USD 467.5 billion, resulting in a trade deficit of USD 154.3 billion.",
        "• The 2012 trade data indicates USD 798.8 billion in total trade, with exports of USD 298.4 billion and imports of USD 500.4 billion, producing a trade deficit of USD 202 billion.",
        "• In 2011, total trade was USD 760.8 billion, with exports at USD 299.4 billion and imports at USD 461.4 billion, leading to a trade deficit of USD 162 billion.",
        "• The 2010 trade figures show USD 528.1 billion in total trade, with exports of USD 201.1 billion and imports of USD 327 billion, resulting in a trade deficit of USD 125.9 billion.",
        "• In 2009, total trade was USD 442.5 billion, with exports at USD 168.2 billion and imports at USD 274.3 billion, leading to a trade deficit of USD 106.1 billion.",
        "• The 2008 trade data reports USD 481.9 billion in total trade, with exports of USD 176.4 billion and imports of USD 305.5 billion, resulting in a trade deficit of USD 129.1 billion.",
        "• In 2007, India’s total trade was USD 212.9 billion, with exports at USD 112.0 billion and imports at USD 100.9 billion, resulting in a trade surplus of USD 11.1 billion.",
        "• The 2006 trade figures show USD 189.33 billion in total trade, with exports of USD 76.23 billion and imports of USD 113.1 billion, leading to a trade deficit of USD 36.87 billion.",
        "• In 2005, total trade was USD 158.51 billion, with exports at USD 69.18 billion and imports at USD 89.33 billion, resulting in a trade deficit of USD 20.15 billion.",
        "• The 2004 trade data indicates USD 131.39 billion in total trade, with exports of USD 57.24 billion and imports of USD 74.15 billion, leading to a trade deficit of USD 16.91 billion.",
        "• In 2003, total trade was USD 109.9 billion, with exports at USD 48.3 billion and imports at USD 61.6 billion, resulting in a trade deficit of USD 13.3 billion.",
        "• The 2002 trade figures show USD 98.3 billion in total trade, with exports of USD 44.5 billion and imports of USD 53.8 billion, leading to a trade deficit of USD 9.3 billion.",
        "• In 2001, total trade was USD 97 billion, with exports at USD 42.5 billion and imports at USD 54.5 billion, resulting in a trade deficit of USD 12 billion.",
        "• The 2000 trade data reports USD 103.9 billion in total trade, with exports of USD 43.1 billion and imports of USD 60.8 billion, leading to a trade deficit of USD 17.7 billion.",
        "• In 1999, total trade was USD 86.5 billion, with exports at USD 36.3 billion and imports at USD 50.2 billion, resulting in a trade deficit of USD 13.9 billion.",
        "• Prior to 1991, India maintained a policy of economic isolation, characterized by high import tariffs, export taxes, and quantitative restrictions to protect domestic industries and promote self-reliance.",
        "• Foreign direct investment (FDI) was heavily restricted until liberalization, with nearly 60% of new FDI requiring government approval in the industrial sector, limiting annual FDI to approximately USD 200 million between 1985 and 1991.",
        "• During this pre-liberalization period, a large portion of capital inflows consisted of foreign aid, commercial borrowing, and deposits from non-resident Indians, with exports stagnant for the first 15 years post-independence due to neglect of trade policy.",
        "• Imports during early industrialization primarily included machinery, raw materials, and consumer goods.",
        "• Post-liberalization, India experienced a sharp increase in international trade, with the contribution of goods and services to GDP rising from 16% in 1990–91 to 47% in 2009–10.",
        "• By 2015, foreign trade accounted for 48.8% of India’s GDP.",
        "• Globally, India accounts for approximately 1.44% of merchandise exports and 2.12% of merchandise imports, and for 3.34% of exports and 3.31% of imports in the commercial services sector.",
        "• Major trading partners include the European Union, China, the United States, and the United Arab Emirates.",
        "• In 2006–07, key export commodities included engineering goods, petroleum products, chemicals and pharmaceuticals, gems and jewellery, textiles and garments, agricultural products, iron ore, and other minerals.",
        "• Major import commodities in the same period included crude oil and related products, machinery, electronic goods, gold, and silver.",
        "• In November 2010, exports increased by 22.3% year-on-year to ₹851 billion (approximately US$23 billion in 2023), while imports rose by 7.5% to ₹1.25 trillion (approximately US$33 billion in 2023).",
        "• The trade deficit in November 2010 decreased from ₹469 billion (about US$14 billion in 2023) in 2009 to ₹401 billion (about US$11 billion in 2023).",
        "• India is a founding member of the General Agreement on Tariffs and Trade (GATT) and the World Trade Organization (WTO), actively participating in WTO general council meetings.",
        "• India has been a vocal advocate for the concerns of developing countries within WTO, notably opposing the inclusion of labor, environmental issues, and non-tariff barriers in trade policies.",
        "• India ranked 43rd in the global competitiveness index."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:47.060527",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 42
      },
      "source_file": "economy_of_india.json",
      "original_index": 41
    },
    {
      "section_number": "6.3",
      "section_name": "Balance of payments",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since India gained independence, its balance of payments on the current account has consistently been negative.",
        "• The economic liberalization initiated in the 1990s was precipitated by a balance-of-payments crisis, leading to a steady increase in exports.",
        "• By the fiscal year 2002–03, India's exports covered 80.3% of its imports, up from 66.2% in 1990–91.",
        "• The global economic slump and a slowdown in world trade caused India's export-to-import ratio to decline to 61.4% in 2008–09.",
        "• India's rising oil import bill is identified as the primary factor behind the large current account deficit, which reached $118.7 billion in 2008–09, representing 11.11% of GDP.",
        "• Between January and October 2010, India imported crude oil worth $82.1 billion.",
        "• India has maintained a trade deficit every year from 2002 to 2012, with the merchandise trade deficit amounting to US$189 billion in 2011–12.",
        "• In 2013, India’s trade with China resulted in the largest bilateral deficit, approximately $31 billion.",
        "• Post-liberalization, India's reliance on external assistance and concessional debt has decreased significantly; the debt service ratio dropped from 35.3% in 1990–91 to 4.4% in 2008–09.",
        "• External commercial borrowings (ECBs), which are commercial loans from non-resident lenders, are permitted by the Indian government to provide additional funding sources to Indian corporations.",
        "• The Reserve Bank of India (RBI) issues ECB policy guidelines under the Foreign Exchange Management Act of 1999, which are monitored and regulated by the Ministry of Finance.",
        "• India’s foreign exchange reserves have increased steadily from $5.8 billion in March 1991 to ₹38,832.21 billion (approximately US$540 billion) in July 2020.",
        "• In 2012, the United Kingdom announced the cessation of all financial aid to India, citing the growth and robustness of the Indian economy.",
        "• India’s current account deficit peaked in 2013, reaching an all-time high.",
        "• Historically, India has financed its current account deficit through overseas borrowings by companies, remittances from non-resident Indians, and portfolio inflows.",
        "• Between April 2016 and January 2017, RBI data indicated that India was funding its current account deficit through foreign direct investment (FDI) inflows for the first time since 1991.",
        "• The Economic Times highlighted this shift as a \"sign of rising confidence among long-term investors in Prime Minister Narendra Modi's ability to strengthen the country's economic foundation for sustained growth.\""
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:43:54.910754",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_india.json",
      "original_index": 42
    },
    {
      "section_number": "6.4",
      "section_name": "Foreign direct investment",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section on Foreign Direct Investment (FDI) in India requires updating as of October 2015, indicating that the information may be outdated or incomplete.",
        "• Between 2000 and 2010, the top five countries investing in India through FDI inflows were Mauritius, Singapore, the United States, the United Kingdom, and the Netherlands.",
        "• During this period, Mauritius was the leading source of FDI into India, contributing $50,164 million, accounting for 42.00% of total inflows.",
        "• Singapore ranked second with $11,275 million (9.00%), followed by the US with $8,914 million (7.00%), the UK with $6,158 million (5.00%), and the Netherlands with $4,968 million (4.00%).",
        "• India, as the third-largest economy globally in Purchasing Power Parity (PPP) terms, attracted significant FDI, with inflows reaching $36.5 billion in 2011, representing a 51.1% increase over the $24.15 billion received in 2010.",
        "• Key sectors attracting FDI in India include telecommunications, information technology, auto components, chemicals, apparel, pharmaceuticals, and jewelry.",
        "• Despite increased foreign investment, India’s FDI policies were initially restrictive, posing a barrier to investment growth.",
        "• Over time, India implemented several FDI reforms to liberalize the investment environment.",
        "• India possesses a large pool of skilled managerial and technical expertise, contributing to its attractiveness for foreign investors.",
        "• The country’s middle-class population is approximately 300 million, representing a substantial and growing consumer market.",
        "• FDI policy liberalization occurred in 2005, permitting up to 100% FDI stakes in various ventures.",
        "• Industrial policy reforms in India significantly reduced licensing requirements, eliminated restrictions on expansion, and facilitated access to foreign technology and investment.",
        "• The real estate sector experienced growth partly due to the liberalized FDI regime and a booming economy.",
        "• In March 2005, the Indian government amended rules to allow 100% FDI in the construction sector, including built-up infrastructure and projects such as housing, commercial premises, hospitals, educational institutions, recreational facilities, and city- and regional-level infrastructure.",
        "• Between 2012 and 2014, India extended FDI reforms to sectors including defense, telecommunications, oil, retail, and aviation.",
        "• From 2000 to 2010, India attracted a total of $178 billion in FDI inflows.",
        "• A significant portion of FDI from Mauritius was routed through the country due to tax advantages, including avoidance of double taxation via a tax treaty and Mauritius serving as a capital gains tax haven, effectively creating a zero-taxation channel for FDI.",
        "• In 2015, FDI accounted for 2.1% of India’s Gross Domestic Product (GDP).",
        "• In the last three years prior to the data, the Indian government eased 87 foreign investment rules across 21 sectors.",
        "• FDI inflows into India reached $60.1 billion between 2016 and 2017, reflecting the impact of liberalization policies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:01.949022",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_india.json",
      "original_index": 43
    },
    {
      "section_number": "6.4.1",
      "section_name": "Outflows",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since the year 2000, Indian companies have increasingly expanded their operations overseas, engaging in foreign direct investment (FDI) and creating employment opportunities outside India.",
        "• Between 2006 and 2010, the total FDI by Indian companies abroad amounted to 1.34 percent of India's Gross Domestic Product (GDP).",
        "• Indian firms have deployed FDI and established operational bases in major regions including the United States, Europe, and Africa.",
        "• The Tata Group, a prominent Indian conglomerate, is recognized as the largest manufacturer in the United Kingdom and also serves as the country's largest private-sector employer."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:04.226267",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_india.json",
      "original_index": 44
    },
    {
      "section_number": "6.5",
      "section_name": "Remittances",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2015, India received a total of US$68.91 billion in remittances from other countries, representing a significant inflow of foreign currency.",
        "• During the same year, Indian workers abroad remitted US$8.476 billion back to their home country, indicating active participation of Indian expatriates in the global remittance economy.",
        "• The United Arab Emirates (UAE), the United States (US), and Saudi Arabia were the leading sources of remittances to India in 2015, highlighting these countries as major hubs for Indian migrant workers.",
        "• Conversely, Bangladesh, Pakistan, and Nepal were the primary recipients of remittances sent from India, reflecting strong regional economic linkages and migration patterns.",
        "• Remittances to India in 2015 constituted approximately 3.32% of the country's Gross Domestic Product (GDP), underscoring the sector's importance to India's overall economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:07.812024",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_india.json",
      "original_index": 45
    },
    {
      "section_number": "6.6",
      "section_name": "Mergers and acquisitions",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between 1985 and 2018, a total of 20,846 mergers and acquisitions (M&A) deals were announced involving India, encompassing both inbound (into India) and outbound (out of India) transactions.",
        "• The cumulative value of these deals over this period amounts to approximately US$618 billion.",
        "• The year 2010 was the most active in terms of deal value, with transactions worth nearly US$60 billion.",
        "• The year 2007 recorded the highest number of deals, totaling 1,510 transactions.",
        "• The top 10 deals involving Indian companies are as follows:",
        "• Petrol Complex Pte Ltd, based in Singapore and operating in the Oil & Gas industry, acquired Essar Oil Ltd of India in a deal valued at US$12,907.25 million.",
        "• Vodafone Group Plc from the United Kingdom, in the Wireless industry, acquired Hutchison Essar Ltd of India for US$12,748.00 million.",
        "• Vodafone Group PLC (Vodafone Asts) from India, in the Wireless industry, acquired Idea Cellular Ltd-Mobile Business of India for US$11,627.32 million.",
        "• Bharti Airtel Ltd, an Indian Wireless company, acquired MTN Group Ltd of South Africa in a deal worth US$11,387.52 million.",
        "• Bharti Airtel Ltd also acquired Zain Africa BV of Nigeria in a transaction valued at US$10,700.00 million.",
        "• BP PLC from the United Kingdom, operating in Oil & Gas, acquired Reliance Industries Ltd-21 Oil of India for US$9,000.00 million.",
        "• MTN Group Ltd of South Africa acquired Bharti Airtel Ltd of India in a deal valued at US$8,775.09 million.",
        "• Shareholders in India, classified under Other Financials, acquired Reliance Industries Ltd-Telecom Business of India for US$8,063.01 million.",
        "• Oil & Natural Gas Corporation Ltd of India acquired Hindustan Petrochemical Corporation Ltd, involved in Petrochemicals, in a deal worth US$5,784.20 million.",
        "• Reliance Communications Ventures Ltd of India, in Telecommunications Services, acquired Reliance Infocomm Ltd of India for US$5,577.18 million."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:12.214223",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_india.json",
      "original_index": 46
    },
    {
      "section_number": "7",
      "section_name": "Currency",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Reserve Bank of India (RBI) has its headquarters in Mumbai, India, and is the central authority managing India's monetary system.",
        "• The Indian rupee (₹) is the sole legal tender in India and is also accepted as legal tender in Nepal and Bhutan, both of which peg their currencies to the Indian rupee.",
        "• The rupee was historically divided into 100 paise, a subdivision that no longer exists.",
        "• The highest-denomination banknote until September 30, 2023, was the ₹2,000 note; after that date, it was scrapped, making the ₹500 note the highest denomination in circulation.",
        "• The lowest-denomination coin currently in circulation is the ₹1 coin.",
        "• In 2017, India announced demonetisation, withdrawing ₹500 and ₹1000 notes and issuing new ₹500 notes.",
        "• The Indian monetary system is managed by the Reserve Bank of India, established on April 1, 1935, and nationalized in 1949.",
        "• The RBI functions as the monetary authority, regulator and supervisor of the monetary system, banker to the government, custodian of foreign exchange reserves, and issuer of currency.",
        "• The RBI is governed by a central board of directors, headed by a governor appointed by the Government of India.",
        "• The benchmark interest rates are set by the Monetary Policy Committee of the RBI.",
        "• The rupee was linked to the British pound from 1927 to 1946, and then to the US dollar until 1975 through a fixed exchange rate system.",
        "• In September 1975, the rupee was devalued, and the fixed par rate system was replaced with a basket of four major currencies: the British pound, US dollar, Japanese yen, and Deutsche Mark.",
        "• In 1991, following the collapse of the Soviet Union, India faced a major foreign exchange crisis, leading to a devaluation of approximately 19% of the rupee in two stages on July 1 and 2.",
        "• In 1992, India introduced the Liberalized Exchange Rate Mechanism (LERMS), requiring exporters to surrender 40% of foreign exchange earnings to the RBI at the RBI-determined rate, with the remaining 60% convertible at the market rate.",
        "• In 1994, the rupee became convertible on the current account, with some capital controls remaining.",
        "• Post-1991 devaluation and transition to current account convertibility in 1994, the rupee's value has been largely determined by market forces.",
        "• The rupee experienced relative stability during the decade 2000–2010.",
        "• In October 2022, the rupee reached an all-time low of 83.29 to the US dollar.",
        "• The annual average exchange rate of the Indian rupee per US dollar has fluctuated over the years, starting from 3.31 in 1947 and reaching 81.94 in 2023.",
        "• The annual average exchange rate of the Indian rupee per British pound (£) was 13.33 in 1947, rising to 100.95 in 2023.",
        "• Key exchange rate data points include:",
        "• 1947: 3.31 INR per US$, 13.33 INR per £",
        "• 1967: 7.50 INR per US$, 17.76 INR per £",
        "• 1975: 9.4058 INR per US$",
        "• 1985: 12.364 INR per US$",
        "• 1990: 17.4992 INR per US$, 31.07 INR per £",
        "• 1995: 32.4198 INR per US$, 51.17 INR per £",
        "• 2000: 44.9401 INR per US$, 67.99 INR per £",
        "• 2010: 45.7393 INR per US$, 70.65 INR per £",
        "• 2015: 64.05 INR per US$, 98.0101 INR per £",
        "• 2020: 72.97 INR per US$, 100.05 INR per £",
        "• 2023: 81.94 INR per US$, 100.95 INR per £"
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:18.767242",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 32
      },
      "source_file": "economy_of_india.json",
      "original_index": 47
    },
    {
      "section_number": "8",
      "section_name": "Income and consumption",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India's gross national income (GNI) per capita experienced significant growth from 2002 onwards, tripling from ₹19,040 in 2002–03 to ₹53,331 in 2010–11, with an average annual growth rate of 13.7% over these eight years.",
        "• The peak growth rate during this period was 15.6% in 2010–11.",
        "• Inflation-adjusted per-capita income growth slowed to 5.6% in 2010–11, down from 6.4% in the previous year.",
        "• In 2011, the average household income in India was $6,671 per household.",
        "• According to the 2011 census, India had approximately 330 million houses and 247 million households.",
        "• The household size in India has decreased in recent years; the 2011 census reported that 50% of households had four or fewer members, with an average household size of 4.8 members including surviving grandparents.",
        "• These households collectively produced a GDP of about $1.7 trillion.",
        "• Consumption patterns in India as of 2011 indicated that approximately 67% of households used firewood, crop residue, or cow-dung cakes for cooking.",
        "• About 53% of households lacked sanitation or drainage facilities on their premises.",
        "• Water supply within premises or within 100 meters (330 ft) was available to 83% of households in urban areas and within 500 meters (1,600 ft) in rural areas.",
        "• Access to electricity was available to 67% of households.",
        "• 63% of households had landline or mobile telephone service.",
        "• 43% of households owned a television.",
        "• 26% of households owned either a two- or four-wheel motor vehicle.",
        "• Compared to 2001, these income and consumption indicators showed moderate to significant improvements.",
        "• A 2010 report claimed that high-income households outnumbered low-income households in India.",
        "• According to the Atlas method (2016), countries are ranked by nominal GNI per capita, with India’s data included in this context.",
        "• New World Wealth reports that India’s total wealth increased from $3,165 billion in 2007 to $8,230 billion in 2017, representing a growth rate of 160%.",
        "• In 2018, India’s total wealth slightly decreased by 1%, from $8.23 trillion in 2017 to $8.148 trillion, making it the sixth wealthiest nation globally.",
        "• India has 20,730 multimillionaires, ranking 7th in the world, and 118 billionaires, ranking 3rd globally.",
        "• The country is home to approximately 327,100 high net-worth individuals (HNWIs), ranking 9th worldwide.",
        "• Mumbai is the wealthiest Indian city, with a total net worth of $941 billion in 2018, making it the 12th wealthiest city globally; it hosts 28 billionaires, ranked ninth worldwide.",
        "• As of December 2016, other wealthy Indian cities included Delhi ($450 billion), Bengaluru ($320 billion), Hyderabad ($310 billion), Kolkata ($290 billion), Chennai ($200 billion), and Gurugram ($110 billion).",
        "• The _Global Wealth Migration Review 2019_ by New World Wealth reported that in 2018, approximately 5,000 HNWIs emigrated from India, constituting about 2% of all HNWIs in the country.",
        "• Top destination countries for emigrating HNWIs included Australia, Canada, and the United States.",
        "• The report projected that India’s private wealth would grow by approximately 180%, reaching $22,814 billion by 2028."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:33.718925",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 26
      },
      "source_file": "economy_of_india.json",
      "original_index": 48
    },
    {
      "section_number": "8.1",
      "section_name": "Poverty",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In May 2014, the World Bank reviewed and proposed revisions to its poverty calculation methodology from 2005, adopting a purchasing-power-parity basis for measuring poverty.",
        "• According to the revised methodology, the world had 872.3 million people living below the new poverty line, with 179.6 million residing in India.",
        "• India accounted for 17.5% of the total global population and had a 20.6% share of the world's poorest individuals in 2013.",
        "• A survey conducted during 2005–2006 estimated that India had approximately 61 million children under the age of 5 who were chronically malnourished.",
        "• The 2011 UNICEF report indicated that between 1990 and 2010, India achieved a 45% reduction in mortality rates among children under 5 years old, and ranked 46th out of 188 countries on this metric.",
        "• Since the early 1960s, successive Indian governments have implemented various schemes aimed at alleviating poverty through central planning, achieving partial success.",
        "• In 2005, India enacted the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA), which guarantees 100 days of minimum wage employment to every rural household across all districts.",
        "• By 2011, MGNREGA faced widespread criticism and controversy due to issues such as corruption among officials, deficit financing used as the funding source, poor quality infrastructure development, and unintended destructive effects.",
        "• Some studies suggest that MGNREGA has contributed to reducing rural poverty in certain cases, while others indicate that India's economic growth has been a key driver of sustainable employment and poverty reduction.",
        "• Despite progress, a significant portion of India's population remains in poverty.",
        "• Between 2006 and 2016, India lifted 271 million people out of poverty, recording the fastest reductions in the multidimensional poverty index during this period, with notable improvements in assets, cooking fuel, sanitation, and nutrition.",
        "• In the 2019 Global Hunger Index, India ranked 102nd out of 117 countries, with a score of 30.3, categorized as 'serious' in severity.",
        "• In 2024, India ranked 105th out of 127 countries on the Global Hunger Index, with a score of 27.3, indicating an improvement in its hunger situation."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:38.941728",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_india.json",
      "original_index": 49
    },
    {
      "section_number": "9",
      "section_name": "Employment",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India experienced significant fluctuations in extreme poverty rates from 1977 to 2021, reflecting ongoing economic and social challenges.",
        "• The agricultural and allied sectors constituted approximately 52% of India's total workforce in the year 2009–10, highlighting the sector's dominance in employment.",
        "• Over time, employment in agriculture has decreased as a percentage of total employment, indicating a shift towards other sectors.",
        "• The services sector, which includes construction and infrastructure, experienced steady growth and accounted for 20.3% of employment in 2012–13.",
        "• Only about 7% of India's total workforce is employed in the organised sector, with two-thirds of these workers employed in the government-controlled public sector.",
        "• Approximately 51.2% of the Indian workforce is self-employed, demonstrating a significant proportion of informal and independent employment.",
        "• Despite having some of the longest working hours globally, India ranks among the lowest in workforce productivity levels worldwide.",
        "• A survey conducted in 2005–06 revealed a gender gap in employment and salaries, indicating disparities between men and women in the labor market.",
        "• In rural areas, both men and women are primarily self-employed, with most engaged in agriculture-related activities.",
        "• In urban areas, salaried employment emerged as the largest source of employment for both men and women in 2006, reflecting urban economic development."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:42.061397",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_india.json",
      "original_index": 50
    },
    {
      "section_number": "9.1",
      "section_name": "Unemployment",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Unemployment in India is characterized by chronic (disguised) unemployment, indicating persistent underemployment and employment that does not utilize workers' full potential.",
        "• The Indian government has implemented various schemes aimed at eradicating both poverty and unemployment, especially in recent decades, which have led millions of poor and unskilled individuals to migrate to urban areas in search of livelihoods.",
        "• These government initiatives attempt to address unemployment through multiple strategies, including providing financial assistance for starting businesses, skill development programs, establishing public sector enterprises, and implementing reservations in government jobs and educational institutions.",
        "• A significant decline in organized employment has been observed, primarily due to the decreased role of the public sector following economic liberalization policies, which has heightened the focus on improving education and skill development.",
        "• The reduction in public sector employment has created political pressure for further economic and labor reforms aimed at enhancing employment opportunities.",
        "• India’s labor regulations are considered heavy and complex, even by standards of other developing countries, which has been criticized for hindering employment growth.",
        "• Analysts have recommended that the government abolish or modify existing labor laws to create a more conducive environment for employment generation and economic flexibility.",
        "• The 11th Five-Year Plan emphasized the importance of creating a favorable environment for employment by reducing bureaucratic hurdles, including the number of permissions and clearances required for business operations.",
        "• Inequalities and deficiencies within the education system are identified as major obstacles to employment, as they prevent the equitable distribution of employment benefits across different sectors of Indian society."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:46.724468",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_india.json",
      "original_index": 51
    },
    {
      "section_number": "9.2",
      "section_name": "Child labour",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Child labour in India is a complex issue primarily rooted in poverty, making it a persistent social and economic challenge.",
        "• Since the 1990s, the Indian government has implemented various programs aimed at eliminating child labour, including establishing schools and launching initiatives such as free school lunch programs.",
        "• The government has also created special investigation cells to monitor and address child labour practices.",
        "• According to author Sonalde Desai, recent studies on child labour in India indicate that while some industries employ children, these instances are limited and not widespread.",
        "• Overall, the number of Indian children engaged in employment is relatively low, with child labour below the age of 10 now considered rare.",
        "• Surveys reveal that only about 2% of children aged 10–14 are employed for wages.",
        "• An additional 9% of children in the 10–14 age group work within their homes or on rural farms, assisting their parents during periods of high agricultural activity such as sowing and harvesting."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:49.283307",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_india.json",
      "original_index": 52
    },
    {
      "section_number": "9.3",
      "section_name": "Diaspora remittance",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• India has the largest diaspora in the world, with an estimated 32 million people according to the Ministry of External Affairs (India).",
        "• A significant portion of these Indian expatriates work abroad and remit funds back to their families in India.",
        "• The Middle East region is the primary source of employment for Indian expatriates.",
        "• The crude oil production and infrastructure sector in Saudi Arabia employs over 2 million Indian expatriates.",
        "• Cities such as Dubai and Abu Dhabi in the United Arab Emirates have employed an additional 2 million Indians during the recent construction boom.",
        "• During the fiscal year 2009–10, remittances from Indian migrants overseas amounted to ₹2.5 trillion.",
        "• In 2023, this remittance value is equivalent to ₹5.6 trillion or approximately US$66 billion, making it the highest in the world.",
        "• Despite the large volume of remittances, the share of Indian diaspora remittances in foreign direct investment (FDI) remains low, at around 1%."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:51.975761",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 53
    },
    {
      "section_number": "9.4",
      "section_name": "Trade unions",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The trade union movement in India is generally divided along political lines, reflecting diverse ideological affiliations.",
        "• According to provisional statistics from the Ministry of Labour, the total membership of trade unions in India was approximately 24,601,589 in the year 2002.",
        "• As of 2008, there are 12 Central Trade Union Organisations (CTUO) recognized by the Ministry of Labour, indicating a structured and official recognition of major trade unions.",
        "• The formation of trade unions in India was a significant development, leading to a substantial push for the enactment of more regulatory laws that increased workers’ rights and power.",
        "• The All India Trade Union Congress (AITUC) is the oldest trade union in India, established as a left-supported organization, and holds historical significance in the Indian labor movement.",
        "• The Self Employed Women's Association (SEWA) is a prominent trade union with nearly 2,000,000 members, dedicated to protecting the rights of Indian women working in the informal economy.",
        "• SEWA not only advocates for workers’ rights but also engages in education, mobilization, financing, and enhancing the trades of its members, thereby empowering women in the informal sector.",
        "• Numerous other trade organizations exist in India, each formed around different political groups, allowing individuals with various political views to join and participate in union activities."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:44:58.808336",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 54
    },
    {
      "section_number": "9.5",
      "section_name": "Corruption",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Corruption Perceptions Index (CPI) in 2023 ranks countries based on perceived levels of public sector corruption, with scores ranging from 100 (least corrupt) to 0 (most corrupt); higher scores indicate lower corruption levels, and the map compares India’s score to other countries.",
        "• The CPI categories are segmented as follows: 100–90, 89–80, 79–70, 69–60, 59–50, 49–40, 39–30, 29–20, 19–10, 9–0, with some countries having no data available.",
        "• Corruption has historically been a pervasive issue in India, with a 2005 study by Transparency International (TI) revealing that over 50% of those surveyed had paid bribes or influenced officials to get public office work done in the previous year.",
        "• A follow-up TI study in 2008 indicated that the bribery rate had decreased to 40%.",
        "• In 2011, TI ranked India at 95th position out of 183 countries in perceived public sector corruption levels.",
        "• By 2016, India’s corruption perception improved, and its ranking rose to 79th place, indicating a reduction in corruption.",
        "• In 1996, institutionalized corruption and inefficiency were attributed to red tape, bureaucracy, and the Licence Raj system.",
        "• More recent analyses identify causes of corruption as excessive regulations and approval requirements, mandated spending programs, monopolies held by government-controlled entities over certain goods and services, bureaucratic discretion, and opaque laws and processes.",
        "• Measures such as the computerization of government services, the establishment of central and state vigilance commissions, and the enactment of the 2005 Right to Information Act (RTI) have significantly reduced corruption and enhanced grievance redressal mechanisms.",
        "• The RTI Act mandates government officials to provide requested information to citizens or face punitive measures, thereby increasing transparency.",
        "• In 2011, the Indian government acknowledged that most public spending fails to reach intended beneficiaries due to an inefficient bureaucracy that consumes a large portion of budgets.",
        "• India’s public sector suffers from high absence rates, with one study reporting that 25% of public sector teachers and 40% of government-owned medical workers could not be located at their workplaces.",
        "• Indian scientists face issues related to transparency, meritocracy, and bureaucratic oversight, prompting calls for reforms in agencies overseeing science and technology.",
        "• India maintains an underground economy, with a 2006 report claiming it topped the global list for black money, estimating nearly $1,456 billion stashed in Swiss banks—equivalent to 13 times the country’s total external debt.",
        "• The Swiss Banking Association denied these allegations, with James Nason, Head of International Communications, stating that the figures were fabricated and that no such report was published by Swiss banks.",
        "• The Indian government, under Prime Minister Narendra Modi, implemented demonetization on 8 November 2016, invalidating all 500 and 1000 rupee notes and replacing them with new 500 and 2000 rupee notes, aiming to curb black money.",
        "• The demonetization move faced criticism for being ineffective according to economists and for adversely impacting the poorest populations.",
        "• The demonetization, combined with the introduction of the Goods and Services Tax (GST), is believed to have contributed to an economic slowdown in India."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:45:06.897923",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_india.json",
      "original_index": 55
    },
    {
      "section_number": "9.6",
      "section_name": "Education",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The University of Calcutta, established in 1857, was the first multidisciplinary and secular Western-style institution in Asia, marking a significant milestone in higher education development on the continent.",
        "• India has made notable progress in increasing primary education attendance rates and expanding literacy, now reaching approximately three-fourths (around 75%) of the population.",
        "• The literacy rate in India increased from 52.2% in 1991 to 74.04% in 2011, demonstrating substantial growth over two decades.",
        "• The right to education at the elementary level was enshrined as a fundamental right under the Eighty-Sixth Amendment of 2002, emphasizing the government's commitment to universal access to elementary education.",
        "• Legislation has been enacted to promote free education for all children, aiming to eliminate financial barriers to schooling.",
        "• Despite these advancements, India's literacy rate of 74% remains below the global average, indicating room for further improvement.",
        "• The country continues to face challenges such as a high drop-out rate among students, which hampers overall educational attainment.",
        "• Literacy rates and access to educational opportunities in India vary significantly based on region, gender, urban versus rural settings, and among different social groups, highlighting disparities in educational development."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:45:13.370340",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 56
    },
    {
      "section_number": "9.7",
      "section_name": "Economic disparities",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Economic disparities among Indian states and union territories are significant when measured by GDP per capita, PPP basis, and nominal GDP per capita in 2011.",
        "• Poverty rates in India's poorest states are three to four times higher than those in more developed states, highlighting stark regional inequalities.",
        "• In 2011, India's average annual per capita income was $1,410, categorizing it among the poorest middle-income countries globally.",
        "• Uttar Pradesh, India's most populous state, had a per capita income of only $436 in 2011, despite having a population larger than Brazil.",
        "• Bihar, one of India's poorest states, had a per capita income of merely $294 in 2011.",
        "• According to the World Bank's India Country Overview 2013, these figures exemplify the wide income disparity across states.",
        "• A critical issue in India's economy is the sharp and increasing regional variation in poverty levels, infrastructure availability, and socio-economic development.",
        "• Six low-income states—Assam, Chhattisgarh, Nagaland, Madhya Pradesh, Odisha, and Uttar Pradesh—are home to over one-third of India's total population.",
        "• There are severe disparities among states concerning income, literacy rates, life expectancy, and living conditions.",
        "• By 2030, Maharashtra, Tamil Nadu, Gujarat, and Karnataka are projected to contribute nearly 50% of India's GDP, despite collectively comprising only a portion of the population.",
        "• The five South Indian states are expected to account for 35% of India's GDP by 2030, while their combined population is approximately 20% of the national total.",
        "• During the five-year plans, especially before liberalization, efforts to reduce regional disparities included promoting industrial development in interior regions and distributing industries across states.",
        "• These measures largely failed to produce significant reductions in disparities, instead increasing inefficiency and hindering industrial growth.",
        "• More advanced states benefited more from economic liberalization due to better infrastructure and a skilled, educated workforce, attracting manufacturing and service sectors.",
        "• Less developed states attempted to reduce disparities by offering tax holidays, cheap land, and focusing on sectors like tourism, which can grow faster than traditional industries.",
        "• India's income Gini coefficient is 33.9, as reported by the United Nations Development Programme (UNDP), indicating a relatively more uniform income distribution compared to East Asia, Latin America, and Africa.",
        "• The 2019 Global Wealth Migration Review by New World Wealth estimated that 48% of India's total wealth is held by high-net-worth individuals.",
        "• A 2021 Pew Research Center report states India has approximately 1.2 billion lower-income individuals, 66 million middle-income, 16 million upper-middle-income, and 2 million high-income individuals.",
        "• According to The Economist (2017), about 78 million Indians are classified as middle class, defined as earning more than $10 per day, based on standards from India's National Council of Applied Economic Research.",
        "• There is ongoing debate regarding whether India's economic growth has been pro-poor or anti-poor; however, studies generally suggest that economic growth has been pro-poor and has contributed to poverty reduction."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:45:26.251264",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_india.json",
      "original_index": 57
    },
    {
      "section_number": "9.8",
      "section_name": "Climate change",
      "chapter_name": "Economy of India",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Several Indian banks, including State Bank of India, Axis Bank, ICICI Bank, and HDFC Bank, have taken the lead in funding green projects to promote sustainable development and environmental conservation.",
        "• The Reserve Bank of India (RBI) is developing norms requiring lenders to disclose their actions related to climate risk, emphasizing transparency and accountability in financial institutions.",
        "• In a 2022 report, the RBI stated that addressing climate change in India would necessitate \"intensive capital mobilisation,\" with an estimated requirement of $17.77 trillion to meet climate-related financial needs.",
        "• The RBI recommends that regulated financial entities adopt the Task Force on Climate-related Financial Disclosures (TCFD) framework, recognized as the most prominent global standard for climate-related financial disclosures, at least during the initial implementation phase.",
        "• India hosts approximately 75 percent of the world's wild tiger population, making it a critical region for tiger conservation efforts.",
        "• The big cats, including lion, tiger, leopard, cheetah, snow leopard, jaguar, and puma, were nearing extinction due to threats such as hunting and encroachment, with their numbers declining to around 20 individuals in some cases.",
        "• Conservation efforts for lions in India began prior to independence; however, a significant initiative was launched in 1965 when the Indian Forest Service established a dedicated conservation programme.",
        "• Researchers attribute the unprecedented migration of tigers within India to multiple factors, notably rising temperatures caused by climate change, which are rendering the lower foothills less hospitable for these species."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T22:45:30.346512",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_india.json",
      "original_index": 58
    }
  ]
}