{
  "extraction_info": {
    "source_file": "economy_of_nepal.json",
    "extraction_timestamp": "2025-08-02T17:13:28.479224",
    "total_sections_in_source": 6,
    "extracted_sections_count": 6,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Nepal is classified as developing and is predominantly reliant on agriculture and remittances from foreign workers.",
        "• Until 1951, Nepal was an isolated pre-industrial society lacking schools, hospitals, roads, telecommunications, electric power, industry, and civil service, entering the modern era with minimal infrastructure.",
        "• Since the 1950s, Nepal has made progress toward sustainable economic growth, aided by economic liberalization that improved living standards compared to the past.",
        "• Major obstacles to higher economic development in Nepal include frequent changes in political leadership and pervasive corruption.",
        "• Nepal has implemented a series of five-year plans for economic development, completing its ninth plan in 2002.",
        "• The Nepalese currency has been made convertible, and 17 state enterprises have undergone privatization.",
        "• Foreign aid constitutes more than half of Nepal’s development budget, highlighting the country’s dependence on external financial assistance.",
        "• Government priorities historically focused on developing transportation and communication infrastructure, agriculture, and industry, with increased emphasis on improved government administration and rural development since 1975.",
        "• Nepal’s economy is heavily reliant on imports of basic materials and foreign markets for its forest and agricultural products.",
        "• The country possesses significant potential for sustainable energy resources, which could enhance energy security, economic growth, and environmental sustainability.",
        "• Agriculture remains the principal economic activity, employing approximately 65% of the population and contributing 31.7% to the GDP.",
        "• Only about 20% of Nepal’s total land area is cultivable, while 40.7% is forested, including shrubs, pastureland, and forest; the remainder is predominantly mountainous terrain.",
        "• Main food crops include fruits and vegetables such as apples, pears, tomatoes, salad greens, peaches, nectarines, and potatoes, alongside staple grains like rice and wheat.",
        "• The lowland Terai region produces an agricultural surplus that partially supplies the food-deficient hill areas.",
        "• Remittances from foreign workers contribute 9.1% to Nepal’s GDP, underscoring their economic significance.",
        "• Despite some progress, economic development in social services and infrastructure has not advanced dramatically.",
        "• Nepal is developing a countrywide primary education system, with Tribhuvan University operating multiple campuses.",
        "• Malaria, once prevalent in the fertile but previously uninhabitable Terai region, has been controlled through ongoing eradication efforts.",
        "• Kathmandu is connected to India and nearby hill regions by road and an expanding highway network, although infrastructure challenges persist.",
        "• On 17 February 2008, Kathmandu faced severe fuel and supply shortages due to a crippling general strike in southern Nepal.",
        "• Major towns in Nepal are linked to the capital by telephone and domestic air services, facilitating communication and transport.",
        "• Export-oriented industries such as carpet manufacturing and garment production, including pashmina products, have grown rapidly and together account for about 70% of Nepal’s merchandise exports.",
        "• Nepal’s Cost of Living Index is comparatively lower than many countries, though it is not the lowest globally.",
        "• The quality of life in Nepal has declined significantly in recent years.",
        "• In the 2021 Global Hunger Index, Nepal ranked 76th out of 116 countries with sufficient data, scoring 19.1, indicating a moderate level of hunger.",
        "• Nepal has the poorest road infrastructure in Asia, presenting a major challenge for economic development and connectivity.",
        "• World Economics estimated Nepal’s GDP in 2024 at $243 billion in Purchasing Power Parity (PPP) terms, with an initial estimate of $255 billion for 2025.",
        "• These GDP figures are approximately 65% higher than the official estimates published by the World Bank, indicating discrepancies in economic measurement."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:02:29.212564",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 28
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Foreign investments and taxation",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• A significant volume of small foreign investments in Nepal originates from Non-Resident Nepalis, who actively invest across various sectors within the country.",
        "• Nepal possesses substantial potential for hydroelectric power generation, attracting interest from numerous foreign companies eager to invest in this sector.",
        "• Despite the interest from foreign investors, political instability in Nepal has hindered the progress and realization of many foreign investment projects.",
        "• Since the year 2000, Nepal has entered into agreements for the avoidance of double taxation with 10 countries, all of which utilize the credit method, as reported by the Public Service Reform Division (PSRD).",
        "• Additionally, Nepal has established investment protection agreements with 5 countries since 1983, also documented by the PSRD, to safeguard foreign investments.",
        "• In 2014, Nepal implemented restrictions on foreign aid by setting minimum thresholds for foreign grants, soft loans, and commercial loans received from its development partners, aiming to regulate the inflow of external financial assistance."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:02:32.796120",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Imports and exports",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since 2000, Nepal's merchandise trade balance has shown improvement, primarily due to the growth of the carpet and garment industries.",
        "• In the fiscal year 2000–2001, Nepal's exports increased by 14%, outpacing the 4.5% growth in imports, which contributed to a 4% reduction in the trade deficit from the previous year, lowering it to $749 million.",
        "• The European Union has recently become the largest purchaser of Nepalese ready-made garments, as well as fruits and vegetables including apples, pears, tomatoes, various salads, peaches, nectarines, potatoes, and rice.",
        "• Exports to the European Union constituted 46.13% of Nepal’s total garment exports during this period.",
        "• Nepal’s economic growth is strongly influenced by the annual monsoon rains, which affect agricultural productivity and overall economic performance.",
        "• Between 1996 and 1999, Nepal’s real GDP growth averaged below 4%, but the growth rate recovered to 6% in 1999 before slightly declining to 5.5% in 2001.",
        "• Strong export performance, bolstered by earnings from tourism and external aid, has contributed to improvements in Nepal’s overall balance of payments and an increase in international reserves.",
        "• Nepal receives substantial external assistance from countries including the United Kingdom, the United States, Japan, Germany, and the Nordic countries.",
        "• Multilateral organizations such as the World Bank, the Asian Development Bank, and the United Nations Development Programme also provide significant financial and technical assistance to Nepal.",
        "• In June 1998, Nepal submitted its memorandum on a foreign trade regime to the World Trade Organization (WTO) and commenced direct negotiations for WTO accession in May 2000."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:02:40.373361",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Resources",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Tourism plays a vital role in Nepal's economy, exemplified by activities such as trekking in the Annapurna region in western Nepal.",
        "• Progress has been made in exploiting Nepal's natural resources, tourism sector, and hydroelectricity generation, leveraging the presence of eight of the world's ten highest mountain peaks, including Mount Everest at 8,848.86 meters.",
        "• In the early 1990s, Nepal planned one large public sector hydroelectric project alongside several private projects, some of which have been completed.",
        "• The most significant private sector-financed hydroelectric projects currently operational are the Khimti Khola Hydroelectric Project with a capacity of 60 MW and the Bhote Koshi Project with 36 MW capacity.",
        "• The hydroelectric sector development is ongoing and dependent on cooperation and support from China, India, and Japan for further progress.",
        "• The Upper Tamakoshi Hydropower Plant is the largest hydropower facility in Nepal.",
        "• The Kulekhani Dam, also known as \"Indra Sarobar\" or \"Kulekhani Reservoir,\" combined with other facilities, produces a total of 106 MW and is located in Makwanpur district.",
        "• The Middle Marsyangdi Hydropower Station produces 70 MW of electricity.",
        "• Nepal possesses significant hydropower potential and plans to export electricity across South Asia.",
        "• The country has an estimated 83,000 MW of theoretical hydroelectric potential and 42,133 MW of technically and financially viable potential.",
        "• Despite this potential, Nepal’s total installed hydroelectric capacity currently stands at approximately 2,500 MW and is gradually increasing.",
        "• The environmental impact of Nepal’s hydroelectric projects has been limited due to the predominance of \"run-of-the-river\" projects, with only one storage project undertaken to date.",
        "• The largest hydroelectric plant under consideration is the West Seti Dam, a 750 MW storage project intended primarily for export, to be developed by the private sector.",
        "• Negotiations with India regarding a power purchase agreement for the West Seti Dam have been ongoing for several years, with pricing and financing issues yet to be resolved.",
        "• Electricity demand in Nepal is increasing at an annual rate of 8-10%, and agreements with India are expected to help meet this growing demand.",
        "• As of June 2022, Nepal exports surplus electricity of up to 364 MWp to India.",
        "• Population pressure is increasing on Nepal’s natural resources, particularly in the middle hill areas such as the Kathmandu Valley, where overpopulation is straining the \"carrying capacity.\"",
        "• This population pressure has led to depletion of forest cover used for crops, fuel, and fodder, contributing to soil erosion and increased flooding.",
        "• Although Nepal’s steep mountainous terrain complicates resource exploitation, mineral surveys have identified small deposits of limestone, magnesite, zinc, copper, iron, mica, lead, and cobalt.",
        "• Coal mining is active in Nepal, with a production volume of 11,522 tonnes recorded in 2018.",
        "• The development of hydroelectric power projects has caused tensions with local indigenous groups, who have been recently empowered by Nepal’s ratification of the International Labour Organization (ILO) Convention 169."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:02:54.221231",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 21
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The gross domestic product (GDP) of Nepal at market prices, estimated by the International Monetary Fund and EconStats, increased from 3,870 million Nepali Rupees in 1960 to 379,488 million Nepali Rupees in 2000, showing substantial economic growth over four decades.",
        "• In 1960, Nepal's GDP was 3,870 million Nepali Rupees, rising to 5,602 million in 1965, 8,768 million in 1970, 16,571 million in 1975, 23,350 million in 1980, 46,586 million in 1985, 103,415 million in 1990, 219,174 million in 1995, and reaching 379,488 million in 2000.",
        "• From 1980 to 2024, Nepal's GDP in billion US dollars (PPP) grew from 7.68 in 1980 to an estimated 169.12 in 2024, reflecting significant economic expansion over this period.",
        "• GDP per capita in Nepal increased from US$491 (PPP) in 1980 to an estimated US$5,348 (PPP) in 2024, indicating improved average income levels.",
        "• Nepal's nominal GDP in billion US dollars rose from US$2.26 in 1980 to an estimated US$43.67 in 2024, demonstrating growth in the economy's market value at current prices.",
        "• Real GDP growth rates fluctuated over the years, with a negative growth of −2.3% in 1980, peaking at 9.0% in 2017, and experiencing a decline of −2.4% in 2020, likely due to global or national economic disruptions, before recovering to an estimated 3.1% in 2024.",
        "• Inflation rates in Nepal showed variability, starting at 9.8% in 1980, decreasing to a low of 3.4% in 2000, peaking at 12.6% in 2009, and stabilizing around 5.6% in 2024.",
        "• Government debt as a percentage of GDP was not available (n/a) before 2000, then recorded at 50.8% in 2000, decreased to a low of 25.0% in 2016 and 2017, and rose again to an estimated 49.7% in 2024, indicating fluctuations in public debt relative to economic output.",
        "• Key years of economic indicators include:",
        "• 1980: GDP (PPP) 7.68 billion US$, GDP per capita 491 US$, nominal GDP 2.26 billion US$, real GDP growth −2.3%, inflation 9.8%, government debt n/a.",
        "• 1990: GDP (PPP) 18.37 billion US$, GDP per capita 936 US$, nominal GDP 4.44 billion US$, real GDP growth 4.6%, inflation 8.9%, government debt n/a.",
        "• 2000: GDP (PPP) 36.70 billion US$, GDP per capita 1,494 US$, nominal GDP 6.54 billion US$, real GDP growth 6.1%, inflation 3.4%, government debt 50.8%.",
        "• 2010: GDP (PPP) 66.94 billion US$, GDP per capita 2,465 US$, nominal GDP 18.25 billion US$, real GDP growth 4.8%, inflation 9.6%, government debt 35.4%.",
        "• 2020: GDP (PPP) 122.69 billion US$, GDP per capita 4,180 US$, nominal GDP 33.43 billion US$, real GDP growth −2.4%, inflation 6.2%, government debt 43.3%.",
        "• 2024 (estimated): GDP (PPP) 169.12 billion US$, GDP per capita 5,348 US$, nominal GDP 43.67 billion US$, real GDP growth 3.1%, inflation 5.6%, government debt 49.7%.",
        "• The data reflects Nepal's transition from a low-income to a lower-middle-income economy with steady growth in GDP and GDP per capita, alongside fluctuations in inflation and government debt levels over more than four decades."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:03:11.911539",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Statistics",
      "chapter_name": "Economy of Nepal",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Nepal's GDP based on purchasing power parity was estimated at $84.37 billion in 2018, though this figure is marked as dubious and requires further verification.",
        "• The real GDP growth rate of Nepal was recorded at 21.77% in 2017.",
        "• GDP per capita in terms of purchasing power parity (current international dollars) was approximately $2,700 in 2017.",
        "• The composition of Nepal’s GDP by sector in 2017 was as follows: agriculture contributed 17%, industry 13.5%, and services 60.5%, with tourism accounting for 9%.",
        "• The proportion of the population living below the poverty line was 25.6% during the fiscal year 2017/2018.",
        "• Household income or consumption distribution from 1995–96 showed the lowest 10% of the population held 3.2% of income, while the highest 10% held 29.8%.",
        "• The inflation rate based on consumer prices was 4.5% in 2017.",
        "• Nepal’s labor force was estimated at 4 million people in 2016, though this figure lacks citation.",
        "• Labor force distribution by occupation in 2014 was 19% in agriculture, 69% in services, and 12% in industry.",
        "• The unemployment rate stood at 1.47% in 2017.",
        "• Nepal’s government budget for 2017 estimated revenues at $5.954 billion and expenditures at $5.974 billion, with capital expenditures unspecified.",
        "• Key industries in Nepal include tourism, carpet manufacturing, textiles, small-scale rice, jute, sugar, and oilseed mills, cigarette production, cement, and brick manufacturing.",
        "• Industrial production growth rate was 10.9% in 2017.",
        "• Electricity production in Nepal totaled 41,083 GWh in 2017.",
        "• Electricity production by source in 2001 was predominantly hydroelectric at 91.5%, fossil fuels at 7.5%, nuclear at 0.3%, and other sources at 0.7%.",
        "• Available energy in 2017 was 6,957.73 GWh; Nepal Electricity Authority (NEA) hydroelectric production was 2,290.78 GWh in 2014, and NEA thermal production was 9.56 GWh in 2014.",
        "• Total electricity purchases in 2014 amounted to 2,331.17 GWh; purchases from India were 2,175.04 GWh in 2017, and Nepal’s Independent Power Producers (IPP) generated 1,258.94 GWh in 2014.",
        "• Electricity consumption was 4,776.53 GWh in 2017.",
        "• Electricity exports were 856 GWh in 2001, while imports were 12 GWh in the same year.",
        "• Nepal produced no oil in 2001, with oil production recorded at 0 barrels per day.",
        "• Oil consumption was 1,600 barrels per day (250 m3/d) in 2001.",
        "• Major agricultural products include fruits and vegetables such as apples, pears, tomatoes, peaches, nectarines, potatoes, as well as rice, maize, wheat, sugarcane, root crops, milk, and buffalo meat.",
        "• Exports were valued at $1.29 billion f.o.b. in 2020, excluding unrecorded border trade with India.",
        "• Principal export commodities include carpets, clothing, leather goods, jute goods, and grain.",
        "• Major export partners in 2016 were India (56.6%), the United States (11.5%), and Turkey (9.2%).",
        "• Imports were valued at $1.6 billion f.o.b. in 2021.",
        "• Key import commodities include gold, machinery and equipment, petroleum products, electrical goods, and medicine.",
        "• Major import partners in 2016 were India (70.1%), China (10.3%), the United Arab Emirates (2.6%), Singapore (2.1%), and Saudi Arabia (1.2%).",
        "• Nepal’s external debt was estimated at $9.1 billion in 2022.",
        "• The country received approximately $2 billion in economic aid during the fiscal year 2019/20.",
        "• The official currency of Nepal is the Nepali rupee (NPR), subdivided into 100 paisa.",
        "• Nepal’s fiscal year runs from 16 July to 15 July of the following year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:03:26.351757",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 32
      },
      "source_file": "economy_of_nepal.json",
      "original_index": 5
    }
  ]
}