{
  "extraction_info": {
    "source_file": "economy_of_ivory_coast.json",
    "extraction_timestamp": "2025-08-02T17:13:28.143166",
    "total_sections_in_source": 11,
    "extracted_sections_count": 11,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Ivory Coast is currently stable and experiencing growth following a period of political instability in recent decades.",
        "• The Ivorian economy is predominantly market-based and relies heavily on the agricultural sector, with nearly 70% of the population engaged in some form of agricultural activity.",
        "• During the 1960s, the economy grew by 82%, reaching a peak growth rate of 360% in the 1970s; however, this rapid expansion proved unsustainable.",
        "• The economy contracted by 28% in the 1980s and a further 22% in the 1990s, leading to a decline in living standards and a decrease in gross national product (GNP) per capita.",
        "• The GNP per capita was approximately US$727 in 1996, which was significantly higher two decades earlier.",
        "• Real GDP growth is projected to average 6.5% during 2024–25.",
        "• The Ivorian economy began a recovery in 1994 after several years of poor performance, driven by several key factors:",
        "• Devaluation of the CFA franc, which improved export competitiveness.",
        "• Increased prices for cocoa and coffee, two major traditional exports.",
        "• Growth in non-traditional primary exports such as pineapples and rubber.",
        "• Limited liberalization of trade and banking sectors.",
        "• Discoveries of offshore oil and gas reserves.",
        "• Generous external financing and debt rescheduling provided by multilateral lenders and France.",
        "• On 12 January 1994, the CFA franc was devalued by 50%, which caused a temporary spike in inflation to 26% in 1994.",
        "• The inflation rate declined sharply from 1996 to 1999.",
        "• Government adherence to reforms mandated by international donors contributed to an increase in annual growth to 5% during 1996–99.",
        "• A significant portion of the population remains dependent on smallholder cash crop production for their livelihood."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:04.073311",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "History",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Wikipedia section titled \"Economy of Ivory Coast\" under the subsection \"History\" is currently empty and contains no substantive content.",
        "• The absence of information is noted as of September 2021, indicating that no historical economic details have been contributed to this section up to that date.",
        "• The placeholder suggests an opportunity for future contributions to document the historical economic development of Ivory Coast."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:06.224940",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Infrastructure",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Ivory Coast possesses an advanced infrastructure relative to developing-country standards, reflecting significant development efforts.",
        "• The country has a network of over 13,000 kilometers (8,000 miles) of paved roads, facilitating domestic transportation and connectivity.",
        "• Modern telecommunications services are available, including a public data communications network, cellular phone services, and Internet access, supporting communication and digital connectivity.",
        "• Ivory Coast maintains two active ports, with the port of Abidjan being the most modern port in West Africa, serving as a key maritime hub for regional trade.",
        "• The rail network is undergoing upgrades to improve transportation efficiency both within Ivory Coast and to neighboring Burkina Faso, enhancing regional connectivity.",
        "• The country offers regular air services within West Africa and to Europe, supporting regional and international mobility.",
        "• There are ongoing real estate developments across various sectors, including commercial, industrial, retail, and residential properties, indicating economic growth and urban development.",
        "• Ivory Coast's strategic location and strong regional connections make it a preferred platform for foreign businesses operating in West Africa.",
        "• The city of Abidjan is recognized as one of the most modern and livable cities in the West African region, reflecting urban development and infrastructure quality.",
        "• The government’s public investment plan prioritizes investment in human capital and allocates substantial spending toward economic infrastructure to sustain economic growth.",
        "• Following a period of government disengagement from productive activities and recent privatizations, future investments in sectors such as petroleum, electricity, water, telecommunications, and parts of the transport sector are expected to be financed without direct government intervention.",
        "• In 2009, the average wages were approximately $1.05 per man-hour, indicating the wage level within the country's labor market."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:09.011257",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2018, Ivory Coast produced approximately 7.2 million tonnes of yam, ranking as the third-largest producer globally, behind Nigeria and Ghana.",
        "• The country produced around 5 million tonnes of cassava, making it the 14th largest producer in the world.",
        "• Ivory Coast's palm oil production reached approximately 2.1 million tonnes in 2018.",
        "• The nation produced about 2.1 million tonnes of rice during the same year.",
        "• It was the world's largest producer of cocoa, with an output of approximately 1.9 million tonnes in 2018.",
        "• Ivory Coast produced roughly 1.9 million tonnes of sugar cane in 2018.",
        "• The country was the 8th largest producer of plantain globally, with a production of about 1.8 million tonnes.",
        "• Maize production in Ivory Coast amounted to approximately 1 million tonnes in 2018.",
        "• Cashew nut production was around 688 thousand tonnes, making Ivory Coast the third-largest producer worldwide, after Vietnam and India.",
        "• The country produced approximately 461 thousand tonnes of natural rubber in 2018.",
        "• Banana production reached about 397 thousand tonnes.",
        "• Cotton production was approximately 316 thousand tonnes.",
        "• Additional smaller-scale productions included coffee (88 thousand tonnes) and pineapple (50 thousand tonnes).",
        "• Ivory Coast is among the world's leading producers and exporters of cocoa beans and palm oil.",
        "• The economy is highly sensitive to fluctuations in international prices for cocoa and palm oil, as well as to weather conditions.",
        "• Despite government efforts to diversify the economy, it remains predominantly dependent on agriculture and related activities.",
        "• Forced child labor, involving children bought and sold as slaves, is endemic in cocoa production in Ivory Coast."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:15.337205",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Energy",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Côte d'Ivoire's energy supply primarily depends on hydroelectric stations and gas-to-power plants that utilize the country's hydraulic and natural gas resources.",
        "• The country has been actively developing its solar energy sector by establishing several solar photovoltaic (PV) plants to diversify its energy mix.",
        "• Côte d'Ivoire possesses offshore oil and natural gas reserves; however, its production levels remain modest compared to neighboring African countries such as Ghana and Nigeria.",
        "• In 2021, Côte d'Ivoire produced approximately 25,000 barrels of oil per day, indicating relatively small-scale oil output.",
        "• Since 2021, the Italian energy company Eni has made multiple discoveries of oil and gas in the offshore Baleine Field.",
        "• Eni has initiated development activities in the Baleine Field, and by December 2024, its production facilities entered their second phase.",
        "• The second phase of development at Baleine Field's facilities is expected to generate 70 million cubic feet of gas and 60,000 barrels of oil per day."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:19.228273",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Mining",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Ivory Coast was the 9th largest producer of manganese globally, highlighting its significant role in the international manganese market.",
        "• The country's manganese production contributed substantially to its mineral export revenues and economic development.",
        "• In the gold sector, Ivory Coast produced 20.3 tons of gold in the year 2017, indicating its active participation in gold mining activities.",
        "• Gold production data from 2017 reflects the country's ongoing engagement in gold extraction, which is a key component of its mineral industry.",
        "• The information underscores Ivory Coast's position as a notable player in the global mineral resource landscape, particularly in manganese and gold."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:21.888491",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 5
    },
    {
      "section_number": "6",
      "section_name": "Rubber",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Ivory Coast has become a notable participant in the global rubber market, indicating its growing importance in this sector.",
        "• In 2022, Ivory Coast produced 1.55 million tonnes of natural rubber, establishing itself as the world's third-largest producer of natural rubber.",
        "• This production figure in 2022 surpassed Vietnam, which was previously one of the leading producers, highlighting Ivory Coast's rapid growth in rubber output.",
        "• The country's rubber production significantly increased from 815,000 tonnes in 2019, reflecting a substantial growth trajectory over three years.",
        "• The increase in rubber production is primarily attributed to a shift by Ivorian farmers from cacao cultivation to rubber cultivation.",
        "• The shift in agricultural focus is motivated by the potential benefits associated with upcoming European sustainability regulations, which are scheduled to take effect in 2025."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:24.861963",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 6
    },
    {
      "section_number": "7",
      "section_name": "Tourism",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Hotel Ivoire in Abidjan features a casino, serving as a notable hospitality establishment within the country's tourism infrastructure.",
        "• Ivory Coast has made significant progress in diversifying its economy, reducing reliance on traditional sectors.",
        "• Since the 1970s, the country has steadily expanded its tourism facilities, indicating a sustained effort to develop the sector.",
        "• Coastal areas have seen the development of resort lodgings, aimed at attracting tourists seeking leisure and recreational activities.",
        "• Abidjan, the economic capital, hosts numerous hotels, including internationally recognized hotel chains such as Novotel and Sofitel, highlighting the country's integration into global tourism networks."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:26.910465",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 7
    },
    {
      "section_number": "8",
      "section_name": "External trade and investment",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2006, Ivorian exports contributed significantly to the country's economy, though specific export figures for that year are not provided in the section.",
        "• Foreign direct investment (FDI) is a crucial component of the Ivorian economy, constituting between 40% and 45% of the total capital in Ivorian firms, indicating a high reliance on foreign capital.",
        "• France is the predominant foreign investor in Ivory Coast, exerting substantial influence on the country's investment landscape.",
        "• In recent unspecified years, French investment has represented approximately 25% (one-quarter) of the total capital in Ivorian enterprises, highlighting France's dominant role.",
        "• French investment accounts for between 55% and 60% of the total stock of foreign investment capital in Ivory Coast, underscoring France's leading position among foreign investors.",
        "• The stock market capitalization of listed companies in Ivory Coast was valued at $2,327 million (2.327 billion USD) in 2005, as reported by the World Bank.",
        "• In March 2025, Côte d'Ivoire planned to conduct its first bond issuance denominated in CFA Francs on the international financial market, marking a significant development in its external financial operations."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:30.185339",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 8
    },
    {
      "section_number": "8.1",
      "section_name": "Main indicators",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The table presents key economic indicators of Ivory Coast from 1980 to 2023, illustrating trends in GDP, GDP per capita, GDP in nominal terms, growth rates, inflation, and government debt as a percentage of GDP.",
        "• In 1980, Ivory Coast's GDP was $20.7 billion (PPP), with a GDP per capita of $2,585, and nominal GDP of $13.9 billion.",
        "• The GDP increased steadily over the years, reaching $202.6 billion (PPP) in 2023, reflecting significant economic growth.",
        "• GDP per capita rose from $2,585 in 1980 to $6,960 in 2023, indicating improvements in individual economic well-being.",
        "• Nominal GDP grew from $13.9 billion in 1980 to $79.4 billion in 2023, showing expansion in the country's market value.",
        "• The annual real GDP growth rate fluctuated, with notable periods of negative growth, such as −4.2% in 2011, and periods of high growth, such as 10.1% in 2012.",
        "• The highest recorded real GDP growth was 10.1% in 2012, following a period of economic recovery.",
        "• Inflation rates varied significantly, from a low of 0.4% in 2014 to a high of 14.1% in 1995, with recent years maintaining relatively moderate inflation around 4-5%.",
        "• Inflation was at 4.2% in 2021, 5.2% in 2022, and 4.3% in 2023, indicating relatively stable price levels in recent years.",
        "• Government debt as a percentage of GDP decreased from 74% in 2000 to 25% in 2013, then increased again to 57% in 2023, reflecting fluctuations in fiscal policy and borrowing.",
        "• In 2000, government debt was notably high at 74% of GDP, but it declined substantially over the next decade, reaching 25% in 2013, before rising again to 57% in 2023.",
        "• The data highlights periods of economic growth, stability, and volatility, with notable recovery phases post-2010 and fluctuations in inflation and government debt levels."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:38.275197",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 9
    },
    {
      "section_number": "8.2",
      "section_name": "Other data",
      "chapter_name": "Economy of Ivory Coast",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Gross Domestic Product (GDP) of Ivory Coast by sector composition in 2017 was approximately 17.4% from agriculture, 28.8% from industry, and 53.8% from services.",
        "• The labor force in 2017 was estimated at 8.747 million people, with about 60% engaged in agriculture.",
        "• The unemployment rate was reported at 9.4% in 2013.",
        "• As of 2015, approximately 46.3% of the population was living below the poverty line.",
        "• Household income or consumption distribution in 2008 showed the lowest 10% holding 2.2% of the income, while the highest 10% held 31.8%.",
        "• The Gini index, measuring income inequality, was 41.5 in 2008.",
        "• Gross fixed investment was 8.7% of GDP in 2005.",
        "• The national budget in 2017 estimated revenues at $7.121 billion and expenditures at $8.886 billion.",
        "• Key agricultural products include coffee, cocoa beans, bananas, palm kernels, corn, rice, manioc (tapioca), sweet potatoes, sugar, cotton, rubber, and timber.",
        "• Major industries encompass foodstuffs, beverages, wood products, oil refining, gold mining, truck and bus assembly, textiles, fertilizer, building materials, and electricity.",
        "• Industrial production growth rate was approximately 7% in 2017.",
        "• Electricity production in 2015 was 8.262 billion kWh, with consumption at 5.669 billion kWh, exports at 872 million kWh, and imports at 23 million kWh.",
        "• Oil production was around 30,000 barrels per day in 2016; oil consumption was approximately 20,000 barrels per day in 2003; oil exports in 2014 were 34,720 barrels per day, while imports were 65,540 barrels per day.",
        "• Proven oil reserves as of January 2017 were estimated at 100 million barrels.",
        "• Natural gas production and consumption in 2015 were both approximately 2.063 billion cubic meters; exports and imports of natural gas were zero in 2013.",
        "• Proven natural gas reserves as of January 2017 stood at 28.32 billion cubic meters.",
        "• The current account balance was a deficit of $490 million in 2017.",
        "• Total exports in 2017 amounted to $11.08 billion, with primary commodities including cocoa, coffee, timber, petroleum, cotton, bananas, pineapples, palm oil, and fish.",
        "• Main export partners in 2017 were the Netherlands (11.8%), the US (7.9%), France (6.4%), Belgium (6.4%), Germany (5.8%), Burkina Faso (4.5%), India (4.4%), and Mali (4.2%).",
        "• Total imports in 2017 were valued at $8.789 billion, primarily consisting of fuel, capital equipment, and foodstuffs.",
        "• Major import partners included Nigeria (15%), France (13.4%), China (11.3%), and the US (4.3%) in 2017.",
        "• Reserves of foreign exchange and gold totaled $4.688 billion as of 31 December 2017.",
        "• External debt was approximately $12.38 billion as of 31 December 2017.",
        "• Official Development Assistance (ODA) received was about $1 billion in 1996.",
        "• The official currency is the Communaute Financiere Africaine franc (XOF), with the Central Bank of the West African States as the responsible authority.",
        "• Exchange rates for the XOF per US dollar were approximately 594.3 in 2017, 593.01 in 2016 and 2015, 591.45 in 2014, and 494.42 in 2013.",
        "• The fiscal year follows the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:48:49.129245",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 27
      },
      "source_file": "economy_of_ivory_coast.json",
      "original_index": 10
    }
  ]
}