{
  "extraction_info": {
    "source_file": "economy_of_cameroon.json",
    "extraction_timestamp": "2025-08-02T17:13:27.612956",
    "total_sections_in_source": 5,
    "extracted_sections_count": 5,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Cameroon",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Cameroon was among the most prosperous in Africa for approximately twenty-five years following its independence.",
        "• The principal exports of Cameroon included petroleum, cocoa, coffee, and cotton.",
        "• In the mid-1980s, Cameroon experienced a significant decline in commodity prices for these key exports.",
        "• Contributing to economic decline was an overvalued currency and widespread economic mismanagement.",
        "• The economic downturn resulted in a recession that lasted for about ten years.",
        "• Between 1986 and 1994, Cameroon’s real per capita GDP decreased by more than 60%.",
        "• During this period, Cameroon’s current account and fiscal deficits widened substantially.",
        "• The country’s foreign debt increased as a consequence of economic deterioration.",
        "• Despite these challenges, Cameroon maintained a strong endowment of primary commodities due to its oil reserves and favorable agricultural conditions.",
        "• As a result, Cameroon remains one of the best-endowed primary commodity economies in sub-Saharan Africa."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:00:32.804200",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_cameroon.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Cameroon",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2018, Cameroon produced approximately 5 million tons of cassava, ranking as the 13th largest producer globally.",
        "• The country produced about 3.9 million tonnes of plantain, making it the 3rd largest producer in the world, behind Congo and Ghana.",
        "• Cameroon’s palm oil production reached approximately 2.6 million tons, placing it as the 7th largest producer worldwide.",
        "• The nation produced around 2.3 million tons of maize.",
        "• Taro production was approximately 1.9 million tons, ranking Cameroon as the 3rd largest producer globally, second only to Nigeria and China.",
        "• The country produced about 1.4 million tons of sorghum.",
        "• Banana production was approximately 1.2 million tons.",
        "• Sugarcane output also reached about 1.2 million tons.",
        "• Cameroon produced roughly 1 million tons of tomatoes, ranking as the 19th largest producer in the world.",
        "• Yam production was approximately 674,000 tonnes, making Cameroon the 7th largest producer globally.",
        "• Peanut production was around 594,000 tons.",
        "• The country produced about 410,000 tons of sweet potato.",
        "• Bean production was approximately 402,000 tons.",
        "• Rice output was about 332,000 tons.",
        "• Pineapple production reached roughly 310,000 tons.",
        "• Cameroon produced approximately 307,000 tons of cocoa, ranking as the 5th largest producer worldwide, after Ivory Coast, Ghana, Indonesia, and Nigeria.",
        "• Potato production was around 302,000 tons.",
        "• Onion output was approximately 301,000 tons.",
        "• Cotton production was about 249,000 tons.",
        "• In addition to these major crops, Cameroon produced smaller quantities of other agricultural products, including coffee with 33,000 tons and natural rubber with 55,000 tons."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:00:38.076034",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_cameroon.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Finance and banking",
      "chapter_name": "Economy of Cameroon",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Cameroon's financial system is the largest within the CEMAC (Economic and Monetary Community of Central Africa) region.",
        "• Access to financial services in Cameroon remains limited, especially for small and medium-sized enterprises (SMEs).",
        "• Banks in Cameroon tend to prefer dealing with large, established companies, reflecting a traditional banking tendency.",
        "• Loan interest rates for SMEs are capped at 15 percent and are subject to heavy taxation, which influences lending practices.",
        "• As of 2006, bank loans to SMEs constituted less than 15 percent of the total outstanding loans, indicating limited credit allocation to small businesses (Molua, 2002).",
        "• Less than 5 percent of the Cameroonian population has access to a bank account, highlighting low financial inclusion.",
        "• The microfinance sector is gaining importance due to limited traditional banking access, but its development is hindered by a lax regulatory and supervisory framework for microfinance institutions (MFIs).",
        "• The banking sector in Cameroon is highly concentrated and predominantly dominated by foreign commercial banks.",
        "• Six out of the eleven largest commercial banks in Cameroon are foreign-owned.",
        "• The three largest banks in Cameroon hold more than 50 percent of the total assets within the financial system.",
        "• Foreign banks in Cameroon generally maintain good solvency ratios, indicating financial stability.",
        "• Domestic banks are relatively weaker, with capitalization levels below the regional average for banks in the CEMAC zone.",
        "• Domestic banks' profits are approximately 2 percent, significantly lower than the 20 percent profit margin of foreign banks operating in Cameroon.",
        "• The high levels of non-performing loans, which reached 12 percent in 2007, contribute to the financial fragility of domestic banks.",
        "• Due to non-performing loans, most banks hold large amounts of excess reserves relative to deposits and exhibit high levels of unutilized liquidity.",
        "• In 2018, the International Monetary Fund (IMF) recommended that Cameroon increase its tax base to offset financial losses caused by regional instabilities in the North-West and South-West regions.",
        "• Additional economic challenges include the loss of oil revenue, failure to develop port facilities, and a decline in oil production from mature oil fields, all impacting the financial system's stability and revenue."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:00:44.475573",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_cameroon.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Cameroon",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Cameroon became an oil-producing country in 1977, marking a significant shift in its resource base and economic structure.",
        "• The authorities manage \"off-budget\" oil revenues with total opacity, placing the funds in accounts located in Paris, Switzerland, and New York, leading to several billion dollars being diverted to benefit oil companies and regime officials.",
        "• The influence of France in Cameroon remains substantial, with French nationals continuing to dominate key sectors of the economy, as noted by African Affairs magazine in the early 1980s, which stated that they \"continue to dominate almost all key sectors of the economy, much as they did before independence.\"",
        "• French nationals control 55% of the modern sector of the Cameroonian economy, and their control over the banking system is described as total.",
        "• As of March 1998, Cameroon’s fifth IMF program—a 3-year enhanced structural adjustment program approved in August 1997—is on track, indicating progress in economic reforms.",
        "• Cameroon successfully rescheduled its Paris Club debt under favorable terms, improving its debt sustainability.",
        "• From 1995 onward, Cameroon’s GDP has grown at an average rate of about 5% annually, signaling cautious optimism about emerging from a prolonged period of economic hardship.",
        "• The IMF’s Enhanced Structural Adjustment Facility (ESAF) signed with Cameroon emphasizes greater macroeconomic planning, financial accountability, privatization of nearly 100 remaining non-financial parastatal enterprises, and elimination of state marketing board monopolies on exports of cocoa, certain coffees, and cotton.",
        "• The program also calls for privatization and increased price competition in the banking sector, implementation of the 1992 labor code, judicial system improvements, and political liberalization to attract investment.",
        "• France remains Cameroon’s main trading partner, primary source of private investment, and foreign aid provider.",
        "• Cameroon has an investment guaranty agreement and bilateral accords with the United States, with U.S. investment estimated at about $1 million, mostly in the oil sector.",
        "• Inflation in Cameroon has been brought under control, contributing to macroeconomic stability.",
        "• The country aims to become an emerging economy by 2035.",
        "• Beginning in the late 1980s, Cameroon embarked on a series of economic reforms supported by the World Bank and IMF, which involved painful measures such as a 65% cut in civil service salaries in 1993.",
        "• The CFA franc, shared with 13 other African states, was devalued by 50% in January 1994, as part of stabilization efforts.",
        "• Cameroon failed to meet the conditions of the first four IMF programs, indicating challenges in implementing reforms.",
        "• The gross domestic product (GDP) at market prices, estimated by the IMF in millions of Central African CFA Francs, shows a steady growth trend from 1980 to 2022, with notable increases over the decades.",
        "• Specific GDP figures in Central African CFA Francs and US Dollars (at exchange rates) for selected years include:",
        "• 1980: 1,600,186 million CFAF (~209.20 USD)",
        "• 1985: 4,355,977 million CFAF (~471.12 USD)",
        "• 1990: 3,804,428 million CFAF (~300.65 USD)",
        "• 1995: 4,686,286 million CFAF (~518.62 USD)",
        "• 2000: 6,612,385 million CFAF (~658.21 USD)",
        "• 2005: 8,959,279 million CFAF (~527.29 USD)",
        "• 2010: 57,200,000 million CFAF (~27.53 USD nominal), with GDP in US$ PPP at 57.2 billion and per capita at 2,814 US$ PPP.",
        "• 2020: GDP of 102.7 billion USD, with a growth rate of 0.5% and inflation at 2.5%.",
        "• 2022: GDP of 123.3 billion USD, with a growth rate of 3.8% and inflation at 4.6%.",
        "• From 1980 to 2022, Cameroon’s GDP in US$ PPP increased from 11.1 billion (1980) to 123.3 billion (2022), with GDP per capita rising from 1,263 US$ PPP to 4,419 US$ PPP.",
        "• The real GDP growth rate fluctuated, with notable declines during the late 1980s and early 1990s, but generally trending upward in recent years.",
        "• Inflation remained below 5% from 2003 onward, with occasional brief increases, such as 12.7% in 1994, and stabilized around low single digits in the 2010s and early 2020s.",
        "• Government debt as a percentage of GDP decreased from 68% in 1998 and 1999 to 14% in 2007, then gradually increased to 47% by 2022."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:00:59.350581",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 31
      },
      "source_file": "economy_of_cameroon.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Gallery",
      "chapter_name": "Economy of Cameroon",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Douala is a major economic and port city in Cameroon, serving as a key hub for commerce and transportation.",
        "• Limbe is recognized as a notable touristic area within Cameroon, attracting visitors for its natural beauty and attractions.",
        "• The Yaoundé Sport Palace is a prominent sports and event venue located in the capital city, Yaoundé.",
        "• A Fulani herder is depicted driving his cattle across northern Cameroon, illustrating pastoral activities in the region.",
        "• Douala International Airport functions as a primary international gateway to Cameroon, facilitating passenger and cargo flights.",
        "• Intercity buses, such as the Touristique Express, operate during the night, providing transit services between major cities.",
        "• An interurban passenger train is shown in motion, connecting key cities in Cameroon, specifically Douala, Yaoundé, and Ngaoundéré.",
        "• Douala Seaport is a vital maritime facility that handles a significant portion of Cameroon’s imports and exports.",
        "• A truck is transporting beers to various localities within Cameroon, indicating the distribution network for beverages and goods across the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:01:02.600925",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_cameroon.json",
      "original_index": 4
    }
  ]
}