{
  "extraction_info": {
    "source_file": "economy_of_equatorial_guinea.json",
    "extraction_timestamp": "2025-08-02T17:13:27.799184",
    "total_sections_in_source": 6,
    "extracted_sections_count": 6,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Wikipedia article on the Economy of Equatorial Guinea is marked as needing updates to incorporate recent events or newly available information as of March 2025.",
        "• Historically, the economy of Equatorial Guinea relied on commodities such as cocoa and coffee before shifting focus.",
        "• The country became heavily dependent on petroleum following the discovery and exploitation of significant oil reserves in the 1980s.",
        "• In 2017, Equatorial Guinea achieved the milestone of graduating from \"Least Developed Country\" status, becoming one of only six Sub-Saharan African nations to do so.",
        "• Despite economic growth and improvements in infrastructure, Equatorial Guinea was ranked 138th out of 188 countries on the United Nations Human Development Index in 2015.",
        "• The country’s Gross National Income (GNI) figures are impressive; however, it continues to face widespread extreme poverty among its population.",
        "• The collapse of oil prices in 2014 triggered a severe economic downturn, causing growth to decline from approximately 15% to -10%.",
        "• Only 950,000 of the total 1.6 million inhabitants are citizens, resulting in Equatorial Guinea having the highest ratio of expatriates to residents in Africa."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:56:22.726026",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Economy overview",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Prior to independence, Equatorial Guinea relied heavily on cocoa production as a source of hard currency earnings.",
        "• In 1959, Equatorial Guinea had the highest per capita income in Africa, a status it maintained despite decades of being one of the poorest countries globally.",
        "• The discovery of large oil reserves in 1996 marked a significant turning point, leading to increased government revenue through oil exploitation.",
        "• By 2004, Equatorial Guinea became the third-largest oil producer in Sub-Saharan Africa.",
        "• Oil production in 2004 reached approximately 360,000 barrels per day (57,000 m³/d), a substantial increase from 220,000 barrels per day (35,000 m³/d) just two years earlier in 2002.",
        "• Besides oil, forestry, farming, and fishing are major contributors to the country's GDP, with subsistence farming being predominant.",
        "• Although Equatorial Guinea historically depended on cocoa for foreign exchange, neglect of the rural economy under successive regimes has reduced the potential for agriculture-led growth.",
        "• The government has expressed intentions to reinvest some oil revenues into agricultural development.",
        "• Since 1993, aid programs sponsored by the World Bank and IMF have been discontinued due to issues of corruption and mismanagement.",
        "• Due to large oil revenues, Equatorial Guinea is no longer eligible for concessional financing, and efforts to establish a \"shadow\" fiscal management program with the World Bank and IMF have been unsuccessful.",
        "• Most businesses are owned by government officials and their family members, indicating a high level of state control over the economy.",
        "• The country possesses undeveloped natural resources including titanium, iron ore, manganese, uranium, and alluvial gold.",
        "• Economic growth remained strong in 2005 and 2006, primarily driven by oil production."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:56:31.846504",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "In greater depth",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Oil and gas exports have experienced substantial growth and are projected to continue driving Equatorial Guinea's economy for the foreseeable future.",
        "• Real GDP growth reached 23% in 1999, with initial estimates indicating approximately 15% growth in 2001, according to IMF 2001 forecasts.",
        "• Per capita income increased from about $1,000 in 1998 to approximately $2,000 in 2000.",
        "• The energy export sector is primarily responsible for this rapid economic growth.",
        "• Oil production increased from 81,000 barrels per day (12,900 m³/d) in 1998 to 210,000 barrels per day (33,000 m³/d) by early 2001.",
        "• Ongoing development includes further exploitation of existing commercially viable oil and gas deposits and new exploration in offshore concessions.",
        "• Equatorial Guinea possesses largely unexploited natural and human resources, including a tropical climate, fertile soils, abundant water resources, deepwater ports, and an untapped, albeit unskilled, labor force.",
        "• Following independence in 1968, the country endured an 11-year repressive dictatorship that devastated the economy.",
        "• The agricultural sector, historically known for high-quality cocoa, has not fully recovered; cocoa production dropped from 36,161 tons in 1969 to 4,800 tons in 2000.",
        "• Coffee production experienced a sharp decline but rebounded to 100,000 metric tons in 2000.",
        "• Timber is the second-largest source of foreign exchange after oil, accounting for approximately 12.4% of total export earnings during 1996–99.",
        "• Timber production increased steadily during the 1990s, with wood exports reaching a record 789,000 cubic meters in 1999, driven by increased demand in Asia, especially China, after the 1998 economic crisis.",
        "• Most timber (mainly Okoume) is exported, with only about 3% processed domestically; environmentalists warn that exploitation at this level is unsustainable and has caused permanent damage to forestry reserves on Bioko Island.",
        "• Consumer price inflation declined from 38.8% in 1994 (post-CFA franc devaluation) to 7.8% in 1998, and further to 1.0% in 1999, according to BEAC data.",
        "• In 2000, consumer prices increased by approximately 6%, with anecdotal evidence suggesting inflation was accelerating in 2001.",
        "• The government maintains an open investment policy, with policies enacted in 1992 that lifted many restrictions on imports, including non-tariff protections and import licensing, supported by a World Bank-endorsed public investment program.",
        "• The government has privatized some state enterprises, including the distribution of petroleum products in 1998, now operated by companies like Total and Mobil.",
        "• There are plans to privatize the outdated electricity utility; cellular telephone services are operated by a French company in cooperation with a state enterprise.",
        "• The government seeks increased U.S. investment; President Obiang visited the U.S. three times between 1999 and 2001 to promote U.S. corporate interest.",
        "• Sectors targeted for development include agriculture, fishing, livestock, and tourism.",
        "• The country’s balance-of-payments improved significantly since the mid-1990s due to increased oil and gas exports and favorable energy prices.",
        "• In 2000, exports totaled approximately CFA 915 billion (about US$1.25 billion), up from CFA 437 billion (about US$700 million) in 1999; over 90% of export earnings came from crude oil.",
        "• Timber exports accounted for roughly 5% of export revenues in 2000.",
        "• Additional oil production and methanol gas exports from the CMS-Nomeco plant in 2001 are expected to substantially increase export earnings.",
        "• Imports grew rapidly, reaching CFA 380 billion (US$530 million) in 2000, up from CFA 261 billion (US$420 million) in 1999; about 75% of imports consisted of equipment for the oil and gas sector.",
        "• Capital equipment imports for public investment projects reached CFA 30 billion in 2000, a 40% increase from 1999.",
        "• The foreign debt stock was approximately CFA 69 billion (US$100 million) in 2000, slightly less than in 1999, with the debt service ratio decreasing from 20% of GDP in 1994 to just 1% in 2000.",
        "• Foreign exchange reserves were increasing slightly but remained low relative to import needs; some reserves are held in an account with the French Ministry of Finance, as per CFA zone regulations.",
        "• During the 1980s and 1990s, Equatorial Guinea received foreign aid from bilateral and multilateral donors, including European countries, the United States, and the World Bank; however, many aid programs have diminished or ceased.",
        "• Spain, France, and the European Union continue to provide some project assistance, along with China and Cuba.",
        "• The government has discussed collaborating with the World Bank to enhance administrative capacity.",
        "• Equatorial Guinea operated under an IMF-negotiated Enhanced Structural Adjustment Facility (ESAF) until 1996; since then, no formal agreements have been in place.",
        "• IMF Article IV consultations occurred in 1996, 1997, and August 1999; post-1999, IMF officials emphasized the need for fiscal discipline, transparency, and better management of energy sector revenues.",
        "• Despite IMF recommendations, the government’s oil wealth has allowed it to avoid implementing reforms in fiscal discipline, transparency, and accountability."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:56:47.483797",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 34
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Infrastructure",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Malabo International Airport, known locally as Aeropuerto de Malabo, is situated in Punta Europa on the island of Bioko, serving as the main international gateway to Equatorial Guinea.",
        "• The country's infrastructure is generally characterized by aging facilities and poor conditions, reflecting limited development and maintenance challenges.",
        "• As of 2002, surface transport infrastructure was extremely limited, with approximately 700 kilometers of paved roads throughout the country.",
        "• The African Development Bank is actively involved in projects to improve paved roads connecting Malabo to Luba and Riaba, aiming to enhance national connectivity.",
        "• China is undertaking a project to link Mongomo to Bata on the mainland, contributing to infrastructure development efforts.",
        "• The European Union is financing an inter-states road network that links Equatorial Guinea with neighboring countries Cameroon and Gabon, aiming to improve regional integration.",
        "• Road maintenance across the country is often inadequate, leading to deteriorating road conditions and limited usability.",
        "• Electricity supply in larger towns is available but relies on three small, overburdened hydropower plants and a number of aging generators, indicating limited capacity and reliability.",
        "• In 1999, national electricity production was approximately 13 MWh, highlighting the low level of energy generation.",
        "• In Malabo, the American company CMS-Nomeco constructed a 10-megawatt electricity plant financed by the government, which became operational in mid-2000; plans to double its capacity are underway.",
        "• The Malabo power plant has improved electricity service in the capital but still experiences occasional outages.",
        "• The city of Bata on the mainland continues to experience regular blackouts, reflecting ongoing energy supply issues.",
        "• Water supply is limited to major towns and is often unreliable due to poor maintenance and mismanagement; rural areas and villages are typically equipped with private generators and water pumps.",
        "• The state-owned Getesa, a joint venture with a minority stake held by a French subsidiary of Orange, provides telephone services in major cities; the system is overextended but supplemented by Orange’s GSM network, which is popular and generally reliable in Malabo and Bata.",
        "• Equatorial Guinea possesses two of the deepest Atlantic seaports in the region, notably including the main commercial port city of Bata.",
        "• The ports of Malabo and Bata are severely overextended and require significant rehabilitation and reconditioning efforts to meet current demands.",
        "• The British company Incat is engaged in ongoing projects to renovate and expand Luba port on Bioko Island, which is the country’s third-largest port and is intended to become a major hub for offshore oil and gas activities in the Gulf of Guinea.",
        "• Luba port is located approximately 50 kilometers from Malabo and has historically been underutilized, mainly serving minor fishing activities and alleviating congestion in Malabo.",
        "• A new jetty is under construction at kilometer 5 on the route from Malabo to the airport, primarily to service the oil industry but also to help decongest Malabo Port; it was scheduled to open by the end of March 2003.",
        "• The Oil Jetty at kilometer 5 is expected to improve port capacity and reduce congestion at Malabo Port, benefiting offshore oil operations.",
        "• Riaba is a smaller port on Bioko Island with limited activity, primarily serving local needs.",
        "• The continental ports of Mbini and Cogo have deteriorated over time and are now mainly used for timber exports and activities.",
        "• Air and sea connections exist between Malabo and Bata, facilitating domestic transportation.",
        "• As of 2002, the national air fleet consisted of aging Soviet-built aircraft, which have since been largely replaced by ATR and Boeing models.",
        "• Malabo’s runway measures 3,200 meters, equipped with lighting, capable of handling large aircraft such as Boeing 777s and Ilyushin Il-76s.",
        "• Bata’s runway is 2,400 meters long, does not operate at night, but can accommodate aircraft up to the size of Boeing 737s.",
        "• The primary airlines operating out of Malabo are the national airline EGA and a private company, GEASA.",
        "• There are two minor airstrips of 800 meters located at Mongomo and Annobon, serving regional and domestic flights.",
        "• International flights from Malabo connect to Madrid and Zürich in Europe, and to Cotonou, Douala, and Libreville in West Africa."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:57:01.635604",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 29
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Energy developments",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2002, Equatorial Guinea emerged as a significant oil producer in the Gulf of Guinea, a region recognized as one of the most promising hydrocarbon areas globally.",
        "• The main offshore oil fields are Zafiro and Alba, both located off Bioko Island.",
        "• Oil production increased substantially from 1996 to 1999, rising about fivefold; in 1999, production was approximately 500,000 barrels per day (bpd).",
        "• In 1999, Zafiro Field, operated by ExxonMobil and Ocean Energy, produced about 100,000 barrels per day (16,000 m³/d), while CMS Nomeco extracted roughly 6,700 barrels per day (1,070 m³/d).",
        "• By 2002, total oil production reached nearly 200,000 barrels per day.",
        "• Mobil (now ExxonMobil) discovered the large Zafiro field in 1995, with estimated reserves of 400 million barrels (64 million m³).",
        "• Production at Zafiro began in 1996.",
        "• ExxonMobil announced a three-year, US$1 billion rapid-development program aimed at increasing output to 130,000 barrels per day (21,000 m³/d) by early 2001.",
        "• Progress on this development was delayed due to a contractual dispute with the government and unexpectedly difficult geology; the dispute was eventually resolved.",
        "• In 1998, Equatorial Guinea introduced a more liberal regulatory and profit-sharing framework for hydrocarbon exploration and production, revising the previous contract terms that heavily favored Western operators.",
        "• As a result, domestic oil receipts increased from 13% to 20% of total oil export revenue, although the government’s share remains relatively low compared to international standards.",
        "• In 1997, CMS Nomeco expanded its operations with a US$300 million methanol plant, which began production in 2000 and contributed to increased natural gas condensate output from the Alba field.",
        "• In August 1999, the government closed bidding on a new petroleum licensing round for 53 unexplored deepwater blocks and seven shallow-water blocks.",
        "• The response to the licensing round was limited due to falling oil prices, industry restructuring, and unresolved maritime border issues with Nigeria, which were not settled until 2000.",
        "• In late 1999, Triton Energy, a U.S. independent, discovered La Ceiba in offshore block G, an entirely new area offshore the mainland.",
        "• Triton Energy projected a US$200 million development program to enable La Ceiba and associated fields to produce 100,000 barrels per day (16,000 m³/d) by late 2001, despite initial technical difficulties and setbacks.",
        "• Exploration activity intensified in 2000 with rising oil prices; in April, Vanco Energy signed a production-sharing contract for the offshore Corisco Deep block.",
        "• In May 2000, Chevron was granted exploration rights for block L offshore Río Muni, and three additional contracts were signed with Atlas Petroleum for blocks J, I, and H.",
        "• In early 2001, the government announced plans to establish a national oil company to increase local participation and facilitate skill transfer, amid concerns about potential opacity and bureaucratic inertia similar to neighboring countries like Angola, Cameroon, and Nigeria.",
        "• Since 2001, the government established GEPetrol, a national oil company, and Sonagas, a national natural-gas company.",
        "• The company EG LNG was created to build and operate the Bioko Island LNG plant and terminal, which began operations in May 2007; a second LNG plant is under development.",
        "• Equatorial Guinea became a member of OPEC in May 2017."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:57:10.781776",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Data",
      "chapter_name": "Economy of Equatorial Guinea",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section provides a comprehensive overview of Equatorial Guinea's main economic indicators from 1980 to 2017, highlighting trends and changes over nearly four decades.",
        "• In 1980, Equatorial Guinea's GDP measured approximately 0.09 billion US dollars (PPP), with a GDP per capita of 412 US dollars (PPP), and a nominal GDP of 0.03 billion US dollars, experiencing a real growth rate of 4.8%, and government debt was 146% of GDP.",
        "• By 1985, GDP increased to 0.15 billion US dollars (PPP), with per capita income rising to 482 US dollars (PPP), nominal GDP reaching 0.07 billion US dollars, and a significant growth rate of 12.9%, while government debt grew to 184% of GDP.",
        "• In 1990, GDP was 0.19 billion US dollars (PPP), with a per capita income of 498 US dollars (PPP), nominal GDP at 0.13 billion US dollars, and a modest real growth of 2.5%, with government debt at 157% of GDP.",
        "• The year 1995 saw a notable increase in GDP to 0.45 billion US dollars (PPP), with per capita income doubling to 1,020 US dollars (PPP), and nominal GDP at 0.17 billion US dollars; however, the economy experienced a high real growth rate of 26.5%, and government debt decreased to 137% of GDP.",
        "• By 2000, GDP surged to 6.20 billion US dollars (PPP), with a per capita income of 11,981 US dollars (PPP), and nominal GDP at 1.16 billion US dollars, with an extraordinary real growth rate of 112.1%, but government debt remained high at 37% of GDP.",
        "• In 2005, GDP further increased to 21.56 billion US dollars (PPP), with per capita income at 35,721 US dollars (PPP), and nominal GDP at 8.19 billion US dollars; the economy grew at 8.2% in real terms, and government debt was only 3% of GDP.",
        "• The trend continued in 2006 with GDP at 23.48 billion US dollars (PPP), per capita income at 37,785 US dollars (PPP), and nominal GDP at 10.10 billion US dollars, with a 5.7% growth rate and government debt at 1%.",
        "• In 2007, GDP reached 27.79 billion US dollars (PPP), with per capita income of 43,454 US dollars (PPP), and nominal GDP of 13.09 billion US dollars, experiencing a 15.3% growth rate, with government debt remaining at 1%.",
        "• The year 2008 saw GDP grow to 33.38 billion US dollars (PPP), with per capita income of 50,732 US dollars (PPP), and nominal GDP at 19.83 billion US dollars, with a 17.8% growth rate, and government debt at 0%.",
        "• In 2009, GDP was 34.09 billion US dollars (PPP), with per capita income of 50,363 US dollars (PPP), and nominal GDP at 15.09 billion US dollars, but the economy experienced a slowdown with a 1.3% growth rate; government debt increased to 4%.",
        "• In 2010, GDP declined to 31.43 billion US dollars (PPP), with per capita income at 45,141 US dollars (PPP), and nominal GDP at 16.31 billion US dollars, with a contraction of −8.9% in real terms, and government debt rose to 8%.",
        "• The recovery began in 2011 with GDP at 34.17 billion US dollars (PPP), per capita income at 47,719 US dollars (PPP), and nominal GDP at 21.36 billion US dollars, growing 6.5%, with government debt at 7%.",
        "• In 2012, GDP increased to 37.68 billion US dollars (PPP), with per capita income of 51,187 US dollars (PPP), and nominal GDP of 22.39 billion US dollars, with an 8.3% growth rate; government debt remained at 7%.",
        "• The economy experienced a slight decline in 2013, with GDP at 36.71 billion US dollars (PPP), per capita income of 48,499 US dollars (PPP), and nominal GDP of 21.95 billion US dollars, contracting by −4.1%, with government debt at 7%.",
        "• In 2014, GDP was 37.22 billion US dollars (PPP), with per capita income of 47,701 US dollars (PPP), and nominal GDP at 21.77 billion US dollars, experiencing a marginal decline of −0.7%, with government debt increasing to 13%.",
        "• The economic downturn intensified in 2015, with GDP decreasing to 34.09 billion US dollars (PPP), per capita income at 42,648 US dollars (PPP), and nominal GDP at 13.19 billion US dollars, contracting by −9.1%, and government debt rising sharply to 36%.",
        "• In 2016, GDP further declined to 31.18 billion US dollars (PPP), with per capita income at 37,985 US dollars (PPP), and nominal GDP at 11.24 billion US dollars, with a −9.7% contraction, and government debt at 48%.",
        "• By 2017, GDP was 30.35 billion US dollars (PPP), with per capita income of 36,017 US dollars (PPP), and nominal GDP at 12.20 billion US dollars, experiencing a −4.4% decrease, with government debt at 43%.",
        "• Gross fixed investment as of 2005 was estimated at 46.3% of GDP.",
        "• Key industries include petroleum, fishing, sawmilling, and natural gas, indicating a resource-based economy.",
        "• Industrial production growth rate was approximately 30% in 2002.",
        "• Electricity production in 2005 was 29.43 gigawatt-hours (GWh), with electricity consumption at 27.37 GWh.",
        "• Major agricultural products include coffee, cocoa, rice, yams, cassava (tapioca), bananas, palm oil nuts; livestock; and timber.",
        "• The exchange rate in 2005 was 480.56 CFA francs (CFAF) per US dollar, with historical rates showing fluctuations: 528.29 CFAF in 2004, 581.2 CFAF in 2003, 696.99 CFAF in 2002, and 733.04 CFAF in 2001."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T21:57:30.037792",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_equatorial_guinea.json",
      "original_index": 5
    }
  ]
}