{
  "extraction_info": {
    "source_file": "economy_of_jordan.json",
    "extraction_timestamp": "2025-08-02T17:13:28.177808",
    "total_sections_in_source": 22,
    "extracted_sections_count": 22,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Jordan is classified by the World Food Programme as an upper-middle income economy.",
        "• Jordan is resource-poor, with limited land available for agriculture.",
        "• The country's GDP per capita increased by 351% during the 1970s.",
        "• In the 1980s, Jordan's GDP per capita declined by 30%.",
        "• During the 1990s, GDP per capita rose by 36%.",
        "• After King Abdullah II's accession to the throne in 1999, Jordan implemented liberal economic policies.",
        "• Between 1999 and 2008, Jordan's economy grew at an annual rate of 8%.",
        "• Post-2011 Arab Spring, economic growth slowed to 2% annually.",
        "• The population increase, slowed economic growth, and rising public debt worsened poverty and unemployment.",
        "• As of 2023, Jordan's GDP is US$50.85 billion, ranking 89th worldwide.",
        "• Jordan has free trade agreements with the United States, Canada, Singapore, Malaysia, the European Union, Tunisia, Algeria, Libya, Turkey, and Syria.",
        "• Planned free trade agreements include those with Iraq, the Palestinian Authority, the Gulf Cooperation Council (GCC), Lebanon, and Pakistan.",
        "• Jordan is a member of the Greater Arab Free Trade Area, the Euro-Mediterranean free trade area, the Agadir Agreement, and has advanced status with the EU.",
        "• The main economic resources are phosphates, potash, fertilizer derivatives, tourism, overseas remittances, and foreign aid.",
        "• These resources are the primary sources of Jordan's hard currency earnings.",
        "• Jordan lacks coal reserves, hydroelectric power, large forests, and commercially viable oil deposits.",
        "• The country relies on natural gas for 93% of its domestic energy needs.",
        "• Jordan previously depended on Iraq for oil until the 2003 invasion of Iraq by the US-led coalition.",
        "• Jordan has industrial zones producing textiles, aerospace, defense, ICT, pharmaceuticals, and cosmetics.",
        "• Jordan is an emerging knowledge economy.",
        "• The main obstacles to economic development include scarce water supplies, reliance on oil imports for energy, and regional instability.",
        "• Less than 10% of Jordan's land is arable, with limited and non-renewable groundwater sources.",
        "• Rainfall in Jordan is low and highly variable.",
        "• In 2011, Jordan's total foreign debt was $19 billion, representing 60% of GDP.",
        "• By 2016, the debt increased to $35.1 billion, or 93.4% of GDP.",
        "• The debt increase was due to regional instability, decreased tourism and foreign investment, increased military expenditure, attacks on the Egyptian gas pipeline, collapse of trade with Iraq and Syria, expenses from hosting Syrian refugees, and accumulated loan interest.",
        "• Syrian refugees cost Jordan over $2.5 billion annually, which is 6% of GDP and 25% of the government's annual revenue.",
        "• Refugee-related economic pressures led to declining wage growth due to job competition.",
        "• The economic downturn from 2011 persisted until 2018.",
        "• The top five sectors contributing to GDP—government services, finance, manufacturing, transport, and tourism/hospitality—were severely impacted by the Syrian civil war.",
        "• Foreign aid covered only a small part of the costs; approximately 63% of total costs were borne by Jordan.",
        "• The government adopted an austerity program to reduce the debt-to-GDP ratio to 77% by 2021, successfully preventing it from exceeding 95% in 2018.",
        "• The annual economic growth rate was 2% from 2016 to 2019, compared to 6.4% during 2000–2009.",
        "• On 15 May 2025, Jordan and the UAE activated their Comprehensive Economic Partnership Agreement (CEPA).",
        "• The CEPA, signed in 2023 under King Abdullah II and President Sheikh Mohamed bin Zayed, aims to strengthen bilateral trade, reduce tariffs, and promote investment in sectors like industry, renewable energy, and tourism.",
        "• The agreement establishes cooperation frameworks, including a joint investment council.",
        "• It targets increasing non-oil trade to over $8 billion by 2032.",
        "• The Jordan-UAE CEPA is the UAE’s first such agreement with an Arab country, emphasizing regional integration, SME empowerment, and long-term economic partnership."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:24.180916",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 38
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Currency",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Central Bank of Jordan began operations in 1964 and holds the exclusive authority to issue Jordanian currency.",
        "• The official currency of Jordan is the Jordanian dinar, which is pegged to the US dollar.",
        "• The trend of Jordan's gross domestic product (GDP) at market prices, as reported by the International Monetary Fund, is provided in millions of Jordanian dinars across several years:",
        "• For purchasing power parity (PPP) comparisons, the Jordanian dinar is exchanged at a rate of 0.710 per US dollar.",
        "• Jordan's population is approximately 6,342,948 inhabitants.",
        "• In 2009, the average wage was $4.19 per man-hour."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:28.992116",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Economic overview",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Jordan is classified by the United Nations as an \"Upper-middle-income country,\" indicating a moderate level of income per capita and economic development.",
        "• According to the Heritage Foundation's Index of Economic Freedom, Jordan has the fourth freest economy in the Middle East and North Africa region, surpassed only by Israel, Bahrain, and Qatar, and ranks as the 32nd freest economy globally.",
        "• The World Economic Forum's Index of Economic Competitiveness ranks Jordan as having the 35th best infrastructure worldwide, outperforming many peers in the Persian Gulf and Europe, including Kuwait, Israel, and Ireland.",
        "• In 2010, the AOF Index of Globalization ranked Jordan as the most globalized country in the Middle East and North Africa, reflecting high levels of economic integration and openness.",
        "• Jordan's banking sector is classified as \"highly developed\" by the International Monetary Fund (IMF), comparable to the banking sectors of the Gulf Cooperation Council (GCC) economies and Lebanon.",
        "• The official currency of Jordan is the Jordanian dinar, which is subdivided into 100 qirsh (also called piastres) or 1000 fils.",
        "• Since 23 October 1995, the Jordanian dinar has been officially pegged to the International Monetary Fund's (IMF) special drawing rights (SDRs).",
        "• The fixed exchange rate is approximately 1 US dollar = 0.709 dinar, which equates to about 1 dinar = 1.41044 US dollars.",
        "• The Central Bank of Jordan buys US dollars at 0.708 dinar and sells US dollars at 0.7125 dinar; currency exchangers buy US dollars at 0.708 dinar and sell at 0.709 dinar.",
        "• In 2011, Jordan's market was considered one of the most developed Arab markets outside the Persian Gulf.",
        "• Jordan ranked 18th on the 2012 Global Retail Development Index, which lists the 30 most attractive retail markets worldwide.",
        "• In 2010, Jordan was ranked as the 19th most expensive country in the world to live in and was the most expensive Arab country in terms of cost of living.",
        "• Jordan has been a member of the World Trade Organization (WTO) since 2000, facilitating international trade and economic integration.",
        "• In the 2009 Global Enabling Trade Report, Jordan ranked 4th in the Arab World, behind the UAE, Bahrain, and Qatar, indicating a favorable environment for trade facilitation.",
        "• The free trade agreement between Jordan and the United States, which commenced in December 2001, phased out duties on nearly all goods and services by 2010, enhancing trade relations and market access."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:35.341852",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 2
    },
    {
      "section_number": "2.1",
      "section_name": "Unemployment",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Jordan experienced high unemployment rates, with an official rate of 11.9% in the fourth quarter of 2010.",
        "• Some estimates suggest that unemployment could be as high as 25% of the working-age population.",
        "• In 2021, unemployment reached 25%, marking the highest level in over 25 years.",
        "• The 2021 unemployment rate was 6 percentage points higher than in 2019.",
        "• The 2021 rate was more than double the unemployment rate in 2011.",
        "• Unemployment is identified as a significant economic issue in Jordan, especially affecting specific demographic groups.",
        "• Young people face particularly high unemployment rates, exceeding 45%.",
        "• Women experience unemployment rates over 30%.",
        "• Individuals with a university degree also face unemployment rates exceeding 30%."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:37.494084",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 3
    },
    {
      "section_number": "2.1.1",
      "section_name": "Youth unemployment",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• There are approximately 15 million unemployed young men across Arab communities.",
        "• The youth unemployment rate in Jordan has historically been significantly higher than in other countries.",
        "• Over the past ten years, Jordan’s youth unemployment rate has remained steady at around 23%.",
        "• Recently, there has been a growing public perception that youth unemployment is primarily due to individual shortcomings rather than systemic societal issues.",
        "• Youth unemployment in Jordan has been linked to increased pressure on service sectors, which are typically major employers of young people in the country.",
        "• The phenomenon of youth unemployment has contributed to delayed marriage ages in Jordan, which is considered one of its most significant social consequences.",
        "• An additional notable consequence of youth unemployment in Jordan is a rise in mental health problems among young people.",
        "• In 2019, the youth unemployment rate in Jordan was estimated at 35%."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:40.155985",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 4
    },
    {
      "section_number": "2.2",
      "section_name": "Remittances to Jordan",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Remittance flows to Jordan experienced rapid growth during the late 1970s and 1980s, coinciding with Jordan's export of high-skilled labor to Persian Gulf States.",
        "• Remittances are a significant source of external funding for Jordan and many other developing countries.",
        "• In 2010, Jordan received approximately US$3,000 million in remittances, ranking 10th among developing countries according to World Bank data.",
        "• Over the past decade, Jordan has consistently ranked among the top 20 remittance-recipient countries globally.",
        "• According to the Arab Monetary Fund (AMF) statistics in 2010, Jordan was the third-largest recipient of remittances among Arab countries, after Egypt and Lebanon.",
        "• The primary host countries for Jordanian expatriates are Saudi Arabia and the United Arab Emirates (UAE), with about 90% of these migrants working in Persian Gulf countries.",
        "• The proportion of skilled workers in Jordan is among the highest in the Middle East region.",
        "• Jordan hosts many major software and hardware IT companies, highlighting its attractiveness as a stable base with high-caliber human resources to serve the wider region.",
        "• A January 2012 report by Rachid Sefraoui, founder of venture capital firm Finaventures, ranked Amman as one of the top 10 best cities worldwide to launch a tech start-up.",
        "• Approximately 13.3% of Jordanian citizens live below the poverty line.",
        "• Since the mid-1970s, remittances from migrants have been Jordan’s most important source of foreign exchange, significantly contributing to the country’s economic development and improving living standards.",
        "• In the early 1950s, agriculture accounted for nearly 40% of Jordan’s GNP; by the eve of the June 1967 War, this share had decreased to 17%, and by the mid-1980s, it further declined to about 6%.",
        "• Jordan hosts SOFEX, the world's fastest-growing and the region’s only special operations and homeland security exhibition and conference.",
        "• Jordan is a regional and international provider of advanced military goods and services.",
        "• The KADDB Industrial Park, focused on defense manufacturing, was opened in September 2009 in Mafraq; by 2015, it was expected to generate around 15,000 jobs with an investment volume of JD500 million.",
        "• The Strategic Foresight Group estimated the opportunity cost of conflict in the Middle East from 1991 to 2010 at $12 trillion, with Jordan’s share approximately $84 billion.",
        "• Jordan has a mobile phone penetration rate of 138% and an internet penetration rate of 63%.",
        "• About 41.6% of mobile phones in Jordan are smartphones, compared to 40% in the United States and 26% in the United Kingdom.",
        "• 97% of Jordanian households own at least one television set, and 90% have satellite reception.",
        "• 61% of Jordanian households own at least one personal computer or laptop.",
        "• Jordan was ranked as the 9th best outsourcing destination worldwide according to an investment survey.",
        "• Amman was recognized as one of the top 10 cities globally to launch a tech start-up in 2012 and is increasingly referred to as the \"Silicon Valley of the Middle East.\"",
        "• Jordan has hosted the World Economic Forum on the Middle East and North Africa six times, with plans to host it again at the Dead Sea in 2013.",
        "• Amman hosts the Mercedes Benz Fashion Week semiannually, being the only city in the region to hold such a prestigious event, typically held in New York, Paris, and Milan."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:49.780108",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 5
    },
    {
      "section_number": "2.3",
      "section_name": "Standard of living",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Jordan is recognized as one of the most liberal countries in the Middle East, allowing a debate on introducing a secular government.",
        "• In the 2010 Human Development Index, Jordan was classified within the \"high human development\" bracket and ranked 7th among Arab countries, following the Persian Gulf states and Lebanon.",
        "• The 2010 Quality of Life Index, compiled by _International Living_ magazine, ranked Jordan second in the Middle East and North Africa (MENA) region with a score of 55.0 points, trailing only Israel.",
        "• Decades of political stability, security, and strict law enforcement contribute to Jordan being among the top 10 countries worldwide in terms of security.",
        "• In the 2010 Newsweek \"World's Best Countries\" list, Jordan was ranked 53rd globally and 3rd among Arab nations, after Kuwait and the United Arab Emirates (UAE).",
        "• Jordan is also among the top ten countries where citizens feel safest walking the streets at night.",
        "• As of 2011, 63% of employed Jordanians are insured through the Social Security Corporation, which also insures 120,000 foreigners; plans are in place to extend coverage to all Jordanian workers both inside and outside the kingdom, as well as students, housewives, business owners, and the unemployed.",
        "• Only 1.6% of Jordanians live on less than $2 per day, making it one of the lowest poverty rates in the developing world according to the Human Poverty Index.",
        "• In the 2010 Gallup Global Wellbeing Survey, 30% of Jordanians described their financial situation as \"thriving,\" a figure higher than most Arab countries, except for Qatar, the United Arab Emirates, Kuwait, and Saudi Arabia.",
        "• In 2008, the Jordanian government launched the \"Decent Housing for a Decent Living\" project, aiming to build 120,000 affordable housing units within five years, with an additional 100,000 units planned if needed."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:53:54.080592",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 6
    },
    {
      "section_number": "2.4",
      "section_name": "Main indicators",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The table presents key economic indicators for Jordan spanning from 1980 to 2024, providing a comprehensive overview of the country's economic performance over this period.",
        "• In 1980, Jordan's GDP measured 8.82 billion US dollars (PPP), with a GDP per capita of 3,978 US dollars (PPP), and a nominal GDP of 3.93 billion US dollars.",
        "• During 1980, Jordan experienced a high real GDP growth rate of 11.1%, accompanied by an inflation rate of 10.9%, with government debt data not available.",
        "• By 1985, Jordan's GDP increased to 14.65 billion US dollars (PPP), with a per capita GDP of 5,326 US dollars (PPP), and a nominal GDP of 5.03 billion US dollars; the economy contracted by −1.1% in real terms, and inflation decreased to 2.8%.",
        "• In 1990, the GDP reached 16.83 billion US dollars (PPP), with a per capita GDP of 4,834 US dollars (PPP), and a nominal GDP of 4.19 billion US dollars; the economy shrank by −1.6%, but inflation surged to 16.2%, and government debt was 227.5% of GDP.",
        "• The 1995 data shows a significant growth to 24.31 billion US dollars (PPP), with a per capita GDP of 5,453 US dollars (PPP), and a nominal GDP of 6.76 billion US dollars; the economy grew by 6.0%, inflation was low at 2.4%, and government debt decreased to 117.8% of GDP.",
        "• By 2000, Jordan's GDP increased to 31.00 billion US dollars (PPP), with a per capita GDP of 6,131 US dollars (PPP), and a nominal GDP of 8.73 billion US dollars; the economy grew by 4.2%, inflation was minimal at 0.7%, and government debt was 99.3% of GDP.",
        "• The period from 2005 to 2007 saw substantial growth, with GDP rising from 47.66 billion US dollars (PPP) in 2005 to 59.34 billion US dollars in 2007; per capita GDP increased from 8,392 US dollars to 9,166 US dollars, and nominal GDP from 13.13 billion to 17.96 billion US dollars.",
        "• In 2008, GDP reached 64.95 billion US dollars (PPP), with a per capita GDP of 9,792 US dollars, and a nominal GDP of 22.65 billion US dollars; the economy grew by 7.4%, but inflation spiked to 14.0%, and government debt was 54.2% of GDP.",
        "• The 2009 data shows a GDP of 68.63 billion US dollars (PPP), with a per capita GDP of 10,122 US dollars, and a nominal GDP of 24.54 billion US dollars; growth slowed to 5.0%, inflation turned negative at −0.7%, and government debt increased to 58.0%.",
        "• In 2010, GDP grew to 71.07 billion US dollars (PPP), with a per capita GDP of 10,254 US dollars, and a nominal GDP of 27.13 billion US dollars; real growth was 2.3%, inflation rose to 4.8%, and government debt was 59.4%.",
        "• The year 2011 saw GDP at 74.52 billion US dollars (PPP), with a per capita GDP of 10,482 US dollars, and a nominal GDP of 29.52 billion US dollars; growth was 2.7%, inflation at 4.2%, and government debt at 62.1%.",
        "• In 2012, GDP increased to 77.76 billion US dollars (PPP), with a per capita GDP of 10,782 US dollars, and a nominal GDP of 31.68 billion US dollars; growth was 2.4%, inflation at 4.5%, and government debt rose to 70.5%.",
        "• The 2013 figures show GDP of 81.14 billion US dollars (PPP), with a per capita GDP of 10,545 US dollars, and a nominal GDP of 34.50 billion US dollars; growth was 2.6%, inflation at 4.8%, and government debt at 75.6%.",
        "• In 2014, GDP reached 85.35 billion US dollars (PPP), with a per capita GDP of 9,858 US dollars, and a nominal GDP of 36.90 billion US dollars; growth was 3.4%, inflation decreased to 2.9%, and government debt was 75.0%.",
        "• The 2015 data indicates GDP of 88.29 billion US dollars (PPP), with a per capita GDP of 9,300 US dollars, and a nominal GDP of 38.64 billion US dollars; growth slowed to 2.5%, inflation was negative at −0.9%, and government debt increased to 78.4%.",
        "• In 2016, GDP was 90.91 billion US dollars (PPP), with a per capita GDP of 9,123 US dollars, and a nominal GDP of 39.95 billion US dollars; growth was 2.0%, inflation was negative at −0.8%, and government debt slightly decreased to 77.4%.",
        "• The year 2017 saw GDP at 94.83 billion US dollars (PPP), with a per capita GDP of 9,283 US dollars, and a nominal GDP of 41.67 billion US dollars; growth was 2.5%, inflation increased to 3.3%, and government debt was 75.7%.",
        "• In 2018, GDP slightly declined to 94.60 billion US dollars (PPP), with a per capita GDP of 9,045 US dollars, and a nominal GDP of 43.43 billion US dollars; growth was 1.9%, inflation rose to 4.5%, and government debt was 74.3%.",
        "• The 2019 data shows GDP at 100.63 billion US dollars (PPP), with a per capita GDP of 9,405 US dollars, and a nominal GDP of 44.57 billion US dollars; growth was 1.8%, inflation was 0.8%, and government debt increased to 78.0%.",
        "• In 2020, GDP was 104.08 billion US dollars (PPP), with a per capita GDP of 9,524 US dollars, and a nominal GDP of 43.76 billion US dollars; the economy contracted by −1.1%, inflation was minimal at 0.3%, and government debt rose significantly to 88.0%.",
        "• The 2021 figures show GDP at 101.62 billion US dollars (PPP), with a per capita GDP of 9,115 US dollars, and a nominal GDP of 46.36 billion US dollars; the economy grew by 3.7%, inflation was 1.3%, and government debt increased to 93.3%.",
        "• In 2022, GDP increased to 111.51 billion US dollars (PPP), with a per capita GDP of 9,880 US dollars, and a nominal GDP of 48.72 billion US dollars; growth was 2.4%, inflation at 4.2%, and government debt was 93.0%.",
        "• The 2023 data indicates GDP at 118.54 billion US dollars (PPP), with a per capita GDP of 10,456 US dollars, and a nominal GDP of 50.89 billion US dollars; growth was 2.6%, inflation at 2.1%, and government debt slightly decreased to 92.8%.",
        "• In 2024, GDP is projected to reach 124.28 billion US dollars (PPP), with a per capita GDP of 10,917 US dollars, and a nominal GDP of 53.31 billion US dollars; growth is expected to be 2.4%, inflation at 2.1%, and government debt to slightly decline to 91.7%."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:13.138528",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 7
    },
    {
      "section_number": "2.5",
      "section_name": "Agriculture, forestry, and fishing",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Despite increases in agricultural production, the sector's contribution to Jordan's economy has steadily declined, accounting for only 2.4% of gross domestic product (GDP) by 2004.",
        "• In 2002, approximately 4% of Jordan's labor force was employed in the agricultural sector.",
        "• The most profitable segment within Jordan's agriculture is fruit and vegetable production, which includes tomatoes, cucumbers, citrus fruits, and bananas, primarily cultivated in the Jordan Valley.",
        "• Other crop productions, particularly cereal crops, are characterized by volatility due to inconsistent rainfall patterns.",
        "• The fishing industry in Jordan is minimal relative to the overall economy, with an even split between live capture fishing and aquaculture.",
        "• In 2002, the total live weight catch from fishing was just over 1,000 metric tons.",
        "• The forestry industry in Jordan is negligible economically; in 2002, approximately 240,000 cubic meters of roundwood were harvested, predominantly for fuelwood purposes."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:16.096162",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 8
    },
    {
      "section_number": "2.5.1",
      "section_name": "Recent Developments",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since Jordan's independence, the agricultural sector has experienced substantial growth, with the added value of its production reaching JD1.691 billion and achieving a 9% growth rate.",
        "• Vegetable production in Jordan has increased by 91%, significantly expanding the sector's output to meet rising domestic and international demand.",
        "• Fruit tree produce has risen by 141%, contributing to the diversification and expansion of Jordanian agricultural exports.",
        "• Jordanian agricultural products are now exported to 112 countries worldwide, indicating a broad international market presence.",
        "• Agricultural exports have surged by 441%, reaching a total value of JD1.5 billion, reflecting a substantial increase in trade activity.",
        "• Livestock numbers in Jordan have grown by 54%, totaling approximately 3.8 million animals, which supports the sector's expansion.",
        "• The value of animal products has increased by 279%, reaching JD1.305 billion, highlighting significant growth in livestock-related revenue.",
        "• Employment within the agricultural sector has expanded by 38%, now employing approximately 261,000 workers, thereby contributing to rural employment and economic stability.",
        "• The Agricultural Credit Corporation's capital has increased by 213%, reaching JD100 million, which enhances financial support for the sector.",
        "• The Corporation provides JD55 million annually in loans to around 11,000 farmers, facilitating agricultural development and investment.",
        "• These recent developments emphasize the sector's critical role in improving food security, fostering economic integration, and generating employment opportunities in rural areas."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:19.068139",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 9
    },
    {
      "section_number": "2.6",
      "section_name": "Mining and minerals",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Potash and phosphates are among Jordan's primary economic exports, playing a significant role in the country's trade revenue.",
        "• In 2003, Jordan produced approximately 2 million tons of potash salt, which generated US$192 million in export earnings, making potash the second most lucrative exported good.",
        "• Potash production in Jordan was 1.9 million tons in 2004 and slightly decreased to 1.8 million tons in 2005.",
        "• In 2004, Jordan produced approximately 6.75 million tons of phosphate rock, which yielded US$135 million in export earnings, ranking it as the fourth most important export product.",
        "• Jordan was the world's third largest producer of raw phosphates in 2005, with a production total of 6.4 million tons.",
        "• Besides potash and phosphates, Jordan also mines smaller quantities of unrefined salt, copper ore, gypsum, manganese ore, and mineral precursors used in ceramics production, including glass sand, clays, and feldspar."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:22.752661",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 10
    },
    {
      "section_number": "2.7",
      "section_name": "Industry and manufacturing",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The industrial sector in Jordan, encompassing mining, manufacturing, construction, and power, contributed approximately 26% to the country's gross domestic product (GDP) in 2004, with manufacturing accounting for 16.2%, construction 4.6%, and mining 3.1%.",
        "• Over 21% of Jordan's labor force was employed in the industrial sector in 2002.",
        "• The main industrial products produced in Jordan include potash, phosphates, pharmaceuticals, cement, clothing, and fertilizers.",
        "• The construction segment is considered the most promising within the industrial sector, driven by increased demand for housing and office spaces for foreign enterprises seeking better access to the Iraqi market.",
        "• The manufacturing sector experienced growth, reaching nearly 20% of GDP by 2005, largely due to the United States–Jordan Free Trade Agreement ratified in 2001 by the U.S. Senate.",
        "• The Free Trade Agreement facilitated the establishment of approximately 13 qualifying industrial zones across Jordan, which offer duty-free access to the U.S. market and primarily produce light industrial goods, especially ready-made garments.",
        "• By 2004, these industrial zones accounted for nearly US$1.1 billion in exports, according to the Jordanian government.",
        "• Jordan's free trade agreement with the U.S., the first such agreement in the Arab world, has made the U.S. one of Jordan's most significant markets, with plans for barrier-free export access in nearly all sectors by 2010.",
        "• Jordan has also signed trade agreements with other Middle Eastern and North African countries, including the Agadir Agreement, which is viewed as a precursor to a free trade agreement with the European Union (EU).",
        "• Recently, Jordan signed a free trade agreement with Canada, further expanding its trade relations.",
        "• The country’s numerous industrial zones offer tax incentives, low utility costs, and improved infrastructure, fostering new industrial developments.",
        "• Jordan benefits from a relatively high skills level among its workforce, which promotes investment and economic growth, especially in value-added sectors.",
        "• Despite limited natural resources, Jordan possesses abundant reserves of potash and phosphates, which are extensively used in fertilizer production; exports from these industries were expected to reach a combined value of US$1 billion in 2008.",
        "• Key industries include pharmaceuticals, which exported approximately US$435 million in 2006 and US$260 million in the first half of 2008, and textiles, valued at US$1.19 billion in 2007.",
        "• The country faces challenges such as dependence on imported raw materials, making it vulnerable to price volatility, and shortages in water and power, which hinder consistent industrial development.",
        "• Despite these challenges, Jordan’s open economy and established fertilizer and pharmaceutical industries are expected to continue generating significant foreign currency.",
        "• Jordan has developed numerous industrial zones and special economic zones (SEZs) aimed at boosting exports and establishing the country as an industrial hub.",
        "• The Mafraq SEZ focuses on industry and logistics, aiming to become a regional logistics hub with air, road, and rail links to neighboring countries, Europe, and the Persian Gulf.",
        "• The Ma'an SEZ is primarily industrial, targeting domestic demand and reducing reliance on imports.",
        "• With a national rail system under construction, Jordan anticipates significant trade growth, positioning itself as a trade hub for the Levant and the broader Middle East region due to its strategic geography and natural resources."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:27.619198",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 11
    },
    {
      "section_number": "2.8",
      "section_name": "Telecoms and IT",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Telecommunications in Jordan is a billion-dollar industry, with core markets of fixed-line, mobile, and data services generating approximately JD836.5 million ($1.18 billion) annually, accounting for about 13.5% of the country's GDP.",
        "• Jordan's IT sector is the most developed and competitive in the Middle East region, a status achieved following the 2001 liberalization of the telecom sector.",
        "• The mobile telecommunications market in Jordan is highly competitive, with market share distribution among three main operators: Zain (owned by MTC Kuwait) holding 39%, Orange (owned by France Telecom) with 36%, and Umniah (96% owned by Bahrain's Batelco) with 25%.",
        "• End-of-year 2007 data indicated a trend toward market parity, with Zain's market share decreasing from 47% in 2006, while Orange and Umniah gained subscribers, reflecting increased competition.",
        "• The intensified competition in the telecom sector has resulted in more favorable pricing for consumers.",
        "• Mobile phone penetration in Jordan is approximately 80%.",
        "• Since 2000, Jordan has implemented ambitious national strategies for ICT development, initiated as private sector efforts led by the Jordanian monarchy.",
        "• The Information Technology Association in Jordan (int@j) was established to facilitate private sector involvement in preparing Jordan for the digital economy, focusing on automation and modernization in collaboration with the Ministry of Information Technology (MOICT).",
        "• The latest ICT strategy aims to extend until 2011, targeting specific national objectives, including sector growth and societal penetration.",
        "• The ICT sector contributes over 14% to Jordan's GDP indirectly, encompassing foreign investment and domestic revenue.",
        "• Employment in the ICT sector grew to approximately 60,000 indirect jobs by 2008, with the government actively working to address employment and educational issues through ICT training and opportunities.",
        "• Policy objectives for the next three years include nearly doubling the sector's size to $3 billion and increasing internet user penetration to 50%.",
        "• Karim Kawar, the founder and first chairman of int@j, played a key role in establishing the organization and driving national ICT strategic objectives, alongside influential figures such as Marwan Juma (Jordan's Minister of ICT), Doha Abdelkhaleq (labor and education), Humam Mufti (advocacy), and Nashat Masri (capital and finance).",
        "• Jordan's robust ICT infrastructure has made it an attractive location for startups specializing in web development, mobile applications, online services, and IT business investments.",
        "• The Jordanian IT industry experienced a significant boost after the Gulf War of 1991, driven by a large influx of Gulf expatriates, particularly from Kuwait, numbering in the hundreds of thousands, which positively impacted Jordan's IT sector development."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:34.853302",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 12
    },
    {
      "section_number": "2.9",
      "section_name": "Energy",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Energy is considered perhaps the biggest challenge for Jordan's continued economic growth, driven by fluctuating oil prices and resource limitations.",
        "• The peak price of oil reached over $145 per barrel, prompting the Jordanian government to implement an ambitious sector development plan.",
        "• Jordan's energy strategy involves a $14 billion investment program aimed at reducing dependence on imports, which currently account for 96% of energy needs.",
        "• The plan targets renewable energy sources to meet 10% of Jordan's energy demand by 2020 and nuclear energy to supply 60% of energy needs by 2035.",
        "• In 2007, the Jordanian government announced plans to scale back subsidies in several sectors, including energy, where historically fuel and electricity subsidies have been regressive.",
        "• The government is opening the energy sector to competition by offering all new energy projects through international tenders.",
        "• Unlike most neighboring countries, Jordan has no significant domestic petroleum resources and relies heavily on imports to meet energy needs.",
        "• In 2002, Jordan's proved oil reserves totaled only 445,000 barrels (70,700 m³).",
        "• Oil production in Jordan was only 40 barrels per day (6.4 m³/d) in 2004, while domestic consumption was estimated at 103,000 barrels per day (16,400 m³/d).",
        "• According to U.S. government data, Jordan's oil imports reached about 100,000 barrels per day (16,000 m³/d) in 2004.",
        "• The 2003 Iraq invasion disrupted Jordan's primary oil supply route from Iraq, which previously provided highly discounted crude oil via overland truck routes under Saddam Hussein.",
        "• Since late 2003, Jordan established an alternative oil supply route via tanker through the Port of Aqaba; Saudi Arabia is now the primary source of imported oil, with Kuwait and the UAE as secondary sources.",
        "• Supplies from Saudi Arabia and the UAE are subsidized to some extent, although not as heavily discounted as Iraqi crude oil.",
        "• Due to high oil costs, Jordan has shown increased interest in exploiting its oil shale resources, estimated at approximately 40 billion tons, with about 4 billion tons believed recoverable.",
        "• Jordan's oil shale could produce around 28 billion barrels (4.5 km³) of oil, enabling an estimated production of about 100,000 barrels per day (16,000 m³/d).",
        "• Jordan possesses the fourth largest oil shale reserves in the world, with several companies negotiating with the government for exploitation, including Royal Dutch Shell, Petrobras, and Eesti Energia.",
        "• Natural gas usage is increasing for domestic energy needs, especially electricity generation, with modest reserves estimated at about 6 billion cubic meters in 2002, though recent estimates suggest higher reserves.",
        "• In 2003, Jordan produced and consumed approximately 390 million cubic meters of natural gas, primarily from the Risha gas field in the eastern part of the country.",
        "• Until the early 2010s, Jordan imported most of its natural gas via the Arab Gas Pipeline from Egypt, which supplied about 1 billion cubic meters annually, linking from the Al Arish terminal through Aqaba to northern Jordan.",
        "• Gas imports from Egypt were halted in 2013 due to insurgent activities in Sinai and domestic gas shortages in Egypt.",
        "• To compensate, Jordan built a liquefied natural gas (LNG) terminal at the Port of Aqaba to facilitate imports.",
        "• In 2017, a low-capacity pipeline from Israel was completed, supplying the Arab Potash factories near the Dead Sea.",
        "• As of 2018, a large-capacity pipeline from Israel under construction in northern Jordan is expected to begin operation by 2020, supplying approximately 3 billion cubic meters (BCM) of gas annually, covering most of Jordan's natural gas needs.",
        "• The National Electric Power Company (NEPCO), a state-owned entity, produces approximately 94% of Jordan's electricity.",
        "• Since the mid-2000s, privatization efforts have aimed to increase independent power generation, including a new 450 MW power plant near Amman operated by a Belgian firm.",
        "• Major power plants include Az Zarqa (400 MW) and Al Aqaba (650 MW), which are primary electricity providers.",
        "• In 2003, Jordan consumed nearly 8 billion kilowatt-hours (kWh) of electricity, producing 7.5 billion kWh, with production increasing to 8.7 billion kWh in 2004.",
        "• Electricity demand is projected to grow annually by about 5%, necessitating continued expansion of production capacity.",
        "• Approximately 99% of the Jordanian population has access to electricity."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:41.090079",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 29
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 13
    },
    {
      "section_number": "2.10",
      "section_name": "Transport",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The transportation sector in Jordan contributes approximately 10% to the country's Gross Domestic Product (GDP).",
        "• In 2007, transportation and communications sectors collectively accounted for $2.14 billion.",
        "• Recognizing the sector's critical role in Jordan's service and industry-oriented economy, the government formulated a new national transport strategy in 2008 aimed at improving, modernizing, and further privatizing the sector.",
        "• Due to the ongoing security crisis in Iraq, with no immediate solution in sight, the prospects for Jordan's transport sector remain positive.",
        "• Jordan is expected to continue serving as a major transit hub for both goods and people destined for Iraq.",
        "• The number of tourists visiting Jordan is projected to increase steadily.",
        "• Key upcoming developments in Jordan’s transport infrastructure include the relocation of Aqaba's main port, the development of a national railway system, and the construction of a new terminal at Queen Alia International Airport (QAIA).",
        "• Volatility in fuel prices is almost certain to negatively impact operational costs within the sector, potentially hindering the sector’s average annual growth rate of around 6%.",
        "• Despite the risks associated with fluctuating fuel prices, such volatility provides incentives to boost private investments in alternative transportation modes, such as public buses and improved train services."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:45.280482",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 14
    },
    {
      "section_number": "2.11",
      "section_name": "Media and advertising",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Despite the continued influence of the Jordanian state, the country's media sector has experienced significant privatization and liberalization efforts in recent years.",
        "• According to research firm Ipsos, based on official rack rates, the advertising sector in Jordan spent approximately $280 million on publicity across media outlets.",
        "• Of the total advertising expenditure, 80% was allocated to newspapers, with the remaining funds directed towards television, radio, and magazines.",
        "• The most notable event in 2007 was the cancellation of the launch of ATV, which was set to be Jordan's first private broadcaster, thereby maintaining Jordan TV (JTV), a state-owned entity, as the country's sole broadcaster.",
        "• In recent years, Jordan has experienced a remarkable increase in the number of blogs, websites, and news portals, contributing to a diversification of news sources.",
        "• This diversification is viewed positively as it is expected to enhance advertising revenues and foster private sector initiatives within the media landscape.",
        "• The advertising industry in Jordan recorded a growth rate of 30% in 2007, marking another outstanding year after nearly a decade of double-digit growth.",
        "• Following this period of rapid expansion, most publicity specialists anticipated a slowdown in growth during 2008.",
        "• Unlike 2007, no major advertising campaigns were planned for the first half of 2008, indicating a potential market stabilization or slowdown.",
        "• Jordanian advertising expenditure has historically lagged behind regional averages, and the sector has been catching up in terms of per capita expenditure.",
        "• As the advertising sector matures, a gradual decrease in growth rates is considered normal.",
        "• From 2000 to 2007, total advertising expenditure increased from $77 million to $280 million, representing a 260% increase over this period.",
        "• In 2007, the Jordanian telecommunications sector was the largest advertising spender, accounting for approximately 20% of the total market.",
        "• The banking and finance sector was the second-largest spender with 12%, followed by the services industry at 11%, real estate at 8%, and the automotive sector at 5%.",
        "• Looking ahead, especially if an economic downturn occurs, it will be increasingly important for the advertising sector to develop vocational training programs and to leverage emerging media markets effectively."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:54:51.736133",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 15
    },
    {
      "section_number": "2.12",
      "section_name": "Services",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2004, the services sector contributed more than 70% to Jordan's gross domestic product (GDP).",
        "• As of 2002, the services sector employed nearly 75% of Jordan's labor force.",
        "• Jordan's banking system comprises 25 commercial banks, three Islamic banks, and nine foreign banks, with total assets amounting to Jordanian dinar (JOD) 57 billion, approximately EUR 69.6 billion.",
        "• Between 2010 and 2020, the banking sector's total assets increased by an average of 5%, driven primarily by a 7% growth in lending activities.",
        "• The Jordanian banking sector is regarded as advanced both regionally and internationally.",
        "• In 2007, the total profits of the 15 listed banks increased by 14.89%, reaching JD 640 million (approximately USD 909 million).",
        "• Jordan experienced a 6% economic growth in 2007, which was reflected in a 20.57% expansion of net credit to JD 17.9 billion (USD 25.4 billion) by year's end.",
        "• The most significant improvements in the banking sector in 2007 occurred in trade, construction, and industry sectors.",
        "• Many banks faced challenges due to the sharp correction in the Amman Stock Market in 2006, prompting a strategic focus on core banking activities in 2007.",
        "• Net interest and commission income rose by 16.65% in 2007, reaching JD 1.32 billion (USD 1.87 billion).",
        "• The stock market recovery in 2007 contributed to a decrease in total portfolio income losses.",
        "• Despite its small size by global standards, Jordan's banking sector attracted considerable interest from regional investors in Lebanon and the Gulf Cooperation Council (GCC) countries.",
        "• New regulations introduced by the Central Bank of Jordan (CBJ), along with political stability, fostered a favorable environment for investment.",
        "• Conservative banking policies helped Jordan avoid the 2008 global financial crisis, with Jordanian banks being among the few to post profits in 2009.",
        "• The banking sector's profitability was temporarily impacted by the COVID-19 pandemic in 2020 but recovered to pre-pandemic levels by 2021.",
        "• The non-performing loan (NPL) ratio in Jordan's banking sector remained steady at 5.5% during the COVID-19 pandemic.",
        "• A 2021 survey indicated limited impact of COVID-19 on credit supply, with approximately two-thirds of banks reporting constant or increasing loan availability.",
        "• About 50% of banks reported an increase in loan supply to small and medium-sized enterprises (SMEs), while for corporate clients, the increase was 25%.",
        "• 90% of banks believed the pandemic would influence the digitization of internal processes, with 81% expecting impacts on daily operations and 90% anticipating improvements in online banking services.",
        "• The construction sector contributed an estimated JD 477.5 million (USD 678.05 million), representing 4.25% of Jordan's GDP, in 2007.",
        "• The Greater Amman Municipality (GAM) completed its master plan for the capital, projecting growth from 700 km² to 1700 km² by 2025, with a shift from horizontal to vertical urban development due to high-rise clusters.",
        "• Major developments outside Amman include rapid residential expansion in Zarqa, transformation of Aqaba into a commercial and tourist hub, and the construction of high-end hotels and resorts along the Dead Sea.",
        "• Infrastructure projects underway include a new airport terminal, the Amman ring road, and a light rail system connecting Amman and Zarqa.",
        "• Despite a slowdown relative to previous years, Jordan's construction and real estate markets continued to grow in 2007, with total trading valued at JD 5.6 billion (USD 8 billion), up from JD 5.2 billion (USD 7.4 billion) in 2006.",
        "• Although rapid growth phases (75% in 2004 and 48% in 2005) have slowed, demand for real estate remains high due to population growth and Jordan's strategic location in the Middle East, making it an attractive destination for foreign investment, second-home buyers, and Jordanians abroad.",
        "• Several class-A office developments are under construction, but a supply-demand gap is expected to persist for several years; the retail market may become saturated in the short term, prompting developers to consider other cities for new supermarkets and malls.",
        "• Jordan's insurance market, with 29 companies serving a population of approximately 5.7 million, is considered saturated despite regulatory efforts to encourage mergers and acquisitions.",
        "• Market share based on premiums is distributed as follows: motor insurance 42.4%, medical insurance 18.6%, fire and property damage 17%, life insurance 9.8%, marine and transport 7.9%, and other insurance 4.3%.",
        "• The insurance sector contributed 2.52% to Jordan's GDP in 2006, up from 2.43% in 2005, with plans to increase this contribution to 7% in the short term and 10% in the long term.",
        "• The sector holds significant potential but remains underdeveloped due to regional price increases, low consumer understanding of insurance products, cultural and religious considerations, and rising living costs.",
        "• The IMF forecasted an inflation rate of 9% in 2008, while salaries remained unchanged, reducing disposable income for consumers.",
        "• Aside from mandatory motor coverage, insurance products are generally viewed as luxury items, with many Jordanians prioritizing other expenditures.",
        "• Future market changes are expected to be limited; industry stakeholders advocate for greater coordination among regulators and the legal system to improve insurance laws."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:05.456277",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 33
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 16
    },
    {
      "section_number": "2.13",
      "section_name": "Tourism",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The tourism sector in Jordan is widely considered to be operating below its potential, despite the country's rich historical heritage, including ancient ruins, a Mediterranean climate, and diverse geographical features.",
        "• The industry faces challenges due to regional political instability, which adversely affects tourism growth.",
        "• In 2004, over 5 million visitors entered Jordan, generating approximately US$1.3 billion in tourism earnings.",
        "• Tourism earnings increased to US$1.4 billion in 2005, indicating growth in the sector.",
        "• The majority of Jordan's tourists originate from other countries within the Middle East, which is viewed as a positive indicator for future industry growth, given Jordan's relative stability, openness, and safety compared to neighboring countries.",
        "• The tourism sector is a significant component of the Jordanian economy, directly employing around 30,000 Jordanians.",
        "• Tourism contributes approximately 10% to Jordan's Gross Domestic Product (GDP).",
        "• Despite a decline in Arab and Gulf tourists, 2007 experienced steady growth, with tourism revenues increasing by 13% to nearly US$2.11 billion during the first 11 months, up from US$1.86 billion in the same period of 2006.",
        "• The sector is overseen by the Jordanian government's National Tourism Strategy (NTS), established in 2004 with a target to guide industry development through 2010.",
        "• The NTS aimed to double tourism revenues during this period and to increase tourism-related employment to 91,719 jobs.",
        "• By 2007, the goal of doubling revenues was achieved, but increasing employment to over 90,000 remained a challenge, as employment grew from 23,544 in 2004 to 35,484 in 2007.",
        "• The growth in employment in the tourism sector from 2004 to 2007 was significant but less than half of the targeted 90,000 jobs.",
        "• The NTS seeks to position Jordan as a boutique destination targeting high-end tourists.",
        "• The strategy identifies seven niche markets: cultural heritage (archaeology), religion, ecotourism, health and wellness, adventure tourism, meetings, incentives, conventions, and exhibitions (MICE), and cruises.",
        "• The Jordan Tourism Board (JTB) increased its marketing budget from JD6 million (approximately US$8.52 million) to JD11.5 million (approximately US$16.3 million) in the past year.",
        "• The tourism industry in Jordan has experienced steady growth over recent years, with ongoing major projects aimed at further development.",
        "• Despite positive trends, the sector requires improvements in infrastructure and marketing to sustain growth.",
        "• The COVID-19 pandemic caused a 1.6% decline in Jordan's real GDP in 2020, with tourism being a primary transmission route of the economic crisis.",
        "• Tourism accounts for about 40% of Jordan's export receipts and between 10% and 15% of its GDP.",
        "• Jordan hosts approximately 3.8 million international tourists annually.",
        "• The sector's contribution to GDP decreased to 3% in 2020 due to the pandemic.",
        "• The recovery of Jordan's tourism sector from the COVID-19 pandemic is expected to be slow."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:11.906912",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 17
    },
    {
      "section_number": "3",
      "section_name": "External trade",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since 1995, Jordan's economic growth has been notably low, with real GDP increasing at an average annual rate of approximately 1.5%.",
        "• The official unemployment rate in Jordan has remained steady at around 14%, with unofficial estimates suggesting the actual rate may be approximately double this figure.",
        "• Jordan's budget deficit and public debt levels have been persistently high and have continued to widen over this period.",
        "• Despite fiscal challenges, inflation in Jordan has remained low, primarily due to a stable monetary policy and the country's continued peg of its currency to the United States Dollar.",
        "• Exports of manufactured goods in Jordan have experienced a robust growth rate of about 9% annually.",
        "• Monetary stability in Jordan was maintained even during regional tensions in 1998 and through the illness and subsequent death of King Hussein in 1999.",
        "• Expectations that Jordan's peace treaty with Israel would boost trade and tourism proved disappointing, as security-related restrictions significantly hindered trade with the West Bank and Gaza Strip, leading to a substantial decline in exports to these areas.",
        "• Following King Abdullah's ascension, Jordan improved diplomatic relations with Arab states of the Persian Gulf and Syria; however, these diplomatic efforts yielded limited tangible economic benefits.",
        "• Recent Jordanian economic strategies have focused on achieving World Trade Organization (WTO) membership and establishing a Free Trade Agreement with the United States to promote export-led growth."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:16.616574",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 18
    },
    {
      "section_number": "4",
      "section_name": "Investment",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2005, the stock market capitalization of listed companies in Jordan was valued at $37.639 billion, according to data provided by the World Bank."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:17.946848",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 1
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 19
    },
    {
      "section_number": "5",
      "section_name": "Salaries",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The 2015 Middle East and North Africa Salary Survey was conducted by Bayt.com.",
        "• According to the survey, 49% of respondents from the Gulf Cooperation Council (GCC) expressed satisfaction with the salary raises they received in 2014.",
        "• In comparison, 42% of respondents from the Levant region reported being satisfied with their 2014 salary raises."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:19.583862",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 20
    },
    {
      "section_number": "6",
      "section_name": "Aqaba Special Economic Zone",
      "chapter_name": "Economy of Jordan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The population of Aqaba is approximately 100,000 people, with projections indicating it will double over the next 10 years.",
        "• Aqaba benefits from strategic natural advantages due to its location at the southern tip of Jordan, situated between Saudi Arabia and Israel on the shores of the Red Sea.",
        "• The city is in close proximity to the Suez Canal, providing easy access to major trade centers across the Middle East and Africa.",
        "• Aqaba is Jordan's only deep-water port town, occupying most of the country's limited 27 km (17 miles) of coastline.",
        "• The Aqaba Special Economic Zone (ASEZ) was established in 2001 and has been the primary driver of the region’s development.",
        "• The ASEZ covers an area of 375 square kilometers and offers various incentives including tax and tariff benefits, full repatriation rights, and more flexible operating regulations.",
        "• Incentives within ASEZ include a flat 5% tax on most economic activities, no tariffs on imported goods, no currency restrictions, and no property taxes for corporate land.",
        "• Companies operating in ASEZ are permitted to employ up to 70% foreign workers, a policy that has been somewhat controversial given Jordan’s historical unemployment issues.",
        "• Jordan’s national investment profile has been growing, but the ASEZ has surpassed expectations, exceeding investment targets by 33%.",
        "• By 2006, the ASEZ had attracted approximately $8 billion in investment, which was about $2 billion more than the original goal of $6 billion projected for 2020.",
        "• The ASEZ aims to attract an additional $12 billion in investment across sectors such as tourism, finance, and industry.",
        "• The 2008 Development Law established a universal framework for special development zones modeled after the Aqaba experience, promoting similar economic initiatives nationwide."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T09:55:23.582201",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_jordan.json",
      "original_index": 21
    }
  ]
}