{
  "extraction_info": {
    "source_file": "economy_of_samoa.json",
    "extraction_timestamp": "2025-08-02T17:13:28.814144",
    "total_sections_in_source": 9,
    "extracted_sections_count": 9,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Samoa is primarily dependent on agricultural exports, development aid, and private financing from overseas sources.",
        "• Samoa is highly vulnerable to natural disasters including devastating storms, earthquakes, and tsunamis, which impact its economic stability.",
        "• Agriculture employs approximately two-thirds of Samoa’s labor force and contributes 9% to the country’s export earnings.",
        "• Key agricultural export products include coconut cream, coconut oil, and copra.",
        "• The manufacturing sector in Samoa is limited, with the exception of a large automotive wire harness factory; most manufacturing activities focus on processing agricultural products.",
        "• Tourism is a growing sector in Samoa, with visitor numbers increasing from more than 70,000 tourists in 1996 to 120,000 tourists in 2014.",
        "• The Samoan Government has advocated for deregulation of the financial sector, promotion of investment, and maintenance of fiscal discipline to support economic development.",
        "• Economic observers highlight the flexibility of Samoa’s labor market as a fundamental strength that could facilitate future economic progress."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:34.148527",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Trade",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• New Zealand is Samoa's principal trading partner, supplying between 35% and 40% of Samoa's imports and purchasing 45% to 50% of its exports.",
        "• Other significant trading partners for Samoa include Australia, American Samoa, the United States, and Fiji.",
        "• Samoa's main imports consist of food and beverages, industrial supplies, and fuels.",
        "• The primary sector, which includes agriculture, forestry, and fishing, employs nearly two-thirds of Samoa's labor force and contributes 17% to the country's Gross Domestic Product (GDP).",
        "• Samoa's principal exports are refined petroleum, fish, and coconut products.",
        "• Fishing activities in Samoan waters have achieved some success; however, the largest fisheries industry, led by companies Van Camp and StarKist, has been based in American Samoa.",
        "• StarKist Management announced plans to establish a blast-freezer project in Asau, Samoa, expected to be operational by 2002.",
        "• This announcement by StarKist dispelled growing suspicions regarding the company's genuine intentions to relocate operations to Samoa.",
        "• The proposed blast-freezer facility in Asau was anticipated to revitalize the village economically and socially."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:34.106842",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Non-conventional sources of revenue",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Samoa receives significant annual financial assistance from abroad, which constitutes an important component of its economy.",
        "• More than 100,000 Samoans living overseas contribute two primary sources of revenue to Samoa: direct remittances and tourism.",
        "• Direct remittances from the Samoan expatriate community have recently amounted to approximately $12.1 million per year.",
        "• The expatriate Samoan community accounts for more than half of all tourist visits to Samoa, highlighting their dual role in revenue generation.",
        "• In addition to private remittances and tourism, Samoa receives roughly $28 million annually in official development assistance.",
        "• Major contributors to Samoa’s official development assistance include China, Japan, Australia, and New Zealand, which lead the sources of this aid.",
        "• The combined revenue from tourism, private transfers (remittances), and official transfers enables Samoa to manage and cover its persistently large trade deficit.",
        "• In the late 1960s, Potlatch Forests, Inc., a U.S.-based company, undertook significant infrastructure upgrades in Samoa, specifically at the harbour and airport in Asau on the northern coast of Savai'i.",
        "• Potlatch Forests, Inc. established a timber operation called Samoa Forest Products focused on harvesting tropical hardwoods.",
        "• The company invested approximately US$2,500,000 in constructing a state-of-the-art sawmill at Asau.",
        "• Over several years, Potlatch invested an additional US$6,000,000 to develop essential infrastructure for their facility, including power, water supply, and haul roads.",
        "• During the 1960s and 1970s, Asau, with the operations of Potlatch sawmillers and Samoa Forest Products, was one of the busiest and most economically active areas on the island of Savai'i.",
        "• The departure of Potlatch Forests, Inc. and the subsequent scaling down of the sawmill operations have led to a significant economic decline in Asau, resulting in the area becoming a ghost town in recent years."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:40.141089",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2018, Samoa produced a total of 180 thousand tons of coconut, making it the largest agricultural product by volume for that year.",
        "• The production of taro in Samoa in 2018 amounted to 25 thousand tons, representing a significant staple crop in the country’s agriculture.",
        "• Banana production in Samoa reached 22 thousand tons in 2018, indicating its importance among the island’s fruit crops.",
        "• Samoa produced 6.6 thousand tons of yam in 2018, contributing to the diversity of root crops cultivated in the nation.",
        "• Pineapple production in Samoa was recorded at 4.6 thousand tons in 2018, reflecting its role in the country’s fruit agriculture sector.",
        "• The combined production of mango, mangosteen, and guava in Samoa totaled 4.1 thousand tons in 2018, highlighting these fruits as notable agricultural products.",
        "• Papaya production in Samoa in 2018 was 3.4 thousand tons, adding to the variety of tropical fruits grown in the country.",
        "• Besides the major crops listed, Samoa also produced smaller quantities of various other agricultural products in 2018, contributing to the overall agricultural output."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:36.147446",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Until 2017, the industrial sector in Samoa accounted for over one-quarter of the country's Gross Domestic Product (GDP) while employing less than 6% of the total workforce.",
        "• The largest industrial enterprise in Samoa was Yazaki Samoa, a Japanese-owned company specializing in the processing of automotive wire harnesses for export to Australia.",
        "• Yazaki Samoa operated under a concessional market-access arrangement, facilitating its export activities.",
        "• The Yazaki plant employed more than 2,000 workers, representing a significant portion of Samoa's manufacturing labor force.",
        "• Yazaki Samoa contributed over 20% of the total output of the manufacturing sector in Samoa.",
        "• The company’s net receipts ranged annually between $1.5 million and $3.03 million.",
        "• Despite its substantial production, shipments from Yazaki were classified as services (export processing) rather than merchandise exports, and thus did not officially appear in Samoa’s merchandise export statistics.",
        "• In 2017, Yazaki Samoa ceased operations and closed down its plant.",
        "• In the same year, Fero, a New Zealand-based manufacturer producing wiring units, established operations in Samoa, utilizing the former Yazaki plant."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:32.665358",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Natural disasters",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In the early 1990s, Samoa experienced three significant natural disasters whose effects were largely overcome by the mid-1990s, although economic growth subsequently slowed due to a regional economic downturn.",
        "• Long-term economic development in Samoa is contingent upon upgrading tourist infrastructure, attracting foreign investment, and further diversifying the economy.",
        "• Two major cyclones struck Samoa in the early 1990s: Cyclone Ofa in February 1990, which left an estimated 10,000 islanders homeless, and Cyclone Val in December 1991, which caused 13 deaths and inflicted hundreds of millions of dollars in damage.",
        "• The impact of Cyclones Ofa and Val led to a nearly 50% decline in Samoa’s gross domestic product (GDP) between 1989 and 1991.",
        "• Samoa’s vulnerability as a low-lying island state heightens its concern about the effects of global climate change.",
        "• In 1994, Samoa faced additional economic challenges including an outbreak of taro leaf blight and the near collapse of Polynesian Airlines, the national carrier.",
        "• Taro, a root crop, was traditionally Samoa’s largest export, accounting for more than 50% of all export revenue in 1993; however, the fungal blight devastated taro crops, reducing taro exports to less than 1% of export revenue annually since 1994.",
        "• Polynesian Airlines experienced a financial crisis in 1994, which disrupted the tourism industry and necessitated a government bailout to stabilize operations.",
        "• The Samoan government responded to these economic shocks with a major program focused on road construction and post-cyclone infrastructure repair.",
        "• Economic reforms were intensified, including the liberalization of exchange controls, to support recovery and growth.",
        "• Following these interventions, Samoa’s GDP growth rebounded to over 6% in both 1995 and 1996 before slowing again toward the end of the 1990s."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:38.706885",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 5
    },
    {
      "section_number": "6",
      "section_name": "Future prospects",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The collapse of taro exports in 1994 due to taro leaf blight led to a modest diversification of Samoa's export products and markets.",
        "• Before the taro leaf blight, Samoa's exports were primarily taro valued at $1.1 million, coconut cream at $540,000, and other products totaling $350,000.",
        "• At that time, 90% of Samoa's exports were directed to the Pacific region, with only 1% going to European markets.",
        "• Following the collapse, Samoa's exporters increased production of copra, coconut oil, and fish as alternative export products.",
        "• In 1993, copra, coconut oil, and fish combined generated less than $100,000 in export revenue, but this figure rose to over $3.8 million after diversification efforts.",
        "• There has been a notable shift in export markets, with European countries now receiving nearly 15% of Samoa's exports, up from 1%.",
        "• Despite diversification, Samoa's exports remain concentrated in coconut products, including copra, copra meal, coconut oil, and coconut cream, which together accounted for $2.36 million in export value.",
        "• Fish exports also represent a significant portion, valued at $1.51 million, contributing to the increased diversity of Samoa's export portfolio."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:39.478671",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 6
    },
    {
      "section_number": "7",
      "section_name": "Tourism",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1972, Samoa received over 85,000 visitors, generating more than $12 million in revenue for the local economy.",
        "• Of the visitors in 1972, one-third originated from American Samoa, 28% from New Zealand, and 11% from the United States.",
        "• Visitor arrivals increased in the year 2000 as tourists to the South Pacific chose Samoa over Fiji due to political unrest in Fiji.",
        "• Between 2007 and 2016, both tourism numbers and revenue in Samoa more than doubled, indicating significant growth in the sector.",
        "• In 2007, Samoa recorded 122,000 visitors, which increased to 145,176 visitors by 2016.",
        "• In 2016, approximately 46% of tourists came from New Zealand, 20% from Australia, and 7% from the United States.",
        "• Samoans living overseas represented about 33% of all tourists visiting Samoa during this period.",
        "• In response to the COVID-19 pandemic in 2020, Samoa implemented a ban on all international flights, both inbound and outbound, to control the spread of the virus.",
        "• The service sector in Samoa contributes to more than 50% of the country’s Gross Domestic Product (GDP).",
        "• Approximately 30% of Samoa’s labor force is employed within the service sector, highlighting its importance to the national economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:39.802774",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 7
    },
    {
      "section_number": "8",
      "section_name": "Statistics",
      "chapter_name": "Economy of Samoa",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Samoa's GDP based on purchasing power parity was estimated at US$1.137 billion in 2017.",
        "• The real GDP growth rate for Samoa in 2017 was estimated at 2.5%.",
        "• Samoa's GDP per capita, measured by purchasing power parity, was approximately $5,700 in 2017.",
        "• The composition of Samoa's GDP by sector in 2017 was 10.4% agriculture, 23.6% industry, and 66% services.",
        "• Data on the percentage of the population below the poverty line in Samoa is not available (NA%).",
        "• Household income or consumption distribution data for the lowest and highest 10% income groups in Samoa is not available (NA%).",
        "• Samoa experienced an inflation rate of 1.3% in consumer prices in 2017.",
        "• The labor force in Samoa was estimated at 50,700 individuals in 2016.",
        "• Labor force distribution by occupation in Samoa in 2015 was 65% in agriculture, 6% in industry, and 29% in services.",
        "• The unemployment rate in Samoa was estimated at 5.2% in 2017.",
        "• Samoa ranked 98th in the Ease of Doing Business Index.",
        "• The national budget for fiscal years 2011–2012 recorded revenues of $110 million and expenditures of $122 million.",
        "• Key industries in Samoa include tourism, food processing, auto parts manufacturing, and building materials production.",
        "• Industrial production growth rate in Samoa was estimated at 5.3% in 2010.",
        "• Samoa’s electricity production was 200 GWh in 2010.",
        "• Electricity production by source in Samoa in 2008 consisted of 60% fossil fuels and 40% hydroelectric power, with no nuclear or other sources.",
        "• Electricity consumption in Samoa was 150 GWh in 2008.",
        "• Samoa’s electricity exports were minimal, recorded at 1 kWh in 2008.",
        "• Samoa did not import electricity in 2008, with imports recorded at 0 kWh.",
        "• Major agricultural products in Samoa include coconuts, bananas, taro, yams, coffee, and cocoa.",
        "• Samoa’s exports were valued at $152 million (f.o.b.) in 2012.",
        "• Principal export commodities from Samoa included coconut oil and cream, copra, fish, and beer.",
        "• Samoa’s main export partners in 2012 were American Samoa, Australia, New Zealand, the United States, and Germany.",
        "• Imports to Samoa totaled $258 million (f.o.b.) in 2012.",
        "• Major import commodities included machinery, equipment, and foodstuffs.",
        "• Samoa’s primary import partners were Australia, New Zealand, Japan, Fiji, and the United States.",
        "• Samoa’s external debt was estimated at $145 million in 2010.",
        "• Samoa received economic aid amounting to $24.3 million in 2010.",
        "• The currency of Samoa is the tala (WS$), subdivided into 100 sene.",
        "• Exchange rates of the tala to the US dollar were 3.0460 WS$ per US$1 in January 2000, 3.0120 in 1999, 2.9429 in 1998, 2.5562 in 1997, 2.4618 in 1996, and 2.4722 in 1995.",
        "• Samoa’s fiscal year corresponds to the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:54:43.212249",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 31
      },
      "source_file": "economy_of_samoa.json",
      "original_index": 8
    }
  ]
}