{
  "extraction_info": {
    "source_file": "economy_of_montenegro.json",
    "extraction_timestamp": "2025-08-02T17:13:28.406384",
    "total_sections_in_source": 16,
    "extracted_sections_count": 16,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Montenegro is characterized as a transition economy focused on stabilizing, diversifying, and expanding its economic output.",
        "• Montenegro’s economic development has been significantly influenced by the aftermath of the Yugoslav Wars, which disrupted regional stability and economic activity.",
        "• Following the dissolution of Yugoslavia, Montenegro experienced a decline in industrial production, contributing to economic challenges.",
        "• The country faced economic sanctions imposed by the United Nations during the post-Yugoslav period, further impacting its economic performance.",
        "• Montenegro became a member of the World Trade Organization (WTO) in 2012, marking a significant step in integrating into the global trading system.",
        "• On 5 June 2017, Montenegro joined the North Atlantic Treaty Organization (NATO), reflecting its strategic geopolitical alignment and security commitments."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:22.316930",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "History",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Montenegro was established as a relatively small principality in 1852, with an economy initially entirely based on agriculture.",
        "• The country began developing an industrial economy around the turn of the 20th century, marking a shift from its agricultural roots.",
        "• Economic growth during this period was constrained by several factors, including Montenegro's small population, scarcity of raw materials, an underdeveloped transportation network, and relatively low levels of both domestic and international investment.",
        "• The earliest industrial enterprises established in Montenegro included wood mills, an oil refinery, a brewery, salt works, and electric power plants, representing the initial diversification of the economy.",
        "• Montenegro’s economic development was repeatedly disrupted by major conflicts, specifically the First Balkan War (1912–1913), World War I (1914–1918), and World War II (1939–1945).",
        "• Despite efforts toward industrialization, agriculture remained the dominant sector of Montenegro's economy throughout the first half of the 20th century."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:27.130905",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "The Yugoslav era",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Montenegro's economy underwent significant development after World War II as it became integrated into the Socialist Federal Republic of Yugoslavia.",
        "• During this period, Montenegro experienced rapid urbanization and industrialization, transforming its economic landscape.",
        "• The industrial sector in Montenegro encompassed several key areas, including electricity generation, steel production, and aluminum manufacturing.",
        "• Coal mining was a prominent industry, contributing to the energy and raw material supply within the republic.",
        "• Forestry and wood processing industries were also important components of Montenegro's industrial economy.",
        "• The textile industry and tobacco manufacturing played notable roles in the country's industrial output.",
        "• By the late 1980s, international trade had become increasingly significant to Montenegro's economy.",
        "• Shipping emerged as a vital sector, leveraging Montenegro's Adriatic coastline for economic growth.",
        "• Tourism developed into an important industry by the late 1980s, contributing to the diversification of Montenegro's economic activities."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:31.533426",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 2
    },
    {
      "section_number": "1.2",
      "section_name": "Post-Yugoslavia",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the dissolution of Yugoslavia in the early 1990s, Montenegro's entire industrial production system effectively collapsed, resulting in shortages of many goods and a significant increase in their prices.",
        "• Due to Montenegro's political alliance with Serbia during the 1990s and its favourable geographic location, including access to the Adriatic Sea and a shipping link to Albania across Lake Skadar, the country became a central hub for smuggling activities.",
        "• Smuggling of petrol and cigarettes became particularly prevalent in Montenegro throughout the 1990s, evolving into a de facto legalised practice within the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:34.812316",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 3
    },
    {
      "section_number": "1.3",
      "section_name": "Dissolution of State Union with Serbia",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1997, Milo Đukanović assumed leadership of Montenegro's ruling party, the Democratic Party of Socialists of Montenegro, initiating a process of political separation from Serbia.",
        "• Milo Đukanović attributed the decline of Montenegro's economy to the policies implemented by Serbian President Slobodan Milošević.",
        "• Due to resurgent inflation, the Montenegrin government implemented a policy of \"dollarization,\" adopting the German mark as the dominant currency to stabilize the economy.",
        "• These economic reforms contributed to a redefinition of the political relationship between Montenegro and Serbia in 2003, transitioning from a federal republic to a looser political union known as Serbia and Montenegro.",
        "• Under the 2003 arrangement, the Montenegrin government gained autonomy over its own economic policies, marking a significant shift in governance.",
        "• The political union between Serbia and Montenegro was short-lived, culminating in a referendum held on 21 May 2006, in which the people of Montenegro voted to declare independence from Serbia."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:40.148771",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 4
    },
    {
      "section_number": "2",
      "section_name": "Current economy",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the independence referendum, Montenegro's economy has shifted focus towards its service sector, aiming to establish itself as an elite tourist destination while simultaneously navigating the process of joining the European Union.",
        "• The Montenegrin government and stakeholders are actively attempting to attract foreign investors for large infrastructure projects, which are considered essential for the country’s development as a premier tourist destination.",
        "• Montenegro experienced a significant real estate boom during 2006 and 2007, characterized by wealthy buyers from Russia, Britain, and other countries purchasing property along the Montenegrin coast.",
        "• As of 2008, Montenegro received more foreign investment per capita than any other nation in Europe, highlighting its attractiveness to international investors during that period.",
        "• In the first half of 2012, Montenegro exported goods valued at €182.3 million, primarily metals, representing a 14.6% decrease compared to the same period in 2011.",
        "• The major export partners for Montenegro in the first half of 2012 included Croatia, Serbia, Bosnia and Herzegovina, and Hungary.",
        "• During the same period in 2012, Montenegro’s imports, mainly consisting of food, oil, and electrical energy, totaled €864.9 million, which was a 2.6% increase compared to the first half of 2011.",
        "• The primary import partners for Montenegro in the first half of 2012 were Serbia, Greece, and Bosnia and Herzegovina.",
        "• In 2022, the sector with the highest number of registered companies in Montenegro was the Services sector, with 15,496 companies.",
        "• The Retail Trade sector followed with 11,200 registered companies in 2022.",
        "• The Wholesale Trade sector was the third largest by number of registered companies in 2022, with 6,839 companies."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:45.064679",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 5
    },
    {
      "section_number": "2.1",
      "section_name": "Finance",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Central Bank of Montenegro was established in 2001 and subsequently adopted the euro as the official currency of Montenegro in March 2002.",
        "• Montenegro's banking sector features a substantial presence of foreign capital, indicating significant international investment and ownership within the financial institutions.",
        "• Banks operating in Montenegro offer a comprehensive range of services, including both retail and corporate banking products, consolidated under a single institution.",
        "• Most banks in Montenegro provide non-resident accounts, catering to both natural persons (individuals) and legal entities (corporations or organizations).",
        "• The Montenegro Stock Exchange was originally founded in 1993 and underwent a significant consolidation in 2011, merging to become the sole stock exchange in the country.",
        "• Ownership of the Montenegro Stock Exchange is distributed among various financial institutions, reflecting a collective investment by key players in the financial sector."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:48.839403",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 6
    },
    {
      "section_number": "2.2",
      "section_name": "Infrastructure",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the 2007 Great Recession, Montenegro experienced a slowdown in economic growth, resulting in the postponement of several key infrastructure projects including the development of Velika Plaža, Ada Bojana, Buljarica, Jaz Beach, the construction of the Bar-Boljare motorway, and new power plants.",
        "• The Port of Bar serves as Montenegro's primary maritime trade communication hub, specializing in the bulk shipment of commodities such as bauxite, other ores, grain, wood products, acetic acid, and petroleum derivatives.",
        "• In 2019, the Port of Bar's allowable draft was recorded at 12.8 meters, supporting significant maritime traffic and trade operations.",
        "• The port site includes several private storage tanks designed to facilitate and service the trade of various bulk goods.",
        "• Ro–Ro (roll-on/roll-off) traffic from the Italian ports of Bari and Ancona is managed through an operational quay at the Port of Bar, which measures 400 meters in length and has a water depth ranging between 4 meters and 5.9 meters."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:52.729397",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 7
    },
    {
      "section_number": "2.3",
      "section_name": "Industry",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Podgorica Aluminium Plant, originally constructed in 1969, was the largest single contributor to Montenegro's gross domestic product prior to the 2007 recession.",
        "• The economic downturn in 2007 significantly impacted the Podgorica Aluminium Plant's operations and financial stability.",
        "• In 2005, ownership of the Podgorica Aluminium Plant was transferred to En+ Group, a company controlled by Russian businessman Oleg Deripaska.",
        "• Following continued financial difficulties, the Podgorica Aluminium Plant declared bankruptcy in 2013.",
        "• In 2014, the bankrupt Podgorica Aluminium Plant was acquired by Uniprom, a company owned by Montenegrin local magnate Veselin Pejovic."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:44:55.903909",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 8
    },
    {
      "section_number": "2.4",
      "section_name": "Tourism",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Montenegro has a coastline measuring 300 kilometers, which is complemented by mountainous terrain, making it an attractive holiday destination.",
        "• The tourism sector contributes approximately 25% to Montenegro's Gross Domestic Product (GDP), highlighting its significant role in the national economy.",
        "• In 2020, the COVID-19 pandemic and associated restrictions caused Montenegro's GDP to decline by 15%, with the tourism sector experiencing notably high unemployment rates.",
        "• Following the downturn in 2020, Montenegro's tourism industry showed signs of recovery in 2021.",
        "• The Montenegrin government and stakeholders prioritize the development of luxurious and upscale tourism projects to attract high-end tourists.",
        "• To support this strategy, Montenegro actively encourages foreign investment aimed at establishing and enhancing tourism facilities."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:00.514374",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 9
    },
    {
      "section_number": "2.5",
      "section_name": "Energy",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Elektroprivreda Crne Gore (EPCG) is a predominantly state-owned company responsible for coal and power production and distribution in Montenegro, owning two large hydroelectric plants and one coal-powered thermal power plant.",
        "• Montenegro operates two wind power farms: the Krnovo Wind Farm and the Možura Wind Farm, which together generate a total capacity of 118 MW.",
        "• In June 2023, APCG secured €82 million in financing to construct the Gvozd Wind Farm, which is projected to generate 54.6 MW of electricity.",
        "• The Bijela Wind Farm, with a planned capacity of 118 MW, is under development following the acquisition of rights in 2023 by UAE-based Alcazar Energy, which plans to invest $200 million in building the facility.",
        "• In 2023, Montenegro exported approximately €200 million worth of electricity, an increase from €140 million in 2022, making electricity the country’s top export item."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:06.363425",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 10
    },
    {
      "section_number": "2.6",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In July 2006, prior to Montenegro's EU integration efforts, the Ministry of Agriculture, Forestry and Water Management produced a survey document for the EU-funded project titled _Agriculture and Rural Development Strategy of Montenegro_.",
        "• The Statistical Office of Montenegro only learned how to collect agricultural data in formats acceptable to the European Commission as late as November 2021.",
        "• Since 2010, agricultural trade relations between the EU and Montenegro have been governed by the EU-Montenegro Stabilisation and Association Agreement, allowing all agricultural products originating in Montenegro, except beef, sugar, and wine, to enter the EU duty-free.",
        "• The EU maintains a significant agri-food trade surplus with Montenegro, exporting meat, dairy products, and food preparations to Montenegro.",
        "• Montenegro primarily exports vegetables such as mushrooms, wine, and oils to the EU market.",
        "• According to a March 2019 report by the European Commission Directorate-General for Agriculture and Rural Development, agriculture accounts for 8% of Montenegro's GDP.",
        "• Agricultural land comprises 38% of Montenegro's total land area.",
        "• The coastal region of Montenegro cultivates olives and citrus fruits, while the central areas focus on seasonal vegetables and tobacco production.",
        "• In the northern part of Montenegro, farming is dominated by ungulates (hoofed animals).",
        "• The largest portion of agricultural land in Montenegro consists of pasture and grassland.",
        "• Montenegro became a member of the United Nations International Fund for Agricultural Development (IFAD) in 2015, which highlights that one-third of the country's population resides in rural areas.",
        "• In 2019, IFAD concentrated its activities on addressing key challenges such as improving connectivity and increasing productivity by: (i) facilitating the transition of micro and small agricultural holdings from subsistence-type farming to semi-commercial and commercial agriculture through investments in pro-poor rural infrastructure; (ii) promoting the aggregation of smallholders within inclusive value chain clusters; and (iii) supporting municipalities in deploying investments to foster inclusion across entire rural population sectors.",
        "• Between 2009 and 2019, the World Bank implemented the _Montenegro Institutional Development and Agriculture Strengthening Project_, which included several significant achievements: upgrading the food safety system to comply with EU standards; establishing a Border Inspection Post with veterinary and phyto-sanitary controls at the Port of Bar; creating an electronic farm register; completing classification procedures for farm and food establishments according to EU norms; and accrediting the Veterinary Diagnostic Laboratory in Podgorica with ISO 17025 analysis methods."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:16.490305",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 11
    },
    {
      "section_number": "2.7",
      "section_name": "Import and export statistics",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to World Bank data, Montenegro's annual imports in US dollars were 3.68 billion in 2018, slightly decreased to 3.60 billion in 2019, then dropped significantly to 2.91 billion in 2020, rebounded to 3.65 billion in 2021, and rose sharply to 4.63 billion in 2022.",
        "• Montenegro's exports, as reported by the World Bank, amounted to 2.36 billion US dollars in 2018, increased marginally to 2.43 billion in 2019, declined substantially to 1.24 billion in 2020, recovered to 2.51 billion in 2021, and further grew to 3.21 billion in 2022."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:20.788683",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 2
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 12
    },
    {
      "section_number": "3",
      "section_name": "Trade agreements",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Montenegro has established multiple free trade agreements with various countries, explicitly excluding Russia and Belarus from these agreements.",
        "• In 2007, Montenegro signed the Central European Free Trade Agreement (CEFTA), which facilitates free trade between Albania, North Macedonia, Moldova, UNMIK/Kosovo, Croatia, Serbia, and Bosnia and Herzegovina.",
        "• Montenegro’s free trade agreement with Turkey became effective in 2010, enabling tariff-free trade between the two countries.",
        "• In 2011, Montenegro entered into a free trade agreement with Ukraine, further expanding its trade partnerships.",
        "• Also in 2011, Montenegro signed an agreement with the European Free Trade Association (EFTA), granting free trade access alongside Switzerland, Norway, Iceland, and Liechtenstein with European Union countries.",
        "• Since 2003, Montenegro has held the Most-Favored Nation (MFN) status with the United States, ensuring non-discriminatory trade treatment between the two nations."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:25.807309",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 13
    },
    {
      "section_number": "4",
      "section_name": "Minimum wage",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The minimum wage in Montenegro remained at €288.10 per month for several years prior to 2019.",
        "• In 2019, the minimum wage experienced a modest increase, rising to €331.30 per month.",
        "• A significant increase occurred in 2022, when the minimum wage was raised to €532.50 per month.",
        "• The annual equivalent of the 2022 minimum wage was €6,390."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:28.571995",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 14
    },
    {
      "section_number": "5",
      "section_name": "Taxation",
      "chapter_name": "Economy of Montenegro",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The standard Value Added Tax (VAT) rate in Montenegro was set at 21% in 2022, with certain items subject to a reduced rate of 7%, aligning with European Union (EU) guidelines.",
        "• Beginning in 2023, Montenegro implemented a graduated personal income tax system where a 9% tax rate applies to gross monthly incomes exceeding €700, and a 15% tax rate applies to incomes above €1,000 per month.",
        "• In addition to national income tax rates, Montenegrin municipalities impose an income tax surcharge ranging from 13% to 15% of the national tax liability.",
        "• Social security contributions in Montenegro total 15.5% of income, with employees responsible for paying 6% of this amount."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:45:31.029625",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_montenegro.json",
      "original_index": 15
    }
  ]
}