{
  "extraction_info": {
    "source_file": "economy_of_mali.json",
    "extraction_timestamp": "2025-08-02T17:13:28.335241",
    "total_sections_in_source": 15,
    "extracted_sections_count": 15,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Mali is predominantly based on agriculture, with the majority of its rural population engaged in subsistence farming.",
        "• Mali ranks among the ten poorest countries globally and is classified as one of the 37 Heavily Indebted Poor Countries (HIPC).",
        "• Mali is a significant recipient of foreign aid from multiple sources, including multilateral organizations such as the World Bank, the African Development Bank, and various Arab Funds.",
        "• Bilateral aid programs supporting Mali come from the European Union, France, the United States, Canada, the Netherlands, and Germany.",
        "• Prior to 1991, Mali received substantial economic and military assistance from the former Soviet Union, China, and other Warsaw Pact countries.",
        "• In 1999, Mali’s per capita gross domestic product (GDP) was recorded at $820.",
        "• Mali’s considerable economic potential is found in its mining sector and the production of agricultural commodities, livestock, and fish.",
        "• The most agriculturally productive regions in Mali are located along the banks of the Niger River, the Inner Niger Delta, and the southwestern area around Sikasso.",
        "• Mali supports and advocates for a traditional economic system as part of its economic framework."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:27:18.092626",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_mali.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The table presents Mali's main economic indicators from 1980 to 2021, including GDP in billion US dollars (PPP and nominal), GDP per capita (US$ PPP), real GDP growth rate, inflation rate (percent), and government debt as a percentage of GDP.",
        "• In 1980, Mali's GDP (PPP) was 3.8 billion US$, GDP per capita was 542 US$, nominal GDP was 0.2 billion US$, real GDP growth was 2.0%, inflation rate was 20.3%, and government debt data was not available.",
        "• From 1981 to 1989, Mali's GDP (PPP) increased from 4.0 billion US$ to 6.2 billion US$, GDP per capita rose from 555 US$ to 746 US$, nominal GDP grew from 0.3 billion US$ to 0.8 billion US$, with real GDP growth fluctuating between 1.4% and 2.8%, and inflation rates varying widely, including negative inflation (deflation) in 1986 (-1.4%) and 1987 (-14.9%).",
        "• Inflation rates below 5% during this period occurred in 1982 (3.9%) and 1989 (-0.2%), highlighted in green in the original table.",
        "• In the early 1990s, GDP (PPP) continued to grow from 7.0 billion US$ in 1990 to 8.3 billion US$ in 1993; GDP per capita increased from 830 US$ to 917 US$; nominal GDP rose from 0.8 billion US$ to 1.0 billion US$; real GDP growth rates ranged from 2.6% to 3.4%; inflation rates showed significant volatility, including deflation in 1992 (-5.9%) and 1993 (-0.6%).",
        "• Inflation spiked to 24.3% in 1994, followed by 11.6% in 1995, before declining to 6.5% in 1996 and fluctuating around zero or low positive/negative values through 1999.",
        "• Government debt as a percentage of GDP was not recorded until 2000, when it was 90.5%, then decreased to 77.5% in 2001 and further to 42.6% in 2002, indicating significant debt reduction efforts.",
        "• Between 2000 and 2010, Mali's GDP (PPP) increased from 12.4 billion US$ to 26.9 billion US$, GDP per capita rose from 1,133 US$ to 1,787 US$, nominal GDP grew from 2.0 billion US$ to 4.7 billion US$, and real GDP growth rates generally increased from 3.0% to 10.7%.",
        "• Inflation rates during 2000–2010 varied, with some years showing deflation (e.g., -1.3% in 2003, -3.1% in 2004) and others positive inflation, peaking at 6.4% in 2005.",
        "• Government debt as a percentage of GDP fluctuated between 18.1% and 46.6% during 2000–2010, with the lowest recorded in 2006 (18.1%).",
        "• From 2011 to 2021, Mali's GDP (PPP) grew from 28.3 billion US$ to 51.0 billion US$, GDP per capita increased from 1,827 US$ to 2,447 US$, nominal GDP rose from 5.2 billion US$ to 10.8 billion US$, and real GDP growth rates showed variability, peaking at 19.8% in 2021.",
        "• Inflation rates in this period mostly remained below 5%, with occasional exceptions such as 9.2% in 2008 and 5.3% in 2012; years with inflation below 5% are highlighted in green.",
        "• Government debt as a percentage of GDP increased steadily from 24.0% in 2011 to 51.9% in 2021, indicating a rising debt burden relative to economic output.",
        "• The data reflects Mali’s economic growth trajectory, inflation volatility, and government debt dynamics over four decades, highlighting periods of both economic expansion and inflationary challenges."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:27:39.291448",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_mali.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mali's most productive agricultural region is located in southern Mali, specifically between Bamako and Mopti, characterized by varying isohyet lines and crop intensity percentages; irrigation water in this region is primarily used for rice cultivation, while cotton is grown as a rainfed crop (USDA: 2001).",
        "• In 2018, Mali's agricultural production included 3.8 million tons of maize and 3.1 million tons of rice, demonstrating significant cereal output.",
        "• Other major crops produced in 2018 were 1.8 million tons of millet and 1.5 million tons of sorghum, staple cereals in Malian agriculture.",
        "• Mali produced 814 thousand tons of mango in 2018, ranking as the 15th largest mango producer globally.",
        "• Cotton production reached 710 thousand tons in 2018, positioning Mali as the 15th largest cotton producer worldwide.",
        "• Additional 2018 production figures include 551 thousand tons of watermelon, 522 thousand tons of onion, and 512 thousand tons of okra, indicating diverse vegetable cultivation.",
        "• Sugar cane production was 370 thousand tons, while peanut output was 368 thousand tons in 2018.",
        "• Root crops included 312 thousand tons of sweet potato and 303 thousand tons of potato produced in 2018.",
        "• Mali produced 226 thousand tons of sheanut and 215 thousand tons of cowpea in 2018, important for both local consumption and export.",
        "• Banana production was 196 thousand tons, and cashew nuts reached 167 thousand tons in 2018, with Mali ranked as the 8th largest cashew nut producer globally.",
        "• Bean and tomato production each totaled 159 thousand tons in 2018.",
        "• Mali's agricultural sector also includes smaller-scale production of various other agricultural products beyond those quantified.",
        "• Agriculture employs approximately 70% of Mali's labor force and contributes 42% to the national GDP, underscoring its economic significance.",
        "• Cotton and livestock collectively account for 75% to 80% of Mali's annual export revenues, highlighting their critical role in foreign exchange earnings.",
        "• The agricultural sector is dominated by small-scale traditional farming, with subsistence cultivation of cereals—primarily sorghum, pearl millet, and maize—on about 90% of the 14,000 square kilometers (1,400,000 hectares; 3,500,000 acres) under cultivation.",
        "• The most productive agricultural zone extends along the Niger River banks between Bamako and Mopti, continuing southward to the borders with Guinea, Ivory Coast, and Burkina Faso.",
        "• Average annual rainfall in this key agricultural region ranges from 500 mm (20 inches) near Mopti to 1,400 mm (55 inches) near Sikasso in the south, influencing crop viability.",
        "• This southern agricultural region is vital for producing cotton, rice, pearl millet, maize, vegetables, tobacco, and tree crops.",
        "• Since 1993, annual rainfall levels critical for agriculture have been at or above average, supporting increased cereal production, including rice.",
        "• The 1997–98 cotton harvest reached a record high of 500,000 tons, reflecting improved agricultural output.",
        "• Until the mid-1960s, Mali was self-sufficient in grain production, including pearl millet, sorghum, rice, and maize.",
        "• From 1965 to 1986, Mali experienced grain deficits almost every year due to diminished harvests in bad years, population growth, changing dietary habits, and policy constraints limiting agricultural production.",
        "• Agricultural production rebounded after 1987 following government-led policy reforms supported by Western donor nations.",
        "• Key reforms included liberalization of producer prices and establishment of an open cereals market, which created incentives for increased production.",
        "• These reforms, combined with adequate rainfall, successful integrated rural agriculture programs in southern Mali, and improved management of the Office du Niger irrigation scheme, have resulted in surplus cereal production over the past five years."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:27:57.825539",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_mali.json",
      "original_index": 2
    },
    {
      "section_number": "2.1",
      "section_name": "Rice",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Rice cultivation in Mali is concentrated primarily along the banks of the Niger River, specifically between the cities of Ségou and Mopti.",
        "• The most significant rice-producing region in Mali is the Office du Niger, which is situated north of Ségou, extending toward the Mauritanian border.",
        "• The Office du Niger utilizes irrigation by diverting water from the Niger River to support agricultural activities.",
        "• Approximately 600 square kilometers (230 square miles) of land are irrigated by the Office du Niger for the cultivation of rice and sugarcane.",
        "• The Office du Niger is responsible for producing about one-third of Mali's total paddy rice output."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:01.002517",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_mali.json",
      "original_index": 3
    },
    {
      "section_number": "2.2",
      "section_name": "Sorghum",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Sorghum is extensively cultivated in the drier regions of Mali, including areas along the banks of the Niger River in eastern Mali.",
        "• Sorghum is also grown in the lake beds located in the Niger delta region of Mali.",
        "• In the wet season, farmers near the town of Dire have a long-standing tradition of cultivating wheat on irrigated fields, a practice that has been maintained for hundreds of years.",
        "• Peanuts are grown throughout Mali but are predominantly concentrated in the region around Kita, which is situated west of the capital city, Bamako."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:06.321583",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_mali.json",
      "original_index": 4
    },
    {
      "section_number": "2.3",
      "section_name": "Livestock",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Mali produced 276 million liters of cow's milk, 270 million liters of camel milk, 243 million liters of goat milk, and 176 million liters of sheep's milk, alongside 187 thousand tons of beef, 64 thousand tons of lamb meat, and 54 thousand tons of chicken meat, among other livestock products.",
        "• Mali's livestock resources comprise millions of cattle, sheep, and goats, forming a significant component of the country's agricultural economy.",
        "• Approximately 40% of Mali's livestock herds were lost during the severe drought that occurred between 1972 and 1974, causing substantial reductions in animal populations.",
        "• Although herd sizes were gradually restored after the 1972–74 drought, they were again severely diminished during the subsequent drought of 1983–85.",
        "• The overall size of Mali's livestock herds is not expected to return to pre-drought levels in the northern regions of the country, primarily due to desert encroachment forcing many nomadic herders to abandon pastoralism in favor of farming.",
        "• The largest concentrations of cattle are found in areas north of Bamako and Ségou, extending into the Niger delta region, reflecting traditional herding zones.",
        "• Herding activities are gradually shifting southward as a direct consequence of the impacts of previous droughts and environmental changes.",
        "• In the arid regions north and east of Timbuktu, sheep, goats, and camels are predominantly raised, often excluding cattle due to the harsher environmental conditions."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:14.312032",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_mali.json",
      "original_index": 5
    },
    {
      "section_number": "3",
      "section_name": "Fishing",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Niger River serves as a crucial source of fish, supplying food to riverside communities in Mali.",
        "• Surplus fish caught from the Niger River are processed through smoking, salting, and drying methods before being exported.",
        "• Since the early 1980s, fish production in the Niger River has experienced a steady decline.",
        "• The decline in fish production is attributed primarily to drought conditions and the diversion of river water for agricultural purposes.",
        "• Fishing activities on the Niger River include the use of pirogues, small traditional boats, as exemplified by those carrying passengers at locations such as Gao in Mali."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:17.486132",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_mali.json",
      "original_index": 6
    },
    {
      "section_number": "4",
      "section_name": "Mining and resources",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mining has historically been a significant component of Mali's economy, with gold serving as the largest source of Malian exports.",
        "• By the end of the 20th century, Mali ranked third in gold production in Africa, following South Africa and Ghana.",
        "• The principal goldfields are located in the southern region, particularly in the Bambouk Mountains within the Kenieba Cercle in western Mali, which have been a major source of wealth and trade since the era of the Ghana Empire.",
        "• Salt mining has been economically important for at least seven hundred years, especially in the Saharan oases of Taoudenni and Taghaza in northern Mali.",
        "• Both gold and salt were essential commodities in the Trans-Saharan trade network, which dates back to the Roman Empire period.",
        "• Between the 1960s and 1990s, state-owned mining operations, particularly gold mining, expanded significantly in Mali.",
        "• Following this period, there was a shift towards expansion by international contract mining companies.",
        "• In 1991, Mali relaxed enforcement of its mining codes under the influence of the International Development Association, which facilitated increased foreign investment in the mining sector.",
        "• From 1994 to 2007, approximately 150 operating licenses, over 25 exploitation certificates, and more than 200 research permits were granted to national and foreign mining companies.",
        "• Gold production in Mali rose dramatically from less than half a tonne annually at the end of the 1980s to over 50 tonnes in 2007.",
        "• Mining revenue in Mali reached approximately 300 billion CFA francs in 2007, representing an increase of more than thirty times compared to the 1995 national mining revenue of less than 10 billion CFA francs.",
        "• Government revenue from mining contracts grew from less than 1% of state income in 1989 to nearly 18% in 2007."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:24.757731",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_mali.json",
      "original_index": 7
    },
    {
      "section_number": "4.1",
      "section_name": "Gold",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Mali ranked as the 16th largest gold producer globally, reflecting its significant position in the international gold mining industry.",
        "• During the mid-2000s, gold mining constituted approximately 80% of Mali's total mining activity, indicating the dominance of gold within the country's extractive sector.",
        "• Despite the focus on gold, Mali possessed substantial proven reserves of other minerals that remained unexploited at that time, suggesting potential for future diversification in mining.",
        "• Historically, Mali's export economy was primarily based on cotton and livestock, with cotton being the foundational export product before the rise of gold.",
        "• Since 1999, gold emerged as Mali's largest export commodity, surpassing cotton and livestock, and becoming the primary driver of the country's export revenues.",
        "• The rise of gold exports helped to offset adverse economic effects caused by volatility in global cotton markets and the reduction of trade resulting from the Ivorian Civil War, which affected Mali's southern trade routes.",
        "• Significant private sector investments in Mali's gold mining industry include a $250 million investment by AngloGold Ashanti in the Sadiola and Yatela mines, located in the north-western region of Mali.",
        "• Another major investment was made by Randgold Resources, a South African multinational company, which invested $140 million in the Morila gold mine situated in the southern part of Mali.",
        "• Both AngloGold Ashanti and Randgold Resources are multinational South African companies playing key roles in Mali's gold mining sector, with operations strategically positioned in different geographic regions of the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:32.040949",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_mali.json",
      "original_index": 8
    },
    {
      "section_number": "4.1.1",
      "section_name": "Social and environmental impacts",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Despite generating substantial incomes, the majority of employees in Mali's mining industries are recruited from outside the country, leading to local residents in mining-intensive areas expressing dissatisfaction with the limited benefits they receive from the industry.",
        "• Communities in regions affected by mining operations report displacement due to mine construction; specifically, 43 villages have lost some land to the Sadiola Gold Mine, and near the large Syama goldmines in Fourou, 121 villages have experienced some level of displacement.",
        "• The ongoing exploitation of unregulated small-scale mining activities, frequently involving child laborers, contributes significantly to the international gold market centered in Bamako, which subsequently feeds into global gold production chains.",
        "• Recent criticisms have emerged regarding the poor working conditions, inadequate pay, and the widespread use of child labor in Mali’s small-scale gold mines, as documented in the U.S. Department of Labor's _List of Goods Produced by Child Labor or Forced Labor_.",
        "• Middlemen operating in regional centers such as Sikasso and Kayes purchase gold from small-scale miners and transport it with minimal regulation or oversight; this gold is then sold to larger merchant houses in Bamako or Conakry.",
        "• Ultimately, the gold collected in Mali is exported to smelters in Europe, highlighting a largely unregulated supply chain from local miners to international markets.",
        "• Environmental concerns are significant, with ecological damage—particularly water pollution caused by mine tailings—being a major issue associated with mining activities in Mali."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:38.784938",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_mali.json",
      "original_index": 9
    },
    {
      "section_number": "4.2",
      "section_name": "Other minerals",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Other mining operations in Mali encompass the extraction of kaolin, salt, phosphate, and limestone, indicating a diverse mineral resource base beyond gold and traditional minerals.",
        "• The Malian government is actively promoting and attempting to stimulate interest in the exploration and potential extraction of petroleum resources located in the Taoudeni basin, highlighting efforts to diversify the country's mineral and energy sectors."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:42.165151",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 2
      },
      "source_file": "economy_of_mali.json",
      "original_index": 10
    },
    {
      "section_number": "5",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the colonial period in Mali, private capital investment was virtually nonexistent, with public investment primarily focused on the Office du Niger irrigation scheme and administrative expenses.",
        "• Following Mali's independence, the country developed some light industries with assistance from various donors.",
        "• By 1990, the manufacturing sector in Mali, which mainly consisted of processed agricultural products, accounted for approximately 8% of the country's Gross Domestic Product (GDP).",
        "• In 2006, Mali had specific export destinations, reflecting its trade relationships, although the detailed list of these destinations is not provided in this section."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:45.482876",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_mali.json",
      "original_index": 11
    },
    {
      "section_number": "6",
      "section_name": "Economic reform",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Between 1992 and 1995, Mali implemented an economic adjustment program that led to economic growth and a reduction in financial imbalances, evidenced by increased GDP growth rates, reaching 9.6% in 2002, and decreased inflation.",
        "• In 2002, Mali's GDP amounted to US$3.2 billion, with the economic structure composed of agriculture at 37.8%, industry at 26.4%, and services at 35.9%.",
        "• The effective implementation of macroeconomic stabilization and economic liberalization policies, combined with a stable political situation, resulted in strong economic performance and enabled Mali to strengthen the foundations for a market-oriented economy.",
        "• These policies encouraged private sector development, supported by significant progress in the country's privatization program.",
        "• Agricultural reform measures focused on diversifying and expanding production while reducing costs to enhance sector efficiency.",
        "• Mali's economic performance remains fragile, characterized by vulnerability to climatic conditions, fluctuating terms of trade, and dependence on ports in neighboring countries for trade access.",
        "• Mali produces cotton, cereals, and rice; locally produced rice now competes with imported Asian rice, but cotton remains the country's primary export.",
        "• Livestock exports and industry sectors, including the production of vegetable and cottonseed oils and textiles, have experienced growth.",
        "• Despite most of Mali being desert or semi-desert, the Niger River offers potential for irrigation to support agriculture.",
        "• Mali's exports are concentrated in three primary sector products: gold (56%), cotton (27%), and livestock (5%).",
        "• The majority of Mali's trade passes through Ivory Coast, and the crisis previously experienced in Ivory Coast negatively affected Mali's economy.",
        "• The mining industry in Mali has recently attracted renewed interest and investment from foreign companies.",
        "• Gold and phosphate are the only minerals currently mined in Mali, although deposits of copper and diamonds also exist.",
        "• Since 1999, gold has emerged as Mali's leading export product, helping to mitigate some of the negative impacts of the cotton sector difficulties and the Ivory Coast crisis.",
        "• The development of the oil industry is important for Mali due to the country's dependence on the importation of all petroleum products from neighboring states.",
        "• Electricity in Mali is provided by the parastatal utility Electricite du Mali."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:28:52.919619",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_mali.json",
      "original_index": 12
    },
    {
      "section_number": "7",
      "section_name": "Foreign aid",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mali is predominantly French-speaking and is a major recipient of foreign aid from multiple sources, including multilateral organizations such as the World Bank, African Development Bank, and various Arab Funds.",
        "• Bilateral aid to Mali is provided by the European Union, France, the United States, Canada, the Netherlands, and Germany, reflecting a diverse international support network.",
        "• Brazilian cooperation with Mali has been rapidly expanding, particularly in cotton production through the development of cotton seeds adapted to Malian soil, significantly improving cotton field quality and productivity since 2009.",
        "• Since 2019, Brazilian aid has also extended to cattle raising initiatives and the recovery of eroded soils to enhance agricultural productivity in Mali.",
        "• Prior to 1991, the former Soviet Union was a major economic and military aid provider to Mali, contributing to infrastructure projects such as the construction of a cement plant and the Kalana gold mine.",
        "• Currently, Russian aid to Mali is limited primarily to training programs and the provision of spare parts, marking a reduction from its previous extensive involvement.",
        "• Chinese aid to Mali remains substantial, with an increase in Chinese-Malian joint venture companies over the past three years, leading to the establishment of a Chinese investment center in Mali.",
        "• Chinese involvement in Mali includes significant participation in the textile industry and major construction projects, such as a bridge over the Niger River, a conference center, an expressway in Bamako, and the Stade du 26 Mars stadium in Bamako, completed in 2001 for the 2002 Africa Cup competition.",
        "• In 1998, U.S. assistance to Mali exceeded $40 million, comprising $39 million in sector support through USAID programs primarily directed to local communities via private voluntary agencies.",
        "• The U.S. Peace Corps program in Mali had a budget of $2.2 million in 1998, supporting over 160 volunteers serving in the country.",
        "• Additional U.S. funding in 1998 included $170,500 for Self Help and Democracy Funds and $650,000 allocated for electoral support initiatives.",
        "• U.S. military assistance to Mali in 1998 consisted of $275,000 for the International Military Education Training (IMET) program, $1.6 million for the African Crisis Response Initiative (ACRI), $60,000 for Joint Combined Exercise Training (JCET), and $100,000 for Humanitarian Assistance."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:29:04.998564",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_mali.json",
      "original_index": 13
    },
    {
      "section_number": "8",
      "section_name": "Statistics",
      "chapter_name": "Economy of Mali",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mali's GDP based on purchasing power parity was estimated at $41.22 billion in 2017.",
        "• The real GDP growth rate of Mali was recorded at 5.4% in 2017.",
        "• GDP per capita on a purchasing power parity basis was approximately $2,200 in 2017.",
        "• The composition of Mali's GDP by sector in 2017 was: agriculture 41.8%, industry 18.1%, and services 40.5%.",
        "• In 2005, 36.1% of Mali's population was living below the poverty line.",
        "• Household income or consumption distribution in 2001 showed the lowest 10% of the population held 2.4% of income, while the highest 10% held 30.2%.",
        "• The inflation rate for consumer prices in Mali was 1.8% in 2017.",
        "• Mali's labor force was estimated at 6.447 million people in 2017.",
        "• By occupation in 2005, 80% of Mali’s labor force was engaged in agriculture and fishing, while 20% worked in industry and services.",
        "• The unemployment rate in Mali was reported as 12%.",
        "• Mali’s government budget in 2017 had revenues of $3.075 billion and expenditures of $3.513 billion.",
        "• Key industries in Mali include food processing, construction, and phosphate and gold mining.",
        "• The industrial production growth rate was 6.3% in 2017.",
        "• Mali produced 2.489 billion kWh of electricity in 2016.",
        "• Electricity production sources in 2017 were 68% fossil fuel, 31% hydroelectric, 0% nuclear, and 1% other sources.",
        "• Electricity consumption in Mali was 2.982 billion kWh in 2016.",
        "• Mali exported no electricity in 2016 but imported 800 million kWh during the same year.",
        "• Major agricultural products in Mali include cotton, pearl millet, rice, corn, maize, vegetables, peanuts, and livestock such as cattle, sheep, and goats.",
        "• Mali’s exports totaled $3.06 billion in 2017.",
        "• Export commodities in 2017 were dominated by cotton (50%), gold, and livestock.",
        "• The principal export partners in 2017 were Switzerland (31.8%), the United Arab Emirates (15.4%), Burkina Faso (7.8%), Côte d'Ivoire (7.3%), South Africa (5%), and Bangladesh (4.6%).",
        "• Mali’s imports amounted to $3.644 billion in 2017.",
        "• Imported commodities included petroleum, machinery and equipment, construction materials, foodstuffs, and textiles.",
        "• Major import partners in 2017 were Senegal (24.4%), China (13.2%), Côte d'Ivoire (9%), and France (7.3%).",
        "• Mali’s external debt was estimated at $4.192 billion as of 31 December 2017.",
        "• Mali received economic aid amounting to $691.5 million in 2005.",
        "• The currency used in Mali is the Communaute Financiere Africaine franc (CFAF), subdivided into 100 centimes.",
        "• Exchange rates of CFAF per US dollar were 647.25 in January 2000, 615.70 in 1999, 589.95 in 1998, 583.67 in 1997, 511.55 in 1996, and 499.15 in 1995.",
        "• Since 1 January 1999, the CFA franc has been pegged to the euro at a fixed rate of 655.957 CFA francs per euro.",
        "• Mali’s fiscal year corresponds to the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T10:29:23.227221",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 30
      },
      "source_file": "economy_of_mali.json",
      "original_index": 14
    }
  ]
}