{
  "extraction_info": {
    "source_file": "economy_of_azerbaijan.json",
    "extraction_timestamp": "2025-08-02T17:13:27.404000",
    "total_sections_in_source": 14,
    "extracted_sections_count": 14,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Azerbaijan is highly dependent on oil and gas exports, particularly following the completion of the Baku-Tbilisi-Ceyhan Pipeline, which significantly boosted oil export capacity.",
        "• The transition to oil production in the late 1990s spurred rapid economic growth in Azerbaijan during the period from 1995 to 2014.",
        "• Since 2014, Azerbaijan's GDP growth has slowed considerably, indicating a slowdown in economic expansion.",
        "• Large oil reserves are a major contributor to Azerbaijan's economy, underpinning its reliance on fossil fuels.",
        "• Oil and gas constitute approximately two-thirds of Azerbaijan's Gross Domestic Product (GDP), making it one of the top ten most fossil fuel-dependent economies globally.",
        "• Oil and gas account for about 90% of Azerbaijan's export revenues, highlighting the sector's dominance in foreign trade.",
        "• The fossil fuel sector also constitutes roughly 60% of the country's overall financial income, emphasizing its central role in national finances.",
        "• Azerbaijan's economy is characterized by issues of corruption and inequality, which impact economic stability and social equity.",
        "• The country's oil wealth has significantly strengthened the regime of President Ilham Aliyev and has enriched the ruling elites, consolidating political power.",
        "• Oil revenues have enabled Azerbaijan to host lavish international events, showcasing its wealth and global presence.",
        "• The state has engaged in extensive lobbying efforts abroad, leveraging its oil wealth to influence international relations and policies.",
        "• The national currency of Azerbaijan is the Azerbaijani manat.",
        "• The private sector in Azerbaijan remains weak, with the economy predominantly dominated by state-owned enterprises.",
        "• More than half of the formal labor force in Azerbaijan is employed by the government, indicating a large public sector."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:29:40.205981",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 0
    },
    {
      "section_number": "0.1",
      "section_name": "Republic era",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Oil and gas are the most prominent sectors of Azerbaijan's economy, constituting a primary source of revenue and development.",
        "• Over $60 billion has been invested into Azerbaijan's oil sector by major international oil companies, primarily through the Azerbaijan International Operating Company (AIOC) consortium led by BP.",
        "• Oil production under the first production sharing agreement (PSA) with AIOC commenced in November 1997.",
        "• Oil production reached approximately 500,000 barrels per day in 2006 under these agreements.",
        "• Azerbaijan is known for its \"oil spas\" in Naftalan, where visitors bathe in local crude oil, highlighting a unique aspect of its petroleum industry.",
        "• Historically, Azerbaijan was a leading caviar producer and exporter; currently, its fishing industry focuses on the declining stocks of sturgeon and beluga in the Caspian Sea.",
        "• The country faces common transition challenges shared by former Soviet republics, shifting from a command economy to a market economy, but its energy resources provide a positive outlook for long-term economic prospects.",
        "• Progress has been made in economic reforms, with gradual replacement of old economic ties and structures.",
        "• A significant obstacle to economic development and foreign investment is the ongoing conflict with Armenia over the Nagorno-Karabakh region.",
        "• Azerbaijan became a member of the Economic Cooperation Organization in 1992.",
        "• By 2002, Azerbaijan's merchant marine comprised 54 ships.",
        "• In 2010, Azerbaijan ranked among the top eight largest oil suppliers to European Union countries, with exports valued at €9.46 billion.",
        "• Foreign investments in Azerbaijan totaled $20 billion in 2011, representing a 61% increase compared to 2010.",
        "• According to Azerbaijani Minister of Economic Development Shahin Mustafayev, in 2011, approximately $15.7 billion was invested in the non-oil sector, with the remaining funds directed toward the oil sector.",
        "• Azerbaijani exports in 2006 contributed significantly to its economic profile, though specific figures are not provided in the excerpt.",
        "• Post-Soviet economic recovery led to predictions in 2012 that Azerbaijan would become the \"Tiger of the Caucasus.\"",
        "• The Globalization and World Cities Research Network ranked Baku as a Gamma-level global city in 2012, indicating its growing international importance.",
        "• In 2015, Azerbaijan and Turkey agreed to increase mutual trade to US$15 billion by 2023, reflecting regional economic cooperation efforts."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:29:49.642467",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 1
    },
    {
      "section_number": "1",
      "section_name": "Macroeconomic trend",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section provides an overview of Azerbaijan's macroeconomic trends, focusing on changes in per capita GDP since 1973, with figures inflation-adjusted to 2011 International dollars.",
        "• It includes a chart illustrating Azerbaijan’s gross domestic product (GDP) at market prices in USD for selected years: 1995, 2000, 2005, 2010, and 2015.",
        "• In 1995, Azerbaijan’s GDP PPP was approximately $19.5 billion, with per capita income at 8.78% of the US level.",
        "• By 2000, GDP PPP increased to about $29.68 billion, with per capita income rising to 10.01% of the US.",
        "• In 2005, GDP PPP reached approximately $59.09 billion, with per capita income at 15.52% of the US.",
        "• In 2010, GDP PPP significantly grew to around $138.95 billion, with per capita income at 31.78% of the US.",
        "• By 2015, Azerbaijan’s GDP PPP was approximately $169.79 billion, with per capita income at 32.15% of the US.",
        "• For PPP comparisons, the US dollar was exchanged at 1,565.88 Manats; currently, the new Manat is in use with an exchange rate of about 1 manat = $0.59.",
        "• The mean graduate pay in 2010 was $5.76 per man-hour.",
        "• A comprehensive table presents key economic indicators from 1980 to 2017, including GDP (PPP and nominal), GDP per capita, real GDP growth rates, inflation rates, and government debt as a percentage of GDP.",
        "• In 1993, Azerbaijan’s GDP (PPP) was $27.4 billion, with GDP per capita at $3,658; real GDP declined by 27.4%, and inflation was extremely high at 1129.7%.",
        "• In 1995, GDP (PPP) decreased to $20 billion, with per capita income at $2,610; real GDP fell by 13%, and inflation was 411.8%; government debt was 19% of GDP.",
        "• By 2000, GDP (PPP) increased to $30.4 billion, with per capita income at $3,781; real GDP grew by 6.2%, inflation was 1.8%, and government debt was 23%.",
        "• In 2005, GDP (PPP) surged to $61.3 billion, with per capita income at $7,252; real GDP grew by 28%, inflation was 9.6%, and government debt decreased to 14%.",
        "• From 2006 to 2017, Azerbaijan experienced consistent GDP growth, with GDP (PPP) reaching $171.8 billion in 2015 and slightly declining to $168.6 billion in 2016 before rising again to $171.8 billion in 2017.",
        "• Per capita GDP (PPP) increased from $9,927 in 2006 to $17,492 in 2017, reflecting economic growth.",
        "• Real GDP growth rates varied, with notable increases of 34.5% in 2006 and 25.5% in 2007, and a decline of −3.1% in 2016.",
        "• Inflation rates fluctuated, reaching a high of 20.8% in 2008 and a low of 1.1% in 2012, with a peak of 13% in 2017.",
        "• Government debt as a percentage of GDP decreased to a low of 7% in 2008 but increased to 55% by 2017, indicating rising public debt levels.",
        "• Historically, petroleum has been the backbone of Azerbaijan’s economy for over a century, accounting for 50% of GDP in 2005.",
        "• Oil's contribution to GDP was projected to double from 50% in 2005 to nearly 125% in 2007, reflecting the sector’s dominance.",
        "• Western oil companies have gained access to deep-water oilfields previously inaccessible during Soviet times due to technological advancements.",
        "• Azerbaijan is now considered one of the world’s most significant areas for oil exploration and development.",
        "• Proven oil reserves in the Caspian Basin, shared with Russia, Kazakhstan, Iran, and Turkmenistan, are comparable in size to those in the North Sea, although exploration remains in early stages."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:05.587899",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 2
    },
    {
      "section_number": "1.1",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Azerbaijan possesses the largest agricultural basin in the region, with approximately 54.9% of its territory designated as agricultural lands.",
        "• As of the beginning of 2007, Azerbaijan had 4.76 million hectares (11.8 million acres) of utilized agricultural area.",
        "• In 2007, the total wood resources in Azerbaijan were estimated at 136 million cubic metres (178 million cubic yards).",
        "• The country's agricultural scientific research institutes focus on several key areas, including meadows and pastures, horticulture and subtropical crops, leaf vegetables, viticulture and wine-making, cotton cultivation, and medicinal plants.",
        "• Certain lands in Azerbaijan are profitable for growing crops such as grain, potatoes, sugar beets, cotton, and tobacco.",
        "• Major farm products also include livestock, dairy products, and alcoholic beverages like wine and spirits.",
        "• The Caspian Sea fishing industry primarily targets the dwindling stocks of sturgeon and beluga fish.",
        "• Some products that were previously imported into Azerbaijan are now being produced domestically, including Coca-Cola (produced by Coca-Cola Bottlers LTD), beer (by Baki-Kastel), parquet flooring (by Nehir), and oil pipes (by EUPEC Pipe Coating Azerbaijan).",
        "• A new program, developed with support from the European Union, aims to promote economic diversification within Azerbaijan."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:11.440469",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 3
    },
    {
      "section_number": "1.2",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Marauder (Mine Protected Vehicle) is manufactured in Azerbaijan, indicating the country's involvement in defense vehicle production.",
        "• In 2007, the mining and hydrocarbon industries together accounted for well over 95 percent of Azerbaijan's economy, highlighting the sector's dominance.",
        "• The diversification of Azerbaijan's economy into manufacturing industries has been identified as a long-term challenge, emphasizing the need for economic diversification beyond resource extraction.",
        "• By the late 2000s, Azerbaijan's defense industry had developed into an autonomous sector with an increasing capacity for defense production, reflecting growth and specialization in military manufacturing.",
        "• The Azerbaijani defense ministry has established cooperative relationships with the defense sectors of Ukraine, Belarus, and Pakistan, indicating international collaboration in defense technology and manufacturing.",
        "• Azerbaijan's defense industry, in partnership with Turkish companies, is involved in the production of various military equipment, including 40 mm revolver grenade launchers, 107 mm and 122 mm Multiple Launch Rocket Systems (MLRS), and Cobra 4×4 vehicles.",
        "• Additionally, Azerbaijan is engaged in the joint modernization of BTR (armored personnel carrier) vehicles in Baku, demonstrating efforts to upgrade and enhance existing military hardware."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:16.597700",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 4
    },
    {
      "section_number": "1.2.1",
      "section_name": "Financial and business services",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The banking sector in Azerbaijan remains relatively small when compared to the overall size of the country's economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:17.997233",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 1
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 5
    },
    {
      "section_number": "1.2.2",
      "section_name": "Telecommunications",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The telecommunications sector in Azerbaijan is characterized by widespread corruption.",
        "• Azerbaijani President Ilham Aliyev and his family own two of the country's largest mobile providers, Azerfon and Azercell, through offshore companies.",
        "• The Aliyev family potentially controls approximately 75% (three-quarters) of the mobile market in Azerbaijan.",
        "• The third major mobile provider is Bakcell, which is registered as a company in an offshore tax haven, with the ownership details of its owners remaining unknown.",
        "• Ownership structures of these mobile providers enable the Aliyev family to monitor phone calls and internet activity within Azerbaijan.",
        "• Investigative reports have uncovered that President Ilham Aliyev and his family profited over $1 billion from the transfer of state shares of mobile operators to a \"local partner\" that was, in reality, owned by the Aliyev family's offshore entities.",
        "• Azerbaijan's call rates are relatively high compared to those in similar countries, which may be attributed to the consolidated control of the mobile market and the resulting lack of competition.",
        "• The Azerbaijani government has publicly stated its intention to develop a high-tech sector within the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:21.097807",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 6
    },
    {
      "section_number": "1.2.3",
      "section_name": "Tourism",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Petroglyphs in Gobustan, dating back to approximately 10,000 BC, indicate a thriving ancient culture and are recognized as a UNESCO World Heritage Site of \"outstanding universal value.\"",
        "• Tourism is a significant component of Azerbaijan's economy, contributing to economic growth and development.",
        "• The country was a well-known tourist destination during the 1980s, attracting visitors from various regions.",
        "• The fall of the Soviet Union and the First Nagorno-Karabakh War (1988–1994) negatively impacted Azerbaijan’s tourism industry and damaged its reputation as a tourist destination.",
        "• Tourism industry recovery began in the 2000s, with notable increases in the number of tourist visits and overnight stays.",
        "• In recent years, Azerbaijan has gained popularity as a destination for religious tourism, spa tourism, and health care tourism.",
        "• During winter, the Shahdag Winter Complex offers skiing facilities, attracting winter sports enthusiasts.",
        "• The Azerbaijani government has prioritized the development of Azerbaijan as an elite tourist destination, aiming to make tourism a major, potentially the largest, contributor to the national economy.",
        "• Tourism development activities are regulated by the State Tourism Agency and the Ministry of Culture.",
        "• The country hosts the Formula One Grand Prix in Baku, the capital city, an event that has been held there for several years, enhancing Azerbaijan’s international profile as a tourist and sporting destination."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:26.285840",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 7
    },
    {
      "section_number": "2",
      "section_name": "Currency system",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The currency of Azerbaijan is the Azerbaijani manat, which is denominated as the manat and subdivided into 100 qapik.",
        "• The manat is issued and regulated by the Central Bank of Azerbaijan, the country's monetary authority.",
        "• The ISO 4217 currency code for the Azerbaijani manat is AZN.",
        "• The Latinised symbol for the manat is ().",
        "• The manat operates within a floating exchange-rate system, with its value primarily managed against the US dollar.",
        "• As of 28 January 2016, the exchange rate was AZN 1.60 per US$1.",
        "• There exists a complex relationship between Azerbaijan's balance of trade, inflation (measured by the consumer price index), and the currency's value.",
        "• Despite the manat's floating exchange rate, Azerbaijan's central bank retains decisive control over its value relative to other currencies."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:30.945692",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 8
    },
    {
      "section_number": "2.1",
      "section_name": "Energy",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Baku-Tbilisi-Ceyhan pipeline, highlighted in green on maps, is one of several pipelines originating from Baku, Azerbaijan, serving as a major conduit for oil transportation.",
        "• Approximately two-thirds of Azerbaijan's territory is rich in oil and natural gas resources, indicating significant hydrocarbon reserves.",
        "• The Lesser Caucasus region within Azerbaijan accounts for the majority of the country's mineral wealth, including deposits of gold, silver, iron, copper, titanium, chromium, manganese, cobalt, molybdenum, complex ore, and antimony.",
        "• In September 1994, Azerbaijan signed a 30-year contractual agreement with 13 international oil companies, including Amoco, BP, ExxonMobil, Lukoil, and Statoil, to develop its oil resources.",
        "• Western oil companies are able to access and exploit deep-water oilfields in Azerbaijan that were previously untouched by Soviet-era extraction efforts, making Azerbaijan one of the world's most significant locations for oil exploration and development.",
        "• Azeriqaz, a subsidiary of SOCAR (State Oil Company of Azerbaijan Republic), has the strategic goal of achieving full gasification of Azerbaijan by the year 2021."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:35.707184",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 9
    },
    {
      "section_number": "2.2",
      "section_name": "Transportation",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Azerbaijan’s strategic geographic location at the crossroads of major international traffic arteries, such as the historic Silk Road and the south–north corridor, underscores the critical importance of its transportation sector for national economic development.",
        "• The country’s transportation infrastructure encompasses roads, railways, aviation, and maritime transport systems, forming the backbone of its connectivity and trade.",
        "• Azerbaijan serves as a significant economic hub for the transportation of raw materials, facilitating regional and international trade flows.",
        "• The Baku-Tbilisi-Ceyhan (BTC) pipeline, operational since May 2006, extends over 1,774 kilometers across Azerbaijan, Georgia, and Turkey, and is a key infrastructure for oil export.",
        "• The BTC pipeline is designed to transport up to 50 million tons of crude oil annually, channeling oil from Caspian Sea oilfields to global markets.",
        "• The South Caucasus Pipeline, also traversing Azerbaijan, Georgia, and Turkey, became operational at the end of 2006 and supplies natural gas to the European market from the Shah Deniz gas field.",
        "• The Shah Deniz gas field is projected to produce up to 296 billion cubic meters of natural gas per year, significantly contributing to regional energy supplies.",
        "• Azerbaijan plays a major role in the European Union-sponsored Silk Road Project, enhancing regional connectivity and trade integration.",
        "• The Kars–Tbilisi–Baku railway, under construction in 2012, aims to facilitate transportation between Asia and Europe by linking Chinese and Kazakh railways in the east with Turkey’s Marmaray project and the European railway system in the west.",
        "• As of 2010, Azerbaijan’s broad gauge railway network extended for 2,918 kilometers (1,813 miles), with 1,278 kilometers (794 miles) of electrified railways, supporting efficient freight and passenger movement.",
        "• By 2010, Azerbaijan had developed a network of 35 airports and one heliport, supporting domestic and international air travel."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:43.998888",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 10
    },
    {
      "section_number": "2.3",
      "section_name": "Regulation",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The single window system facilitates the sharing of necessary information through a unified gateway involving all organizations engaged in trade activities, thereby eliminating redundant processes and enhancing cooperation efficiency among different parties.",
        "• Globally, 73 economies have implemented the single window system as of the current date.",
        "• Azerbaijan began implementing the single window system in 2009, alongside the deployment of an E-Government portal to support digital governance initiatives.",
        "• The establishment of the single window system in Azerbaijan was initiated by a presidential decree issued on 30 April 2007, aimed at simplifying export-import procedures, innovating customs services, and improving the overall trade environment.",
        "• In 2008, the Azerbaijani President appointed the State Customs Committee as the primary authority responsible for controlling goods and transportation passing through the country's borders.",
        "• The State Migration Service of Azerbaijan issues permits for foreigners and stateless persons who intend to live and work in Azerbaijan.",
        "• The \"single window\" principle was applied to migration management processes starting from 1 July 2009, following a presidential decree, to streamline migration procedures."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:48.812990",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 11
    },
    {
      "section_number": "3",
      "section_name": "Poverty",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to the Asian Development Bank's estimates from 2017, 5.5% of Azerbaijan's population was living below the poverty line as of 2022.",
        "• The same ADB report estimated that the infant mortality rate in Azerbaijan is approximately 18 deaths per 1,000 live births before the age of 15."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:50.962658",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 2
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 12
    },
    {
      "section_number": "4",
      "section_name": "Other economic indicators",
      "chapter_name": "Economy of Azerbaijan",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Investment, measured as gross fixed capital formation, accounted for 17% of Azerbaijan's GDP in 2011, according to CIA World Factbook data.",
        "• Household income or consumption distribution by percentage share in 2008 showed that the lowest 10% of the population held 3.4% of the income or consumption, whereas the highest 10% held 27.4%.",
        "• The inflation rate for consumer prices was estimated at 1.1% in 2012.",
        "• Utilized agricultural land in Azerbaijan totaled 47,584 square kilometers (18,372 square miles) as of 2011.",
        "• The country’s total wood resources were approximately 144.2 million cubic meters.",
        "• Key agricultural crops included cotton, rice, other grains, grapes, fruit, vegetables, tea, and tobacco.",
        "• Livestock products produced in Azerbaijan comprised beef, mutton, poultry, milk, and eggs.",
        "• Industrial production growth rate was negative at -3% in 2011.",
        "• Electricity production in 2008 was 22.55 billion kilowatt-hours (kWh), with consumption at 18.8 billion kWh.",
        "• Electricity exports in 2008 amounted to 812 million kWh, while imports were 596 million kWh.",
        "• The current account balance was estimated at $11.12 billion in 2011.",
        "• Major exports included petroleum and natural gas, petroleum products, oilfield equipment, steel, iron ore, cement, chemicals, petrochemicals, textiles, machinery, cotton, and foodstuffs.",
        "• Reserves of foreign exchange and gold were valued at approximately $7.146 billion in 2011.",
        "• External debt stood at $3.89 billion in 2011.",
        "• The national currency is the Azerbaijani manat, subdivided into 100 gepik.",
        "• As of 22 November 2020, the exchange rate was approximately 1.7 Azerbaijani manat per US dollar.",
        "• The exchange rate for the euro was approximately 2.01 Azerbaijani manat per euro on the same date.",
        "• Azerbaijan's fiscal year follows the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:30:57.640079",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_azerbaijan.json",
      "original_index": 13
    }
  ]
}