{
  "extraction_info": {
    "source_file": "economy_of_somalia.json",
    "extraction_timestamp": "2025-08-02T17:13:28.944536",
    "total_sections_in_source": 13,
    "extracted_sections_count": 13,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Somalia is classified by the United Nations as a least developed country, with the majority of its population dependent on agriculture and livestock for their livelihood.",
        "• The economy of Somalia is valued at $13.89 billion by gross domestic product (GDP) as of 2025.",
        "• In 1994, the CIA estimated Somalia's GDP at purchasing power parity (PPP) to be approximately $3.3 billion.",
        "• By 2001, Somalia’s GDP was estimated at $4.1 billion.",
        "• In 2009, the CIA estimated Somalia’s GDP had grown to $5.731 billion, with a projected real growth rate of 2.6%.",
        "• In 2014, the International Monetary Fund (IMF) estimated Somalia’s economic activity expanded by 3.7%, primarily driven by growth in the primary and secondary sectors.",
        "• A 2007 British Chambers of Commerce report noted growth in Somalia’s private sector, particularly in the service sector, contrasting with the pre-civil war period when most services and the industrial sector were government-run.",
        "• Substantial private investment in commercial activities has occurred post-civil war, though it remains largely unmeasured.",
        "• This private investment has been largely financed by the Somali diaspora and includes sectors such as trade and marketing, money transfer services, transportation, communications, fishery equipment, airlines, telecommunications, education, health, construction, and hotels.",
        "• According to the United Nations Development Programme (UNDP) Somalia, as of 2012, the country had some of the lowest development indicators globally, with a Human Development Index (HDI) value of 0.285, ranking among the lowest worldwide if comparable data were available.",
        "• When adjusted for significant inequality within Somalia, the HDI is even lower, with the UNDP highlighting widening inequalities across different social groups as a major driver of conflict.",
        "• Somalia’s economy comprises both traditional and modern production methods, with a gradual shift toward more modern industrial techniques.",
        "• The Central Bank of Somalia reports that about 80% of the population are nomadic or semi-nomadic pastoralists who raise goats, sheep, camels, and cattle.",
        "• Nomadic populations also gather resins and gums to supplement their income.",
        "• The World Bank states that Somalia’s economy has suffered due to state failure linked to the country’s civil war.",
        "• Some economists, including libertarian Peter T. Leeson, argue that state collapse has improved economic welfare by ending the predatory nature of the previous Somali state."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:33.423018",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Economic indicators",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to the African Development Bank, Somalia is \"characterized by a severe lack of basic economic and social statistics,\" a situation worsened by the civil war and institutional collapse, although data was often unreliable even before the state's failure.",
        "• The World Bank reports Somalia's GDP was $917.0 million in 1990, with a total population of 13.42 million in 2014, which increased to approximately 15 million by 2018, marking roughly a 12% population growth since 2014.",
        "• In 2018, the World Bank estimated Somalia's annual GDP at $6.2 billion, a figure comparable to the economies of Guam and the Kyrgyz Republic, and classified Somalia as a low-income country.",
        "• The United Nations Statistics Division reported Somalia's GDP as $2.316 billion in 2005, $1.071 billion in 2010, and $1.306 billion in 2012, indicating fluctuations in economic output during that period.",
        "• According to the Central Bank of Somalia, Somalia's GDP per capita as per World Bank data in the 2000s was $230, representing a slight real-term reduction from the 1990 level.",
        "• The 2012 Human Development Report estimated Somalia's per capita GDP at $284, significantly below the sub-Saharan African average of $1,300 per capita, ranking it as the fourth lowest GDP per capita globally.",
        "• Approximately 43% of Somalia's population lives on less than 1 US dollar per day, with 24% of this impoverished population residing in urban areas and 54% in rural areas.",
        "• The United Nations Development Programme (UNDP) Somalia reported in 2012 that the country had some of the world's lowest development indicators and a \"strikingly low\" Human Development Index (HDI) value of 0.285, which would rank among the lowest globally if comparable data were available.",
        "• When adjusted for significant inequality within Somalia, the HDI value is even lower, with the UNDP noting that widening inequalities across different social groups are a major driver of conflict.",
        "• Since 1971, the United Nations has classified Somalia as a least developed country through its Committee for Development Policy.",
        "• An International Monetary Fund (IMF) mission to Somalia estimated GDP growth at 3.7% in 2014 and reported a Consumer Price Index (CPI) inflation rate of -71.10%.",
        "• The IMF report projected that if Somalia's security situation modestly improves and drought conditions are avoided, medium-term economic growth should average 5%, although this growth would remain insufficient to significantly reduce poverty and gender disparities.",
        "• In 2016, an estimated 73% of Somalia's population lived below the poverty line, underscoring persistent widespread poverty despite economic growth projections."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:34.241427",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "State failure and economic welfare",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to the World Bank, within two years of the outbreak of civil war in 1988, Somali state institutions collapsed, resulting in the destruction of most economic and social infrastructure and assets.",
        "• In 2003, the World Bank reported that despite the absence of a state and its institutions, the Somali private sector experienced impressive growth; however, many sectors were becoming stagnant or hindered in growth due to lack of investment, trained manpower, and absence of a relevant legal and regulatory framework to enforce rules, common standards, and quality control.",
        "• The 2003 World Bank report highlighted difficulties in encouraging and utilizing domestic savings for investment in Somalia, primarily due to the lack of formal financial services and regulatory agencies.",
        "• The absence of state institutions in Somalia prevented access to international capital markets, according to the World Bank.",
        "• In a 2007 article, libertarian economist Peter T. Leeson argued that the Somali state was predatory, and its collapse improved the economic welfare of its citizens, with 14 out of 18 key development indicators showing more positive outcomes during 2000-2005 compared to 1985–1990.",
        "• Economists Benjamin Powell, Ryan Ford, and Alex Nowrasteh similarly argued that Somalia's economic performance relative to other African states improved during the period of statelessness.",
        "• Ersun Kurtulus stated that the articles by Leeson, Powell, Ford, and Nowrasteh provide the most unequivocal evidence indicating that Somalia fared far better under anarchy than under Siad Barre's regime.",
        "• Kurtulus argued that while these authors may offer a valid explanation of Somalia’s situation, their argument is rooted in a liberal conceptualization of statehood rather than based on quantitative analysis establishing a negative correlation between state predation indicators and economic and social welfare.",
        "• Kurtulus suggested that the collapse of a repressive state may improve personal and civil liberties but criticized the overemphasis on endogenous domestic factors, noting that such accounts neglect exogenous factors operating at regional and international levels."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:31.585048",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 2
    },
    {
      "section_number": "3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Agriculture is the most important economic sector in Somalia, accounting for approximately 65% of the GDP and employing 65% of the workforce.",
        "• Livestock contributes about 40% to Somalia's GDP and generates more than 50% of the country's export earnings.",
        "• Other principal exports from Somalia include fish, charcoal, and bananas, while sugar, sorghum, and corn are primarily produced for the domestic market.",
        "• According to the Central Bank of Somalia, annual imports of goods total about $460 million, having recovered and even surpassed aggregate import levels prior to the onset of the civil war in 1991.",
        "• Annual exports amount to approximately $270 million, exceeding pre-war aggregate export levels, yet Somalia continues to experience a trade account deficit of about $190 million per year.",
        "• The trade deficit is substantially offset by remittances sent by Somalis in the diaspora, which have been crucial in sustaining the country's import levels.",
        "• Somalia's geographic proximity to the Arabian Peninsula has enabled Somali traders to increasingly challenge Australia's traditional dominance in the Persian Gulf Arab livestock and meat market by offering quality animals at very competitive prices.",
        "• In response to this competition, Persian Gulf Arab states have initiated strategic investments in Somalia, including Saudi Arabia's development of livestock export infrastructure and the United Arab Emirates' acquisition of large farmlands.",
        "• Commercial fishing agreements have been established in northern Puntland, attracting fishing fleets from Europe and Asia.",
        "• In 2012, Somalia exported 3 million sheep to the Middle East, surpassing Australia's 2 million sheep exports to the same region.",
        "• The Australian Bureau of Agricultural and Resource Economics and Sciences reports that 99% of Australia's livestock exports are destined for the Middle East; however, since 2006, Australian exports have declined by 10% due to increased competition from African and Eastern European sheep exports.",
        "• Somalia exported more than 5 million livestock in 2014, marking the highest volume in 20 years.",
        "• Somaliland, a neighboring region, hosts some of the largest livestock markets (known locally as seylad) in the Horn of Africa, with daily sales of up to 10,000 heads of sheep and goats in the markets of Burao and Yirowe.",
        "• Livestock from these markets is frequently shipped to Gulf states via the port of Berbera, and the markets handle animals sourced from across the Horn of Africa.",
        "• Frankincense and myrrh are significant export products for Somalia; together with Ethiopia and Kenya, Somalia ranks among the world's three largest suppliers of these aromatic resins.",
        "• The Las Qoray brand of canned tuna fish is produced in Las Khorey, reflecting Somalia's engagement in fish processing and export."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:33.549229",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 3
    },
    {
      "section_number": "4",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The industrial sector in Somalia is modest and primarily based on the processing of agricultural products, contributing approximately 10% to the country's Gross Domestic Product (GDP).",
        "• Before the civil war erupted in 1991, Somalia had about 53 state-owned manufacturing firms of varying sizes—small, medium, and large—that were struggling financially.",
        "• The civil war that began in 1991 caused significant destruction to many of Somalia's remaining industrial facilities, severely impacting the manufacturing sector.",
        "• Despite the conflict, substantial local investment from the Somali diaspora has led to the reopening of many small-scale manufacturing plants and the establishment of new ones.",
        "• New manufacturing enterprises include fish-canning and meat-processing plants located in northern Somalia.",
        "• Approximately 25 factories operate in the Mogadishu area, producing a diverse range of products such as pasta, mineral water, confections, plastic bags, fabric, hides and skins, detergent and soap, aluminum goods, foam mattresses and pillows, fishing boats, packaging services, and stone processing.",
        "• By 2001, light manufacturing investments had expanded notably in the cities of Bosaso, Hargeisa, and Mogadishu, signaling increasing business confidence in Somalia’s economic prospects.",
        "• In 2004, a Coca-Cola bottling plant was inaugurated in Mogadishu with an investment of $8.3 million; the investors came from various constituencies within Somalia.",
        "• Foreign investment has also been attracted to Somalia’s manufacturing and related sectors, with companies such as General Motors and Dole Fruit participating in the economy."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:26.007772",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 4
    },
    {
      "section_number": "5",
      "section_name": "Airline industry",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Somali Airlines officially suspended all operations in 1991 following the onset of the civil war in Somalia.",
        "• By 2014, the void left by Somali Airlines was filled by over six Somali-owned private airlines, including Daallo Airlines, Jubba Airways, African Express Airways, East Africa 540, Central Air, and Hajara.",
        "• In 2015, Daallo Airlines and Jubba Airways merged to form the African Airways Alliance, consolidating their operations.",
        "• Despite reports in 2012 and 2013 about plans to relaunch Somali Airlines, no official Somali national flag carrier existed after Somali Airlines ceased operations in 1991.",
        "• Al Arabiya's February 2015 coverage of the Daallo-Jubba merger confirmed the absence of an official Somali flag carrier since the demise of Somali Airlines."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:25.644475",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 5
    },
    {
      "section_number": "6",
      "section_name": "Construction",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2015, the Economist Intelligence Unit reported that improved security conditions in Mogadishu facilitated the construction of new infrastructure and the repair of previously abandoned villas within the city.",
        "• Despite developments in Mogadishu, the Central Intelligence Agency's publication, The World Factbook, indicates that such construction and development activities have not extended to other regions of Somalia.",
        "• The World Factbook also emphasizes that security remains a significant concern for businesses operating in Mogadishu, potentially limiting broader economic and infrastructural growth."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:27.695432",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 6
    },
    {
      "section_number": "7",
      "section_name": "Telecommunications and media",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Somalia's telecommunications system was destroyed during the fighting in 1991, resulting in a complete collapse of infrastructure.",
        "• By 2010, various new telecommunications companies had emerged to provide the missing infrastructure, funded by Somali entrepreneurs and supported by expertise from the People's Republic of China, Japan, the European Union, and Korea.",
        "• These emerging telecommunications firms offered affordable mobile phone and internet services, which were unavailable in many other parts of Africa, enabling customers to conduct money transfers, banking activities via mobile phones, and access wireless internet easily.",
        "• Despite these advancements, the operations of telecommunications companies were constrained by ongoing fighting and insecurity in the country.",
        "• In 2004, the installation time for a landline in Somalia was three days, a stark contrast to Kenya, where waiting lists for landlines extended for many years.",
        "• Telecommunications firms interviewed in 2004 expressed desperation for an effective government, emphasizing that \"everything starts with security\" as a prerequisite for growth.",
        "• At that time, Somalia had approximately 25 mainlines per 1,000 persons, with a local telephone line availability (tele-density) higher than neighboring countries and three times greater than adjacent Ethiopia.",
        "• Prominent Somali telecommunications companies included Golis Telecom Group, Hormuud Telecom, Somafone, Nationlink, Netco, Telcom, and Somali Telecom Group.",
        "• Hormuud Telecom alone generated gross revenues of about $40 million annually.",
        "• To reduce competitive pressures, three major telecommunications companies signed an interconnectivity agreement in 2005, allowing them to set prices collaboratively and expand their networks.",
        "• A 2010 report highlighted the expansion of Somalia's telecom industry as one of the clearest indicators of the country's economic growth.",
        "• By 2015, Somalia had developed a media landscape comprising 20 privately owned newspapers, 10 radio and television stations, and numerous internet sites providing information to the public."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:32.810116",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 7
    },
    {
      "section_number": "8",
      "section_name": "Finance",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Central Bank of Somalia is the official monetary authority responsible for formulating and implementing monetary policy, currently in the process of assuming these tasks fully.",
        "• In 2013, the African Development Bank assessed that the Somali Central Bank was \"handicapped by the lack of adequate human, material and financial resources,\" but anticipated it would reduce inflation once it controlled monetary policy and issued a new currency.",
        "• At the same time, Somaliland maintained its own central bank, primarily serving as a government treasury and currency printer, rather than a full monetary authority.",
        "• Due to a lack of confidence in the Somali shilling, the US dollar is widely accepted as a medium of exchange alongside the local currency, a phenomenon known as dollarization.",
        "• Despite dollarization, the large issuance of Somali shillings has caused inflation, which the Central Bank aims to end by assuming full control of monetary policy and replacing the currency currently issued by the private sector.",
        "• Somalia lacked a central monetary authority for over 15 years following the civil war outbreak in 1991 until the Central Bank of Somalia was re-established in 2009.",
        "• The absence of formal bank-to-bank transfers led to the rise of private money transfer operators (MTOs), which function as informal banking networks within Somalia.",
        "• These remittance firms, known as hawalas, form a significant industry in Somalia, with an estimated US$1.6 billion annually remitted by the Somali diaspora through money transfer companies.",
        "• Prominent Somali MTOs include Dahabshiil, Qaran Express, Mustaqbal, Amal Express, Kaah Express, Hodan Global, Olympic, Amana Express, Iftin Express, and Tawakal Express.",
        "• Most Somali MTOs are members of the Somali Money Transfer Association (SOMTA) or its predecessor, the Somali Financial Services Association (SFSA), which regulate the community's money transfer sector.",
        "• Somalia ranks as the world's fourth-most remittance-dependent country, with remittances accounting for between 20% and 50% of the Somali economy.",
        "• Dahabshiil is the largest Somali MTO, having taken over much of the market previously held by Al-Barakaat; it is headquartered in London, employs over 2,000 people across 144 countries, and operates 130 branches in the UK, 130 in Somalia, and 400 globally, including one in Dubai.",
        "• Dahabshiil offers a wide range of financial services to international organizations, businesses of all sizes, and private individuals.",
        "• Qaran Express is the second-largest Somali-owned funds transfer company, headquartered in London and Dubai, with 175 agents worldwide, including 66 in Somalia and 64 in London; it charges no fees for remitting charity funds.",
        "• Mustaqbal ranks as the third most prominent Somali MTO, with 8 agents in Somalia and 49 in the UK, and maintains a notable international presence similar to Dahabshiil and Qaran Express.",
        "• As the Central Bank of Somalia fully assumes monetary policy responsibilities, some existing money transfer companies are expected to seek licenses to become full-fledged commercial banks, which will expand the national payments system to include formal cheque usage.",
        "• The expansion of the payments system is anticipated to enhance the effectiveness of monetary policy in managing Somalia’s domestic macroeconomy.",
        "• Improved local security has encouraged Somali expatriates to return for investment opportunities, and alongside modest foreign investment, this inflow of funds has significantly increased the value of the Somali shilling.",
        "• By March 2014, the Somali shilling had appreciated by nearly 60% against the US dollar over the previous 12 months.",
        "• Bloomberg reported that the Somali shilling was the strongest currency among 175 global currencies traded during that period, rising approximately 50 percentage points higher than the next most robust global currency."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:43.055779",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 8
    },
    {
      "section_number": "9",
      "section_name": "Stock exchange",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Somalia Stock Exchange (SSE) serves as the national stock exchange of Somalia, established to facilitate investment and economic growth within the country.",
        "• The SSE was founded in 2012 by Somali diplomat Idd Mohamed, who holds the titles of Ambassador Extraordinary and Deputy Permanent Representative to the United Nations.",
        "• The primary objective of the SSE is to attract investment from both Somali-owned companies and international firms to support and accelerate Somalia's post-conflict reconstruction efforts.",
        "• In August 2012, the SSE entered into a Memorandum of Understanding (MoU) with the Nairobi Securities Exchange (NSE) aimed at assisting the SSE in its technical development and capacity building.",
        "• The MoU with NSE includes provisions for identifying appropriate expertise and support to enhance the operational capabilities of the Somalia Stock Exchange.",
        "• The agreement also envisions the introduction of Sharia-compliant financial instruments, specifically sukuk bonds and halal equities, as part of the SSE’s development strategy to cater to Islamic finance principles.",
        "• By November 2014, the Somalia Stock Exchange had established administrative offices in key urban centers, including Mogadishu and Kismayo, among other locations within Somalia.",
        "• The official opening of the Somalia Stock Exchange was planned for 2015, marking a significant milestone in the country’s financial sector development.",
        "• At its launch, the SSE was expected to list shares from seven Somali-owned companies operating in the financial services, telecommunications, and transportation sectors to attract prospective global investors."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:41.111102",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 9
    },
    {
      "section_number": "10",
      "section_name": "Natural Resources",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Somalia possesses untapped reserves of various natural resources, including uranium, iron ore, tin, gypsum, bauxite, copper, salt, and natural gas.",
        "• Australian and Chinese oil companies have been granted licenses to explore petroleum and other natural resources within Somalia.",
        "• Range Resources, an oil company listed in Sydney, projects that the Puntland province in northern Somalia could potentially produce between 5 billion barrels (790×10^6 m³) and 10 billion barrels (1.6×10^9 m³) of oil.",
        "• In response to these developments, the Somali federal government established the Somali Petroleum Company to oversee petroleum exploration and development.",
        "• In the late 1960s, United Nations geologists discovered major uranium deposits and other rare mineral reserves in Somalia, marking the largest find of its kind at that time.",
        "• Industry experts estimated that Somalia’s uranium deposits accounted for over 25% of the world’s known uranium reserves, which totaled approximately 800,000 tons during that period.",
        "• The 1984 IUREP (International Uranium Resources Evaluation Project) Orientation Phase Mission to Somalia reported the country had 5,000 tons of uranium classified as reasonably assured resources (RAR).",
        "• Additionally, Somalia was estimated to have 11,000 tons of uranium as estimated additional resources (EAR) located in calcrete deposits.",
        "• Speculative resources (SR) of uranium in Somalia were potentially as high as 150,000 tons, found in sandstone and calcrete deposits.",
        "• Somalia developed into a significant global supplier of uranium, attracting mineral extraction interests from American, United Arab Emirates, Italian, and Brazilian companies competing for mining rights.",
        "• Link Natural Resources holds stakes in Somalia’s central region natural resources, while Kilimanjaro Capital controls the 1,161,400-acre Amsas-Coriole-Afgoi (ACA) Block, which includes uranium exploration activities.",
        "• Besides uranium, Somalia also contains unspecified quantities of yttrium, a rare earth element and valuable mineral resource."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:41.113647",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 10
    },
    {
      "section_number": "11",
      "section_name": "Energy",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In mid-2010, Somalia's business community committed to investing $1 billion in the national gas and electricity industries over the subsequent five years.",
        "• Abdullahi Hussein, director of the newly formed Trans-National Industrial Electricity and Gas Company, forecasted that this investment strategy would generate 100,000 jobs.",
        "• The Trans-National Industrial Electricity and Gas Company was created through the merger of five Somali companies operating in the trade, finance, security, and telecommunications sectors.",
        "• The first phase of the project commenced within six months of the company's establishment, focusing on training youth to provide electricity to economic areas and communities.",
        "• The second phase began in mid-to-late 2011, involving the construction of factories in specially designated economic zones targeting the fishing, agriculture, livestock, and mining industries.",
        "• In 2012, the Farole administration approved the first official oil exploration project in Puntland and Somalia overall.",
        "• The oil exploration was led by the Canadian oil company Africa Oil and its partner Range Resources.",
        "• Initial drilling at the Shabeel-1 well on Puntland's Dharoor Block in March 2012 successfully yielded oil.",
        "• The Central Bank of Somalia stated that as the nation pursues reconstruction, the economy is expected not only to recover to pre-civil war levels but also to experience accelerated growth and development due to Somalia’s untapped natural resources."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:39.160589",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 11
    },
    {
      "section_number": "12",
      "section_name": "Data",
      "chapter_name": "Economy of Somalia",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economic data for Somalia from 1960 to 2022 includes nominal GDP, nominal GDP per capita, GDP in purchasing power parity (PPP), GDP per capita in PPP, and real GDP growth rates where available.",
        "• In 1960, Somalia's nominal GDP was 0.2 billion US dollars, with a nominal GDP per capita of 63 US dollars; data for GDP in PPP, GDP per capita in PPP, and real GDP growth were not available.",
        "• By 1970, nominal GDP increased to 0.3 billion US dollars, and nominal GDP per capita rose to 87 US dollars; PPP data and growth rates remained unspecified.",
        "• In 1980, Somalia's nominal GDP reached 0.6 billion US dollars, with a nominal GDP per capita of 102 US dollars; PPP and growth data were still not provided.",
        "• The year 1990 saw nominal GDP at 0.9 billion US dollars and nominal GDP per capita at 131 US dollars, with no available data on PPP or real GDP growth.",
        "• In 2013, Somalia's nominal GDP significantly increased to 5.8 billion US dollars, nominal GDP per capita to 454 US dollars, GDP in PPP was 13.5 billion US dollars, and GDP per capita in PPP was 1,052 US dollars; real GDP growth data was not reported.",
        "• For 2014, nominal GDP rose to 6.5 billion US dollars, nominal GDP per capita to 491 US dollars, GDP in PPP to 16.3 billion US dollars, and GDP per capita in PPP to 1,222 US dollars, with a real GDP growth rate of 7.5%.",
        "• In 2015, Somalia's nominal GDP was 7.0 billion US dollars, nominal GDP per capita was 508 US dollars, GDP in PPP was 19.6 billion US dollars, GDP per capita in PPP was 1,422 US dollars, and the real GDP growth rate was 9.9%.",
        "• The year 2016 recorded a nominal GDP of 7.4 billion US dollars, nominal GDP per capita of 517 US dollars, GDP in PPP of 21.5 billion US dollars, GDP per capita in PPP of 1,506 US dollars, and a real GDP growth rate of 6.4%.",
        "• In 2017, Somalia's nominal GDP increased to 8.4 billion US dollars, nominal GDP per capita to 555 US dollars, GDP in PPP to 23.2 billion US dollars, GDP per capita in PPP to 1,558 US dollars, with a real GDP growth rate of 9.5%.",
        "• For 2018, nominal GDP slightly decreased to 8.3 billion US dollars, nominal GDP per capita to 537 US dollars, GDP in PPP rose to 24.4 billion US dollars, GDP per capita in PPP to 1,585 US dollars, and the real GDP growth rate was 3.0%.",
        "• In 2019, nominal GDP increased to 9.2 billion US dollars, nominal GDP per capita to 590 US dollars, GDP in PPP to 25.8 billion US dollars, GDP per capita in PPP to 1,613 US dollars, with a real GDP growth rate of 3.6%.",
        "• The year 2020 saw nominal GDP remain at 9.2 billion US dollars, nominal GDP per capita decrease to 557 US dollars, GDP in PPP slightly decrease to 25.4 billion US dollars, GDP per capita in PPP to 1,538 US dollars, and a negative real GDP growth rate of −2.6%.",
        "• In 2021, Somalia's nominal GDP rose to 9.8 billion US dollars, nominal GDP per capita to 577 US dollars, GDP in PPP to 27.5 billion US dollars, GDP per capita in PPP to 1,609 US dollars, with a real GDP growth rate of 3.3%.",
        "• By 2022, nominal GDP increased to 10.4 billion US dollars, nominal GDP per capita to 592 US dollars, GDP in PPP to 30.1 billion US dollars, GDP per capita in PPP to 1,711 US dollars, and the real GDP growth rate was 2.4%."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:47.511101",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_somalia.json",
      "original_index": 12
    }
  ]
}