{
  "extraction_info": {
    "source_file": "economy_of_venezuela.json",
    "extraction_timestamp": "2025-08-02T17:13:29.394094",
    "total_sections_in_source": 26,
    "extracted_sections_count": 26,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Venezuela is primarily based on petroleum, with the country holding the largest crude oil reserves in the world.",
        "• Historically, Venezuela was among the wealthiest economies in South America, especially from the 1950s to the 1980s.",
        "• During the 21st century, under socialist populist leaders Hugo Chávez and Nicolás Maduro, Venezuela’s economy collapsed, causing millions of citizens to flee the country.",
        "• Venezuela’s GDP has fallen by 80 percent in less than a decade, reflecting severe economic decline.",
        "• The Venezuelan economy is marked by corruption, food shortages, high unemployment, mismanagement of the oil sector, and hyperinflation since 2014.",
        "• As of 2024, inflation in Venezuela has stabilized at 59.61%.",
        "• Venezuela ranks as the 25th largest oil producer globally and is the 8th largest member of the Organization of the Petroleum Exporting Countries (OPEC).",
        "• The country manufactures and exports heavy industry products such as steel, aluminum, and cement, as well as electronics, automobiles, beverages, and foodstuffs.",
        "• Agriculture contributes approximately 4.7% to Venezuela’s GDP, employs 7.3% of the labor force, and occupies at least one-fourth of the country’s land area.",
        "• Venezuelan agricultural exports include rice, corn, fish, tropical fruit, coffee, pork, and beef.",
        "• Venezuela has an estimated US$14.3 trillion worth of natural resources but is not self-sufficient in most agricultural areas.",
        "• Exports account for 16.7% of Venezuela’s GDP, with petroleum products comprising about 95% of those exports.",
        "• Since the 1920s, Venezuela has functioned as a rentier state, relying heavily on oil as its main export commodity.",
        "• From the 1950s to the early 1980s, Venezuela experienced steady economic growth, attracting many immigrants and achieving the highest standard of living in Latin America.",
        "• The economic situation reversed during the 1980s following a collapse in oil prices.",
        "• Hugo Chávez became president in 1999 and initiated the Bolivarian Revolution, a form of socialism that led to the collapse or nationalization of many Venezuelan businesses.",
        "• Chávez’s administration purged the state-run oil company PDVSA, replacing thousands of workers with political supporters lacking technical expertise.",
        "• In 2003, the Chávez government imposed stringent currency controls to prevent capital flight, which contributed to declining oil production and exports and multiple currency devaluations.",
        "• Government policies including price controls, expropriation of farmlands and industries, and near-total restrictions on access to foreign currency at official exchange rates caused severe shortages of common goods such as food, water, household products, spare parts, tools, and medical supplies.",
        "• These shortages forced many manufacturers to reduce production, close operations, or leave Venezuela entirely, affecting technological firms and most automobile manufacturers.",
        "• Venezuela’s economy has been in total collapse since 2013.",
        "• In 2015, Venezuela experienced over 100% inflation, the highest in the world and the highest in the country’s history at that time.",
        "• Independent sources reported hyperinflation reaching 80,000% by the end of 2018, with nearly 90% of the population living in poverty.",
        "• On 14 November 2017, credit rating agencies declared Venezuela in default on its debt payments, with Standard & Poor’s categorizing the country as in \"selective default.\"",
        "• Despite strained diplomatic relations, the United States remains Venezuela’s most important trading partner.",
        "• American exports to Venezuela include machinery, agricultural products, medical instruments, and automobiles.",
        "• Venezuela is among the top four foreign oil suppliers to the United States.",
        "• Approximately 500 American companies operate in Venezuela.",
        "• According to the Central Bank of Venezuela, the government received around US$325 billion from oil production and exports between 1998 and 2008.",
        "• The International Energy Agency reported in August 2015 that Venezuela produced 2.4 million barrels of oil per day, supplying 500,000 barrels daily to the United States.",
        "• A 2022 report by Transparencia Venezuela estimated that illegal activities constitute around 21% of Venezuela’s GDP."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:10.803177",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 31
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "2020-present",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of early 2024, nearly 82% of Venezuelans live in poverty, with 53% experiencing extreme poverty, rendering them unable to afford basic foodstuffs, according to a UN special reporter’s statement following a visit to the country in February 2024.",
        "• Venezuela was historically one of South America's wealthiest countries prior to the economic collapse under the regime of President Nicolás Maduro.",
        "• The country’s GDP has plummeted by 80% in less than ten years, resulting in approximately seven million Venezuelans fleeing the nation, as reported by Voice of America (VOA) citing AFP in 2024.",
        "• The majority of Venezuelans survive on only a few dollars per month, while the healthcare and education systems are in complete disrepair, compounded by severe shortages of electricity and fuel as of 2024.",
        "• Transparencia Venezuela published a report in 2022 estimating that illegal activities accounted for about 21% of Venezuela’s GDP, highlighting the significant role of illicit economies in the national financial landscape.",
        "• The 2022 report detailed that drug trafficking, oil and gold smuggling, and illegal operations in ports and customs collectively generated over 9.4 billion US dollars for organized crime networks, which are protected by corrupt officials.",
        "• In 2021, gold extraction in Venezuela produced approximately 2.3 billion US dollars in revenue, but the Venezuelan state only received 25% of this amount.",
        "• By 2023, Venezuela’s economic situation showed signs of improvement, with the economy expanding by 15% and a reduction in extreme poverty rates attributed to economic liberalization and increased access to the United States dollar.",
        "• Despite economic growth, income inequality remained pronounced in 2023, with the wealthiest Venezuelans earning more than 70 times the income of the poorest segments of the population.",
        "• Inflation in Venezuela cooled to a monthly rate of 1.7% in 2024, marking the lowest inflation rate in a decade, a development linked to the injection of US dollars from Chevron’s operations in the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:01.282326",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 1
    },
    {
      "section_number": "2",
      "section_name": "History",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The \"History\" section of the \"Economy of Venezuela\" chapter currently lacks detailed content and requires expansion to include the economic history of Venezuela dating back to its independence.",
        "• The section invites contributions to enhance its coverage of Venezuela's economic development over time.",
        "• Relevant discussions and suggestions for expanding this section can be found on the article's talk page as of April 2021."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:28:56.566295",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 3
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 2
    },
    {
      "section_number": "2.1",
      "section_name": "1922–1959",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1922, oil was discovered in Venezuela during the Maracaibo strike, marking a pivotal moment in the country's economic history.",
        "• Venezuelan dictator Juan Vicente Gómez permitted American oil companies to draft Venezuela's petroleum law, establishing early foreign influence in the oil sector.",
        "• In 1943, Standard Oil of New Jersey accepted a new agreement with Venezuela based on the 50–50 profit-sharing principle, which was described as \"a landmark event\" in the country's oil industry.",
        "• More favorable terms for Venezuela were negotiated in 1945 following a coup that installed a left-leaning government including Juan Pablo Pérez Alfonso, who played a significant role in shaping oil policy.",
        "• From the 1950s through the early 1980s, Venezuela experienced strong and prosperous economic growth fueled by high oil prices, positioning it as one of South America's most robust economies.",
        "• The sustained economic growth during this period attracted a significant influx of immigrants to Venezuela.",
        "• In 1958, a new Venezuelan government, again involving Juan Pablo Pérez Alfonso, developed a plan for an international oil cartel, which eventually became the Organization of the Petroleum Exporting Countries (OPEC).",
        "• Under the dictatorship of Marcos Pérez Jiménez from 1952 to 1958, Venezuela achieved remarkably high GDP growth rates, with real GDP per capita in the late 1950s nearly reaching the levels of Ireland and West Germany, despite West Germany's post-World War II recovery challenges.",
        "• By 1950, Venezuela was ranked as the world's 4th wealthiest nation on a per capita basis, reflecting its rapid economic advancement.",
        "• Rómulo Betancourt, serving as president from 1959 to 1964, inherited a substantial internal and external debt burden caused by excessive public spending during the late 1950s.",
        "• Betancourt successfully balanced Venezuela's public budget and initiated agrarian reform policies aimed at addressing economic and social issues inherited from previous administrations."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:28:58.753375",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 3
    },
    {
      "section_number": "2.2",
      "section_name": "1960s–1990s",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During the 1960s and 1970s, Venezuela's strong oil sector enabled governments to maintain social harmony by allocating substantial funds to public programs such as health care, education, transport, and food subsidies, significantly benefiting literacy and welfare initiatives.",
        "• Carlos Andrés Pérez’s first presidential term (1974–1979) capitalized on the 1970s energy crisis, resulting in a tripling of public spending and the nationalization of the oil industry through the establishment of Petróleos de Venezuela, S.A. (PDVSA).",
        "• Pérez’s administration increased government debt considerably, nationalized the iron industry, created new state-owned enterprises, nationalized the central bank, and replaced its board with cabinet members, effectively eliminating the bank’s independence.",
        "• Under Pérez, the government enacted the first minimum wage and salary increases via an enabling act passed by the National Congress, though his administration faced accusations of excessive and disorderly public spending.",
        "• Venezuela’s external debt escalated dramatically from US$2 billion in 1972 to US$33 billion by 1982.",
        "• The economic situation deteriorated in the 1980s following a collapse in oil prices, coinciding with Luis Herrera Campins’s presidency, during which the economy contracted and consumer price inflation ranged between 6% and 12% from 1982 to 1986.",
        "• Herrera’s policies aimed at reducing inflation and curbing government spending proved ineffective, leading to Jaime Lusinchi’s election in 1983.",
        "• The Lusinchi administration maintained strict foreign exchange controls and continued excessive government spending amid declining oil prices, prioritizing debt repayment by sending US$15 billion to international lenders from 1985 to 1988 to service the remaining US$32 billion debt.",
        "• By the end of Lusinchi’s presidency, the Venezuelan public experienced inflation-driven price increases and shortages of basic goods.",
        "• Carlos Andrés Pérez campaigned in the 1988 presidential election on his prior legacy of economic abundance and initially rejected liberalization policies despite Venezuela’s international reserves being only US$300 million at his election.",
        "• Pérez responded to economic challenges by liberalizing the economy through a technocratic cabinet and a series of macroeconomic reforms known as _El Gran Viraje_ (\"The Great Turn\"), derogatorily called _El Paquetazo Económico_ (\"The Economic Package\") by critics.",
        "• Key reform measures included reducing fuel subsidies and increasing public transportation fares by 30% (from VEB 16, approximately US$0.4), with the fare increase scheduled for 1 March 1989 but implemented prematurely on 27 February by bus drivers.",
        "• The premature fare hike triggered protests and rioting beginning on 27 February 1989 in Guarenas, near Caracas; the unrest spread rapidly due to delayed government response and a labor strike by the Caracas Metropolitan Police.",
        "• By late 1991, Pérez’s administration had privatized several state assets, including three banks, a shipyard, two sugar mills, an airline, a telephone company, and a cellular phone band, generating total revenues of US$2,287 million.",
        "• The most notable privatization was that of CANTV, the state telecommunications company, sold for US$1,885 million to a consortium comprising American AT&T International, General Telephone Electronic, Venezuelan Electricidad de Caracas, and Banco Mercantil.",
        "• The CANTV sale ended Venezuela’s telecommunications monopoly and exceeded expectations by over US$1,000 million above the base price and US$500 million more than competing bids.",
        "• By the end of 1991, inflation had decreased from 84% in 1989 to 31%, international reserves had increased to US$14 billion, and the economy experienced a 9% growth rate, described as \"Asian growth,\" the highest in Latin America at the time.",
        "• Despite economic growth and debt repayment, by 1992 the benefits were largely confined to the upper class, while the middle and lower classes faced rising poverty and unemployment rates ranging from 10% to 40%.",
        "• Venezuela’s economic difficulties were exacerbated by overreliance on oil exports and a fragmented political system lacking consensus on policy direction.",
        "• Under President Rafael Caldera in the mid-1990s, Venezuela experienced annual inflation rates of 50–60% between 1993 and 1997, alongside a banking crisis.",
        "• By 1998, the economic crisis had deepened: per capita GDP was equivalent to its 1963 level when adjusted for inflation, representing a one-third decline from its 1978 peak, and the purchasing power of the average salary had fallen to one-third of its 1978 value."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:10.982177",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 21
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 4
    },
    {
      "section_number": "2.3",
      "section_name": "1999–2013",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Hugo Chávez was elected President of Venezuela in December 1998 and assumed office in February 1999, initiating a period of significant economic developments from 1999 to the end of 2012 when his health deteriorated, preventing him from fulfilling presidential duties.",
        "• During Chávez’s presidency from 1999 to 2012, Venezuela’s GDP grew from 97.52 billion US dollars to 372.59 billion US dollars, while inflation remained relatively stable around 20% annually.",
        "• In 1999 and 2000, soaring oil prices provided Chávez with unprecedented funds since Venezuela's economic collapse in the 1980s, enabling him to implement social democratic economic policies that heavily relied on oil revenues to finance social programs, thereby increasing Venezuela’s economic dependence on high oil prices.",
        "• The Venezuelan economy initially experienced growth between 1999 and 2001 but then contracted from 2001 to 2003, returning GDP to levels similar to those of 1997; this downturn was influenced by low oil prices, the 2002 coup attempt, the 2002–2003 general strike, capital flight, and reduced foreign investment.",
        "• Venezuela’s GDP decreased from 50.0 trillion bolívares in 1998 to 42.4 trillion bolívares in 2003, measured in constant 1998 bolívares, reflecting the economic contraction during this period.",
        "• The most severely affected economic sectors during the 2002–2003 recession were construction (−55.9%), petroleum (−26.5%), commerce (−23.6%), and manufacturing (−22.5%).",
        "• The petroleum sector’s decline was due to Venezuela’s adherence to the OPEC production quota established in 2002 and the near cessation of exports caused by the PdVSA-led general strike of 2002–2003.",
        "• The non-petroleum sector contracted by 6.5% in 2002, illustrating the broad economic impact beyond oil.",
        "• The Venezuelan bolívar, which had experienced serious inflation and devaluation since the late 1980s, stabilized during Chávez’s presidency with inflation maintained around 20%.",
        "• Inflation was significantly reduced compared to previous decades, dropping from a peak of 100% in 1996 to an average of about 20% during Chávez’s tenure; specifically, inflation measured by the consumer price index was 35.8% in 1998, fell to 12.5% in 2001, and rose again to 31.1% in 2003.",
        "• On January 23, 2003, in response to pressures on the bolívar, declining international reserves, and the economic effects of the oil industry strike, Venezuela’s Ministry of Finance and central bank suspended foreign exchange trading.",
        "• Subsequently, on February 6, 2003, the government established CADIVI, a currency control board that regulated foreign exchange procedures and fixed the exchange rate at 1,596 bolívares per US dollar for purchases and 1,600 bolívares per US dollar for sales.",
        "• The Venezuelan housing market contracted significantly during Chávez’s presidency, as developers avoided investment due to widespread government expropriation of property.",
        "• According to The Heritage Foundation and The Wall Street Journal, Venezuela had the weakest property rights globally, scoring only 5.0 out of 100, with expropriation without compensation being a common practice.",
        "• The housing shortage was severe enough that in 2007, squatters occupied the Centro Financiero Confinanzas, an unfinished economic complex originally intended to symbolize Venezuela’s economic growth.",
        "• In the first quarter of 2010, Venezuela’s economy contracted by 5.8% compared to the same period in 2009, while inflation reached 30.5%, the highest rate in Latin America at that time.",
        "• Despite President Chávez’s expressed optimism regarding economic recovery in 2010, the International Monetary Fund (IMF) projected Venezuela would be the only Latin American country to remain in recession that year, describing its recovery as \"delayed and weak\" relative to regional peers.",
        "• After 2010, Venezuela’s economy resumed a growth trend that continued until 2012, with the economic downturn beginning under Nicolás Maduro’s leadership as Chávez’s health declined and his governance capacity diminished."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:12.646067",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 5
    },
    {
      "section_number": "2.4",
      "section_name": "2013–2020",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2013, Venezuela ranked highest globally on the misery index, indicating severe economic and social distress, while the International Finance Corporation ranked it 180th out of 185 countries in the Doing Business 2013 report, with particularly poor scores in protecting investors and tax policies.",
        "• Early 2013 saw the devaluation of the bolívar fuerte amid growing shortages of essential goods such as toilet paper, milk, and flour; healthcare was severely impacted, exemplified by the University of Caracas Medical Hospital halting surgeries in 2014 due to lack of supplies, compounded by government policies restricting drug and medical supply imports.",
        "• The 2014 Venezuelan protests included opposition demonstrators highlighting scarcity issues, with signs protesting shortages of basic goods.",
        "• Venezuela entered an economic recession in 2014, with GDP contracting by −3.0%, and maintained its position atop the misery index for a second consecutive year; The Economist described Venezuela as \"probably the world's worst-managed economy,\" while Citibank labeled the economy a \"disaster\" with little prospect for improvement.",
        "• The Doing Business 2014 report downgraded Venezuela to 181st out of 185 countries, and the Heritage Foundation ranked it 175th out of 178 in economic freedom, classifying it as a \"repressed\" economy; Foreign Policy ranked Venezuela last globally on its Base Yield Index due to low investor returns.",
        "• A 2014 report by Zurich Financial Services, cited by Bloomberg, named Venezuela the riskiest emerging market worldwide; numerous multinational companies including Toyota, Ford, General Motors, Air Canada, Air Europa, American Airlines, Copa Airlines, TAME, TAP Airlines, and United Airlines reduced or ceased operations due to Venezuela's inability to provide hard currency payments, owing billions to these foreign firms.",
        "• The Venezuelan government dismantled CADIVI, the currency exchange authority accused of corruption and holding private sector funds.",
        "• In 2015, Venezuela again topped the misery index per the World Bank; the IMF projected an inflation rate of 159% for 2015—the highest in Venezuelan history and globally—and forecast a 10% economic contraction.",
        "• Leaked Central Bank documents revealed that 2015 inflation reached 270%, with goods shortages exceeding 70%.",
        "• In 2016, President Nicolás Maduro restructured his economic cabinet, appointing mainly leftist Venezuelan academics; Merrill Lynch anticipated this would lead to tighter currency and price controls.",
        "• Alejandro Werner, head of the IMF's Latin American Department, stated that official 2015 inflation figures were understated, estimating inflation at 275%; IMF and Bank of America forecasts for 2016 inflation ranged from 720% to 1,000%.",
        "• Analysts accused the Venezuelan government of manipulating economic data, withholding accurate statistics since late 2014; economist Steve Hanke of Johns Hopkins University compared this to Soviet-era data falsification, introducing a \"lie coefficient\" to interpret Venezuelan statistics.",
        "• By 2016, media and the IMF described Venezuela as undergoing economic collapse, with IMF predicting 500% inflation and 10% GDP contraction; December 2016 marked 30 consecutive days of monthly inflation exceeding 50%, officially placing Venezuela in hyperinflation status and as the 57th country on the Hanke-Krus World Hyperinflation Table.",
        "• On 25 August 2017, new U.S. sanctions targeted Venezuela’s government financing abilities but did not prohibit trading of existing non-government bonds.",
        "• On 26 January 2018, Venezuela ended its protected, subsidized fixed exchange rate system, which had become highly overvalued due to rampant inflation; the opposition-led National Assembly estimated 2017 inflation at over 4,000%, corroborated by independent economists.",
        "• In February 2018, the Venezuelan government launched the petro, an oil-backed cryptocurrency.",
        "• Bloomberg’s Cafe Con Leche Index reported a 718% price increase for a cup of coffee in the 12 weeks before 18 January 2018, equating to an annualized inflation rate of 448,000%; by July 2018, the National Assembly’s finance commission noted prices were doubling every 28 days, with an annualized inflation rate of 25,000%.",
        "• Venezuela was approaching selective default in 2017 and entered full default in early 2018, unable to meet lender obligations.",
        "• On 24 August 2017, U.S. President Donald Trump imposed sanctions banning transactions with Venezuelan state debt, including participation in debt restructuring.",
        "• On 13 November 2017, the technical default period ended without Venezuela paying coupons on its dollar eurobonds, triggering cross-defaults on other dollar bonds.",
        "• On 30 November 2017, the ISDA committee, comprising 15 major banks, declared Venezuela in default on state debt obligations, activating credit default swap (CDS) payments.",
        "• According to Cbonds, as of the report, Venezuela had 20 international bonds recognized as in default, with total defaulted obligations amounting to approximately 36 billion U.S. dollars."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:12.838718",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 6
    },
    {
      "section_number": "3",
      "section_name": "Sectors",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Under the leadership of Hugo Chávez and his successor Nicolás Maduro, Venezuela experienced a significant decline in the number of operating businesses within the country.",
        "• In 1999, the total number of companies operating in Venezuela was approximately 13,000.",
        "• By the year 2016, the number of companies had decreased to less than one-third of the 1999 figure, with only about 4,000 companies remaining active in Venezuela.",
        "• This reduction in the business sector reflects a substantial contraction in the Venezuelan economy during the period of Chávez’s and Maduro’s administrations."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:01.286193",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 7
    },
    {
      "section_number": "3.1",
      "section_name": "Petroleum and other resources",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Venezuela possesses the world's largest proven oil reserves, totaling 302.81 billion barrels as of the end of 2017, making petroleum products the cornerstone of its economy.",
        "• According to the International Energy Agency, Venezuela's oil production declined significantly from 3.5 million barrels per day in 1998 to 2,300,000 barrels (370,000 m³) daily in recent years, with a marked fall between 2015 and 2020.",
        "• Despite the decline in production, oil revenues in Venezuela doubled in local currency value due to recent currency devaluation.",
        "• Venezuela provides substantial energy subsidies; in 2015, petrol cost was extremely low at US$0.06 per gallon, representing 23% of government revenues.",
        "• In February 2016, the Venezuelan government raised petrol prices for the first time in years, setting premium petrol at 6 bolívar per litre (approximately 60¢ at the official exchange rate) and lower-grade petrol at 1 bolívar per litre (about 10¢).",
        "• Beyond petroleum, Venezuela has diverse natural resources including iron ore, coal, bauxite, gold, nickel, and diamonds, which are at different stages of development and production.",
        "• In April 2000, the Venezuelan president enacted a new mining law and regulations aimed at encouraging increased private sector participation in mineral extraction.",
        "• During the economic crisis, Venezuela experienced a sharp decline in mineral production: gold extraction fell by 64.1% between February 2013 and February 2014, and iron production dropped by 49.8% in the same period.",
        "• Historically, Venezuela produced an annual average of 11 to 12 tons of gold until 2009; however, due to political and economic turmoil, mining activity drastically decreased, with only 0.48 tons of gold extracted in 2017.",
        "• Venezuela primarily relies on hydropower to supply electricity to its industries, accounting for 57% of total energy consumption at the end of 2016.",
        "• Persistent drought conditions have severely diminished energy production from hydropower sources in Venezuela.",
        "• The national electricity law in Venezuela is designed to establish a legal framework to promote competition and attract new investment in the electricity sector.",
        "• After a two-year delay, the Venezuelan government is moving forward with plans to privatize various state-owned electricity systems, implementing a different scheme than initially planned."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:11.617347",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 8
    },
    {
      "section_number": "3.2",
      "section_name": "Manufacturing",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2014, manufacturing accounted for 12% of Venezuela's Gross Domestic Product (GDP), indicating its significant role in the national economy.",
        "• The manufacturing sector in Venezuela has been facing severe difficulties characterized by a lack of investment and widespread accusations of mismanagement.",
        "• Venezuela's manufacturing industry produces and exports a variety of goods including steel, aluminum, transport equipment, textiles, apparel, beverages, and foodstuffs.",
        "• Additional manufactured products in Venezuela include cement, tires, paper, fertilizer, and assembled cars intended for both domestic consumption and export markets.",
        "• In 2014, General Motors Venezolana ceased automotive production after 65 years of operation, primarily due to a shortage of supplies necessary for manufacturing.",
        "• The Central Bank of Venezuela reported a 100% shortage rate of new automobiles in 2014, reflecting a complete lack of availability in the market.",
        "• By the first half of 2016, Venezuela's vehicle production had drastically declined to only 10 vehicles per day, representing an 86% drop in automotive manufacturing output.",
        "• Estimates from 2017 indicated that Venezuela's overall industrial production had decreased by approximately 2%, continuing the trend of industrial decline."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:05.680606",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 9
    },
    {
      "section_number": "3.3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Agriculture in Venezuela contributes approximately 3% to the country's Gross Domestic Product (GDP), employs about 10% of the labor force, and utilizes at least one-quarter of Venezuela's land area.",
        "• Venezuela's agricultural exports include rice, corn, fish, tropical fruit, coffee, beef, and pork, reflecting a diverse range of products for international markets.",
        "• Despite its agricultural activities, Venezuela is not self-sufficient in most agricultural sectors and relies heavily on imports, sourcing about two-thirds of its food needs from abroad.",
        "• In 2002, American firms exported $347 million worth of agricultural products to Venezuela, including wheat, corn, soybeans, soybean meal, cotton, animal fats, vegetable oils, and other items, making Venezuela one of the top two American markets in South America for agricultural exports.",
        "• The United States supplies more than one-third of Venezuela's food imports, underscoring the significant dependency on American agricultural goods.",
        "• Recent Venezuelan government policies have contributed to food shortages, exacerbated by economic challenges such as falling oil revenues and hyperinflation, which increased the cost of imported food products beyond the reach of most Venezuelans.",
        "• During periods of high oil revenues, domestic agriculture was neglected in favor of imported food products, a strategy that became unsustainable when oil revenues declined and currency devaluation occurred.",
        "• In 2019, Venezuela's agricultural production included 4.3 million tons of sugarcane, 1.9 million tons of maize, 1.4 million tons of banana, 760 thousand tons of rice, 485 thousand tons of pineapple, 477 thousand tons of potato, 435 thousand tons of palm oil, 421 thousand tons of cassava, 382 thousand tons of orange, 225 thousand tons of watermelon, 199 thousand tons of papaya, 194 thousand tons of melon, 182 thousand tons of tomatoes, 155 thousand tons of tangerine, 153 thousand tons of coconut, 135 thousand tons of avocado, 102 thousand tons of mango (including mangosteen and guava), and 56 thousand tons of coffee.",
        "• Venezuela also produced smaller quantities of other agricultural products beyond those listed for 2019.",
        "• Sugarcane production experienced a significant decline from 7.3 million tons in 2012 to 3.6 million tons in 2016, reflecting the impact of internal economic and political problems.",
        "• Corn production similarly decreased from 2.3 million tons in 2014 to 1.2 million tons in 2017, indicating a downward trend in staple crop output.",
        "• Rice production fell sharply from 1.15 million tons in 2014 to 498 thousand tons in 2016, further illustrating the challenges faced by Venezuelan agriculture during this period."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:18.167901",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 10
    },
    {
      "section_number": "3.4",
      "section_name": "Livestock",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2019, Venezuela produced 470 thousand tons of beef as part of its livestock sector output.",
        "• The country also produced 454 thousand tons of chicken meat in 2019, reflecting a significant decline over the previous decade.",
        "• Pork production in Venezuela amounted to 129 thousand tons in 2019.",
        "• Cow's milk production reached 1.7 billion liters in 2019.",
        "• Chicken meat production in Venezuela experienced a progressive decrease from 1.1 million tons in 2011 to 448 thousand tons in 2017.",
        "• Pork production declined from 219 thousand tons in 2011 to 124 thousand tons in 2018.",
        "• Cow's milk production dropped from 2.4 billion liters in 2011 to 1.7 billion liters in 2019."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:14.384186",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 11
    },
    {
      "section_number": "4",
      "section_name": "Trade",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Venezuela is a founding member of several international organizations, including the Organization of the Petroleum Exporting Countries (OPEC), the Organization of Gas Exporting Countries (GECF), the Bolivarian Alliance for the Peoples of Our America (ALBA), and the Community of Latin American and Caribbean States (CELAC).",
        "• Petroleum exports dominate Venezuela's trade profile, constituting 80% of the country's exports with a total value of $22.2 billion in 2017.",
        "• Due to petroleum exports, Venezuela typically records a trade surplus.",
        "• From 2005 onwards, nontraditional private sector exports (defined as nonpetroleum exports) have experienced a rapid decline, comprising only 8% of total exports by 2015.",
        "• The United States is Venezuela's leading trade partner; in 2002, the U.S. exported $4.4 billion worth of goods to Venezuela, making Venezuela the 25th-largest market for U.S. exports.",
        "• Including petroleum products, Venezuela exported $15.1 billion in goods to the United States in 2002, positioning Venezuela as the 14th-largest source of goods for the U.S.",
        "• Venezuela opposes the proposed Free Trade Area of the Americas, although this claim is marked as needing citation.",
        "• Since 1998, relations between China and Venezuela have strengthened significantly, particularly under Venezuelan President Hugo Chávez and the People's Republic of China.",
        "• Sino-Venezuelan trade was under $500 million annually before 1999 but surged to $7.5 billion by 2009, making China Venezuela's second-largest trade partner and Venezuela China's largest investment destination in Latin America.",
        "• Bilateral agreements have led to China investing billions of dollars in Venezuela, while Venezuela has increased exports of oil and other resources to China.",
        "• China has required payment for its exports to Venezuela in oil, due to its refusal to accept Venezuelan currency and Venezuela's inability to pay in U.S. dollars or gold.",
        "• In 2017, Venezuela's total imports amounted to $9.1 billion, with the United States as the largest source at $3.45 billion (38% of imports).",
        "• Other significant import partners in 2017 included China ($1.65 billion, 18%), Mexico ($1.08 billion, 12%), Brazil ($469 million, 5.2%), Colombia ($318 million, 3.5%), Argentina ($245 million, 2.7%), Germany ($191 million, 2.1%), Italy ($166 million, 1.8%), Spain ($117 million, 1.3%), and the United Kingdom ($86 million, 0.95%).",
        "• Venezuela's total exports in 2017 were valued at $27.8 billion, with the United States as the largest export destination at $11.6 billion (42% of exports).",
        "• Other major export destinations in 2017 included China ($6.4 billion, 23%), India ($5.25 billion, 19%), Singapore ($1.25 billion, 4.5%), Spain ($390 million, 1.4%), Brazil ($363 million, 1.3%), Sweden ($341 million, 1.2%), Malaysia ($316 million, 1.1%), Germany ($259 million, 0.93%), and Colombia ($210 million, 0.75%)."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:23.437356",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 12
    },
    {
      "section_number": "5",
      "section_name": "Labor",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Under President Hugo Chávez, Venezuela implemented worker-run \"co-management\" initiatives where workers' councils play a central role in managing plants or factories, exemplified by experimental co-managed enterprises like the state-owned Alcasa factory, where workers develop budgets and elect managers and departmental delegates who collaborate with company executives on production-related technical issues.",
        "• In November 2010, workers protested for a week outside factories in the cities of Valera and Valencia following the expropriation of the American bottle-maker Owens-Illinois, signaling labor unrest linked to government actions.",
        "• Labor disputes in Venezuela have increased since the 2008 financial crisis, with the World Economic Forum ranking Venezuela 134th out of 148 countries in economic competitiveness, a situation many private sector actors attribute to the inflexible nature of the Venezuelan labor market.",
        "• A series of pro-worker decrees have been enacted in recent years, most notably the 2012 labor laws known as the Ley Orgánica del Trabajo, los Trabajadores y las Trabajadoras (LOTTT), which introduced a near ban on dismissals, shortened the workweek, improved holiday entitlements, and enhanced maternity benefits, providing job security to most workers after only one month of employment.",
        "• Employers have reported absenteeism rates as high as 40%, which they attribute to the leniency of the LOTTT labor laws, leading to decreased willingness among employers to recruit new workers.",
        "• On 17 November 2014, President Nicolás Maduro issued a decree increasing the minimum wage for all workers by 15%, with the decree taking effect on 1 December 2014.",
        "• During the May Day celebrations on 28 April 2015, President Maduro announced a 30% increase in the minimum wage, distributed as 20% in May and 10% in July 2015, resulting in a new minimum wage equivalent to approximately $30 per month when converted at the widely used black market exchange rate.",
        "• In September 2017, the National Union of Workers (UNETE) reported that Venezuela had lost 3,345,000 jobs since President Maduro’s election.",
        "• By December 2017, the number of jobs lost had risen by an additional 400,000, totaling over 3,850,000 jobs lost since the beginning of Maduro’s tenure."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:20.738376",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 13
    },
    {
      "section_number": "6",
      "section_name": "Infrastructure",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In the 20th century, Venezuela experienced significant growth and development in its infrastructure as a direct result of revenues generated from oil sales.",
        "• The prosperity from oil exports during this period enabled substantial investments in public services and infrastructure projects across the country.",
        "• In contrast, recent years have seen a marked decline in the quality and reliability of Venezuela's public services and infrastructure.",
        "• Utilities, particularly electricity and water supply systems, have been notably affected by this deterioration, leading to widespread service disruptions and challenges."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:14.791821",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 14
    },
    {
      "section_number": "6.1",
      "section_name": "Transportation",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Venezuela possesses an extensive road system initially developed in the 1960s, primarily to support the oil and aluminum industries.",
        "• The capital city, Caracas, features a modern subway system designed by French engineers, completed in 1995, with subway tunnels extending more than 31.6 miles (50.9 kilometers).",
        "• The Venezuelan railway system was originally established in 1870 under the leadership of Antonio Guzmán Blanco.",
        "• The government under Hugo Chávez initiated a National Railway Development Plan aimed at constructing 15 railway lines nationwide, totaling 13,700 kilometers (8,500 miles) of track by the year 2030.",
        "• This railway network development is being undertaken in collaboration with China Railways, which is also assisting Venezuela in establishing factories for producing railway tracks, railway cars, and eventually locomotives.",
        "• Despite these plans, Venezuela's railway project has been placed on hold due to financial difficulties, including an inability to pay $7.5 billion and an outstanding debt of nearly $500 million owed to China Railway.",
        "• On 18 June 2016, Lufthansa announced it would cease all flights to Venezuela, attributing the decision to challenges related to currency controls.",
        "• Other international airlines have also reduced their flight services to Venezuela and have imposed requirements for passengers to pay fares in US dollars."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:16.945151",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 15
    },
    {
      "section_number": "6.2",
      "section_name": "Energy",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Venezuelan electrical grid experiences frequent and occasional blackouts affecting various districts across the country.",
        "• In 2011, the electrical grid faced significant problems severe enough to necessitate the implementation of electricity rationing measures aimed at mitigating blackout occurrences.",
        "• On 3 September 2013, a major power outage occurred, causing 70% of Venezuela to lose electricity; this blackout affected 14 out of the 23 states, with these states reporting a lack of electricity for the majority of the day.",
        "• A subsequent widespread power outage took place on 2 December 2013, plunging most of Venezuela into darkness once again; this event occurred just days prior to national elections."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:18.622795",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 16
    },
    {
      "section_number": "6.2.1",
      "section_name": "Energy statistics",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2012, Venezuela's electricity production by source consisted of 35.7% from fossil fuels, 64.3% from hydroelectric power, 0% from nuclear energy, and 0% from other sources.",
        "• The total electricity production in Venezuela was estimated at 127.6 billion kilowatt-hours (kWh) in 2012.",
        "• Electricity consumption in Venezuela was estimated at 85.05 billion kWh in 2011.",
        "• In 2009, Venezuela exported approximately 633 million kWh of electricity.",
        "• Electricity imports into Venezuela were estimated at 260 million kWh in 2009.",
        "• The installed electricity generating capacity in Venezuela was estimated at 27.5 million kilowatts (kW) in 2012."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:18.292057",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 17
    },
    {
      "section_number": "6.3",
      "section_name": "Economy data",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The blue line in the referenced economic data represents annual rates, while the red line indicates trends of annual rates over the period shown, with sources including the International Monetary Fund, World Bank, and Central Intelligence Agency.",
        "• The Macroeconomic Stabilization Fund (FIEM) decreased significantly from US$2.59 billion in January 2003 to US$700 million in October 2003; however, central bank-held international reserves increased from US$11.31 billion in January to US$19.67 billion in October 2003.",
        "• On the black market, the Venezuelan bolívar depreciated by 28% in 2007, reaching Bs. 4,750 per US$, and further declined to approximately VEF 5.5 (Bs 5500) per US$ in early 2009.",
        "• Venezuela's economy recovered robustly in 2004, growing by 16.8%, with growth spread across various sectors despite the oil industry providing only a small percentage of employment; international reserves rose to US$27 billion.",
        "• Polling firm Datanalysis reported a 33% increase in real income among the poorest sectors of Venezuelan society in 2004.",
        "• On 7 March 2007, the Venezuelan government announced a redenomination of the bolívar at a ratio of 1 to 1,000, effective from 1 January 2008, renaming it the bolívar fuerte (\"strong bolivar\") to simplify accounting and transactions; the exchange rate at that time was 2.15 bolívar fuerte per US$.",
        "• The ISO 4217 currency code for the bolívar fuerte is VEF.",
        "• In 2007, government spending accounted for 30% of Venezuela's GDP, which was lower than other mixed economies such as France (49%) and Sweden (52%).",
        "• According to official United Nations sources, the percentage of Venezuelans living below the national poverty line decreased from 48.1% in 2002 to 28% in 2008 during Hugo Chávez's presidency.",
        "• Venezuela's economy grew by 9% in 2007, buoyed by rising oil prices and increased government expenditures.",
        "• Starting in July 2008, oil prices fell, causing a significant loss of income; the economy contracted by 2% in Q2 2009 and by a further 4.5% in Q3 2009 amid a global recession.",
        "• On 17 November 2009, the Central Bank reported a 4.5% decline in private sector activity and an average inflation rate of 26.7%.",
        "• Venezuela faced a drought attributed by the government to El Niño, resulting in rationing of water and electricity and shortages of food.",
        "• In the first quarter of 2010, Venezuela remained in recession with GDP falling by 5.8%; the Central Bank attributed this to restricted access to foreign currency for imports, lower internal demand, and electricity rationing.",
        "• The oil sector's GDP shrank by 5% in early 2010 due to production declines, operational problems, maintenance stoppages, and diversion of diesel to thermal generators amid a power crisis.",
        "• In 2010, the public sector economy contracted by 2.8%, while the private sector declined by 6%.",
        "• The year 2013 was marked by severe shortages of necessities and extreme inflation; nearly 25% of consumer items were out of stock.",
        "• The bolívar was devalued to 6.3 per US$ in early 2013, losing one-third of its value, yet inflation continued to rise sharply.",
        "• President Nicolás Maduro intervened by compelling stores to sell goods at controlled prices just days before elections in 2013, accusing them of charging unreasonable prices despite price adjustments reflecting currency devaluation.",
        "• In 2014, the Central Bank of Venezuela ceased releasing economic statistics for the first time in its history, possibly to manipulate perceptions of the economy.",
        "• The Venezuelan government dismantled CADIVI, the agency responsible for managing currency exchange, in 2014.",
        "• In May 2019, the Central Bank released economic data for the first time since 2015, revealing inflation rates of 274% in 2016, 863% in 2017, and 130,060% in 2018.",
        "• The 2019 data implied a contraction of more than half of Venezuela's economy over five years, described by the Financial Times as \"one of the biggest contractions in Latin American history.\"",
        "• According to two undisclosed Reuters sources, the release of economic data in 2019 was influenced by pressure from China, an ally of Maduro; one source suggested that releasing data could facilitate Venezuela's compliance with the IMF, complicating support for opposition leader Juan Guaidó during the presidential crisis.",
        "• The IMF was unable to validate the 2019 data as it had not been able to contact Venezuelan authorities.",
        "• The provided economic indicators table covers Venezuela's main economic data from 1980 to 2023, including GDP in billion US$ PPP and nominal terms, GDP per capita, real GDP growth rates, inflation rates, unemployment rates, and government debt as a percentage of GDP.",
        "• Inflation rates below 10% are highlighted in green in the table.",
        "• Key historical data points include: a GDP contraction of -4.9% in 1980 with 21.4% inflation; a severe recession in 1989 with -13.9% GDP growth and 84.5% inflation; hyperinflation periods in the 1990s and 2000s with inflation rates reaching up to 99.9% in 1996.",
        "• The economy experienced growth peaks such as 18.3% real GDP growth in 2004 and 10.3% in 2005, with inflation rates generally between 10% and 30% during mid-2000s.",
        "• From 2013 onwards, Venezuela faced severe economic decline and hyperinflation, with GDP shrinking by -3.9% in 2014, -6.2% in 2015, and reaching -30.0% in 2020.",
        "• Inflation escalated dramatically, reaching 62.2% in 2014, 121.7% in 2015, 254.9% in 2016, 438.1% in 2017, and astronomical levels of 65,374.1% in 2018 and 19,906.0% in 2019.",
        "• Unemployment rose significantly during economic contractions, reaching 35.5% in 2018.",
        "• Government debt as a percentage of GDP fluctuated, peaking at 327.7% in 2020 and remaining elevated through 2022.",
        "• The most recent data for 2023 show a modest GDP growth of 4.0%, inflation at 360.0%, and GDP per capita of US$7,985.1 (PPP) and US$3,474.3 (nominal), with government debt data not available."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:40.296862",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 34
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 18
    },
    {
      "section_number": "6.4",
      "section_name": "Currency black market",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• According to DolarToday.com, the value of one US dollar in Venezuelan bolívares fuertes (VEF) on the black market has drastically depreciated over time, with blue and red vertical lines on the graph indicating each instance the currency lost 90% of its value; this event has occurred seven times since 2012.",
        "• As of mid-February 2019, the Venezuelan bolívar fuerte was worth approximately 30,000,000 times less than in August 2012, reflecting a loss of more than 99.99999% of its value.",
        "• Inflation is represented by the time it takes for money to lose 90% of its value, measured using a 301-day rolling average on an inverted logarithmic scale.",
        "• The parallel exchange rate reflects the value Venezuelans attribute to their currency relative to the US dollar on the black market.",
        "• During the early years of Hugo Chávez’s presidency, newly implemented social programs required substantial payments, prompting the government to create CADIVI (Comisión de Administración de Divisas) on 5 February 2003, a currency control board responsible for managing foreign exchange procedures.",
        "• CADIVI was established to curb capital flight by limiting the amount of foreign currency individuals could access, which inadvertently fostered a black market for currency since Venezuelan merchants depended on foreign goods paid for in stable foreign currencies.",
        "• The government’s increased printing of bolívares to fund social programs led to continuous devaluation of the currency for citizens and merchants, as the government retained most of the reliable foreign currencies.",
        "• By January 2018, the official exchange rate was fixed at 1 US dollar to 10 VEF, whereas the free market (black market) exchange rate exceeded 200,000 VEF to 1 US dollar.",
        "• Due to restrictions on foreign currency access from the government, merchants resorted to the black market to obtain necessary foreign currency, causing increased prices for consumers.",
        "• The elevated black market exchange rates complicated business operations, as the government often mandated price cuts, forcing businesses to sell goods at low profits.",
        "• An example of low profit margins is Venezuelan McDonald's franchises offering a Big Mac meal for only $1, illustrating the economic strain on businesses.",
        "• Low profitability led to shortages because businesses could not afford to import essential goods, which Venezuela heavily relies upon.",
        "• Venezuela’s largest food producer, Empresas Polar, announced a potential suspension of some production for nearly the entire year of 2014 due to owing $463 million to foreign suppliers.",
        "• The last government report on shortages indicated that 22.4% of necessary goods were out of stock; however, the central bank ceased publishing the scarcity index thereafter.",
        "• The discontinuation of official scarcity data has fueled speculation that the government is concealing its inability to manage the economy, raising doubts about the reliability of future economic data releases."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:30.538851",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 19
    },
    {
      "section_number": "6.5",
      "section_name": "Socioeconomic indicators",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Venezuela, like most Latin American countries, exhibits a highly unequal distribution of wealth, with significant disparities between the rich and the poor.",
        "• Wealth distribution improved somewhat in the mid-20th century due to a reduction in rural labor surplus and improvements in the educational system, but inequality remains far from Western standards.",
        "• In 1970, the poorest 20% of Venezuela’s population earned only 3% of the national income, while the wealthiest 20% earned 54%; by comparison, in the early 1970s, the UK’s poorest fifth earned 6.3% and richest fifth 38.8%, and the US’s poorest fifth earned 4.5% and richest fifth 42.8%.",
        "• Inequality in Venezuela declined during the early 2000s as the government increased spending on social programs aimed at improving the welfare of the poor.",
        "• Since the economic crisis beginning in 2013, inequality has sharply increased due to severe shortages in heavily subsidized services such as public hospitals and food distribution, which the poor heavily rely on.",
        "• Hyperinflation has devastated the value of savings, pushing many middle-class Venezuelans into extreme poverty, while the very wealthy have often preserved wealth by accessing overseas financial services and holding assets in stable foreign currencies.",
        "• Recent income distribution data is available on a per capita basis rather than per household, with the latter typically showing less inequality because poorer households tend to have more members.",
        "• According to World Bank and Instituto Nacional de Estadística data, the share of personal income held by the poorest fifth fluctuated between 3.5% and 5.7% from 1987 to 2011, while the wealthiest fifth’s share ranged from 44.8% to 54.8% in the same period.",
        "• The GINI index, a measure of income inequality, varied from approximately 43.42 in 1987, peaking near 48.8 in 1996, and declining to around 38.98–39.02 in 2010–2011, before rising again to 46.9 by 2015.",
        "• Data sources for income distribution include the World Bank’s World Development Reports (1987–2000), World Development Indicators (2000), Instituto Nacional de Estadística (2004–2011), and United Nations Development Programme (2013–2015).",
        "• Poverty in Venezuela increased during the 1980s and early 1990s, then decreased significantly in the mid to late 1990s, continuing to decline during the Chávez presidency except for setbacks in 2002 and 2003.",
        "• Under the Bolivarian government, initial reductions in poverty were linked to oil revenue inflows, but poverty rates surged to their highest levels in decades during the 2010s due to economic instability.",
        "• Venezuela’s poverty and inequality rates have fluctuated dramatically due to the government’s reliance on volatile oil revenues, causing cycles of rapid economic growth followed by severe recessions.",
        "• Between 2003 and 2008, the poverty rate dropped from 55% to 27%, but then escalated sharply to over 80% between 2012 and 2017.",
        "• Data on the percentage of people and households below the national poverty line, defined by the cost of a basket of necessities, shows household poverty rates rising from 48.1% in 1997 to 87.0% in 2017.",
        "• Individual poverty rates increased from 31.3% in 1989 to 62.1% in 2003, then decreased to around 25.4% in 2012 before rising again; data for individuals after 2013 is unavailable.",
        "• Poverty data sources include the World Bank’s 1997 World Development Indicators, Venezuela’s Instituto Nacional de Estadística (1997–2013), and ENCOVI surveys (2014–2017).",
        "• The poverty data from the World Bank represent whole-year averages, while Instituto Nacional de Estadística provides end-of-year data; ENCOVI data is used due to lack of official statistics post-2013.",
        "• Venezuela’s extreme poverty rate from 1990 to 2013 shows fluctuations influenced by political changes and economic policies, with a noted one-year delay in data reflecting presidential term transitions.",
        "• In 2017, Venezuela’s economic indicators included a real GDP contraction of −14.0%, hyperinflation at 1,087.5%, and gross national saving at 12.1% of GDP.",
        "• Venezuela’s leading foreign trade markets in 2013 were the United States (39.1% of exports), China (14.3%), India (12.0%), and the Netherlands Antilles (7.8%).",
        "• Major suppliers to Venezuela in 2013 included the United States (31.7%), China (16.8%), Brazil (9.1%), and Colombia (4.8%).",
        "• Venezuela’s major exports in 2013 were overwhelmingly oil and gas, constituting 90.4% of total exports, with other goods making up 9.6%.",
        "• Major imports in 2013 consisted of raw materials and intermediate goods (44.5%), consumer goods (24.5%), and capital goods (31.0%)."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:36.610580",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 20
    },
    {
      "section_number": "7",
      "section_name": "Social development",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In the early 2000s, Venezuela experienced a surge in oil prices, providing President Hugo Chávez's government with unprecedented funds not seen since the onset of Venezuela's economic collapse in the 1980s.",
        "• Chávez's government during this period became characterized as \"semi-authoritarian and hyper-populist,\" consolidating control over the economy to access and manage large amounts of resources.",
        "• Domestically, Chávez utilized the increased oil revenues to implement populist policies, notably creating the Bolivarian missions, which were designed to deliver public services aimed at improving economic, cultural, and social conditions across Venezuela.",
        "• Despite early warnings during the initial years of Chávez's administration in the early 2000s, the government persistently overspent on social programs and failed to save sufficient funds to buffer against future economic crises.",
        "• Venezuela faced significant economic turmoil shortly before and after the death of Hugo Chávez in 2013, a period for which the government had not adequately prepared financially.",
        "• In 2013, the year of Chávez's death, Venezuela was still classified as having high human development according to the United Nations Development Programme's Human Development Index.",
        "• However, within one year following Chávez's death, Venezuela's human development indicators began to decline, with the country dropping 10 ranks in the Human Development Index by 2014."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:24.518451",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 21
    },
    {
      "section_number": "7.1",
      "section_name": "Poverty and hunger",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Extreme poverty and shortages of food and medicines have compelled more than three million Venezuelans to emigrate in recent years.",
        "• A study by Andrés Bello Catholic University revealed that the poorest 20% of Venezuelans held only 1.4% of the nation's wealth, a decline from 3.4% in 2014, while the richest 10% controlled 61% of the wealth, up from 30%.",
        "• Government data released in April 2017 indicated that 1,446 children under the age of one died in 2016, marking a 30% increase compared to the previous year.",
        "• By August 2017, approximately 31 million Venezuelans were experiencing severe food shortages.",
        "• The ENCOVI universities survey reported that 73% of Venezuelans lost an average of 9 kg (20 lb) of body weight in 2016, and 64% lost 11 kg (24 lb) in 2017, highlighting widespread malnutrition.",
        "• Following the economic collapse in 2014, hunger and malnutrition intensified significantly in Venezuela.",
        "• In 2015, nearly 45% of Venezuelans reported being unable to afford food at times; this figure escalated to 79% in 2018, ranking among the highest global rates.",
        "• Although poverty initially decreased during Hugo Chávez's presidency, by 2013 the poverty rate had risen to 28%, with extreme poverty increasing by 4.4% to reach 10%, according to the Venezuelan government's National Institute of Statistics (INE).",
        "• The United Nations Economic Commission for Latin America and the Caribbean (ECLAC) estimated Venezuela's poverty rate at 32% in 2013.",
        "• Sociologist Luis Pedro España from Universidad Católica Andrés Bello calculated a poverty rate of 48% in 2015.",
        "• The Venezuelan government estimated a poverty rate of 33% in the first half of 2015 but ceased publishing poverty statistics thereafter.",
        "• Venezuelan NGO PROVEA projected that by the end of 2015, the number of Venezuelans living in poverty would equal that of the year 2000, effectively reversing poverty reduction gains made during Chávez's administration.",
        "• The ENCOVI annual survey, conducted by three universities, estimated poverty rates at 48% in 2014, 82% in 2016, and 87% in 2017, indicating a dramatic increase.",
        "• During the early years of Chávez's presidency, under-nutrition, undernourishment, and the percentage of moderately or severely underweight children under five years old decreased.",
        "• However, after Chávez's death, shortages caused by price control policies and heavy reliance on imports resulted in the majority of Venezuelans lacking access to adequate food and essential products."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:28.413537",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 22
    },
    {
      "section_number": "7.2",
      "section_name": "Education",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The total net enrollment ratio in primary education for both sexes in Venezuela increased from 87% in 1999 to 93.9% in 2009, indicating significant progress in primary school attendance over the decade.",
        "• The primary completion rate for both sexes rose from 80.8% in 1991 to 95.1% in 2009, reflecting improved retention and graduation rates in primary education.",
        "• Literacy rates among 15- to 24-year-olds in Venezuela in 2007 were 98% for men and 98.8% for women, demonstrating high literacy levels in the younger population.",
        "• A substantial portion of the millions of Venezuelans who emigrated during the Bolivarian Revolution were highly educated, contributing to a notable brain drain in the country.",
        "• In 2008, Francisco Rodríguez of Wesleyan University and Daniel Ortega of IESA analyzed literacy trends and concluded there was \"little evidence\" of a \"statistically distinguishable effect on Venezuelan illiteracy\" during the Chávez administration.",
        "• The Venezuelan government claimed to have taught 1.5 million Venezuelans to read; however, Rodríguez and Ortega’s study found that only 1.1 million Venezuelans were illiterate initially, suggesting the government's figures were overstated.",
        "• The study attributed the reduction in illiteracy of fewer than 100,000 individuals primarily to the death of elderly adults rather than successful literacy campaigns during the Chávez administration."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:26.366724",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 23
    },
    {
      "section_number": "7.3",
      "section_name": "Health care",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the Bolivarian Revolution and the establishment of the Bolivarian government, Venezuela implemented a free healthcare system alongside the existing national public health system, initially showing promising healthcare practices with assistance from Cuban medical professionals.",
        "• The Bolivarian government's subsequent failure to prioritize healthcare, coupled with reductions in healthcare spending and pervasive government corruption, led to a deterioration of medical services, resulting in avoidable deaths and the emigration of medical professionals from Venezuela.",
        "• Venezuela's dependence on imported goods and the implementation of complicated exchange rates under President Hugo Chávez during the late 2000s and into the 2010s contributed to increasing shortages of medicines and medical equipment across the country.",
        "• According to United Nations data, Venezuela experienced a rise in the maternal mortality ratio, increasing from 93 deaths per 100,000 live births in 1990 to 110 deaths per 100,000 live births in 2013.",
        "• In 2014, widespread shortages of medical and common goods caused Venezuelan women to face significant difficulties accessing contraceptives, forcing many to alter prescriptions or search multiple stores and online sources to obtain necessary medications.",
        "• The shortage of antiretroviral medicines in 2014 severely impacted approximately 50,000 Venezuelans living with HIV/AIDS, potentially leading to thousands progressing from HIV to AIDS due to lack of treatment.",
        "• Venezuela is unique in Latin America as the only country experiencing an increase in malaria incidence, a trend allegedly linked to illegal mining activities.",
        "• In 2013, Venezuela recorded the highest number of malaria cases in 50 years, with an infection rate of 300 cases per 100,000 inhabitants."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:30.330903",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 24
    },
    {
      "section_number": "7.4",
      "section_name": "Technology",
      "chapter_name": "Economy of Venezuela",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1990, the number of Internet users in Venezuela was minimal, but by 2010, 35.63% of Venezuelans were Internet users, indicating significant growth in Internet adoption over two decades.",
        "• The number of Internet subscribers in Venezuela increased sixfold between 1990 and 2010, reflecting rapid expansion in Internet access.",
        "• The National Technological Literacy Plan, a government initiative, has contributed to increasing Internet usage by providing free software and computers to schools across Venezuela.",
        "• Despite increased Internet access, experts highlight that Venezuela suffers from poor Internet infrastructure, resulting in one of the slowest Internet speeds globally.",
        "• Venezuela's currency controls have limited access to US dollars, which has negatively impacted Internet services because technological equipment necessary for Internet infrastructure must be imported.",
        "• The number of fixed telephone lines per 100 inhabitants in Venezuela rose from 7.56 in 1990 to 24.44 in 2010, demonstrating growth in landline telephone penetration.",
        "• In absolute terms, the number of Venezuelans with landline telephones increased from 2,535,966 in 2000 to 6,866,626 by 2009.",
        "• The Bolivarian government initiated an aerospace program in collaboration with the People's Republic of China, resulting in the construction and launch of two satellites currently in orbit: the communications satellite Simón Bolívar and the remote sensing satellite Miranda.",
        "• In July 2014, President Nicolás Maduro announced plans for a third satellite to be developed through continued Chinese–Venezuelan bilateral cooperation."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:29:33.110317",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_venezuela.json",
      "original_index": 25
    }
  ]
}