{
  "extraction_info": {
    "source_file": "economy_of_solomon_islands.json",
    "extraction_timestamp": "2025-08-02T17:13:28.929879",
    "total_sections_in_source": 9,
    "extracted_sections_count": 9,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Solomon Islands has a per capita Gross Domestic Product (GDP) of $3,200, classifying it as a lesser developed nation.",
        "• More than 75% of the Solomon Islands' labor force is involved in subsistence farming and fishing activities.",
        "• The article on the Economy of Solomon Islands requires additional citations for verification to ensure the reliability of its content.",
        "• Unsourced material within the article may be challenged and removed, highlighting the need for improved referencing.",
        "• There is a noted issue with the article’s use of external links, which may not comply with Wikipedia’s policies or guidelines as of December 2023.",
        "• Efforts are recommended to remove excessive or inappropriate external links and to convert useful links into proper footnote references.",
        "• The article’s maintenance tags indicate ongoing efforts to improve the quality and reliability of information related to the Solomon Islands economy as of October 2013 and December 2023."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:56.665480",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Economic history",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Until 1998, timber was the main export product of the Solomon Islands, but world prices for tropical timber fell steeply that year.",
        "• In recent years leading up to 2013, Solomon Islands' forests were dangerously overexploited due to unsustainable logging practices.",
        "• The Solomon Islands economy was particularly hard hit by the Asian financial crisis prior to the ethnic violence of June 2000.",
        "• The Asian Development Bank estimated that the crash in the tropical timber market reduced the Solomon Islands' GDP by between 15% and 25%.",
        "• Approximately half of all jobs in the Solomon Islands' timber industry were lost as a result of the market crash.",
        "• The Solomon Islands government announced intentions to reform timber harvesting policies to resume logging on a more sustainable basis.",
        "• Following the ethnic violence in June 2000, exports of palm oil and gold from the Solomon Islands ceased entirely.",
        "• Exports of timber also declined significantly in the aftermath of the June 2000 ethnic violence."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:56.357891",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "Cash crops",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Solomon Islands' economy includes important cash crops, notably copra and palm oil, which serve as significant export commodities."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:53.284672",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 1
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 2
    },
    {
      "section_number": "1.2",
      "section_name": "Gold",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Gold production in the Solomon Islands commenced in 1998 at the Gold Ridge mine located on Guadalcanal."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:53.299341",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 1
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 3
    },
    {
      "section_number": "1.3",
      "section_name": "Fishing",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Solomon Islands possess rich fisheries resources, which represent the most promising opportunity for both export growth and domestic economic expansion.",
        "• Solomon Taiyo Ltd., a Japanese joint venture, operated the only fish cannery in the Solomon Islands prior to mid-2000.",
        "• The fish cannery operated by Solomon Taiyo Ltd. was forced to close in mid-2000 due to ethnic disturbances affecting the country.",
        "• Following the closure, the cannery has since reopened under local management rather than foreign joint venture control.",
        "• Tuna exports from the Solomon Islands have resumed after the reopening of the cannery.",
        "• The current tuna export operations are conducted under the companies Soltuna and NFD."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:55.187833",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 4
    },
    {
      "section_number": "1.4",
      "section_name": "Tourism",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2017, the Solomon Islands ranked among the least frequently visited countries globally, receiving only 26,000 tourists.",
        "• Tourism income for the Solomon Islands in both 2016 and 2017 was approximately Int'l$ 1.6 million (international dollars).",
        "• Tourism represents a potentially significant service industry for the Solomon Islands, indicating its importance to the national economy.",
        "• The growth of the tourism sector in the Solomon Islands is constrained by several factors, including inadequate infrastructure, limited transportation options, and concerns related to security.",
        "• Two primary attractions driving tourism in the Solomon Islands are scuba diving opportunities and sites related to World War II history.",
        "• The information regarding tourism statistics and challenges was archived on June 10, 2020, as referenced in the source material."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:55.126967",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 5
    },
    {
      "section_number": "1.5",
      "section_name": "Foreign aid",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since the year 2000, the government of the Solomon Islands has experienced increasing insolvency, indicating a worsening financial condition.",
        "• By 2001, the Solomon Islands had exhausted its borrowing capacity, limiting its ability to finance government operations through debt.",
        "• In 2001, the fiscal deficit of the Solomon Islands reached 8% of its Gross Domestic Product (GDP), reflecting a significant budget shortfall.",
        "• The government was unable to meet bi-weekly payroll obligations, demonstrating severe liquidity constraints and operational challenges.",
        "• Due to financial difficulties, the Solomon Islands government became extraordinarily dependent on foreign aid funds to sustain its expenditures.",
        "• In 2001, foreign aid accounted for an estimated 50% of the total government expenditure, highlighting the critical role of external financial assistance.",
        "• The principal foreign aid donors to the Solomon Islands include:",
        "• Australia, providing approximately 247 million Australian dollars annually as of 2006.",
        "• New Zealand, contributing around 14 million New Zealand dollars annually as of 2004.",
        "• Japan, supplying about 40 million US dollars annually as of 2005.",
        "• The Republic of China (Taiwan), offering at least 20 million US dollars annually.",
        "• The European Union is also listed as a principal donor, though specific monetary contributions are not detailed.",
        "• The Solomon Islands is a member of the World Trade Organization (WTO), indicating its participation in global trade governance and adherence to international trade rules."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:59.120551",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 6
    },
    {
      "section_number": "1.6",
      "section_name": "Energy",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2008, the Solomon Islands produced an estimated 78 gigawatt-hours (GWh) of electricity.",
        "• The estimated electricity consumption in the Solomon Islands for the year 2008 was 72.54 GWh.",
        "• There were no recorded electricity exports from the Solomon Islands in 2009, with exports totaling 0 kilowatt-hours (kWh).",
        "• Similarly, the Solomon Islands did not import any electricity in 2009, with imports also recorded as 0 kWh.",
        "• A team of renewable energy developers affiliated with the Pacific Islands Applied Geoscience Commission (SOPAC) and funded by the Renewable Energy and Energy Efficiency Partnership (REEEP) designed an innovative scheme to facilitate access to renewable energy in Solomon Islands communities.",
        "• The scheme enables island communities to obtain renewable energy technologies, such as solar lanterns, without the need for substantial upfront cash payments.",
        "• The project developers proposed that if islanders are unable to pay for solar lanterns with cash, they could instead pay using agricultural products, specifically crops, as an alternative form of payment."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T11:59:58.008515",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 7
    },
    {
      "section_number": "2",
      "section_name": "Statistics",
      "chapter_name": "Economy of Solomon Islands",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The main economic indicators of the Solomon Islands from 1980 to 2017 show GDP in billion US$ PPP rising from 0.19 in 1980 to 1.32 in 2017, with GDP per capita in US$ PPP increasing from 803 in 1980 to 2,157 in 2017.",
        "• Nominal GDP grew from 0.18 billion US$ in 1980 to 1.47 billion US$ in 2017, reflecting overall economic expansion over the 37-year period.",
        "• Real GDP growth rates fluctuated significantly, with negative growth rates of −2.7% in 1980, −3.1% in 1985, and −14.3% in 2000, contrasted by high positive growth such as 10.1% in 1995, 12.9% in 2005, and 13.2% in 2011.",
        "• Inflation rates varied over time, with 8.3% in 1980, peaking at 17.3% in 2008, and declining to −0.4% by 2017, indicating periods of both inflationary and deflationary pressures.",
        "• Government debt as a percentage of GDP was not reported before 2005 but ranged from 53% in 2005 to a low of 8% in 2016, ending at 10% in 2017.",
        "• Foreign government aid constituted a significant portion of the economy, accounting for 40.125% of GDP in 2006.",
        "• The GDP per capita based on purchasing power parity was estimated at $3,200 in 2011, higher than the earlier PPP figures reported in the main table.",
        "• GDP composition by sector in 2011 was predominantly services at 55.9%, followed by agriculture at 37.7%, and industry at 6.4%.",
        "• Data on the population below the poverty line and household income or consumption shares for the lowest and highest 10% were not available.",
        "• The inflation rate based on consumer prices was estimated at 10% in 1999.",
        "• The labor force was recorded at 202,500 individuals in 2007, with occupational distribution in 2000 showing 75% employed in agriculture, 5% in industry, and 20% in services.",
        "• Unemployment rate data was not available.",
        "• The government budget in 2011 reported revenues of $313.1 million and expenditures of $261.7 million, with capital expenditures recorded as $0.",
        "• Key industries included fishing (notably tuna), mining, and timber production.",
        "• Industrial production growth rate data was not available.",
        "• Agricultural products comprised cocoa, coconuts, palm kernels, rice, potatoes, vegetables, fruit, cattle, pigs, fish, and timber.",
        "• Exports totaled $216.5 million in 2010, with main export commodities being timber, fish, palm oil, cocoa, and copra.",
        "• Major export partners in 2011 were China (54%), Australia (12.5%), and Thailand (4.6%).",
        "• Imports amounted to $360.3 million in 2010, primarily consisting of food, plant and equipment, manufactured goods, fuels, and chemicals.",
        "• Principal import partners in 2011 included Australia (27.3%), Singapore (26.4%), China (6.5%), Malaysia (5.1%), and New Zealand (5.1%).",
        "• External debt was reported at $166 million in 2004.",
        "• The national currency is the Solomon Islands dollar (SI$), subdivided into 100 cents.",
        "• The exchange rate in January 2017 was 7.833 Solomon Islands dollars per US$1.",
        "• The fiscal year for the Solomon Islands follows the calendar year."
      ],
      "metadata": {
        "processed_timestamp": "2025-08-01T12:00:21.141167",
        "openai_model": "gpt-4.1-mini",
        "bullet_points_count": 24
      },
      "source_file": "economy_of_solomon_islands.json",
      "original_index": 8
    }
  ]
}