{
  "extraction_info": {
    "source_file": "economy_of_cape_verde.json",
    "extraction_timestamp": "2025-08-02T17:13:27.629892",
    "total_sections_in_source": 6,
    "extracted_sections_count": 6,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Cape Verde is primarily service-oriented, with a focus on commerce, trade, transport, and public services.",
        "• Cape Verde is a small archipelagic nation characterized by a lack of natural resources and a history of severe droughts.",
        "• Agricultural activities are limited due to insufficient rainfall and are confined to only four islands for most of the year.",
        "• The country's economy has experienced steady growth since the late 1990s.",
        "• Cape Verde is officially classified as a country of average development, becoming only the second African nation to achieve this status after Botswana in 1994.",
        "• The nation maintains significant economic cooperation with Portugal at all levels of its economy.",
        "• This cooperation has influenced Cape Verde to link its currency, the Cape Verdean escudo, initially to the Portuguese escudo and subsequently to the euro in 1999."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:17.365493",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Resources",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Approximately 75% of food consumed in Cape Verde is imported, indicating a heavy reliance on external sources for sustenance.",
        "• The country annually experiences a significant trade deficit, which is financed primarily through foreign aid and remittances from emigrants.",
        "• Remittances from Cape Verdean emigrants contribute more than 20% to the nation's Gross Domestic Product (GDP), serving as a crucial economic supplement.",
        "• Economic reforms initiated by the new democratic government in 1991 aim to develop the private sector and attract foreign investment to diversify the economy.",
        "• Since 1991, the government has adopted policies including an open stance toward foreign investors and a comprehensive privatization program to stimulate economic growth.",
        "• The fishing industry in Cape Verde is characterized by abundant fish and shellfish resources, with small quantities exported.",
        "• The country possesses cold storage, freezing facilities, and fish processing plants located in Mindelo, Praia, and Sal, supporting its fisheries sector.",
        "• Despite the potential, the fishing industry, primarily targeting lobster and tuna, remains underexploited and not fully developed.",
        "• The economy is predominantly service-oriented, with commerce, transport, and public services making up nearly 70% of the GDP.",
        "• Although about 35% of the population resides in rural areas, agriculture's contribution to GDP was only 9.2% in 2010, a slight increase from 8.9% in 1995.",
        "• In 1998, fishing contributed approximately 1.5% to the total GDP.",
        "• The Cape Verdean government prioritized promoting a market economy and strengthening the private sector as key development strategies.",
        "• Other development priorities include expanding tourism, light manufacturing industries, fisheries, and improving transport, communications, and energy infrastructure.",
        "• Between 1994 and 1995, Cape Verde attracted approximately U.S.$50 million in foreign investments, with 50% allocated to industry, 19% to tourism, and 31% to fisheries and services.",
        "• The economic outlook for 2000 heavily depends on the continuation of aid flows, remittances, and the progress of the government's development initiatives."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:22.586126",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 15
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "Mineral industry",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Mining is an insignificant contributor to Cape Verde's economy, with most mineral requirements being imported.",
        "• As of 2007, mineral commodity production in Cape Verde was limited and primarily consisted of the following:",
        "• Clay, produced on the islands of Boa Vista, Sal, and São Vicente.",
        "• Gypsum and iron ore, produced on the island of Maio.",
        "• Limestone, produced on the islands of Boa Vista, Sal, and Santo Antão.",
        "• Pozzolana, produced on the island of Santo Antão.",
        "• Salt, produced on the islands of Maio and Sal.",
        "• Cape Verde was not a producer of natural gas or petroleum as of 2007."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:24.738244",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 2
    },
    {
      "section_number": "2",
      "section_name": "Transportation",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Cape Verde's strategic geographic position at the crossroads of mid-Atlantic air and sea lanes has been significantly enhanced through improvements at key transportation hubs.",
        "• The harbour at Mindelo, known as Porto Grande, has undergone substantial upgrades to bolster maritime connectivity and logistics.",
        "• Sal's international airport has also seen notable improvements, contributing to the archipelago's enhanced accessibility.",
        "• Ship repair facilities at Mindelo were officially opened in 1983, marking a key development in maritime infrastructure.",
        "• The harbours at both Mindelo and Praia have recently been renovated to improve port operations and capacity.",
        "• The primary ports in Cape Verde are Mindelo and Praia; however, all other islands possess smaller port facilities, with plans underway to expand some of these facilities in the near future.",
        "• In addition to the international airport on Sal, airports are present on all inhabited islands except for the smallest island, Brava.",
        "• The airport on Brava was constructed but subsequently shut down after being deemed too dangerous due to multiple failed landings.",
        "• The archipelago has a total road network of 3,050 kilometers (1,830 miles), of which 1,010 kilometers (606 miles) are paved roads.",
        "• The new Praia International Airport is currently operational, enhancing air connectivity for the region."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:29.690859",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 3
    },
    {
      "section_number": "3",
      "section_name": "International recognition",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Cape Verde is classified as a developing country and is included on the United Nations list of Small Island Developing States, highlighting its status within the international community.",
        "• In 2007, Cape Verde was officially graduated from the category of Least Developed Countries (LDCs) by the United Nations, marking only the second instance in history where a country has achieved this transition.",
        "• On December 18, 2007, the General Council of the World Trade Organization (WTO) approved a comprehensive accession package for Cape Verde, facilitating its entry into the organization.",
        "• Cape Verde's accession to the WTO became effective on July 23, 2008, exactly 30 days after the country ratified its membership on June 23, 2008.",
        "• The accession package mandated that Cape Verde adapt certain aspects of its economic regulation, including the introduction of a new Customs Code and the enactment of copyright and patent laws aligned with the Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS).",
        "• Specifically, Cape Verde is required to implement legal frameworks consistent with international intellectual property standards, including laws on copyrights and industrial property.",
        "• According to the World Intellectual Property Organization (WIPO), Cape Verde has established a law on copyrights (Law No. 101/III/90, enacted in December 1990) and an Industrial Property Code (Legislative Decree No. 4/2007, dated August 20, 2007).",
        "• Pascal Lamy, the Director-General of the WTO, expressed his satisfaction with Cape Verde’s accession, stating that it would strengthen the multilateral trading system.",
        "• Lamy emphasized that WTO membership would enable Cape Verde to further integrate into the global economy, promoting economic development and international trade."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:35.770605",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 4
    },
    {
      "section_number": "4",
      "section_name": "Data",
      "chapter_name": "Economy of Cape Verde",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The data table presents key economic indicators for Cape Verde spanning the years 1980 to 2017, providing a comprehensive overview of the country's economic development over nearly four decades.",
        "• In 1980, Cape Verde's Gross Domestic Product (GDP) measured approximately 0.23 billion US dollars in Purchasing Power Parity (PPP), with a per capita GDP of 798 US dollars PPP, and a nominal GDP of 0.16 billion US dollars.",
        "• The GDP growth rate in 1980 was 5.3%, with an inflation rate of 15.1%, and the government debt constituted an unspecified percentage of GDP.",
        "• By 1985, GDP in PPP terms increased to 0.41 billion US dollars, with per capita GDP rising to 1,287 US dollars PPP, and nominal GDP slightly decreased to 0.15 billion US dollars; GDP growth was 8.6%, inflation decreased to 5.9%, and government debt data remained unspecified.",
        "• In 1990, GDP in PPP terms reached 0.69 billion US dollars, with per capita GDP at 1,633 US dollars PPP, and nominal GDP at 0.34 billion US dollars; GDP growth was 0.7%, inflation increased to 11.1%, and government debt was 11.1% of GDP.",
        "• The year 1995 saw GDP in PPP terms at 0.84 billion US dollars, with per capita GDP at 2,106 US dollars PPP, and nominal GDP at 0.54 billion US dollars; GDP growth was 7.5%, inflation was 8.4%, and government debt was 8.4% of GDP.",
        "• In 2000, GDP in PPP terms was 1.37 billion US dollars, with per capita GDP at 3,089 US dollars PPP, and nominal GDP at 0.61 billion US dollars; GDP growth was 7.3%, inflation was negative at −2.4%, and government debt was notably high at 83% of GDP.",
        "• By 2005, GDP in PPP terms increased to 2.05 billion US dollars, with per capita GDP at 4,278 US dollars PPP, and nominal GDP at 1.12 billion US dollars; GDP growth slowed to 5.8%, inflation was 0.4%, and government debt was 85% of GDP.",
        "• In 2006, GDP in PPP terms was 2.30 billion US dollars, with per capita GDP at 4,778 US dollars PPP, and nominal GDP at 1.26 billion US dollars; GDP growth was 9.1%, inflation increased to 4.8%, and government debt decreased to 77% of GDP.",
        "• The year 2007 saw GDP in PPP terms at 2.58 billion US dollars, with per capita GDP at 5,338 US dollars PPP, and nominal GDP at 1.65 billion US dollars; GDP growth was 9.2%, inflation was 4.4%, and government debt was 65% of GDP.",
        "• In 2008, GDP in PPP terms reached 2.81 billion US dollars, with per capita GDP at 5,793 US dollars PPP, and nominal GDP at 1.96 billion US dollars; GDP growth was 6.7%, inflation was 6.8%, and government debt was 57% of GDP.",
        "• The 2009 data shows a slight contraction with GDP in PPP terms at 2.79 billion US dollars, per capita GDP at 5,750 US dollars PPP, and nominal GDP at 1.85 billion US dollars; GDP experienced a decline of −1.3%, inflation was 1.0%, and government debt increased to 65% of GDP.",
        "• In 2010, GDP in PPP terms increased marginally to 2.87 billion US dollars, with per capita GDP at 5,883 US dollars PPP, and nominal GDP at 1.83 billion US dollars; GDP growth was 1.5%, inflation was 2.1%, and government debt was 72% of GDP.",
        "• The year 2011 saw GDP in PPP terms at 3.04 billion US dollars, with per capita GDP at 6,205 US dollars PPP, and nominal GDP at 2.05 billion US dollars; GDP growth was 4.0%, inflation was 4.5%, and government debt was 79% of GDP.",
        "• In 2012, GDP in PPP terms was 3.13 billion US dollars, with per capita GDP at 6,195 US dollars PPP, and nominal GDP at 1.91 billion US dollars; GDP growth was 1.1%, inflation was 2.5%, and government debt was 91% of GDP.",
        "• The 2013 data indicates GDP in PPP terms at 3.21 billion US dollars, with per capita GDP at 6,268 US dollars PPP, and nominal GDP at 2.03 billion US dollars; GDP growth was 0.8%, inflation was 1.5%, and government debt was 102% of GDP.",
        "• In 2014, GDP in PPP terms increased to 3.29 billion US dollars, with per capita GDP at 6,342 US dollars PPP, and nominal GDP at 2.04 billion US dollars; GDP growth was 0.6%, inflation was negative at −0.2%, and government debt was 116% of GDP.",
        "• The year 2015 saw GDP in PPP terms at 3.36 billion US dollars, with per capita GDP at 6,396 US dollars PPP, and nominal GDP at 1.75 billion US dollars; GDP growth was 1.0%, inflation was 0.1%, and government debt was 126% of GDP.",
        "• In 2016, GDP in PPP terms reached 3.53 billion US dollars, with per capita GDP at 6,643 US dollars PPP, and nominal GDP at 1.86 billion US dollars; GDP growth was 3.8%, inflation was negative at −1.4%, and government debt was 129% of GDP.",
        "• The final year in the dataset, 2017, recorded GDP in PPP terms at 3.96 billion US dollars, with per capita GDP at 6,944 US dollars PPP, and nominal GDP at 1.97 billion US dollars; GDP growth was 4.0%, inflation was 0.8%, and government debt was 126% of GDP."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:04:56.277619",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_cape_verde.json",
      "original_index": 5
    }
  ]
}