{
  "extraction_info": {
    "source_file": "economy_of_cyprus.json",
    "extraction_timestamp": "2025-08-02T17:13:27.724255",
    "total_sections_in_source": 15,
    "extracted_sections_count": 15,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Cyprus is classified as a high-income economy by the World Bank and was recognized by the International Monetary Fund as an advanced economy in 2001.",
        "• Cyprus adopted the euro (€) as its official currency on 1 January 2008, replacing the Cypriot pound at an irrevocable fixed exchange rate of CYP 0.585274 per €1.",
        "• The Cypriot financial crisis, which was part of the broader European debt crisis, significantly impacted the country's economy during the 2010s.",
        "• In March 2013, the Cypriot government reached an agreement with eurozone partners to restructure its banking sector by splitting the Cyprus Popular Bank (also known as Laiki Bank) into a \"bad\" bank, which would be wound down gradually, and a \"good\" bank, which would be absorbed by the larger Bank of Cyprus.",
        "• As part of the bailout conditions, Cyprus received €10 billion from the European Commission, the European Central Bank, and the International Monetary Fund, in exchange for implementing a significant haircut on uninsured deposits.",
        "• Deposits of €100,000 or less, which are insured, were protected and not subject to the haircut.",
        "• Following a recession lasting three and a half years, Cyprus returned to economic growth in the first quarter of 2015.",
        "• Cyprus successfully completed its three-year financial assistance program at the end of March 2016.",
        "• During the program, Cyprus borrowed a total of €6.3 billion from the European Stability Mechanism (ESM) and €1 billion from the IMF.",
        "• The remaining €2.7 billion of the ESM bailout was never disbursed due to the Cypriot government's better-than-expected financial performance during the program.",
        "• The section references charts depicting Cyprus's GDP and the exclusive economic zone between Israel and Cyprus, which was signed in Nicosia."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:24:46.349929",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 0
    },
    {
      "section_number": "1",
      "section_name": "Economy in the government-controlled area",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Cyprus has an open, free-market, service-based economy with some light manufacturing activities.",
        "• The country promotes its geographical location as a \"bridge\" between East and West, leveraging its educated, English-speaking population, moderate local costs, good airline connections, and advanced telecommunications infrastructure.",
        "• Since gaining independence from the United Kingdom in 1960, Cyprus has demonstrated a successful economic record characterized by strong growth, full employment, and relative stability.",
        "• The economy transitioned from an underdeveloped agrarian system inherited from colonial rule to a modern economy with dynamic services, industrial, and agricultural sectors, supported by an advanced physical and social infrastructure.",
        "• Cypriots are among the most prosperous populations in the Mediterranean region, with GDP per capita in 2024 exceeding $38,000 in nominal terms and $62,000 based on purchasing power parity (PPP).",
        "• The country's high standard of living is reflected in its \"very high\" Human Development Index, ranking 29th out of 191 countries globally.",
        "• After over three decades of continuous growth, the Cypriot economy contracted in 2009 due to exposure to the Great Recession and the European debt crisis.",
        "• A severe economic setback occurred following the Evangelos Florakis Naval Base explosion in July 2011, with estimated costs to the economy ranging from €1 billion to €3 billion, representing up to 17% of GDP.",
        "• Despite past challenges, Cyprus's economic achievements have been significant, especially considering the economic and social dislocation caused by the Turkish invasion of 1974 and ongoing occupation of the northern part of the island by Turkey.",
        "• The Turkish invasion resulted in the loss of 70% of the island's wealth-producing resources, a 65% reduction in hotels and tourist accommodations, a 46% decline in industrial output, and a 56% decrease in mining and quarrying production.",
        "• The invasion also led to the loss of the port of Famagusta, which handled 83% of general cargo, and the closure of Nicosia International Airport located in the buffer zone.",
        "• Cyprus's economic success has been attributed to the adoption of a market-oriented system, sound macroeconomic policies, a dynamic and flexible entrepreneurial environment, and a highly educated labor force.",
        "• The economy benefits from close cooperation between the public and private sectors.",
        "• Over the past 30 years, the economy shifted from agriculture to light manufacturing and services, with the services sector—including tourism—contributing nearly 80% to GDP and employing over 70% of the labor force.",
        "• Industry and construction account for approximately 20% of GDP and employment, while agriculture contributes 2.1% to GDP and 8.5% to employment, with potatoes and citrus being the principal export crops.",
        "• During the 1980s, Cyprus experienced robust growth with an average annual rate of 6.1%.",
        "• In the 1990s, growth was mixed: 9.7% in 1992, 1.7% in 1993, 6.0% in 1994, 6.0% in 1995, 1.9% in 1996, and 2.3% in 1997, highlighting the economy's vulnerability to fluctuations in tourism and regional political conditions.",
        "• Declining competitiveness in tourism and manufacturing is expected to hinder growth until structural reforms are implemented.",
        "• Prior to adopting the euro in 2008, overvaluation of the Cypriot pound kept inflation in check.",
        "• Trade is vital to Cyprus's economy, which is not self-sufficient in food and had few natural resources until recent offshore gas discoveries.",
        "• The trade deficit continues to grow, with Cyprus importing fuels, raw materials, heavy machinery, and transportation equipment.",
        "• More than 50% of Cyprus's trade is with the European Union, especially Greece and the United Kingdom, while 20% of exports go to the Middle East.",
        "• In 1991, Cyprus introduced a value-added tax (VAT), which was 19% as of 13 January 2014.",
        "• Cyprus ratified the General Agreement on Tariffs and Trade (GATT) in 1995 and fully implemented it starting 1 January 1996.",
        "• Negotiations for European Union accession began on 31 March 1998, culminating in Cyprus joining the EU as a full member in 2004."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:24:59.356944",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 1
    },
    {
      "section_number": "1.1",
      "section_name": "Investment climate",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The legal system of Cyprus is based on English law, making it familiar to most international financiers.",
        "• Cyprus's legislation was aligned with European Union (EU) norms in the period leading up to its EU accession in 2004.",
        "• Restrictions on foreign direct investment (FDI) were removed prior to EU accession, allowing for 100% foreign ownership in many cases.",
        "• Foreign portfolio investment in the Cyprus Stock Exchange was liberalized, facilitating increased foreign participation.",
        "• In 2002, Cyprus implemented a modern, business-friendly tax system featuring a corporate tax rate of 12.5%, which is among the lowest in the EU.",
        "• Cyprus has concluded double taxation treaties with more than 40 countries, enhancing its attractiveness for international investors.",
        "• As a member of the Eurozone, Cyprus has no exchange restrictions, allowing free currency exchange and transactions.",
        "• Non-residents and foreign investors are permitted to freely repatriate proceeds from their investments in Cyprus without restrictions."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:03.555347",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 2
    },
    {
      "section_number": "2",
      "section_name": "Role as a financial hub",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the dissolution of the Soviet Union, Cyprus gained significant popularity as a portal for Western investment into Russia and Eastern Europe, establishing itself as the most common tax haven for companies originating from these regions.",
        "• In recent years, there has been an increase in investment flows from Western countries through Cyprus into Asia, notably China and India, as well as into South America and the Middle East.",
        "• Cyprus is used by businesses outside the European Union as an entry point for investment into European markets.",
        "• The business services sector in Cyprus is the fastest growing sector of the economy and has surpassed all other sectors in importance, with the Cyprus International Business Association (CIPA) playing a fundamental role in this growth trend.",
        "• Following the 2022 Russian invasion of Ukraine, Cypriot businesses and individuals faced scrutiny and criticism for allegedly allowing breaches of EU and US sanctions, with some entities making belated efforts to cease such activities or to bring offenders to justice.",
        "• Several professional law and accounting firms in Cyprus have been identified as assisting Russian oligarchs in evading sanctions.",
        "• In January 2024, during a session of the Council of Europe Parliamentary Assembly, Cypriot President Nikos Christodoulides stated that Cyprus had fully implemented all European Union sanctions against Russia.",
        "• Around the same time, reports indicated that Russian deposits in Cypriot banks had decreased by 76% from 2014 to 2022.",
        "• Additionally, the number of Russian clients utilizing Cypriot banks declined by 82% over the same period."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:07.855996",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 3
    },
    {
      "section_number": "3",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The agricultural sector in Cyprus continues to employ a significant proportion of the country's labor force, exemplified by the image of a vineyard in the Troodos Mountains.",
        "• In 2018, Cyprus's agricultural production included 106,000 tons of potatoes.",
        "• In the same year, Cyprus produced 37,000 tons of tangerines.",
        "• Grape production in 2018 amounted to 23,000 tons.",
        "• Orange production reached 20,000 tons in 2018.",
        "• Cyprus produced 19,000 tons of grapefruit in 2018.",
        "• Olive production in 2018 was 19,000 tons.",
        "• Wheat production totaled 18,000 tons in 2018.",
        "• Barley production also reached 18,000 tons in 2018.",
        "• Tomato production in 2018 was 15,000 tons.",
        "• Watermelon production amounted to 13,000 tons in 2018.",
        "• Melon production in 2018 was 10,000 tons.",
        "• In addition to these major crops, Cyprus produced smaller quantities of various other agricultural products."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:12.872829",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 4
    },
    {
      "section_number": "4",
      "section_name": "Oil and gas",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Surveys indicate that the eastern Mediterranean basin between Cyprus and Israel contains over 100 trillion cubic feet (2.831 trillion cubic meters) of untapped natural gas reserves, which is nearly equal to the world's total annual natural gas consumption.",
        "• In 2011, Noble Energy estimated that a pipeline to the Leviathan gas field could be operational as early as 2014 or 2015.",
        "• In January 2012, Noble Energy announced the discovery of a natural gas field in the region.",
        "• The discovery attracted partnerships from Shell, Delek, and Avner.",
        "• Several exploration and production sharing contracts have been signed with international companies, including Eni, KOGAS, TotalEnergies, ExxonMobil, and QatarEnergy.",
        "• Developing infrastructure is essential for landing the gas in Cyprus and for liquefaction to facilitate export."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:15.841791",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 6
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 5
    },
    {
      "section_number": "5",
      "section_name": "Role as a shipping hub",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The port of Limassol is identified as the busiest port in Cyprus, serving as a central hub for maritime activities on the island.",
        "• Cyprus is recognized as one of the largest ship management centers globally, hosting approximately 50 ship management companies and marine-related foreign enterprises engaged in international operations within the country.",
        "• The majority of the world's largest ship management companies have established fully operational offices on the island, indicating Cyprus’s significant role in global maritime management.",
        "• The country's strategic geographical location at the crossroads of three continents enhances its prominence in merchant shipping, facilitated by its proximity to the Suez Canal, which further supports its maritime industry.",
        "• As of 1 January 2013, Cyprus boasts the tenth-largest registered fleet in the world, comprising 1,030 vessels with a total deadweight tonnage (dwt) of 31,706,000."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:19.119430",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 6
    },
    {
      "section_number": "6",
      "section_name": "Tourism",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Tourism is a vital component of Cyprus's economy, culture, and overall brand development.",
        "• The island receives over 2 million tourist arrivals annually, making it the 40th most popular destination globally.",
        "• When considering per capita of the local population, Cyprus ranks 17th in the world for tourism.",
        "• The tourism industry in Cyprus has received various international awards, including recognition from the Sustainable Destinations Global Top 100, VISION on Sustainable Tourism, Totem Tourism, and Green Destination titles, awarded to Limassol and Paphos in December 2014.",
        "• Cyprus's beaches have been awarded a total of 57 Blue Flags, indicating high standards of water quality, safety, and environmental management.",
        "• Cyprus became a full member of the World Tourism Organization (WTO) in 1975, the year the organization was established.",
        "• According to the World Economic Forum's 2013 Travel and Tourism Competitiveness Index, Cyprus ranks 29th globally in overall tourism industry competitiveness.",
        "• In terms of Tourism Infrastructure, Cyprus ranks 1st in the world, highlighting its advanced facilities and services supporting tourism.",
        "• The Cyprus Tourism Organization (CTO) operates as a semi-governmental entity responsible for overseeing industry practices and promoting Cyprus as a tourist destination internationally."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:24.547602",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 7
    },
    {
      "section_number": "7",
      "section_name": "Trade",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2008, the fiscal aggregate value of goods and services exported by Cyprus was approximately $1.53 billion.",
        "• The main exports from Cyprus in 2008 included citrus fruits, cement, potatoes, clothing, and pharmaceuticals.",
        "• During the same year, Cyprus's total value of goods and services imported was about $8.689 billion.",
        "• Major imported goods and services in 2008 comprised consumer goods, machinery, petroleum and other lubricants, transport equipment, and intermediate goods."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:27.005896",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 8
    },
    {
      "section_number": "7.1",
      "section_name": "Cypriot trade partners",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Greece has traditionally been a major trade partner of Cyprus, serving as both an export and import partner.",
        "• In fiscal year 2007, Greece accounted for 21.1 percent of Cyprus's total exports.",
        "• During the same period, Greece was responsible for 17.7 percent of Cyprus's total imports of goods and services.",
        "• Other significant trade partners of Cyprus include the United Kingdom (UK) and Italy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:29.627942",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 4
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 9
    },
    {
      "section_number": "8",
      "section_name": "Eurozone crisis",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 2012, Cyprus was affected by the Eurozone financial and banking crisis, marking a significant economic downturn for the country.",
        "• In June 2012, the Cypriot government announced it would require €1.8 billion in foreign aid specifically to support the Cyprus Popular Bank.",
        "• Following this announcement, Fitch Ratings downgraded Cyprus's credit rating to junk status, citing increased financial instability.",
        "• Fitch indicated that Cyprus would need an additional €4 billion to support its banking sector, primarily due to the exposure of the Bank of Cyprus, Cyprus Popular Bank, and Hellenic Bank to the Greek financial crisis.",
        "• The downgrade was mainly attributed to the substantial exposure of Cyprus’s three largest banks—Bank of Cyprus, Cyprus Popular Bank, and Hellenic Bank—to Greece’s financial turmoil.",
        "• In June 2012, Cypriot finance minister Vassos Shiarly stated that officials from the European Central Bank, European Commission, and IMF would conduct an in-depth investigation into Cyprus’s economy and banking sector to determine the funding requirements.",
        "• The Cypriot Ministry of Finance rejected the possibility of implementing the sweeping austerity measures that had caused turbulence in Greece but acknowledged that some negative repercussions could occur.",
        "• In November 2012, international lenders negotiating a bailout with Cyprus agreed on a key capital ratio for banks and established a system for banking sector supervision.",
        "• Both commercial banks and cooperative banks in Cyprus were to be overseen by the Central Bank and the Ministry of Finance.",
        "• The agreed core Tier 1 capital ratio—a measure of banks’ financial strength—was set at 9% by the end of 2013, with a target increase to 10% in 2014.",
        "• In 2014, Harris Georgiades emphasized that exiting the Memorandum with the European troika required Cyprus to return to the open markets, contingent upon the \"timely, effective and full implementation of the program.\"",
        "• Georgiades also stressed that implementing the Memorandum of understanding should be achieved without additional loans.",
        "• In 2015, Cyprus received praise from the President of the European Commission for adopting austerity measures and following through with a rigorous reform program.",
        "• In 2016, Moody’s Investors Service upgraded its outlook on the Cypriot banking system from stable to positive, citing expectations of profitability recovery and asset quality improvement.",
        "• The economic recovery was driven by sectors such as tourism, business services, and increased consumer spending.",
        "• Creditor confidence was bolstered, enabling Bank of Cyprus to reduce its Emergency Liquidity Assistance from €9.4 billion in 2013 to €2.0 billion.",
        "• During the same period, Bank of Cyprus chairman Josef Ackermann called on the European Union to pledge financial support for a permanent resolution to the Cyprus dispute."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:38.639749",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 17
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 10
    },
    {
      "section_number": "9",
      "section_name": "Statistics",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Gross Domestic Product (GDP) of Cyprus has shown fluctuations from 2017 to 2022, with specific values recorded annually in billions of US dollars and corresponding percentage growth rates.",
        "• In 2017, Cyprus's GDP was $22.87 billion, reflecting a 5.9% increase from the previous year.",
        "• The GDP increased to $25.52 billion in 2018, representing a 5.7% growth rate.",
        "• In 2019, the GDP further rose to $25.95 billion, with a growth rate of 5.8%.",
        "• During 2020, the GDP slightly declined to $25.23 billion, with a reduced growth rate of 3.4%.",
        "• In 2021, the GDP experienced a significant rebound to $29.48 billion, marking a 9.9% growth rate.",
        "• The GDP slightly decreased again in 2022 to $29.25 billion, with a growth rate of 3.1%.",
        "• The unemployment rate in Cyprus has fluctuated over the same period, with specific percentages and changes noted annually.",
        "• In 2017, the unemployment rate was 11.1%, which decreased by 1.8 percentage points from the previous period.",
        "• The unemployment rate further declined to 8.4% in 2018, a reduction of 2.7 percentage points.",
        "• In 2019, the unemployment rate dropped to 7.1%, representing a 1.3 percentage point decrease.",
        "• In 2020, the unemployment rate slightly increased to 7.6%, with a marginal change of 0.5 percentage points.",
        "• The rate then slightly decreased again in 2021 to 7.5%, with a minimal change of 0.1 percentage points.",
        "• In 2022, the unemployment rate further decreased to 7.0%, reflecting a 0.5 percentage point decline."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:44.311748",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 11
    },
    {
      "section_number": "10",
      "section_name": "Economy of Northern Cyprus",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Turkish-occupied northern Cyprus is approximately one-fifth the size of the economy of the government-controlled southern part of the island.",
        "• The GDP per capita in northern Cyprus is about half of that in the southern part.",
        "• The de facto administration of northern Cyprus is recognized solely by Turkey, which complicates its ability to secure foreign financing.",
        "• Foreign firms have been hesitant to invest in northern Cyprus due to its limited international recognition and financial constraints.",
        "• The economy of northern Cyprus primarily depends on the agricultural sector and government services, which together employ roughly 50% of the workforce.",
        "• The tourism sector also plays a significant role in the economy of northern Cyprus, contributing substantially to economic activity.",
        "• The small economy faces challenges stemming from the Turkish lira being legal tender, which has contributed to economic instability.",
        "• To address economic weaknesses, Turkey provides substantial financial aid to northern Cyprus.",
        "• Water shortages are an increasing problem in both northern and southern parts of the island, with several desalination plants planned to mitigate this issue.",
        "• There is a pronounced economic disparity between the Turkish Cypriot community in the north and the Greek Cypriot community in the south.",
        "• Although the economy operates on a free-market basis, several issues hinder economic growth, including a lack of private and government investment.",
        "• The economy suffers from shortages of skilled labor and experienced managers.",
        "• Inflation and the devaluation of the Turkish lira further exacerbate economic difficulties in northern Cyprus."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:50.864425",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 12
    },
    {
      "section_number": "10.1",
      "section_name": "Trade with Turkey",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Turkey is the primary trading partner of Northern Cyprus, supplying 55% of its imports and absorbing 48% of its exports.",
        "• On 5 July 1994, the European Court of Justice (ECJ) issued a landmark ruling against the British practice of importing produce from Northern Cyprus based on certificates of origin and phytosanitary certificates granted by the _de facto_ authorities.",
        "• The ECJ decision mandated that only goods bearing certificates of origin from the internationally recognized Republic of Cyprus could be imported by EU member states.",
        "• Following the ECJ ruling, Turkish Cypriot exports to the EU significantly declined, decreasing from $36.4 million in 1993 (which accounted for 66.7% of total Turkish Cypriot exports) to $24.7 million in 1996 (representing 35% of total exports).",
        "• Despite the decline, the EU remains the second-largest trading partner of Northern Cyprus, accounting for 24.7% of total imports and 35% of total exports.",
        "• The main exports of Northern Cyprus include citrus and dairy products, followed by rakı (a traditional alcoholic beverage), scrap metal, and clothing.",
        "• Assistance from Turkey is crucial to the Turkish Cypriot economy; under the latest economic protocol signed on 3 January 1997, Turkey committed to providing loans totaling $250 million.",
        "• The $250 million loan aims to support projects related to public finance, tourism, banking, and privatization as outlined in the protocol.",
        "• The Turkish lira experienced hyperinflation every year until its replacement by the Turkish new lira in 2005, which exerted downward pressure on the standard of living in Turkish Cypriot areas.",
        "• The _de facto_ authorities have established a free market in foreign exchange and allow residents to hold foreign-currency denominated bank accounts.",
        "• This foreign exchange policy encourages transfers from Turkish Cypriots living abroad, facilitating economic activity and remittances."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:25:54.746888",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 13
    },
    {
      "section_number": "11",
      "section_name": "Happiness",
      "chapter_name": "Economy of Cyprus",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Economic factors such as Gross Domestic Product (GDP) and national income are strongly correlated with the happiness levels of a nation's citizens, indicating that higher economic prosperity generally associates with increased life satisfaction.",
        "• A 2005 study surveyed citizens from various countries, asking them to rate their overall happiness on a scale of 1 to 7, where 1 signifies \"Completely happy\" and 7 signifies \"Completely unhappy\"; Cyprus scored a happiness rating of 5.29, indicating a tendency toward unhappiness.",
        "• In the same study, regarding satisfaction with their main job, Cypriot citizens scored 5.36 on a 1 to 7 scale, where 1 is \"Completely satisfied\" and 7 is \"Completely dissatisfied,\" suggesting moderate dissatisfaction with employment.",
        "• According to the 2018 World Happiness Report, Cyprus ranks 61st out of 156 countries, while Northern Cyprus ranks 58th; the report evaluates countries based on variables including income, healthy life expectancy, social support, freedom, trust, and generosity.",
        "• Economic factors significantly influence life satisfaction in Cyprus, with notable gender disparities: women participate in the labor force at lower rates than men, often working in lower-ranked, public, and service sector jobs such as hotel work in the tourism industry.",
        "• Women in the tourism sector participate primarily to serve and bring pride to their families rather than for personal fulfillment, reflecting cultural and economic motivations.",
        "• Women with incomes higher than the household mean report higher life satisfaction, whereas women with lower incomes report lower satisfaction, indicating income level influences happiness.",
        "• When comparing themselves to others, individuals who perceive themselves as having a higher economic status than their reference group report the lowest levels of life satisfaction, highlighting the importance of relative income.",
        "• Although there is a positive correlation between income and happiness, it is relatively weak; a stronger correlation exists between individuals’ income comparisons and their happiness levels, emphasizing the impact of social comparison.",
        "• Cyprus is classified as a Mediterranean welfare regime with a weak public welfare system, resulting in a heavy reliance on family for both familial and economic support.",
        "• Being a full-time housewife has a more pronounced negative effect on women's happiness in Northern Cyprus than being unemployed, illustrating how gender roles and labor participation influence life satisfaction.",
        "• Economic factors negatively correlate with happiness among residents of the capital city, Nicosia, with citizens living there expressing lower happiness levels regardless of socio-economic variables.",
        "• Young people residing in Nicosia are significantly less happy than those in other parts of Cyprus, whereas older residents do not exhibit the same level of unhappiness, indicating age-related and geographic disparities in well-being."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T19:26:01.891366",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_cyprus.json",
      "original_index": 14
    }
  ]
}