{
  "extraction_info": {
    "source_file": "economy_of_bangladesh.json",
    "extraction_timestamp": "2025-08-02T17:13:27.432783",
    "total_sections_in_source": 26,
    "extracted_sections_count": 26,
    "skipped_sections_count": 0
  },
  "sections": [
    {
      "section_number": "1",
      "section_name": "Introduction",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The economy of Bangladesh is classified as a major developing mixed economy, characterized by both private and public sector participation.",
        "• It is the second-largest economy in South Asia, ranking as the 35th largest in the world in nominal gross domestic product (GDP) terms and the 25th largest when measured by purchasing power parity (PPP).",
        "• Various financial institutions recognize Bangladesh as one of the Next Eleven economies, indicating its potential for significant future growth.",
        "• Bangladesh has been transitioning from a frontier market to an emerging market, reflecting improvements in economic stability and investment climate.",
        "• The country is a member of the South Asian Free Trade Area (SAFTA) and the World Trade Organization (WTO), facilitating regional and global trade integration.",
        "• In the fiscal year 2021–2022, Bangladesh achieved a GDP growth rate of 7.2% following the global COVID-19 pandemic, marking one of the fastest growth rates worldwide.",
        "• Bangladesh is considered one of the world's fastest-growing economies, driven by various structural reforms and sectoral developments.",
        "• Industrialization in Bangladesh accelerated significantly after the partition of India, due to labor reforms and the emergence of new industries.",
        "• Between 1947 and 1971, East Bengal (now Bangladesh) contributed between 50% and 70% of Pakistan’s exports, highlighting its economic importance even before independence.",
        "• Modern Bangladesh began implementing economic reforms in the late 1970s, focusing on promoting free markets and attracting foreign direct investment (FDI).",
        "• By the 1990s, Bangladesh developed a booming ready-made garments (RMG) industry, which became a cornerstone of its export sector.",
        "• As of 16 March 2024, Bangladesh has the highest number of green garment factories globally, with Leadership in Energy and Environmental Design (LEED) certification from the US Green Building Council (USGBC).",
        "• The green garment factories in Bangladesh include 80 platinum-rated, 119 gold-rated, 10 silver-rated, and four without any rating, reflecting a strong commitment to sustainable manufacturing.",
        "• As of 6 March 2024, Bangladesh hosts 54 of the top 100 LEED Green Garment Factories worldwide, including 9 of the top 10 and 18 of the top 20, indicating global leadership in eco-friendly apparel manufacturing.",
        "• The pharmaceutical industry in Bangladesh is growing at an average annual rate of 12%, with the country almost self-sufficient in medicine production, meeting 98% of domestic demand.",
        "• Bangladesh is unique among the 48 least-developed countries in nearly achieving self-sufficiency in pharmaceuticals, with local companies dominating the market.",
        "• Remittances from the Bangladeshi diaspora are a vital source of foreign exchange reserves, supporting the country’s balance of payments and economic stability.",
        "• Agriculture in Bangladesh is supported by government subsidies and ensures food self-sufficiency, contributing to national food security.",
        "• The country has pursued an export-oriented industrialization strategy to promote economic growth and diversification.",
        "• Post-pandemic, Bangladesh experienced robust economic growth characterized by macroeconomic stability, infrastructure improvements, a burgeoning digital economy, and increased trade flows.",
        "• Tax revenues in Bangladesh are relatively low, constituting only 7.7% of GDP, indicating challenges in tax collection and fiscal policy.",
        "• The banking sector faces concerns due to a significant volume of non-performing loans (NPLs) or loan defaults, impacting financial stability.",
        "• The private sector accounts for approximately 80% of Bangladesh’s GDP, emphasizing its dominant role in economic activity.",
        "• The Dhaka Stock Exchange and the Chittagong Stock Exchange are the two primary stock markets in Bangladesh.",
        "• Most Bangladeshi businesses are privately owned small and medium-sized enterprises (SMEs), which constitute about 90% of all business entities in the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:32:21.486895",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 0
    },
    {
      "section_number": "0.1",
      "section_name": "Precolonial period",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section begins with an example of early trade, noting that an African giraffe was imported into the Bengal region and later re-exported to China around the year 1415, illustrating the region’s participation in long-distance trade networks.",
        "• The major maritime trade routes of the Bengal Sultanate are highlighted, emphasizing Bengal’s strategic position in regional and international commerce.",
        "• Punch-marked coins are identified as the earliest form of currency found in Bangladesh, dating back to the Iron Age and the first millennium BCE, indicating a long history of monetary systems.",
        "• Roman coins from the 1st century CE, featuring images of Hercules, have been excavated in Bangladesh, providing evidence of trade links with the Roman world.",
        "• The Wari-Bateshwar ruins are believed to have been the emporium (trading center) of Sounagoura, a city mentioned by Roman geographer Claudius Ptolemy, suggesting a significant ancient trading hub.",
        "• The eastern segment of Bengal was a historically prosperous region, benefiting from the Ganges Delta’s mild, almost tropical climate, fertile soil, abundant water, and plentiful fish, wildlife, and fruit.",
        "• Living standards for Bengal’s elite were comparatively higher than those in other parts of the Indian subcontinent, reflecting regional economic prosperity.",
        "• Key trade routes such as the Grand Trunk Road, Tea Horse Road, and Silk Road connected Bengal to broader regional and international markets, facilitating extensive commerce.",
        "• Between 400 and 1200 CE, Bengal maintained a well-developed economy characterized by land ownership, agriculture, livestock, shipping, trade, commerce, taxation, and banking.",
        "• Muslim trade with Bengal increased after the fall of the Sasanian Empire and the Arab takeover of Persian trade routes, with much of this trade occurring east of the Meghna River in southeastern Bengal.",
        "• After 1204 CE, Muslim conquerors inherited the gold and silver reserves of pre-Islamic kingdoms, bolstering Bengal’s economic resources.",
        "• The Bengal Sultanate established a mercantile empire, with Bengali ships being the largest in the Bay of Bengal and across the Indian Ocean trade network, indicating naval and commercial dominance.",
        "• Ship-owning merchants from Bengal often acted as royal envoys of the Sultan, illustrating the close relationship between commerce and political authority.",
        "• A significant number of wealthy Bengali merchants and shipowners resided in Malacca, a major trading hub, highlighting Bengal’s extensive maritime influence.",
        "• Bengal’s vessels transported embassies from Brunei and Sumatra to China, demonstrating diplomatic and trade links across Asia.",
        "• Bengal and the Maldives operated the largest shell currency network in history, showcasing advanced monetary practices based on shell currency.",
        "• A Masai giraffe from Malindi, Africa, was shipped to Bengal and later gifted to the Emperor of China as a diplomatic gift from the Sultan of Bengal, exemplifying cross-continental exchange.",
        "• The rulers of Arakan looked to Bengal for economic, political, and cultural capital, indicating Bengal’s regional influence beyond its borders.",
        "• The Sultan of Bengal financed projects in the Hejaz region of Arabia, reflecting Bengal’s involvement in broader Islamic and regional affairs.",
        "• Under Mughal rule, Bengal became a center for the global muslin, silk, and pearl trades, with significant export and domestic markets.",
        "• Bengal supplied India with rice, silks, and cotton textiles, while Europeans depended on Bengali products such as cotton textiles, silks, and opium, with Bengal accounting for 40% of Dutch imports from Asia.",
        "• Bengal exported saltpeter to Europe, sold opium in Indonesia, exported raw silk to Japan and the Netherlands, and produced cotton and silk textiles for export to Europe, Indonesia, and Japan.",
        "• In the 18th century, Bengal’s real wages and living standards were comparable to Britain, which had the highest living standards in Europe at the time.",
        "• The most important center of cotton production during the Mughal era was Bengal, especially around Dhaka, leading to muslin being called \"daka\" in distant markets such as Central Asia.",
        "• Bengali agriculturalists rapidly adopted techniques of mulberry cultivation and sericulture, establishing Bengal as a major silk-producing region globally.",
        "• Bengal produced over 50% of textiles and approximately 80% of silks imported by the Dutch from Asia, underscoring its dominance in textile exports.",
        "• Bengal had a large shipbuilding industry, producing approximately 223,250 tons annually during the 16th and 17th centuries, vastly surpassing the 23,061 tons produced in nineteen North American colonies from 1769 to 1771.",
        "• The region was a center for ship repair and innovation, introducing advanced shipbuilding techniques such as the flushed deck design in Bengal rice ships, resulting in stronger, less leaky hulls.",
        "• The European East India Company later adopted Bengal’s flushed-deck and hull designs in the 1760s, significantly improving seaworthiness and navigation during the Industrial Revolution.",
        "• The Fakhruddin’s restaurant, one of the oldest businesses from the pre-colonial and Mughal periods, traces its history back to the era of the Nawabs of Bengal, illustrating enduring commercial legacy."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:32:40.253989",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 30
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 1
    },
    {
      "section_number": "0.2",
      "section_name": "Colonial period",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The _Barkentine Linnet_ was a ship built in Chittagong, off the coast of Hong Kong, around the year 1890.",
        "• The British East India Company took complete control of Bengal in 1793 by abolishing Nizamat, which was the system of local rule.",
        "• Following the company's assumption of control, Calcutta (now Kolkata) was developed as the primary commercial and administrative center for the Company-held territories in South Asia.",
        "• The development of East Bengal was largely limited to agriculture during the colonial period.",
        "• The administrative infrastructure of the late eighteenth and nineteenth centuries was primarily focused on East Bengal's role as an agricultural producer, mainly producing rice, tea, teak, cotton, sugarcane, and jute for processors and traders within the British Empire.",
        "• British rule introduced railways to Bengal, including the construction of the Hardinge Bridge, which was built to carry trains across the Padma River.",
        "• In the early 20th century, the British established Eastern Bengal and Assam as a separate administrative region to promote employment, education, and investment in East Bengal.",
        "• In 1928, the Port of Chittagong was officially declared a \"Major Port\" of British India.",
        "• East Bengal expanded its rice economy into the Arakan Division of British Burma.",
        "• The river and sea ports of East Bengal, including Goalundo Ghat, the Port of Dhaka, the Port of Narayanganj, and the Port of Chittagong, served as entrepots facilitating trade between Bengal, Assam, and Burma.",
        "• Several of Bangladesh’s oldest and most prominent companies originated during the British colonial period, including A K Khan & Company, M. M. Ispahani Limited, James Finlay Bangladesh, and Anwar Group of Industries."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:32:47.188832",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 2
    },
    {
      "section_number": "0.3",
      "section_name": "Pakistan period",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• In 1949, tannery owners in East Bengal collaborated with members of the Directorate of Industries, Government of East Bengal, highlighting early industrial activities in the region.",
        "• During the 1950s and 1960s, Adamjee Jute Mills was recognized as the largest jute processing plant in the world, symbolizing the prominence of the jute industry in East Pakistan.",
        "• The partition of India in 1947 significantly altered the economic geography of the region, leading East Bengal (later East Pakistan) to prioritize industries based on local raw materials such as jute, cotton, and leather.",
        "• The Korean War (1950-1953) increased global demand for jute products, positively impacting East Pakistan’s jute industry and contributing to industrial growth.",
        "• Adamjee Jute Mills was constructed in the Port of Narayanganj and served as a key symbol of East Pakistan's industrialization efforts during this period.",
        "• Living standards in East Pakistan began to improve gradually during the 1950s and 1960s, partly due to industrial development and labor reforms.",
        "• Labor reforms enacted in 1958 laid the groundwork for future industrial development in Bangladesh, which would eventually gain independence in 1971.",
        "• The government of East Pakistan generally accepted free market principles and promoted an industrial policy aimed at rapidly producing consumer goods to reduce reliance on imports.",
        "• Certain sectors, including public utilities, were under state ownership, reflecting a mixed approach to economic management.",
        "• Natural gas deposits in Sylhet were discovered by the Burmah Oil Company in 1955, marking an important development in the region’s natural resource sector.",
        "• By the late 1960s, East Pakistan’s share of Pakistan’s total exports declined from 70% to 50%, indicating economic disparities within the country.",
        "• Pakistan’s rulers launched a \"Decade of Development,\" which resulted in numerous economic and social contradictions, contributing to tensions leading to the separation of East Pakistan.",
        "• According to the World Bank, economic discrimination against East Pakistan included diverting foreign aid and other financial resources to West Pakistan, using East Pakistan’s foreign-exchange surpluses to finance West Pakistani imports, and central government refusal to release funds allocated to East Pakistan.",
        "• Rehman Sobhan paraphrased the Two-Nation Theory into the Two Economies Theory, arguing that East and West Pakistan diverged economically and functioned as two separate economies within a single country."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:32:53.535826",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 3
    },
    {
      "section_number": "0.3.1",
      "section_name": "Socialist era (1972–1975)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• After gaining independence from Pakistan, Bangladesh adopted a socialist economic model for a period of five years, which was later regarded as a strategic mistake by the Sheikh Mujibur Rahman-led Awami League government.",
        "• During Sheikh Mujibur Rahman's era, the country's development strategy heavily emphasized protectionism, involving extensive state intervention in the economy.",
        "• Private companies faced strict regulation and restrictions, including profit limits; companies exceeding these profit thresholds were susceptible to nationalization.",
        "• The government nationalized all banks, insurance companies, and 580 industrial plants, many of which had been abandoned by West Pakistanis during the Bangladesh Liberation War.",
        "• Many Bengali businesses and pro-Awami League enterprises also suffered from nationalization of properties and industries.",
        "• The Awami League initiated the construction of key industrial projects such as the Ghorashal Fertilizer Factory and the Ashuganj Power Station.",
        "• Despite restrictive policies, several prominent Bangladeshi companies were established during this period, notably BEXIMCO and Advanced Chemical Industries.",
        "• Land ownership was restricted to less than 25 bighas; landowners possessing more than 25 bighas were subjected to taxation.",
        "• Farmers were mandated to sell their agricultural products at government-set prices rather than through free market mechanisms.",
        "• The socialist economic framework resulted in slow development of entrepreneurial talent, managerial expertise, administrative capacity, engineering, and technical skills.",
        "• Foreign investment was minimal or virtually absent during this period.",
        "• The country faced critical shortages of essential food grains and staples, exacerbated by wartime disruptions.",
        "• Bangladesh lost its traditional export markets for jute due to supply instability and the rising popularity of synthetic substitutes.",
        "• Foreign exchange reserves were extremely limited, and the banking and monetary systems were unreliable.",
        "• Despite a large labor force, most workers were undertrained, underpaid, illiterate, unskilled, and underemployed.",
        "• The country lacked exploitable industrial resources beyond natural gas; other industrial commodities were scarce.",
        "• Inflation rates for essential consumer goods ranged between 300% and 400%.",
        "• The independence war severely damaged the transportation infrastructure, destroying or damaging hundreds of roads and railroad bridges, with rolling stock being inadequate and poorly maintained.",
        "• Bangladesh was still recovering from a devastating cyclone in 1970 that resulted in approximately 250,000 deaths.",
        "• India provided immediate and substantial economic assistance following Bangladesh’s independence, with aid totaling US$232 million between December 1971 and January 1972, sourced from US and USSR politico-economic aid."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:32:58.832274",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 20
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 4
    },
    {
      "section_number": "0.3.2",
      "section_name": "Military rule and economic reforms (1975–1990)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the coups in 1975, new Bangladeshi military leaders shifted focus from socialist policies to promoting private industry, aiming to develop new industrial capacity and rehabilitate the economy, which had suffered from inefficiency and stagnation under early socialist models.",
        "• Starting in late 1975, the government gradually increased private sector participation in the economy, a trend that has persisted since then.",
        "• After Lt. Gen. Ziaur Rahman seized power in 1975, a new economic strategy prioritized maximizing GNP growth through private enterprise development.",
        "• Zia's government revised the First Five-Year Plan (1973–1978), originally initiated by the Mujib government, and formulated a \"Three Year Hard Core Plan\" covering the remaining three years.",
        "• This was followed by the Two-Year Plan (1978–80) and the Second Five-Year Plan (1980–85).",
        "• The government established Export Processing Zones (EPZs) to attract foreign investment and promote export industries, which became instrumental in Bangladesh's export economy.",
        "• The government undertook de-nationalization and privatization of state-owned industries, either returning them to their original owners or selling them to private buyers, leading to increased inefficiency in the public sector.",
        "• Growing left-wing opposition emerged against the export of natural gas, reflecting domestic tensions over resource management.",
        "• The 1980s saw the rise of prominent local brands such as PRAN, indicating growing domestic industrial strength.",
        "• Muhammad Yunus began experimenting with microcredit in the late 1970s, culminating in the establishment of the Grameen Bank in 1983, making Bangladesh a pioneer in modern microcredit industry.",
        "• Leading microcredit organizations included Grameen Bank, BRAC, and Proshika, which contributed significantly to social and economic development.",
        "• In the mid-1980s, two key policy innovations supported exporters: the back-to-back letter of credit and duty-drawback facilities via bonded warehouses, which alleviated major constraints for the burgeoning garment industry.",
        "• These reforms enabled garment manufacturers to finance imports through letters of credit from domestic banks by referencing foreign buyer letters of credit, and to recover duties paid on imported inputs stored in bonded warehouses used for export production.",
        "• The implementation of these policies catalyzed the growth of Bangladesh’s textile sector, making it the world’s second-largest exporter of textiles.",
        "• During the mid-1980s, economic policies aimed at fostering private enterprise and investment, privatizing public industries, reinstating fiscal discipline, and liberalizing imports gained momentum.",
        "• The International Finance Investment and Commerce Bank was established as a multinational bank serving Bangladesh, Nepal, and the Maldives, supporting regional financial integration."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:33:07.501144",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 16
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 5
    },
    {
      "section_number": "0.3.3",
      "section_name": "Economic growth (1991–2022)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Jamuna Bridge, a significant infrastructure project in Bangladesh, was opened in 1998, enhancing connectivity across the country.",
        "• Between 1988 and 1998, Bangladesh expanded its rural road network from 3,000 km to 15,500 km, significantly improving rural accessibility and integration.",
        "• The construction of the Padma Bridge, another major infrastructure development, was completed in 2022, further facilitating transportation and economic growth.",
        "• From 1991 to 1993, the Bangladeshi government engaged in an enhanced structural adjustment facility (ESAF) with the International Monetary Fund (IMF), initiating economic reforms.",
        "• During the 1990s, a series of economic liberalization measures were introduced by Finance Minister Saifur Rahman, including opening sectors like telecommunications to foreign investment and establishing the Chittagong Stock Exchange.",
        "• The 1990s was a period of growth for Bangladesh’s private sector, with expansion in banking, telecommunications, aviation, and tertiary education sectors, leading to increased competition and private participation.",
        "• The pharmaceutical industry in Bangladesh grew to meet 98% of domestic demand, indicating a substantial development in healthcare manufacturing.",
        "• The ceramics industry developed to meet local demand for 96% of tableware ceramics, 77% of tiles, and 89% of sanitary ceramics, reflecting diversification in manufacturing sectors.",
        "• The steel industry, based in Chittagong, exploited scrap steel from ship-breaking yards and began contributing to shipbuilding activities within Bangladesh.",
        "• The government’s failure to sustain reforms was largely due to domestic political troubles, including tensions among the Awami League, Bangladesh Nationalist Party (BNP), and Jatiya Party, leading to frequent hartals and strikes that disrupted the economy.",
        "• In the late 1990s, economic policies became more entrenched, resulting in a decline in foreign direct investment (FDI) in 2000 and 2001.",
        "• Several new private commercial banks received licenses to operate during this period, expanding the banking sector.",
        "• Between 2001 and 2006, Bangladesh’s annual GDP growth averaged 5-6%, indicating steady economic expansion.",
        "• In June 2003, the IMF approved a three-year, $490 million plan under the Poverty Reduction and Growth Facility (PRGF) to support Bangladesh’s economic reforms until 2006, with $70 million provided immediately.",
        "• The World Bank also approved $536 million in interest-free loans to Bangladesh during this period.",
        "• Since 2009, Bangladesh experienced continuous real GDP growth of at least 6%, establishing it as one of the fastest-growing economies globally.",
        "• Economist Syed Akhtar Mahmood highlighted the government’s role in economic development, including infrastructure building, regulation liberalization, and promoting high-yield crops in agriculture.",
        "• From 1988 to 1997, Bangladesh expanded its feeder roads from about 3,000 km to 15,500 km, transforming rural connectivity and facilitating access throughout the year.",
        "• Historically, Bangladesh ran large trade deficits financed through aid receipts and remittances; however, foreign reserves dropped significantly in 2001 but stabilized in the US$3 to US$4 billion range, covering about three months of imports.",
        "• By January 2007, foreign reserves stood at $3.74 billion, increasing to $5.8 billion in January 2008, surpassing $10 billion in November 2009, and exceeding $12 billion as of April 2011 according to the Bank of Bangladesh.",
        "• Dependence on foreign aid and imports has decreased gradually since the early 1990s, with foreign aid now constituting only 2% of GDP.",
        "• Over the last decade, poverty reduced by approximately one-third, with significant improvements in human development indicators such as literacy, life expectancy, and per capita food consumption.",
        "• More than 15 million people have moved out of poverty since 1992, with the poverty rate declining from 80% in 1971 to 44.2% in 1991, and further down to 12.9% in 2021.",
        "• Bangladesh has focused on promoting regional trade and transport links, including the Bangladesh-Bhutan-India-Nepal Motor Vehicles Agreement to facilitate hassle-free cross-border road transport and a coastal shipping agreement with India.",
        "• The country exports over US$1 billion worth of processed food products, supported by a robust agricultural supply chain and the growth of supermarkets across cities and towns.",
        "• Bangladesh became the second-largest textile exporter globally, employing approximately 4.4 million workers, predominantly women, with the textile sector contributing 11% to GDP.",
        "• The 2013 Rana Plaza factory collapse drew international concern over industrial safety, leading to the formation of the Accord on Fire and Building Safety in Bangladesh and the Alliance for Bangladesh Worker Safety.",
        "• The local clothing industry features competitive brands such as Aarong, Westecs, Ecstasy, and Yellow.",
        "• The World Bank recognizes Bangladesh’s transformation since independence in 1971, when it was the second-poorest country, noting that poverty has been halved at a record pace and primary school enrollment is nearly universal.",
        "• Progress has been made in maternal and child health, female workforce participation, and resilience against climate change and natural disasters.",
        "• Bangladesh’s development success involves investments in human capital, macroeconomic stability, infrastructure, urban projects, energy, inland connectivity, and climate change adaptation.",
        "• As of 2022, Bangladesh held the second-largest foreign-exchange reserves in South Asia, surpassing India and Pakistan in per capita income in 2021.",
        "• The country achieved 100% electricity coverage for households in 2022.",
        "• Major infrastructure projects planned or underway include the Padma Bridge, Dhaka Metro, Matarbari Port, and Karnaphuli Tunnel, aimed at stimulating economic activity.",
        "• The completion of the Padma Bridge is projected to increase Bangladesh’s GDP by approximately 1.23%."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:33:26.611296",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 35
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 6
    },
    {
      "section_number": "0.3.4",
      "section_name": "Economic depression (2022–present)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Following the Russian invasion of Ukraine, Bangladesh experienced increased pressure on its foreign exchange reserves due to rising import costs, which adversely affected the country's economy.",
        "• The country's electricity sector, heavily reliant on imported fuel, was particularly impacted by the surge in import prices.",
        "• Rising import prices contributed to inflationary pressures within Bangladesh, with the IMF forecasting the Consumer Price Index (CPI) to rise to 5.9% by the year 2022.",
        "• According to the Bangladesh Bureau of Statistics, general inflation in Bangladesh increased to 6.17% by February 2022.",
        "• The Bangladeshi economy suffered significant losses of over $1.2 billion due to the nationwide curfew and protests during the mass uprising and subsequent violence in July–August 2024.",
        "• The World Bank, in its South Asia Development Update, revised Bangladesh’s economic growth forecast downward from 5.7% in April 2024 to 4% in October 2024 for the fiscal year 2025.",
        "• Political instability during this period exacerbated preexisting inflation issues, with food inflation reaching 14% and overall inflation at 11% under the interim government.",
        "• A sharp rise in inflation occurred in July 2024, primarily attributed to political turmoil; after a brief stabilization, inflation resumed its upward trend.",
        "• The general inflation rate in Bangladesh increased to 10.87% in November 2024, up from 9.92% in September 2024.",
        "• In November 2024, the International Crisis Group (ICG) indicated that early signs suggested policymakers might avoid a Sri Lanka-style economic collapse, citing exchange rate reforms that improved foreign reserves and a decline in inflation from its peak.",
        "• The ICG warned that serious economic risks remained and emphasized that long-term economic reforms would likely extend beyond the short-lived tenure of interim governments, which focused mainly on short-term macroeconomic priorities such as inflation, foreign reserves, and economic stability.",
        "• In April 2025, the Trump administration imposed a 37% \"reciprocal\" tariff on Bangladesh, making it the second highest in South Asia after Sri Lanka's 44%.",
        "• The New York Times described the tariff as a major blow to Bangladesh’s garments industry, with many US buyers halting orders due to the increased costs associated with import tariffs."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:33:33.881616",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 13
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 7
    },
    {
      "section_number": "1",
      "section_name": "Macro-economic trend",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section provides a chart illustrating the trend of Bangladesh's gross domestic product (GDP) at market prices, estimated by the International Monetary Fund (IMF), with figures expressed in millions of Bangladeshi Taka, reflecting only the formal sector of the economy.",
        "• The data spans from 1980 to 2019, highlighting significant economic growth over nearly four decades.",
        "• In 1980, Bangladesh's GDP was approximately 250,300 million Taka, with an exchange rate of 16.10 Taka per US dollar, an inflation index of 20 (with 2000 as the base year), and per capita income at 1.79% of the USA.",
        "• By 1985, GDP increased to 597,318 million Taka, with the exchange rate rising to 31.00 Taka per US dollar, inflation index at 36, and per capita income declining to 1.19% of the USA.",
        "• In 1990, GDP reached 1,054,234 million Taka, with the exchange rate at 35.79 Taka per US dollar, inflation index at 58, and per capita income at 1.16% of the USA.",
        "• The 1995 data shows GDP of 1,594,210 million Taka, an exchange rate of 40.27 Taka per US dollar, inflation index of 78, and per capita income at 1.12% of the USA.",
        "• In 2000, GDP was 2,453,160 million Taka, with an exchange rate of 52.14 Taka per US dollar, inflation index at 100 (the base year), and per capita income at 0.97% of the USA.",
        "• By 2005, GDP increased to 3,913,334 million Taka, with the exchange rate at 63.92 Taka per US dollar, inflation index at 126, and per capita income at 0.95% of the USA.",
        "• In 2008, GDP further grew to 5,003,438 million Taka, with an exchange rate of 68.65 Taka per US dollar and inflation index at 147; per capita income data for this year is not provided.",
        "• The 2015 data indicates a substantial rise in GDP to 17,295,665 million Taka, with an exchange rate of 78.15 Taka per US dollar, inflation index at 196, and per capita income at 2.48% of the USA.",
        "• In 2019, GDP reached approximately 26,604,164 million Taka, with an exchange rate of 84.55 Taka per US dollar, inflation index not specified, and per capita income at 2.91% of the USA.",
        "• The section notes that the mean wages in Bangladesh in 2009 were $0.58 per man-hour, indicating low average wages during that period."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:33:39.309104",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 8
    },
    {
      "section_number": "1.1",
      "section_name": "GDP per capita (nominal)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section details the historical evolution and projected future trends of Bangladesh's GDP per capita (nominal) from 1980 through 2030, based on data provided by the International Monetary Fund (IMF).",
        "• The data encompasses both past actual figures and forecasted estimates, illustrating the economic growth trajectory of Bangladesh over five decades.",
        "• In 1980, Bangladesh's GDP per capita (nominal) was significantly lower, reflecting the country's developing economic status at that time.",
        "• Throughout the 1980s and 1990s, the GDP per capita experienced gradual growth, driven by economic reforms, demographic changes, and increased industrialization.",
        "• The early 2000s marked a period of accelerated growth, with GDP per capita rising more rapidly due to increased investment, export expansion, and improvements in infrastructure.",
        "• By 2010, Bangladesh's GDP per capita (nominal) had increased substantially compared to 1980, indicating notable economic development.",
        "• The period from 2010 onward shows continued upward growth, with projections indicating sustained economic expansion into the 2020s and beyond.",
        "• The IMF forecasts that by 2025, Bangladesh's GDP per capita (nominal) will reach a certain high value (specific figure not provided in the excerpt), reflecting ongoing economic progress.",
        "• The projections extend to 2030, suggesting that Bangladesh's GDP per capita (nominal) will continue to grow, although at a potentially slower rate compared to previous decades.",
        "• The data underscores Bangladesh's transition from a low-income to a middle-income economy, emphasizing consistent growth in nominal terms over the analyzed period.",
        "• The section highlights the importance of IMF's role in providing authoritative economic data and forecasts that inform understanding of Bangladesh's economic development trajectory."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:33:45.620073",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 11
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 9
    },
    {
      "section_number": "1.2",
      "section_name": "GDP per capita (PPP)",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section presents a comprehensive overview of Bangladesh's GDP per capita (PPP) from 1980 to 2030, based on data from the International Monetary Fund (IMF).",
        "• The data covers main economic indicators for the years 1980–2021, with IMF staff estimates extending from 2022 to 2027.",
        "• The table highlights that inflation rates below 5% are indicated in green, emphasizing periods of relatively low inflation.",
        "• The annual unemployment rate figures are sourced from the World Bank, although the IMF considers these figures unreliable.",
        "• In 1980, Bangladesh's GDP (PPP) was $40.7 billion, with a GDP per capita (PPP) of $511.2, and a nominal GDP of $22.6 billion, with per capita nominal GDP at $283.3.",
        "• Throughout the 1980s, Bangladesh experienced steady growth in GDP (PPP), reaching $83.2 billion in 1989, with GDP per capita (PPP) increasing from $511.2 in 1980 to $826.6 in 1989.",
        "• The 1990s saw continued growth, with GDP (PPP) rising from $90.3 billion in 1990 to $145.7 billion in 1997, and GDP per capita (PPP) increasing from $875.5 to $1,212.5.",
        "• Notable economic growth periods include 2003–2007, where GDP (PPP) increased from $220.0 billion to $316.6 billion, and GDP per capita (PPP) from $1,632.0 to $2,219.5.",
        "• The global financial crisis period (2008–2009) saw GDP (PPP) growth slowing but still maintaining upward trends, reaching $360.9 billion in 2009, with GDP per capita (PPP) at $2,473.2.",
        "• The 2010s marked significant growth, with GDP (PPP) reaching $835.9 billion in 2018 and GDP per capita (PPP) rising to $5,370.4, reflecting rapid economic development.",
        "• From 2019 onwards, the GDP (PPP) continued to grow, reaching $1,170.1 billion in 2021, with GDP per capita (PPP) at $7,509.6, despite the COVID-19 pandemic impact.",
        "• The projections from 2022 to 2027 indicate sustained growth, with GDP (PPP) expected to increase from $1,348.6 billion in 2022 to $2,102.0 billion in 2027.",
        "• Correspondingly, GDP per capita (PPP) is projected to rise from $7,923.1 in 2022 to $11,851.0 in 2027, demonstrating ongoing improvements in individual economic well-being.",
        "• The annual GDP growth rate fluctuated over the decades, with notable peaks such as 8.2% in 2019 and consistent growth around 6–7% in the mid-2020s.",
        "• Inflation rates varied, with periods of low inflation (below 5%) in recent years, notably from 2012 onward, and higher inflation during the early 1980s and mid-2000s.",
        "• The inflation rate was 7.7% in 1980, peaked at 14.9% in 1981, and generally declined over the decades, reaching around 5–6% in the late 2010s and early 2020s.",
        "• The unemployment rate, although considered unreliable by the IMF, was approximately 2.2% in 1991, rising slightly to around 4.4% in recent years.",
        "• Government debt as a percentage of GDP decreased from 44.3% in 2003 to around 41.9% in 2007, then fluctuated slightly, reaching 42.8% in 2023, indicating relatively stable public debt levels."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:00.403347",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 18
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 10
    },
    {
      "section_number": "2",
      "section_name": "Economic sectors",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Bangladesh Bureau of Statistics categorizes the country's economy into 19 broad sectors, each contributing to the gross domestic product (GDP) for the fiscal year 2023-24.",
        "• The overall GDP contributions by sector are as follows: Agriculture (11.55%), Industry (35.27%), and Services (53.18%).",
        "• The Agriculture sector, encompassing agriculture, forestry, and fishing, accounts for 11.55% of GDP, indicating its role in the economy.",
        "• The Industry sector contributes a total of 35.27% to GDP, subdivided into:",
        "• Mining and quarrying, which contributes 1.53%.",
        "• Manufacturing, with a significant share of 22.65%.",
        "• Electricity, gas, steam, and air conditioning, contributing 1.23%.",
        "• Water supply, sewerage, and waste management, accounting for 0.10%.",
        "• Construction, which makes up 9.77% of GDP.",
        "• The Services sector constitutes the largest portion of GDP at 53.18%, divided into multiple subsectors:",
        "• Wholesale and retail trade; repair activities, contributing 15.10%.",
        "• Transportation and storage, with a 7.43% share.",
        "• Accommodation and food service activities, at 1.23%.",
        "• Information and communication, accounting for 1.04%.",
        "• Financial and insurance activities, contributing 3.32%.",
        "• Real estate activities, which make up 8.48%.",
        "• Professional, scientific, and technical activities, at 0.20%.",
        "• Administrative and support service activities, contributing 0.92%.",
        "• Public administration and defence, accounting for 3.34%.",
        "• Education sector, with a 3.04% contribution.",
        "• Human health and social works activities, comprising 3.85%.",
        "• Arts, entertainment, and recreation, with a minimal share of 0.16%.",
        "• Other service activities, contributing 5.07%."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:07.657965",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 23
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 11
    },
    {
      "section_number": "2.1",
      "section_name": "Agriculture",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The development of major agricultural products in Bangladesh is closely linked to the expansion of watercourses such as canals, both natural and manmade, and rivers, which serve as vital sources of irrigation across the country.",
        "• The spread of irrigation infrastructure is considered a key factor for the economic and geographic extent of agriculture in Bangladesh.",
        "• An example of irrigation development is observed in Comilla, where a pump extracts water from the Gumti River to facilitate agricultural activities.",
        "• Agriculture is the largest employment sector in Bangladesh, accounting for 14.2 percent of the country's GDP in 2017 and employing approximately 42.7 percent of the workforce.",
        "• As of the financial year 2022–2023, the agricultural sector contributed to more than 12% of Bangladesh’s GDP.",
        "• The sector has a significant impact on macroeconomic objectives such as employment generation, poverty alleviation, human resource development, food security, and broader economic and social development.",
        "• The majority of Bangladeshis derive their livelihoods from agriculture, which remains a labor-intensive sector.",
        "• Despite often unfavorable weather conditions, Bangladesh’s agriculture has achieved steady increases in food grain production, attributed to improved flood control, irrigation, efficient fertilizer use, and enhanced distribution and rural credit networks.",
        "• While rice and jute are the primary crops, maize and vegetables are gaining importance due to expanding irrigation networks.",
        "• Some wheat producers have shifted to maize cultivation, primarily used as poultry feed, reflecting crop diversification driven by irrigation expansion.",
        "• Tea cultivation occurs in the northeast region, with Bangladesh hosting 166 tea estates covering nearly 280,000 acres.",
        "• Bangladesh ranks as the 9th largest tea producer globally, contributing approximately 2% to the world’s tea production.",
        "• The country’s fertile soil and ample water supply enable rice to be grown and harvested three times annually in many areas.",
        "• Bangladesh is among the top global producers of rice (third), potatoes (seventh), tropical fruits (sixth), jute (second), and farmed fish (fifth).",
        "• Rice is the principal crop, with a production of 35.8 million metric tons in 2000, and is projected to exceed 37.7 million metric tons in 2024, representing an increase of nearly 700,000 tons from the previous year.",
        "• Bangladesh produces approximately 5 metric tons of rice per hectare, ensuring self-sufficiency in rice production.",
        "• In 1999, wheat production was about 1.9 million tonnes, indicating a smaller scale compared to rice.",
        "• Population pressure exerts a severe burden on Bangladesh’s productive capacity, sometimes leading to food deficits, especially in wheat, which is supplemented through foreign assistance and imports.",
        "• Underemployment remains a critical issue, with concerns about the agricultural sector’s capacity to absorb additional labor, particularly as landless peasants, who constitute about half of the rural labor force, increase in number.",
        "• Environmental challenges impacting agriculture include insecticide use, water management issues, pollution, and land degradation.",
        "• Bangladesh is highly vulnerable to climate change, with extreme weather events and temperature fluctuations significantly affecting agricultural conditions.",
        "• Adaptation strategies for the agricultural sector are a major policy concern in addressing climate change impacts in Bangladesh."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:20.692958",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 12
    },
    {
      "section_number": "2.2",
      "section_name": "Manufacturing and industry",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The private ready-made garment (RMG) industry in Bangladesh experienced rapid growth during most of the 1990s, with double-digit annual growth rates, creating numerous new jobs, predominantly for women.",
        "• By the late 1990s, approximately 1.5 million people, mainly women, were employed in the garments sector, along with employment in leather products, especially footwear manufacturing.",
        "• During 2001–2002, export earnings from Bangladesh’s ready-made garments reached $3,125 million, accounting for 52% of the country’s total exports.",
        "• Bangladesh surpassed India in apparel exports in 2009, with exports valued at $2.66 billion US dollars, ahead of India’s $2.27 billion US dollars; by 2014, monthly apparel exports rose to $3.12 billion US dollars.",
        "• In the fiscal year 2018, Bangladesh earned $36.67 billion US dollars from exports of manufactured goods, with 83.49% of this revenue derived from the apparel manufacturing sector.",
        "• Historically, Eastern Bengal was renowned for its fine muslin and silk fabrics before British colonization, with dyes, yarn, and cloth highly valued globally; Bengali muslin, silk, and brocade were worn by aristocrats across Asia and Europe.",
        "• The advent of machine-made textiles from England in the late 18th century led to the decline of traditional handloom industries, causing cotton cultivation in East Bengal to diminish and the textile industry to become dependent on imported yarn, leaving only remnants of the once-thriving cottage industry.",
        "• Other rapidly growing sectors in Bangladesh include pharmaceuticals, shipbuilding, information technology, leather, steel, and light engineering industries.",
        "• As of 27 April 2024, Bangladesh’s pharmaceutical industry is nearly self-sufficient among the 48 least-developed countries, with local companies meeting 98% of domestic demand; the industry comprises 213 pharmaceutical companies and has an average annual growth rate of 12%.",
        "• Nine Bangladeshi drug manufacturers have received regulatory approvals from the United States, European Union, Australia, and the World Health Organization, and the sector exports products to approximately 150 countries.",
        "• Bangladesh’s textile industry, encompassing knitwear, ready-made garments, and specialized textile products, is the country’s leading export sector, earning $21.5 billion in 2013, which constitutes 80% of total exports of $27 billion; it ranks second globally in textile exports after China, which exported $120.1 billion worth of textiles in 2009.",
        "• The textile industry employs nearly 3.5 million workers; since 2004, exports have doubled, but wages in Bangladesh’s textile sector were the lowest worldwide as of 2010.",
        "• Bangladesh was considered a significant competitor to China in textiles due to its low wages and currency stability, although wages remained low for the 3 million employed in 2012, amid increasing labor unrest despite government efforts.",
        "• The urban garment industry has created over one million formal sector jobs for women, significantly contributing to high female labor participation; despite concerns about unsafe working conditions and low wages, employment in this sector provides women with earning opportunities, enabling them to send remittances and improve their social status.",
        "• The passage of the 1993 Harkins Bill (Child Labor Deterrence Bill) led to the dismissal of approximately 50,000 children from factories, pushing them into unregulated informal sectors such as brick-breaking, domestic work, and rickshaw pulling.",
        "• While working conditions in garment factories are not ideal, employment provides women with more reliable income than other occupations and enhances their economic independence, allowing for greater spending, saving, and investment.",
        "• Employed women, both married and unmarried, tend to marry later, have lower fertility rates, and attain higher levels of education compared to women in other sectors.",
        "• Following significant labor unrest in 2006, the Bangladeshi government established a Minimum Wage Board with representatives from business and labor; in 2006, the minimum wage was set at 1,662.50 taka ($24) per month, up from Tk950.",
        "• In June 2010, amidst widespread protests involving 60,000 workers, a proposal was considered to raise the minimum wage to approximately $50 per month, though this was still below workers’ demands of 5,000 taka ($72), with textile manufacturers advocating for wages below $30.",
        "• On 28 July 2010, the minimum entry-level wage was officially increased to 3,000 taka (~$43).",
        "• Ex-Prime Minister Khaleda Zia, on 21 September 2006, urged textile firms to ensure worker safety by complying with international labor laws during the inauguration of BATEXPO.",
        "• Western multinational companies utilize Bangladesh’s low-cost labor, where wages are around 30 euros per month, compared to 150–200 euros in China; a CEO of a top five global textile brand can earn in four days what a Bangladeshi garment worker earns in her lifetime.",
        "• The Rana Plaza factory collapse in April 2013 resulted in at least 1,135 deaths; other major industrial accidents include the 2005 factory collapse killing 64 people, fires in 2006 killing 85 and injuring 207, and fires in 2010 causing about 30 deaths.",
        "• In 2006, a large-scale strike movement involved tens of thousands of workers across nearly all of Bangladesh’s 4,000 garment factories; the Bangladesh Garment Manufacturers and Exporters Association (BGMEA) responded with police repression, resulting in three worker deaths, hundreds wounded or imprisoned.",
        "• In 2010, after another major strike, nearly 1,000 workers were injured due to government repression efforts."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:33.470704",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 25
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 13
    },
    {
      "section_number": "2.3",
      "section_name": "Shipbuilding and shipbreaking",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The _BNS Durgam_ is a naval vessel constructed in Bangladesh, exemplifying the country's emerging shipbuilding capabilities.",
        "• Shipbuilding is a rapidly expanding industry in Bangladesh with significant growth potential, positioning the country as a notable player in the sector.",
        "• Bangladesh has been compared to major shipbuilding nations such as China, Japan, and South Korea due to its industry growth and export success.",
        "• Experts highlight that, owing to increasing export deals and the availability of low-cost labor, Bangladesh could become a major competitor in the global market for small to medium-sized ocean-going vessels.",
        "• Bangladesh hosts the world's largest shipbreaking industry, which employs over 200,000 Bangladeshis, reflecting its critical role in the global shipbreaking sector.",
        "• The shipbreaking industry in Bangladesh accounts for 50% of all steel used in the country, underscoring its importance to the national economy.",
        "• The Chittagong Ship Breaking Yard is the second-largest shipbreaking facility in the world, emphasizing Bangladesh’s prominence in this industry.",
        "• Khulna Shipyard Limited (KSY), with over fifty years of experience, is the leading shipbuilding enterprise in Bangladesh, known for its extensive reputation and diverse ship production.",
        "• KSY has built a wide range of ships for both domestic and international clients, demonstrating its versatility and capacity.",
        "• The shipyard has constructed vessels for key Bangladeshi defense forces, including the Bangladesh Navy, Bangladesh Army, and Bangladesh Coast Guard, under contracts with the Ministry of Defence."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:38.898523",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 14
    },
    {
      "section_number": "2.4",
      "section_name": "Finance",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Most banks in Bangladesh are privately owned, reflecting a significant shift from the historical dominance of state-owned banks.",
        "• Until the 1980s, the financial sector of Bangladesh was primarily dominated by state-owned banks.",
        "• A major financial reform in Bangladesh involved the privatization of banks, leading to the establishment of private commercial banks.",
        "• The second major reform program in the financial sector was launched between 2000 and 2006, focusing on the development of financial institutions and the implementation of risk-based regulations and supervision.",
        "• Bangladesh Bank, the central bank, played a key role in adopting risk-based regulations and supervision during this reform period.",
        "• As of the current date, the banking sector in Bangladesh comprises 4 State-Owned Commercial Banks (SCBs).",
        "• The sector also includes 4 government-owned specialized banks that focus on development financing.",
        "• There are 39 private commercial banks operating within Bangladesh.",
        "• Additionally, the banking sector includes 9 foreign commercial banks operating in the country."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:41.979010",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 15
    },
    {
      "section_number": "2.5",
      "section_name": "Tourism",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The World Travel and Tourism Council (WTTC) reported in 2013 that in 2012, the travel and tourism industry in Bangladesh directly generated 1,281,500 jobs, accounting for 1.8 percent of the country's total employment, ranking Bangladesh 157th out of 178 countries worldwide.",
        "• Including both direct and indirect employment, the industry supported a total of 2,714,500 jobs, representing 3.7 percent of Bangladesh's total employment.",
        "• The WTTC projected that by 2023, the travel and tourism sector in Bangladesh would directly generate 1,785,000 jobs and support an overall total of 3,891,000 jobs, which would constitute 4.2 percent of the country's total employment.",
        "• The forecasted growth rate for direct travel and tourism jobs from 2012 to 2023 is 2.9 percent annually.",
        "• In 2012, domestic spending accounted for 97.7 percent of the direct gross domestic product (GDP) generated by the travel and tourism industry in Bangladesh.",
        "• Bangladesh's global ranking in 2012 for the direct contribution of travel and tourism to GDP, as a percentage of the national GDP, was 142nd out of 176 countries.",
        "• In 2014, Bangladesh received 125,000 tourists, a figure considered extremely low relative to the total population.",
        "• As of 22 May 2019, Bangladesh's total local population was approximately 166,594,000 inhabitants.",
        "• The ratio of tourists to locals in Bangladesh as of 2019 was approximately 1 tourist for every 1,333 residents."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:50.681470",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 9
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 16
    },
    {
      "section_number": "2.6",
      "section_name": "Information and communication technology",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Bangladesh's information technology sector has experienced significant growth over the past three years, indicating rapid development and expansion.",
        "• As of June 2017, Bangladesh has approximately 80 million internet users, reflecting a substantial digital adoption within the country.",
        "• The growth rate of internet use in Bangladesh was estimated at 9% by June 2017, primarily driven by the proliferation of mobile internet services.",
        "• The country has an active user base of about 23 million on Facebook, highlighting the platform's popularity and social media engagement in Bangladesh.",
        "• Bangladesh's mobile telecommunications sector serves approximately 143.1 million mobile phone subscribers, demonstrating widespread mobile connectivity.",
        "• In the fiscal period ending 30 June 2017, Bangladesh exported software, games, outsourcing, and IT services valued at $800 million to various international markets.",
        "• The primary export destinations for Bangladesh’s IT sector include European countries, the United States, Canada, Russia, and India, indicating a diverse and globalized market presence."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:54.470630",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 7
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 17
    },
    {
      "section_number": "3",
      "section_name": "Investment",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The stock market capitalization of the Dhaka Stock Exchange in Bangladesh surpassed $10 billion in November 2007.",
        "• It reached $30 billion in 2009, and further increased to $50 billion in August 2010.",
        "• During the global recession between 2007 and 2010, Bangladesh's stock market was the best performing in Asia, attributed to its relatively low correlations with developed country stock markets.",
        "• Significant investment in real estate by both domestic and foreign-resident Bangladeshis has resulted in a substantial building boom in Dhaka and Chittagong.",
        "• In 2011, Saudi Arabia aimed to secure public and private investments in Bangladesh's oil and gas, power, and transportation projects.",
        "• The United Arab Emirates (UAE) expressed keen interest in investing in Bangladesh's growing shipbuilding industry, motivated by its cost advantages.",
        "• Tata, an India-based leading industrial multinational, planned to invest Taka 1500 crore to establish an automobile industry in Bangladesh.",
        "• The World Bank committed to investing in rural roads to improve the quality of life in Bangladesh.",
        "• Rwandan entrepreneurs showed interest in investing in Bangladesh’s pharmaceuticals sector, recognizing its potential in the international market.",
        "• Samsung sought to lease 500 industrial plots from the Export Zones Authority to establish an electronics hub in Bangladesh, with an investment of US$1.25 billion.",
        "• The National Board of Revenue (NBR) announced plans to withdraw tax rebate facilities on investments in the capital market by individual taxpayers starting from the fiscal year 2011–12.",
        "• In 2011, the Japan Bank for International Cooperation ranked Bangladesh as the 15th best investment destination for foreign investors."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:34:59.590925",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 18
    },
    {
      "section_number": "3.1",
      "section_name": "2010–11 market crash",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• During 2010, Bangladesh's capital market experienced a significant shift from a bullish to a bearish trend.",
        "• The market index declined by 1,800 points between December 2010 and January 2011, indicating a sharp downturn.",
        "• The market crash resulted in millions of investors being rendered bankrupt, highlighting the widespread financial impact.",
        "• The crash is widely believed to have been artificially manipulated to benefit a small group of market players.",
        "• The manipulation allegedly occurred at the expense of larger, more established investors, suggesting a distortion of fair market practices during this period."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:01.703410",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 5
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 19
    },
    {
      "section_number": "3.2",
      "section_name": "Companies",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The section provides a list of the ten largest Bangladeshi companies by their trading value in 2018, measured in millions of Bangladeshi Taka (BDT).",
        "• The data reflects the trading values at the Dhaka Stock Exchange, highlighting the prominence of these companies within the Bangladeshi economy during that year.",
        "• Square Pharmaceuticals Limited ranked as the largest company by trading value, with a total of 449.8880 million BDT, and is listed under the trading name SQURPHARMA. Its headquarters is located in Dhaka, and it operates within the pharmaceuticals industry.",
        "• Dragon Sweater and Spinning Limited, trading as DSSL, held the second position with a trading value of 129.4030 million BDT; it is based in Dhaka and operates in the apparel industry.",
        "• Ifad Autos Limited, known as IFADAUTOS, ranked third with a trading value of 117.5370 million BDT, headquartered in Dhaka, and functions within the automotive industry.",
        "• Grameenphone Private Limited, trading as GP, was the fourth largest company with a trading value of 106.8660 million BDT; it is a telecommunications provider headquartered in Dhaka.",
        "• Bangladesh Thai Aluminium Ltd, trading as BDTHAI, had a trading value of 99.7690 million BDT, is based in Dhaka, and operates in the manufacturing sector.",
        "• City Bank Limited, with the trading name CITYBANK, recorded a trading value of 78.6010 million BDT; it is a banking institution headquartered in Dhaka.",
        "• Golden Harvest, trading as GHAIL, had a trading value of 76.6710 million BDT; it is involved in agriculture and is based in Dhaka.",
        "• IPDC Finance Limited, known as IPDC, ranked ninth with a trading value of 67.0430 million BDT; it provides financial services and is headquartered in Dhaka.",
        "• Olympic Industries Limited, trading as OLYMPIC, had a trading value of 60.5570 million BDT; it operates within the manufacturing sector and is based in Dhaka.",
        "• Shahjalal Islami Bank Limited, trading as SHAHJABANK, recorded a trading value of 53.1710 million BDT; it is a banking institution headquartered in Dhaka."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:08.398483",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 12
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 20
    },
    {
      "section_number": "3.3",
      "section_name": "Composition of economic sectors",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The Bangladesh Garments Manufacturers and Exporters Association (BGMEA) predicted that textile exports would increase from US$7.90 billion in 2005–06 to US$15 billion by 2011, reflecting sector optimism.",
        "• This positive outlook is partly based on the sector’s strong performance following the end of textile and clothing quotas under the Multifibre Agreement in early 2005.",
        "• According to a United Nations Development Programme report titled \"Sewing Thoughts: How to Realize Human Development Gains in the Post-Quota World,\" Bangladesh successfully offset declining European sales by developing new markets in the United States.",
        "• In 2005, Bangladesh experienced significant growth in textiles, with the quota-free textile regime providing a substantial boost to factories, as stated by BGMEA president S.M. Fazlul Hoque.",
        "• The sector achieved a 24 percent growth rate in 2005–06, as reported by S.M. Fazlul Hoque.",
        "• The Bangladesh Knitwear Manufacturers and Exporters Association (BKMEA) president Md Fazlul Hoque also expressed optimism, attributing the sector’s success to product quality and price competitiveness.",
        "• Knitwear experienced the strongest growth among textile products in 2005–06, increasing by 35.38 percent to US$2.82 billion.",
        "• Despite growth, the sector faced challenges due to sharp declines in global textile prices, making large volume increases necessary for profitability.",
        "• Bangladesh’s efforts to expand textile trade were supported by US and EU caps on Chinese textile imports, which restricted Chinese growth to 12.5 percent in the subsequent year and between 15 and 16 percent in 2008 under US limits, with similar EU restrictions until 2008.",
        "• These import restrictions are expected to benefit Bangladesh over the next two years, although falling global textile prices have shifted focus toward increasing wages to boost market share.",
        "• To attract investment, Bangladesh offers incentives such as 10-year tax holidays, duty-free import of capital goods, raw materials, and building materials, exemptions on income tax for foreign nationals’ salaries for three years, and dividend tax exemptions during the tax holiday.",
        "• Goods produced in Export Processing Zones (EPZs) can be exported duty-free, and Bangladesh benefits from the Generalised System of Preferences (GSP) in US, European, and Japanese markets, as well as Most Favoured Nation (MFN) status from the United States.",
        "• There is no investment ceiling in Bangladesh’s EPZs, and profits can be fully repatriated.",
        "• Labour unions are prohibited within EPZs, and strikes are not allowed.",
        "• Bangladesh has been a global leader in efforts to eliminate child labour in garment factories, signing a memorandum of understanding on 4 July 1995 with the International Labour Organization and UNICEF; by the end of 1999, child labour in the garment sector had been virtually eliminated.",
        "• The country’s shipbreaking industry has developed into a major source of domestic steel, meeting most of Bangladesh’s steel needs.",
        "• Other key industries include sugar, tea, leather goods, newsprint, pharmaceuticals, and fertilizers.",
        "• The government actively seeks foreign investment, particularly in private power generation, gas exploration and production, cellular telephony, textiles, and pharmaceuticals.",
        "• In 1989, Bangladesh signed a bilateral investment treaty with the United States and established a Board of Investment to streamline procedures, though the impact on increasing investment has been limited.",
        "• The Bangladesh Export Processing Zone Authority (BEPZA) manages multiple EPZs located in Adamjee, Chittagong, Comilla, Dhaka, Ishwardi, Karnaphuli, Mongla, and Uttara, with a proposed EPZ in Sylhet.",
        "• The government has authorized the private sector to develop and operate competing EPZs, with initial construction of a Korean EPZ starting in 1999.",
        "• In June 1999, the AFL–CIO petitioned the U.S. government to revoke Bangladesh’s Generalized System of Preferences (GSP) access due to concerns over the country’s failure to uphold commitments made in 1992 regarding freedom of association in EPZs."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:22.630777",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 22
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 21
    },
    {
      "section_number": "4",
      "section_name": "International trade",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Chittagong port is recognized as the busiest port on the Bay of Bengal, serving as a critical hub for Bangladesh’s maritime trade activities.",
        "• The COVID-19 pandemic has significantly impacted Bangladesh’s economy, causing widespread disruptions across various sectors.",
        "• During the fiscal year 2019-2020 (FY2019-20), exports declined by 16.93 percent, reflecting a substantial reduction in international trade volume.",
        "• In the same period, imports decreased by 17 percent, indicating a notable contraction in Bangladesh’s import activities.",
        "• In 2015, Bangladesh’s leading exports included Non-Knit Men's Suits valued at $5.6 billion, Knit T-shirts at $5.28 billion, Knit Sweaters at $4.12 billion, Non-Knit Women's Suits at $3.66 billion, and Non-Knit Men's Shirts at $2.52 billion.",
        "• The top imports for Bangladesh in 2015 comprised Heavy Pure Woven Cotton ($1.33 billion), Refined Petroleum ($1.25 billion), Light Pure Woven Cotton ($1.12 billion), Raw Cotton ($1.01 billion), and Wheat ($900 million).",
        "• In 2015, Bangladesh’s primary export destinations were the United States ($6.19 billion), Germany ($5.17 billion), the United Kingdom ($3.53 billion), France ($2.37 billion), and Spain ($2.29 billion).",
        "• The main sources of imports for Bangladesh in 2015 were China ($13.9 billion), India ($5.51 billion), Singapore ($2.22 billion), Hong Kong ($1.47 billion), and Japan ($1.36 billion)."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:26.421341",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 8
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 22
    },
    {
      "section_number": "5",
      "section_name": "Bangladeshi women and the economy",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• As of 2014, female participation in Bangladesh's labour force was 58 percent according to World Bank data, while male participation was significantly higher at 82 percent.",
        "• The participation of women in the Bangladeshi politics and economy has improved drastically due to efforts by both government and non-governmental organizations such as CARE International.",
        "• A 2007 World Bank report indicated that the most significant increases in women's workforce participation occurred in the sectors of agriculture, education, health, and social work.",
        "• Over three-quarters of women in the Bangladeshi labour force are employed in the agricultural sector.",
        "• The International Labour Organization reports that between 2000 and 2005, women's workforce participation increased primarily in professional and administrative sectors, indicating greater involvement in fields requiring higher education.",
        "• Labour force participation and employment data from the World Bank, United Nations, and ILO often underreport women's work due to the prevalence of unpaid labour and employment in informal sectors.",
        "• Women in the workforce generally work in paid sectors but face significantly different conditions than men, including disparities in wages and work benefits.",
        "• Women’s wages are substantially lower than men's for equivalent jobs, with women earning approximately 60–75 percent less than men.",
        "• Non-Governmental Organizations (NGOs) play a role in improving female conditions by encouraging women to rely on their own savings rather than external funds, thereby increasing their decision-making power and participation within family and society.",
        "• Some NGOs focus on microeconomic issues at the family level but often fail to address broader macroeconomic barriers that hinder women's full autonomy and advancement."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:33.079303",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 10
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 23
    },
    {
      "section_number": "6",
      "section_name": "Historical statistics",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• Since gaining independence in 1971, Bangladesh has experienced notable progress in its economic sector performance.",
        "• The economic improvements were particularly significant during the 1990s, although challenges remain in the realm of foreign trade within South Asia.",
        "• Major obstacles to economic growth include the inefficiency of state-owned enterprises (citation needed), a rapidly expanding labor force that exceeds agricultural absorption capacity, inadequate power supplies, and sluggish implementation of economic reforms.",
        "• Despite these challenges, Bangladesh has made progress in creating a more favorable environment for foreign investors and in liberalizing its capital markets.",
        "• Specific initiatives include negotiations with foreign firms for oil and gas exploration, improvements in the distribution of cooking gas across the country, and the initiation of construction projects for natural gas pipelines and power stations.",
        "• Progress on broader economic reforms has been inconsistent, hindered by opposition from bureaucracy, public sector unions, and other vested interest groups.",
        "• The severe floods of 1998 significantly increased foreign aid inflows to Bangladesh.",
        "• The 2008 global financial crisis did not substantially impact Bangladesh’s economy.",
        "• Foreign aid has gradually declined over recent decades, which economists interpret as a positive sign indicating increased self-reliance.",
        "• The country has experienced dramatic growth in exports and remittance inflows, contributing to steady economic expansion.",
        "• Bangladesh’s Gross Domestic Product (GDP) is projected to grow by 5.3% in 2023 and by 6.5% in 2024, according to the latest Asian Development Bank (ADB) report.",
        "• Bangladesh has been classified as a Least Developed Country (LDC) by the United Nations since 1975.",
        "• In March 2018, Bangladesh met the criteria to be recognized as a developing country, with a Gross National Income (GNI) of US$1,724 per capita, a Human Assets Index (HAI) of 72, and an Economic Vulnerability Index (EVI) of 25.2.",
        "• The country's GNI is forecasted to reach approximately US$4,753.39 per capita by 2030."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:38.405399",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 24
    },
    {
      "section_number": "6.1",
      "section_name": "Gross export and import",
      "chapter_name": "Economy of Bangladesh",
      "chapter_id": "1",
      "openai_summarised_points": [
        "• The data covers Bangladesh's gross export, import, and foreign remittance earnings over multiple fiscal years, with specific figures provided in billion US dollars.",
        "• For the fiscal year 2007–2008, Bangladesh's total exports were valued at $14.11 billion, total imports at $25.21 billion, and foreign remittance earnings at $8.9 billion.",
        "• In 2008–2009, exports increased to $15.56 billion, imports decreased to $22.51 billion, and remittance earnings rose to $9.68 billion.",
        "• During 2009–2010, exports further grew to $16.7 billion, imports to $23.83 billion, and remittance earnings to $10.87 billion.",
        "• The fiscal year 2010–2011 saw exports reach $22.93 billion, imports at $32 billion, and remittance earnings at $11.65 billion.",
        "• In 2011–2012, exports increased to $24.30 billion, imports to $35.92 billion, and remittance earnings to $12.85 billion.",
        "• The 2012–2013 period recorded exports of $27.09 billion, imports of $34.09 billion, and remittance earnings of $14.4 billion.",
        "• For 2013–2014, exports were $30.10 billion, imports slightly decreased to $34.08 billion, and remittance earnings were $14.2 billion.",
        "• In 2014–2015, exports rose marginally to $31.014 billion, imports significantly increased to $47.260 billion, and remittance earnings were $14.23 billion.",
        "• The 2015–2016 fiscal year saw exports grow to $33.661 billion, imports to $49.436 billion, and remittance earnings decreased slightly to $13.60 billion.",
        "• During 2016–2017, exports reached $37.966 billion, imports surged to $59.561 billion, and remittance earnings declined to $12.76 billion.",
        "• In 2017–2018, exports were $37.612 billion, imports increased to $67.133 billion, and remittance earnings rose to $15.31 billion.",
        "• The 2018–2019 fiscal year recorded exports at $41.53 billion, imports at $68.103 billion, and remittance earnings at $14.98 billion.",
        "• Overall, Bangladesh experienced a consistent upward trend in exports and imports over the years, with notable increases in both categories, while remittance earnings showed fluctuations but remained a significant source of foreign income."
      ],
      "metadata": {
        "processed_timestamp": "2025-07-31T18:35:48.177698",
        "openai_model": "gpt-4.1-nano-2025-04-14",
        "bullet_points_count": 14
      },
      "source_file": "economy_of_bangladesh.json",
      "original_index": 25
    }
  ]
}